[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百二",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 202",
        "source": "T06n0220_226:0134a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六",
        "translation": "sixteen",
        "source": "T06n0220_226:0134a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T06n0220_226:0134a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分難信解品第三十四之四十五",
        "translation": "Chapter 34-45 of the First Part of the Nāgârjuna Verses",
        "source": "T06n0220_226:0134a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_226:0134a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the prajñāpāramitā of generosity is purified, and because the prajñāpāramitā of generosity is purified, the cognition of omniscience is purified.",
        "source": "T06n0220_226:0134a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the prajñāpāramitā of generosity is purified, and if the cognition of all things is purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because the pure morality and even the perfection of wisdom are purified that the cognition of all things is purified.",
        "source": "T06n0220_226:0134a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the pure precepts and even the prajñāpāramitā are purified, and if omniscience is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0134a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if internal emptiness is purified, and if omniscience and cognition are purified, there's no duality, no dichotomy, no distinction, and no elimination.",
        "source": "T06n0220_226:0134a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, dispersed emptiness, immutable emptiness, intrinsic emptiness, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness are purified, and because external emptiness and even natureless self-nature emptiness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0134a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if external emptiness or even the emptiness of a natureless self-nature is purified, and if the knowledge of all cognitions is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, true thusness is purified, and because true thusness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if true thusness is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no elimination.",
        "source": "T06n0220_226:0134a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，法界乃至不思議界清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that the Dharma realm, Dharma nature, not-falsely nature, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the inconceivable realm are purified, and because the Dharma realm and even the inconceivable realm are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0134b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the Dharma realm and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134b08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134b09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the noble truth of suffering is purified, and if omniscience and cognition are purified, there's no duality, no dichotomy, no distinction, and no elimination.",
        "source": "T06n0220_226:0134b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "If the four formless concentrations are purified, then the noble truths of arising, ceasing, and the path are purified, and if the noble truths of arising, ceasing, and the path are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0134b11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the noble truths of arising, cessation, and the path are purified, and if omniscience and knowledge are purified, there are no dualities, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134b13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134b15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134b15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the four meditations are purified, and if omniscience is purified, it's because there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0134b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故四無量清淨，四無量清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the four immeasurable concentrations are purified, and because the four immeasurable concentrations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若四無量清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the four immeasurable concentrations are purified, and if omniscience and cognition are purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the eight liberations are purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that the eight abodes of liberation, the nine subordinate concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine subordinate concentrations, and the ten universal abodes are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0134b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the four abodes of mindfulness are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no interruptions.",
        "source": "T06n0220_226:0134c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "If the four formless concentrations are purified, then the four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are purified, and if the four correct eliminations and even the eight noble factors of the path are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0134c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the four correct eliminations and even the eight noble factors of the path are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the gate of the liberation of emptiness is purified, and because the gate of the liberation of emptiness is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_226:0134c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the liberation gate of emptiness is purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that the liberation gate of signlessness and wishlessness is purified, and because the liberation gate of signlessness and wishlessness is purified that the cognition of all existences is purified.",
        "source": "T06n0220_226:0134c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the liberation gate of signlessness and wishlessness is purified, and if the knowledge of omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the bodhisattvas' ten stages are purified, and because the bodhisattvas' ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the bodhisattva's ten stages are purified, and if omniscience and cognition are purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the five eyes are purified, and if omniscience is purified, there's no duality, no dichotomy, no distinction, and no elimination.",
        "source": "T06n0220_226:0134c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "If the four formless concentrations are purified, the six supernormal powers are purified, and if the six supernormal powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0134c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0134c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the six supernormal powers are purified, and if omniscience and cognition are purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0134c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0134c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the Buddha's ten powers are purified, and if the wisdom of omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 Buddha-unequivalent qualities are purified, and because the four fearlessnesses and 18 Buddha-unequivalent qualities are purified that the wisdom of omniscience is purified.",
        "source": "T06n0220_226:0135a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the four fearlessnesses up to the 18 buddha-principles are purified, and if the knowledge of all cognitions is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0135a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the state of no forgetfulness is purified, and because the state of no forgetfulness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135a11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the state of nonforgetfulness is purified, and if omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135a12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that the nature of equanimity of constant abiding is purified, and because the nature of equanimity of constant abiding is purified that the cognition of all knowables is purified.",
        "source": "T06n0220_226:0135a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the nature of constant abiding equanimity is purified, and if the knowledge of omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, omniscience is purified, and because omniscience is purified, omniscience is purified.",
        "source": "T06n0220_226:0135a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if omniscience is purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that cognition of the path and omniscience are purified, and because cognition of the path and omniscience are purified that cognition of omniscience is purified.",
        "source": "T06n0220_226:0135a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if knowledge of the path and knowledge of all characteristics are purified, and if knowledge of everything is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the dhāraṇī teachings are purified, and because the dhāraṇī teachings are purified, the cognition of all knowables is purified.",
        "source": "T06n0220_226:0135a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if all dhāraṇī gates are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no interruptions.",
        "source": "T06n0220_226:0135a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that all samādhi aspects are purified and because all samādhi aspects are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0135a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if all the approaches to samādhi are purified, and if the knowledge of all cognitions is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, the fruit of stream-winner is purified, and because the fruit of stream-winner is purified, the knowledge of all cognitions is purified.",
        "source": "T06n0220_226:0135b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the fruit of stream-winnership is purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "It's because the four formless concentrations are purified that the fruit of once-returning, nonreturning, and arhatship is purified, and because the fruit of once-returning, nonreturning, and arhatship is purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0135b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if pratyekabuddha enlightenment is purified, and if omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the four formless concentrations are purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_226:0135b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if all bodhisattva-mahāsattva practices are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "The four formless concentrations are purified so that the buddhas' unsurpassed correct enlightenment is purified, and the buddhas' unsurpassed correct enlightenment is purified so that omniscience and cognition are purified.",
        "source": "T06n0220_226:0135b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四無色定清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the four formless concentrations are purified, if the unsurpassed correct enlightenment of the buddhas is purified, and if the knowledge of all cognitions is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0135b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_226:0135b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if form is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinctions, and no elimination.",
        "source": "T06n0220_226:0135b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "It's because the eight liberations are purified that feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0135b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the locus of the eye is purified, and because the locus of the eye is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the sense-field of the eye is purified, and if the knowledge of omniscience is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0135c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, the ear, nose, tongue, body, and mind are purified, and if the ear, nose, tongue, body, and mind are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the ear, nose, tongue, body, and mind area are purified, and if omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the sphere of form is purified, and if the cognition of all knowables is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0135c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, the sense-field of sound, smell, taste, touch, and dharma are purified, and if the sense-field of sound, smell, taste, touch, and dharma are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the field of sound, smell, taste, touch, and dharma are purified, and if the knowledge of all cognitions is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0135c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the visual sphere is purified, and because the visual sphere is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the eye realm is purified, and if the knowledge of omniscience is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0135c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and if the form realm and even the sensations that arise from eye contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the form realm and even the sensations that arise from the condition of visual contact are purified, and if the knowledge of omniscience is purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0135c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0135c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the auditory realm is purified, and because the auditory realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0135c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the ear realm is purified, and if the knowledge of omniscience is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0135c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, the sound realm, the ear-consciousness realm, ear contact, and the sensations that arise from ear contact as a condition are purified, and if the sound realm and even the sensations that arise from ear contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0135c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the sound realm and even the sensations that arise from ear-contact as a condition are purified, and if the knowledge of all cognitions is purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the nasal realm is purified, and because the nasal realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the nasal realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0136a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, the fragrance realm, the nasal consciousness realm, nasal contact, and the sensations that arise from the condition of nasal contact are purified, and if the fragrance realm and even the sensations that arise from the condition of nasal contact are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the sense sensations that arise from the sense element of fragrance and even from nasal contact are purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the tongue realm is purified, and if the knowledge of omniscience is purified, there are no two, no duality, no distinction, and no disconnection.",
        "source": "T06n0220_226:0136a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then the taste realm, the tongue-consciousness realm, tongue contact, and the sensations that arise from tongue contact as a condition are purified, and if the taste realm and even the sensations that arise from tongue contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the body realm is purified, and because the body realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0136a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then the contact element, the body-consciousness element, body contact, and the sensations that arise from the conditions of body contact are purified, and if the contact element and even the sensations that arise from the conditions of body contact are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the sense-fields and even the sensations that arise from bodily contact as a condition are purified, and if the knowledge of all cognitions is purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "The eight liberations are purified, the mind's realm is purified, and because the mind's realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0136b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, the Dharma realm, the realm of consciousness, and the sensations that arise from mental contact and mental contact as perceptual objects are purified, and if the Dharma realm and even the sensations that arise from mental contact as perceptual objects are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the Dharma realm and even the sensations that arise from the condition of mental contact are purified, and if the knowledge of all cognitions is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0136b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the ground realm is purified, and because the ground realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_226:0136b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "It's because the eight liberations are purified that water, fire, air, space, and the consciousness realm are purified, and because water, fire, air, space, and the consciousness realm are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0136b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若水、火、風、空、識界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if water, fire, air, space, and the consciousness realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, ignorance is purified, and because ignorance is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if ignorance is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no elimination.",
        "source": "T06n0220_226:0136b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, appropriation, existence, birth, and the grief and sorrow of old age and death are purified, and if form and even the grief and sorrow of old age and death are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if practice ... streams ... aging and death, sorrow and suffering, and vexation are purified, and if omniscience and knowledge are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the prajñāpāramitā of generosity is purified, and because the prajñāpāramitā of generosity is purified, the cognition of omniscience is purified.",
        "source": "T06n0220_226:0136b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the prajñāpāramitā of generosity is purified, and if the cognition of all things is purified, there are no duals, no dichotomies, no distinctions, and no interruptions.",
        "source": "T06n0220_226:0136b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "It's because the eight liberations are purified that pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because the pure morality and even the perfection of wisdom are purified that the knowledge of all things is purified.",
        "source": "T06n0220_226:0136c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the pure precepts and even the perfection of wisdom are purified, and if the knowledge of all things is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if internal emptiness is purified, and if omniscience and cognition are purified, there's no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_226:0136c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, dispersed emptiness, immutable emptiness, intrinsic emptiness, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness are purified, and if external emptiness and even natureless self-nature emptiness are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if external emptiness or even the emptiness of a natureless self-nature is purified, and if the knowledge of all cognitions is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, true thusness is purified, and because true thusness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if true reality is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinctions, and no elimination.",
        "source": "T06n0220_226:0136c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，法界乃至不思議界清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then the Dharma realm, Dharma nature, not-falsely nature, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the inconceivable realm are purified, and if the Dharma realm and even the inconceivable realm are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the Dharma realm and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0136c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0136c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0136c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0136c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the noble truth of suffering is purified, and if the cognition of all knowables is purified, there's no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_226:0136c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then the noble truths of arising, ceasing, and the path are purified, and if the noble truths of arising, ceasing, and the path are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0136c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the noble truths of arising, cessation, and the path are purified, and if omniscience and knowledge are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the four meditations are purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the four immeasurable and four formless concentrations are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故八勝處清淨，八勝處清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the eight abodes of excellence are purified, and because the eight abodes of excellence are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若八勝處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the eight abodes of excellence are purified, and if omniscience is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_226:0137a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故九次第定、十遍處清淨，九次第定、十遍處清淨故一切智智清淨。",
        "translation": "It's because the eight liberations are purified that the nine graduated concentrations and ten universal abodes are purified, and because the nine graduated concentrations and ten universal abodes are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0137a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若九次第定、十遍處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the nine graduated concentrations and ten universal abodes are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the four abodes of mindfulness are purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_226:0137a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified, and if the four correct eliminations and even the eight noble factors of the path are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0137a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the four correct eliminations and even the eight noble components of the path are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the gate of the liberation of emptiness is purified, and because the gate of the liberation of emptiness is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_226:0137a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the liberation gate of emptiness is purified, and if the wisdom of omniscience is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_226:0137a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the liberation gate of marklessness and wishlessness is purified, and because the liberation gate of marklessness and wishlessness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the liberation gate of signlessness and wishlessness is purified, and if the knowledge of omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the bodhisattvas' ten stages are purified, and because the bodhisattvas' ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the bodhisattva's ten stages are purified, and if omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no two, no duality, no distinctions, and no elimination.",
        "source": "T06n0220_226:0137b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, the six supernormal powers are purified, and if the six supernormal powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the six supernormal powers are purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the Buddha's ten powers are purified, and if the wisdom of omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-uncommon dharmas are purified, and if the four fearlessnesses and even the 18 Buddha-uncommon dharmas are purified, then the wisdom of omniscience is purified.",
        "source": "T06n0220_226:0137b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the four unsurpassables and even the 18 Buddha-principles are purified, and if the knowledge of all cognitions is purified, there are no duals, no double divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, the knowledge of all cognitions is purified.",
        "source": "T06n0220_226:0137b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137b27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the state of nonforgetfulness is purified, and if the cognition of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "It's because the eight liberations are purified that the nature of equanimity of constant abiding is purified, and because the nature of equanimity of constant abiding is purified that the cognition of all knowables is purified.",
        "source": "T06n0220_226:0137b29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the nature of constant abiding equanimity is purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137c03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, omniscience is purified, and because omniscience is purified, omniscience is purified.",
        "source": "T06n0220_226:0137c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if omniscience is purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_226:0137c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "It's because the eight liberations are purified that cognition of the path and omniscience are purified, and because cognition of the path and omniscience are purified that cognition of omniscience is purified.",
        "source": "T06n0220_226:0137c07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if knowledge of the path and knowledge of all characteristics are purified, and if knowledge of everything is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137c09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137c11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the dhāraṇī teachings are purified, and because the dhāraṇī teachings are purified, the cognition of all knowables is purified.",
        "source": "T06n0220_226:0137c11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if all dhāraṇī gates are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no interruptions.",
        "source": "T06n0220_226:0137c13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "If the eight liberations are purified, then all samādhi-gates are purified, and if all samādhi-gates are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0137c15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if all the approaches to samādhi are purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the fruit of stream-winner is purified, and because the fruit of stream-winner is purified, the knowledge of all cognitions is purified.",
        "source": "T06n0220_226:0137c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the fruit of pre-flow is purified, and if the knowledge of all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "It's because the eight liberations are purified that the fruit of once-returning, irreversibility, and arhatship is purified, and because the fruit of once-returning, irreversibility, and arhatship is purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0137c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0137c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0137c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0137c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if pratyekabuddha enlightenment is purified, and if omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0137c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_226:0138a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if all bodhisattva-mahāsattva practices are purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "Because the eight liberations are purified, the unsurpassed correct enlightenment of the buddhas is purified, and because the unsurpassed correct enlightenment of the buddhas is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight liberations are purified, if the buddhas' unsurpassed correct enlightenment is purified, and if the knowledge of all cognitions is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138a09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_226:0138a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if form is purified, and if omniscience and cognition are purified, there are no two, no distinctions, no separations, and no interruptions.",
        "source": "T06n0220_226:0138a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "It's because the eight superior bases are purified that feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0138a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because the eight superior bases are purified, the locus of vision is purified, and because the locus of vision is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the locus of the eye is purified, and if the cognition of all knowables is purified, there are no two, no duality, no distinction, and no disconnection.",
        "source": "T06n0220_226:0138a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "It's because the eight superior sense-fields are purified that the sense-fields of ear, nose, tongue, body, and mind are purified, and because the sense-fields of ear, nose, tongue, body, and mind are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0138a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the ear, nose, tongue, body, and mind are purified, and if the knowledge of all cognitions is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0138a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because the eight superior bases are purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the abode of form is purified, and if the cognition of all knowables is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "It's because the eight superior bases are purified that the sense-field of sound, smell, taste, touch, and dharma are purified, and because the sense-field of sound, smell, taste, touch, and dharma are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0138a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the abodes of sound, smell, taste, touch, and dharma are purified, and if the knowledge of all cognitions is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_226:0138b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, the eye realm is purified, and because the eye realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the eye realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the eight superior bases are purified that the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and because the form realm and even the sensations that arise from eye contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0138b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the form realm and even the sensations that arise from visual contact as a condition are purified, and if omniscience and cognition are purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, the auditory realm is purified, and because the auditory realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the ear realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight superior bases are purified, the sound realm, the ear-consciousness realm, ear contact, and the sensations that arise from ear contact as a condition are purified, and if the sound realm and even the sensations that arise from ear contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0138b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the sound realm and even the sensations that arise from ear-contact as a condition are purified, and if the knowledge of all cognitions is purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, the nasal realm is purified, and because the nasal realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the nasal realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight superior bases are purified, then the fragrance realm, the nasal consciousness realm, nasal contact, and the sensations that arise from the condition of nasal contact are purified, and if the fragrance realm and even the sensations that arise from the condition of nasal contact are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0138b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the sense-perceptions that arise from the sense-perceptions of fragrance and even nasal contact are purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138b29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138b29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138c01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the tongue realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138c01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the eight abodes of excellence are purified that the taste realm, the tongue-consciousness realm, tongue contact, and the sensations that arise from tongue contact as a condition are purified, and because the taste realm and even the sensations that arise from tongue contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0138c03_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, the body realm is purified, and because the body realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight superior bases are purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the eight superior bases are purified, then the sense element of contact, the body-consciousness element, and the sensations that arise from body contact and body contact as a condition are purified, and if the sense element of contact and the sensations that arise from body contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_226:0138c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the sense-fields and even the sensations that arise from bodily contact as a condition are purified, and if omniscience and cognition are purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "The eight abodes of excellence are purified, the mind realm is purified, and because the mind realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the eight superior bases are purified that the Dharma realm, the realm of consciousness, and perceptions that arise from mental contact and perception as a condition are purified, and because the Dharma realm and even the perceptions that arise from mental contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0138c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the Dharma realm and even the sensations that arise from the condition of mental contact are purified, and if the knowledge of all cognitions is purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0138c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0138c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, the ground realm is purified, and because the ground realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0138c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0138c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_226:0138c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "It's because the eight abodes of excellence are purified that water, fire, wind, space, and the consciousness realm are purified, and because water, fire, wind, space, and the consciousness realm are purified that omniscience and cognition are purified.",
        "source": "T06n0220_226:0138c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0139a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若水、火、風、空、識界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if the realms of water, fire, air, space, and consciousness are purified, and if the cognition of all knowables is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0139a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_226:0139a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because the eight abodes of excellence are purified, ignorance is purified, and because ignorance is purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0139a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0139a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if ignorance is purified, and if omniscience and cognition are purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0139a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "If the eight superior bases are purified, it's because form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, appropriation, existence, birth, and the grief and sorrow of old age are purified, and because the grief and sorrow of form and even old age are purified, omniscience and cognition are purified.",
        "source": "T06n0220_226:0139a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_226:0139a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八勝處清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the eight abodes of excellence are purified, if practice ... even old age and death, sorrow, pain, and vexation are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_226:0139a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百二十六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 226",
        "source": "T06n0220_226:0139a12_0",
        "is_bad_quality": false
    }
]