[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 211",
        "source": "T06n0220_217:0085c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七",
        "translation": "seventeen",
        "source": "T06n0220_217:0085c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T06n0220_217:0085c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分難信解品第三十四之三十六",
        "translation": "Chapter 34-36 of the First Part of the Questions of Difficulty in Belief",
        "source": "T06n0220_217:0085c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0085c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the prajñāpāramitā of generosity is purified, and because the prajñāpāramitā of generosity is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_217:0085c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0085c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the prajñāpāramitā of generosity is purified, and if the cognition of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0085c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless essential nature is purified, then pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and if pure morality and even the perfection of wisdom are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0085c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0085c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the pure precepts and even the perfection of wisdom are purified, and if the knowledge of all things is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless self-nature is purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless self-nature is purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinctions, and no elimination.",
        "source": "T06n0220_217:0086a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空清淨，外空乃至自性空清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless self-nature is purified, then external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, dispersed emptiness, immutable emptiness, emptiness in itself, emptiness in common, emptiness of all things, inaccessible emptiness, emptiness without nature, and emptiness of self-nature are purified, and if the external emptiness and even the emptiness of self-nature are purified, then the cognition of all things is purified.",
        "source": "T06n0220_217:0086a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若外空乃至自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless own-nature is purified, if external emptiness and even the emptiness of the own-nature are purified, and if the knowledge of everything is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, true thusness is purified, and because true thusness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the true thusness is purified, and if the cognition of all knowables is purified, there are no dualities, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，法界乃至不思議界清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless essential nature is purified, then the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the inconceivable realm are purified, and if the Dharma realm and even the inconceivable realm are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0086a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the realm of reality and even the inconceivable realm are purified, and if the knowledge of all cognition is purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essence is purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the noble truth of suffering is purified, and if the cognition of all knowables is purified, there are no dualities, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless nature of itself is purified, then the noble truths of arising, ceasing, and the path are purified, and if the noble truths of arising, ceasing, and the path are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0086a26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the noble truths of arising, cessation, and the path are purified, and if the knowledge of all cognition is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_217:0086a28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0086b01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086b01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086b02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the four meditations are purified, and if omniscience is purified, it's because there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086b02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless essential nature is purified, the four immeasurable and four formless concentrations are purified, and if the four immeasurable and four formless concentrations are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0086b04_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086b06_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the four immeasurable and four formless concentrations are purified, and if the knowledge of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086b06_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086b08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086b08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086b10_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the eight liberations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0086b10_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless essential nature is purified, the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and if the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0086b12_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086b14_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086b14_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086b17_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086b17_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086b18_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the four abodes of mindfulness are purified, and if the cognition of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086b18_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless nature of itself is purified, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified, and if the four correct eliminations and even the eight noble factors of the path are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0086b20_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086b23_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the fourfold correct elimination up to the eightfold noble path branch is purified, and if the knowledge of omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086b23_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086b25_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless self-nature is purified, the gate of the liberation of emptiness is purified, and because the gate of the liberation of emptiness is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_217:0086b25_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086b27_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the gate of liberation through emptiness is purified, and if the cognition of everything is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0086b27_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless nature of itself is purified, the liberation gate of marklessness and wishlessness is purified, and the liberation gate of marklessness and wishlessness is purified, so the cognition of all existences is purified.",
        "source": "T06n0220_217:0086b29_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086c02_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the liberation gate of marklessness and wishlessness is purified, and if the knowledge of everything is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086c02_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0086c04_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the bodhisattva's ten stages are purified, and because the bodhisattva's ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086c04_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086c06_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the bodhisattva's ten stages are purified, and if the knowledge of all cognition is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086c06_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no dualities, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless nature itself is purified, the six supernormal powers are purified, and if the six supernormal powers are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0086c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the six supernormal powers are purified, and if the knowledge of all cognition is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0086c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the Buddha's ten powers are purified, and if the wisdom of omniscience is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "If the emptiness of the natureless essential nature is purified, then the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-uncommon dharmas are purified, and if the four fearlessnesses and even the 18 Buddha-uncommon dharmas are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0086c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the four unsurpassables and even the 18 Buddha-principles are purified, and if the knowledge of all cognitions is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_217:0086c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0086c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the absence of forgetfulness is purified, and because the absence of forgetfulness is purified, the knowledge of all cognitions is purified.",
        "source": "T06n0220_217:0086c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0086c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the absence of forgetfulness is purified, and if the cognition of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0086c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "If emptiness of the natureless nature of itself is purified, the nature of equanimity of constant abiding is purified, and if the nature of equanimity of constant abiding is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_217:0086c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the equanimity of constancy and equanimity is purified, and if the knowledge of everything is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, all cognition is purified, and because all cognition is purified, all knowledge is purified.",
        "source": "T06n0220_217:0087a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if omniscience is purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless nature itself is purified, knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified, knowledge of all characteristics is purified.",
        "source": "T06n0220_217:0087a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the knowledge of the path and all characteristics is purified, and if the knowledge of all characteristics is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0087a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, all dhāraṇī teachings are purified, and because all dhāraṇī teachings are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_217:0087a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if all dhāraṇī gates are purified, and if the cognition of all knowables is purified, there are no dualities, no dichotomies, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0087a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "It's because the emptiness of the natureless nature itself is purified that all samādhi-gates are purified and because all samādhi-gates are purified that all cognition is purified.",
        "source": "T06n0220_217:0087a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if all the samādhi teachings are purified, and if the knowledge of all cognitions is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087a17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the fruit of stream-winner is purified, and because the fruit of stream-winner is purified, the knowledge of all cognitions is purified.",
        "source": "T06n0220_217:0087a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the fruit of pre-flow is purified, and if the knowledge of all cognition is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "It's because the emptiness of the natureless nature is purified that the once-returner, nonreturner, and arhatship fruits are purified, and because the once-returner, nonreturner, and arhatship fruits are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0087a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if the knowledge of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if pratyekabuddha enlightenment is purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0087b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless self-nature is purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_217:0087b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if all bodhisattva-mahāsattva practices are purified, and if the knowledge of all cognitions is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087b05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無性自性空清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "Because the emptiness of the natureless essential nature is purified, the unsurpassed correct enlightenment of the buddhas is purified, and because the unsurpassed correct enlightenment of the buddhas is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性自性空清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the emptiness of the natureless essential nature is purified, if the unsurpassed correct enlightenment of the buddhas is purified, and if the wisdom of omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087b09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_217:0087b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if form is purified, and if the knowledge of all cognition is purified, there are no two, no duality, no distinction, and no elimination.",
        "source": "T06n0220_217:0087b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the locus of the eye is purified, and because the locus of the eye is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the locus of the eye is purified, and if the cognition of all knowables is purified, there are no two, no duality, no distinction, and no disconnection.",
        "source": "T06n0220_217:0087b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the ear, nose, tongue, body, and mind are purified, and because the ear, nose, tongue, body, and mind are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0087b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the ear, nose, tongue, body, and parts of the mind are purified, and if the knowledge of all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the form realm is purified, and if omniscience and cognition are purified, there are no two, no distinctions, no separations, and no interruptions.",
        "source": "T06n0220_217:0087b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the sense-field of sound, smell, taste, touch, and dharma are purified, and because the sense-field of sound, smell, taste, touch, and dharma are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0087b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the field of sound, smell, taste, touch, and dharmas is purified, and if the knowledge of all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the visual sphere is purified, and because the visual sphere is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the eye realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0087c04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and because the form realm and even the sensations that arise from eye contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0087c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087c08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the form realm and even the sensations that arise from visual contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087c08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087c11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the auditory realm is purified, and because the auditory realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087c11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087c12_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the ear realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0087c12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the sound element, the ear-consciousness element, ear contact, and the sensations that arise from ear contact as a condition are purified, and because the sound element and even the sensations that arise from ear contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0087c14_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087c16_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the sound realm and even the sensations that arise from ear-touch as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the nasal passage is purified, and because the nasal passage is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the nasal realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0087c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the sense element of fragrance, the sense element of nostrils, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and because the sense element of fragrance and the sensations that arise from nasal contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0087c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the sense-perceptions that arise from the sense-perceptions of fragrance and even nasal contact are purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0087c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0087c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0087c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0087c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the tongue realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0087c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the taste realm, the tongue-consciousness realm, tongue contact, and the sensations that arise from tongue contact as a condition are purified, and because the taste realm and even the sensations that arise from tongue contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the body as an element is purified, and because the body as an element is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0088a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the contact element, the body-consciousness element, and the sensations that arise from body contact and body contact as a condition are purified, and because the contact element and even the sensations that arise from body contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the sense element of touch and even the sensations that arise from bodily contact as a condition are purified, and if the knowledge of all cognitions is purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the mental realm is purified, and because the mental realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0088a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the Dharma realm, the realm of consciousness, and perceptions that arise from mental contact and perception as a condition are purified, and because the Dharma realm and even the perceptions that arise from mental contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the Dharma realm and even the sensations that arise from mental contact as a condition are purified, and if omniscience and cognition are purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the ground realm is purified, and because the ground realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0088a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the water, fire, air, space, and consciousness realms are purified, and because the water, fire, air, space, and consciousness realms are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若水、火、風、空、識界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if water, fire, air, space, and the consciousness realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, ignorance is purified, and because ignorance is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if ignorance is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no elimination.",
        "source": "T06n0220_217:0088b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, appropriation, existence, birth, and the grief and sorrow of old age and death are purified, and because the grief and sorrow of form and even old age and death are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if conditioned phenomena and even the sorrow, pain, and vexation of old age and death are purified, and if omniscience and knowledge are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the prajñāpāramitā of generosity is purified, and because the prajñāpāramitā of generosity is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_217:0088b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the prajñāpāramitā of generosity is purified, and if the cognition of all things is purified, there are no duals, no distinctions, and no cuts.",
        "source": "T06n0220_217:0088b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because the pure morality and even the perfection of wisdom are purified that the knowledge of all things is purified.",
        "source": "T06n0220_217:0088b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the pure precepts and even the perfection of wisdom are purified, and if the knowledge of all things is purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no disconnection.",
        "source": "T06n0220_217:0088b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, immutable emptiness, intrinsic nature emptiness, self-nature emptiness, shared characteristic emptiness, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness are purified, and because external emptiness and even natureless self-nature emptiness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if external emptiness or even the emptiness of a natureless self-nature is purified, and if the knowledge of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故法界清淨，法界清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the Dharma realm is purified, and because the Dharma realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088b28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若法界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the Dharma realm is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_217:0088b28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，法性乃至不思議界清淨故一切智智清淨。",
        "translation": "It's because the true nature is purified that the nature of dharmas, the nature of non-falsity, the nature of non-differentiation, the nature of equality, the nature of freedom from birth, the law, the abiding of dharmas, reality, the space realm, and the inconceivable realm are purified, and because the nature of dharmas and even the inconceivable realm are purified that the cognition of all knowables is purified.",
        "source": "T06n0220_217:0088c01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若法性乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the Dharma nature and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088c06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the noble truth of suffering is purified, and if the cognition of all knowables is purified, there's no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_217:0088c08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "It's because true thusness is purified that the noble truths of arising, ceasing, and the path are purified, and because the noble truths of arising, ceasing, and the path are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088c10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the noble truths of arising, cessation, and the path are purified, and if omniscience and knowledge are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088c11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0088c13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088c13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the four meditations are purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088c15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088c16_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the four immeasurable and four formless concentrations are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088c18_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088c20_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088c20_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c22_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the eight liberations are purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0088c22_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0088c23_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0088c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0088c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0088c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0088c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the four abodes of mindfulness are purified, and if the knowledge of omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0088c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "If the true thusness is purified, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified, and if the fourfold correct elimination and even the eight noble factors of the path are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0089a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the fourfold correct elimination and even the eightfold noble path branch are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the gate of liberation through emptiness is purified, and because the gate of liberation through emptiness is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_217:0089a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the gate of liberation through emptiness is purified, and if the cognition of all knowables is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the liberation gate of marklessness and wishlessness is purified, and because the liberation gate of marklessness and wishlessness is purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0089a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the liberation gate of marklessness and wishlessness is purified, and if the cognition of all knowables is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0089a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the bodhisattvas' ten stages are purified, and because the bodhisattvas' ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the bodhisattva's ten stages are purified, and if the knowledge of all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_217:0089a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the six supernormal powers are purified and because the six supernormal powers are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0089a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if the six supernormal powers are purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the Buddha's ten powers are purified, and if the knowledge of omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-uncommon dharmas are purified, and because the four fearlessnesses and even the 18 Buddha-uncommon dharmas are purified that the wisdom of omniscience is purified.",
        "source": "T06n0220_217:0089a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the four unsurpassables and even the 18 Buddha-principles are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the Dharma of no forgetfulness is purified, and if the cognition of all knowables is purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the nature of equanimity is always abiding and pure, and because the nature of equanimity is always abiding and pure that the cognition of all knowables is purified.",
        "source": "T06n0220_217:0089b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the nature of constant abiding equanimity is purified, and if the knowledge of all knowables is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, omniscience is purified, and because omniscience is purified, omniscience is purified.",
        "source": "T06n0220_217:0089b10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if omniscience is purified, and if the knowledge of omniscience is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0089b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified that knowledge of all characteristics is purified.",
        "source": "T06n0220_217:0089b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if knowledge of the path and knowledge of all characteristics are purified, and if knowledge of everything is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, all dhāraṇī teachings are purified, and because all dhāraṇī teachings are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_217:0089b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if all dhāraṇī gates are purified, and if all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that all samādhi-gates are purified and because all samādhi-gates are purified that all cognition is purified.",
        "source": "T06n0220_217:0089b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if all the approaches to samādhi are purified, and if the knowledge of all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the fruit of stream-winner is purified, and because the fruit of stream-winner is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the fruit of stream-winnership is purified, and if the knowledge of all things is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0089b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "It's because the true thusness is purified that the fruits of once-returning, nonreturning, and arhatship are purified, and because the fruits of once-returning, nonreturning, and arhatship are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0089b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if solitary realizer and bodhi are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_217:0089c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the true thusness is purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_217:0089c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the true thusness is purified, if all bodhisattva-mahāsattva practices are purified, and if the knowledge of all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "Because true thusness is purified, the unsurpassed correct enlightenment of the buddhas is purified, and because the unsurpassed correct enlightenment of the buddhas is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If true thusness is purified, if the buddhas' unsurpassed correct enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_217:0089c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if form is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_217:0089c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0089c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0089c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the locus of the eye is purified, and because the locus of the eye is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0089c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the eye field is purified, and if omniscience and cognition are purified, there are no two, no distinctions, no separations, and no interruptions.",
        "source": "T06n0220_217:0089c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that the ear, nose, tongue, body, and mind are purified, and because the ear, nose, tongue, body, and mind are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0089c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0089c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the ear, nose, tongue, body, and parts of the mind are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0089c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the form realm is purified, and if omniscience and cognition are purified, there are no two, no distinctions, no separations, and no interruptions.",
        "source": "T06n0220_217:0090a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that the sense, smell, taste, touch, and dharmic fields are purified, and because the sense, smell, taste, touch, and dharmic fields are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the field of sound, smell, taste, touch, and dharmas is purified, and if the knowledge of all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the eye realm is purified, and because the eye realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the eye realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0090a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the realm of form and the visual consciousness and the sensations that arise from eye contact and eye contact as a condition are purified because the realm of form and even the sensations that arise from eye contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the form realm and even the sensations that arise from visual contact as a condition are purified, and if omniscience and cognition are purified, there are no duals, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the auditory realm is purified, and because the auditory realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the ear realm is purified, and if omniscience and cognition are purified, there are no two, no dichotomies, no distinctions, and no interruptions.",
        "source": "T06n0220_217:0090a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the Dharma realm is purified, the sound realm, the ear-consciousness realm, and ear contact and the sensations that arise from ear contact as a condition are purified, and if the sound realm and even the sensations that arise from ear contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the sound realm and even the sensations that arise from ear-touch as a condition are purified, and if omniscience and cognition are purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the nose realm is purified, and because the nose realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the nose realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0090a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that the fragrance realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and because the fragrance realm and even the sensations that arise from nasal contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the fragrance realm and even the sensations that arise from the condition of nasal contact are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the tongue realm is purified, and if omniscience and cognition are purified, there are no two, no distinctions, no separations, and no breaks.",
        "source": "T06n0220_217:0090b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that the taste realm, the tongue-consciousness realm, tongue contact, and the sensations that arise from tongue contact as a condition are purified, and because the taste realm and even the sensations that arise from tongue contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the body realm is purified, and because the body realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no disconnection.",
        "source": "T06n0220_217:0090b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that the contact realm, the body-consciousness realm, and the sensations that arise from bodily contact and bodily contact as a condition are purified, and because the contact realm and even the sensations that arise from bodily contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the tactile realm and even the sensations that arise from bodily contact as a condition are purified, and if omniscience and cognition are purified, there are no dualities, no divisions, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "The Dharma realm is purified, the mind realm is purified, and because the mind realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_217:0090b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are purified, and because the Dharma realm and even the sensations that arise from mental contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the Dharma realm and even the sensations that arise from mental contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090b27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the ground realm is purified, and because the ground realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no interruption.",
        "source": "T06n0220_217:0090b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "It's because the realm of dharmas is purified that the realms of water, fire, air, space, and consciousness are purified, and because the realms of water, fire, air, space, and consciousness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若水、火、風、空、識界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the water, fire, air, space, and consciousness realms are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, ignorance is purified, and because ignorance is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if ignorance is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no elimination.",
        "source": "T06n0220_217:0090c06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "It's because the realm of reality is purified that formations, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, appropriation, existence, birth, and the grief and sorrow of old age are purified, and because the grief and sorrow of formations and even old age are purified that the cognition of all knowables is purified.",
        "source": "T06n0220_217:0090c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if practice ... streams ... sorrow, pain, and vexation of old age and death are purified, and if omniscience and knowledge are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, the prajñāpāramitā of generosity is purified, and because the prajñāpāramitā of generosity is purified, the cognition of all knowables is purified.",
        "source": "T06n0220_217:0090c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the prajñāpāramitā of generosity is purified, and if the cognition of all things is purified, there are no duals, no distinctions, and no cuts.",
        "source": "T06n0220_217:0090c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "It's because the Dharma realm is purified that pure morality, patience, effort, meditation, and the prajñāpāramitā are purified, and because pure morality and even the prajñpāramitā are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if the pure precepts and even the perfection of wisdom are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_217:0090c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because the Dharma realm is purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_217:0090c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no duality, no dichotomy, no distinction, and no disconnection.",
        "source": "T06n0220_217:0090c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "It's because the realm of reality is purified that external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, immutable emptiness, intrinsic nature emptiness, self-nature emptiness, co-nature emptiness, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness are purified, and because external emptiness and even natureless self-nature emptiness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_217:0090c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_217:0090c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法界清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the Dharma realm is purified, if external emptiness or even the emptiness of a natureless self-nature is purified, and if omniscience and cognition are purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_217:0090c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百一十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 217",
        "source": "T06n0220_217:0091a03_0",
        "is_bad_quality": false
    }
]