[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 204",
        "source": "T06n0220_245:0235c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T06n0220_245:0235c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T06n0220_245:0235c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分難信解品第三十四之六十四",
        "translation": "First Part of the Chapter on the Difficult Understandings, Thirty-four, Sixty-four",
        "source": "T06n0220_245:0235c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_245:0235c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故意界清淨，意界清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the mental realm is purified, and because the mental realm is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0235c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0235c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若意界清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the mind realm is purified, and if the prajñāpāramitā is purified, there are no duals, no distinctions, and no severances.",
        "source": "T06n0220_245:0235c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故般若波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are purified, and because the Dharma realm and even the sensations that arise from mental contact as a condition are purified that the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0235c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0235c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若法界乃至意觸為緣所生諸受清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the Dharma realm and even the sensations that arise from mental contact as a condition are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0235c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0235c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故地界清淨，地界清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the ground realm is purified, and because the ground realm is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0235c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0235c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若地界清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the earth realm is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0235c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故般若波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the water, fire, wind, air, and consciousness realms are purified and because the water, fire, wind, air, and consciousness realms are purified that the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0235c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若水、火、風、空、識界清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if water, fire, air, space, and the consciousness realm are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故無明清淨，無明清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, nescience is purified, and because nescience is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若無明清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if ignorance is purified, and if the prajñāpāramitā is purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，行乃至老死愁歎苦憂惱清淨故般若波羅蜜多清淨。",
        "translation": "If omniscience and cognition are purified, then form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, apprehension, existence, birth, and the grief and sorrow of old age are purified, and if the grief and sorrow of form and even old age are purified, then the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若行乃至老死愁歎苦憂惱清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if practice and even the sorrow, pain, and vexation of old age and death are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the perfection of generosity is purified, and because the perfection of generosity is purified, the perfection of prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若布施波羅蜜多清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the perfection of generosity is purified, and if the perfection of wisdom is purified, there are no two, no duality, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0236a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故淨戒、安忍、精進、靜慮波羅蜜多清淨，淨戒乃至靜慮波羅蜜多清淨故般若波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the perfections of pure morality, patience, effort, and meditation are purified, and because the perfections of pure morality and even meditation are purified that the perfections of prajñāpāramitā are purified.",
        "source": "T06n0220_245:0236a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若淨戒乃至靜慮波羅蜜多清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the pure precepts and even the perfection of meditation are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故內空清淨，內空清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, internal emptiness is purified, and because internal emptiness is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若內空清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if internal emptiness is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，外空乃至無性自性空清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, dispersed emptiness, immutable emptiness, intrinsic emptiness, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness are purified, and because external emptiness and even natureless self-nature emptiness are purified, the prajñāparamitā is purified.",
        "source": "T06n0220_245:0236a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若外空乃至無性自性空清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if external emptiness or even the emptiness of a natureless self-nature is purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故真如清淨，真如清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, true thusness is purified, and because true thusness is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若真如清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if true thusness is purified, and if the prajñāpāramitā is purified, there are no two, no duality, no distinction, and no elimination.",
        "source": "T06n0220_245:0236b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，法界乃至不思議界清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the inconceivable realm are purified, and because the Dharma realm and even the inconceivable realm are purified, the prajñāparamitā is purified.",
        "source": "T06n0220_245:0236b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若法界乃至不思議界清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the Dharma realm and even the inconceivable realm are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故苦聖諦清淨，苦聖諦清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若苦聖諦清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the noble truth of suffering is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故般若波羅蜜多清淨。",
        "translation": "If omniscience and knowledge are purified, then the noble truths of arising, ceasing, and the path are purified, and if the noble truths of arising, ceasing, and the path are purified, then the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若集、滅、道聖諦清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the noble truths of arising, cessation, and the path are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四靜慮清淨，四靜慮清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the four meditations are purified, and because the four meditations are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四靜慮清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the four meditations are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0236b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四無量、四無色定清淨，四無量、四無色定清淨故般若波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the four immeasurable and four formless concentrations are purified and because the four immeasurable and four formless concentrations are purified that the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四無量、四無色定清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the four immeasurable and four formless concentrations are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故八解脫清淨，八解脫清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the eight liberations are purified, and because the eight liberations are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若八解脫清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the eight liberations are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0236c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故般若波羅蜜多清淨。",
        "translation": "It's because the omniscience and cognition are purified that the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified that the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若八勝處、九次第定、十遍處清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236c06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236c09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四念住清淨，四念住清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236c09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236c10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四念住清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the four abodes of mindfulness are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，四正斷乃至八聖道支清淨故般若波羅蜜多清淨。",
        "translation": "If omniscience and cognition are purified, then the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified, and if the fourfold correct elimination and even the eight noble factors of the path are purified, then the prajñāparamitā is purified.",
        "source": "T06n0220_245:0236c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四正斷乃至八聖道支清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the fourfold correct elimination and even the eightfold noble path are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故空解脫門清淨，空解脫門清淨故般若波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the liberation aspect of emptiness is purified, and because the liberation aspect of emptiness is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若空解脫門清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the knowledge of omniscience is purified, if the liberation gate of emptiness is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0236c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故般若波羅蜜多清淨。",
        "translation": "It's because the omniscience and cognition of all things are purified that the liberation gate of marklessness and wishlessness is purified, and because the liberation gate of marklessness and wishlessness is purified that the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若無相、無願解脫門清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the knowledge of omniscience is purified, if the liberation through signlessness and wishlessness is purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0236c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故菩薩十地清淨，菩薩十地清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the bodhisattvas' ten stages are purified, and because the bodhisattvas' ten stages are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0236c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0236c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若菩薩十地清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the bodhisattva's ten stages are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0236c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故五眼清淨，五眼清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the five eyes are purified, and because the five eyes are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若五眼清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the five eyes are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故六神通清淨，六神通清淨故般若波羅蜜多清淨。",
        "translation": "If omniscience and cognition are purified, the six supernormal powers are purified, and if the six supernormal powers are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若六神通清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the six supernormal powers are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故佛十力清淨，佛十力清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若佛十力清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and wisdom are purified, if the Buddha's ten powers are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，四無所畏乃至十八佛不共法清淨故般若波羅蜜多清淨。",
        "translation": "If the omniscience and wisdom are purified, then the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-unequivalent qualities are purified, and if the four fearlessnesses and even the 18 Buddha-unequivalent qualities are purified, then the prajñāparamitā is purified.",
        "source": "T06n0220_245:0237a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四無所畏乃至十八佛不共法清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the four unsurpassables and even the 18 Buddha-principles are purified, and if the prajñāparamitā is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_245:0237a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故無忘失法清淨，無忘失法清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若無忘失法清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the principle of nonforgetfulness is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故恒住捨性清淨，恒住捨性清淨故般若波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the nature of equanimity is always abiding and pure, and because the prajñāpāramitā is purified that the nature of equanimity is always abiding and pure.",
        "source": "T06n0220_245:0237a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若恒住捨性清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the nature of equanimity is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切智清淨，一切智清淨故般若波羅蜜多清淨。",
        "translation": "Because the knowledge of omniscience is purified, the knowledge of omniscience is purified, and because the knowledge of omniscience is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切智清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if omniscience is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0237a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故道相智、一切相智清淨，道相智、一切相智清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience is purified, knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若道相智、一切相智清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if knowledge of the path and omniscience are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故般若波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the dhāraṇī teachings are purified, and because the dhāraṇī teachings are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切陀羅尼門清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge of all things are purified, if the dhāraṇī teachings of all things are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0237b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切三摩地門清淨，一切三摩地門清淨故般若波羅蜜多清淨。",
        "translation": "It's because the omniscience and the wisdom of omniscience are purified that the entrance to all samādhis is purified, and because the entrance to all samādhis is purified that the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237b08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237b10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切三摩地門清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if all the approaches to samādhi are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237b10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故預流果清淨，預流果清淨故般若波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the fruit of stream-winner is purified, and because the fruit of stream-winner is purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若預流果清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the fruit of pre-flow is purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0237b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故般若波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the fruit of once-returning, nonreturning, and arhatship are purified, and because the fruit of once-returning, nonreturning, and arhatship are purified that the prajñāparamitā is purified.",
        "source": "T06n0220_245:0237b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一來、不還、阿羅漢果清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故獨覺菩提清淨，獨覺菩提清淨故般若波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, the perfection of wisdom is purified.",
        "source": "T06n0220_245:0237b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若獨覺菩提清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if pratyekabuddha enlightenment is purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故般若波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切菩薩摩訶薩行清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if all bodhisattva-mahāsattva practices are purified, and if the prajñāpāramitā is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故般若波羅蜜多清淨。",
        "translation": "\"It's because the omniscience and wisdom are purified that the unsurpassed correct enlightenment of the buddhas is purified, and because the unsurpassed correct enlightenment of the buddhas is purified that the prajñāpāramitā is purified.",
        "source": "T06n0220_245:0237b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若諸佛無上正等菩提清淨，若般若波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the unsurpassed correct enlightenment of the buddhas is purified, and if the perfection of wisdom is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_245:0237c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故色清淨，色清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, form is purified, and because form is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0237c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若色清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if form is purified, and if the pāramitā of meditation is purified, there are no duals, no distinctions, and no breaks.",
        "source": "T06n0220_245:0237c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故受、想、行、識清淨，受、想、行、識清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified, the wave of meditation and the honeycomb are purified.",
        "source": "T06n0220_245:0237c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若受、想、行、識清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if feeling, perception, volition, and consciousness are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故眼處清淨，眼處清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the locus of the eye is purified, and because the locus of the eye is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0237c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若眼處清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the eye field is purified, and if the perfection of concentration is purified, there are no duals, no distinctions, and no breaks.",
        "source": "T06n0220_245:0237c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and cognition are purified that the ear, nose, tongue, body, and mind are purified, and because the ear, nose, tongue, body, and mind are purified that the marvelous abundance of meditation is purified.",
        "source": "T06n0220_245:0237c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若耳、鼻、舌、身、意處清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the ear, nose, tongue, body, and mind are purified, and if the perfection of meditation is purified, there are no two, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_245:0237c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故色處清淨，色處清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the form realm is purified, and because the form realm is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0237c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若色處清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the form realm is purified, and if the perfection of meditation is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_245:0237c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the sense-field of sound, smell, taste, touch, and dharma are purified, and because the sense-field of sound, smell, taste, touch, and dharma are purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0237c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0237c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若聲、香、味、觸、法處清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the field of sound, smell, taste, touch, and dharmas is purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0237c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0237c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故眼界清淨，眼界清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the visual sphere is purified, and because the visual sphere is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0237c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若眼界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the eye realm is purified, and if the pāramitā of meditation is purified, there are no two, no duality, no distinction, and no elimination.",
        "source": "T06n0220_245:0238a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and because the form realm and even the sensations that arise from eye contact as a condition are purified that the perfection of meditation is purified.",
        "source": "T06n0220_245:0238a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若色界乃至眼觸為緣所生諸受清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge are purified, if the form realm and even the sensations that arise from visual contact as a condition are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故耳界清淨，耳界清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the auditory realm is purified, and because the auditory realm is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0238a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若耳界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the ear realm is purified, and if the pāramitā of meditation is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_245:0238a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact as a condition are purified, and because the sound realm and even the sensations that arise from ear contact as a condition are purified that the perfection of meditation is purified.",
        "source": "T06n0220_245:0238a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若聲界乃至耳觸為緣所生諸受清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the sense field of sound and even the sensations that arise from ear contact are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故鼻界清淨，鼻界清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the nasal realm is purified, and because the nasal realm is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0238a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若鼻界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the nasal realm is purified, and if the pāramitā of meditation is purified, there are no two, no duality, no distinction, and no elimination.",
        "source": "T06n0220_245:0238a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the fragrance realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and because the fragrance realm and even the sensations that arise from nasal contact as a condition are purified that the perfection of meditation is purified.",
        "source": "T06n0220_245:0238a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若香界乃至鼻觸為緣所生諸受清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if sensations arising from the sense element of fragrance and even from nasal contact are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故舌界清淨，舌界清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the tongue realm is purified, and because the tongue realm is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0238a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若舌界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the tongue realm is purified, and if the pāramitā of meditation is purified, there are no two, no duality, no distinction, and no elimination.",
        "source": "T06n0220_245:0238a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are purified, and because the taste realm and even the sensations that arise from tongue contact as a condition are purified that the perfection of meditation is purified.",
        "source": "T06n0220_245:0238a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若味界乃至舌觸為緣所生諸受清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故身界清淨，身界清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the body realm is purified, and because the body realm is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0238b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若身界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the body realm is purified, and if the pāramitā of meditation is purified, there are no two, no duality, no distinction, and no severance.",
        "source": "T06n0220_245:0238b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the sense element of contact, the sense element of body consciousness, and the sensations that arise from body contact and body contact as a condition are purified, and because the sense element of contact and even the sensations that arise from body contact as a condition are purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0238b09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238b12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若觸界乃至身觸為緣所生諸受清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the sense element of touch and even the sensations that arise from bodily contact as a condition are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238b12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故意界清淨，意界清淨故靜慮波羅蜜多清淨。",
        "translation": "The omniscience and knowledge are purified, the mental realm is purified, and the pāramitā of meditation is purified because the mental realm is purified.",
        "source": "T06n0220_245:0238b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若意界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the mind realm is purified, and if the pāramitā of meditation is purified, there are no duals, no distinctions, and no breaks.",
        "source": "T06n0220_245:0238b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as perceptual objects are purified, and because the Dharma realm and even the sensations that arise from mental contact as perceptual objects are purified that the perfection of meditation is purified.",
        "source": "T06n0220_245:0238b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若法界乃至意觸為緣所生諸受清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the experience that arises from the Dharma realm and even from mental contact as a condition is purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故地界清淨，地界清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the ground realm is purified, and because the ground realm is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0238b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若地界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the earth realm is purified, and if the pāramitā of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the water, fire, wind, air, and consciousness realms are purified, and because the water, fire, wind, air, and consciousness realms are purified that the perfection of meditation is purified.",
        "source": "T06n0220_245:0238b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若水、火、風、空、識界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if water, fire, air, space, and the consciousness realm are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故無明清淨，無明清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, nescience is purified, and because nescience is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0238c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若無明清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if ignorance is purified, and if the pāramitā of meditation is purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，行乃至老死愁歎苦憂惱清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, appropriation, existence, birth, and the sorrow, pain, and vexation of old age are purified, and because the sorrow, pain, and vexation of form and even old age are purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0238c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若行乃至老死愁歎苦憂惱清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if practice and even the sorrow, pain, and vexation of old age and death are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the perfection of generosity is purified, and because the perfection of generosity is purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0238c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若布施波羅蜜多清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the perfection of generosity is purified, and if the perfection of meditation is purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故淨戒、安忍、精進、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because omniscience is purified that pure morality, patience, effort, and the prajñāpāramitā are purified, and because pure morality and even the prajñāpāramitā are purified that the prajñāpāramitā of meditation is purified.",
        "source": "T06n0220_245:0238c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若淨戒乃至般若波羅蜜多清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the pure precepts and even the perfection of wisdom are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0238c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故內空清淨，內空清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, internal emptiness is purified, and because internal emptiness is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0238c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若內空清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if internal emptiness is purified, and if the perfection of meditation is purified, there are no two, no duality, no distinction, and no elimination.",
        "source": "T06n0220_245:0238c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，外空乃至無性自性空清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and cognition of everything are purified that external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, dispersed emptiness, immutable emptiness, intrinsic emptiness, self-subject emptiness, shared-subject emptiness, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and the pāramitā of meditation are purified because external emptiness and even natureless self-nature emptiness are purified.",
        "source": "T06n0220_245:0238c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0238c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若外空乃至無性自性空清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if external emptiness or even the emptiness of a natureless self-nature is purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0238c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故真如清淨，真如清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, true thusness is purified, and because true thusness is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239a02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若真如清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if true thusness is purified, and if the perfection of concentration is purified, there are no two, no duality, no distinctions, and no elimination.",
        "source": "T06n0220_245:0239a02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，法界乃至不思議界清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the inconceivable realm are purified, and because the Dharma realm and even the inconceivable realm are purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0239a04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若法界乃至不思議界清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the Dharma realm and even the inconceivable realm are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故苦聖諦清淨，苦聖諦清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若苦聖諦清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the noble truth of suffering is purified, and if the perfection of concentration is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故靜慮波羅蜜多清淨。",
        "translation": "If omniscience and knowledge are purified, then the noble truths of arising, ceasing, and the path are purified, and if the noble truths of arising, ceasing, and the path are purified, then the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若集、滅、道聖諦清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the noble truths of arising, cessation, and the path are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四靜慮清淨，四靜慮清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the four meditations are purified, and because the four meditations are purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四靜慮清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the four meditations are purified, and if the pāramitā of meditation is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0239a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四無量、四無色定清淨，四無量、四無色定清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified that the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四無量、四無色定清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the four immeasurable and four formless concentrations are purified, and if the perfection of meditation is purified, there are no duals, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_245:0239a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故八解脫清淨，八解脫清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the eight liberations are purified, and because the eight liberations are purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0239a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若八解脫清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the eight liberations are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no interruptions.",
        "source": "T06n0220_245:0239a27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and cognition are purified that the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified that the perfection of concentration is purified.",
        "source": "T06n0220_245:0239a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若八勝處、九次第定、十遍處清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239b02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四念住清淨，四念住清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, the perfection of concentration is purified.",
        "source": "T06n0220_245:0239b05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239b06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四念住清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the four abodes of mindfulness are purified, and if the perfection of meditation is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239b06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，四正斷乃至八聖道支清淨故靜慮波羅蜜多清淨。",
        "translation": "If omniscience and cognition are purified, then the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified, and if the fourfold correct elimination and even the eight noble factors of the path are purified, then the perfection of meditation is purified.",
        "source": "T06n0220_245:0239b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239b11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四正斷乃至八聖道支清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the fourfold correct elimination and even the eightfold noble path are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239b11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239b13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故空解脫門清淨，空解脫門清淨故靜慮波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the liberation gate of emptiness is purified, and because the liberation gate of emptiness is purified, the perfection of concentration is purified.",
        "source": "T06n0220_245:0239b14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239b15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若空解脫門清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge of emptiness are purified, if the liberation gate of emptiness is purified, and if the pāramitā of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239b15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the liberation gate of signlessness and wishlessness is purified, and because the liberation gate of signlessness and wishlessness is purified that the polamitra of meditation is purified.",
        "source": "T06n0220_245:0239b17_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239b19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若無相、無願解脫門清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the knowledge of omniscience is purified, if the liberation gate of signlessness and wishlessness is purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故菩薩十地清淨，菩薩十地清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the bodhisattva's ten stages are purified, and because the bodhisattva's ten stages are purified, the perfection of concentration is purified.",
        "source": "T06n0220_245:0239b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若菩薩十地清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the bodhisattva's ten stages are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故五眼清淨，五眼清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the five eyes are purified, and because the five eyes are purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若五眼清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the five eyes are purified, and if the pāramitā of meditation is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故六神通清淨，六神通清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the six supernormal powers are purified, and because the six supernormal powers are purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若六神通清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the six supernormal powers are purified, and if the perfection of concentration is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故佛十力清淨，佛十力清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0239c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若佛十力清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and wisdom are purified, if the Buddha's ten powers are purified, and if the pāramitā of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，四無所畏乃至十八佛不共法清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and wisdom are purified that the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-uncommon dharmas are purified, and because the four fearlessnesses and even the 18 Buddha-uncommon dharmas are purified that the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若四無所畏乃至十八佛不共法清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the four unsurpassables and even the 18 Buddha-principles are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239c13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故無忘失法清淨，無忘失法清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the state of no forgetfulness is purified, and because the state of no forgetfulness is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若無忘失法清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the principle of nonforgetfulness is purified, and if the pāramitā of meditation is purified, there are no duals, no dichotomies, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故恒住捨性清淨，恒住捨性清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the nature of equanimity is always abiding and pure, and because the pāramitā of meditation is purified that the nature of equanimity is always abiding and pure.",
        "source": "T06n0220_245:0239c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239c19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若恒住捨性清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the nature of equanimity is purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239c21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切智清淨，一切智清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience is purified, omniscience is purified, and because omniscience is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239c21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239c22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切智清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if omniscience is purified, and if the pāramitā of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故道相智、一切相智清淨，道相智、一切相智清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition of all characteristics are purified that knowledge of the path and cognition of all characteristics are purified, and because knowledge of the path and cognition of all characteristics are purified that the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0239c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若道相智、一切相智清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if knowledge of the path and omniscience are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0239c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0239c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故靜慮波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the dhāraṇī teachings are purified, and because the dhāraṇī teachings are purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0239c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切陀羅尼門清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge of all things are purified, if the dhāraṇī aspect of all things is purified, and if the pāramitā of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切三摩地門清淨，一切三摩地門清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because the omniscience and wisdom are purified that the entrance to all samādhis is purified, and because the entrance to all samādhis is purified that the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0240a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切三摩地門清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if all the approaches to samādhi are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故預流果清淨，預流果清淨故靜慮波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the fruit of stream-winner is purified, and because the fruit of stream-winner is purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0240a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若預流果清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the fruit of pre-flow is purified, and if the perfection of concentration is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故靜慮波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the fruit of once-returning, nonreturning, and arhatship are purified, and because the fruit of once-returning, nonreturning, and arhatship are purified that the wave of meditation and the perfection of wisdom are purified.",
        "source": "T06n0220_245:0240a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一來、不還、阿羅漢果清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故獨覺菩提清淨，獨覺菩提清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, the perfection of concentration is purified.",
        "source": "T06n0220_245:0240a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若獨覺菩提清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if pratyekabuddha enlightenment is purified, and if the perfection of concentration is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故靜慮波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, the pāramitā of meditation is purified.",
        "source": "T06n0220_245:0240a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若一切菩薩摩訶薩行清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if all bodhisattva-mahāsattva practices are purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故靜慮波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, the unsurpassed correct enlightenment of the buddhas is purified, and because the unsurpassed correct enlightenment of the buddhas is purified, the perfection of meditation is purified.",
        "source": "T06n0220_245:0240a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若諸佛無上正等菩提清淨，若靜慮波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if the unsurpassed correct enlightenment of the buddhas is purified, and if the perfection of meditation is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_245:0240b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故色清淨，色清淨故精進波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, form is purified, and because form is purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若色清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if form is purified, and if the perfection of effort is purified, there are no two, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_245:0240b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故受、想、行、識清淨，受、想、行、識清淨故精進波羅蜜多清淨。",
        "translation": "Because omniscience and cognition are purified, feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若受、想、行、識清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and cognition are purified, if feeling, perception, volition, and consciousness are purified, and if the perfection of effort is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故眼處清淨，眼處清淨故精進波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the locus of the eye is purified, and because the locus of the eye is purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若眼處清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the locus of the eye is purified, and if the perfection of effort is purified, there are no duals, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故精進波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the ear, nose, tongue, body, and mind are purified, and because the ear, nose, tongue, body, and mind are purified that the perfection of effort is purified.",
        "source": "T06n0220_245:0240b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若耳、鼻、舌、身、意處清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge are purified, if the ear, nose, tongue, body, and mind are purified, and if the perfection of effort is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故色處清淨，色處清淨故精進波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the form realm is purified, and because the form realm is purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若色處清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the form realm is purified, and if the perfection of effort is purified, there are no duals, no distinctions, and no breaks.",
        "source": "T06n0220_245:0240b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故精進波羅蜜多清淨。",
        "translation": "It's because omniscience and cognition are purified that the sense-field of sound, smell, taste, touch, and dharma are purified and because the sense-field of sound, smell, taste, touch, and dharma are purified that the perfection of effort is purified.",
        "source": "T06n0220_245:0240b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若聲、香、味、觸、法處清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the field of sound, smell, taste, touch, and dharmas is purified, and if the perfection of effort is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故眼界清淨，眼界清淨故精進波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the visual sphere is purified, and because the visual sphere is purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若眼界清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the eye realm is purified, and if the perfection of effort is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_245:0240b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故精進波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and because the form realm and even the sensations that arise from eye contact as a condition are purified that the perfection of effort is purified.",
        "source": "T06n0220_245:0240b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若色界乃至眼觸為緣所生諸受清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge are purified, if the form realm and even the sensations that arise from visual contact as a condition are purified, and if the perfection of effort is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故耳界清淨，耳界清淨故精進波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the auditory realm is purified, and because the auditory realm is purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若耳界清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge are purified, if the ear realm is purified, and if the perfection of effort is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_245:0240c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故精進波羅蜜多清淨。",
        "translation": "It's because the omniscience and cognition are purified that the sound element, the ear-consciousness element, and the sensations that arise from ear contact and ear contact as a condition are purified, and because the sound element and even the sensations that arise from ear contact as a condition are purified that the perfection of effort is purified.",
        "source": "T06n0220_245:0240c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若聲界乃至耳觸為緣所生諸受清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and cognition are purified, if the sense element of sound and even the sensations that arise from ear contact are purified, and if the perfection of effort is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故鼻界清淨，鼻界清淨故精進波羅蜜多清淨。",
        "translation": "Because omniscience and knowledge are purified, the nasal realm is purified, and because the nasal realm is purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若鼻界清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience and knowledge are purified, if the nasal sense realm is purified, and if the perfection of effort is purified, there are no two, no duality, no distinction, and no interruption.",
        "source": "T06n0220_245:0240c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故精進波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the sense element of fragrance, the sense element of the nose, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and because the sense element of fragrance and the sensations that arise from nasal contact as a condition are purified that the perfection of effort is purified.",
        "source": "T06n0220_245:0240c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若香界乃至鼻觸為緣所生諸受清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge are purified, if the sense-perceptions that arise from the sense-perceptions of fragrance and even nasal contact are purified, and if the perfection of effort is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_245:0240c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故舌界清淨，舌界清淨故精進波羅蜜多清淨。",
        "translation": "Because the omniscience and knowledge are purified, the tongue realm is purified, and because the tongue realm is purified, the perfection of effort is purified.",
        "source": "T06n0220_245:0240c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若舌界清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If the omniscience and knowledge are purified, if the tongue realm is purified, and if the perfection of effort is purified, there are no two, no duality, no distinction, and no elimination.",
        "source": "T06n0220_245:0240c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故精進波羅蜜多清淨。",
        "translation": "It's because the omniscience and knowledge are purified that the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are purified, and because the taste realm and even the sensations that arise from tongue contact as a condition are purified that the perfection of effort is purified.",
        "source": "T06n0220_245:0240c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_245:0240c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智智清淨，若味界乃至舌觸為緣所生諸受清淨，若精進波羅蜜多清淨，無二、無二分、無別、無斷故。",
        "translation": "If omniscience is purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if the perfection of effort is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_245:0240c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百四十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 245",
        "source": "T06n0220_245:0241a02_0",
        "is_bad_quality": false
    }
]