[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 409",
        "source": "T07n0220_496:0521a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六",
        "translation": "sixteen",
        "source": "T07n0220_496:0521a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_496:0521a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分善現品第三之十五",
        "translation": "Third Part of the Third Part of the Chapter on Good Presentations",
        "source": "T07n0220_496:0521a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "At that point, Kauśāmbī said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_496:0521a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩前際不可得、後際不可得、中際不可得。",
        "translation": "\"The bodhisattva-mahāsattva's prior limit is unobtainable, his subsequent limit is unobtainable, and his middle limit is unobtainable.",
        "source": "T07n0220_496:0521a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至識蘊無邊故，當知菩薩摩訶薩亦無邊；眼處乃至意處無邊故，當知菩薩摩訶薩亦無邊；色處乃至法處無邊故，當知菩薩摩訶薩亦無邊；眼界乃至意界無邊故，當知菩薩摩訶薩亦無邊；色界乃至法界無邊故，當知菩薩摩訶薩亦無邊；眼識界乃至意識界無邊故，當知菩薩摩訶薩亦無邊；眼觸乃至意觸無邊故，當知菩薩摩訶薩亦無邊；眼觸為緣所生諸受乃至意觸為緣所生諸受無邊故，當知菩薩摩訶薩亦無邊；地界乃至識界無邊故，當知菩薩摩訶薩亦無邊；因緣乃至增上緣無邊故，當知菩薩摩訶薩亦無邊；無明乃至老死無邊故，當知菩薩摩訶薩亦無邊；布施波羅蜜多乃至般若波羅蜜多無邊故，當知菩薩摩訶薩亦無邊；四念住乃至八聖道支無邊故，當知菩薩摩訶薩亦無邊；四靜慮、四無量、四無色定無邊故，當知菩薩摩訶薩亦無邊；八解脫、九次第定無邊故，當知菩薩摩訶薩亦無邊；空、無相、無願解脫門無邊故，當知菩薩摩訶薩亦無邊；五眼、六神通無邊故，當知菩薩摩訶薩亦無邊；如來十力乃至十八佛不共法無邊故，當知菩薩摩訶薩亦無邊；無忘失法、恒住捨性無邊故，當知菩薩摩訶薩亦無邊；一切智、道相智、一切相智無邊故，當知菩薩摩訶薩亦無邊；一切陀羅尼門、三摩地門無邊故，當知菩薩摩訶薩亦無邊；淨觀地乃至如來地無邊故，當知菩薩摩訶薩亦無邊；極喜地乃至法雲地無邊故，當知菩薩摩訶薩亦無邊；苦、集、滅、道聖諦無邊故，當知菩薩摩訶薩亦無邊；內空乃至無性自性空無邊故，當知菩薩摩訶薩亦無邊；真如乃至不思議界無邊故，當知菩薩摩訶薩亦無邊；斷界乃至無為界無邊故，當知菩薩摩訶薩亦無邊；聲聞、獨覺、大乘無邊故，當知菩薩摩訶薩亦無邊。",
        "translation": "色蘊乃至識蘊無邊故，當知菩薩摩訶薩亦無邊；眼處乃至意處無邊故，當知菩薩摩訶薩亦無邊；色處乃至法處無邊故，當知菩薩摩訶薩亦無邊；眼界乃至意界無邊故，當知菩薩摩訶薩亦無邊；色界乃至法界無邊故，當知菩薩摩訶薩亦無邊；眼識界乃至意識界無邊故，當知菩薩摩訶薩亦無邊；眼觸乃至意觸無邊故，當知菩薩摩訶薩亦無邊；眼觸為緣所生諸受乃至意觸為緣所生諸受無邊故，當知菩薩摩訶薩亦無邊；地界乃至識界無邊故，當知菩薩摩訶薩亦無邊；因緣乃至增上緣無邊故，當知菩薩摩訶薩亦無邊；無明乃至老死無邊故，當知菩薩摩訶薩亦無邊；布施波羅蜜多乃至般若波羅蜜多無邊故，當知菩薩摩訶薩亦無邊；四念住乃至八聖道支無邊故，當知菩薩摩訶薩亦無邊；四靜慮、四無量、四無色定無邊故，當知菩薩摩訶薩亦無邊；八解脫、九次第定無邊故，當知菩薩摩訶薩亦無邊；空、無相、無願解脫門無邊故，當知菩薩摩訶薩亦無邊；五眼、六神通無邊故，當知菩薩摩訶薩亦無邊；如來十力乃至十八佛不共法無邊故，當知菩薩摩訶薩亦無邊；無忘失法、恒住捨性無邊故，當知菩薩摩訶薩亦無邊；一切智、道相智、一切相智無邊故，當知菩薩摩訶薩亦無邊；一切陀羅尼門、三摩地門無邊故，當知菩薩摩訶薩亦無邊；淨觀地乃至如來地無邊故，當知菩薩摩訶薩亦無邊；極喜地乃至法雲地無邊故，當知菩薩摩訶薩亦無邊；苦、集、滅、道聖諦無邊故，當知菩薩摩訶薩亦無邊；內空乃至無性自性空無邊故，當知菩薩摩訶薩亦無邊；真如乃至不思議界無邊故，當知菩薩摩訶薩亦無邊；斷界乃至無為界無邊故，當知菩薩摩訶薩亦無邊；聲聞、獨覺、大乘無邊故，當知菩薩摩訶薩亦無邊。",
        "source": "T07n0220_496:0521a12_2",
        "is_bad_quality": true
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "\"Furthermore, Bhagavān!",
        "source": "T07n0220_496:0521b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即色蘊乃至識蘊，菩薩摩訶薩無所有不可得，離色蘊乃至識蘊，菩薩摩訶薩無所有不可得。",
        "translation": "That is, the aggregate of form and even the aggregate of consciousness are ungraspable, and apart from the aggregate of form and even the aggregate of consciousness, the bodhisattva Mahāsattva has nothing that's ungraspable.",
        "source": "T07n0220_496:0521b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至即聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得，離聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得。",
        "translation": "It's thus, even if it's the śrāvaka, the pratyekabuddha, or the great vehicle, the bodhisattva Mahāsattva has nothing that doesn't exist and cannot be attained apart from the śrāvaka, pratyekabuddha, and great vehicle.",
        "source": "T07n0220_496:0521b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，世尊！",
        "translation": "Thus, Bhagavān!",
        "source": "T07n0220_496:0521b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於此等一切法，以一切種、一切處、一切時，求菩薩摩訶薩都無所見竟不可得，云何令我以般若波羅蜜多教誡教授諸菩薩摩訶薩？",
        "translation": "How can I teach the bodhisattvas and mahāsattvas the precepts of prajñāpāramitā when it's impossible to see nothing in all these things that I seek from bodhisattvas of every kind, in every place, and at every time?",
        "source": "T07n0220_496:0521b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "\"Furthermore, Bhagavān!",
        "source": "T07n0220_496:0521b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩但有假名都無自性。",
        "translation": "\"All bodhisattvas, mahāsattvas, and buddhas have only nominal names that lack their own nature.",
        "source": "T07n0220_496:0521b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如說我等畢竟不生，但有假名都無自性，諸法亦爾，畢竟不生，但有假名都無自性。",
        "translation": "Just as it's said that we are ultimately unarisen but have nominal names that lack their own nature, so are all dharmas ultimately unarisen but have nominal names that lack their own nature.",
        "source": "T07n0220_496:0521b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_496:0521b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等色乃至識畢竟不生？",
        "translation": "What kind of form or even consciousness is ultimately unarisen?",
        "source": "T07n0220_496:0521b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若畢竟不生則不名色乃至識，如是乃至何等聲聞、獨覺、大乘畢竟不生？",
        "translation": "If it doesn't arise after all, then there's no name, form, or even consciousness; thus, how could it be that śrāvakas, solitary realizers, and the great vehicle don't arise after all?",
        "source": "T07n0220_496:0521b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若畢竟不生則不名聲聞、獨覺、大乘。",
        "translation": "If they are ultimately unarisen, then they aren't called śrāvakas, solitary realizers, or great vehicles.",
        "source": "T07n0220_496:0521c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_496:0521c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我豈能以畢竟不生般若波羅蜜多，教誡、教授畢竟不生菩薩摩訶薩？",
        "translation": "How could I instruct and teach a bodhisattva-mahāsattva that is ultimately unborn by means of the perfection of wisdom that is ultimately unborn?",
        "source": "T07n0220_496:0521c03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_496:0521c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離畢竟不生亦無菩薩摩訶薩能行無上正等菩提。",
        "translation": "Apart from the fact that nothing is ultimately produced, there's no bodhisattva-mahāsattva who can practice unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_496:0521c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_496:0521c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩聞如是說，心不沈沒亦不憂悔，其心不驚不恐不怖，當知是菩薩摩訶薩能行般若波羅蜜多。」",
        "translation": "If a bodhisattva-mahāsattva hears such a teaching and his mind doesn't sink, doesn't regret, and isn't frightened or terrified, that should be known as a bodhisattva-mahāsattva who can practice the perfection of wisdom.\"",
        "source": "T07n0220_496:0521c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽舍利子問具壽善現言：「何緣故說諸菩薩摩訶薩前際不可得、後際不可得、中際不可得？",
        "translation": "It was then that Kauśālīputra asked Kauśālīputra, \"What is the reason it's said that the first limit of bodhisattva-mahāsattvahood is unobtainable, the last limit is unobtainable, and the middle limit is unobtainable?",
        "source": "T07n0220_496:0521c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說色蘊乃至識蘊無邊故，當知菩薩摩訶薩亦無邊？",
        "translation": "\"For what reason is it said that the form aggregate and even the consciousness aggregate are limitless, and you should know that the bodhisattva-mahāsattva is also limitless?",
        "source": "T07n0220_496:0521c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至聲聞、獨覺、大乘無邊故，當知菩薩摩訶薩亦無邊？",
        "translation": "\"Thus, even though the śrāvakas, solitaries, and great vehicles are limitless, should you know that the bodhisattvas, mahāsattvas, and bodhisattvas are also limitless?",
        "source": "T07n0220_496:0521c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說即色蘊乃至識蘊，菩薩摩訶薩無所有不可得，離色蘊乃至識蘊，菩薩摩訶薩無所有不可得？",
        "translation": "\"What are the reasons for saying that the bodhisattva-mahāsattva's lack of existence is unobtainable when it comes to the aggregate of form and even the aggregate of consciousness and that the bodhisattva-mahāsattva's lack of existence is unobtainable when it comes to form and even the aggregate of consciousness?",
        "source": "T07n0220_496:0521c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至即聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得，離聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得？",
        "translation": "Is it true that, up to and including the śrāvakas, the solitary realizers, and the great vehicle, the bodhisattva, the mahāsattva, has nothing that's unobtainable, and that, apart from the śrāvakas, solitary realizers, and great vehicle, the bodhisattva, the mahāsattva, has nothing that's unobtainable?",
        "source": "T07n0220_496:0521c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說我於此等一切法，以一切種、一切處、一切時，求菩薩摩訶薩都無所見竟不可得，云何令我以般若波羅蜜多教誡教授諸菩薩摩訶薩？",
        "translation": "\"What makes it impossible to say that I can't see all these things in all kinds of ways, places, and times that bodhisattvas and mahāsattvas seek, and how can I teach bodhisattvas and mahāsattvas by means of the prajñāpāramitā teachings?",
        "source": "T07n0220_496:0521c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說諸菩薩摩訶薩但有假名都無自性？",
        "translation": "\"Why is it said that bodhisattvas, mahāsattvas, and bodhisattvas who merely have nominal names all lack self-nature?",
        "source": "T07n0220_496:0521c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說如說我等畢竟不生，但有假名都無自性？",
        "translation": "\"Why is it that it's said that we are ultimately unarisen but have nominal names that lack self-nature?",
        "source": "T07n0220_496:0521c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說諸法亦爾畢竟不生，但有假名都無自性？",
        "translation": "\"What is the reason for saying that all dharmas are ultimately unarisen but have nominal names that lack their own nature?",
        "source": "T07n0220_496:0521c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說何等色乃至識畢竟不生？",
        "translation": "\"For what reason is it said that such form and even consciousness are ultimately unarisen?",
        "source": "T07n0220_496:0521c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至何等聲聞、獨覺、大乘畢竟不生？",
        "translation": "Thus, even then, what kind of śrāvakas, solitaries, and great vehicles are not produced after all?",
        "source": "T07n0220_496:0521c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說若畢竟不生則不名色乃至識，如是乃至若畢竟不生則不名聲聞、獨覺、大乘？",
        "translation": "\"For what reason is it said that if form and even consciousness are not produced after all, and that such and such are not called śrāvakas, pratyekbuddhas, or great vehicles if they are not produced after all?",
        "source": "T07n0220_496:0521c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說我豈能以畢竟不生般若波羅蜜多，教誡教授畢竟不生菩薩摩訶薩？",
        "translation": "\"What makes it possible to say, 'Can I teach and instruct a bodhisattva-mahāsattva that is ultimately unborn by means of the perfection of wisdom that is ultimately unborn?'",
        "source": "T07n0220_496:0521c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說離畢竟不生亦無菩薩摩訶薩能行無上正等菩提？",
        "translation": "\"For what reason is it said that there are no bodhisattvas, mahāsattvas, or bodhisattvas who practice unsurpassed perfect enlightenment apart from ultimate nonarising?",
        "source": "T07n0220_496:0522a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何緣故說若菩薩摩訶薩聞如是說，心不沈沒亦不憂悔，其心不驚不恐不怖，當知是菩薩摩訶薩能行般若波羅蜜多？",
        "translation": "\"For what reason does it mean that if a bodhisattva-mahāsattva hears such a teaching and his mind isn't submerged and doesn't regret it, and his mind isn't frightened or terrified, you should know that this bodhisattva-mahāsattva is capable of practicing the perfection of wisdom?",
        "source": "T07n0220_496:0522a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「具壽今應為我演說。」",
        "translation": "\"Kauśāmbī should now explain this for me.\"",
        "source": "T07n0220_496:0522a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現答舍利子言：「尊者所問『何緣故說諸菩薩摩訶薩前際不可得、後際不可得、中際不可得？』",
        "translation": "At that point, Kauśāmbī replied to Śāriputra, \"The venerable asks, 'What is the reason we say that the first limit of bodhisattvahood is unobtainable, the last limit is unobtainable, and the middle limit is unobtainable?'",
        "source": "T07n0220_496:0522a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，舍利子！",
        "translation": "He, Śāriputra!",
        "source": "T07n0220_496:0522a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because sentient beings lack existence, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because sentient beings are empty, the front, back, and middle portions of the bodhisattva-mahāsattva cannot be attained.",
        "source": "T07n0220_496:0522a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because sentient beings are removed, the anterior, posterior, and middle reaches of the bodhisattva-mahāsattvas are unobtainable.",
        "source": "T07n0220_496:0522a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because sentient beings lack self-nature, the front, back, and middle reaches of the bodhisattva Mahāsattvas can't be attained.",
        "source": "T07n0220_496:0522a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至識蘊無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the aggregate of form and even the aggregate of consciousness are nonexistent, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are inaccessible.",
        "source": "T07n0220_496:0522a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至識蘊空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the aggregate of form and even the aggregate of consciousness are empty, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至識蘊遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the aggregate of form and even the aggregate of consciousness are removed, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至識蘊無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the aggregate of form and even the aggregate of consciousness lack self-nature, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處乃至意處無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"Because the sense-field of the eye and even the sense-field of the mind are nonexistent, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處乃至意處空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the sense-fields of the eye and even the sense-fields are empty, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處乃至意處遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the sense-fields of the eye and even the sense-fields are removed, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處乃至意處無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the sense-fields of the eye and even the sense-fields are devoid of self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處乃至法處無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the form realm and even the Dharma realm are nonexistent, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處乃至法處空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the form realm and even the Dharma realm are empty, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處乃至法處遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the form realm and even the Dharma realm are remote, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處乃至法處無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the form realm and even the Dharma realm lack self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界乃至意界無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the visual realm and even the mental realm are nonexistent, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界乃至意界空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the visual realm and even the mental realm are empty, the bodhisattva-mahāsattva's anterior, posterior, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界乃至意界遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the visual realm and even the mental realm are removed that the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界乃至意界無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the visual realm and even the mental realm lack self-nature, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界乃至法界無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the form realm and even the Dharma realm are nonexistent, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界乃至法界空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the form realm and even the Dharma realm are empty that the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界乃至法界遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the form realm and even the Dharma realm are remote that the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界乃至法界無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the form realm and even the Dharma realm lack self-nature that the bodhisattva-mahāsattvas' past, future, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522b11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識界乃至意識界無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"It's because the element of visual consciousness and even the element of consciousness are nonexistent that the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識界乃至意識界空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the element of visual consciousness and even the element of consciousness are empty, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識界乃至意識界遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the element of visual consciousness and even the element of consciousness are removed, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識界乃至意識界無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the element of visual consciousness and even the element of consciousness lack self-nature, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸乃至意觸無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because visual contact and even mental contact lack existence, the bodhisattva-mahāsattvas' prior, final, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522b17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸乃至意觸空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because visual contact and even mental contact are empty, the bodhisattvas, the mahāsattvas, cannot attain the front, back, or middle range.",
        "source": "T07n0220_496:0522b18_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸乃至意觸遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because visual contact and even mental contact are removed, the bodhisattvas, mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0522b19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸乃至意觸無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because visual contact and even mental contact lack self-nature, the bodhisattvas, the mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0522b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522b22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are nonexistent, the bodhisattvas, mahāsattvas, and their antecedents, postecedents, and middle range are inapprehensible.",
        "source": "T07n0220_496:0522b22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are empty, the bodhisattvas, mahāsattvas, before, after, and in the middle cannot come into existence.",
        "source": "T07n0220_496:0522b24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are removed, the bodhisattvas, mahāsattvas, before, after, and in the middle cannot come into existence.",
        "source": "T07n0220_496:0522b26_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are devoid of their own nature, the bodhisattvas, mahāsattvas, before, after, and in the middle cannot come into being.",
        "source": "T07n0220_496:0522b28_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522c01_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界乃至識界無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the earth realm and even the consciousness realm are nonexistent, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c01_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界乃至識界空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the earth realm and even the consciousness realm are empty, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界乃至識界遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the earth realm and even the consciousness realm are removed, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界乃至識界無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the earth realm and even the consciousness realm lack self-nature, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣乃至增上緣無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because causes and conditions and even contributory conditions are nonexistent, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣乃至增上緣空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the causes and conditions and even the contributory conditions are empty, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣乃至增上緣遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because causes and conditions and even superior conditions are distant, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣乃至增上緣無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because causes and conditions and even superior conditions lack self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明乃至老死無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because nescience and even old age and death have no existence, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明乃至老死空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because nescience and even old age and death are empty, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明乃至老死遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because nescience and even old age and death are removed, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明乃至老死無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because nescience and even old age and death lack self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0522c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"It's because the perfection of generosity and even the perfection of wisdom have no existence that the bodhisattvas, mahāsattvas, and their intermediate state are unobtainable before, after, and in the middle.",
        "source": "T07n0220_496:0522c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the perfection of generosity and even the perfection of wisdom are empty, the bodhisattvas, mahāsattvas, and the middle range are unobtainable.",
        "source": "T07n0220_496:0522c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the perfection of generosity and even the perfection of wisdom are removed, the bodhisattvas, the Mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0522c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the perfection of generosity and even the perfection of wisdom have no self-nature, the bodhisattvas, Mahāsattvas, and others cannot attain their prior, subsequent, or intermediate limits.",
        "source": "T07n0220_496:0522c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0522c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住乃至八聖道支無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"It's because the four abodes of mindfulness and the eight noble factors of the path are nonexistent that the bodhisattvas, mahāsattvas, before, after, and in the interim cannot attain them.",
        "source": "T07n0220_496:0522c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住乃至八聖道支空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the four abodes of mindfulness and the eight noble factors of the path are empty, the bodhisattvas, the mahāsattvas, before, after, and in the middle are unobtainable.",
        "source": "T07n0220_496:0522c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住乃至八聖道支遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the four abodes of mindfulness and even the eight noble factors of the path are removed, the bodhisattvas, the mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0522c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住乃至八聖道支無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the four abodes of mindfulness and the eight noble factors of the path lack self-nature, the bodhisattvas, Mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0522c29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523a02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the four meditations, the four immeasurable concentrations, and the four formless concentrations lack existence, the bodhisattvas, mahāsattvas, before, after, and in the interim cannot attain them.",
        "source": "T07n0220_496:0523a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the four meditations, the four immeasurable concentrations, and the four formless concentrations are empty, the bodhisattvas, the mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523a03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the four meditations, the four immeasurable concentrations, and the four formless concentrations are removed, the bodhisattvas, the Mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the four meditations, four immeasurable concentrations, and four formless concentrations lack their own nature, the bodhisattvas, Mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523a06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523a08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫、九次第定無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the eight liberations and nine graduated concentrations have no existence, the bodhisattvas, mahāsattvas, before, after, and in the intermediate realm cannot attain them.",
        "source": "T07n0220_496:0523a08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫、九次第定空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the eight liberations and nine graduated concentrations are empty, the bodhisattvas, mahāsattvas, and their anterior, posterior, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523a09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫、九次第定遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the eight liberations and nine graduated concentrations are distant, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫、九次第定無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the eight liberations and nine secondary concentrations lack self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523a12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523a13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無願解脫門無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the liberation gate of emptiness, signlessness, and wishlessness has no existence, the first, last, and middle reaches of the bodhisattvas, the mahāsattvas, and the buddhas cannot be obtained.",
        "source": "T07n0220_496:0523a14_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無願解脫門空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the liberation gate of emptiness, signlessness, and wishlessness is empty, the anterior, posterior, and middle reaches of the bodhisattvas, the mahāsattvas, and the buddhas cannot come into existence.",
        "source": "T07n0220_496:0523a15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無願解脫門遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the liberation gate of emptiness, signlessness, and wishlessness is removed, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523a16_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無願解脫門無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the liberation gate of emptiness, signlessness, and wishlessness has no self-nature, the bodhisattvas, the Mahāsattvas, before, after, and in the middle cannot attain it.",
        "source": "T07n0220_496:0523a18_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523a19_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼、六神通無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the five eyes and the six supernormal powers lack existence, the bodhisattvas, the mahāsattvas, before, after, and in the interim cannot attain them.",
        "source": "T07n0220_496:0523a19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼、六神通空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the five eyes and the six psychic powers are empty, the bodhisattva-mahāsattvas' past, future, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523a21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼、六神通遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the five eyes and the six psychic powers are removed, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523a22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼、六神通無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the five eyes and the six psychic powers lack their own nature, the bodhisattva-mahāsattvas' past, future, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523a23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523a24_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來十力乃至十八佛不共法無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"It's because the Tathāgata's ten powers and the 18 Buddha-uncommon dharmas lack existence that the bodhisattvas, mahāsattvas, and their intermediate state can't come into existence before, after, or at the middle.",
        "source": "T07n0220_496:0523a24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來十力乃至十八佛不共法空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the Tathāgata's ten powers and the 18 Buddha's distinctive qualities are empty that the bodhisattvas, mahāsattvas, and the middle range are unobtainable before, after, and afterward.",
        "source": "T07n0220_496:0523a26_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來十力乃至十八佛不共法遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the Tathāgata's ten powers and the 18 buddha-principles are removed, the bodhisattvas, mahāsattvas, and the middle range cannot be attained before, after, or afterward.",
        "source": "T07n0220_496:0523a28_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來十力乃至十八佛不共法無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the Tathāgata's ten powers and the 18 Buddha-uncommon dharmas lack their own nature, the bodhisattvas, mahāsattvas, and their intermediate state can't attain them before, after, or at the middle.",
        "source": "T07n0220_496:0523a29_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523b02_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法、恒住捨性無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the absence of forgetfulness and the nature of constantly abiding equanimity have nothing, the bodhisattvas, mahāsattvas, and the middle range are unobtainable.",
        "source": "T07n0220_496:0523b02_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法、恒住捨性空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the nature of nonforgetfulness and constant abiding in equanimity is empty, the bodhisattvas, mahāsattvas, and the middle range are unobtainable before, after, and afterward.",
        "source": "T07n0220_496:0523b04_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法、恒住捨性遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the absence of forgetfulness and the permanently abiding nature of equanimity are removed, the bodhisattvas, Mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523b05_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法、恒住捨性無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the absence of forgetfulness and the permanently abiding nature of equanimity have no self-nature, the bodhisattvas, Mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523b06_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523b08_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"It's because omniscience, knowledge of the path, and knowledge of all characteristics lack existence that the bodhisattvas, mahāsattvas, and their intermediate state are unobtainable before, after, and in between.",
        "source": "T07n0220_496:0523b08_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because omniscience, knowledge of the path, and knowledge of all characteristics are empty, the bodhisattvas, mahāsattvas, before, after, and in the middle are unobtainable.",
        "source": "T07n0220_496:0523b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because omniscience, knowledge of the path, and knowledge of all characteristics are removed, the bodhisattvas, mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because omniscience, knowledge of the path, and knowledge of all characteristics lack self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門、三摩地門無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"It's because all dhāraṇī entries and samādhi entries lack existence that the bodhisattvas, mahāsattvas, and the middle range cannot be obtained before, after, or afterward.",
        "source": "T07n0220_496:0523b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門、三摩地門空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because all the dhāraṇī aspects and the approach to samādhi are empty, the bodhisattvas, the mahāsattvas, before, after, and in the middle are unobtainable.",
        "source": "T07n0220_496:0523b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門、三摩地門遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because all the dhāraṇī aspects and the approach to samādhi are removed, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門、三摩地門無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because all the dhāraṇī aspects and the approach to samādhi lack self-nature, the bodhisattvas, mahāsattvas, and the middle reaches can't be attained before, after, or at the midpoint.",
        "source": "T07n0220_496:0523b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨觀地乃至如來地無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the ground of pure contemplation and even the ground of the Tathāgata lack existence, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨觀地乃至如來地空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the ground of pure contemplation ... the ground of the Tathāgata is empty, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨觀地乃至如來地遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the ground of pure contemplation ... the ground of the Tathāgata is removed that the front, back, and middle reaches of the bodhisattva-mahāsattvas can't be obtained.",
        "source": "T07n0220_496:0523b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨觀地乃至如來地無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the ground of pure contemplation and even the ground of the Tathāgata lack self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches can't be obtained.",
        "source": "T07n0220_496:0523b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地乃至法雲地無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the ground of ultimate joy ... the ground of the Dharma clouds has no existence, the bodhisattvas, mahāsattvas, and the middle range are unobtainable.",
        "source": "T07n0220_496:0523b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地乃至法雲地空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the ground of ultimate joy ... the ground of the Dharma clouds is empty, the bodhisattvas, the mahāsattvas, before, after, and in the middle are unobtainable.",
        "source": "T07n0220_496:0523b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地乃至法雲地遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the ground of ultimate joy ... the ground of the Dharma clouds is removed, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地乃至法雲地無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the ground of ultimate joy ... the ground of the Dharma clouds has no self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦、集、滅、道聖諦無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the noble truths of suffering, arising, cessation, and the path lack existence, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦、集、滅、道聖諦空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the noble truths of suffering, arising, ceasing, and the path are empty, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦、集、滅、道聖諦遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the noble truths of suffering, arising, ceasing, and the path are removed, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦、集、滅、道聖諦無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the noble truths of suffering, arising, ceasing, and the path lack self-nature, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches can't be attained.",
        "source": "T07n0220_496:0523c07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523c08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無性自性空無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because internal emptiness and even the emptiness of a natureless self-nature have no existence, the bodhisattvas, mahāsattvas, and the middle range are unobtainable.",
        "source": "T07n0220_496:0523c08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無性自性空空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because internal emptiness and even the emptiness of the natureless self-nature are empty, the bodhisattvas, the mahāsattvas, before, after, and in the middle are unobtainable.",
        "source": "T07n0220_496:0523c10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無性自性空遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because internal emptiness and even the emptiness of the natureless self-nature are removed, the bodhisattvas, mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523c11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無性自性空無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because internal emptiness and even the emptiness of a natureless self-nature have no self-nature, the bodhisattvas, mahāsattvas, before, after, and in the middle cannot attain them.",
        "source": "T07n0220_496:0523c13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523c14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如乃至不思議界無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "\"It's because true thusness and even the inconceivable realm lack existence that the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c14_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如乃至不思議界空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the true thusness and even the absence of the contemplated realm that the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如乃至不思議界遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the true thusness and even the inconceivable absence of the realm that the bodhisattva mahāsattvas' prior, subsequent, and middle extremes are unobtainable.",
        "source": "T07n0220_496:0523c17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如乃至不思議界無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "It's because the true thusness and even the inconceivable realm lack self-nature that the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523c20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷界乃至無為界無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the elimination realm and even the realm of nothingness lack existence, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷界乃至無為界空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the elimination realm and even the realm of noncontrivance are empty, the bodhisattva-mahāsattvas' prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷界乃至無為界遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the elimination realm and even the realm of nothingness are remote, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷界乃至無為界無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the elimination realm and even the realm of nothingness lack self-nature, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0523c26_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺、大乘無所有故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the direct disciples, the solitary realizers, and the great vehicle lack existence, the bodhisattvas, the mahāsattvas, before, after, and in the interim cannot attain them.",
        "source": "T07n0220_496:0523c26_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺、大乘空故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the śrāvaka, pratyekabuddha, and great vehicle are empty, the bodhisattva-mahāsattvas cannot attain the front, back, or middle range.",
        "source": "T07n0220_496:0523c27_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺、大乘遠離故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the śrāvaka, pratyekabuddha, and great vehicle are removed, the bodhisattva Mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0523c28_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺、大乘無自性故，諸菩薩摩訶薩前、後、中際不可得。",
        "translation": "Because the śrāvaka, pratyekabuddha, and great vehicle lack self-nature, the bodhisattva-mahāsattva's prior, subsequent, and middle reaches are unobtainable.",
        "source": "T07n0220_496:0524a01_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T07n0220_496:0524a02_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_496:0524a02_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情乃至大乘無所有、空、遠離、無自性中，諸菩薩摩訶薩前、後、中際皆不可得故。",
        "translation": "It's because sentient beings and even the great vehicle are nothing, empty, isolated, and lacking in self-nature, and the bodhisattvas, mahāsattvas, before, after, and in the middle are all unobtainable.",
        "source": "T07n0220_496:0524a02_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_496:0524a04_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非有情乃至大乘無所有有異，非有情乃至大乘空有異，非有情乃至大乘遠離有異，非有情乃至大乘無自性有異，非菩薩摩訶薩前際有異，非菩薩摩訶薩後際有異，非菩薩摩訶薩中際有異。",
        "translation": "There's no difference between sentient beings and the Mahāyāna as being without existence, between sentient beings and the Mahāyāna as being empty, between sentient beings and the Mahāyāna as being free from existence, between sentient beings and the Mahāyāna as being without self-nature, between the bodhisattva Mahāsattva at the front end, between the bodhisattva Mahāsattva at the back end, and between the bodhisattva Mahāsattva at the middle end.",
        "source": "T07n0220_496:0524a04_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0524a09_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有情乃至大乘無所有，若有情乃至大乘空，若有情乃至大乘遠離，若有情乃至大乘無自性，若菩薩摩訶薩前際，若菩薩摩訶薩後際，若菩薩摩訶薩中際，如是一切皆無二、無二分。",
        "translation": "If sentient beings or even the great vehicle lack existence, if sentient beings or even the great vehicle are empty, if sentient beings or even the great vehicle are free, if sentient beings or even the great vehicle lack self-nature, if there are bodhisattvas, mahāsattvas, bodhisattvas, and bodhisattvas in the middle, all of these things are without duality and without distinction.",
        "source": "T07n0220_496:0524a09_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_496:0524a13_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，我作是說：諸菩薩摩訶薩前、後、中際皆不可得。",
        "translation": "For this reason, I say this: None of the bodhisattvas, mahāsattvas, before, after, or in the middle can be attained.",
        "source": "T07n0220_496:0524a13_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T07n0220_496:0524a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者所問『何緣故說色蘊乃至識蘊無邊故，當知菩薩摩訶薩亦無邊？",
        "translation": "The Venerable asked, 'What is the reason it's said that the form aggregate and even the consciousness aggregate are limitless, so you should know that the bodhisattva-mahāsattva is also limitless?'",
        "source": "T07n0220_496:0524a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至聲聞、獨覺、大乘無邊故，當知菩薩摩訶薩亦無邊？』",
        "translation": "Thus, even if the śrāvakas, solitaries, and great vehicles are limitless, should you know that the bodhisattvas, mahāsattvas, and bodhisattvas are also limitless?'",
        "source": "T07n0220_496:0524a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，舍利子！",
        "translation": "He, Śāriputra!",
        "source": "T07n0220_496:0524a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至大乘皆如虛空。",
        "translation": "\"The aggregate of form ... the great vehicle is like space.",
        "source": "T07n0220_496:0524a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_496:0524a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如太虛空前、後、中際皆不可得，由彼中、邊俱不可得說為虛空，色蘊乃至大乘亦復如是，前、後、中際俱不可得。",
        "translation": "Just as the first, last, and middle portions of space are all unknowable, and since both the middle and the extremes are unknowable, it's said to be space, so too are the form aggregate and even the great vehicle, in which the first, last, and middle portions are all unknowable.",
        "source": "T07n0220_496:0524a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_496:0524a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至大乘皆性空故，空中前際、後際、中際皆不可得，亦以中、邊俱不可得故說為空。",
        "translation": "Because the aggregate of form and even the great vehicle are empty in nature, the prior, subsequent, and middle portions of the sky are unknowable, and it's because the middle and the extremes are both unknowable that they're said to be empty.",
        "source": "T07n0220_496:0524a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_496:0524a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，我作是說：色蘊乃至識蘊無邊故，當知菩薩摩訶薩亦無邊。",
        "translation": "Because of this cause and condition, I say this: \"Because the form aggregate and even the consciousness aggregate are limitless, you should know that the bodhisattva Mahāsattva is also limitless.",
        "source": "T07n0220_496:0524a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至聲聞、獨覺、大乘無邊故，當知菩薩摩訶薩亦無邊。",
        "translation": "Thus, even as the śrāvaka, pratyekabuddha, and great vehicle are limitless, you should know that the bodhisattva-mahāsattva is also limitless.",
        "source": "T07n0220_496:0524a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T07n0220_496:0524a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者所問『何緣故說即色蘊乃至識蘊，菩薩摩訶薩無所有不可得，離色蘊乃至識蘊，菩薩摩訶薩無所有不可得；如是乃至即聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得，離聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得？』",
        "translation": "The Venerable asked, 'What is the reason it's said that, namely, the aggregate of form and even the aggregate of consciousness, the bodhisattva-mahāsattva has nothing that's unobtainable, and that, apart from the aggregate of form and even the aggregate of consciousness, the bodhisattva-mahāsattva has nothing that's unobtainable; and that, even up to and including the śrāvakas, solitary realizers, and the great vehicle, the bodhisattva-mahāsattva has nothing that's unobtainable, and that, apart from the śrāvakas, solitary realizers, and the great vehicle, the bodhisattva-mahāsattva has nothing that's unobtainable?'",
        "source": "T07n0220_496:0524a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，舍利子！",
        "translation": "He, Śāriputra!",
        "source": "T07n0220_496:0524b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至大乘色蘊乃至大乘性空。",
        "translation": "\"The aggregate of form ... the aggregate of Mahāyāna form ... the nature of Mahāyāna emptiness.",
        "source": "T07n0220_496:0524b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_496:0524b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至大乘性空中，色蘊乃至大乘無所有不可得故，諸菩薩摩訶薩亦無所有不可得。",
        "translation": "\"Since the aggregate of form and even the nature of the great vehicle are empty, it follows that the aggregate of form and even the great vehicle have nothing and can't be obtained, and the bodhisattvas, the Mahāsattvas, also have nothing and can't be obtained.",
        "source": "T07n0220_496:0524b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0524b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非色蘊乃至非大乘非色蘊乃至非大乘性空。",
        "translation": "It's not the aggregate of form ... it's not the Mahāyāna aggregate of form ... it's not the Mahāyāna nature of emptiness.",
        "source": "T07n0220_496:0524b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_496:0524b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非色蘊乃至非大乘性空中，非色蘊乃至非大乘無所有不可得故，諸菩薩摩訶薩亦無所有不可得。",
        "translation": "Because what's not the aggregate of form and what's not the nature of the great vehicle is empty, and because what's not the aggregate of form and what's not the great vehicle has nothing that can't be obtained, the bodhisattvas, Mahāsattvas, and others also have nothing that can't be obtained.",
        "source": "T07n0220_496:0524b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_496:0524b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，我作是說：即色蘊乃至識蘊，菩薩摩訶薩無所有不可得，離色蘊乃至識蘊，菩薩摩訶薩無所有不可得。",
        "translation": "Because of this, I say this: That is, the bodhisattva-mahāsattva has nothing that's unobtainable in the aggregate of form ... the aggregate of consciousness, and the bodhisattva-mahāsattva has nothing that's unobtainable apart from the aggregate of form ... the aggregate of consciousness.",
        "source": "T07n0220_496:0524b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至即聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得，離聲聞、獨覺、大乘，菩薩摩訶薩無所有不可得。",
        "translation": "Thus, it means that the bodhisattva Mahāsattva has nothing that's unobtainable even if it's the śrāvaka, pratyekabuddha, or great vehicle, and the bodhisattva Mahāsattva has nothing that's unobtainable apart from the śrāvaka, pratyekabuddha, and great vehicle.",
        "source": "T07n0220_496:0524b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T07n0220_496:0524b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者所問『何緣故說我於此等一切法，以一切種、一切處、一切時，求菩薩摩訶薩都無所見竟不可得，云何令我以般若波羅蜜多教誡教授諸菩薩摩訶薩？』",
        "translation": "The Venerable asked, 'What makes it impossible to say that I have no view of all these things that bodhisattvas and mahāsattvas seek in terms of all types, all places, and all times, and how do I teach bodhisattvas and mahāsattvas with the prajñāpāramitā instructions?'",
        "source": "T07n0220_496:0524b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，舍利子！",
        "translation": "He, Śāriputra!",
        "source": "T07n0220_496:0524b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色於色不可得，色於受、想、行、識亦不可得。",
        "translation": "Form is unobtainable in form, and form is unobtainable in feeling, perception, volition, and consciousness.",
        "source": "T07n0220_496:0524b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受於受不可得，受於色、想、行、識亦不可得。",
        "translation": "Regarding feeling, it's unobtainable, and regarding feeling, form, perception, volition, and consciousness, it's also unobtainable.",
        "source": "T07n0220_496:0524b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "想於想不可得，想於色、受、行、識亦不可得。",
        "translation": "While perception is unobtainable in perception, perception is also unobtainable in form, feeling, volition, and consciousness.",
        "source": "T07n0220_496:0524b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行於行不可得，行於色、受、想、識亦不可得。",
        "translation": "Action is unobtainable in action, and action is unobtainable in form, feeling, perception, and consciousness.",
        "source": "T07n0220_496:0524b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識於識不可得，識於色、受、想、行亦不可得。",
        "translation": "Consciousness is unobtainable in terms of consciousness, and consciousness is unobtainable in terms of form, feeling, perception, and volition.",
        "source": "T07n0220_496:0524b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0524b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處於眼處不可得，眼處於耳、鼻、舌、身、意處亦不可得。",
        "translation": "\"The sense-field of the eye can't be obtained in the sense-field of the eye, and the sense-field of the ear, nose, tongue, body, and mind can't be obtained in the sense-field of the eye.",
        "source": "T07n0220_496:0524b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳處於耳處不可得，耳處於眼、鼻、舌、身、意處亦不可得。",
        "translation": "The sense-field of the ear is unobtainable in the sense-field of the ear, and the sense-field of the ear is unobtainable in the sense-field of the eye, nose, tongue, body, and mind.",
        "source": "T07n0220_496:0524b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻處於鼻處不可得，鼻處於眼、耳、舌、身、意處亦不可得。",
        "translation": "The sense-field of the nose is unobtainable in the sense-field of the nose, and the sense-field of the nose is unobtainable in the sense-fields of the eye, ear, tongue, body, and mind.",
        "source": "T07n0220_496:0524b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌處於舌處不可得，舌處於眼、耳、鼻、身、意處亦不可得。",
        "translation": "The place of the tongue is unobtainable in the place of the tongue, and the place of the tongue is unobtainable in the place of the eyes, ears, nose, body, and mind.",
        "source": "T07n0220_496:0524b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身處於身處不可得，身處於眼、耳、鼻、舌、意處亦不可得。",
        "translation": "The abode of the body in the abode of the body is unobtainable, and the abode of the body in the abode of the eye, ear, nose, tongue, and mind is also unobtainable.",
        "source": "T07n0220_496:0524b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意處於意處不可得，意處於眼、耳、鼻、舌、身處亦不可得。",
        "translation": "The mind's abode in the abode of the mind is unobtainable, and the mind's abode in the abode of the eye, ear, nose, tongue, and body is also unobtainable.",
        "source": "T07n0220_496:0524c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0524c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處於色處不可得，色處於聲、香、味、觸、法處亦不可得。",
        "translation": "\"The sense-field of form is unobtainable in the sense-field of form, and the sense-field of form is unobtainable in the sense-field of sound, odor, taste, touch, and dharmas.",
        "source": "T07n0220_496:0524c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲處於聲處不可得，聲處於色、香、味、觸、法處亦不可得。",
        "translation": "The field of sound is unobtainable in the field of sound, and the field of sound is unobtainable in the fields of form, sound, taste, touch, and dharmas.",
        "source": "T07n0220_496:0524c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香處於香處不可得，香處於色、聲、味、觸、法處亦不可得。",
        "translation": "The field of fragrance is unobtainable in the field of fragrance, and the field of fragrance is unobtainable in the fields of form, sound, taste, touch, and dharmas.",
        "source": "T07n0220_496:0524c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "味處於味處不可得，味處於色、聲、香、觸、法處亦不可得。",
        "translation": "The sense-field of taste is unobtainable in the sense-field of taste, and the sense-field of taste is unobtainable in the sense-fields of form, sound, odor, touch, and dharma.",
        "source": "T07n0220_496:0524c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸處於觸處不可得，觸處於色、聲、香、味、法處亦不可得。",
        "translation": "The sense-field of touch is unobtainable in the sense-field of touch, and the sense-field of touch is unobtainable in the sense-fields of form, sound, odor, taste, and dharmas.",
        "source": "T07n0220_496:0524c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法處於法處不可得，法處於色、聲、香、味、觸處亦不可得。",
        "translation": "The abode of dharmas is unobtainable in the abode of dharmas, and the abode of dharmas is unobtainable in the abodes of form, sound, odor, taste, and touch.",
        "source": "T07n0220_496:0524c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0524c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界於眼界不可得，眼界於耳、鼻、舌、身、意界亦不可得。",
        "translation": "The element of vision can't be obtained in the element of vision, and the element of vision can't be obtained in the elements of ear, nose, tongue, body, and mind.",
        "source": "T07n0220_496:0524c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界於耳界不可得，耳界於眼、鼻、舌、身、意界亦不可得。",
        "translation": "The ear realm is incomprehensible in the ear realm, and the ear realm is incomprehensible in the eye, nose, tongue, body, and mind realms.",
        "source": "T07n0220_496:0524c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界於鼻界不可得，鼻界於眼、耳、舌、身、意界亦不可得。",
        "translation": "The nose realm is incomprehensible in the nose realm, and the nose realm is incomprehensible in the eye, ear, tongue, body, and mind realms.",
        "source": "T07n0220_496:0524c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界於舌界不可得，舌界於眼、耳、鼻、身、意界亦不可得。",
        "translation": "The tongue realm is incomprehensible in the tongue realm, and the tongue realm is incomprehensible in the eye, ear, nose, body, and mind realms.",
        "source": "T07n0220_496:0524c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界於身界不可得，身界於眼、耳、鼻、舌、意界亦不可得。",
        "translation": "The body realm is incomprehensible in the body realm, and the body realm is incomprehensible in the eye, ear, nose, tongue, and mind realms.",
        "source": "T07n0220_496:0524c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界於意界不可得，意界於眼、耳、鼻、舌、身界亦不可得。",
        "translation": "The mental element is unobtainable in the mental element, and the mental element is unobtainable in the element of the eye, ear, nose, tongue, and body.",
        "source": "T07n0220_496:0524c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0524c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界於色界不可得，色界於聲、香、味、觸、法界亦不可得。",
        "translation": "The form realm is inapprehensible in the form realm, and the form realm is inapprehensible in the sound, smell, taste, touch, and dharma realms.",
        "source": "T07n0220_496:0524c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲界於聲界不可得，聲界於色、香、味、觸、法界亦不可得。",
        "translation": "The element of sound is inapprehensible in the element of sound, and the element of sound is inapprehensible in the elements of form, sound, taste, touch, and dharmas.",
        "source": "T07n0220_496:0524c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香界於香界不可得，香界於色、聲、味、觸、法界亦不可得。",
        "translation": "The element of fragrance can't be obtained in the element of fragrance, and the element of fragrance can't be obtained in the elements of form, sound, taste, touch, and dharmas.",
        "source": "T07n0220_496:0524c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "味界於味界不可得，味界於色、聲、香、觸、法界亦不可得。",
        "translation": "The element of taste is inapprehensible in the element of taste, and the element of taste is inapprehensible in the elements of form, sound, odor, touch, and dharmas.",
        "source": "T07n0220_496:0524c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸界於觸界不可得，觸界於色、聲、香、味、法界亦不可得。",
        "translation": "The tactile element is incomprehensible in the tactile element, and the tactile element is incomprehensible in the form, sound, odor, taste, and dharma elements.",
        "source": "T07n0220_496:0524c23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界於法界不可得，法界於色、聲、香、味、觸界亦不可得。",
        "translation": "The element of dharma can't be obtained in the element of dharma, and the element of dharma can't be obtained in the elements of form, sound, odor, taste, and touch.",
        "source": "T07n0220_496:0524c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0524c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識界於眼識界不可得，眼識界於耳、鼻、舌、身、意識界亦不可得。",
        "translation": "The element of the visual consciousness is inapprehensible in the element of the visual consciousness, and the element of the visual consciousness is inapprehensible in the element of the ear, nose, tongue, body, and consciousness.",
        "source": "T07n0220_496:0524c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳識界於耳識界不可得，耳識界於眼、鼻、舌、身、意識界亦不可得。",
        "translation": "The element of the ear consciousness is inapprehensible in the element of the ear consciousness, and the element of the ear consciousness is inapprehensible in the elements of eye, nose, tongue, body, and consciousness.",
        "source": "T07n0220_496:0524c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻識界於鼻識界不可得，鼻識界於眼、耳、舌、身、意識界亦不可得。",
        "translation": "The nasal consciousness factor is inapprehensible in the nasal consciousness factor, and the nasal consciousness factor is inapprehensible in the element of vision, ear, tongue, body, and consciousness.",
        "source": "T07n0220_496:0524c29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌識界於舌識界不可得，舌識界於眼、耳、鼻、身、意識界亦不可得。",
        "translation": "The tongue consciousness realm is inapprehensible in the tongue consciousness realm, and the tongue consciousness realm is inapprehensible in the eye, ear, nose, body, and consciousness realms.",
        "source": "T07n0220_496:0525a01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身識界於身識界不可得，身識界於眼、耳、鼻、舌、意識界亦不可得。",
        "translation": "The body consciousness realm is incomprehensible in the body consciousness realm, and the body consciousness realm is incomprehensible in the eye, ear, nose, tongue, and consciousness realms.",
        "source": "T07n0220_496:0525a03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意識界於意識界不可得，意識界於眼、耳、鼻、舌、身識界亦不可得。",
        "translation": "The realm of the mental consciousness can't be obtained in the realm of consciousness, and the realm of consciousness can't be obtained in the realms of the eye, ear, nose, tongue, and body consciousness.",
        "source": "T07n0220_496:0525a04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525a06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸於眼觸不可得，眼觸於耳、鼻、舌、身、意觸亦不可得。",
        "translation": "Contact of the eye by the eye is unobtainable, and contact of the eye by the ear, nose, tongue, body, and mind is also unobtainable.",
        "source": "T07n0220_496:0525a06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳觸於耳觸不可得，耳觸於眼、鼻、舌、身、意觸亦不可得。",
        "translation": "Contact of the ear by the ear is unobtainable, and contact of the ear by the eye, nose, tongue, body, and mind is also unobtainable.",
        "source": "T07n0220_496:0525a07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻觸於鼻觸不可得，鼻觸於眼、耳、舌、身、意觸亦不可得。",
        "translation": "Touch of the nose to touch of the nose is unobtainable, and touch of the nose to touch of the eyes, ears, tongue, body, and mind is also unobtainable.",
        "source": "T07n0220_496:0525a08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌觸於舌觸不可得，舌觸於眼、耳、鼻、身、意觸亦不可得。",
        "translation": "Touch of the tongue to touch of the tongue is unobtainable, and touch of the tongue to touch of the eyes, ears, nose, body, and mind is also unobtainable.",
        "source": "T07n0220_496:0525a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身觸於身觸不可得，身觸於眼、耳、鼻、舌、意觸亦不可得。",
        "translation": "Touch of the body by the body's contact is unobtainable, and touch of the body by the eyes, ears, nose, tongue, and mind is unobtainable.",
        "source": "T07n0220_496:0525a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意觸於意觸不可得，意觸於眼、耳、鼻、舌、身觸亦不可得。",
        "translation": "Mental contact with the mind is unobtainable, and mental contact with the eyes, ears, nose, tongue, and body is also unobtainable.",
        "source": "T07n0220_496:0525a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸為緣所生諸受於眼觸為緣所生諸受不可得，眼觸為緣所生諸受於耳、鼻、舌、身、意觸為緣所生諸受亦不可得。",
        "translation": "The sensations that arise from visual contact as a condition are inapprehensible to the sensations that arise from visual contact as a condition, and the sensations that arise from visual contact as a condition are inapprehensible to the sensations that arise from ear, nose, tongue, body, and mind as a condition.",
        "source": "T07n0220_496:0525a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳觸為緣所生諸受於耳觸為緣所生諸受不可得，耳觸為緣所生諸受於眼、鼻、舌、身、意觸為緣所生諸受亦不可得。",
        "translation": "The sensations that arise from ear contact as a condition are inapprehensible to the sensations that arise from ear contact as a condition, and the sensations that arise from ear contact as a condition are inapprehensible to the sensations that arise from eye, nose, tongue, body, and mind contact as a condition.",
        "source": "T07n0220_496:0525a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻觸為緣所生諸受於鼻觸為緣所生諸受不可得，鼻觸為緣所生諸受於眼、耳、舌、身、意觸為緣所生諸受亦不可得。",
        "translation": "The sensations that arise from nasal contact as a condition are inapprehensible to the sensations that arise from nasal contact as a condition, and the sensations that arise from nasal contact as a condition are inapprehensible to the sensations that arise from eye, ear, tongue, body, and mind contact as a condition.",
        "source": "T07n0220_496:0525a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌觸為緣所生諸受於舌觸為緣所生諸受不可得，舌觸為緣所生諸受於眼、耳、鼻、身、意觸為緣所生諸受亦不可得。",
        "translation": "The sensations that arise from tongue contact as a condition are inapprehensible to the sensations that arise from tongue contact as a condition, and the sensations that arise from tongue contact as a condition are inapprehensible to the sensations that arise from eye, ear, nose, body, and mind contact as a condition.",
        "source": "T07n0220_496:0525a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身觸為緣所生諸受於身觸為緣所生諸受不可得，身觸為緣所生諸受於眼、耳、鼻、舌、意觸為緣所生諸受亦不可得。",
        "translation": "The sensations that arise from bodily contact as a condition are inapprehensible to the sensations that arise from bodily contact as a condition, and the sensations that arise from bodily contact as a condition are inapprehensible to the sensations that arise from the eyes, ears, nose, tongue, and mind as a condition.",
        "source": "T07n0220_496:0525a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意觸為緣所生諸受於意觸為緣所生諸受不可得，意觸為緣所生諸受於眼、耳、鼻、舌、身觸為緣所生諸受亦不可得。",
        "translation": "The sensations that arise from mental contact as a condition cannot be obtained with respect to the sensations that arise from mental contact as a condition, and the sensations that arise from mental contact as a condition cannot be obtained with respect to the sensations that arise from the eyes, ears, nose, tongue, and body contact as a condition.",
        "source": "T07n0220_496:0525a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界於地界不可得，地界於水、火、風、空、識界亦不可得。",
        "translation": "The element of earth can't be obtained in the element of earth, and the element of water, fire, wind, air, and consciousness can't be obtained in the element of earth.",
        "source": "T07n0220_496:0525a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水界於水界不可得，水界於地、火、風、空、識界亦不可得。",
        "translation": "The water element is incomprehensible in the water element, and the water element is incomprehensible in the element of earth, fire, wind, air, and consciousness.",
        "source": "T07n0220_496:0525b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "火界於火界不可得，火界於地、水、風、空、識界亦不可得。",
        "translation": "The fire element is incomprehensible in the fire element, and the fire element is incomprehensible in the element of earth, water, wind, air, and consciousness.",
        "source": "T07n0220_496:0525b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風界於風界不可得，風界於地、水、火、空、識界亦不可得。",
        "translation": "The element of wind can't be obtained in the element of wind, and the element of wind can't be obtained in the elements of earth, water, fire, air, and consciousness.",
        "source": "T07n0220_496:0525b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空界於空界不可得，空界於地、水、火、風、識界亦不可得。",
        "translation": "The element of emptiness can't be obtained in the element of emptiness, and the element of emptiness can't be obtained in the elements of earth, water, fire, air, and consciousness.",
        "source": "T07n0220_496:0525b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識界於識界不可得，識界於地、水、火、風、空界亦不可得。",
        "translation": "The element of consciousness can't be obtained in the element of consciousness, and the element of consciousness can't be obtained in the elements of earth, water, fire, air, and space.",
        "source": "T07n0220_496:0525b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣於因緣不可得，因緣於等無間緣、所緣緣、增上緣亦不可得。",
        "translation": "Causes and conditions cannot be obtained in terms of causes and conditions, nor can causes and conditions be obtained in terms of equally uninterrupted conditions, cognized conditions, or superior cognized conditions.",
        "source": "T07n0220_496:0525b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等無間緣於等無間緣不可得，等無間緣於因緣、所緣緣、增上緣亦不可得。",
        "translation": "Equivalent indirect conditions are inapplicable to equivalent indirect conditions, and equivalent indirect conditions are inapplicable to causes, immediate conditions, and contributory conditions.",
        "source": "T07n0220_496:0525b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣緣於所緣緣不可得，所緣緣於因緣、等無間緣、增上緣亦不可得。",
        "translation": "The cognitive cognition is inapplicable in terms of the cognitive cognition, and the cognition is inapplicable in terms of the causal, equally-independent, and supercognitive cognitions.",
        "source": "T07n0220_496:0525b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增上緣於增上緣不可得，增上緣於因緣、等無間緣、所緣緣亦不可得。",
        "translation": "The contributory condition is unobtainable in the contributory condition, and the contributory condition is unobtainable in the causal condition, the equally uninterrupted condition, and the contributory condition.",
        "source": "T07n0220_496:0525b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明於無明不可得，無明於行、識、名色、六處、觸、受、愛、取、有、生、老死亦不可得。",
        "translation": "Nescience is inapprehensible in nescience, and nescience is inapprehensible in volition, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, and old age and death.",
        "source": "T07n0220_496:0525b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行於行不可得，行於無明、識、名色、六處、觸、受、愛、取、有、生、老死亦不可得。",
        "translation": "While it's unknowable with respect to form, it's also unknowable with respect to nescience, consciousness, name and form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, and old age and death.",
        "source": "T07n0220_496:0525b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識於識不可得，識於無明、行、名色、六處、觸、受、愛、取、有、生、老死亦不可得。",
        "translation": "Consciousness is inapprehensible in terms of consciousness, and consciousness is inapprehensible in terms of nescience, form, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, and old age-and-death.",
        "source": "T07n0220_496:0525b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名色於名色不可得，名色於無明、行、識、六處、觸、受、愛、取、有、生、老死亦不可得。",
        "translation": "Name and form are unobtainable in name and form, and name and form are unobtainable in nescience, volition, consciousness, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, and old age and death.",
        "source": "T07n0220_496:0525b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六處於六處不可得，六處於無明、行、識、名色、觸、受、愛、取、有、生、老死亦不可得。",
        "translation": "The six sense-fields are unobtainable in the six sense-fields, and the six sense-fields are unobtainable in nescience, volition, consciousness, name-and-form, touch, feeling, craving, grasping, existence, birth, and old age and death.",
        "source": "T07n0220_496:0525b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸於觸不可得，觸於無明、行、識、名色、六處、受、愛、取、有、生、老死亦不可得。",
        "translation": "Touch is inapprehensible in contact, and touch is inapprehensible in nescience, volition, consciousness, name-and-form, the six sense-fields, sensation, craving, appropriation, existence, birth, and old age and death.",
        "source": "T07n0220_496:0525b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受於受不可得，受於無明、行、識、名色、六處、觸、愛、取、有、生、老死亦不可得。",
        "translation": "Feeling is unobtainable in feeling, and feeling is unobtainable in nescience, volition, consciousness, name-and-form, the six sense-fields, touch, craving, appropriation, existence, birth, and old age and death.",
        "source": "T07n0220_496:0525b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛於愛不可得，愛於無明、行、識、名色、六處、觸、受、取、有、生、老死亦不可得。",
        "translation": "Craving is unobtainable in craving, and craving is unobtainable in nescience, volition, consciousness, name-and-form, the six sense-fields, contact, sensation, appropriation, existence, birth, and old age-and-death.",
        "source": "T07n0220_496:0525b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取於取不可得，取於無明、行、識、名色、六處、觸、受、愛、有、生、老死亦不可得。",
        "translation": "Apprehension is unobtainable in apprehension, and apprehension is unobtainable in nescience, volition, consciousness, name-and-form, the six sense-fields, touch, sensation, feeling, craving, existence, birth, and old age and death.",
        "source": "T07n0220_496:0525b27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有於有不可得，有於無明、行、識、名色、六處、觸、受、愛、取、生、老死亦不可得。",
        "translation": "What exists in existence can't be obtained, and what exists in nescience, volition, consciousness, name-and-form, the six sense-fields, touch, sensation, feeling, craving, appropriation, birth, and old age and death can't be obtained either.",
        "source": "T07n0220_496:0525b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生於生不可得，生於無明、行、識、名色、六處、觸、受、愛、取、有、老死亦不可得。",
        "translation": "Birth is unobtainable in birth, and birth is unobtainable in nescience, volition, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, apprehension, existence, and old age and death.",
        "source": "T07n0220_496:0525c01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "老死於老死不可得，老死於無明、行、識、名色、六處、觸、受、愛、取、有、生亦不可得。",
        "translation": "Old age and death are unobtainable in old age and death, and old age and death are unobtainable in nescience, volition, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, and birth.",
        "source": "T07n0220_496:0525c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多於布施波羅蜜多不可得，布施波羅蜜多於淨戒等波羅蜜多亦不可得，如是乃至般若波羅蜜多於般若波羅蜜多不可得，般若波羅蜜多於布施等波羅蜜多亦不可得。",
        "translation": "The perfection of generosity is unobtainable in the perfection of generosity, and the perfection of generosity is unobtainable in the perfection of pure precepts, and so forth, even to the extent that the perfection of wisdom is unobtainable in the perfection of wisdom and the perfection of wisdom is unobtainable in the perfection of generosity.",
        "source": "T07n0220_496:0525c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525c09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮於四靜慮不可得，四靜慮於四無量、四無色定亦不可得。",
        "translation": "The four meditations are inapprehensible in terms of the four meditations, and the four meditations are inapprehensible in terms of the four immeasurable and four formless concentrations.",
        "source": "T07n0220_496:0525c09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無量於四無量不可得，四無量於四靜慮、四無色定亦不可得。",
        "translation": "While the four immeasurables are inapprehensible in the four immeasurables, the four immeasurables are also inapprehensible in the four meditations and the four formless concentrations.",
        "source": "T07n0220_496:0525c11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無色定於四無色定不可得，四無色定於四靜慮、四無量亦不可得。",
        "translation": "The four formless concentrations are unobtainable in the four formless concentrations, and the four formless concentrations are unobtainable in the four meditations and the four formless concentrations.",
        "source": "T07n0220_496:0525c12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525c14_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住於四念住不可得，四念住於四正斷等亦不可得，如是乃至八聖道支於八聖道支不可得，八聖道支於四念住等亦不可得。",
        "translation": "The four abodes of mindfulness are inapplicable to the four abodes of mindfulness, and the four abodes of mindfulness are inapplicable to the four correct eliminations, etc., such that the eightfold noble path branch is inapplicable to the eightfold noble path branch, and the eightfold noble path branch is inapplicable to the four abodes of mindfulness, etc.",
        "source": "T07n0220_496:0525c14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525c17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫於八解脫不可得，八解脫於八勝處、九次第定、十遍處亦不可得；八勝處於八勝處不可得，八勝處於八解脫、九次第定、十遍處亦不可得；九次第定於九次第定不可得，九次第定於八解脫八勝處、十遍處亦不可得；十遍處於十遍處不可得，十遍處於八解脫、八勝處、九次第定亦不可得「舍利子！",
        "translation": "The eighth liberation is unobtainable in the eighth liberation, and the eighth liberation is unobtainable in the eighth superior place, the ninth subordinate concentration, and the ten universal places; the eighth superior place is unobtainable in the eighth superior place, and the eighth superior place is unobtainable in the eighth liberation, the ninth subordinate concentration, and the ten universal places; the ninth subordinate concentration is unobtainable in the ninth subordinate concentration, and the ninth subordinate concentration is unobtainable in the eighth superior place of emancipation and the ten universal places; the ten universal places are unobtainable in the ten universal places, and the ten universal places are unobtainable in the eighth liberation, the eighth superior place, and the ninth subordinate concentration \"Śāriputra!",
        "source": "T07n0220_496:0525c17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門於空解脫門不可得，空解脫門於無相、無願解脫門亦不可得。",
        "translation": "The liberation through the gate of emptiness is unobtainable at the liberation through emptiness, and the liberation through signlessness and wishlessness is also unobtainable at the liberation through signlessness.",
        "source": "T07n0220_496:0525c24_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無相解脫門於無相解脫門不可得，無相解脫門於空、無願解脫門亦不可得。",
        "translation": "The aspect of liberation from signlessness is inapprehensible through the aspect of liberation from signlessness, and the aspect of liberation from signlessness is inapprehensible through the aspect of liberation from emptiness and the aspect of liberation from wishlessness.",
        "source": "T07n0220_496:0525c26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無願解脫門於無願解脫門不可得，無願解脫門於空、無相解脫門亦不可得。",
        "translation": "The aspect of liberation without a wish is inapprehensible through the aspect of liberation without a wish, and the aspect of liberation without a wish is inapprehensible through the aspect of liberation through emptiness and the aspect of liberation through form.",
        "source": "T07n0220_496:0525c27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0525c29_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼於五眼不可得，五眼於六神通亦不可得。",
        "translation": "The five eyes are unobtainable in the five eyes, and the five eyes are unobtainable in the six supernormal powers.",
        "source": "T07n0220_496:0525c29_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六神通於六神通不可得，六神通於五眼亦不可得。",
        "translation": "The six supernormal powers are unobtainable in the six supernormal powers, and the six supernormal powers are unobtainable in the five eyes.",
        "source": "T07n0220_496:0526a01_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a03_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來十力於如來十力不可得，如來十力於四無所畏等亦不可得。",
        "translation": "The Tathāgata's ten powers can't be obtained from the Tathāgata's ten powers, and the Tathāgata's ten powers can't be obtained from the four forms of unsurpassed fear.",
        "source": "T07n0220_496:0526a03_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至十八佛不共法於十八佛不共法不可得，十八佛不共法於如來十力等亦不可得。",
        "translation": "Thus, it doesn't matter whether 18 Buddha-uncommon dharmas are obtained from 18 Buddha-uncommon dharmas, or whether 18 Buddha-uncommon dharmas are obtained from the Tathāgata's ten powers.",
        "source": "T07n0220_496:0526a04_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a06_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法於無忘失法不可得，無忘失法於恒住捨性亦不可得。",
        "translation": "The absence of forgetfulness is inapprehensible in the absence of forgetfulness, and the absence of forgetfulness is inapprehensible in the nature of constantly abiding equanimity.",
        "source": "T07n0220_496:0526a07_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒住捨性於恒住捨性不可得，恒住捨性於無忘失法亦不可得。",
        "translation": "The nature of constancy and equanimity is unobtainable in constancy and equanimity, and the nature of constancy and equanimity is unobtainable in the absence of forgetfulness.",
        "source": "T07n0220_496:0526a08_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a10_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智於一切智不可得，一切智於道相智、一切相智亦不可得。",
        "translation": "Omniscience is inapprehensible in omniscience, and omniscience is inapprehensible in the knowledge of the path and the knowledge of all characteristics.",
        "source": "T07n0220_496:0526a10_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道相智於道相智不可得，道相智於一切智、一切相智亦不可得。",
        "translation": "Wisdom of the way's characteristics is inapprehensible to wisdom of the way's characteristics, and wisdom of the way's characteristics is inapprehensible to omniscience and wisdom of the way's characteristics.",
        "source": "T07n0220_496:0526a11_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切相智於一切相智不可得，一切相智於一切智、道相智亦不可得。",
        "translation": "The knowledge of all characteristics is unobtainable in the knowledge of all characteristics, and the knowledge of all characteristics is unobtainable in the knowledge of all characteristics and the knowledge of the path.",
        "source": "T07n0220_496:0526a13_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a14_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空於內空不可得，內空於外空等亦不可得。",
        "translation": "\"Internal emptiness is inapprehensible in terms of internal emptiness, and internal emptiness is inapprehensible in terms of external emptiness and so forth.",
        "source": "T07n0220_496:0526a14_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至無性自性空於無性自性空不可得，無性自性空於內空等亦不可得。",
        "translation": "Thus, it doesn't follow that the emptiness of a natureless self-nature can't be obtained in the emptiness of a natureless self-nature, nor can the emptiness of a natureless self-nature be obtained in internal emptiness and so forth.",
        "source": "T07n0220_496:0526a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如於真如不可得，真如於法界等亦不可得。",
        "translation": "\"A true thusness can't be obtained from a true thusness, and a true thusness can't be obtained from the Dharma realm and so forth.",
        "source": "T07n0220_496:0526a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至不思議界於不思議界不可得，不思議界於真如等亦不可得。",
        "translation": "Thus, it doesn't follow that the inconceivable realm is incomprehensible to the inconceivable realm, and the inconceivable realm is incomprehensible to the true thusness and so forth.",
        "source": "T07n0220_496:0526a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷界於斷界不可得，斷界於離界等亦不可得。",
        "translation": "The elimination realm is inapprehensible in the elimination realm, and the elimination realm is inapprehensible in the separation realm and so forth.",
        "source": "T07n0220_496:0526a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至無為界於無為界不可得，無為界於斷界等亦不可得。",
        "translation": "Thus, it doesn't follow that the element of nonbeing can't be obtained in the element of nonbeing, and the element of nonbeing can't be obtained in the element of cutting off.",
        "source": "T07n0220_496:0526a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦於苦聖諦不可得，苦聖諦於集、滅、道聖諦亦不可得。",
        "translation": "The noble truth of suffering is inapprehensible in the noble truth of suffering, and the noble truths of suffering in the noble truths of arising, ceasing, and the path are also inapprehensible.",
        "source": "T07n0220_496:0526a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集聖諦於集聖諦不可得，集聖諦於苦、滅、道聖諦亦不可得。",
        "translation": "The noble truth of accumulation is inapprehensible in the noble truth of accumulation, and the noble truth of accumulation is inapprehensible in the noble truths of suffering, cessation, and the path.",
        "source": "T07n0220_496:0526a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅聖諦於滅聖諦不可得，滅聖諦於苦、集、道聖諦亦不可得。",
        "translation": "The noble truth of ceasing is inapprehensible in the noble truth of ceasing, and the noble truth of ceasing is inapprehensible in the noble truths of suffering, arising, and the path.",
        "source": "T07n0220_496:0526a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道聖諦於道聖諦不可得，道聖諦於苦、集、滅聖諦亦不可得。",
        "translation": "The noble truth of the path can't be obtained in the noble truth of the path, and the noble truth of the path can't be obtained in the noble truths of suffering, arising, and cessation.",
        "source": "T07n0220_496:0526a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陀羅尼門於陀羅尼門不可得，陀羅尼門於三摩地門亦不可得。",
        "translation": "The dhāraṇī aspect is inapprehensible at the dhāraṇī aspect, and the dhāraṇī aspect is inapprehensible at the approach of samādhi.",
        "source": "T07n0220_496:0526a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩地門於三摩地門不可得，三摩地門於陀羅尼門亦不可得。",
        "translation": "The aspect of samādhi is inapprehensible from the aspect of samādhi, and the aspect of samādhi is inapprehensible from the aspect of dhāraṇī.",
        "source": "T07n0220_496:0526b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異生地於異生地不可得，異生地於種性地等亦不可得。",
        "translation": "The stage of worldlings can't be obtained in the stage of worldlings, and the stage of worldlings can't be obtained in the stage of seeds and so forth.",
        "source": "T07n0220_496:0526b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至如來地於如來地不可得，如來地於異生地等亦不可得。",
        "translation": "It's thus ... the Tathāgata ground is unobtainable in the Tathāgata ground, and the Tathāgata ground is unobtainable in the ground of unenlightened births and so forth.",
        "source": "T07n0220_496:0526b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地於極喜地不可得，極喜地於離垢地等亦不可得。",
        "translation": "The ground of ultimate joy cannot be attained in the ground of ultimate joy, and the ground of ultimate joy cannot be attained in the ground of freedom from defilement and so forth.",
        "source": "T07n0220_496:0526b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至法雲地於法雲地不可得，法雲地於極喜地等亦不可得。",
        "translation": "Thus, even the ground of clouds of reality is unobtainable in the ground of clouds of reality, and the ground of clouds of reality is unobtainable in the ground of ultimate joy and so forth.",
        "source": "T07n0220_496:0526b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "預流於預流不可得，預流於一來等亦不可得。",
        "translation": "It's impossible for stream-winner to attain stream-winner, and it's impossible for stream-winner to attain the once-returner.",
        "source": "T07n0220_496:0526b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至正等覺於正等覺不可得，正等覺於預流等亦不可得。",
        "translation": "Thus, even correct enlightenment cannot be obtained from correct enlightenment, and correct enlightenment cannot be obtained from stream-winner.",
        "source": "T07n0220_496:0526b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩於菩薩摩訶薩不可得，菩薩摩訶薩於般若波羅蜜多、教誡教授亦不可得。",
        "translation": "\"The bodhisattva Mahāsattva is unobtainable from the bodhisattva Mahāsattva, and the bodhisattva Mahāsattva is unobtainable from the prajñāpāramitā, teachings, and instructions.",
        "source": "T07n0220_496:0526b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜多於般若波羅蜜多不可得，般若波羅蜜多於菩薩摩訶薩、教誡教授亦不可得。",
        "translation": "The prajñāpāramitā is inapprehensible to the prajñāpāramitā, and the prajñāpāramitā is inapprehensible to the bodhisattva Mahāsattva and the instructional teachings.",
        "source": "T07n0220_496:0526b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教誡教授於教誡教授不可得，教誡教授於菩薩摩訶薩、般若波羅蜜多亦不可得。",
        "translation": "The instructional teaching cannot be obtained from the instructional teaching, and the instructional teaching cannot be obtained from the bodhisattva, Mahāsattva, or the prajñāparamitā.",
        "source": "T07n0220_496:0526b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T07n0220_496:0526b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_496:0526b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸如是等若法若我自性空故。",
        "translation": "\"Such and such is the emptiness of the self-nature of dharmas and selves.",
        "source": "T07n0220_496:0526b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_496:0526b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，我作是說：我於此等一切法，以一切種、一切處、一切時，求菩薩摩訶薩都無所見竟不可得，云何令我以般若波羅蜜多教誡教授諸菩薩摩訶薩？",
        "translation": "For this reason, I say, \"Since it's impossible for me to see all these things as bodhisattvas and mahāsattvas in all kinds of places and at all times, how can I instruct and teach bodhisattvas and mahāsattvas with the prajñāpāramitā?",
        "source": "T07n0220_496:0526b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九十六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 496",
        "source": "T07n0220_496:0526b23_0",
        "is_bad_quality": false
    }
]