[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 501",
        "source": "T07n0220_515:0630b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T07n0220_515:0630b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_515:0630b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分不退相品第二十之二",
        "translation": "Chapter Three: The Chapter of Nonretrogression, Part Twenty-two",
        "source": "T07n0220_515:0630b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0630b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，設有惡魔來至其所，欲令厭背無上菩提，作如是言：『一切智智與虛空等，無性為性，自相本空，諸法亦爾，與虛空等，無性為性。",
        "translation": "\"When the irreversible bodhisattva-mahāsattva is approached by an evil demon who wants to make him disillusioned with unsurpassed bodhi, he says, 'All cognition and wisdom and space are essentially empty in their own nature, and so are all dharmas, which are essentially empty and have no nature as nature, such as space.",
        "source": "T07n0220_515:0630b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自相空中，無有一法可名能證，無有一法可名所證，證處、證時及由此證亦不可得。",
        "translation": "In the emptiness of their own nature, there's no single thing that can be called the agent that realizes them, no single thing that can be called the thing that is realized, and neither the place, nor the time, nor the realization thereof can be obtained.",
        "source": "T07n0220_515:0630b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既一切法與虛空等，無性為性、自相本空，汝等云何唐受勤苦求證無上正等菩提？",
        "translation": "Since all things, such as space and so forth, lack nature as nature and are inherently empty in their own nature, how can you undertake the painful pursuit of unsurpassed perfect enlightenment?",
        "source": "T07n0220_515:0630b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝先所聞諸菩薩眾應求無上正等菩提，皆是魔說非真佛語。",
        "translation": "What you heard earlier about the multitude of bodhisattvas who should pursue unsurpassed correct enlightenment is nothing but the teachings of Māra and not the true words of the Buddha.",
        "source": "T07n0220_515:0630b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應捨求證無上正等覺心，勿於長夜徒為利樂一切有情自受勤苦，雖行種種難行苦行，欲求菩提終不能得。』",
        "translation": "You should abandon your desire to realize unsurpassed correct perfect enlightenment and not subject yourself to long nights of hard work for the benefit and welfare of all sentient beings, even though you perform various difficult and painful actions, and you'll never attain bodhi in the pursuit of it.'",
        "source": "T07n0220_515:0630b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩聞說如是呵諫語時，能審觀察：『此惡魔事，欲退敗我大菩提心，我今不應信受彼說。",
        "translation": "When that bodhisattva Mahāsattva heard such words of rebuke, he was able to examine them and observe, 'This is a bad demonic deed that wants to sabotage my great mind of enlightenment, and I shouldn't believe and accept what they say now.",
        "source": "T07n0220_515:0630b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖一切法與虛空等，無性為性，自相本空，而諸有情生死長夜不知不見，顛倒放逸，造作諸業受生死苦。",
        "translation": "Even though all things like space are natureless and inherently empty in their own nature, sentient beings are born and die for a long time without knowing or seeing them, and they are mistaken and careless, creating actions and suffering from birth-and-death.",
        "source": "T07n0220_515:0630b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當被戴性相皆空如太虛空功德甲冑，速趣無上正等菩提，為諸有情如應說法，令其解脫生死眾苦得預流果、或一來果、或不還果、或阿羅漢果、或獨覺菩提、或證無上正等菩提，能盡未來利樂一切。』",
        "translation": "I will be armored with the armor of the merit of being empty in nature and form like space, quickly proceed to unsurpassed perfect enlightenment, and teach sentient beings as they should be taught, causing them to be liberated from the suffering of birth-and-death and attain the fruit of pre-flow, the fruit of the first coming, the fruit of nonreturn, the fruit of the arhat, the enlightenment of the pratyekabuddha, or the realization of unsurpassed perfect enlightenment that will bring benefit to all in the future.'",
        "source": "T07n0220_515:0630c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩從初發心已聞此法，其心堅固不動不轉，依斯堅固不動轉心，恒正修行六到彼岸，已入菩薩正性離生。",
        "translation": "After hearing this teaching from the first arousal of his mind, the bodhisattva Mahāsattva's mind is resolute, unmoving, and unchanging; depending on that resolute, unmoving mind, he's constantly and correctly cultivating the six perfections, and he has entered the bodhisattva's correct nature of freedom from birth.",
        "source": "T07n0220_515:0630c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復正修行六到彼岸，漸次圓滿伏諸纏結，由斯得入不退轉地。",
        "translation": "Again, they correctly cultivate the six perfections and gradually and completely subdue the bonds of entanglement, and thus they enter the stage of nonretrogression.",
        "source": "T07n0220_515:0630c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故惡魔雖設種種退敗方便，而不能退菩薩所發大菩提心。",
        "translation": "Therefore, even though evil demons devise various methods for turning back the mind, they can't turn back the great mind of enlightenment that the bodhisattvas have aroused.",
        "source": "T07n0220_515:0630c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。」",
        "translation": "If a bodhisattva-mahāsattva accomplishes such conduct, appearance, and characteristics, you know that he's a nonretrogressing bodhisattva.\"",
        "source": "T07n0220_515:0630c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現即白佛言：「是菩薩摩訶薩為不退轉故名不退轉，為退轉故名不退轉耶？」",
        "translation": "Guoshou Shanjin then said to the Buddha, \"Is it because the bodhisattva Mahāsattva doesn't regress that he's called nonretrogressing, and is it because he regresses that he's called nonretrogressing?\"",
        "source": "T07n0220_515:0630c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩以不退轉故名不退轉，亦以退轉故名不退轉。」",
        "translation": "The Buddha told Śaṅgālī, \"This is called the nonretrogression of the bodhisattva Mahāsattva because he doesn't turn back, and it's also called nonretrogression because he turns back.\"",
        "source": "T07n0220_515:0630c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「是菩薩摩訶薩云何以不退轉故名不退轉？",
        "translation": "It was then that the Śaṅgāmin replied to the Buddha, \"How is it that the bodhisattva Mahāsattva is called nonretrogressing because he doesn't turn back?",
        "source": "T07n0220_515:0630c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何亦以退轉故名不退轉耶？」",
        "translation": "How is it also called nonretrogression because of retrogression?\"",
        "source": "T07n0220_515:0630c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩超過聲聞及獨覺地，不復退墮彼二地中，由斯故說不退轉故名不退轉。",
        "translation": "The Buddha told Shancheng, \"This is the bodhisattva Mahāsattva who goes beyond the stages of śrāvaka and solitary realizer and doesn't fall back into those two stages again; therefore, it's called nonretrogression because it's said not to be retrogressing.",
        "source": "T07n0220_515:0630c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩遠離聲聞及獨覺地，於彼二地決定退捨，由斯故說以退轉故名不退轉。",
        "translation": "That bodhisattva Mahāsattva is free from the stages of śrāvaka and solitary realizer and is definitely retrogressing from those two stages; therefore, it's called nonretrogression because it's said to be retrogressing.",
        "source": "T07n0220_515:0630c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故此菩薩得二種名，非如餘位唯名退轉。",
        "translation": "Therefore, this bodhisattva attains two kinds of names, unlike the other stages, which are called only retrogression.",
        "source": "T07n0220_515:0630c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，定得無上正等菩提，諸惡魔軍不能退敗。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such conduct, appearance, and characteristics, he's certain to attain unsurpassed perfect enlightenment, and the armies of evil demons won't be able to retreat.",
        "source": "T07n0220_515:0630c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0630c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩欲入初靜慮乃至第四靜慮即隨意能入，欲入慈無量乃至捨無量即隨意能入，欲入空無邊處定乃至非想非非想處定即隨意能入，欲入四念住乃至八聖道支即隨意能入，欲入初解脫乃至滅想受解脫即隨意能入，欲入初勝處乃至第八勝處即隨意能入，欲入初靜慮定乃至滅想受定即隨意能入，欲入初遍處乃至第十遍處即隨意能入，欲入空、無相、無願解脫門即隨意能入，欲引發五神通即隨意能引發。",
        "translation": "一切不退轉菩薩摩訶薩欲入初靜慮乃至第四靜慮即隨意能入，欲入慈無量乃至捨無量即隨意能入，欲入空無邊處定乃至非想非非想處定即隨意能入，欲入四念住乃至八聖道支即隨意能入，欲入初解脫乃至滅想受解脫即隨意能入，欲入初勝處乃至第八勝處即隨意能入，欲入初靜慮定乃至滅想受定即隨意能入，欲入初遍處乃至第十遍處即隨意能入，欲入空、無相、無願解脫門即隨意能入，欲引發五神通即隨意能引發。",
        "source": "T07n0220_515:0630c27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0631a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩雖入四靜慮乃至引發五神通，而不受彼果。",
        "translation": "Although this bodhisattva Mahāsattva enters the four states of meditation and even gives rise to the five supernormal powers, he doesn't experience their results.",
        "source": "T07n0220_515:0631a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，不隨靜慮、無量、等至乃至滅定及餘功德勢力而生，亦不取預流果、或一來果、或不還果、或阿羅漢果、或獨覺菩提，為欲利樂諸有情故，隨欲攝受所應受身，即隨所願皆能攝受，作所作已即便捨之。",
        "translation": "As a result, he doesn't follow meditation, immeasurable, equipoise, or even the concentration of cessation and the power of other attributes, nor does he attain the fruit of pre-flow, the fruit of once-returning, the fruit of nonreturning, the fruit of the arhat, or the enlightenment of the solitary realizer, and for the sake of the welfare of sentient beings, he takes in the body that should be received as he desires, that is, he takes in whatever he desires and then disposes of it after he has done it.",
        "source": "T07n0220_515:0631a09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such actions, appearances, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0631a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0631a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩成就無上菩提作意，恒不遠離大菩提心，不貴色蘊乃至識蘊，不貴眼處乃至意處，不貴色處乃至法處，不貴眼界乃至意界，不貴色界乃至法界，不貴眼識界乃至意識界，不貴眼觸乃至意觸，不貴眼觸為緣所生諸受乃至意觸為緣所生諸受，不貴地界乃至識界，不貴因緣乃至增上緣，不貴一切緣性緣起，不貴諸相，不貴隨好，不貴所依，不貴有色無色法，不貴有見無見法，不貴有對無對法，不貴有漏無漏法，不貴有為無為法，不貴世間、出世間法，不貴我，不貴有情，乃至不貴知者、見者，不貴徒眾，不貴眷屬，不貴祿位，不貴財寶，不貴布施波羅蜜多乃至般若波羅蜜多，不貴內空乃至無性自性空，不貴真如乃至不思議界，不貴苦、集、滅、道聖諦，不貴十善業道，不貴四靜慮、四無量、四無色定，不貴五神通，不貴四念住乃至八聖道支，不貴空、無相、無願解脫門，不貴八解脫乃至十遍處，不貴淨觀地乃至如來地，不貴極喜地乃至法雲地，不貴陀羅尼門、三摩地門，不貴五眼、六神通，不貴如來十力乃至十八佛不共法，不貴大慈、大悲、大喜、大捨，不貴無忘失法、恒住捨性，不貴一切智、道相智、一切相智，不貴預流果乃至獨覺菩提，不貴一切菩薩摩訶薩行，不貴諸佛無上正等菩提，不貴嚴淨佛土，不貴成熟有情，不貴多見諸佛，不貴種植善根。",
        "translation": "一切不退轉菩薩摩訶薩成就無上菩提作意，恒不遠離大菩提心，不貴色蘊乃至識蘊，不貴眼處乃至意處，不貴色處乃至法處，不貴眼界乃至意界，不貴色界乃至法界，不貴眼識界乃至意識界，不貴眼觸乃至意觸，不貴眼觸為緣所生諸受乃至意觸為緣所生諸受，不貴地界乃至識界，不貴因緣乃至增上緣，不貴一切緣性緣起，不貴諸相，不貴隨好，不貴所依，不貴有色無色法，不貴有見無見法，不貴有對無對法，不貴有漏無漏法，不貴有為無為法，不貴世間、出世間法，不貴我，不貴有情，乃至不貴知者、見者，不貴徒眾，不貴眷屬，不貴祿位，不貴財寶，不貴布施波羅蜜多乃至般若波羅蜜多，不貴內空乃至無性自性空，不貴真如乃至不思議界，不貴苦、集、滅、道聖諦，不貴十善業道，不貴四靜慮、四無量、四無色定，不貴五神通，不貴四念住乃至八聖道支，不貴空、無相、無願解脫門，不貴八解脫乃至十遍處，不貴淨觀地乃至如來地，不貴極喜地乃至法雲地，不貴陀羅尼門、三摩地門，不貴五眼、六神通，不貴如來十力乃至十八佛不共法，不貴大慈、大悲、大喜、大捨，不貴無忘失法、恒住捨性，不貴一切智、道相智、一切相智，不貴預流果乃至獨覺菩提，不貴一切菩薩摩訶薩行，不貴諸佛無上正等菩提，不貴嚴淨佛土，不貴成熟有情，不貴多見諸佛，不貴種植善根。",
        "source": "T07n0220_515:0631a16_18",
        "is_bad_quality": true
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0631b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩達一切法與虛空等，無性為性，自相皆空，不見有法可生貴重，能生、所生、生時、生處、由此而生皆不可得。",
        "translation": "This is the bodhisattva-mahāsattva who understands that all things and space are of the same nature, that their naturelessness is nature, that their own characteristics are empty, that there's no dharmas that can be produced or valued, and that the agent, the produced, the time, the place, and the resultant production are all unobtainable.",
        "source": "T07n0220_515:0631b13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0631b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是一切法與虛空等，性相皆空，無生義故。",
        "translation": "\"All things are empty in nature and characteristics, such as space, in the sense that they are unarisen.",
        "source": "T07n0220_515:0631b16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩成就無上菩提作意，恒不遠離大菩提心，身四威儀往來入出，舉足下足心無散亂，行住坐臥進止威儀，所作事業皆住正念。",
        "translation": "This bodhisattva-mahāsattva accomplishes the intention for unsurpassed enlightenment, never strays from the mind of great enlightenment, has the four bodily mannerisms of going and coming, enters and leaves, raises and lowers his feet without distraction, conducts himself in a manner that's appropriate for sitting, walking, lying, and moving, and abides in right mindfulness of what he's doing.",
        "source": "T07n0220_515:0631b17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such conduct, appearance, and characteristics, he knows that he's a nonretrogressing bodhisattva.",
        "source": "T07n0220_515:0631b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0631b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩為欲利樂諸有情故，現處居家，方便善巧，雖現攝受五欲樂具，而於其中不生染著，皆為濟給諸有情故，謂諸有情須食與食，須飲與飲，須衣與衣，須乘與乘，乃至一切所須之物皆濟給之，令其意滿。",
        "translation": "\"For the sake of the welfare of sentient beings, the nonretrogressing bodhisattva Mahāsattva goes to his home and skillfully makes himself useful, accepting the five objects of desire and pleasure but not becoming defiled in them, in order to give relief to sentient beings who need food and eat, drink and drink, clothing and clothing, vehicles and vehicles, and even all the things they need, so that they may fulfill their wishes.",
        "source": "T07n0220_515:0631b22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩自行布施乃至般若波羅蜜多，亦勸他行布施乃至般若波羅蜜多，恒正稱揚行布施乃至般若波羅蜜多法，歡喜讚歎行布施乃至般若波羅蜜多者。",
        "translation": "This is the bodhisattva-mahāsattva who gives generosity and even the prajñāpāramitā on his own, encourages others to give generosity and even the prajñāpāramitā, always praises the practice of generosity and even the prajñāpāramitā, and rejoices in and praises those who practice generosity and even the prajñpāramitā.",
        "source": "T07n0220_515:0631b27_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩現處居家，以神通力或大願力，攝受種種珍寶資具滿贍部洲乃至三千大千世界，持以供養佛、法、僧寶，及施貧乏諸有情類。",
        "translation": "That bodhisattva Mahāsattva lives at home and, with the power of his supernormal powers or the power of his great vow, collects various precious necessities that fill the whole continent and the 3,000 great thousand worlds, and he maintains them as offerings to the Buddha, Dharma, and saṃgha treasures and gives them to poor sentient beings.",
        "source": "T07n0220_515:0631c02_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩雖現處居家而常修梵行，終不受用諸妙欲境，雖現攝受種種珍財，而於其中不起染著，又於攝受諸欲樂具及珍財時，終不逼迫諸有情類令生憂苦。",
        "translation": "Although he lives at home and always cultivates the religious practice, this bodhisattva never experiences the objects of marvelous desire, never becomes defiled by the various treasures he gathers, and never forces sentient beings to become sad and miserable when he gathers the objects of desire and pleasure and the treasures he possesses.",
        "source": "T07n0220_515:0631c05_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such actions, appearances, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0631c09_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0631c10_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，有執金剛藥叉神王常隨左右密為守護，恒作是念：『此菩薩摩訶薩不久當證無上菩提，願我常隨密為守護，乃至無上正等菩提，五執金剛藥叉神族常隨守護時無暫捨，人非人等不能損害，諸天、魔、梵及餘世間亦無有能以法破壞所發無上正等覺心。』",
        "translation": "'All the nonretrogressing bodhisattvas and mahāsattvas have a vajra-ruling yakṣa god king who always follows them around and guards them intimately, always thinking, 'This bodhisattva will soon realize unsurpassed bodhi, may I always follow and guard them intimately until they reach unsurpassed correct enlightenment, and when the five vajra-ruling yakṣa gods always follow and guard them, they don't let go for a moment, so that humans and non-humans can't harm them, nor can gods, Māra, Brahmā, or any other worldly being destroy the unsurpassed correct enlightened mind that they've arisen by their teachings.'",
        "source": "T07n0220_515:0631c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，是諸菩薩乃至無上正等菩提，身意泰然常無擾惱。",
        "translation": "As a result, these bodhisattvas and their unsurpassed correct enlightenment are always calm and unperturbed in body and mind.",
        "source": "T07n0220_515:0631c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩世間五根常無缺減，所謂眼、耳、鼻、舌、身根，出世五根亦無缺減，謂信、精進、念、定、慧根。",
        "translation": "These are the bodhisattvas' five mundane faculties that are always undiminished, which are the sense faculties of the eye, ear, nose, tongue, and body, and the five supramundane faculties that are undiminished, which are the faculties of faith, effort, mindfulness, concentration, and wisdom.",
        "source": "T07n0220_515:0631c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩身支圓滿相好莊嚴，心諸功德念念增進，乃至無上正等菩提。",
        "translation": "Such a bodhisattva-mahāsattva's body is fully proportioned and adorned in appearance, and the mental qualities of his mind are constantly enhanced, up to unsurpassed perfect enlightenment.",
        "source": "T07n0220_515:0631c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such conduct, appearance, and characteristics, he knows that he's a nonretrogressing bodhisattva.",
        "source": "T07n0220_515:0631c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0631c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，常為上士，不為下士。」",
        "translation": "All irreversible bodhisattvas, mahāsattvas, are always the superior and not the inferior.\"",
        "source": "T07n0220_515:0631c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現即白佛言：「是菩薩摩訶薩云何當得常為上士，不為下士？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"How will this bodhisattva-mahāsattva attain the status of always being the superior person and not the inferior person?\"",
        "source": "T07n0220_515:0631c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩一切煩惱不復現前，剎那剎那善法增進，乃至無上正等菩提，於一切時心無散亂。",
        "translation": "The Buddha told Shancheng, \"This bodhisattva-mahāsattva has no more manifestations of all afflictions, moment by moment he advances in good qualities, and he reaches unsurpassed correct perfect enlightenment, and at all times his mind isn't distracted.",
        "source": "T07n0220_515:0631c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我說此菩薩摩訶薩常為上士，不為下士。",
        "translation": "I therefore say that this bodhisattva-mahāsattva is always the superior person, not the inferior person.",
        "source": "T07n0220_515:0631c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such conduct, appearance, and characteristics, you know that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0632a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0632a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩成就無上菩提作意，恒不遠離大菩提心，恒修淨命，不行呪術、醫藥、占卜諸邪命事，不為名利呪諸鬼神，令著男女問其凶吉，亦不呪禁男女、大小、傍生、鬼等現希有事，亦不占相壽量長短、財位、男女諸善惡事，亦不懸記寒熱、豐儉、吉凶、好惡惑亂有情，亦不呪禁合和湯藥、左道療疾、結好貴人，亦不為他通致使命，現親友相徇利求名，尚不染心觀視男女戲笑與語，況有餘事！",
        "translation": "一切不退轉菩薩摩訶薩成就無上菩提作意，恒不遠離大菩提心，恒修淨命，不行呪術、醫藥、占卜諸邪命事，不為名利呪諸鬼神，令著男女問其凶吉，亦不呪禁男女、大小、傍生、鬼等現希有事，亦不占相壽量長短、財位、男女諸善惡事，亦不懸記寒熱、豐儉、吉凶、好惡惑亂有情，亦不呪禁合和湯藥、左道療疾、結好貴人，亦不為他通致使命，現親友相徇利求名，尚不染心觀視男女戲笑與語，況有餘事！",
        "source": "T07n0220_515:0632a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦不恭敬供養鬼神，是故我說常為上士、不為下士。",
        "translation": "Nor do they revere and make offerings to spirits; therefore, I say they're always the superior person and not the inferior person.",
        "source": "T07n0220_515:0632a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩知一切法性相皆空，性相空中不見有相，不見相故，遠離種種邪命、呪術、醫藥、占相，唯求無上正等菩提，與諸有情常作饒益。",
        "translation": "This is a bodhisattva who knows that the nature and characteristics of all things are empty, that there are no characteristics in nature and characteristics, and that because he doesn't see characteristics, he parts with various mistaken livelihoods, spells, medicines, and divination techniques, seeks only unsurpassed perfect enlightenment, and always works to benefit sentient beings.",
        "source": "T07n0220_515:0632a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such practices, appearances, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0632a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0632a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩於諸世間文章、伎藝，雖得善巧而不愛著。",
        "translation": "\"All irreversible bodhisattvas and mahāsattvas attain skillfulness in worldly writings and techniques but don't cling to them.",
        "source": "T07n0220_515:0632a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩達一切法皆畢竟空，畢竟空中世間所有文章、伎藝皆不可得，又諸世間文章、伎藝，皆雜穢語邪命所攝，是故菩薩知而不為。",
        "translation": "\"This is the bodhisattva who understands that all things are ultimately empty, that all worldly writings and techniques in the ultimate air are unobtainable, and that worldly writings and techniques are the result of defiled speech and wrong livelihood; therefore, the bodhisattva knows and doesn't do them.",
        "source": "T07n0220_515:0632a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know it well!",
        "source": "T07n0220_515:0632a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於諸世俗外道書論，雖亦善知而不樂著。",
        "translation": "Although this bodhisattva Mahāsattva well knows and doesn't delight in the secular and non-Buddhist writings and discussions, he doesn't cling to them.",
        "source": "T07n0220_515:0632a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩達一切法性相皆空，性相空中一切書論皆不可得，又諸世俗外道書論，所說理事多有增減，於菩薩道非為隨順，皆是戲論雜穢語攝，故諸菩薩知而不樂。",
        "translation": "\"This is the bodhisattva-mahāsattva who understands that the nature and characteristics of all things are empty, that all writings and discussions are unobtainable when the nature and characteristics are empty, and that secular non-Buddhist writings and discussions that teach principle increase or decrease are not compliant with the bodhisattva path and are nothing but conceptual arguments and the inclusion of defiled speech, so bodhisattvas know and don't enjoy them.",
        "source": "T07n0220_515:0632a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such practices, appearances, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0632a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0632b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，復有所餘諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "\"All irreversible bodhisattvas and mahāsattvas have other actions, forms, and characteristics that they know to be irreversible bodhisattvas and mahāsattvas.",
        "source": "T07n0220_515:0632b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說，汝應諦聽，極善思惟！」",
        "translation": "I will explain them for you, and you should listen closely and consider them well!\"",
        "source": "T07n0220_515:0632b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現請言：「唯然！",
        "translation": "The good present asked, \"Yes!",
        "source": "T07n0220_515:0632b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願說！",
        "translation": "vow to speak!",
        "source": "T07n0220_515:0632b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者專意樂聞。」",
        "translation": "We now concentrate our minds and delight in hearing about it.\"",
        "source": "T07n0220_515:0632b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「所有不退轉菩薩摩訶薩行深般若波羅蜜多，通達諸法皆無所有，恒不遠離大菩提心，不樂觀察論說諸蘊、諸處、諸界。",
        "translation": "The Buddha told Śaṅgālī, \"All irreversible bodhisattvas and mahāsattvas practice the profound perfection of wisdom, comprehend that all dharmas are without existence, never part from the great mind of enlightenment, and don't delight in observing and discussing the aggregates, places, and elements.",
        "source": "T07n0220_515:0632b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於蘊、處、界性相空理，已善思惟、善通達故。",
        "translation": "\"This is because the bodhisattva Mahāsattva has well considered and well understood the principle of the emptiness of the nature and marks of aggregates, fields, and elements.",
        "source": "T07n0220_515:0632b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know it well, good present!",
        "source": "T07n0220_515:0632b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說眾事。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't delight in observing and discussing various things.",
        "source": "T07n0220_515:0632b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切眾性相空理，已善思惟、善通達故。",
        "translation": "\"This is because the bodhisattva Mahāsattva has well considered and well understood the principle of the emptiness of the characteristics of all natures.",
        "source": "T07n0220_515:0632b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good presently you should know!",
        "source": "T07n0220_515:0632b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說王事。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't delight in observing the king's affairs as discussed.",
        "source": "T07n0220_515:0632b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住本性空，不見少法有勝有劣貴賤相故。",
        "translation": "It's because the bodhisattvas, mahāsattvas, abide in the emptiness of their original nature and don't see the marks of superiority, inferiority, and superiority and inferiority in few things.",
        "source": "T07n0220_515:0632b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說賊事。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't enjoy observing what's discussed about thieves.",
        "source": "T07n0220_515:0632b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住自相空，不見少法有得有失與奪相故。",
        "translation": "This is because the bodhisattva Mahāsattva abides in the emptiness of its own characteristics and doesn't see the marks of gain, loss, and seizure in few things.",
        "source": "T07n0220_515:0632b15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說軍事。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't enjoy observing and discussing military affairs.",
        "source": "T07n0220_515:0632b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住本性空，不見諸法有多有少聚散相故。",
        "translation": "It's because the bodhisattvas, mahāsattvas, abide in the emptiness of their original nature and don't see the characteristics of many and few dharmas gathering and scattering.",
        "source": "T07n0220_515:0632b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說鬪戰。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't enjoy observing, discussing, and fighting about fights.",
        "source": "T07n0220_515:0632b20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩善住諸法真如空理，不見少法有強有弱愛恚相故。",
        "translation": "This is the bodhisattva-mahāsattva who well abides in the principle that things are truly empty and doesn't see the signs of craving and ill-will in few things that are strong or weak.",
        "source": "T07n0220_515:0632b21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good presently you should know!",
        "source": "T07n0220_515:0632b22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說男女。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't delight in observing the discourse on men and women.",
        "source": "T07n0220_515:0632b22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住諸法空，不見少法有好有醜愛憎相故。",
        "translation": "This is the bodhisattva-mahāsattva who abides in the emptiness of things and doesn't see that few things are beautiful, ugly, attractive, or detestable.",
        "source": "T07n0220_515:0632b23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632b25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說聚落。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't delight in observing and discussing the village.",
        "source": "T07n0220_515:0632b25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住諸法空，不見少法有增有減合離相故。",
        "translation": "This is the bodhisattva-mahāsattva who abides in the emptiness of things and doesn't see the combination and separation of increase and decrease in few things.",
        "source": "T07n0220_515:0632b26_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632b27_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說城邑。",
        "translation": "\"This is a bodhisattva-mahāsattva who doesn't enjoy observing and discussing cities.",
        "source": "T07n0220_515:0632b28_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632b28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住諸法空，不見少法有攝不攝好惡相故。",
        "translation": "This is because the bodhisattva Mahāsattva abides in the emptiness of all things and doesn't see a few things that have good and bad characteristics that are not included.",
        "source": "T07n0220_515:0632b29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632c01_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說國土。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't delight in observing and discussing the land.",
        "source": "T07n0220_515:0632c01_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632c02_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩安住實際，不見諸法有屬不屬此彼相故。",
        "translation": "This is because the bodhisattvas, mahāsattvas, abide in reality and don't see that things have characteristics that belong to or don't belong to this or that characteristic.",
        "source": "T07n0220_515:0632c02_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說相好。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't delight in observing the major and minor features of the discourse.",
        "source": "T07n0220_515:0632c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩安住無相，不見諸法有好有醜差別相故。",
        "translation": "This is because the bodhisattvas, mahāsattvas, abide in marklessness and don't see the distinctive characteristics of things that are beautiful and ugly.",
        "source": "T07n0220_515:0632c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說是我、是有情，乃至是知者、是見者。",
        "translation": "\"This is the bodhisattva Mahāsattva who doesn't delight in observing the teaching that it's a self or a sentient being, or even a knower or a seer.",
        "source": "T07n0220_515:0632c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住畢竟空，都不見我乃至見者若有若無差別相故。",
        "translation": "It's because the bodhisattvas, mahāsattvas, abide in ultimate emptiness and don't see distinctions between self and whether those who see are existent or nonexistent.",
        "source": "T07n0220_515:0632c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T07n0220_515:0632c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不樂觀察論說世間如是等事，但樂觀察論說般若波羅蜜多。",
        "translation": "This is a bodhisattva who doesn't enjoy observing and discussing such and such things in the world but enjoys observing and discussing the prajñāpāramitā.",
        "source": "T07n0220_515:0632c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0632c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多遠離眾相，能證無上大菩提故。",
        "translation": "Because the profound perfection of wisdom is free of many characteristics, it's possible to realize the unsurpassed great enlightenment.",
        "source": "T07n0220_515:0632c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩常不遠離一切智智相應作意，修行布施波羅蜜多離慳貪事，修行淨戒波羅蜜多離犯戒事，修行安忍波羅蜜多離忿諍事，修行精進波羅蜜多離懈怠事，修行靜慮波羅蜜多離散亂事，修行般若波羅蜜多離惡慧事。",
        "translation": "Such bodhisattvas and mahāsattvas always abide in the contemplation associated with the knowledge of all cognitions, cultivate the perfection of generosity and avoidance of stinginess and greed, cultivate the perfection of pure precepts and avoidance of violations of precepts, cultivate the perfection of patience and avoidance of anger and disputation, cultivate the perfection of effort and avoidance of laziness, cultivate the perfection of meditation and avoidance of distraction, and cultivate the perfection of prajñā and avoidance of bad wisdom.",
        "source": "T07n0220_515:0632c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good presently you should know!",
        "source": "T07n0220_515:0632c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩雖住一切法空，而愛樂正法、不樂非法；雖住不可得空，而常稱讚三寶功德。",
        "translation": "Although he abides in the emptiness of all things, this bodhisattva Mahāsattva loves the right teaching and dislikes what's not the right teaching, and although he abides in the unobtainable emptiness, he always praises the merits of the Three Treasures.",
        "source": "T07n0220_515:0632c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩雖行諸法真如法界一味之相，而樂稱揚真如法界種種功德。",
        "translation": "Although this is the bodhisattva-mahāsattva who practices the single flavor of the true nature of the Dharma realm, he enjoys praising the various virtues of the true nature of the Dharma realm.",
        "source": "T07n0220_515:0632c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩雖知諸法皆畢竟空，而愛善友不樂惡友。",
        "translation": "\"Although the bodhisattva-mahāsattva knows that all things are ultimately empty, he loves good friends and doesn't enjoy bad friends.",
        "source": "T07n0220_515:0632c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言善友者，謂諸如來、應、正等覺及諸菩薩摩訶薩眾；若諸聲聞、獨覺乘等，善能教化安立有情，令趣無上正等菩提，亦名善友。",
        "translation": "Good friends are tathāgatas, arhats, and fully enlightened ones, as well as the bodhisattva-mahāsattvas, and those of the śrāvaka and pratyekabuddha vehicles who well teach and establish sentient beings in the path to unsurpassed correct enlightenment, which is also called a good friend.",
        "source": "T07n0220_515:0632c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0632c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩常樂親覲一切如來、應、正等覺聽聞正法。",
        "translation": "\"This is the bodhisattva Mahāsattva who always enjoys intimately visiting all tathāgatas, worthies, and righteous equipoises to hear the right teaching.",
        "source": "T07n0220_515:0632c27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞如來、應、正等覺在餘世界現說正法，即以願力往生彼界，供養恭敬、尊重讚歎、聽受正法。",
        "translation": "If they hear that the Tathāgata, the Worthy One, and the Perfectly Enlightened One are presently teaching the right Dharma in another world, they will then use the power of their vow to be reborn in that world, making offerings, honoring, praising, and listening to the right Dharma.",
        "source": "T07n0220_515:0632c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0633a02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩若晝若夜恒不遠離念佛作意，亦不遠離聞法作意，由此因緣，隨諸國土有佛世尊現說正法，即乘願力往彼受生，或乘神通往彼聽法。",
        "translation": "\"Whether it's day or night, these bodhisattvas never part from the intention to mind the Buddha and never part from the intention to hear the Dharma, and as a result, whenever there's a Buddha in some land who teaches the right Dharma, they ride the power of their vow to be born there or ride their spirits to hear the Dharma there.",
        "source": "T07n0220_515:0633a02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，此諸菩薩生生之處常不離佛，恒聞正法無間無斷。",
        "translation": "Because of these causes and conditions, these bodhisattvas are always born in places that never part from the Buddha, and they always hear the right teaching without interruption or break.",
        "source": "T07n0220_515:0633a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0633a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩恒為利樂諸有情故，雖能現起靜慮、無色諸甚深定，而巧方便起欲界心，教諸有情十善業道，亦隨願力現生欲界有佛國土，供養恭敬、尊重讚歎諸佛世尊，聽聞正法修諸勝行。",
        "translation": "Although this bodhisattva-mahāsattva can always produce the profound concentrations of meditation and formlessness for the benefit and welfare of sentient beings, he skillfully creates the mind of the desire realm, teaches sentient beings the ten good activities, is reborn in the land of the desire realm where there are buddhas according to the power of his vows, makes offerings to, respects, and praises the world-honored buddhas, and hears the right teaching and cultivates excellent practices.",
        "source": "T07n0220_515:0633a07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such practices, appearances, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0633a11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0633a13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，常行布施波羅蜜多乃至般若波羅蜜多，常行內空乃至無性自性空，常行真如乃至不思議界，常行苦、集、滅、道聖諦，常行四念住乃至八聖道支，常行四靜慮、四無量、四無色定，常行空、無相、無願解脫門，常行八解脫乃至十遍處，常行殊勝諸菩薩地，常行一切陀羅尼門、三摩地門，常行五眼、六神通，常行如來十力乃至十八佛不共法，常行大慈、大悲、大喜、大捨，常行無忘失法、恒住捨性，常行一切智、道相智、一切相智，常行一切菩薩摩訶薩行，常求諸佛無上正等菩提。",
        "translation": "一切不退轉菩薩摩訶薩，常行布施波羅蜜多乃至般若波羅蜜多，常行內空乃至無性自性空，常行真如乃至不思議界，常行苦、集、滅、道聖諦，常行四念住乃至八聖道支，常行四靜慮、四無量、四無色定，常行空、無相、無願解脫門，常行八解脫乃至十遍處，常行殊勝諸菩薩地，常行一切陀羅尼門、三摩地門，常行五眼、六神通，常行如來十力乃至十八佛不共法，常行大慈、大悲、大喜、大捨，常行無忘失法、恒住捨性，常行一切智、道相智、一切相智，常行一切菩薩摩訶薩行，常求諸佛無上正等菩提。",
        "source": "T07n0220_515:0633a13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0633a24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩恒於自地不起疑惑，不作是念：『我是不退轉、我非不退轉。』",
        "translation": "That bodhisattva-mahāsattva always remains in his own ground without doubting and doesn't think, 'I am irreversible; I'm not irreversible.'",
        "source": "T07n0220_515:0633a24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633a26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不見少法可於無上正等菩提說有退轉、說無退轉。",
        "translation": "Such a bodhisattva-mahāsattva doesn't see few things that can be said to be retrogressed or said to be irreversible in the unsurpassed correct enlightenment.",
        "source": "T07n0220_515:0633a26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T07n0220_515:0633a28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於自地法無惑無疑。",
        "translation": "\"This is a bodhisattva-mahāsattva who has no confusion or doubt about the Dharma of his own ground.",
        "source": "T07n0220_515:0633a28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633a29_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於自地法，已善了知、善通達故。",
        "translation": "This is because the bodhisattva Mahāsattva has well understood and well comprehended the teaching of his own ground.",
        "source": "T07n0220_515:0633a29_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know it well in the present!",
        "source": "T07n0220_515:0633b01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如預流者住預流果，於自果法無惑無疑，一來、不還、阿羅漢、獨覺及諸如來、應、正等覺，各住自果於自果法無惑無疑。",
        "translation": "\"Just as a stream-enterer abides in the fruit of stream-entering without confusion or doubt about what is its own fruit, so the first-comer, the nonreturner, the arhat, the solitary realizer, and the tathāgatas, arhats, and right ascendants each abide in their own fruit without confusion or doubt about what is their own fruit.",
        "source": "T07n0220_515:0633b01_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩亦復如是，於自所住不退轉地所攝諸法，現知現見、無惑無疑。",
        "translation": "Thus, the bodhisattva Mahāsattva also thus knows and sees the qualities included in the ground of nonretrogression in which he abides, without confusion or doubt.",
        "source": "T07n0220_515:0633b04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0633b06_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩住此地中成熟有情、嚴淨佛土、修諸功德，有魔事起即能覺知，不隨魔事勢力而轉，善能摧滅種種魔事，令不障礙所修功德。",
        "translation": "Such a bodhisattva-mahāsattva abides here to ripen sentient beings, purify the Buddha-lands, and cultivate merits, is able to recognize when demonic forces arise, doesn't act according to the power of those forces, and skillfully destroys all kinds of demonic forces so that they don't obstruct the merits that he cultivates.",
        "source": "T07n0220_515:0633b06_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good performers, you should know!",
        "source": "T07n0220_515:0633b09_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有造作無間業者，彼無間心恒常隨逐，乃至命終亦不能捨。",
        "translation": "\"If someone creates unremitting activity, their unremitting mind will always follow them, and they won't be able to abandon it even after their life ends.",
        "source": "T07n0220_515:0633b09_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633b11_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼能等起無間業纏增上勢力恒常隨轉，乃至命盡亦不能伏，設有餘心不能遮礙。",
        "translation": "\"They are capable of constantly following the intensified power of binding unremitting activity, and they can't be subdued even when their life ends, and they can't be obstructed by other minds.",
        "source": "T07n0220_515:0633b11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩摩訶薩亦復如是，安住自地其心不動無所分別，世間天、人、阿素洛等皆不能轉。",
        "translation": "This bodhisattva Mahāsattva is likewise, standing at his own ground with an unmoving mind and no discrimination, which worldly gods, humans, asuras, and so forth can't change.",
        "source": "T07n0220_515:0633b13_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633b15_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩其心堅固超諸世間天、人、魔、梵、阿素洛等，已入菩薩正性離生住不退地，已得菩薩殊勝神通，成熟有情、嚴淨佛土，從一佛國趣一佛國供養恭敬、尊重讚歎諸佛世尊及佛弟子，聽聞正法，於諸佛所種諸善根，請問菩薩所學法義。",
        "translation": "That bodhisattva, whose mind is resolute and transcends worldly gods, humans, Māra, Brahmā, and asuras, has entered the bodhisattva's correct nature, freed himself from birth, abides in the stage of nonretrogression, has attained the bodhisattva's extraordinary supernormal powers, matures sentient beings, purifies the Buddha-lands, goes from one Buddha-land to another to make offerings to, honor, and praise the world-honored buddhas and their disciples, hears the right teaching, plants good roots in the buddhas, and asks about the meaning of the teaching that the bodhisattva has learned.",
        "source": "T07n0220_515:0633b15_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know, good present!",
        "source": "T07n0220_515:0633b21_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩安住自地，有魔事起即能覺知，終不隨順魔事而轉，方便善巧集諸魔事，置實際中方便除滅，於自地法無惑無疑。",
        "translation": "This is a bodhisattva who abides in his own ground, recognizes the arising of Māra immediately, never goes along with Māra, skillfully gathers Māra, skillfully removes them in practice, and has no confusion or doubt about the Dharma of his own ground.",
        "source": "T07n0220_515:0633b21_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633b24_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩知一切法皆入實際，通達實際非一非多，於實際中無所分別，以於實際無惑無疑，於自地法亦無猶豫。",
        "translation": "This is a bodhisattva who knows that all things enter into reality, comprehends that reality is neither one nor many, and makes no discrimination in reality because he has no confusion or doubt about reality, and he has no hesitation about his own ground dharma.",
        "source": "T07n0220_515:0633b24_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0633b27_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩設轉受生，亦於實際無復退轉，終不發起趣向聲聞、獨覺地意。",
        "translation": "Suppose this bodhisattva Mahāsattva takes birth in a transition, never retrogresses in reality, and never arouses the intention to go to the stage of śrāvaka or pratyekabuddha.",
        "source": "T07n0220_515:0633b27_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633b29_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩知一切法自相皆空，於此空中不見有法若生若滅、若染若淨。",
        "translation": "This is the bodhisattva-mahāsattva who knows that the own characteristics of all things are empty and doesn't see things in this sky that are produced, ceased, defiled, or purified.",
        "source": "T07n0220_515:0633b29_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0633c02_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩乃至轉身，亦不疑惑當得無上正等菩提為不當得。",
        "translation": "\"Such a bodhisattva-mahāsattva doesn't doubt that unsurpassed correct enlightenment will be attained or that it won't be attained even when he turns around.",
        "source": "T07n0220_515:0633c02_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633c04_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩通達諸法自相皆空，即是無上正等菩提。",
        "translation": "This is the bodhisattva-mahāsattva who understands that the own characteristics of all things are empty, which is unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_515:0633c04_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_515:0633c05_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩安住自地不隨他緣，於自地法無能壞者。",
        "translation": "\"This is the bodhisattva Mahāsattva who stands firmly in his own ground and doesn't follow other conditions, and there's nothing in his own ground that can be destroyed.",
        "source": "T07n0220_515:0633c05_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633c07_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩成就無動無退轉智，一切惡緣不能傾動。",
        "translation": "\"This is the bodhisattva-mahāsattva who has accomplished the wisdom of immovability and nonretrogression, which cannot be tampered with by all bad causes.",
        "source": "T07n0220_515:0633c07_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such conduct, appearance, and characteristics, he knows that he's a nonretrogressing bodhisattva.",
        "source": "T07n0220_515:0633c08_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0633c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，設有惡魔作佛形像，來到其所作如是言：『汝今應求阿羅漢果，永盡諸漏證般涅槃。",
        "translation": "\"Yiqie bodhisattva mahāsattva, there was a demon that took the form of a Buddha and came to him and said, 'Now, you should pursue the fruit of the arhat and permanently end the contaminants and realize parinirvāṇa.",
        "source": "T07n0220_515:0633c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝未堪受大菩提記，亦未證得無生法忍，汝今未有不退轉地諸行、狀、相，如來不應授汝無上大菩提記，要有具足不退轉地諸行、狀、相，乃可蒙佛授與無上大菩提記。』",
        "translation": "You're not yet ready to receive the mark of great enlightenment, you haven't yet realized the forbearance of the Dharma of nonretrogression, and you don't yet have the practices, appearance, and form of the stage of nonretrogression, so the Tathāgata shouldn't grant you the unsurpassed mark of great enlightenment; only when you have the practices, appearance, and form of the stage of nonretrogression will you be granted the unsurpassed mark of great enlightenment by the Buddha.'",
        "source": "T07n0220_515:0633c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩聞彼語已，心無變動，不退不沒、無驚無怖。",
        "translation": "After hearing those words, the bodhisattva Mahāsattva's mind didn't change, and he didn't retrogress or falter, wasn't frightened or afraid.",
        "source": "T07n0220_515:0633c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩應自證知：『我於過去諸如來所，必已受得大菩提記。",
        "translation": "That bodhisattva Mahāsattva should realize for himself, 'I must have received the mark of great enlightenment from the tathāgatas in the past.",
        "source": "T07n0220_515:0633c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0633c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就如是勝法，定蒙諸佛授菩提記。",
        "translation": "When a bodhisattva accomplishes such an excellent teaching, he's sure to be granted the mark of enlightenment by the buddhas.",
        "source": "T07n0220_515:0633c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已成就如是勝法，云何世尊不授我記？",
        "translation": "How could the Bhagavān not grant me assurance of awakening after I've accomplished such an excellent teaching?",
        "source": "T07n0220_515:0633c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我過去於如來所，定已受得大菩提記。』",
        "translation": "Therefore, in the past, I must have received the assurance of great enlightenment from the Tathāgata.'",
        "source": "T07n0220_515:0633c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such actions, appearances, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0633c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0633c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，設有惡魔或魔使者作佛形像，來授菩薩聲聞地記，或授菩薩獨覺地記，告菩薩言：『咄！",
        "translation": "When the irreversible bodhisattva Mahāsattva has a demon or a messenger of a demon take the form of a buddha and come to grant the bodhisattva the assurance of attaining the stage of śrāvaka or the assurance of attaining the stage of solitary realizer, he tells the bodhisattva, 'Duh!",
        "source": "T07n0220_515:0633c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_515:0633c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何用無上正等菩提，生死輪迴久受大苦？",
        "translation": "\"What is the purpose of unsurpassed perfect enlightenment and the great suffering of the cycle of birth-and-death for so long?",
        "source": "T07n0220_515:0633c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜自速證無餘涅槃，永離生死畢竟安樂。』",
        "translation": "It's better for you to quickly realize nirvāṇa without remainder and to be permanently freed from birth and death and completely at ease.'",
        "source": "T07n0220_515:0633c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩聞彼語已，作是念言：『此定惡魔或魔使者詐現佛像擾亂我心，授我聲聞、獨覺地記，令退無上正等菩提。",
        "translation": "After hearing those words, the bodhisattva Mahāsattva had this thought, 'This certainly is a dangerous demon or a messenger of the demon who fraudulently presents an image of the Buddha to disturb my mind, grant me the assurance that I'll attain the stage of direct disciples or solitary realizers, and cause me to fall back from unsurpassed perfect enlightenment.'",
        "source": "T07n0220_515:0633c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0634a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "定無諸佛教諸菩薩趣向聲聞或獨覺地，棄捨無上正等菩提。』",
        "translation": "'There certainly aren't any Buddhist bodhisattvas who go to the stage of śrāvaka or pratyekabuddha and abandon unsurpassed correct perfect enlightenment.'",
        "source": "T07n0220_515:0634a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such practices, appearances, and characteristics, he knows that he's a nonretrogressing bodhisattva.",
        "source": "T07n0220_515:0634a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0634a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩，設有惡魔或魔使者，詐現佛像告菩薩言：『汝所受持大乘經典非佛所說，亦非如來弟子所說，是諸惡魔或諸外道為誑惑汝作如是說，汝今不應受持、讀誦。』",
        "translation": "'Yiqie nonretrogressing bodhisattva Mahāsattva, suppose there were a demon or a messenger of the demon who fraudulently appeared in the Buddha's image and told the bodhisattva, 'That great vehicle sūtra you're upholding is not taught by the Buddha, nor is it taught by the Tathāgata's disciples; these demons or non-Buddhists have made such a statement to deceive you, so you shouldn't uphold it or recite it now.'",
        "source": "T07n0220_515:0634a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩聞彼語已，作是念言：『此定惡魔或魔眷屬，令我厭捨無上菩提故，說大乘甚深經典非佛所說，亦非如來弟子所說。",
        "translation": "After hearing those words, the bodhisattva Mahāsattva had this thought, 'This is certainly a reason why Māra or Māra's followers would make me disillusioned with unsurpassed bodhi, for saying that the profound scriptures of the great vehicle aren't taught by the Buddha and aren't taught by the Tathāgata's disciples.'",
        "source": "T07n0220_515:0634a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0634a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離此經典能得無上正等菩提，必無是處。』",
        "translation": "There's no place where one can attain unsurpassed correct enlightenment apart from this sūtra.'",
        "source": "T07n0220_515:0634a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T07n0220_515:0634a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩定已安住不退轉地，過去諸佛久已授彼大菩提記。",
        "translation": "That bodhisattva Mahāsattva has definitely settled into the stage of nonretrogression, and the buddhas of the past have long since granted him the assurance of great enlightenment.",
        "source": "T07n0220_515:0634a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0634a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩具足成就不退轉地諸行、狀、相，若諸菩薩成就如是諸行、狀、相，當知已受大菩提記，必已安住不退轉地，故能覺知惡魔事業。",
        "translation": "\"If this is a bodhisattva-mahāsattva who has fully achieved the stage of nonretrogression in terms of practice, appearance, and form, then he should know that he has received the mark of great enlightenment and must have been placed in the stage of nonretrogression, which is why he's able to perceive the works of evil demons.",
        "source": "T07n0220_515:0634a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such actions, signs, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_515:0634a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0634a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩行深般若波羅蜜多時，攝護正法，不惜身命，況餘珍財、朋友、眷屬！",
        "translation": "When all irreversible bodhisattvas and mahāsattvas practice the profound perfection of wisdom, they guard the right Dharma and don't spare their lives, let alone other valuables, friends, and retinues!",
        "source": "T07n0220_515:0634a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩恒作是念：『我寧棄捨親友、珍財及自身命，終不棄捨諸佛正法。",
        "translation": "That bodhisattva-mahāsattva always thinks, 'I'd rather abandon my friends, family, valuables, and my own life than abandon the true teaching of the buddhas.'",
        "source": "T07n0220_515:0634a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0634a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親友、珍財及自身命，生生常有甚為易得，諸佛正法百千俱胝那庾多劫乃得一遇，遇已長夜獲大利樂故，我定應精勤攝護，不顧身命、親友、珍財。』",
        "translation": "Relatives, friends, valuables, and one's own life are always present in birth and are very easy to obtain, and the true teaching of the buddhas comes along only once in a hundred thousand koṭīnaya kalpas; after meeting them, I'll surely and diligently guard them without regard for my life, relatives, or valuables.'",
        "source": "T07n0220_515:0634a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this, good present!",
        "source": "T07n0220_515:0634a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩攝護法時，應作是念：『我今不為攝護一佛、二佛、三佛乃至百千諸佛正法，普為攝護十方三世諸佛正法令不虧損。』」",
        "translation": "When this bodhisattva Mahāsattva guards the Dharma, he should think, 'Now, I don't guard one Buddha, two Buddhas, three Buddhas, or even a hundred thousand Buddhas' right dharma, but I guard the right dharma of the buddhas of the ten directions and three times for the sake of not losing it.'\"",
        "source": "T07n0220_515:0634a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「何等名為諸佛正法？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"What's called the right Dharma of the buddhas?",
        "source": "T07n0220_515:0634b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩云何攝護不惜珍財、親友、身命？」",
        "translation": "How does this bodhisattva-mahāsattva guard valuables, family, friends, and body and life without scrimping on them?\"",
        "source": "T07n0220_515:0634b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「一切如來、應、正等覺為諸菩薩說諸法空，如是名為諸佛正法。",
        "translation": "The Buddha told Śaṅgālī, \"All tathāgatas, worthies, and correct enlightenment teach bodhisattvas the emptiness of things, and this is called the right teaching of the buddhas.",
        "source": "T07n0220_515:0634b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有愚癡類誹謗毀訾，言此非法、非毘奈耶、非天人師所說聖教，修學此法不得無上正等菩提，不證涅槃永寂安樂。",
        "translation": "Some foolish people denigrate and disparage it, saying that it's not true, not vinaya, and not the noble teaching taught by gods and humans, and that cultivating this teaching won't lead to unsurpassed perfect enlightenment or the realization of nirvāṇa and eternal peace and happiness.",
        "source": "T07n0220_515:0634b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩攝護此法，不惜珍財、親友、身命，常作是念：『如來所說一切法空是諸有情真歸依處，菩薩修學疾證無上正等菩提，拔諸有情生老病死，令得畢竟常樂涅槃，故我今應不惜身命、珍財、親友攝護此法。』",
        "translation": "That bodhisattva-mahāsattva protects this teaching, sparing precious treasures, friends, and his life, and always thinks, 'The Tathāgata teaches that the emptiness of all things is the true refuge of sentient beings, that bodhisattvas who train in it quickly realize unsurpassed correct enlightenment, remove birth, old age, illness, and death from sentient beings, and bring about the ultimate state of permanent bliss and nirvāṇa, so now I should protect this teaching, sparing neither my life nor precious treasures, friends, nor relatives.'",
        "source": "T07n0220_515:0634b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又作是念：『我亦墮在未來佛數，佛已授我大菩提記。",
        "translation": "Again, he thought, 'I've also fallen into the category of future buddhas, and the Buddha has granted me the mark of great enlightenment.",
        "source": "T07n0220_515:0634b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，諸佛正法即是我法，我應攝護不惜身命、珍財、親友，我未來世得作佛時，亦為有情宣說如是諸法空故。』",
        "translation": "Because of this, the right Dharma of the buddhas is my Dharma, which I should protect without sparing my life, valuables, family, or friends, and when I become a buddha in the future, I'll also explain the emptiness of such things for sentient beings.'",
        "source": "T07n0220_515:0634b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this, good present!",
        "source": "T07n0220_515:0634b17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩見斯義利，攝護如來所說正法，不惜身命、親友、珍財乃至菩提，常無懈惓。",
        "translation": "Seeing this benefit, this bodhisattva-mahāsattva collects the right teaching from the Tathāgata and doesn't spare his life, friends, valuables, or even his enlightenment, but he's never lazy about it.",
        "source": "T07n0220_515:0634b17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva accomplishes such conduct, appearance, and characteristics, he knows that he's a nonretrogressing bodhisattva.",
        "source": "T07n0220_515:0634b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0634b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不退轉菩薩摩訶薩聞諸如來、應、正等覺所說正法無惑無疑，聞已受持能不忘失，乃至無上正等菩提。",
        "translation": "\"All irreversible bodhisattvas and mahāsattvas hear the right teaching from the Tathāgata, Arhat, and Completely Awakened One without confusion or doubt, and after hearing it, they retain it and aren't able to forget it, which leads to unsurpassed correct enlightenment.",
        "source": "T07n0220_515:0634b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0634b23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩已得善巧陀羅尼故。」",
        "translation": "It's because the bodhisattva Mahāsattva has attained the skillful dhāraṇī.\"",
        "source": "T07n0220_515:0634b23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「是菩薩摩訶薩已得何等陀羅尼故，聞諸如來、應、正等覺所說正法無惑無疑，聞已受持常不忘失？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"What kind of dhāraṇī has the bodhisattva Mahāsattva attained so that he hears the right teaching taught by tathāgatas, arhats, and virtually perfect enlightenment without confusion or doubt, and after hearing it, he accepts it and never forgets it?\"",
        "source": "T07n0220_515:0634b24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩已得聞持陀羅尼等方便善巧，聞諸如來、應、正等覺所說正法無惑無疑，聞已受持能不忘失，乃至無上正等菩提，常如現前聞佛所說。」",
        "translation": "The Buddha told Śaṇḍinya, \"Suppose a bodhisattva mahāsattva has attained the skillful means of hearing and retaining dhāraṇīs, hears the correct teaching taught by tathāgatas, arhats, and virtually perfect enlightenment without confusion or doubt, retains it after hearing it, and doesn't lose it, up to unsurpassed correct enlightenment, and always hears what the Buddha teaches as before.\"",
        "source": "T07n0220_515:0634b27_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「是菩薩摩訶薩但聞如來、應、正等覺所說正法無惑無疑，聞已受持常不忘失，為聞菩薩、獨覺、聲聞、天、龍、藥叉、人非人等所說正法，亦能於彼無惑無疑，聞已受持常不忘失？」",
        "translation": "It was then that the good present again said to the Buddha, \"Is it possible for a bodhisattva, a Mahāsattva, or a pratyekabuddha who hears the right teaching taught by tathāgatas, arhats, and virtually all enlightened ones without confusion or doubt and who accepts it after hearing it and never forgets it, to also hear the right teaching taught by bodhisattvas, solitary realizers, śrāvakas, gods, dragons, yakṣas, humans, and nonhumans without confusion or doubt and who accepts it after hearing it and never forgets it?\"",
        "source": "T07n0220_515:0634c01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩普聞一切有情言音文字義理，皆能通達無惑無疑，窮未來際常不忘失。",
        "translation": "The Buddha told Śaṇḍinya, \"This is the bodhisattva Mahāsattva who hears the words, sounds, words, and meanings of all sentient beings universally, comprehends them without confusion or doubt, and never forgets them for as long as they live.",
        "source": "T07n0220_515:0634c06_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0634c08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩已得聞持陀羅尼等方便善巧，任持所說令不失故。",
        "translation": "This is because the bodhisattva Mahāsattva has attained the skillful means of hearing and retaining the dhāraṇī, and so forth, and he retains what's taught so that it doesn't get lost.",
        "source": "T07n0220_515:0634c08_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是諸行、狀、相，知是不退轉菩薩摩訶薩。」",
        "translation": "If a bodhisattva-mahāsattva accomplishes such practices, forms, and characteristics, he knows that he's a nonretrogressing bodhisattva-mahāsattva.\"",
        "source": "T07n0220_515:0634c10_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分空相品第二十一之一",
        "translation": "Part Three, Chapter Twenty-One of the Chapter on the Characteristics of Emptiness",
        "source": "T07n0220_515:0634c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現復白佛言：「世尊！",
        "translation": "At that point, Kauśāmbī Sunbeam again said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_515:0634c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是不退轉菩薩摩訶薩，成就廣大無量無邊不可思議希有功德。」",
        "translation": "Thus, the nonretrogressing bodhisattva Mahāsattva has achieved vast, immeasurable, and unfathomably rare merit.\"",
        "source": "T07n0220_515:0634c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_515:0634c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_515:0634c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_515:0634c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_515:0634c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩已得殊勝無量無邊不共聲聞及獨覺智，住此智中引發殊勝四無礙解。",
        "translation": "This bodhisattva Mahāsattva has attained superior, immeasurable, and limitless distinctive śrāvaka and pratyekabuddha cognition, and abiding in that cognition gives rise to the superior four unhindered understandings.",
        "source": "T07n0220_515:0634c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此殊勝四無礙解，世間天、人、阿素洛等無能問難，令此菩薩智慧辯才至窮盡者。」",
        "translation": "Because of these superior four unhindered understandings, there's nothing that gods, humans, asuras, and others in the world can ask about that would cause this bodhisattva's wisdom and eloquence to reach its limit.\"",
        "source": "T07n0220_515:0634c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊能如殑伽沙劫宣說不退轉菩薩摩訶薩諸行、狀、相，由佛所說諸行、狀、相，顯示不退轉菩薩摩訶薩成就無量殊勝功德。",
        "translation": "Kauśāmbī also said to the Buddha, \"The Bhagavān can explain the irreversible bodhisattva Mahāsattva's actions, appearance, and form for as long as the sands of Ganges and eons, and the Buddha's explanation of those actions, appearance, and form reveals the irreversible bodhisattva Mahāsattva's accomplishment of measureless and excellent qualities.",
        "source": "T07n0220_515:0634c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來、應、正等覺復為宣說甚深義處，令諸菩薩安住其中，能行布施波羅蜜多乃至般若波羅蜜多令速圓滿，能行內空乃至無性自性空令速圓滿，能行真如乃至不思議界令速圓滿，能行苦、集、滅、道聖諦令速圓滿，能行四念住乃至八聖道支令速圓滿，能行四靜慮、四無量、四無色定令速圓滿，能行八解脫乃至十遍處令速圓滿，能行空、無相、無願解脫門令速圓滿，能行菩薩摩訶薩地令速圓滿，能行一切陀羅尼門、三摩地門令速圓滿，能行五眼、六神通令速圓滿，能行如來十力乃至十八佛不共法令速圓滿，能行大慈、大悲、大喜、大捨令速圓滿，能行三十二相、八十隨好令速圓滿，能行無忘失法、恒住捨性令速圓滿，能行一切智、道相智、一切相智令速圓滿。」",
        "translation": "唯願如來、應、正等覺復為宣說甚深義處，令諸菩薩安住其中，能行布施波羅蜜多乃至般若波羅蜜多令速圓滿，能行內空乃至無性自性空令速圓滿，能行真如乃至不思議界令速圓滿，能行苦、集、滅、道聖諦令速圓滿，能行四念住乃至八聖道支令速圓滿，能行四靜慮、四無量、四無色定令速圓滿，能行八解脫乃至十遍處令速圓滿，能行空、無相、無願解脫門令速圓滿，能行菩薩摩訶薩地令速圓滿，能行一切陀羅尼門、三摩地門令速圓滿，能行五眼、六神通令速圓滿，能行如來十力乃至十八佛不共法令速圓滿，能行大慈、大悲、大喜、大捨令速圓滿，能行三十二相、八十隨好令速圓滿，能行無忘失法、恒住捨性令速圓滿，能行一切智、道相智、一切相智令速圓滿。」",
        "source": "T07n0220_515:0634c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「善哉！",
        "translation": "The Buddha told the good manifestation, \"Good!",
        "source": "T07n0220_515:0635a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_515:0635a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今乃能為諸菩薩摩訶薩眾請問如來、應、正等覺甚深義處，令諸菩薩安住其中，行諸功德令速圓滿。",
        "translation": "Now, can you ask the Tathāgata, the Worthy One, and the Completely Enlightened One about the profound meaning of this place for a multitude of bodhisattvas and mahāsattvas, so that they will abide in it and perform all the virtues that will speedily bring it to completion?",
        "source": "T07n0220_515:0635a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know it well!",
        "source": "T07n0220_515:0635a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深義處，謂空、無相、無願、無作、無生、無滅、離染、涅槃、真如、法界、法性、實際，如是等名甚深義處。",
        "translation": "\"Profoundly profound fields are those that are empty, signless, wishless, uncreated, unarisen, unceasing, free of defilement, nirvāṇa, true nature, the Dharma realm, the nature of things, and reality, and such are called very profound fields of meaning.",
        "source": "T07n0220_515:0635a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well understand this!",
        "source": "T07n0220_515:0635a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說甚深義處種種增語，皆顯涅槃為甚深義。」",
        "translation": "Such are the various ways in which the profound meaning is expressed, which all indicate that nirvāṇa is a profound meaning.\"",
        "source": "T07n0220_515:0635a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「為但涅槃名甚深義，為諸餘法亦名甚深？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Why is nirvāṇa called profound and why are the other dharmas also called profound?\"",
        "source": "T07n0220_515:0635a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「餘一切法亦名甚深，所謂色蘊乃至識蘊亦名甚深，眼處乃至意處亦名甚深，色處乃至法處亦名甚深，眼界乃至意界亦名甚深，色界乃至法界亦名甚深，眼識界乃至意識界亦名甚深，眼觸乃至意觸亦名甚深，眼觸為緣所生諸受乃至意觸為緣所生諸受亦名甚深，地界乃至識界亦名甚深，因緣乃至增上緣亦名甚深，無明乃至老死亦名甚深，布施波羅蜜多乃至般若波羅蜜多亦名甚深，內空乃至無性自性空亦名甚深，真如乃至不思議界亦名甚深，苦、集、滅、道聖諦亦名甚深，四念住乃至八聖道支亦名甚深，四靜慮、四無量、四無色定亦名甚深，八解脫乃至十遍處亦名甚深，空、無相、無願解脫門亦名甚深，淨觀地乃至如來地亦名甚深，極喜地乃至法雲地亦名甚深，陀羅尼門、三摩地門亦名甚深，五眼、六神通亦名甚深，如來十力乃至十八佛不共法亦名甚深，大慈、大悲、大喜、大捨亦名甚深，三十二相、八十隨好亦名甚深，無忘失法、恒住捨性亦名甚深，一切智、道相智、一切相智亦名甚深，預流果乃至獨覺菩提亦名甚深，一切菩薩摩訶薩行、諸佛無上正等菩提亦名甚深。」",
        "translation": "佛告善現：「餘一切法亦名甚深，所謂色蘊乃至識蘊亦名甚深，眼處乃至意處亦名甚深，色處乃至法處亦名甚深，眼界乃至意界亦名甚深，色界乃至法界亦名甚深，眼識界乃至意識界亦名甚深，眼觸乃至意觸亦名甚深，眼觸為緣所生諸受乃至意觸為緣所生諸受亦名甚深，地界乃至識界亦名甚深，因緣乃至增上緣亦名甚深，無明乃至老死亦名甚深，布施波羅蜜多乃至般若波羅蜜多亦名甚深，內空乃至無性自性空亦名甚深，真如乃至不思議界亦名甚深，苦、集、滅、道聖諦亦名甚深，四念住乃至八聖道支亦名甚深，四靜慮、四無量、四無色定亦名甚深，八解脫乃至十遍處亦名甚深，空、無相、無願解脫門亦名甚深，淨觀地乃至如來地亦名甚深，極喜地乃至法雲地亦名甚深，陀羅尼門、三摩地門亦名甚深，五眼、六神通亦名甚深，如來十力乃至十八佛不共法亦名甚深，大慈、大悲、大喜、大捨亦名甚深，三十二相、八十隨好亦名甚深，無忘失法、恒住捨性亦名甚深，一切智、道相智、一切相智亦名甚深，預流果乃至獨覺菩提亦名甚深，一切菩薩摩訶薩行、諸佛無上正等菩提亦名甚深。」",
        "source": "T07n0220_515:0635a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「云何色蘊亦名甚深？",
        "translation": "It was then that the good present again said to the Buddha, \"What is the aggregate of form also called very profound?",
        "source": "T07n0220_515:0635b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何受、想、行、識蘊亦名甚深？",
        "translation": "How are the aggregates of feeling, perception, volition, and consciousness also called very profound?",
        "source": "T07n0220_515:0635b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至云何一切菩薩摩訶薩行亦名甚深？",
        "translation": "How are all the bodhisattva-mahāsattva practices also called profound?",
        "source": "T07n0220_515:0635b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何諸佛無上正等菩提亦名甚深？」",
        "translation": "How are the buddhas' unsurpassed correct enlightenment also called very profound?\"",
        "source": "T07n0220_515:0635b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「色蘊真如甚深故，色蘊亦名甚深；受、想、行、識蘊真如甚深故，受、想、行、識蘊亦名甚深。",
        "translation": "The Buddha told Śaṅgālī, \"Because the form aggregate is truly profound, the form aggregate is also called very profound; because the aggregates of feeling, perception, volition, and consciousness are truly profound, the aggregates of feeling, perception, volition, and consciousness are also called very profound.",
        "source": "T07n0220_515:0635b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至一切菩薩摩訶薩行真如甚深故，一切菩薩摩訶薩行亦名甚深；諸佛無上正等菩提真如甚深故，諸佛無上正等菩提亦名甚深。」",
        "translation": "It's also explained in detail that because the true nature of all bodhisattva-mahāsattva practices is very profound, the names of all bodhisattva-mahāsattva practices are also very profound, and because the true nature of the buddhas' unsurpassed correct enlightenment is very profound, the names of the buddhas' unsurpassed correct enlightenment are also very profound.\"",
        "source": "T07n0220_515:0635b16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「云何色蘊真如甚深？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"What is the true profundity of the aggregate of form?",
        "source": "T07n0220_515:0635b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何受、想、行、識蘊真如甚深？",
        "translation": "\"How are the sensation, perception, volition, and consciousness aggregates truly profound?",
        "source": "T07n0220_515:0635b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至云何一切菩薩摩訶薩行真如甚深？",
        "translation": "How profound is the practice of all bodhisattvas, mahāsattvas, and true thusness?",
        "source": "T07n0220_515:0635b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何諸佛無上正等菩提真如甚深？」",
        "translation": "What is the true profundity of the buddhas' unsurpassed perfect enlightenment?\"",
        "source": "T07n0220_515:0635b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「色蘊真如，非即色蘊，非離色蘊，是故甚深；受、想、行、識蘊真如，非即受、想、行、識蘊，非離受、想、行、識蘊，是故甚深。",
        "translation": "The Buddha told Śaṅgālī, \"The true nature of the form aggregate is not that which is the form aggregate and not separate from the form aggregate, which makes it very profound; the true nature of the feeling, perception, volition, and consciousness aggregates is not that which is the feeling, perception, volition, and consciousness aggregates and not separate from the feeling, perception, volition, and consciousness aggregates, which makes it very profound.",
        "source": "T07n0220_515:0635b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至一切菩薩摩訶薩行真如，非即一切菩薩摩訶薩行，非離一切菩薩摩訶薩行，是故甚深；諸佛無上正等菩提真如，非即諸佛無上正等菩提，非離諸佛無上正等菩提，是故甚深。」",
        "translation": "It's also explained in detail that the true nature of all bodhisattva-mahāsattva practices is not that they are all bodhisattva-mahāsattva practices and not separate from all bodhisattva-mahāsattva practices; therefore, it's very profound; the true nature of the buddhas' unsurpassed correct enlightenment is not that they are the buddhas' unsurpassed correct enlightenment and not separate from the buddhas' unsurpassed correct enlightenment; therefore, it's very profound.\"",
        "source": "T07n0220_515:0635b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣色蘊顯示涅槃，遮遣受、想、行、識蘊顯示涅槃，廣說乃至遮遣一切菩薩摩訶薩行顯示涅槃，遮遣諸佛無上正等菩提顯示涅槃。",
        "translation": "It was then that the good manifestation again said to the Buddha, \"Bhagavān, what wonderful and subtle skillful means does the nonretrogressing bodhisattva Mahāsattva obscure the form aggregate from revealing nirvāṇa, obscure the feeling, perception, volition, and consciousness aggregates from revealing nirvāṇa, explain in detail and up to obscuring all bodhisattva-mahāsattva practices from revealing nirvāṇa, and obscure the buddhas' unsurpassed correct enlightenment from revealing nirvāṇa.",
        "source": "T07n0220_515:0635c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊甚奇微妙方便，為不退轉地菩薩摩訶薩，遮遣一切若世間法若出世間法、若共法若不共法、若有漏法若無漏法、若有諍法若無諍法、若有罪法若無罪法、若有為法若無為法，顯示涅槃。」",
        "translation": "The Bhagavān's very rare and subtle skillful means are to deny the bodhisattvas and mahāsattvas at the stage of nonretrogression all the things that reveal nirvāṇa, whether mundane or transmundane, common or distinct, contaminated or uncontaminated, disputed or uncontested, guilty or blameless, and created or uncreated.\"",
        "source": "T07n0220_515:0635c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told the good manifestation, \"So it is!",
        "source": "T07n0220_515:0635c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_515:0635c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_515:0635c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣色蘊顯示涅槃，遮遣受、想、行、識蘊顯示涅槃，廣說乃至遮遣一切菩薩摩訶薩行顯示涅槃，遮遣諸佛無上正等菩提顯示涅槃。",
        "translation": "The Bhagavān's very rare and subtle method is to deny the bodhisattvas and mahāsattvas at the stage of nonretrogression the form aggregate that reveals nirvāṇa, deny the sensation, perception, volition, and consciousness aggregates that reveal nirvāṇa, explain in detail up to the denial of all bodhisattva-mahāsattva practices that reveal nirvāṇa, and deny the buddhas unsurpassed correct enlightenment that reveals nirvāṇa.",
        "source": "T07n0220_515:0635c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣一切若世間法若出世間法、若共法若不共法、若有漏法若無漏法、若有諍法若無諍法、若有罪法若無罪法、若有為法若無為法，顯示涅槃。",
        "translation": "The Bhagavān's most wondrous and subtle skillful means reveal nirvāṇa for the nonretrogressing bodhisattvas, the great mahāsattvas, by excluding all things that are worldly and transmundane, common and distinct, contaminated and uncontaminated, disputed and uncontested, guilty and blameless, and made and unmade.",
        "source": "T07n0220_515:0635c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_515:0635c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩應於如是甚深義處，依深般若波羅蜜多相應理趣，審諦思惟籌量觀察，應作是念：『我今應如甚深般若波羅蜜多所教而住，我今應如甚深般若波羅蜜多所說而學。』",
        "translation": "At this point in their lives, bodhisattvas and mahāsattvas should rely on the principle of the profound prajñāpāramitā and carefully consider and examine it, thinking, 'Now, I should abide as the profound prajñāpāramitā teaches me, and now I should train as the profound prajñāpāramitā teaches me.'",
        "source": "T07n0220_515:0635c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T07n0220_515:0635c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能於如是甚深義處，依深般若波羅蜜多相應理趣，審諦思惟籌量觀察，如深般若波羅蜜多所教而住，如深般若波羅蜜多所說而學。",
        "translation": "\"If the bodhisattva Mahāsattva can stand in such a profound place, rely on the principle of the profound prajñāpāramitā and associate with it, examine it with deliberation and deliberation, abide as the profound prajñpāramitā teaches, and train as the profound prajñpāramitā teaches.",
        "source": "T07n0220_515:0635c23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩由能如是精勤修學，依深般若波羅蜜多起一念心，尚能攝受無量無數無邊善根，超無量劫生死流轉，速證無上正等菩提，況能無間常修般若波羅蜜多，恒住菩提相應作意！",
        "translation": "Because the bodhisattva thus diligently cultivates and produces a single thought based on the profound prajñāpāramitā, he can still gather measureless, countless, and limitless good roots, transcend the transmigration through birth and death for measureless eons, and quickly realize unsurpassed perfect enlightenment, much more can he continuously cultivate the prajñāpāramitā and constantly abide in the contemplation associated with enlightenment!",
        "source": "T07n0220_515:0635c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如耽欲人與端正女，更相愛染共為期契，彼女限礙不獲赴期，此人欲心熾盛流注。",
        "translation": "\"Suppose a person who's addicted to desire and a proper woman are in love and have a mutual commitment, and that woman is restricted and doesn't get to meet the commitment, and that person's desire is raging.",
        "source": "T07n0220_515:0636a02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T07n0220_515:0636a04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_515:0636a04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人欲心於何處轉？」",
        "translation": "Where does that person's mind of desire turn?\"",
        "source": "T07n0220_515:0636a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_515:0636a05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人欲心於女處轉，謂作是念：『彼何當來共會於此歡娛戲樂？』」",
        "translation": "That person's desire is to turn his mind toward women, which is to say that he thinks, 'Why will they come together here to have fun and play?'\"",
        "source": "T07n0220_515:0636a05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_515:0636a06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_515:0636a06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人晝夜幾欲念生？」",
        "translation": "How often does a person want to be mindful of birth during the day and night?\"",
        "source": "T07n0220_515:0636a07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_515:0636a07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人晝夜欲念甚多。」",
        "translation": "This person's daytime and nighttime desires are numerous.\"",
        "source": "T07n0220_515:0636a07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩依深般若波羅蜜多起一念心，如深般若波羅蜜多所說而學，所超生死流轉劫數，與耽欲人經一晝夜所起欲念其數量等。",
        "translation": "The Buddha told Śaṃnara, \"If a bodhisattva relies on the profound prajñāpāramitā to give rise to a single thought, and trains according to what the profound prajñāpāramitā teaches, the number of eons of transmigration that he transcends in birth-and-death is the same as the number of thoughts of desire that arise in a person who longs for them during a single day and night.",
        "source": "T07n0220_515:0636a08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good present, you should know!",
        "source": "T07n0220_515:0636a11_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩隨依般若波羅蜜多甚深義趣思惟修學，隨能解脫能礙無上正等菩提所有過失，是故菩薩依深般若波羅蜜多精勤修學，速證無上正等菩提。",
        "translation": "\"Thus, when a bodhisattva reflects and cultivates the profound meaning of the perfection of wisdom, he's able to liberate himself from all the faults that hinder unsurpassed correct enlightenment, and therefore the bodhisattva diligently cultivates the profound perfection of wisdom and quickly realizes unsurpassed correct enlightenment.",
        "source": "T07n0220_515:0636a11_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_515:0636a15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩如深般若波羅蜜多所說而住，經一晝夜所獲功德，若此功德有形礙者，殑伽沙等三千大千諸佛世界不能容受。",
        "translation": "\"If a bodhisattva Mahāsattva abides according to the profound teaching of the perfection of wisdom for a single day and night, then if this merit were physically obstructed, the world of sands and other 3,000 great thousand buddhas wouldn't be able to tolerate it.",
        "source": "T07n0220_515:0636a15_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使充滿如殑伽沙三千大千佛之世界諸餘功德比此功德，百分不及一，千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "If the world of sands and 3,000 great thousand buddhas were filled with other merits that compared with this merit, a hundredth would be less than one, a thousandth would be less than one, and even the portion of the Upaniṣad would be less than one.",
        "source": "T07n0220_515:0636a18_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 515",
        "source": "T07n0220_515:0636a22_0",
        "is_bad_quality": false
    }
]