[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 501",
        "source": "T07n0220_512:0613a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二",
        "translation": "twelve",
        "source": "T07n0220_512:0613a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_512:0613a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分善友品第十八",
        "translation": "The Eighteenth Chapter of the Third Part of Good Friends",
        "source": "T07n0220_512:0613a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現復白佛言：「世尊！",
        "translation": "At that point, Kauśāmbī Sunbeam again said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_512:0613a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新學大乘諸菩薩摩訶薩，云何應學般若、靜慮、精進、安忍、淨戒、布施波羅蜜多？」",
        "translation": "How should newly trained great vehicle bodhisattvas and mahāsattvas train in prajñā, meditation, exertion, patience, pure precepts, and the perfection of generosity?\"",
        "source": "T07n0220_512:0613a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「新學大乘諸菩薩摩訶薩，欲學般若乃至布施波羅蜜多，應先親近、承事、供養能善宣說分別般若乃至布施波羅蜜多真淨善友。",
        "translation": "The Buddha told Śaṇḍinya, \"Newly-trained Mahāyāna bodhisattvas and mahāsattvas who want to train in prajñā and even the perfection of generosity should first get close to, serve, and support a truly pure and good friend who can skillfully explain and discern prajñā and the perfection of generosity.",
        "source": "T07n0220_512:0613a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂說般若波羅蜜多甚深經時，教誡教授新學大乘諸菩薩言：『來！",
        "translation": "This is called the very profound sutra on the prajñāpāramitā that teaches and admonishes newly trained Mahāyāna bodhisattvas, saying, 'Come!",
        "source": "T07n0220_512:0613a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_512:0613a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應勤修布施、淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "You should diligently cultivate generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T07n0220_512:0613a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝勤修時應以無所得而為方便，與一切有情平等共有迴向無上正等菩提。",
        "translation": "When you diligently cultivate them, you should use the method of obtaining nothing as a way to share equally with all sentient beings the same, and you should dedicate yourself to unsurpassed perfect enlightenment.",
        "source": "T07n0220_512:0613a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝勿以色蘊乃至識蘊而取無上正等菩提，亦勿以眼處乃至意處而取無上正等菩提，亦勿以色處乃至法處而取無上正等菩提，亦勿以眼界乃至意界而取無上正等菩提，亦勿以色界乃至法界而取無上正等菩提，亦勿以眼識界乃至意識界而取無上正等菩提，亦勿以眼觸乃至意觸而取無上正等菩提，亦勿以眼觸為緣所生諸受乃至意觸為緣所生諸受而取無上正等菩提，亦勿以地界乃至識界而取無上正等菩提，亦勿以因緣乃至增上緣而取無上正等菩提，亦勿以無明乃至老死而取無上正等菩提，亦勿以布施波羅蜜多乃至般若波羅蜜多而取無上正等菩提，亦勿以內空乃至無性自性空而取無上正等菩提，亦勿以真如乃至不思議界而取無上正等菩提，亦勿以苦、集、滅、道聖諦而取無上正等菩提，亦勿以四念住乃至八聖道支而取無上正等菩提，亦勿以四靜慮、四無量、四無色定而取無上正等菩提，亦勿以八解脫、八勝處、九次第定、十遍處而取無上正等菩提，亦勿以空、無相、無願解脫門而取無上正等菩提，亦勿以淨觀地乃至如來地而取無上正等菩提，亦勿以極喜地乃至法雲地而取無上正等菩提，亦勿以一切陀羅尼門、三摩地門而取無上正等菩提，亦勿以五眼、六神通而取無上正等菩提，亦勿以如來十力乃至十八佛不共法而取無上正等菩提，亦勿以三十二相、八十隨好而取無上正等菩提，亦勿以無忘失法、恒住捨性而取無上正等菩提，亦勿以預流果乃至獨覺菩提而取無上正等菩提，亦勿以一切菩薩摩訶薩行、諸佛無上正等菩提而取無上正等菩提，亦勿以一切智、道相智、一切相智而取無上正等菩提。",
        "translation": "汝勿以色蘊乃至識蘊而取無上正等菩提，亦勿以眼處乃至意處而取無上正等菩提，亦勿以色處乃至法處而取無上正等菩提，亦勿以眼界乃至意界而取無上正等菩提，亦勿以色界乃至法界而取無上正等菩提，亦勿以眼識界乃至意識界而取無上正等菩提，亦勿以眼觸乃至意觸而取無上正等菩提，亦勿以眼觸為緣所生諸受乃至意觸為緣所生諸受而取無上正等菩提，亦勿以地界乃至識界而取無上正等菩提，亦勿以因緣乃至增上緣而取無上正等菩提，亦勿以無明乃至老死而取無上正等菩提，亦勿以布施波羅蜜多乃至般若波羅蜜多而取無上正等菩提，亦勿以內空乃至無性自性空而取無上正等菩提，亦勿以真如乃至不思議界而取無上正等菩提，亦勿以苦、集、滅、道聖諦而取無上正等菩提，亦勿以四念住乃至八聖道支而取無上正等菩提，亦勿以四靜慮、四無量、四無色定而取無上正等菩提，亦勿以八解脫、八勝處、九次第定、十遍處而取無上正等菩提，亦勿以空、無相、無願解脫門而取無上正等菩提，亦勿以淨觀地乃至如來地而取無上正等菩提，亦勿以極喜地乃至法雲地而取無上正等菩提，亦勿以一切陀羅尼門、三摩地門而取無上正等菩提，亦勿以五眼、六神通而取無上正等菩提，亦勿以如來十力乃至十八佛不共法而取無上正等菩提，亦勿以三十二相、八十隨好而取無上正等菩提，亦勿以無忘失法、恒住捨性而取無上正等菩提，亦勿以預流果乃至獨覺菩提而取無上正等菩提，亦勿以一切菩薩摩訶薩行、諸佛無上正等菩提而取無上正等菩提，亦勿以一切智、道相智、一切相智而取無上正等菩提。",
        "source": "T07n0220_512:0613a21_7",
        "is_bad_quality": true
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0613b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_512:0613b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不取色便得無上正等菩提，乃至不取一切相智便得無上正等菩提。",
        "translation": "If you don't grasp form, then you'll attain unsurpassed correct enlightenment, and if you don't grasp the knowledge of all characteristics, then you'll attain unsurpassed correct enlightenment.",
        "source": "T07n0220_512:0613b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『汝善男子！",
        "translation": "\"'You good sons!",
        "source": "T07n0220_512:0613b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行深般若波羅蜜多時，勿貪著色、受、想、行、識，廣說乃至一切相智。",
        "translation": "\"When practicing the profound perfection of wisdom, don't be attached to form, feeling, perception, volition, and consciousness, which are explained in detail up to the knowledge of all characteristics.",
        "source": "T07n0220_512:0613b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0613b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以色乃至一切相智非可貪著。",
        "translation": "\"It's because form and even the cognition of all characteristics are not something to be clung to.",
        "source": "T07n0220_512:0613b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0613c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_512:0613c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。』」",
        "translation": "It's because the self-nature of all dharmas is empty.'\"",
        "source": "T07n0220_512:0613c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「諸菩薩摩訶薩能為難事，於一切法自相空中，希求無上正等菩提，欲證無上正等菩提。」",
        "translation": "It was then that Śaṃnara again said to the Buddha, \"Bodhisattvas, mahāsattvas, are capable of doing difficult things, seeking unsurpassed correct enlightenment and wanting to realize unsurpassed correct enlightenment in the self-nature of all dharmas.\"",
        "source": "T07n0220_512:0613c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_512:0613c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_512:0613c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩能為難事，於一切法自相空中，希求無上正等菩提，欲證無上正等菩提。",
        "translation": "\"Bodhisattvas, mahāsattvas are capable of doing difficult things, seeking unsurpassed correct enlightenment in the midst of the distinctive characteristics of all things, and wanting to realize unsurpassed correct enlightenment.",
        "source": "T07n0220_512:0613c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_512:0613c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩雖知諸法皆如幻事，廣說乃至如尋香城自相皆空，而為世間得義利故，發趣無上正等菩提；為令世間得利益故，發趣無上正等菩提；為令世間得安樂故，發趣無上正等菩提；為欲拔濟諸世間故，發趣無上正等菩提；為與世間作歸依故，發趣無上正等菩提；為與世間作舍宅故，發趣無上正等菩提；欲示世間究竟道故，發趣無上正等菩提；為與世間作洲渚故，發趣無上正等菩提；為與世間作日月故，發趣無上正等菩提；為與世間作燈燭故，發趣無上正等菩提；為與世間作導師故，發趣無上正等菩提；為與世間作將帥故，發趣無上正等菩提；為與世間作所趣故，發趣無上正等菩提。",
        "translation": "諸菩薩摩訶薩雖知諸法皆如幻事，廣說乃至如尋香城自相皆空，而為世間得義利故，發趣無上正等菩提；為令世間得利益故，發趣無上正等菩提；為令世間得安樂故，發趣無上正等菩提；為欲拔濟諸世間故，發趣無上正等菩提；為與世間作歸依故，發趣無上正等菩提；為與世間作舍宅故，發趣無上正等菩提；欲示世間究竟道故，發趣無上正等菩提；為與世間作洲渚故，發趣無上正等菩提；為與世間作日月故，發趣無上正等菩提；為與世間作燈燭故，發趣無上正等菩提；為與世間作導師故，發趣無上正等菩提；為與世間作將帥故，發趣無上正等菩提；為與世間作所趣故，發趣無上正等菩提。",
        "source": "T07n0220_512:0613c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為令世間得義利故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to cause the world to attain its goal of obtaining meaningful benefit?",
        "source": "T07n0220_512:0613c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0613c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為欲解脫一切有情諸苦惱事，修行布施乃至般若，發趣無上正等菩提，是為菩薩摩訶薩為令世間得義利故，發趣無上正等菩提。",
        "translation": "When a bodhisattva wants to liberate all sentient beings from various painful and distressing conditions, he cultivates generosity up to prajñā and sets out for unsurpassed correct enlightenment, which is the bodhisattva's aim to achieve unsurpassed correct enlightenment for the sake of bringing benefit to the world.",
        "source": "T07n0220_512:0613c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為令世間得利益故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment for the sake of bringing benefit to the world?",
        "source": "T07n0220_512:0613c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0613c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為拔五趣怖畏有情置於涅槃無畏彼岸，發趣無上正等菩提，是為菩薩摩訶薩為令世間得利益故，發趣無上正等菩提。",
        "translation": "The bodhisattva Mahāsattva sets out for unsurpassed correct enlightenment in order to remove the five destinies of fearful sentient beings and place them on the fearless other shore of nirvāṇa, which is the bodhisattva Mahāsattva's setting out for unsurpassed correct enlightenment for the sake of bringing benefit to the world.",
        "source": "T07n0220_512:0613c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為令世間得安樂故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to bring about worldly well-being?",
        "source": "T07n0220_512:0614a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為拔憂苦愁惱有情置於涅槃安隱彼岸，發趣無上正等菩提，是為菩薩摩訶薩為令世間得安樂故，發趣無上正等菩提。",
        "translation": "For the sake of removing sorrow and suffering from sentient beings and placing them on the peaceful shore of nirvāṇa, the bodhisattva Mahāsattva sets out for unsurpassed correct enlightenment, which is the bodhisattva's aim to achieve unsurpassed correct enlightenment for the sake of making the world comfortable.",
        "source": "T07n0220_512:0614a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為欲拔濟諸世間故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment for the sake of rescuing the world?",
        "source": "T07n0220_512:0614a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩見諸有情墮三惡趣，為欲拔濟令修善業，漸依三乘而趣出離，發趣無上正等菩提，是為菩薩摩訶薩為欲拔濟諸世間故，發趣無上正等菩提。",
        "translation": "When the bodhisattva Mahāsattva sees sentient beings fall into the three bad destinies, he wants to rescue them and make them cultivate good actions, gradually rely on the three vehicles to escape, and set out for unsurpassed correct enlightenment, which is the bodhisattva's aim to rescue the world and set out for unsurpassed correct enlightenment.",
        "source": "T07n0220_512:0614a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作歸依故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to make a refuge with the world?",
        "source": "T07n0220_512:0614a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為令一切生老病死愁歎憂苦所逼有情，速得解脫生等眾苦，住無餘依般涅槃界，發趣無上正等菩提，是為菩薩摩訶薩為與世間作歸依故，發趣無上正等菩提。",
        "translation": "For the sake of all sentient beings who are constrained by the suffering of birth, old age, illness, death, and sorrow, the bodhisattva Mahāsattva quickly attains liberation from the many sufferings of birth and so forth, abides in the state of great nirvāṇa without remainder, and sets out for unsurpassed correct enlightenment, which is the bodhisattva's setting out for unsurpassed correct enlightenment because he makes a home with the world.",
        "source": "T07n0220_512:0614a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作舍宅故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to make a home with the world?",
        "source": "T07n0220_512:0614a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩欲為有情說一切法皆不和合，發趣無上正等菩提，是為菩薩摩訶薩為與世間作舍宅故，發趣無上正等菩提。」",
        "translation": "The bodhisattva Mahāsattva wants to explain to sentient beings that all things are not compatible and to set out for unsurpassed correct enlightenment, which is the bodhisattva's intention to make a home for the world and set out for unsurpassed correct enlightenment.\"",
        "source": "T07n0220_512:0614a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現白佛言：「世尊！",
        "translation": "Kauśāmbī said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_512:0614a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何一切法皆不和合？」",
        "translation": "How are all dharmas not compatible?\"",
        "source": "T07n0220_512:0614a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸色不和合即色不相屬，若色不相屬即色無生，若色無生即色無滅，若色無滅即色不和合，受、想、行、識廣說乃至一切相智亦復如是。",
        "translation": "The Buddha told Śaṅgālī, \"When form doesn't combine, it means that form doesn't belong together; when form doesn't belong together, form doesn't arise; when form doesn't arise, form doesn't cease; when form doesn't cease, form doesn't combine; and so it is with feeling, perception, volition, and consciousness, as explained in detail, and even with the wisdom of all characteristics.",
        "source": "T07n0220_512:0614a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲為有情說一切法皆有如是不和合相，發趣無上正等菩提。",
        "translation": "Bodhisattvas, mahāsattvas want to explain for sentient beings that all things have such a discordant aspect and awaken them to unsurpassed perfect enlightenment.",
        "source": "T07n0220_512:0614a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩欲示世間究竟道故，發趣無上正等菩提？",
        "translation": "\"How do bodhisattvas, mahāsattvas, want to show the world the ultimate path and set out for unsurpassed correct enlightenment?",
        "source": "T07n0220_512:0614a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩發趣無上正等菩提，欲為有情說如是法，謂色彼岸即非色，受、想、行、識彼岸即非受、想、行、識，廣說乃至一切智彼岸即非一切智，道相智、一切相智彼岸即非道相智、一切相智。",
        "translation": "When the bodhisattva Mahāsattva sets out for unsurpassed correct enlightenment, he wants to teach sentient beings such a teaching, which is that the other shore of form is not form, the other shore of feeling, perception, volition, and consciousness is not feeling, perception, volition, and consciousness, and it's explained in detail up to the point where the other shore of omniscience is not omniscience, and the other shore of knowledge of the path and omniscience is not knowledge of the path and omniscience.",
        "source": "T07n0220_512:0614a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_512:0614b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色等彼岸相，一切法亦爾。」",
        "translation": "Just as it's like form and so forth on the other side, so are all dharmas.\"",
        "source": "T07n0220_512:0614b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「若一切法皆如色等彼岸相者，云何菩薩摩訶薩於一切法應現等覺？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"If all things are like form and such other shore characteristics, how should bodhisattvas, mahāsattvas, and buddhas present themselves as equally enlightened in all things?",
        "source": "T07n0220_512:0614b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "What is the reason?",
        "source": "T07n0220_512:0614b06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非色彼岸中有如是分別，謂此是色，此是受、想、行、識，廣說乃至一切相智。",
        "translation": "There's this kind of discernment on the other side of what's not form, which is that this is form and this is feeling, perception, volition, and consciousness, and it's explained in detail up to the cognition of all distinctive characteristics.",
        "source": "T07n0220_512:0614b06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非受、想、行、識廣說乃至一切相智彼岸中有如是分別，謂此是色，此是受、想、行、識，廣說乃至一切相智。」",
        "translation": "There is this kind of discernment on the other shore of cognition of what's not form, which is form, which is feeling, perception, volition, and consciousness, and which is explained in detail up to the cognition of all distinctive characteristics.\"",
        "source": "T07n0220_512:0614b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_512:0614b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_512:0614b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非色彼岸中有如是分別，謂此是色，廣說乃至一切相智，如是乃至非一切相智彼岸中有如是分別，謂此是色，廣說乃至一切相智。",
        "translation": "There's this kind of discernment on the other side of what's not form, which is this, and it's explained in detail up to the knowledge of all characteristics, and there's this kind of discernment on the other side of what's not form, which is this, and it's explained in detail up to the knowledge of all characteristics.",
        "source": "T07n0220_512:0614b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法本性空故。",
        "translation": "It's because the original nature of all things is empty.",
        "source": "T07n0220_512:0614b13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_512:0614b14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩甚為難事，謂雖觀一切法皆寂滅相甚深微妙而心不沈沒，作是念言：『我於此法現等覺已，證得無上正等菩提，為諸有情宣說開示如是寂滅深妙之法。』",
        "translation": "It's a very difficult thing for bodhisattvas, mahāsattvas, to say that even though they observe the profundity and subtlety of the cessation of all dharmas, their minds don't sink, and they think, 'After I became equally enlightened in this teaching and realized unsurpassed correct enlightenment, I will explain and reveal such a profound and subtle dharma of cessation for all sentient beings.'",
        "source": "T07n0220_512:0614b14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩欲示世間究竟道故，發趣無上正等菩提。",
        "translation": "This is because the bodhisattva Mahāsattva wants to show the world the ultimate path and set out for unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_512:0614b18_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作洲渚故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to make a continental island with the world?",
        "source": "T07n0220_512:0614b19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大小海河池中，高地可居周迴水斷說為洲渚。",
        "translation": "\"It's like a large or small ocean or river in a pond, where a high plateau can be dwelt on, surrounded by roundabout water, and described as a continent.",
        "source": "T07n0220_512:0614b21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, it's well expressed!",
        "source": "T07n0220_512:0614b22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色乃至識前後際斷，廣說乃至一切相智前後際斷。",
        "translation": "The anterior and subsequent ends of form and even consciousness are ended, and it's explained in detail up to the anterior and subsequent ends of omniscience.",
        "source": "T07n0220_512:0614b22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此前際後際斷故，一切法斷，此一切法前後際斷，即是寂滅微妙如實，謂空無所得道斷愛盡無餘，雜染永滅究竟涅槃。",
        "translation": "As a result of stopping both the prior and subsequent ends, all things are stopped, and the stopping of both the prior and subsequent ends of these things is the subtle, yet true reality of extinction, which is the cessation of emptiness, the ungraspable path, the end of craving, and the permanent cessation of defilements and final nirvāṇa.",
        "source": "T07n0220_512:0614b23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T07n0220_512:0614b26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩求證無上正等菩提，欲為有情宣說開示如是諸法前後際斷甚深寂滅微妙如實，是為菩薩摩訶薩為與世間作洲渚故，發趣無上正等菩提。",
        "translation": "When a bodhisattva Mahāsattva seeks to realize unsurpassed correct enlightenment and wants to explain and reveal for sentient beings the subtle and true nature of such things as profound extinction, this is called the bodhisattva Mahāsattva setting out for unsurpassed correct enlightenment in order to make a continent with the world.",
        "source": "T07n0220_512:0614b26_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作日月故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment in order to make the world a sun and moon?",
        "source": "T07n0220_512:0614c01_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614c02_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為破長夜無明卵[穀-禾+卵]所覆有情重黑闇故，為療有情無知瞖目令明朗故，為與一切愚冥有情作照明故，發趣無上正等菩提，是為菩薩摩訶薩為與世間作日月故，發趣無上正等菩提。",
        "translation": "Because the bodhisattva Mahāsattva destines for unsurpassed correct enlightenment by refuting the heavy darkness that covers sentient beings with the egg [grain - grain + egg] of ignorance for a long time, by healing the ignorant cataracts of sentient beings and making their eyes clear, and by providing illumination to all ignorant sentient beings, the bodhisattva Mahāsattva destines for unsurpassed correct enlightenment by making the sun and moon of the world.",
        "source": "T07n0220_512:0614c02_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作燈燭故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to be a candle for the world?",
        "source": "T07n0220_512:0614c07_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614c08_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩欲為有情宣說六種波羅蜜多及四攝事相應經典真實義趣，方便教導令勤修學，除滅種種無明黑闇，發趣無上正等菩提，是為菩薩摩訶薩為與世間作燈燭故發趣無上正等菩提。",
        "translation": "When a bodhisattva wants to teach sentient beings the true meaning of the six perfections and the scriptures that accompany the four practices, skillfully instruct them and cause them to diligently train, remove the various kinds of darkness and ignorance, and set out for unsurpassed correct enlightenment, this is called the bodhisattva Mahāsattva setting out for unsurpassed correct enlightenment in order to serve as a candle for the world.",
        "source": "T07n0220_512:0614c08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作導師故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to serve as a teacher to the world?",
        "source": "T07n0220_512:0614c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩欲令趣向邪道有情離行四種不應行處，為說一道令歸正故，為雜染者得清淨故，為愁惱者得歡悅故，為憂苦者得喜樂故，為非理者得如理故，為流轉者得還滅故，發趣無上正等菩提，是為菩薩摩訶薩為與世間作導師故，發趣無上正等菩提。",
        "translation": "When the bodhisattva Mahāsattva wants to cause sentient beings who are headed down the wrong path to part with the practice of the four undesirable positions, he aims for unsurpassed correct enlightenment in order to teach one path and make it right, to purify those who are defiled, to rejoice those who are sad and troubled, to rejoice those who are sad and troubled, to act according to reason for those who are not reason, and to return to cessation for those who are in a state of transmigration.",
        "source": "T07n0220_512:0614c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作將帥故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to serve as a commander in the world?",
        "source": "T07n0220_512:0614c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩希求無上正等菩提，欲為有情宣說開示色無生無滅、無染無淨，受、想、行、識無生無滅、無染無淨，廣說乃至一切智無生無滅、無染無淨，道相智、一切相智無生無滅、無染無淨。",
        "translation": "Seeking unsurpassed correct enlightenment, the bodhisattva Mahāsattva wants to teach and reveal for sentient beings that form is unborn, unceasing, undefiled, and unpurified, that feeling, perception, volition, and consciousness are unborn, unceasing, undefiled, and unpurified, and to explain in detail that all cognitions are unborn, unceasing, undefiled, and unpurified, and that knowledge of the path and knowledge of all characteristics are unborn, unceasing, undefiled, and unpurified.",
        "source": "T07n0220_512:0614c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作將帥故，發趣無上正等菩提。",
        "translation": "This is the bodhisattva-mahāsattva's aim to achieve unsurpassed perfect enlightenment for the sake of being a commander in the world.",
        "source": "T07n0220_512:0614c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩摩訶薩為與世間作所趣故，發趣無上正等菩提？",
        "translation": "\"How does the bodhisattva Mahāsattva set out for unsurpassed correct enlightenment in order to be a general with the world?",
        "source": "T07n0220_512:0614c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_512:0614c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩希求無上正等菩提，欲為有情宣說開示色以虛空為所趣，受、想、行、識以虛空為所趣，廣說乃至一切智以虛空為所趣，道相智、一切相智以虛空為所趣。",
        "translation": "Seeking unsurpassed correct enlightenment, the bodhisattva Mahāsattva wants to teach and reveal for sentient beings that form is destined for space, feeling, perception, volition, and consciousness are destined for space, and it's widely explained that even omniscience is destined for space, and knowledge of the path and omniscience are destined for space.",
        "source": "T07n0220_512:0614c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法皆如虛空無所有故，欲為有情宣說開示色非趣非不趣。",
        "translation": "Because all things are like space and lack existence, they want to explain and reveal for sentient beings that form is neither an object nor a non-object.",
        "source": "T07n0220_512:0615a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以色性空，空中無趣無不趣故。",
        "translation": "Because the nature of form is empty, there's no point of interest or disinterest in the air.",
        "source": "T07n0220_512:0615a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受、想、行、識非趣非不趣。",
        "translation": "*Feelings, perceptions, volitions, and consciousness are neither destined nor undesired.",
        "source": "T07n0220_512:0615a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以受、想、行、識性空，空中無趣無不趣故。",
        "translation": "Because the nature of feeling, perception, volition, and consciousness are empty, there's no aim or non-approach in the sky.",
        "source": "T07n0220_512:0615a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至一切智非趣非不趣。",
        "translation": "It's explained in detail up to the point where omniscience is neither an interest nor a non-interest.",
        "source": "T07n0220_512:0615a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切智性空，空中無趣無不趣故。",
        "translation": "Because the nature of all cognition is empty, there's no aim or non-approach in the sky.",
        "source": "T07n0220_512:0615a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道相智、一切相智非趣非不趣。",
        "translation": "The knowledge of the path and omniscience are neither interesting nor uninteresting.",
        "source": "T07n0220_512:0615a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以道相智、一切相智性空，空中無趣無不趣故。",
        "translation": "Because the nature of the knowledge of the path and the knowledge of all characteristics is empty, there's no point of departure and no point of non-return in the air.",
        "source": "T07n0220_512:0615a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作所趣故，發趣無上正等菩提。",
        "translation": "This is the reason why bodhisattvas, mahāsattvas, set out for unsurpassed perfect enlightenment in order to make the world their destination.",
        "source": "T07n0220_512:0615a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以空、無相、無願為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have emptiness, signlessness, and wishlessness as their goal, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0615a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無願中，趣與非趣不可得故。",
        "translation": "In emptiness, signlessness, and wishlessness, it's because destinies and non-destinies can't be obtained.",
        "source": "T07n0220_512:0615a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無起無作為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the aim of being unarisen and unconstructed, and bodhisattvas, mahāsattvas, cannot transcend such an aim.",
        "source": "T07n0220_512:0615a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無起無作中，趣與非趣不可得故。",
        "translation": "When there's no arising or making, the aim and the non-approach are inapprehensible.",
        "source": "T07n0220_512:0615a17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615a17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無生無滅為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the goal of no arising and no cessation, and bodhisattvas, mahāsattvas, cannot transcend such a goal.",
        "source": "T07n0220_512:0615a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無生無滅中，趣與非趣不可得故。",
        "translation": "In the absence of arising and cessation, it's because destinies and non-destinies are inapprehensible.",
        "source": "T07n0220_512:0615a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無染無淨為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the goal of being undefiled and impure, and bodhisattvas, mahāsattvas, can't go beyond such a goal.",
        "source": "T07n0220_512:0615a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無染無淨中，趣與非趣不可得故。",
        "translation": "In the absence of defilement or purity, it's because destinies and non-destinies can't be obtained.",
        "source": "T07n0220_512:0615a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無所有為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have nothing as their destination, and bodhisattvas, mahāsattvas, can't go beyond such a destination.",
        "source": "T07n0220_512:0615a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所有中，趣與非趣不可得故。",
        "translation": "\"In the absence of existence, it's because the aim and the non-point are inapprehensible.",
        "source": "T07n0220_512:0615a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以如夢乃至如尋香城為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have an aim like a dream or even like the city of discursive fragrance, and bodhisattvas, mahāsattvas, can't go beyond such an aim.",
        "source": "T07n0220_512:0615a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如夢乃至尋香城中，趣與非趣不可得故。",
        "translation": "Just like in a dream or even in the city of discovery, it's because destinies and non-destinies can't be discerned.",
        "source": "T07n0220_512:0615a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無量無邊為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have an immeasurable and limitless destination, and bodhisattvas, mahāsattvas, cannot transcend such a destination.",
        "source": "T07n0220_512:0615a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無邊中，趣與非趣不可得故。",
        "translation": "In the limitless and infinite, it's because destinies and non-destinies are inapprehensible.",
        "source": "T07n0220_512:0615b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以不與不取為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the aim of not taking and not acquiring, and bodhisattvas, mahāsattvas, cannot go beyond such an aim.",
        "source": "T07n0220_512:0615b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不與不取中，趣與非趣不可得故。",
        "translation": "Of what's not given and what's not taken, what's intended and what's not intended are inapprehensible.",
        "source": "T07n0220_512:0615b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以不舉不下為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the goal of not being lifted up or down, and bodhisattvas, mahāsattvas, can't go beyond such a goal.",
        "source": "T07n0220_512:0615b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不舉不下中，趣與非趣不可得故。",
        "translation": "When it's not held up or down, the aim and the non-point are inapprehensible.",
        "source": "T07n0220_512:0615b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無去無來為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the goal of no going and no coming, and bodhisattvas, mahāsattvas, cannot transcend such a goal.",
        "source": "T07n0220_512:0615b07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無去無來中，趣與非趣不可得故。",
        "translation": "In the absence of going and coming, it's because destinies and non-destinies are inapprehensible.",
        "source": "T07n0220_512:0615b08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615b09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無增無減為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the goal of neither increase nor decrease, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0615b09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無增無減中，趣與非趣不可得故。",
        "translation": "In neither increase nor decrease, it's because the aim and the non-point are inapprehensible.",
        "source": "T07n0220_512:0615b11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615b12_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無入無出為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the goal of no entry or exit, and bodhisattvas, mahāsattvas, cannot transcend such a goal.",
        "source": "T07n0220_512:0615b12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b13_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無入無出中，趣與非趣不可得故。",
        "translation": "There's no entry or exit, so the aim and the non-point are inapprehensible.",
        "source": "T07n0220_512:0615b13_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615b14_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無集無散為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the goal of no accumulation and no dispersion, and bodhisattvas, mahāsattvas, cannot transcend such a goal.",
        "source": "T07n0220_512:0615b14_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b16_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無集無散中，趣與非趣不可得故。",
        "translation": "In the absence of accumulation and dispersion, it's because destinies and non-destinies can't be obtained.",
        "source": "T07n0220_512:0615b16_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615b17_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無合無離為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the aim of being without union or separation, and bodhisattvas, mahāsattvas, cannot transcend such an aim.",
        "source": "T07n0220_512:0615b17_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b18_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無合無離中，趣與非趣不可得故。",
        "translation": "There's no conjunction or separation, so it's impossible to tell which path is intended and which isn't intended.",
        "source": "T07n0220_512:0615b19_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0615b19_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以我乃至見者為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have a self or even a view as their goal, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0615b19_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b21_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "I, even the one who sees it, am ultimately destitute of it, so why should there be interesting and non-interesting things to attain in it?",
        "source": "T07n0220_512:0615b21_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615b22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無我乃至無見者為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things are destined to lack self and even to lack views, and bodhisattvas, mahāsattvas, cannot transcend such destinies.",
        "source": "T07n0220_512:0615b23_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b24_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無我乃至無見者尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Nothing is ultimately possessed by the absence of a self, or even by the absence of views, so why should interesting and non-interesting aspects of it be obtainable?",
        "source": "T07n0220_512:0615b24_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615b26_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以常、樂、我、淨為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the destinies of permanence, happiness, self, and purity, and bodhisattvas, mahāsattvas, cannot go beyond such destinies.",
        "source": "T07n0220_512:0615b26_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615b27_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常、樂、我、淨尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Permanence, bliss, self, and purity are still ultimately nonexistent, so why should they be interesting and non-interesting to attain?",
        "source": "T07n0220_512:0615b28_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615b29_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無常、苦、無我、不淨為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things are destined to be impermanent, painful, selfless, and impure, and bodhisattvas, mahāsattvas, cannot transcend such destinies.",
        "source": "T07n0220_512:0615b29_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無常、苦、無我、不淨尚畢竟無所有，況於其中有趣、非趣可得！",
        "translation": "Impermanence, suffering, selflessness, and impurity are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以貪、瞋、癡事為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the objective of craving, anger, and delusion, and bodhisattvas, mahāsattvas, can't go beyond such an objective.",
        "source": "T07n0220_512:0615c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪、瞋、癡事尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Things of greed, anger, and delusion are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以見所作事為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things are destined to be done by seeing what's being done, and bodhisattvas, mahāsattvas, can't go beyond such a destination.",
        "source": "T07n0220_512:0615c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見所作事尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Seeing the ultimate nonexistence of works, how much more so when there are interesting and non-interesting things to attain!",
        "source": "T07n0220_512:0615c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以真如乃至不思議界為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have true reality and even the inconceivable realm as their destination, and bodhisattvas, mahāsattvas, can't go beyond such a destination.",
        "source": "T07n0220_512:0615c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如乃至不思議界尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The true thusness and even the inconceivable realm are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無動為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the aim of being motionless, and bodhisattvas, mahāsattvas, can't go beyond such an aim.",
        "source": "T07n0220_512:0615c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無動性尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The nature of immovability is still ultimately nonexistent, so why should it be possible to have interesting and non-interesting things in it?",
        "source": "T07n0220_512:0615c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以五蘊為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the five aggregates as their destination, and bodhisattvas, mahāsattvas, can't go beyond such a destination.",
        "source": "T07n0220_512:0615c15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色乃至識尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Form and even consciousness are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六內處為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the six internal sense-fields as their goal, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0615c18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處乃至意處尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The sense-field of the eye and even the sense-field of the mind are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六外處為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have six external destinies, and bodhisattvas, mahāsattvas, can't go beyond such destinies.",
        "source": "T07n0220_512:0615c21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處乃至法處尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The realm of form and even the realm of dharmas are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c24_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六內界為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the six internal realms as their destination, and bodhisattvas, mahāsattvas, can't go beyond such a destination.",
        "source": "T07n0220_512:0615c24_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界乃至意界尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The visual realm and even the mental realm are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c27_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六外界為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have six external destinies, and bodhisattvas, mahāsattvas, can't go beyond such destinies.",
        "source": "T07n0220_512:0615c27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0615c29_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界乃至法界尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The form realm and even the Dharma realm are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0615c29_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0615c30_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六識界為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the six consciousness factors as their destinies, and bodhisattvas, mahāsattvas, can't go beyond such destinies.",
        "source": "T07n0220_512:0615c30_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a02_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識界乃至意識界尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The element of visual consciousness and even the element of consciousness are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616a02_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a03_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六觸為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the six sense-fields as their goal, and bodhisattvas, mahāsattvas, can't go beyond such a goal.",
        "source": "T07n0220_512:0616a03_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a05_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸乃至意觸尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Even visual contact and mental contact are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616a05_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a06_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六受為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "All dharmas have the six sensations as their goal, and bodhisattvas, mahāsattvas, can't go beyond such a goal.",
        "source": "T07n0220_512:0616a06_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a08_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The sensations that arise from visual contact as a condition, and even the sensations that arise from mental contact as a condition, are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616a08_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a10_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六界為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "All dharmas have the six elements as their destinies, and bodhisattvas, mahāsattvas, can't go beyond such destinies.",
        "source": "T07n0220_512:0616a10_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a11_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界乃至識界尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The element of earth and even the element of consciousness are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616a11_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a13_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以四緣為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have four conditions as their destinies, and bodhisattvas, mahāsattvas, can't go beyond such destinies.",
        "source": "T07n0220_512:0616a13_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a14_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣乃至增上緣尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Causal and even contributory conditions are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616a14_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a16_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以十二支緣起為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have twelve links of dependent arising as their goal, and bodhisattvas, mahāsattvas, can't go beyond such a goal.",
        "source": "T07n0220_512:0616a16_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a17_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明乃至老死尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Nescience and even old age and death are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以六波羅蜜多為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the six perfections as their goal, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0616a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The perfection of generosity and even the perfection of wisdom are ultimately nonexistent, so why wouldn't they be interesting and non-interesting to attain?",
        "source": "T07n0220_512:0616a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以十六空為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have 16 destinies of emptiness, and bodhisattvas, mahāsattvas, can't go beyond such destinies.",
        "source": "T07n0220_512:0616a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無性自性空尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Inner emptiness and even the emptiness of a natureless nature are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以四聖諦為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the four noble truths as their goal, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0616a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦、集、滅、道聖諦尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The noble truths of suffering, arising, cessation, and the path are ultimately nonexistent, so why should there be interesting and non-existent paths to attain in them?",
        "source": "T07n0220_512:0616a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以三十七菩提分法為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the thirty-seven factors of enlightenment as their destination, and bodhisattvas, mahāsattvas, cannot go beyond such a destination.",
        "source": "T07n0220_512:0616a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住乃至八聖道支尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The four bases of mindfulness and even the eightfold noble path are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以四靜慮、四無量、四無色定為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the four states of meditation, the four immeasurable, and the four formless concentrations as their destinies, and bodhisattvas, mahāsattvas, cannot go beyond such destinies.",
        "source": "T07n0220_512:0616b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The four meditations, the four immeasurable concentrations, and the four formless concentrations are ultimately nonexistent, so why wouldn't the interesting and non-interesting aspects of them be obtainable?",
        "source": "T07n0220_512:0616b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以八解脫、八勝處、九次第定、十遍處為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things are destined for the eight liberations, eight abodes of excellence, nine graduated concentrations, and ten universal abodes, and bodhisattvas, mahāsattvas, cannot go beyond such destinies.",
        "source": "T07n0220_512:0616b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫、八勝處、九次第定、十遍處尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The eight liberations, eight abodes of excellence, nine graduated concentrations, and ten universal abodes are still ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以三解脫門為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things proceed through the three gates of liberation, and bodhisattvas, mahāsattvas, can't go beyond such a path.",
        "source": "T07n0220_512:0616b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無願解脫門尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The gate of liberation through emptiness, signlessness, and wishlessness is still ultimately nonexistent, so why should it be possible to find interesting and non-interesting things in it?",
        "source": "T07n0220_512:0616b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以三乘十地為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the three vehicles and ten stages as their destinies, and bodhisattvas, mahāsattvas, and bodhisattvas can't go beyond such destinies.",
        "source": "T07n0220_512:0616b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨觀地乃至如來地尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The stage of pure contemplation and even the stage of the Tathāgata are still ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以菩薩十地為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the bodhisattvas' ten stages as their destination, and bodhisattvas, mahāsattvas, can't go beyond such a destination.",
        "source": "T07n0220_512:0616b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地乃至法雲地尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The ground of ultimate bliss and even the ground of the dharma-cloud are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以陀羅尼門、三摩地門為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the dhāraṇī and samādhi approaches as their destination, and bodhisattvas, mahāsattvas, can't go beyond such an approach.",
        "source": "T07n0220_512:0616b20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陀羅尼門、三摩地門尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The dhāraṇī and samādhi aspects are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616b22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以五眼、六神通為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the five eyes and six psychic powers as their goal, and bodhisattvas, mahāsattvas, can't go beyond such a goal.",
        "source": "T07n0220_512:0616b24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼、六神通尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The five eyes and six supernormal powers are ultimately nonexistent, so how could they be interesting and non-interesting?",
        "source": "T07n0220_512:0616b25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616b27_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以如來十力、四無所畏、四無礙解、十八佛不共法為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have as their destination the Tathāgata's ten powers, four forms of fearlessness, four forms of unhindered understanding, and 18 distinctive characteristics of the Buddha, and bodhisattvas, mahāsattvas, cannot go beyond such a destination.",
        "source": "T07n0220_512:0616b27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616b29_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來十力乃至十八佛不共法尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The Tathāgata's ten powers and even the eighteen Buddha-principles are ultimately nonexistent, so why should there be interesting and non-interesting things to attain in them?",
        "source": "T07n0220_512:0616b29_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616c02_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以大慈、大悲、大喜、大捨為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have great kindness, great compassion, great joy, and great equanimity as their goal, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0616c02_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616c04_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大慈、大悲、大喜、大捨尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "Great kindness, great compassion, great joy, and great equanimity are ultimately nonexistent, so why wouldn't they be interesting and non-interesting to attain?",
        "source": "T07n0220_512:0616c04_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616c05_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以三十二相、八十隨好為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have the aim of the thirty-two marks and eighty minor marks, and bodhisattvas, mahāsattvas, cannot go beyond such an aim.",
        "source": "T07n0220_512:0616c05_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616c07_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二相、八十隨好尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The thirty-two marks and eighty minor marks are ultimately nonexistent, let alone the interesting and non-interesting aspects thereof!",
        "source": "T07n0220_512:0616c07_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616c09_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以無忘失法、恒住捨性為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the goal of being the Dharma of no forgetfulness and constant abiding in equanimity, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0616c09_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法、恒住捨性尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The dharma of no forgetfulness and the eternally abiding nature of equanimity are still ultimately nonexistent, so why should they be interesting and non-interesting to attain?",
        "source": "T07n0220_512:0616c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以一切智、道相智、一切相智為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have omniscience, knowledge of the path, and knowledge of all characteristics as their goal, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0616c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "When omniscience, cognition of the path, and cognition of all characteristics are ultimately nonexistent, how much more so when there are interesting and non-interesting things to attain!",
        "source": "T07n0220_512:0616c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以預流果乃至獨覺菩提為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have their destination as the fruit of pre-flow ... solitary realizer bodhi, and bodhisattvas, mahāsattvas, cannot go beyond such a destination.",
        "source": "T07n0220_512:0616c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "預流果乃至獨覺菩提尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The fruit of stream-winner and even the enlightenment of the pratyekabuddhas are ultimately nonexistent, so how could they be interesting and non-interesting?",
        "source": "T07n0220_512:0616c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以一切菩薩摩訶薩行、諸佛無上正等菩提為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All things have as their goal all bodhisattva-mahāsattva practices and the unsurpassed correct enlightenment of the buddhas, and bodhisattvas, mahāsattvas, cannot go beyond such a goal.",
        "source": "T07n0220_512:0616c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩行、諸佛無上正等菩提尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "All bodhisattva-mahāsattva practices and the buddhas' unsurpassed perfect enlightenment are ultimately nonexistent, so why should there be interesting and non-existent paths to attain them?",
        "source": "T07n0220_512:0616c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0616c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆以預流乃至如來為趣，諸菩薩摩訶薩於如是趣不可超越。",
        "translation": "\"All dharmas have the destination of being pre-flowers up to the Tathāgata, and bodhisattvas, mahāsattvas, can't go beyond such an outlet.",
        "source": "T07n0220_512:0616c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0616c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "預流乃至如來尚畢竟無所有，況於其中有趣非趣可得！",
        "translation": "The precursor to the Tathāgata is still ultimately without possession, so why should it be possible to find anything interesting or non-interesting in it?",
        "source": "T07n0220_512:0616c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, well-presented!",
        "source": "T07n0220_512:0616c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩為與世間作所趣故，發趣無上正等菩提。」",
        "translation": "For the sake of making the world their destination, bodhisattvas, mahāsattvas, and bodhisattvas set out for unsurpassed correct perfect enlightenment.\"",
        "source": "T07n0220_512:0616c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「誰能於此甚深般若波羅蜜多深生信解？」",
        "translation": "It was then that the good present again said to the Buddha, \"Who can deeply believe in and understand this profound perfection of wisdom?\"",
        "source": "T07n0220_512:0616c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩久於無上正等菩提，發意趣求精勤修行，已曾供養無量諸佛，於諸佛所發弘誓願，所種善根皆已純熟，無量善友攝受護念，乃能於此甚深般若波羅蜜多深生信解。」",
        "translation": "The Buddha told Śaṃnara, \"Suppose a bodhisattva has long stood for unsurpassed perfect enlightenment, has set his mind on pursuing diligent practice, has made offerings to measureless buddhas, has made a great vow to the buddhas, has purified the good roots he has planted, and has countless good friends to take care of him, then he'll be able to deeply believe in and understand this profound prajñāparamitā.\"",
        "source": "T07n0220_512:0617a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「是菩薩摩訶薩何性？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"What's the nature of this bodhisattva Mahāsattva?",
        "source": "T07n0220_512:0617a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何相？",
        "translation": "What are the characteristics?",
        "source": "T07n0220_512:0617a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何狀？",
        "translation": "what kind?",
        "source": "T07n0220_512:0617a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何貌？",
        "translation": "what appearance?",
        "source": "T07n0220_512:0617a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能深信解如是般若波羅蜜多？」",
        "translation": "Can you deeply believe and understand the perfection of wisdom like this?\"",
        "source": "T07n0220_512:0617a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩以調伏貪、瞋、癡性為性，以遠離貪、瞋、癡相為相，以遠離貪、瞋、癡狀為狀，以遠離貪、瞋、癡貌為貌。",
        "translation": "The Buddha told Shancheng, \"This is a bodhisattva-mahāsattva who takes the nature of disciplining greed, anger, and delusion as its nature, the characteristic of being free of greed, anger, and delusion as its characteristic, the state of being free of greed, anger, and delusion as its state, and the appearance of being free of greed, anger, and delusion as its appearance.",
        "source": "T07n0220_512:0617a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_512:0617a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以調伏貪、瞋、癡及無貪、瞋、癡性為性，以遠離貪、瞋、癡及無貪、瞋、癡相為相，以遠離貪、瞋、癡及無貪、瞋、癡狀為狀，以遠離貪、瞋、癡及無貪、瞋、癡貌為貌。",
        "translation": "\"Such a bodhisattva takes the nature of disciplining greed, anger, and delusion and the lack of greed, anger, and delusion as its nature, the form of being free of greed, anger, delusion, and the lack of greed, anger, and delusion as its form, and the appearance of being free of greed, anger, delusion, and the lack of greed, anger, and delusion as its appearance.",
        "source": "T07n0220_512:0617a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_512:0617a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是性、相、狀、貌，乃能於此甚深般若波羅蜜多深生信解。」",
        "translation": "If a bodhisattva-mahāsattva accomplishes such a nature, characteristics, appearance, and form, then he'll be able to deeply believe in and understand this profound prajñāparamitā.\"",
        "source": "T07n0220_512:0617a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「若菩薩摩訶薩能於如是甚深般若波羅蜜多深信解者，是菩薩摩訶薩當何所趣？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"If a bodhisattva-mahāsattva can deeply believe in and understand such a profound prajñāparamitā, what destination will this bodhisattva-mahāsattva pursue?\"",
        "source": "T07n0220_512:0617a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩當趣一切智智。」",
        "translation": "The Buddha told the Good Present, \"This is the kind of bodhisattva-mahāsattva who will go to the knowledge of all cognitions.\"",
        "source": "T07n0220_512:0617a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「若菩薩摩訶薩趣一切智智者，是菩薩摩訶薩能與一切有情為所歸趣。」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"If the bodhisattva Mahāsattva is headed for omniscience, then this is the bodhisattva Mahāsattva who can give refuge to all sentient beings.\"",
        "source": "T07n0220_512:0617a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śaṅgālī, \"So it is!",
        "source": "T07n0220_512:0617a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_512:0617a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能於如是甚深般若波羅蜜多深生信解，則能趣向一切智智，若能趣向一切智智，是則能與一切有情為所歸趣。」",
        "translation": "If a bodhisattva-mahāsattva can deeply believe in and understand such a profound prajñāpāramitā, then he can aim for the knowledge of all things, and if he can aim for the knowledge of all things, then he can give refuge to all sentient beings.\"",
        "source": "T07n0220_512:0617a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「是菩薩摩訶薩能為難事，謂著如是堅固甲冑：『我當度脫一切有情，皆令證得究竟涅槃。",
        "translation": "Guoshou Shancheng then said to the Buddha, \"This is a difficult thing for a bodhisattva-mahāsattva to do, which is to wear this kind of sturdy armor: 'I will liberate all sentient beings and cause them all to realize ultimate nirvāṇa.'",
        "source": "T07n0220_512:0617a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖於有情作如是事，而都不見有情施設。』」",
        "translation": "Even though it does such things for sentient beings, it doesn't see the definition of sentient beings.'\"",
        "source": "T07n0220_512:0617a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_512:0617a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_512:0617a29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_512:0617a29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_512:0617a29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩所著甲冑，不屬色乃至識。",
        "translation": "\"This is the armor worn by the bodhisattvas, which doesn't belong to form or even consciousness.",
        "source": "T07n0220_512:0617a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0617b01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色乃至識皆畢竟無所有，非菩薩非甲冑故，說彼甲冑不屬色乃至識。",
        "translation": "Since form and even consciousness are ultimately nonexistent, it's not a bodhisattva who isn't wearing armor, so it's said that his armor doesn't belong to form or even consciousness.",
        "source": "T07n0220_512:0617b01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至是菩薩摩訶薩所著甲冑不屬一切智、道相智、一切相智。",
        "translation": "Thus, and indeed, the armor worn by the bodhisattvas and mahāsattvas doesn't belong to omniscience, cognition of the path, or cognition of all characteristics.",
        "source": "T07n0220_512:0617b03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0617b04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智皆畢竟無所有，非菩薩非甲冑故，說彼甲冑不屬一切智、道相智、一切相智。",
        "translation": "Since omniscience, knowledge of the path, and knowledge of all characteristics are ultimately nonexistent, it's not a bodhisattva who doesn't own the armor, so it's said that the armor doesn't belong to omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_512:0617b05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩所著甲冑不屬我乃至見者。",
        "translation": "This is the armor worn by the bodhisattvas, Mahāsattvas, that doesn't belong to me or even to those who see it.",
        "source": "T07n0220_512:0617b07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0617b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者皆畢竟無所有，非菩薩非甲冑故，說彼甲冑不屬我乃至見者。",
        "translation": "\"Neither I nor those who see are ultimately without possessions, and it's because they aren't bodhisattvas and aren't armor that they're said not to belong to me or to those who see.",
        "source": "T07n0220_512:0617b08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩所著甲冑不屬一切法。",
        "translation": "This is the armor worn by the bodhisattvas, which doesn't belong to all dharmas.",
        "source": "T07n0220_512:0617b10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0617b11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法皆畢竟無所有，非菩薩非甲冑故，說彼甲冑不屬一切法。",
        "translation": "All things are ultimately without possession, and since they aren't bodhisattvas and aren't armor, it's said that their armor doesn't belong to all things.",
        "source": "T07n0220_512:0617b11_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_512:0617b12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行如是甚深般若波羅蜜多，能著如是堅固甲冑，謂我當度一切有情，皆令證得究竟涅槃。」",
        "translation": "This is the bodhisattva Mahāsattva who cultivates such profound prajñāpāramitā and can wear such a strong armor that says, 'I will save all sentient beings and cause them all to realize final nirvāṇa.'\"",
        "source": "T07n0220_512:0617b12_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「若菩薩摩訶薩能著如是堅固甲冑，謂我當度一切有情，皆令證得般涅槃者，不墮聲聞及獨覺地。",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Suppose a bodhisattva Mahāsattva can wear such a strong armor as to say that I will save all sentient beings and cause them all to realize parinirvāṇa, and they won't fall into the stages of śrāvakas and pratyekbuddhas.",
        "source": "T07n0220_512:0617b15_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩無處無容墮於聲聞或獨覺地。",
        "translation": "There's nowhere and nowhere that a bodhisattva-mahāsattva can fall into the stage of śrāvaka or pratyekabuddha.",
        "source": "T07n0220_512:0617b18_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0617b19_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不於有情安立分限，而著如是堅固甲冑。」",
        "translation": "This is a bodhisattva-mahāsattva who doesn't establish a limit for sentient beings and wears such a sturdy armor.\"",
        "source": "T07n0220_512:0617b19_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「汝觀何義而作是言：若菩薩摩訶薩能著如是堅固甲冑，不墮聲聞或獨覺地？」",
        "translation": "The Buddha told Śaṇḍinya, \"What do you observe and say, 'Suppose a bodhisattva, a mahāsattva, can wear such a sturdy armor and not fall into the stage of śrāvaka or solitary realizer?'\"",
        "source": "T07n0220_512:0617b20_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現白言：「世尊！",
        "translation": "At that point, the good manifestation said, \"Bhagavān!",
        "source": "T07n0220_512:0617b22_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩非為度脫少分有情而著如是堅固甲冑，亦非為求少分智故而著如是堅固甲冑。",
        "translation": "\"This is a bodhisattva-mahāsattva who doesn't wear such a strong armor for the sake of liberating a few sentient beings, and he doesn't wear such a strong armor for the sake of seeking a little bit of wisdom.",
        "source": "T07n0220_512:0617b23_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0617b25_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩普為濟拔一切有情令般涅槃而著如是堅固甲冑，但為求得一切智智而著如是堅固甲冑，由此因緣不墮聲聞及獨覺地。」",
        "translation": "This is the bodhisattva Mahāsattva who wears such a sturdy armor for the common purpose of liberating all sentient beings from parinirvāṇa but wears such a sturdy armor for the purpose of seeking to attain the wisdom of all knowables, and for this reason doesn't fall into the stages of śrāvaka and pratyekabuddha.\"",
        "source": "T07n0220_512:0617b25_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_512:0617b28_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_512:0617b29_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_512:0617b29_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩普為濟拔一切有情令般涅槃，但為求得一切智智而著如是堅固甲冑，由此因緣不墮聲聞及獨覺地。」",
        "translation": "This is the bodhisattva Mahāsattva who universally aims to rescue all sentient beings and bring about parinirvāṇa but wears such a sturdy armor in order to attain the wisdom of omniscience that he doesn't fall into the stages of śrāvaka and pratyekabuddha because of this cause.\"",
        "source": "T07n0220_512:0617b29_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「如是般若波羅蜜多最為甚深，無能修者、無所修法、亦無修處、亦無由此而得修習。",
        "translation": "It was then that the good manifestation again said to the Buddha, \"Thus, the perfection of wisdom is most profound, and there's no one who can cultivate it, no method to cultivate, no place to cultivate it, and nothing to cultivate from it.",
        "source": "T07n0220_512:0617c03_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0617c05_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非此般若波羅蜜多甚深義中，而有少分實法可得名能修者及所修法、若修習處、若由此修。",
        "translation": "\"It's not this profound meaning of the perfection of wisdom, but there are a few real things that can be called things that can be cultivated, things that are cultivated, and things that are cultivated in this way.",
        "source": "T07n0220_512:0617c05_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_512:0617c07_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若修虛空，是修般若波羅蜜多；若修一切法，是修般若波羅蜜多；若修不實法，是修般若波羅蜜多；若修無所有，是修般若波羅蜜多；若修無攝受，是修般若波羅蜜多；若修除遣法，是修般若波羅蜜多。」",
        "translation": "If you cultivate space, it's cultivating prajñāpāramitā; if you cultivate all things, it's cultivating prajñāpāramitā; if you cultivate insubstantial things, it's cultivating prajñāpāramitā; if you cultivate nothingness, it's cultivating prajñāpāramitā; if you cultivate the lack of taking in, it's cultivating prajñāpāramitā; and if you cultivate the removal of things, it's cultivating prajñāpāramitā.\"",
        "source": "T07n0220_512:0617c08_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「修除遣何法，是修般若波羅蜜多？」",
        "translation": "The Buddha told Śubhavyūha, \"What is the cultivation of prajñāpāramitā that is cultivated by the method of removal?\"",
        "source": "T07n0220_512:0617c12_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「修除遣五蘊，是修般若波羅蜜多；修除遣六內處，是修般若波羅蜜多；修除遣六外處，是修般若波羅蜜多；修除遣六內界，是修般若波羅蜜多；修除遣六外界，是修般若波羅蜜多；修除遣六識界，是修般若波羅蜜多；修除遣六觸，是修般若波羅蜜多；修除遣六受，是修般若波羅蜜多；修除遣六界，是修般若波羅蜜多；修除遣四緣，是修般若波羅蜜多；修除遣十二支緣起，是修般若波羅蜜多；修除遣我乃至見者，是修般若波羅蜜多；修除遣布施波羅蜜多乃至般若波羅蜜多，是修般若波羅蜜多；修除遣內空乃至無性自性空，是修般若波羅蜜多；修除遣真如乃至不思議界，是修般若波羅蜜多；修除遣四聖諦，是修般若波羅蜜多；修除遣四念住乃至八聖道支，是修般若波羅蜜多；修除遣四靜慮、四無量、四無色定，是修般若波羅蜜多；修除遣八解脫、八勝處、九次第定、十遍處，是修般若波羅蜜多；修除遣空、無相、無願解脫門，是修般若波羅蜜多；修除遣淨觀地乃至如來地，是修般若波羅蜜多；修除遣極喜地乃至法雲地，是修般若波羅蜜多；修除遣一切陀羅尼門、三摩地門，是修般若波羅蜜多；修除遣五眼、六神通，是修般若波羅蜜多；修除遣如來十力乃至十八佛不共法，是修般若波羅蜜多；修除遣大慈、大悲、大喜、大捨，是修般若波羅蜜多；修除遣三十二相、八十隨好，是修般若波羅蜜多；修除遣無忘失法、恒住捨性，是修般若波羅蜜多；修除遣預流果乃至獨覺菩提，是修般若波羅蜜多；修除遣一切菩薩摩訶薩行、諸佛無上正等菩提，是修般若波羅蜜多；修除遣一切智、道相智、一切相智，是修般若波羅蜜多。」",
        "translation": "善現答言：「修除遣五蘊，是修般若波羅蜜多；修除遣六內處，是修般若波羅蜜多；修除遣六外處，是修般若波羅蜜多；修除遣六內界，是修般若波羅蜜多；修除遣六外界，是修般若波羅蜜多；修除遣六識界，是修般若波羅蜜多；修除遣六觸，是修般若波羅蜜多；修除遣六受，是修般若波羅蜜多；修除遣六界，是修般若波羅蜜多；修除遣四緣，是修般若波羅蜜多；修除遣十二支緣起，是修般若波羅蜜多；修除遣我乃至見者，是修般若波羅蜜多；修除遣布施波羅蜜多乃至般若波羅蜜多，是修般若波羅蜜多；修除遣內空乃至無性自性空，是修般若波羅蜜多；修除遣真如乃至不思議界，是修般若波羅蜜多；修除遣四聖諦，是修般若波羅蜜多；修除遣四念住乃至八聖道支，是修般若波羅蜜多；修除遣四靜慮、四無量、四無色定，是修般若波羅蜜多；修除遣八解脫、八勝處、九次第定、十遍處，是修般若波羅蜜多；修除遣空、無相、無願解脫門，是修般若波羅蜜多；修除遣淨觀地乃至如來地，是修般若波羅蜜多；修除遣極喜地乃至法雲地，是修般若波羅蜜多；修除遣一切陀羅尼門、三摩地門，是修般若波羅蜜多；修除遣五眼、六神通，是修般若波羅蜜多；修除遣如來十力乃至十八佛不共法，是修般若波羅蜜多；修除遣大慈、大悲、大喜、大捨，是修般若波羅蜜多；修除遣三十二相、八十隨好，是修般若波羅蜜多；修除遣無忘失法、恒住捨性，是修般若波羅蜜多；修除遣預流果乃至獨覺菩提，是修般若波羅蜜多；修除遣一切菩薩摩訶薩行、諸佛無上正等菩提，是修般若波羅蜜多；修除遣一切智、道相智、一切相智，是修般若波羅蜜多。」",
        "source": "T07n0220_512:0617c13_52",
        "is_bad_quality": true
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_512:0618a17_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_512:0618a17_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修除遣色廣說乃至一切相智，是修般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva cultivates the wisdom of expelling form and explaining everything up to the point of all characteristics, this is cultivating the perfection of wisdom.",
        "source": "T07n0220_512:0618a17_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_512:0618a19_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應依如是甚深般若波羅蜜多，驗知不退轉菩薩摩訶薩。",
        "translation": "It's based on this profound prajñā-pāramitā that you should examine the knowledge of a nonretrogressing bodhisattva and mahāsattva.",
        "source": "T07n0220_512:0618a19_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩雖行般若乃至布施波羅蜜多而無執著，當知是為不退轉菩薩摩訶薩，廣說乃至若菩薩摩訶薩雖行一切智、道相智、一切相智而無執著，當知是為不退轉菩薩摩訶薩。",
        "translation": "If a bodhisattva-mahāsattva does not cling to prajñā and even the perfection of generosity despite practicing them, you should know that this is a nonretrogressing bodhisattva-mahāsattva, and it's widely explained that if a bodhisattva-mahāsattva does not cling to omniscience, knowledge of the path, and knowledge of all characteristics despite practicing them, you should know that this is a nonretrogressing bodhisattva-mahāsattva.",
        "source": "T07n0220_512:0618a20_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_512:0618a24_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有不退轉菩薩摩訶薩，行深般若波羅蜜多時，不觀他語及他教勅以為真要，非但信他而有所作，不為貪欲、瞋恚、愚癡、憍慢等過之所雜染，亦不為彼牽引其心。",
        "translation": "\"When there are nonretrogressing bodhisattvas and mahāsattvas who practice the profound perfection of wisdom, they don't examine the words of others and the commands of others as true, don't simply believe in others and do something, and aren't stained by such faults as desire, anger, foolishness, and arrogance, nor do they let them draw their minds away from them.",
        "source": "T07n0220_512:0618a25_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有不退轉菩薩摩訶薩，行深般若波羅蜜多時，不離布施乃至般若波羅蜜多。",
        "translation": "When there are nonretrogressing bodhisattvas and mahāsattvas who practice the profound perfection of wisdom, they don't part with generosity or even the perfection of wisdom.",
        "source": "T07n0220_512:0618a28_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有不退轉菩薩摩訶薩，行深般若波羅蜜多時，聞說如是甚深般若波羅蜜多，其心不驚、不恐、不怖、不沈、不沒，亦不退捨所求無上正等菩提，於深般若波羅蜜多，歡喜樂聞、受持、讀誦、究竟通利、繫念思惟如說修行常無厭倦。",
        "translation": "When there are nonretrogressing bodhisattvas and mahāsattvas who practice the profound prajñāpāramitā, their minds aren't startled, frightened, terrified, sunken, or submerged when they hear and teach such profound prajñpāramitā, and they don't give up their pursuit of unsurpassed correct enlightenment, rejoicing in the profound prajñpāramitā, hearing it joyfully and gladly, retaining it, reciting it, fully penetrating it, fixing their thoughts on it, and cultivating it as it's taught, and never tiring of it.",
        "source": "T07n0220_512:0618b01_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知如是不退轉菩薩摩訶薩，先世已聞甚深般若波羅蜜多所有義趣，受持、讀誦、如理思惟，精進修行心無厭倦。",
        "translation": "You should know that such a nonretrogressing bodhisattva-mahāsattva had heard about the profound perfections of prajñāpāramitā in prior lifetimes, had memorized them, recited them, considered them according to reason, and diligently cultivated them without wearying.",
        "source": "T07n0220_512:0618b06_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0618b09_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此不退轉菩薩摩訶薩，聞說如是甚深般若波羅蜜多，其心不驚、不恐、不怖，廣說乃至如說修行常無厭倦。」",
        "translation": "Thus, when a nonretrogressing bodhisattva-mahāsattva hears and teaches such a profound prajñāpāramitā, his mind isn't frightened, isn't afraid, isn't terrified, and he explains it in detail and cultivates it as explained, always without tire.\"",
        "source": "T07n0220_512:0618b09_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「若菩薩摩訶薩聞說如是甚深般若波羅蜜多，其心不驚、不恐、不怖、不沈、不沒，亦不退捨所求無上正等菩提，於深般若波羅蜜多，歡喜樂聞、受持、讀誦、究竟通利、繫念思惟，如說修行常無厭倦。",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Suppose a bodhisattva Mahāsattva hears such a profound prajñāpāramitā and his mind isn't frightened, doesn't panic, doesn't fear, doesn't sink, doesn't submerge, and doesn't sink, doesn't abandon his pursuit of unsurpassed perfect enlightenment, rejoices in hearing, retaining, reciting, thoroughly penetrating, fixing his attention on, and contemplating the profound prajñāpāramitā as it's taught, and cultivates it without ever tiring of it.",
        "source": "T07n0220_512:0618b12_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩云何修行甚深般若波羅蜜多？」",
        "translation": "How does this bodhisattva Mahāsattva cultivate the profound perfection of wisdom?\"",
        "source": "T07n0220_512:0618b16_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩相續隨順趣向臨入一切智智，應作如是行深般若波羅蜜多。」",
        "translation": "The Buddha told the Good Shepherd, \"Is this the kind of bodhisattva, the Mahāsattva, who continuously follows the path toward the advent of omniscience and should thus practice the profound prajñāparamitā.\"",
        "source": "T07n0220_512:0618b17_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「是菩薩摩訶薩云何相續隨順趣向臨入一切智智，行深般若波羅蜜多？」",
        "translation": "Kauśāmbī also said to the Buddha, \"How does the bodhisattva Mahāsattva continuously and obediently proceed to the advancing wisdom of all knowables and practice profound prajñāparamitā?\"",
        "source": "T07n0220_512:0618b19_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩相續隨順趣向臨入空、無相、無願、虛空、無所有、無生、無滅、無染、無淨、真如乃至不思議界、無造、無作、如夢乃至如尋香城，行深般若波羅蜜多，是為菩薩摩訶薩相續隨順趣向臨入一切智智，行深般若波羅蜜多。」",
        "translation": "The Buddha told Śaṃbhavāsa, \"If the bodhisattva-mahāsattva continuously and accessibly approaches entering emptiness, signlessness, wishlessness, space, nothingness, nonexistence, nonarising, noncessation, undefiledness, nonpurity, true reality, even the inconceivable realm, uncreated, uncreated, uncreated, dreamlike, and even the city of discursive fragrance, and practices the profound perfection of wisdom, this is the bodhisattva-mahāsattva who continuously and accessibly approaches entering omniscience and practices the profound perfection of wisdom.\"",
        "source": "T07n0220_512:0618b22_70",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「如世尊說『若菩薩摩訶薩相續隨順趣向臨入空、無相、無願廣說乃至如尋香城，行深般若波羅蜜多，是為菩薩摩訶薩相續隨順趣向臨入一切智智，行深般若波羅蜜多。』",
        "translation": "Kauśāmbī again said to the Buddha, \"Just as the Bhagavān said, 'If a bodhisattva continues to follow the path toward an entry into emptiness, signlessness, and wishlessness as explained in detail or even as in the city of incense, and practices profound prajñāparamitā, this is a bodhisattva who continues to follow the path toward an entry into omniscience and practices profound prajñāparamitā.'",
        "source": "T07n0220_512:0618b27_71",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，是菩薩摩訶薩行深般若波羅蜜多時，為行五蘊乃至一切相智不？」",
        "translation": "If so, when the bodhisattva Mahāsattva practices profound prajñāpāramitā, is it the practice of the five aggregates and even the cognition of all characteristics?\"",
        "source": "T07n0220_512:0618c02_72",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩不行五蘊乃至一切相智。",
        "translation": "The Buddha told Śubhavyūha, \"This is the bodhisattva Mahāsattva's knowledge of not practicing the five aggregates or even all characteristics.",
        "source": "T07n0220_512:0618c04_73",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0618c05_74",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩所隨順趣向臨入一切智智，無能作者、無能壞者、無所從來、無所至去、亦無所住、無方無域、無數無量、無往無來，既無數量往來可得，亦無能證。",
        "translation": "This is the kind of cognition that the bodhisattvas, mahāsattvas, followers, advance to, and enter, which has no author, nothing to break, nothing to come from, nothing to go to, nothing to stay in, no direction, no area, nothing numerous and immeasurable, nothing going and nothing coming, neither is there a quantity of going and coming to be obtained, and nothing to be realized.",
        "source": "T07n0220_512:0618c05_75",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_512:0618c09_76",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切智智，不可以五蘊證，廣說乃至不可以一切相智證。",
        "translation": "Thus, the knowledge of all knowables can't be realized by the five aggregates, and it's explained in detail up to the realization that it can't be realized by the knowledge of all characteristics.",
        "source": "T07n0220_512:0618c09_77",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0618c10_78",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五蘊即是一切智智，廣說乃至一切相智即是一切智智。",
        "translation": "\"The five aggregates are omniscience, and it's explained in detail up to omniscience, which is omniscience.",
        "source": "T07n0220_512:0618c11_79",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_512:0618c12_80",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五蘊真如，若一切智智真如，若一切法真如，皆一真如無二無別，廣說乃至若一切相智真如，若一切智智真如，若一切法真如，皆一真如無二無別。",
        "translation": "If the true nature of the five aggregates, if the true nature of omniscience cognition, and if the true nature of all things are true, they are all one true nature without duality or distinction, and it's explained in detail up to and including if the true nature of omniscience of all characteristics, if the true nature of omniscience cognition, and if the true nature of all things are true, they are all one true nature without duality or distinction.",
        "source": "T07n0220_512:0618c12_81",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，一切智智不可以五蘊證，廣說乃至不可以一切相智證。」",
        "translation": "Therefore, omniscience can't be realized by knowing the five aggregates, and it's broadly explained that it can't be realized by knowing all characteristics.\"",
        "source": "T07n0220_512:0618c15_82",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一十二",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 512",
        "source": "T07n0220_512:0618c18_0",
        "is_bad_quality": false
    }
]