[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百七",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 507",
        "source": "T07n0220_572:0953a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二",
        "translation": "twelve",
        "source": "T07n0220_572:0953a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_572:0953a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六分顯德品第十一",
        "translation": "Sixth Chapter, Revealing Virtues, Eleventh Chapter",
        "source": "T07n0220_572:0953a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，曼殊室利菩薩摩訶薩從座而起，頂禮佛足，偏覆左肩，右膝著地，合掌恭敬白言：「世尊！",
        "translation": "At that point, Mañjuśrī Bodhisattva Mahāsattva rose from his seat, bowed his head at the Buddha's feet, tilted his left shoulder, knelt on his right knee, put his palms together in respect, and said, \"Bhagavān!",
        "source": "T07n0220_572:0953a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩經幾劫數行深般若波羅蜜多，供養幾佛，而能對揚如來所說甚深般若波羅蜜多如最勝天王者？」",
        "translation": "How many eons have bodhisattvas, mahāsattvas, and buddhas have they practiced the profound perfection of wisdom and made offerings to, and yet they're able to proclaim the profound perfection of wisdom taught by the Tathāgata like the most excellent heavenly kings?\"",
        "source": "T07n0220_572:0953a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩摩訶薩言：「善男子！",
        "translation": "The Buddha addressed Mañjuśrī Bodhisattva Mahāsattva, \"Good sons!",
        "source": "T07n0220_572:0953a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此之事不可思議，若非無量百千大劫修集眾行種諸善根，則不得聞甚深般若波羅蜜多功德名字。",
        "translation": "Such a thing is inconceivable, and unless you cultivate the good roots of many practices over measureless hundreds of thousands of great eons, you wouldn't be able to hear the name of the profound prajñāpāramitā merit.",
        "source": "T07n0220_572:0953a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_572:0953a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方各如殑伽沙界，其中所有諸殑伽沙尚可知數，是菩薩摩訶薩行深般若波羅蜜多，所經劫數、供養幾佛俱不可知。",
        "translation": "Each of the ten directions is like the sands of Gaṅgā, and the number of sands in it can still be known, so it's unknown how many eons a bodhisattva Mahāsattva practices the profound prajñāpāramitā and how many buddhas he makes offerings to.",
        "source": "T07n0220_572:0953a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T07n0220_572:0953a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去無量無數無邊難思議劫，有佛出世名曰多聞，十號具足，劫名增上，國名日光。",
        "translation": "In the past, there was a Buddha who appeared in the world named Tathāgata, was replete with the ten epithets, had an eon named Incremental, and had a country named Nikko.",
        "source": "T07n0220_572:0953a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多聞如來為諸菩薩摩訶薩說清淨法門言：『善男子！",
        "translation": "The well-versed Tathāgata taught the pure Dharma teaching to all the bodhisattvas and mahāsattvas, saying, 'Good sons!",
        "source": "T07n0220_572:0953a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應精勤修諸善法，勿顧身命。』",
        "translation": "You should diligently cultivate good qualities and not concern yourself with your life.'",
        "source": "T07n0220_572:0953a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，彼會中有一菩薩名精進力，即從座起頂禮佛足，偏覆左肩，右膝著地，合掌恭敬而白佛言：『世尊所說：汝應精勤修諸善法，勿顧身命。",
        "translation": "\"At the time, a bodhisattva in that assembly named Vigorous Power rose from his seat, bowed his head at the Buddha's feet, tilted his left shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, 'The Bhagavān says, 'You should diligently cultivate good qualities and not take care of your own life.'",
        "source": "T07n0220_572:0953a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我解佛所說義者，諸菩薩摩訶薩宜應懈怠不修善法，乃能速證無上菩提。",
        "translation": "If I understand what the Buddha has said, it's appropriate for bodhisattvas and mahāsattvas to be lazy and not cultivate good qualities, so that they can quickly realize unsurpassed enlightenment.",
        "source": "T07n0220_572:0953a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0953a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩勤修眾善，是則不能久住生死利樂有情；然諸菩薩行深般若波羅蜜多，伏斷煩惱久住生死，終不自為速證涅槃，但為利樂諸有情故。",
        "translation": "If bodhisattvas diligently cultivate many good qualities, they won't be able to abide in birth-and-death for the benefit and welfare of sentient beings for long; yet bodhisattvas who practice the profound perfection of wisdom and subdue afflictions and abide in birth-and-death for a long time never achieve nirvāṇa quickly for their own sake, but only for the benefit and welfare of sentient beings.",
        "source": "T07n0220_572:0953a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以處生死為樂，不以涅槃而為樂也！",
        "translation": "A bodhisattva takes delight in dealing with birth and death, not in nirvāṇa!",
        "source": "T07n0220_572:0953b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0953b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩以化有情而為樂故。",
        "translation": "\"It's because the bodhisattvas, the mahāsattvas, create sentient beings for their own enjoyment.",
        "source": "T07n0220_572:0953b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂隨所樂方便善巧，說授法門令得安樂；若勤修善便速盡漏，不能利樂一切有情。",
        "translation": "That is, they skillfully teach the Dharma according to what pleases them and teach the Dharma to bring about well-being, and if they diligently cultivate goodness, the contaminants will quickly end, but they won't be able to benefit and delight all sentient beings.",
        "source": "T07n0220_572:0953b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩觀察生死多諸苦惱，起大悲心不捨有情成就本願。",
        "translation": "Therefore, the bodhisattva observes the many sufferings and distress of birth and death and arouses great compassion, not abandoning sentient beings to fulfill his original vow.",
        "source": "T07n0220_572:0953b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T07n0220_572:0953b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩具方便力久住生死，得見無量無邊如來，聽受無量無邊正法，化導無量無邊有情，是故菩薩為如是事不厭生死、不樂涅槃。",
        "translation": "Because bodhisattvas and mahāsattvas possess the power of skillful means to abide long in birth-and-death, see measureless and limitless tathāgatas, hear and accept measureless and limitless right teachings, and guide measureless and limitless sentient beings, bodhisattvas don't tire of birth-and-death and don't enjoy nirvāṇa for such things.",
        "source": "T07n0220_572:0953b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0953b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩若觀生死而起厭怖、欣樂涅槃則墮非道，不能利樂一切有情，通達如來甚深境界。",
        "translation": "If bodhisattvas, mahāsattvas, become disillusioned with observing birth and death and rejoice in nirvāṇa, then they fall into a wrong path that doesn't allow them to benefit all sentient beings and penetrate the Tathāgata's profound realm.",
        "source": "T07n0220_572:0953b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非道？",
        "translation": "What's not the path?",
        "source": "T07n0220_572:0953b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂樂聲聞及獨覺地，於有情類無大悲心。",
        "translation": "It's called the stage of the happy śrāvakas and solitary realizers who have no great compassion for sentient beings.",
        "source": "T07n0220_572:0953b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0953b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺所行之道，非諸菩薩摩訶薩道。",
        "translation": "The path practiced by direct disciples and solitary realizers is not the path of the bodhisattvas and mahāsattvas.",
        "source": "T07n0220_572:0953b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0953b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺厭怖生死、欣樂涅槃，不能具足福德智慧，以是義故非菩薩道。』",
        "translation": "śrāvakas and solitary realizers who are disillusioned with birth and death and delight in nirvāṇa aren't able to possess merit and wisdom; therefore, this is not the bodhisattva path.'",
        "source": "T07n0220_572:0953b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，多聞佛即便讚歎精進力言：『善哉！",
        "translation": "\"Even then, the well-versed Buddha praised the power of that effort, saying, 'Good!",
        "source": "T07n0220_572:0953b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_572:0953b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_572:0953b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩應修自行，勿習非道。』",
        "translation": "All bodhisattvas and mahāsattvas should cultivate what's self-imposed and not cultivate what's not the path.'",
        "source": "T07n0220_572:0953b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，精進力白言：『世尊！",
        "translation": "\"Then, the power of effort said, 'Bhagavān!",
        "source": "T07n0220_572:0953b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩自所行道？』",
        "translation": "What is meant by a bodhisattva's own practice?'",
        "source": "T07n0220_572:0953b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「多聞佛言：『菩薩成就一切福慧，以大悲力不捨有情，遠離聲聞及獨覺地，得無生忍不捨三界，無所希望生長善根，方便善巧修行一切波羅蜜多，以智慧力無分別心生長善根，成就盡智無量功德；雖知諸法無一可生，而方便現生；雖知有情無一實有，而方便化導，知一切法皆離自性；觀諸佛土猶如虛空，而能巧便嚴淨佛土；知一切佛法身無像，方便示現相好莊嚴；隨諸有情心所好樂，即能方便而授與之。",
        "translation": "「多聞佛言：『菩薩成就一切福慧，以大悲力不捨有情，遠離聲聞及獨覺地，得無生忍不捨三界，無所希望生長善根，方便善巧修行一切波羅蜜多，以智慧力無分別心生長善根，成就盡智無量功德；雖知諸法無一可生，而方便現生；雖知有情無一實有，而方便化導，知一切法皆離自性；觀諸佛土猶如虛空，而能巧便嚴淨佛土；知一切佛法身無像，方便示現相好莊嚴；隨諸有情心所好樂，即能方便而授與之。",
        "source": "T07n0220_572:0953b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩身心雖常寂靜，而說諸法化導有情，亦以巧便遠離喧雜，修諸寂定知自性空，悉能通達甚深智慧，能以方便為他說法，不證聲聞、獨覺乘果，勤求如來所證解脫，不捨菩薩一切道行。",
        "translation": "Although the bodhisattva's body and mind are always still, he explains the teachings to guide sentient beings, avoids clamor and chaos with skillful means, cultivates tranquil concentration and knowledge of the emptiness of his own nature, fully comprehends profound wisdom, teaches others with skillful means, doesn't realize the fruit of the vehicle of direct disciples and solitary realizers, diligently seeks the liberation realized by the Tathāgata, and doesn't abandon all of the bodhisattva's path practices.",
        "source": "T07n0220_572:0953c01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_572:0953c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩自所行道。』",
        "translation": "This is called the path that bodhisattvas themselves follow.'",
        "source": "T07n0220_572:0953c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "\"Mañjuśrī!",
        "source": "T07n0220_572:0953c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，精進力從彼如來聞說菩薩所行境界，得未曾有，尋即復白多聞佛言：『希有！",
        "translation": "When the power of zeal heard from that Tathāgata about the unprecedented state of the bodhisattva's practices, he then replied to the well-versed Buddha, saying, 'Rare!",
        "source": "T07n0220_572:0953c06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0953c08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我解佛所說義者，菩薩具足方便善巧，觀一切法無非是道。",
        "translation": "\"As I understand the Buddha's teaching, a bodhisattva is fully equipped with skillful means and observes that all things are nothing but paths.",
        "source": "T07n0220_572:0953c08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空含容眾色，如是菩薩具大方便，所行之道攝一切法。",
        "translation": "Like space containing all kinds of form, such a bodhisattva is endowed with great skillful means, and the path that he practices includes all dharmas.",
        "source": "T07n0220_572:0953c09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如虛空，一切草木、花果、香樹因之生長，如是諸物於虛空界不能染淨、不令瞋喜，如是菩薩具大方便甚深般若波羅蜜多，觀一切法皆悉是道，謂異生法、若聲聞法、若獨覺法、若菩薩法、若如來法。",
        "translation": "Also, like space, where all plants, trees, flowers, and fragrant trees grow because of it, such things in the space realm can't be defiled or made to rejoice, so the bodhisattva is endowed with the profound prajñāpāramitā of great skillful means and observes that all things are nothing but paths, meaning things that are unborn, that are direct disciples, that are solitary realizers, that are bodhisattva qualities, and that are tathāgata qualities.",
        "source": "T07n0220_572:0953c11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0953c15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩所通達故。",
        "translation": "\"It's because it's comprehended by bodhisattvas.",
        "source": "T07n0220_572:0953c15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『譬如大火若遇草木必無退還，是諸草木皆順益火發其光明，如是諸法無不皆順菩薩道，故名菩薩道。",
        "translation": "\"'It's like a great fire that meets grass and trees that never retreats, and those grasses and trees all respond to the fire by emitting their light; thus, all things conform to the bodhisattva path, which is why they're called the bodhisattva path.",
        "source": "T07n0220_572:0953c16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如金剛自體堅密，刀不能斫，火不能燒，水不能爛，毒不能損，如是菩薩方便智慧，獨覺、聲聞及諸外道一切煩惱所不能壞。",
        "translation": "Like the adamantine body that's so strong and dense it can't be chopped by a sword, burned by fire, rotted by water, or damaged by poison, such is the bodhisattva's skillful wisdom that solitary realizers, śrāvakas, and non-Buddhists can't destroy all their afflictions.",
        "source": "T07n0220_572:0953c18_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如水清珠能清濁水，如是菩薩甚深般若波羅蜜多，能使有情一切煩惱悉得清淨。",
        "translation": "Like a crystal pearl that cleanses turbid water, the bodhisattva's profound prajñāpāramitā can purify all the afflictions of sentient beings.",
        "source": "T07n0220_572:0953c21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如良藥、妙寶神珠，毒不共居能消眾毒，如是菩薩行深般若波羅蜜多方便善巧，不與一切煩惱共居，而能斷滅一切煩惱。",
        "translation": "Like a good medicine or a marvelously precious pearl that doesn't live with poison and can remove all poison, thus the bodhisattva practices the profound prajñāpāramitā with skillful means, doesn't live with all the afflictions, and is able to end all of them.",
        "source": "T07n0220_572:0953c23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，所有諸法皆是菩薩摩訶薩道。』",
        "translation": "Because of this, all things are the bodhisattva-mahāsattva path.'",
        "source": "T07n0220_572:0953c26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "\"Mañjuśrī!",
        "source": "T07n0220_572:0953c27_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼精進力說是法時，八千菩薩俱發無上正等覺心，二百菩薩得無生忍。",
        "translation": "When he spoke this teaching with the power of effort, 8,000 bodhisattvas all aroused the mind of unsurpassed perfect enlightenment, and 200 bodhisattvas attained the acceptance of nonarising.",
        "source": "T07n0220_572:0953c27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_572:0953c29_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼精進力即是今者最勝天王。」",
        "translation": "The power of their zeal is now the most excellent heavenly king.\"",
        "source": "T07n0220_572:0953c29_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，曼殊室利菩薩復白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī again said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_572:0954a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何諸菩薩摩訶薩行深般若波羅蜜多，得堅固力護持正法？」",
        "translation": "How do bodhisattvas and mahāsattvas practice the profound prajñāpāramitā and attain the strength to firmly uphold the true teaching?\"",
        "source": "T07n0220_572:0954a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩言：「善男子！",
        "translation": "The Buddha addressed Mañjuśrī Bodhisattva, \"Good sons!",
        "source": "T07n0220_572:0954a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩寧棄身命不捨正法，於他謙下不起憍慢，卑賤恥辱其心能忍，飢渴有情施好飲食，在危難者能施無畏，於諸疾病如法療治，貧匱有情令豐財寶，諸佛靈廟修建嚴飾，惡事掩遏善事光揚，憂苦有情則施安樂，是菩薩摩訶薩行深般若波羅蜜多，得堅固力護持正法。」",
        "translation": "If a bodhisattva-mahāsattva would rather give up his life than abandon the right teaching, doesn't humble himself and become proud of others, tolerates humility and shame, gives good food and drink to hungry and thirsty beings, bestows fearlessness on those in danger, treats illnesses according to the Dharma, makes poor beings rich in riches, builds and adorns the temples of the buddhas, conceals bad deeds and shines brightly with good deeds, and gives comfort to those who are miserable, this is a bodhisattva-mahāsattva who practices the profound perfection of wisdom and attains the strength to resolutely guard the right teaching.\"",
        "source": "T07n0220_572:0954a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利復白佛言：「世尊！",
        "translation": "Again, Mañjuśrī said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_572:0954a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何諸菩薩摩訶薩行深般若波羅蜜多能調伏心？」",
        "translation": "How can bodhisattvas and mahāsattvas practice the profound perfection of wisdom to tame the mind?\"",
        "source": "T07n0220_572:0954a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩言：「善男子！",
        "translation": "The Buddha addressed Mañjuśrī Bodhisattva, \"Good sons!",
        "source": "T07n0220_572:0954a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行深般若波羅蜜多，不預他事先思後行，心性調直離諂曲行，不自矜高意常柔軟，是菩薩摩訶薩能調伏心。」",
        "translation": "If a bodhisattva-mahāsattva practices the profound perfection of wisdom, doesn't anticipate the prior actions of others, is straightforward in nature and free of flattery, and doesn't hold themselves in high regard and are always gentle in their intentions, this is a bodhisattva-mahāsattva who is capable of disciplining the mind.\"",
        "source": "T07n0220_572:0954a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利復白佛言：「若菩薩摩訶薩行深般若波羅蜜多能調伏心，當生何趣？」",
        "translation": "Again, Mañjuśrī said to the Buddha, \"If the bodhisattva Mahāsattva practices the profound prajñāpāramitā and is able to tame the mind, what destiny will he be born in?\"",
        "source": "T07n0220_572:0954a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩言：「善男子！",
        "translation": "The Buddha addressed Mañjuśrī Bodhisattva, \"Good sons!",
        "source": "T07n0220_572:0954a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行深般若波羅蜜多能調伏心，或生天上，或生人中；若生天上，則為帝釋，或作梵王堪忍界主；若生人趣，作轉輪王，或作餘王、長者、居士。",
        "translation": "If a bodhisattva practicing the profound prajñāpāramitā is able to control his mind, he might be born in heaven or among humans; if he's born in heaven, he might become an emperor, or he might become the king of Brahmā and the lord of the forbearance realm; if he's born in a human rebirth, he might become a wheel-turning king, or he might become another king, elder, or householder.",
        "source": "T07n0220_572:0954a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天上、人中常得值佛，是菩薩摩訶薩行深般若波羅蜜多能調伏心，生如是趣。」",
        "translation": "To always attain Buddhahood up in heaven or among humans is for a bodhisattva practicing the profound prajñāpāramitā to tame the mind and give rise to such an existence.\"",
        "source": "T07n0220_572:0954a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利復白佛言：「世尊！",
        "translation": "Mañjuśrī then said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_572:0954a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正信流出何法？」",
        "translation": "What dharmas flow from correct faith?\"",
        "source": "T07n0220_572:0954a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩：「正信流出得真善友。」",
        "translation": "The Buddha told Mañjuśrī Bodhisattva, \"Correct faith flows out to attain true good friends.\"",
        "source": "T07n0220_572:0954a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多聞流出何法？」",
        "translation": "What dharmas do you hear a lot about?\"",
        "source": "T07n0220_572:0954a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「多聞流出妙慧。」",
        "translation": "The Buddha said, \"Much learning flows from marvelous wisdom.\"",
        "source": "T07n0220_572:0954a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施流出何法？」",
        "translation": "What dharmas flow from generosity?\"",
        "source": "T07n0220_572:0954a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「布施流出大富。」",
        "translation": "The Buddha said, \"Giving flows out of great wealth.\"",
        "source": "T07n0220_572:0954a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨戒流出何法？」",
        "translation": "What dharmas flow from the pure precepts?\"",
        "source": "T07n0220_572:0954a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「淨戒流出善趣。」",
        "translation": "The Buddha said, \"Pure precepts flow out of a good destiny.\"",
        "source": "T07n0220_572:0954a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安忍流出何法？」",
        "translation": "What dharma flows from patience?\"",
        "source": "T07n0220_572:0954a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「安忍流出容受一切有情。」",
        "translation": "The Buddha said, \"Tolerance flows out of acceptance of all sentient beings.\"",
        "source": "T07n0220_572:0954a29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精進流出何法？」",
        "translation": "What dharma flows from effort?\"",
        "source": "T07n0220_572:0954b01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「精進流出能辦一切佛法。」",
        "translation": "The Buddha said, \"Effort flows from the ability to carry out all the Buddha's teachings.\"",
        "source": "T07n0220_572:0954b01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "靜慮流出何法？」",
        "translation": "What do the teachings flow from meditation?\"",
        "source": "T07n0220_572:0954b02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「靜慮流出遠離一切散動。」",
        "translation": "The Buddha said, \"Meditation flows out free of all distractions.\"",
        "source": "T07n0220_572:0954b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若流出何法？」",
        "translation": "What dharma does Prajñā flow from?\"",
        "source": "T07n0220_572:0954b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「般若流出遠離一切煩惱。」",
        "translation": "The Buddha said, \"Prajñā flows out and secludes himself from all afflictions.\"",
        "source": "T07n0220_572:0954b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽法流出何法？」",
        "translation": "What teaching flows from listening to the teaching?\"",
        "source": "T07n0220_572:0954b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽法流出遠離一切疑網。」",
        "translation": "The Buddha said, \"Listen to the flow of the teaching and be free of all webs of doubt.\"",
        "source": "T07n0220_572:0954b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正問流出何法？」",
        "translation": "What is the outflow of the teaching,\" he correctly asked.",
        "source": "T07n0220_572:0954b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「正問流出於法決定妙智。」",
        "translation": "The Buddha said, \"The correct question flows from the wondrous wisdom of determining the Dharma.\"",
        "source": "T07n0220_572:0954b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居靜流出何法？」",
        "translation": "What dharma flows from abiding in quiescence?\"",
        "source": "T07n0220_572:0954b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「居靜流出勝定及諸神通。」",
        "translation": "The Buddha said, \"Staying in quiescence flows out of excellent concentration and the supernormal powers.\"",
        "source": "T07n0220_572:0954b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正修流出何法？」",
        "translation": "What dharma is flowing from correct cultivation?\"",
        "source": "T07n0220_572:0954b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「正修流出厭道。」",
        "translation": "The Buddha said, \"Correctly cultivate the loathsome path of outflow.\"",
        "source": "T07n0220_572:0954b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無常聲流出何法？」",
        "translation": "What dharmas flow from the sound of impermanence?\"",
        "source": "T07n0220_572:0954b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「無常聲流出於境無所攝護。」",
        "translation": "The Buddha said, \"Impermanent sounds flow out of objects that have no protection.\"",
        "source": "T07n0220_572:0954b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聲流出何法？」",
        "translation": "What dharma does the sound of suffering emanate from?\"",
        "source": "T07n0220_572:0954b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「苦聲流出無生。」",
        "translation": "The Buddha said, \"The sound of suffering flows out of nonarising.\"",
        "source": "T07n0220_572:0954b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無我聲流出何法？」",
        "translation": "What dharmas flow from the sound of no-self?\"",
        "source": "T07n0220_572:0954b11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「無我聲流出滅除我、我所執。」",
        "translation": "The Buddha said, \"The sound of selflessness flows out of the cessation of attachment to self and what belongs to self.\"",
        "source": "T07n0220_572:0954b12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空聲流出何法？」",
        "translation": "What dharma flows from the sound of emptiness?\"",
        "source": "T07n0220_572:0954b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「空聲流出寂靜。」",
        "translation": "The Buddha said, \"The sound of emptiness flows out of quiescence.\"",
        "source": "T07n0220_572:0954b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正念流出何法？」",
        "translation": "What dharmas flow from right mindfulness?\"",
        "source": "T07n0220_572:0954b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「正念流出聖見。」",
        "translation": "The Buddha said, \"Right mindfulness flows from holy views.\"",
        "source": "T07n0220_572:0954b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身心遠離流出何法？」",
        "translation": "What dharmas flow from the distancing of body and mind?\"",
        "source": "T07n0220_572:0954b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「身心遠離流出一切妙定神通。」",
        "translation": "The Buddha said, \"Body and mind are free from the outflow of all the marvelous concentrations and supernormal powers.\"",
        "source": "T07n0220_572:0954b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖道流出何法？」",
        "translation": "What dharmas flow from the holy path?\"",
        "source": "T07n0220_572:0954b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聖道流出聖果。」",
        "translation": "The Buddha said, \"The noble path flows from the noble fruit.\"",
        "source": "T07n0220_572:0954b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝解流出何法？」",
        "translation": "What dharma flows from a superior understanding?\"",
        "source": "T07n0220_572:0954b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「勝解流出成就一切解脫。」",
        "translation": "The Buddha said, \"Resplendent understanding flows out to accomplish all kinds of liberation.\"",
        "source": "T07n0220_572:0954b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛生流出何法？」",
        "translation": "What is the outflow of the Buddha's birth?\"",
        "source": "T07n0220_572:0954b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「佛生流出一切菩提分法。」",
        "translation": "The Buddha said, \"The birth of a Buddha flows out of all the factors of enlightenment.\"",
        "source": "T07n0220_572:0954b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，最勝前白佛言：「云何佛生？」",
        "translation": "At that point, the most excellent one went forward and said to the Buddha, \"What is the birth of a Buddha?\"",
        "source": "T07n0220_572:0954b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告最勝：「如發無上正等覺心。」",
        "translation": "The Buddha told Bhadrapāla, \"Suppose he arouses the mind of unsurpassed correct enlightenment.\"",
        "source": "T07n0220_572:0954b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何而發無上正等覺心？」",
        "translation": "How is the mind of unsurpassed perfect enlightenment aroused?\"",
        "source": "T07n0220_572:0954b21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「天王！",
        "translation": "The Buddha said, \"King of the gods!",
        "source": "T07n0220_572:0954b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如生大悲。」",
        "translation": "Thus is born great compassion.\"",
        "source": "T07n0220_572:0954b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何而生大悲？」",
        "translation": "How will great compassion arise?\"",
        "source": "T07n0220_572:0954b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不捨一切有情。」",
        "translation": "The Buddha said, \"Don't let go of all sentient beings.\"",
        "source": "T07n0220_572:0954b22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不捨有情？」",
        "translation": "Why don't you abandon sentient beings?\"",
        "source": "T07n0220_572:0954b23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應如不捨三寶。」",
        "translation": "The Buddha said, \"It's like not abandoning the Three Treasures.\"",
        "source": "T07n0220_572:0954b23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能不捨三寶？」",
        "translation": "Who can help but abandon the Three Treasures?\"",
        "source": "T07n0220_572:0954b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「一切無煩惱者。」",
        "translation": "The Buddha said, \"All are without affliction.\"",
        "source": "T07n0220_572:0954b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，最勝便白佛言：「甚奇！",
        "translation": "The most excellent then said to the Buddha, \"How marvelous!",
        "source": "T07n0220_572:0954b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0954b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有！",
        "translation": "I wish I had!",
        "source": "T07n0220_572:0954b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well gone!",
        "source": "T07n0220_572:0954b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛祕密甚深微妙，雖說法空、無生、無滅、本來寂靜，而不破壞善惡業果，遠離斷常。",
        "translation": "The secrets of the buddhas are so profound and subtle that even though they teach that things are empty, unarisen, unceasing, and originally quiescent, they don't destroy the results of good and bad actions and distance themselves from cessation and permanence.",
        "source": "T07n0220_572:0954b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0954b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗有有情聞如是法，不起敬信、生毀謗不？」",
        "translation": "Could it be that there are sentient beings who hear such a teaching and don't become devoted to it, or do they denigrate it?\"",
        "source": "T07n0220_572:0954b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「亦有。」",
        "translation": "The Buddha said, \"There's also that.\"",
        "source": "T07n0220_572:0954b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_572:0954b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是有情因過去世修行善業得受人身，由近惡友於是深法不能敬信、生毀謗心，則為辜負過去善業。",
        "translation": "Thus, when a person attains personal possession as a result of cultivating good actions in a past life and becomes close to a bad friend who doesn't respect and believe in this profound teaching and becomes disparaging, they're failing in their past good actions.",
        "source": "T07n0220_572:0954b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛恩德實為深重，假使有人以己肉血，供養諸佛亦不能報。",
        "translation": "The merits of the buddhas are so profound that even if someone were to offer up their own flesh and blood to the buddhas, it wouldn't be enough to repay them.",
        "source": "T07n0220_572:0954c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以佛恩故，我等今者增長善根，得大法樂，住大自在，天、人恭敬。",
        "translation": "Because of the Buddha's kindness, we've grown good roots, attained great happiness in the Dharma, abide with great freedom, and are respected by gods and humans.",
        "source": "T07n0220_572:0954c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0954c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，應知佛恩，親近善友，當修佛行證佛菩提。」",
        "translation": "All bodhisattvas and mahāsattvas who practice the profound perfection of wisdom should know the Buddha's kindness and become intimate with good friends who will cultivate Buddha practices and realize Buddha's enlightenment.\"",
        "source": "T07n0220_572:0954c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是法時，眾中二萬五千菩薩得無生忍，四萬五千諸人、天眾俱發無上正等覺心，一萬二千諸天子眾遠塵離垢生淨法眼。",
        "translation": "When this teaching was given, 25,000 bodhisattvas in the assembly attained the patient acceptance of nonproduction, 45,000 humans and gods all aroused the mind of unsurpassed perfect enlightenment, and 12,000 sons of gods became dustless and spotless and developed the pure Dharma eye.",
        "source": "T07n0220_572:0954c07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六分現化品第十二",
        "translation": "The Sixth Part of the Chapter on Manifestation (12)",
        "source": "T07n0220_572:0954c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善思菩薩白最勝天王言：「佛所化身更能化不？」",
        "translation": "It was then that the Bodhisattva Shansi said to the most excellent heavenly king, \"Can the body that the Buddha has transformed be transformed?\"",
        "source": "T07n0220_572:0954c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝答曰：「今對世尊以為明證，佛所化身更能化作殑伽沙數無量化佛，種種色像、神通、說法利樂有情。",
        "translation": "The Bhagavān answered, \"The Bhagavān now clearly demonstrates that the Buddha's transformation body can transform into the sands of sands of uncountable buddhas with various forms, images, and powers that teach the Dharma for the benefit and joy of sentient beings.",
        "source": "T07n0220_572:0954c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0954c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛往昔願力清淨故能如是。」",
        "translation": "It's because the power of the buddhas' past vows was purified that they could do this.\"",
        "source": "T07n0220_572:0954c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思菩薩復作是言：「天王善能說甚深法，謂佛往昔願力清淨。",
        "translation": "Again, Śaṇḍi Bodhisattva said, \"The god king is well able to explain the profound teaching that the power of the Buddha's past vows was purified.",
        "source": "T07n0220_572:0954c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願天王請佛神力，令深般若波羅蜜多久住世間常無隱滅。」",
        "translation": "May the god king invoke the Buddha's spiritual power to cause profound prajñāpāramit to abide in the world for a long time without ever being withdrawn.\"",
        "source": "T07n0220_572:0954c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝報曰：「善思當知！",
        "translation": "The most excellent reward was, \"Well-considered, you should know!",
        "source": "T07n0220_572:0954c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多一切如來常共守護。",
        "translation": "\"The profound prajñāpāramitā is always guarded by all the tathāgatas together.",
        "source": "T07n0220_572:0954c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0954c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文字宣說甚深般若波羅蜜多，如是文字不起、不盡，常無隱滅，其所顯義亦不起盡，常無隱滅，由此諸佛甚深般若波羅蜜多亦無隱滅。",
        "translation": "When words proclaim the profound prajñāpāramitā, such words don't arise and don't end, and they never cease, and the meanings they reveal don't arise and don't end, and they never cease, so the profound prajñāpāramitā of the buddhas doesn't cease either.",
        "source": "T07n0220_572:0954c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0954c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法不生故。",
        "translation": "\"It's because dharmas don't arise.",
        "source": "T07n0220_572:0954c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法無生亦則無滅，即是諸佛祕密之教；如是妙理，如來出世若不出世性相湛然，名曰真如，亦名法界，亦名實際。",
        "translation": "If things aren't produced, then they don't cease, which is the secret teaching of the buddhas; thus, the marvelous principle that the Tathāgata's nature and characteristics are perfectly clear whether he appears or doesn't appear in the world is called true thusness, which is also called the Dharma realm and is also called reality.",
        "source": "T07n0220_572:0954c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨順因緣而不違逆，是為正法，其性常住永無隱滅。」",
        "translation": "To follow causes and conditions and not disobey them is the right teaching, which is eternally abiding and never goes away.\"",
        "source": "T07n0220_572:0954c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思菩薩復問天王：「更何等人能護正法？」",
        "translation": "Again, Śaṇṇḍa asked the god king, \"Who else can protect the right teaching?\"",
        "source": "T07n0220_572:0954c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝答言：「若不違逆一切法者能護正法。",
        "translation": "The Vairocana replied, \"If someone doesn't disobey all the teachings, they'll be able to protect the right teaching.",
        "source": "T07n0220_572:0954c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0955a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不違正理，常無諍論名護正法。」",
        "translation": "Not contradicting the right principle and always free from argument is called safeguarding the right Dharma.\"",
        "source": "T07n0220_572:0955a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思復問：「云何名為不違正理，常無諍論名護正法？」",
        "translation": "Again, Shansi asked, \"What is the name that doesn't contradict the right principles and is always free of debate, which is to protect the right Dharma?\"",
        "source": "T07n0220_572:0955a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝答曰：「若順文字不違正理，常無諍論名護正法。",
        "translation": "The Vaiśeṣika replied, \"If you follow the words and don't contradict the right principles, always avoiding debate is called protecting the right Dharma.",
        "source": "T07n0220_572:0955a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0955a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間愚夫皆著諸見，順正理者則常說空，是故世間共興諍論，如是愚夫愛重有法，順正理者於有則輕。",
        "translation": "Fools in the world are attached to views, but those who follow the right principle always speak of emptiness; therefore, the world shares in the debate.",
        "source": "T07n0220_572:0955a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間說有常、樂、我、淨，順正理者說無常、苦、無我、不淨，是故世間共興諍論；諸愚夫類順世間流，順正理者逆世間流，是故世間共興諍論。",
        "translation": "The world teaches that there's permanence, happiness, self, and purity, while those who follow the right principle teach impermanence, suffering, selflessness, and impurity, and therefore the world shares in the debate; foolish people follow the worldly flow, while those who follow the right principle oppose the worldly flow, and therefore the world shares in the debate.",
        "source": "T07n0220_572:0955a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間愚夫著蘊、界、處，順正理者都無所著，是故世間共興諍論；順世愚夫不行正理，順正理者與世相違，故常無諍名護正法。」",
        "translation": "Worldly foolish people are attached to aggregates, elements, and fields, but those who conform to the right principle are not attached to anything, and therefore the world shares in the debate; worldly foolish people who conform to the right principle don't apply the right principle, and those who conform to the right principle are at odds with the world, so they are always without dispute and are called guardians of the right Dharma.\"",
        "source": "T07n0220_572:0955a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思菩薩復問最勝：「今者天王為何所取？」",
        "translation": "Again, Śaṇḍi asked Bhadrapāla, \"Why did the king of gods take this?\"",
        "source": "T07n0220_572:0955a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝答曰：「善思當知！",
        "translation": "Cūḷapanthaka replied, \"Well-considered, you should know!",
        "source": "T07n0220_572:0955a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不取我亦不取法。」",
        "translation": "I don't grasp the self, and I don't grasp the Dharma.\"",
        "source": "T07n0220_572:0955a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思又問：「云何不取？」",
        "translation": "Again, Shansi asked, \"How come I don't grasp it?\"",
        "source": "T07n0220_572:0955a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝答言：「我自性離，有情及法自性亦離，如是諸離亦不可得；過去自性離，未來、現在自性亦離，如是諸離亦不可得；諸佛自性非離，諸佛自性非不離；諸佛土自性非離，諸佛土自性非不離；諸法自性非離，諸法自性非不離。",
        "translation": "The most excellent answer was, \"My own nature is free, and the own-natures of sentient beings and dharmas are also free, and such freeing is also unobtainable; the own-natures of past and future and present are also free, and such freeing is also unobtainable; the own-natures of buddhas are not free, and the own-natures of buddhas are not free; the own-natures of buddha-lands are not free, and the own-natures of buddha-lands are not free; the own-natures of dharmas are not free, and the own-natures of dharmas are not free.",
        "source": "T07n0220_572:0955a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思當知！",
        "translation": "Consider it well and know it!",
        "source": "T07n0220_572:0955a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之行名順正理，無取、不取能護正法。」",
        "translation": "Such conduct is called following the right principle, and the absence of grasping and non-grasping protects the right teaching.\"",
        "source": "T07n0220_572:0955a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善思菩薩讚最勝天王言：「善哉！",
        "translation": "It was then that the Bodhisattva Śaṇḍī praised the most excellent heavenly king, saying, \"Good!",
        "source": "T07n0220_572:0955a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_572:0955a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大士！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_572:0955a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正士！",
        "translation": "A true man!",
        "source": "T07n0220_572:0955a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能如是說甚深般若波羅蜜多，無取、無著、無文、無字，滅諸戲論，離能分別及所分別。」",
        "translation": "He thus explains the profound perfection of wisdom, which is without grasping, without attachment, without words, without text, and without characters, which ceases all conceptual elaborations and is free of discrimination and that which is discriminated.\"",
        "source": "T07n0220_572:0955a22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾中有一天子名曰賢德，從座而起頂禮佛足，偏覆左肩，右膝著地，合掌恭敬而白佛言：「世尊！",
        "translation": "At the time, a celestial named Bhadrapāla rose from his seat and bowed his head at the Buddha's feet, tilted his left shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_572:0955a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝天王所說無分別者為是何法？」",
        "translation": "What is this teaching from the king of the most excellent gods that has no distinctions?\"",
        "source": "T07n0220_572:0955a26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告賢德：「天子當知！",
        "translation": "The Buddha told Bhadrika, \"You must know, O celestial!",
        "source": "T07n0220_572:0955a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無分別者是寂靜法。",
        "translation": "\"That which has no discrimination is the law of quiescence.",
        "source": "T07n0220_572:0955a27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0955a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能取、所取俱不可得，不生、不滅、離我、我所，如是名為無分別法。",
        "translation": "The grasper and the grasped are both unobtainable, not arising or ceasing, and free of self and what belongs to self, and this is called a nondiscriminating dharma.",
        "source": "T07n0220_572:0955a28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩如是觀者能護正法，不見能護及所護法。」",
        "translation": "If a bodhisattva-mahāsattva thus observes this, he'll be able to protect the right Dharma and won't see the Dharma that he can protect or that he protects.\"",
        "source": "T07n0220_572:0955b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此法時，十千苾芻心得解脫，一千天子遠塵離垢生淨法眼。",
        "translation": "When this teaching was given, 10,000 monks attained liberation, and 1,000 celestials became dustless and spotless and gave rise to the pure Dharma eye.",
        "source": "T07n0220_572:0955b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善思菩薩問最勝天王言：「何等辯才能說如是甚深之法？」",
        "translation": "It was then that the well-contemplated bodhisattva asked the most excellent celestial king, \"What kind of eloquence is required to teach such a profound Dharma?\"",
        "source": "T07n0220_572:0955b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝答言：「一切煩惱習氣無者所得辯才，能說如是甚深之法；過語言道不可思量勝義妙智，如是辯才能說如是甚深之法。」",
        "translation": "The Śrīgupta replied, \"The eloquence attained by someone who has none of the afflictive karmic impressions can explain such a profound teaching; it's unfathomably superior and marvelous knowledge that goes beyond the path of language, and such eloquence can explain such a profound teaching.\"",
        "source": "T07n0220_572:0955b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思菩薩問賢德天子言：「云何無生法中以辯才說？」",
        "translation": "The Śaṇḍi Bodhisattva asked the Virtuous Centaur, \"How is the teaching given with eloquence in the midst of the unborn Dharma?\"",
        "source": "T07n0220_572:0955b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢德天子答善思言：「若菩薩摩訶薩不住無生無滅法者，則無辯才說甚深法。",
        "translation": "Answering Śāntideva, he said, \"If the bodhisattvas, mahāsattvas, and gods don't abide in the Dharma of nonarising and noncessation, then they have no eloquence in explaining the profound Dharma.",
        "source": "T07n0220_572:0955b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0955b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離戲論，不見所緣，不見能緣，心無所住，是故能說。",
        "translation": "Being far removed from conceptual elaborations, they don't see perceptual objects and don't see perceptual objects, and their mind has no abiding, which is why they can speak.",
        "source": "T07n0220_572:0955b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不住我法，不住此彼，唯住清淨勝義諦中，是故能說。」",
        "translation": "Not abiding in self or dharmas, not abiding here or there, but abiding only in the pure truth of ultimate reality, it's therefore possible to speak.\"",
        "source": "T07n0220_572:0955b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思菩薩即白佛言：「甚奇！",
        "translation": "Śaṇḍī immediately said to the Buddha, \"How marvelous!",
        "source": "T07n0220_572:0955b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0955b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢德天子實為希有！",
        "translation": "The wise sons of gods are indeed rare!",
        "source": "T07n0220_572:0955b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃能通達甚深之法辯才無盡。」",
        "translation": "They then are able to comprehend the profundity of the Dharma and have inexhaustible eloquence.\"",
        "source": "T07n0220_572:0955b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善思：「賢德天子從妙喜界不動佛所，而來至此堪忍世界聽深般若波羅蜜多。",
        "translation": "The Buddha told Sthiramati, \"The Bhadrayānīya came from the Akṣobhya Buddha's place in the Marvelous Joy Realm to this tolerant world to hear the profound prajñāpāramitā.",
        "source": "T07n0220_572:0955b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知！",
        "translation": "You should know this!",
        "source": "T07n0220_572:0955b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢德天子已於無量百千億劫，修習希有陀羅尼門，經劫說法亦不窮盡。」",
        "translation": "The Bhadrayān has cultivated the rare dhāraṇī teachings for measureless hundreds of billions of eons, and his teachings don't end even after an eon.\"",
        "source": "T07n0220_572:0955b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思菩薩復白佛言：「何謂希有陀羅尼門？」",
        "translation": "Again, Śaṇḍi replied to the Buddha, \"What's the rarefied dhāraṇī teaching?\"",
        "source": "T07n0220_572:0955b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善思！",
        "translation": "The Buddha said, \"Well thought out!",
        "source": "T07n0220_572:0955b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此希有者名眾法不入陀羅尼門，此陀羅尼門過諸文字，言不能入，心不能量，內外法中皆不可得。",
        "translation": "This rare thing is called the dhāraṇī approach in which all things don't enter, and it's a dhāraṇī approach that's beyond words, can't be entered by words, isn't energetic in the mind, and is unobtainable in internal and external dharmas.",
        "source": "T07n0220_572:0955b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善思當知！",
        "translation": "\"Consider it well and know it!",
        "source": "T07n0220_572:0955b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有少法能入此者，是故名為眾法不入陀羅尼門。",
        "translation": "There's not a single thing that can enter this, so it's called the dhāraṇī approach of not entering all things.",
        "source": "T07n0220_572:0955b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0955b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法平等，無高無下、無入無出，無一文字從外而入，無一文字從內而出，無一文字住此法中，亦無文字共相見者，亦不分別法非、法異。",
        "translation": "These things are equal, have neither height nor height below, have neither entry nor exit, have no words that enter from the outside, have no words that exit from the inside, have no words that reside within these things, have no words that share a common view, and don't discriminate between what's wrong and what's different.",
        "source": "T07n0220_572:0955b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸文字說亦無減、不說無增，從本際來都無起作及壞滅者。",
        "translation": "These words are neither spoken nor declined, nor spoken nor increased, and from the beginning there's nothing that arises or ceases.",
        "source": "T07n0220_572:0955b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸文字，心亦如是；如心，一切法亦如是。",
        "translation": "As with words, so is mind, and as with mind, so are all dharmas.",
        "source": "T07n0220_572:0955b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0955b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法離言語亦離思量，從本際來無生無滅故無入出，由此名為眾法不入陀羅尼門。",
        "translation": "\"The teaching is free of language and free of deliberation, and since it comes from the beginning, there's no arising or ceasing, so there's no entering or leaving, and this is called the dhāraṇī approach of not entering all dharmas.",
        "source": "T07n0220_572:0955b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能通達此法門者辯才無盡。",
        "translation": "If someone can penetrate this dharma-gate, their eloquence will be inexhaustible.",
        "source": "T07n0220_572:0955c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0955c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通達不斷無盡法故。",
        "translation": "\"It's because they understand the incessant and inexhaustible teaching.",
        "source": "T07n0220_572:0955c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人能入虛空者，則能入此陀羅尼門。",
        "translation": "If someone can enter space, then they can enter this dhāraṇī gate.",
        "source": "T07n0220_572:0955c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善思當知！",
        "translation": "\"Consider it well and know it!",
        "source": "T07n0220_572:0955c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能通達此陀羅尼門，心得清淨，身、語亦爾；所行順理，般若堅固；諸惡魔軍無能嬈者，一切外道不敢對揚；諸煩惱業莫之能壞，身力堅固心離怯弱；凡所演說辯才無盡，能宣深妙諸聖諦門；智慧多聞猶如大海，安住寂定喻妙高山，如師子王處眾無畏，世法不染猶淨蓮花，饒益有情譬之大地，洗除垢穢喻如大水，成熟世間方諸大火，增長善法同彼大風，清涼悅意類之朗月，能破眾闇其猶烈日，摧煩惱怨如威勇士，心性調伏猶大象王，能震法雷大龍為喻，普雨眾法譬之大雲，如大良醫除煩惱病，猶大國主善御世間，如四天王護有情類及護正法，如天帝釋於人天中富貴最勝心得自在，如大梵王於堪忍界主領自在身得無礙，如揭路茶示教有情，如世間父能流法寶，如毘沙門能出世間種種珍寶；福德智慧之所莊嚴，有情見者無不蒙益，諸佛世尊之所稱讚，天、龍等眾咸擁護之。",
        "translation": "若菩薩摩訶薩能通達此陀羅尼門，心得清淨，身、語亦爾；所行順理，般若堅固；諸惡魔軍無能嬈者，一切外道不敢對揚；諸煩惱業莫之能壞，身力堅固心離怯弱；凡所演說辯才無盡，能宣深妙諸聖諦門；智慧多聞猶如大海，安住寂定喻妙高山，如師子王處眾無畏，世法不染猶淨蓮花，饒益有情譬之大地，洗除垢穢喻如大水，成熟世間方諸大火，增長善法同彼大風，清涼悅意類之朗月，能破眾闇其猶烈日，摧煩惱怨如威勇士，心性調伏猶大象王，能震法雷大龍為喻，普雨眾法譬之大雲，如大良醫除煩惱病，猶大國主善御世間，如四天王護有情類及護正法，如天帝釋於人天中富貴最勝心得自在，如大梵王於堪忍界主領自在身得無礙，如揭路茶示教有情，如世間父能流法寶，如毘沙門能出世間種種珍寶；福德智慧之所莊嚴，有情見者無不蒙益，諸佛世尊之所稱讚，天、龍等眾咸擁護之。",
        "source": "T07n0220_572:0955c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善思當知！",
        "translation": "\"Well consider it and know it!",
        "source": "T07n0220_572:0955c23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩若得如是陀羅尼門，即能自在饒益有情，方便說法而不窮盡，心無疲倦不徇利譽，法施平等無有慳嫉，受持淨戒三業無愆，安忍清淨離諸恚惱，精進清淨所作成立，靜慮清淨善調伏心，般若清淨永無疑惑，具四無量如大梵王，能善修行等持、等至，入出自在勝諸世間，修大覺因具諸福慧，受灌頂位得大自在。」",
        "translation": "If bodhisattvas, mahāsattvas, and women attain this dhāraṇī gate, they will be able to freely benefit sentient beings, skillfully expound the Dharma without exhausting it, have a mind that isn't weary and doesn't favor profit and reputation, give equally to the Dharma without stinginess or jealousy, observe pure precepts and three activities without fault, have patience and purity, avoid anger and vexation, make effort and purify actions, have a mind that's well disciplined with pure meditation, have wisdom that's pure and free of doubt, have the four immeasurables like the king of Brahmā, skillfully practice equipoise and equipoise, enter into the self-existence that's superior to the world, cultivate the causes of great awakening with merits and wisdom, and attain great mastery when they're in the consecration stage.\"",
        "source": "T07n0220_572:0955c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是總持門時，眾中六萬四千菩薩得不退轉，三萬菩薩得無生忍，二萬天人遠塵離垢生淨法眼，無量無邊人、天等眾俱發無上正等覺心。",
        "translation": "When the Buddha explained this comprehensive approach, 64,000 bodhisattvas in the assembly attained irreversibility, 30,000 bodhisattvas attained the patient acceptance of nonarising, 20,000 gods and humans became dustless and spotless and developed the pure Dharma eye, and measureless and limitless humans and gods all arouse the mind of unsurpassed perfect enlightenment.",
        "source": "T07n0220_572:0956a02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六分陀羅尼品第十三",
        "translation": "The Thirteenth Chapter of the Sixth Part Dhāraṇī",
        "source": "T07n0220_572:0956a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，曼殊室利菩薩摩訶薩即從座起頂禮佛足，偏覆左肩，右膝著地，合掌恭敬而白佛言：「甚奇！",
        "translation": "At that point, Mañjuśrī Bodhisattva Mahāsattva rose from his seat, bowed his head at the Buddha's feet, tilted his left shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, \"How marvelous!",
        "source": "T07n0220_572:0956a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0956a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所說：諸菩薩摩訶薩若得如是眾法不入陀羅尼門，成就無量無邊功德。」",
        "translation": "The Tathāgata teaches that if bodhisattvas, mahāsattvas, and buddhas attain the entrance to the dhāraṇī without entering such a variety of things, they'll achieve measureless and limitless merit.\"",
        "source": "T07n0220_572:0956a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩言：「善男子！",
        "translation": "The Buddha told Mañjuśrī Bodhisattva, \"Good sons!",
        "source": "T07n0220_572:0956a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是功德，假使如來百千年說亦未能盡。」",
        "translation": "Such merit wouldn't be exhausted even if the Tathāgata were to explain it for a hundred thousand years.\"",
        "source": "T07n0220_572:0956a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾中有一菩薩名寂靜慧，即白曼殊室利菩薩摩訶薩言：「若菩薩摩訶薩證得如是陀羅尼門，為佛世尊之所稱歎，如是菩薩善得大利，自行化彼皆悉不空。」",
        "translation": "It was then that a bodhisattva in the crowd named Quiet Wisdom said to Mañjuśrī, the bodhisattva Mahāsattva, \"If this is the kind of dhāraṇī teaching that the Bhagavān praises, such a bodhisattva has well attained great rewards and will transform them all into something that's not empty on its own.\"",
        "source": "T07n0220_572:0956a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，曼殊室利菩薩報寂靜慧菩薩言：「善男子！",
        "translation": "Then, Mañjuśrī replied to the Bodhisattva of Quiet Wisdom, \"Good sons!",
        "source": "T07n0220_572:0956a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝義諦中無法可讚無色無相，無色相者有何可讚？",
        "translation": "In the ultimate truth, there's nothing to praise about formlessness and marklessness, and what is there to praise about marklessness?",
        "source": "T07n0220_572:0956a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無可讚故於何歡喜？」",
        "translation": "What is there to rejoice over because there's nothing to praise?\"",
        "source": "T07n0220_572:0956a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，寂靜慧復作是言：「我聞如來契經中說：諸法自性無我、我所，無能令喜亦無令瞋；此法平等菩薩應學。",
        "translation": "Stilling Wisdom then also said, \"I've heard that the Tathāgata agrees with the sūtras that the self-nature of things is without self or self, and there's nothing that causes joy or anger; this is a teaching that's equal, and bodhisattvas should study it.",
        "source": "T07n0220_572:0956a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大地依止水輪，若鑿井池得水受用，其不鑿者無由致之；如是聖智法平等境遍一切法，若有勤修般若巧便即便證得，其不修者云何得之？",
        "translation": "It's like when the earth depends on a water wheel, and if you dig a well or a pond, you'll get the use of the water, but there's no way for someone who doesn't dig it to get it; thus, the equality of the noble wisdom's realm of reality pervades all dharmas, and if someone diligently cultivates the skillful means of prajñā, they'll realize it, but how will they get it if they don't cultivate it?",
        "source": "T07n0220_572:0956a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩欲求無上正等菩提不應懈怠，若勤精進，如是所說法平等境則現在前。",
        "translation": "Therefore, if a bodhisattva wants to pursue unsurpassed correct enlightenment, he shouldn't be lazy, and if he diligently undertakes to do so, the equality of the Dharma object thus explained will be manifested.",
        "source": "T07n0220_572:0956a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如生盲人不能見色，如是煩惱所盲有情，於平等法不能得見。",
        "translation": "\"Just as a blind person in his lifetime can't see form, such a sentient being blinded by affliction can't see the equality of dharmas.",
        "source": "T07n0220_572:0956a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人有眼無外光明，不能覩見所有色像，如是行人雖有智慧，若無善友不能見法。",
        "translation": "Just as a person with eyes that lack external light can't see all forms and images, so a person with wisdom can't see the teaching if they don't have a good friend.",
        "source": "T07n0220_572:0956a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有天眼不假外明自能見色，如是菩薩預法流者自然勝進。",
        "translation": "If there are divine eyes that can see form on their own without external light, such a bodhisattva naturally advances in anticipation of the flow of the Dharma.",
        "source": "T07n0220_572:0956a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間處胎藏者，雖漸增長而不自見；如是菩薩勤精進者，眾行漸增亦不自見，而能成辦一切佛法。",
        "translation": "It's like a person in the world who's in the womb and doesn't see for themselves even though they're gradually growing, but such a bodhisattva diligently undertakes to gradually increase his numerous practices and doesn't see for himself, and he's able to accomplish all the Buddha's teachings.",
        "source": "T07n0220_572:0956b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如雪山中有妙藥樹，枝條、莖檊不枯不折；如是菩薩勤修精進，所有勝行不退不失。",
        "translation": "Like the wonderful medicinal tree that exists on a snowy mountain, whose branches and stems don't wither or break, so the bodhisattva diligently cultivates effort, and all of his excellent practices don't falter or fail.",
        "source": "T07n0220_572:0956b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如轉輪王出現於世具七財寶，如是菩薩發菩提心具七法寶，所謂布施、淨戒、安忍、精進、靜慮、般若、巧便。",
        "translation": "\"Just as the wheel-turning king appears in the world with seven wealthy treasures, so the bodhisattva who arouses the aspiration for enlightenment has seven Dharma treasures, which are generosity, pure morality, patience, effort, meditation, wisdom, and skillful means.",
        "source": "T07n0220_572:0956b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王遊四洲界，於有情類其心平等，如是菩薩以四攝事饒益有情，心常平等。",
        "translation": "As the wheel-turning king travels to the four continents and realms and is equal in mind among sentient beings, so the bodhisattva benefits sentient beings with the four precepts, and his mind is always equal.",
        "source": "T07n0220_572:0956b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王隨所在處則無諍訟，如是菩薩如實說法亦無諍論。",
        "translation": "Just as the wheel-turning king follows where he is without strife, so the bodhisattva truly explains the teaching without strife.",
        "source": "T07n0220_572:0956b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如三千大千世界初成，即有妙高山王及以大海，如是菩薩初發無上正等覺心，即有般若及以大悲。",
        "translation": "It's like when the 3,000 great one-thousand worlds first formed, there was the king of marvelously high mountains and the ocean, and thus the bodhisattva first aroused the mind of unsurpassed perfect enlightenment, there was prajñā and great compassion.",
        "source": "T07n0220_572:0956b12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日出，諸山高者其光先照，如是菩薩得般若炬，諸有高行根熟菩薩先蒙光照。",
        "translation": "Like when the sun rises, the tallest mountains are the first to shine, and thus a bodhisattva attains the torch of prajñā, and bodhisattvas with faculties ripe for advanced practice are the first to be illuminated by that light.",
        "source": "T07n0220_572:0956b14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大地普能荷負，一切草木、花果、藥樹皆悉平等，如是菩薩證得如是陀羅尼門，於諸有情其心平等。」",
        "translation": "Like the earth that's universally loadable, and all the plants, trees, flowers, and medicinal trees are equal, so the bodhisattva realizes the dhāraṇī teaching that makes all sentient beings' minds equal.\"",
        "source": "T07n0220_572:0956b16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛讚寂靜慧言：「善哉！",
        "translation": "It was then that the Buddha praised the wisdom of quiescence, saying, \"Good!",
        "source": "T07n0220_572:0956b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_572:0956b19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_572:0956b19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩若得如是陀羅尼門，諸有所說一文一字無非佛語，如是所說遠離色、聲、香、味、觸、法。",
        "translation": "If bodhisattvas, mahāsattvas, and those who have thus attained the dhāraṇī teaching, every word that's spoken is nothing but the words of the Buddha, and what's thus taught is free of form, sound, odor, taste, touch, and dharma.",
        "source": "T07n0220_572:0956b19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0956b21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此所說法非世俗故無盡無邊，能引一切身心輕利。",
        "translation": "This teaching is inexhaustible and limitless because it's not secular, and it can lead to the alleviation of all minds and bodies.",
        "source": "T07n0220_572:0956b22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使百千佛前，說者亦不怯弱。",
        "translation": "Even if a hundred thousand buddhas were to appear before him, the speaker wouldn't be fainthearted.",
        "source": "T07n0220_572:0956b23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0956b23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩佛加持故心無所著，謂不著我，不著有情，不著諸法，由此證得清淨真如、清淨法界、清淨實際，得法無盡、文字無盡、辯說無盡，爾時即生殊勝歡喜，得妙慧故，得妙智故，無疑網故。」",
        "translation": "As a result of this bodhisattva-mahāsattva Buddha's blessing, his mind is free of attachment, which is to say that it's not attached to self, not attached to sentient beings, and not attached to dharmas, and as a result, he realizes pure true thusness, the pure Dharma realm, and pure reality, attains inexhaustibility of dharmas, inexhaustibility of words, and inexhaustibility of eloquence, and at that point he gives rise to an excellent rejoicing, which is the result of attaining marvelous wisdom, the result of attaining marvelous knowledge, and the result of having no web of doubt.\"",
        "source": "T07n0220_572:0956b24_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當佛說此總持門時，八千菩薩俱得如是眾法不入陀羅尼門，復有一萬二千菩薩得不退轉，五千菩薩得無生忍，一萬六千諸天子眾遠塵離垢生淨法眼，無量無邊諸有情類俱發無上正等覺心。",
        "translation": "When the Buddha spoke this dhāraṇī teaching, 8,000 bodhisattvas all attained the nonentry dhāraṇī gate for all these things, another 12,000 bodhisattvas attained irreversibility, 5,000 bodhisattvas attained the patient acceptance of nonarising, 16,000 sons of gods became dustless and spotless and gave rise to the pure Dharma eye, and measureless and limitless varieties of sentient beings all aroused the mind of unsurpassed correct enlightenment.",
        "source": "T07n0220_572:0956b28_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告寂靜慧言：「此陀羅尼能伏魔眾、摧諸外道、壞嫉法人。",
        "translation": "It was then that the Buddha addressed Quiet Wisdom, saying, \"This dhāraṇī can subdue crowds of Māra, destroy non-Buddhists, and damage jealous people.",
        "source": "T07n0220_572:0956c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然般若燈滅煩惱火，護說法者令至涅槃，調伏內心、善化外眾，容儀整肅見者歡喜，為正行人平等說法，如實觀察有情根性，授法應時非前非後。」",
        "translation": "Still, it's a prajñā lamp that extinguishes the fires of affliction, protects Dharma speakers so they'll reach nirvāṇa, tames internal states of mind and skillfully converts external ones, conducts itself respectfully and rejoices in those who see it, teaches the correct practitioners equally, correctly observes the faculties of sentient beings, and confers the Dharma when it's appropriate, not before or after.\"",
        "source": "T07n0220_572:0956c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是諸功德時，於此三千大千世界，一切大海、妙高山王、大地、諸山皆悉振動。",
        "translation": "When the Buddha spoke of such virtues, the ocean, the king of marvelous mountains, the earth, and the mountains of this 3,000 great thousand worlds all shook.",
        "source": "T07n0220_572:0956c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天雨微妙音花、大微妙音花、妙靈瑞花、大妙靈瑞花、嗢鉢羅花、拘某陀花、鉢特摩花、奔荼利花、迦末羅花，諸天空中作眾伎樂。",
        "translation": "It was then that the heavens rained down flowers of subtle sound, great subtle sound flowers, wonderful auspicious flowers, great wonderful auspicious flowers, utpala flowers, kusumata flowers, padma flowers, puṇḍarī flowers, and kāmalā flowers, and the skies were filled with music.",
        "source": "T07n0220_572:0956c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊復告寂靜慧言：「善男子！",
        "translation": "The Bhagavān again addressed Śubhakarasiṃha, saying, \"Good sons!",
        "source": "T07n0220_572:0956c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去無量無數無邊難思議劫，有佛出世名為寶月，十號具足，國名無毀，劫名喜讚，聲聞弟子三十二億，菩薩弟子無量無邊，然彼如來先無苦行及降魔事而證菩提。",
        "translation": "In an unfathomably long eon of unfathomable duration, there was a Buddha who appeared in the world named Jewel Moon, whose ten epithets were complete, whose kingdom name was Not Defiled, whose eon name was Joyful Praise, whose disciples were 3.2 billion, and whose disciples were countless and limitless, but that Tathāgata had no prior ascetic practices or acts of subjugating demons that led to his awakening.",
        "source": "T07n0220_572:0956c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼眾中有一菩薩名寶功德，具妙辯才，能為有情種種說法。",
        "translation": "At the time, there was a bodhisattva named Jeweled Superknowledge among them who possessed marvelous eloquence and was able to teach various subjects to sentient beings.",
        "source": "T07n0220_572:0956c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸大眾請彼如來不入涅槃久住於世。",
        "translation": "The masses then invited that Tathāgata not to enter nirvāṇa and to stay in the world for a long time.",
        "source": "T07n0220_572:0956c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，寶功德告大眾言：『諸佛世尊無生無滅，何用勸請不入涅槃？",
        "translation": "\"Jewel-Arising Virtuous then addressed the crowd, \"The buddhas are honored as being unborn and unceasing, so why is there a need to urge them not to enter nirvāṇa?",
        "source": "T07n0220_572:0956c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若太虛空入涅槃者，如來乃可入般涅槃；若有真如、法界、實際、不思議界入涅槃者，如來乃可入般涅槃。",
        "translation": "If space enters nirvāṇa, then the Tathāgata can enter parinirvāṇa; if there's a true, objective, real, inconceivable realm that enters nirvāṇa, then the Tathāgata can enter parinirvāṇa.",
        "source": "T07n0220_572:0956c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0956c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來之法無成無壞、無染無淨，非世間非出世間、非有為非無為、非常非斷。",
        "translation": "The Tathāgata's teaching is neither formed nor destroyed, neither defiled nor purified, neither mundane nor transmundane, neither acquired nor inactive, and neither permanent nor stopped.",
        "source": "T07n0220_572:0956c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假令一口而有十舌，是一一舌復生百舌，是一一舌復生千舌，亦不能說如來成壞，乃至不能說有常斷，云何大眾勸請如來不入涅槃久住於世？』",
        "translation": "If one mouth were to have ten tongues, and each tongue were to give rise to a hundred tongues, and each tongue were to give rise to a thousand tongues, it wouldn't be possible to say that the Tathāgata is formed or destroyed, or even that there's permanence and cessation, so why would the masses urge the Tathāgata not to enter nirvāṇa and remain in the world for a long time?'",
        "source": "T07n0220_572:0956c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼寶功德說此法時，八萬六千諸菩薩眾得不退轉，七千菩薩摩訶薩眾俱得無邊功德陀羅尼門、悅意陀羅尼門、無礙陀羅尼門、歡喜陀羅尼門、大悲陀羅尼門、月愛陀羅尼門、月光陀羅尼門、日愛陀羅尼門、日光陀羅尼門、妙高山王陀羅尼門、深廣大海陀羅尼門、功德寶王陀羅尼門，三萬六千人、天大眾遠塵離垢生淨法眼。」",
        "translation": "\"When that Jewel-Architect taught this Dharma, 86,000 bodhisattvas attained irreversibility, and 7,000 bodhisattvas, Mahāsattvas, and all of them attained the dhāraṇī gate of limitless merit, the dhāraṇī gate of joy, the dhāraṇī gate of unhinderedness, the dhāraṇī gate of joy, the dhāraṇī gate of great compassion, the dhāraṇī gate of moon love, the dhāraṇī gate of moonlight, the dhāraṇī gate of sun love, the dhāraṇī gate of sunlight, the dhāraṇī gate of the king of marvelous mountains, the dhāraṇī gate of the vast ocean, and the dhāraṇī gate of the king of merit, and 36,000 great multitudes of humans and gods became dustless and spotless and produced the pure Dharma eye.\"",
        "source": "T07n0220_572:0956c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊復告寂靜慧言：「昔寶功德今汝身是，由此因緣，汝能說是陀羅尼門種種功德。」",
        "translation": "The Bhagavān again addressed Stillness Wisdom, \"The qualities of the treasures of the past are now yours, and for this reason, you can explain the various qualities of this dhāraṇī gate.\"",
        "source": "T07n0220_572:0957a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，曼殊室利菩薩摩訶薩而說頌言：「總持猶妙藥，　　能療眾惑病，　亦如天甘露，　　服者常安樂。」",
        "translation": "The Mañjuśrī Bodhisattva Mahāsattva then spoke this verse, \"The Dhāraṇī Gate is like a wonderful medicine that treats the illnesses of affliction and is like the nectar of the gods, which always pleases those who take it.\"",
        "source": "T07n0220_572:0957a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，功德花王菩薩摩訶薩復說頌言：「總持無文字，　　文字顯總持，　由般若大悲，　　離言以言說。」",
        "translation": "Then, the Flower King of Merit Bodhisattva Mahāsattva spoke another verse, \"The dhāraṇī has no words, but words reveal the dhāraṇī, and it's because of Prajñāparinirvāṇa's great compassion that it's freed from words and explained in words.\"",
        "source": "T07n0220_572:0957a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，珊覩史多天王即從座起頂禮佛足，偏覆左肩右膝著地，合掌恭敬而白佛言：「諸佛功德不可思議，諸佛所說不可思議，諸大菩薩所行勝行所說妙法不可思議。",
        "translation": "At that point, King Saṃtuṣita then rose from his seat, bowed his head at the Buddha's feet, put his left shoulder over his right knee, put his palms together in respect, and said to the Buddha, \"The merits of the buddhas are unfathomable, what the buddhas teach is unfathomable, and the marvelous things that the great bodhisattvas do and the wonderful things they teach are unfathomable.",
        "source": "T07n0220_572:0957a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等諸天宿世所植善根深厚，得值如來聞說如是甚深妙法。」",
        "translation": "We gods have deep roots of goodness planted in previous lives, and we've been blessed with the Tathāgata's ability to hear and teach such profound and wonderful things.\"",
        "source": "T07n0220_572:0957a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以無量天妙花香奉散如來而為供養。",
        "translation": "They then presented the Tathāgata with measureless flowers and fragrances from the gods as an offering.",
        "source": "T07n0220_572:0957a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告彼天王言：「天王當知！",
        "translation": "At that point, the Buddha addressed the god king, \"You should know, god king!",
        "source": "T07n0220_572:0957a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲供養佛世尊者，當修三法：一者、發菩提心。",
        "translation": "Those who want to make offerings to the Buddha, the Bhagavān, should cultivate three things: 1. Generating the aspiration for enlightenment.",
        "source": "T07n0220_572:0957a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、護持正法。",
        "translation": "2. Maintain the right teaching.",
        "source": "T07n0220_572:0957a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、如教修行。",
        "translation": "Third, they should cultivate their practice as taught.",
        "source": "T07n0220_572:0957a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天王當知！",
        "translation": "You should know, O king of gods!",
        "source": "T07n0220_572:0957a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能修學此三法者，乃得名為真供養佛。",
        "translation": "If someone can train in these three things, then they can be called a true offering to the Buddha.",
        "source": "T07n0220_572:0957a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使如來一劫住世，說此供養所獲功德亦不能盡。",
        "translation": "Even if the Tathāgata were to remain in the world for one eon, the merits gained from making these offerings wouldn't be exhausted.",
        "source": "T07n0220_572:0957a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，天王！",
        "translation": "Therefore, Deva King!",
        "source": "T07n0220_572:0957a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲供養佛世尊者，具此三法名真供養。",
        "translation": "Those who want to make offerings to the Buddha, the Bhagavān, should have these three things in place, which are called true offerings.",
        "source": "T07n0220_572:0957a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天王當知！",
        "translation": "You must know, O king of gods!",
        "source": "T07n0220_572:0957a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有護佛一四句頌，則為擁護過去未來現在諸佛所證無上正等菩提。",
        "translation": "\"If there's one four-line verse that protects the buddhas, it's a verse that protects the unsurpassed correct enlightenment realized by the buddhas of the past, future, and present.",
        "source": "T07n0220_572:0957a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0957b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊所證無上正等菩提從法生故。",
        "translation": "It's because the unsurpassed correct enlightenment realized by the buddhas and world-honored ones arises from the Dharma.",
        "source": "T07n0220_572:0957b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法供養者名真供養，諸供養中最為第一，資財供養所不能比。",
        "translation": "These offerings of the Dharma are called true offerings, and they're the highest of all offerings, unsurpassed by offerings of material goods.",
        "source": "T07n0220_572:0957b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天王當知！",
        "translation": "You must know, O king of gods!",
        "source": "T07n0220_572:0957b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念過去無量無數難思議劫精勤修學菩薩道時，聞虛空中天說頌曰：「『二人遠離王賊等，　　所不能侵大寶藏，　　百千萬劫法難聞，　　得聞不持不施等。",
        "translation": "When I remembered the countless and unfathomable eons of the past and diligently cultivated the bodhisattva path, I heard a verse spoken by a sky celestial, 'Two people are free of kings and thieves, who can't invade the great treasury, and it's difficult to hear the Dharma for a hundred million eons; they hear it, don't maintain it, and don't give it to others.",
        "source": "T07n0220_572:0957b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大菩提心護正法，　　如教修行心寂靜，　　自利利他心平等，　　是則名真供養佛。』",
        "translation": "When the mind of great bodhi protects the right teaching, their mind is quiescent as they teach it, and their thoughts are equal for the benefit of self and others, this is called truly making offerings to the Buddha.'",
        "source": "T07n0220_572:0957b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天王當知！",
        "translation": "\"You should know, O king of gods!",
        "source": "T07n0220_572:0957b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於過去初聞此頌即為他說，時有八千諸有情類俱發無上正等覺心。",
        "translation": "When I first heard this verse in the past, I spoke it for others, and 8,000 different kinds of sentient beings all aroused the mind of unsurpassed perfect enlightenment.",
        "source": "T07n0220_572:0957b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，天王！",
        "translation": "Therefore, O king of gods!",
        "source": "T07n0220_572:0957b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以法供養最為第一。",
        "translation": "\"Making offerings to the Dharma is the greatest.",
        "source": "T07n0220_572:0957b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_572:0957b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提從法生故。」",
        "translation": "The buddhas' unsurpassed correct perfect enlightenment arises from the Dharma.\"",
        "source": "T07n0220_572:0957b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六分勸誡品第十四之一",
        "translation": "Sixth Chapter, Exhortation Fourteen, Part One",
        "source": "T07n0220_572:0957b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，曼殊室利菩薩復從座起頂禮佛足，偏覆左肩，右膝著地，合掌恭敬而白佛言：「如來所說甚深般若波羅蜜多，頗有有情於當來世正法將滅時分轉時能信受不？",
        "translation": "At that point, Mañjuśrī Bodhisattva again rose from his seat, bowed his head at the Buddha's feet, put his arms around his left shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, \"Does the Tathāgata teach the profound perfection of wisdom, and will there be sentient beings who will believe and accept it when the true teaching is about to cease in a future life?",
        "source": "T07n0220_572:0957b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等聞說是經信受不謗，如此人等成何功德？」",
        "translation": "If good men and good women hear and teach this sūtra and believe and accept it without denigrating it, what merit does that accomplish for such people?\"",
        "source": "T07n0220_572:0957b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩言：「善男子！",
        "translation": "The Buddha addressed Mañjuśrī Bodhisattva, \"Good sons!",
        "source": "T07n0220_572:0957b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於當來世正法將滅時分轉時，有善男子、善女人等，曾於無量無邊佛所修行淨戒、靜慮、般若，是佛真子能信此經，所致功德不可稱計。",
        "translation": "In a future life when the right teaching will cease and the Dharma will change, there will be good men and good women who have practiced pure precepts, meditation, and prajñā in measureless and limitless buddha-places, and this is a true son of the Buddha who can believe in this sūtra, which will cause incalculable merits.",
        "source": "T07n0220_572:0957b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸勝善法從般若生，若有人能信受不謗，吾今為汝略以喻說。",
        "translation": "If someone can believe and accept it without denigrating it, I'll explain it for you in brief by way of an explanation.",
        "source": "T07n0220_572:0957b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "\"Mañjuśrī!",
        "source": "T07n0220_572:0957b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此贍部洲周匝七千踰繕那量，北廣南狹形如車箱，其中人面亦復如是。",
        "translation": "This island of Jambudvīpa is 7,000 yojanas in circumference, wide in the north and narrow in the south, shaped like a chariot box, and its human face is likewise.",
        "source": "T07n0220_572:0957b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使充滿此贍部洲預流、一來、不還、阿羅漢、獨覺，如粟、稻、麻、竹、荻、蘆葦、甘蔗林等中無間隙。",
        "translation": "Suppose this island of alms is filled with pre-currents, first-comers, nonreturners, arhats, and solitaries like millet, rice, hemp, bamboo, dried fish, reeds, and sugarcane groves, with no spaces between them.",
        "source": "T07n0220_572:0957b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等盡彼聖眾壽量短長，以諸世間上妙飲食、衣服、臥具及醫藥等，起殷淨心奉施供養。",
        "translation": "Suppose there are good sons and good women who, for the entirety of their noble sentient beings' lifespans and their lengths, arouse an earnest and pure heart to make offerings of the finest foods, clothing, bedding, and medicines of the world.",
        "source": "T07n0220_572:0957b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後各收馱都，起窣堵波嚴飾供養，或以七寶滿贍部洲積至梵宮，於諸聖眾各別奉施爾所七寶，畢自壽量晝夜三十牟呼栗多相續不斷。",
        "translation": "After they attain parinirvāṇa, each of them collects a stūpa, decorates it with offerings, or fills the Brahma palace with seven treasures, and each of those noble people individually presents those seven treasures, which continue for the rest of their lives, day and night, for thirty mahorishi periods.",
        "source": "T07n0220_572:0957c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_572:0957c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_572:0957c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Are these good men and good women able to obtain much merit as a result of this?\"",
        "source": "T07n0220_572:0957c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利即白佛言：「甚多！",
        "translation": "Mañjuśrī then said to the Buddha, \"How much!",
        "source": "T07n0220_572:0957c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0957c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_572:0957c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_572:0957c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩：「若善男子、善女人等能於此經信受不謗，所獲福聚於前施福，百倍為勝，千倍為勝，乃至鄔波尼殺曇倍亦復為勝。",
        "translation": "The Buddha told Mañjuśrī Bodhisattva, \"If good men and good women can accept this sūtra with faith and don't denigrate it, the merit gained will be one hundred times greater than the merit previously bestowed, one thousand times greater, and even up to the level of Upaniṣad will be greater still.",
        "source": "T07n0220_572:0957c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "\"Mañjuśrī!",
        "source": "T07n0220_572:0957c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東勝身洲周匝八千踰繕那量，形如半月，人面亦爾。",
        "translation": "The eastern continent of Pūrvavideha has a circumference of 8,000 yojanas and is shaped like a half-moon, so is the face of a person.",
        "source": "T07n0220_572:0957c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使充滿東勝身洲預流、一來、不還、阿羅漢、獨覺，如粟、稻、麻、竹、荻、蘆葦、甘蔗林等中無間隙。",
        "translation": "Suppose that the eastern continent of Pūrvavideha were filled with pre-cursors, first-comers, irreversibles, arhats, and pratyekbuddhas like corn, rice, hemp, bamboo, dried grass, reeds, and sugarcane groves, with no spaces in between.",
        "source": "T07n0220_572:0957c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等盡彼聖眾壽量短長，以諸世間上妙飲食、衣服、臥具及醫藥等，起殷淨心奉施供養。",
        "translation": "Suppose there are good sons and good women who, for the entirety of their noble sentient beings' lifespans and their lengths, arouse an earnest and pure heart to make offerings of the finest foods, clothing, bedding, and medicines of the world.",
        "source": "T07n0220_572:0957c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後各收馱都，起窣堵波嚴飾供養，或以七寶滿勝身洲積至梵宮，於諸聖眾各別奉施爾所七寶，畢自壽量晝夜三十牟呼栗多相續不斷。",
        "translation": "After they attain parinirvāṇa, each of them collects his dhātundā, raises a stūpa to adorn and make offerings, or they fill the palace of Brahmā with seven treasures and present each of those sages with a gift of those seven treasures, which will last for their lifespan and continue for the next 30 mahorattas day and night.",
        "source": "T07n0220_572:0957c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_572:0957c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_572:0957c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Are these good men and good women able to obtain much merit as a result of this?\"",
        "source": "T07n0220_572:0957c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利即白佛言：「甚多！",
        "translation": "Mañjuśrī then said to the Buddha, \"How much!",
        "source": "T07n0220_572:0957c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0957c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_572:0957c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_572:0957c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩：「若善男子、善女人等能於此經信受不謗，所獲福聚於前施福，百倍為勝，千倍為勝，乃至鄔波尼殺曇倍亦復為勝。",
        "translation": "The Buddha told Mañjuśrī Bodhisattva, \"If good men and good women can accept this sūtra with faith and don't denigrate it, the merit gained will be one hundred times greater than the merit previously bestowed, one thousand times greater, and even up to the level of Upaniṣad will be greater still.",
        "source": "T07n0220_572:0957c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "\"Mañjuśrī!",
        "source": "T07n0220_572:0957c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西牛貨洲周匝九千踰繕那量，形如滿月，人面亦爾。",
        "translation": "The Western Oxfordshire continent is 9,000 yojanas in circumference and is shaped like a full moon, so is the face of a person.",
        "source": "T07n0220_572:0957c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使充滿西牛貨洲預流、一來、不還、阿羅漢、獨覺，如粟、稻、麻、竹、荻、蘆葦、甘蔗林等中無間隙。",
        "translation": "Suppose that the island of Oxgoods in the west were filled with pre-cursors, first-comers, nonreturners, arhats, and solitary realizers like corn, rice, hemp, bamboo, dried grass, reeds, and sugarcane groves, with no spaces in between.",
        "source": "T07n0220_572:0957c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等盡彼聖眾壽量短長，以諸世間上妙飲食、衣服、臥具及醫藥等，起殷淨心奉施供養。",
        "translation": "Suppose there are good sons and good women who, for the entirety of their noble sentient beings' lifespans and their lengths, arouse an earnest and pure heart to make offerings of the finest foods, clothing, bedding, and medicines of the world.",
        "source": "T07n0220_572:0957c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後各收馱都，起窣堵波嚴飾供養，或以七寶滿牛貨洲積至梵宮，於諸聖眾各別奉施爾所七寶，畢自壽量晝夜三十牟呼栗多相續不斷。",
        "translation": "After they attain parinirvāṇa, each of them collects a stūpa, decorates it with offerings, or fills the Oxus continent with seven treasures and brings them to the Brahma palace, where each of those noble people individually presents those seven treasures, which continue for the rest of their lives, day and night, for thirty mahorishi periods.",
        "source": "T07n0220_572:0958a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_572:0958a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_572:0958a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Are these good men and good women able to obtain much merit as a result of this?\"",
        "source": "T07n0220_572:0958a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利即白佛言：「甚多！",
        "translation": "Mañjuśrī then said to the Buddha, \"How much!",
        "source": "T07n0220_572:0958a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0958a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_572:0958a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_572:0958a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩：「若善男子、善女人等能於此經信受不謗，所獲福聚於前施福，百倍為勝，千倍為勝，乃至鄔波尼殺曇倍亦復為勝。",
        "translation": "The Buddha told Mañjuśrī Bodhisattva, \"If good men and good women can accept this sūtra with faith and don't denigrate it, the merit gained will be one hundred times greater than the merit previously bestowed, one thousand times greater, and even up to the level of Upaniṣad will be greater still.",
        "source": "T07n0220_572:0958a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "\"Mañjuśrī!",
        "source": "T07n0220_572:0958a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北俱盧洲周匝十千踰繕那量，其形方正，人面亦爾。",
        "translation": "The northern continent is 10,000 yojanas in circumference, and its shape is square, so is its human face.",
        "source": "T07n0220_572:0958a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使充滿北俱盧洲預流、一來、不還、阿羅漢、獨覺，如粟、稻、麻、竹、荻、蘆葦、甘蔗林等中無間隙。",
        "translation": "Suppose that the northern continent were filled with pre-cursors, first-comers, nonreturners, arhats, and solitaries like corn, rice, hemp, bamboo, dried fish, reeds, and sugarcane groves, with no spaces in between.",
        "source": "T07n0220_572:0958a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等盡彼聖眾壽量短長，以諸世間上妙飲食、衣服、臥具及醫藥等，起殷淨心奉施供養。",
        "translation": "Suppose there are good sons and good women who, for the full measure of their noble sentient beings' lives, make offerings with an earnest and pure heart to the world's finest foods, clothing, bedding, and medicines.",
        "source": "T07n0220_572:0958a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後各收馱都，起窣堵波嚴飾供養，或以七寶滿俱盧洲積至梵宮，於諸聖眾各別奉施爾所七寶，畢自壽量晝夜三十牟呼栗多相續不斷。",
        "translation": "After they attain parinirvāṇa, each of them collects his dhātundā, raises a stūpa, decorates it, and makes offerings, or they fill the palace of Brahmā with seven treasures, and each of those noble people individually presents those seven treasures, which continue for the rest of their lives, day and night, for thirty mahorishi periods.",
        "source": "T07n0220_572:0958a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_572:0958a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_572:0958a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Are these good men and good women able to obtain much merit as a result of this?\"",
        "source": "T07n0220_572:0958a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼殊室利即白佛言：「甚多！",
        "translation": "Mañjuśrī then said to the Buddha, \"How much!",
        "source": "T07n0220_572:0958a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_572:0958a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_572:0958a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_572:0958a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告曼殊室利菩薩：「若善男子、善女人等能於此經信受不謗，所獲福聚於前施福，百倍為勝，千倍為勝，乃至鄔波尼殺曇倍亦復為勝。」",
        "translation": "The Buddha told Mañjuśrī Bodhisattva, \"If good sons and good women can believe and accept this sūtra without denigrating it, the merit gained will be one hundred times greater than the merit previously bestowed, one thousand times greater, and even up to the level of the Upaniṣad will be greater still.\"",
        "source": "T07n0220_572:0958a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百七十二",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 5072",
        "source": "T07n0220_572:0958a26_0",
        "is_bad_quality": false
    }
]