[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 504",
        "source": "T07n0220_547:0813b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七",
        "translation": "seventeen",
        "source": "T07n0220_547:0813b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_547:0813b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四分魔事品第十一之二",
        "translation": "Chapter 11bis of the Fourth Part of the Māra Sutra",
        "source": "T07n0220_547:0813b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0813b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲往他方安隱豐樂無難之處，能聽法者欲隨其去，能說法者方便試言：『汝雖為利欲隨我往，而汝至彼豈必遂心？",
        "translation": "When someone who teaches the Dharma wants to go to another place of comfort and abundance where there's no difficulty, and someone who listens to the Dharma wants to follow him, the person who teaches the Dharma skillfully tries to say, 'Even though you want to follow me there for my benefit, will you be able to reach it?'",
        "source": "T07n0220_547:0813b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜善審思勿後憂悔。』",
        "translation": "It's good to consider it well and not regret it later.'",
        "source": "T07n0220_547:0813b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，聽法者聞已念言：『是師不欲令我去相，設固隨往豈必聞法？』",
        "translation": "When the listener of the teaching heard this, he thought, 'The teacher doesn't want me to go away, so if I did go along, wouldn't I hear the teaching?'",
        "source": "T07n0220_547:0813b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣不隨其去，兩不和合，不獲教授、聽受、書持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Not following them for this reason and not combining them doesn't lead to teaching, listening, retaining, reciting, and cultivating the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T07n0220_547:0813b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0813b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲往他方，所經道路曠野險阻，多諸賊難及旃荼羅惡獸、獵師、毒蛇等怖，能聽法者欲隨其去，能說法者方便試言：『汝今何故無事隨我欲往如是諸險難處？",
        "translation": "When a person who teaches the Dharma wants to go to another place and travels through a path that's wild and dangerous, full of thieves and difficult people, dangerous animals such as caṇḍāla, hunters, and vipers, and so forth, and that person who hears the Dharma wants to follow him, the person who teaches the Dharma skillfully asks, 'Why don't you have any reason to follow me to such a dangerous and difficult place?'",
        "source": "T07n0220_547:0813b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜善審思勿後憂悔。』",
        "translation": "It's good to consider it well and not regret it later.'",
        "source": "T07n0220_547:0813b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者聞已念言：『師應不欲令我隨往，設固隨往何必聞法？』",
        "translation": "Those who can hear the teaching think after hearing it, 'Shouldn't the teacher want me to go along with him, or why would he need to hear the teaching if he did?'",
        "source": "T07n0220_547:0813b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣不隨其去，兩不和合，不獲教授、聽受、書持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Not following them for this reason and not combining them doesn't lead to teaching, listening, retaining, reciting, and cultivating the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T07n0220_547:0813b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0813b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者多有施主數相追隨，聽法者來請說般若波羅蜜多，或請書寫、受持、讀誦、如說修行，彼多緣礙無暇教授，能聽法者起嫌恨心，後雖教授而不聽受，兩不和合，不獲教授、聽受、書持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When a person who teaches the Dharma is often followed by a number of benefactors, and a listener comes and asks him to teach the perfection of wisdom or to write, memorize, recite, and practice as he's taught, they are often hindered by conditions and don't have time to teach, and the person who can listen to the Dharma becomes hostile; later, although he teaches it, he doesn't listen and accept it; the two aren't in harmony; and he doesn't receive the teaching, listen, memorize, recite, or practice the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T07n0220_547:0813b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0813b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔作種種形，至菩薩所方便破壞，令於般若波羅蜜多相應經典，不得書寫、受持、讀誦、修習、思惟、為他演說。",
        "translation": "All kinds of evil demons take on various forms and come to the bodhisattvas to skillfully destroy them, so that they can't write, memorize, recite, practice, contemplate, or explain the sūtras associated with the perfection of wisdom to others.",
        "source": "T07n0220_547:0813b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T07n0220_547:0813c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住菩薩乘善男子等，於深般若波羅蜜多書寫等時所有留難，當知皆是菩薩魔事。」",
        "translation": "All the difficulties that good sons and daughters abiding in the bodhisattva vehicle have when they write and recite the profound prajñāparamitā should be known to be the work of the bodhisattva Māra.\"",
        "source": "T07n0220_547:0813c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「何緣惡魔作諸形像，至菩薩所方便破壞，令於般若波羅蜜多相應經典不得書寫乃至演說？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"What are the reasons why evil demons create these images and come to the bodhisattvas to skillfully destroy them, so that the teachings associated with the perfection of wisdom can't be written or explained?\"",
        "source": "T07n0220_547:0813c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多能生諸佛一切智智，諸佛所有一切智智能生佛教，佛教能生無量無數有情般若，有情般若能證無邊諸煩惱斷，煩惱斷者一切惡魔不得其便，一切惡魔不得便故多生憂苦，如箭入心：『勿我由斯甚深般若波羅蜜多境界空缺。』",
        "translation": "The Buddha told Śaṅgālī, \"The profound prajñāpāramitā produces the Buddha's omniscience and wisdom, and the Buddha's omniscience and wisdom produces Buddhism, Buddhism produces the immeasurable and countless prajñāpāramitā of sentient beings, and the prajñāpāramitā of sentient beings realizes the elimination of limitless afflictions; when afflictions are eliminated, all evil demons won't be able to get an advantage over them, and because all evil demons won't be able to get an advantage over them, they'll often become sad and distressed, like arrows entering the mind, 'Don't let this profound prajñāpāramitā realm of mine become vacant.'",
        "source": "T07n0220_547:0813c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故惡魔作諸形像，至菩薩所方便破壞，令於般若波羅蜜多相應經典不得書寫乃至演說。」",
        "translation": "That's why evil demons create various images that come to the bodhisattvas to skillfully destroy them, so that the teachings associated with the perfection of wisdom can't be written or explained.\"",
        "source": "T07n0220_547:0813c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「云何惡魔作諸形像，至菩薩所方便破壞？」",
        "translation": "It was then that the good present again said to the Buddha, \"How do evil demons create various images that come to the bodhisattvas for skillful destruction?\"",
        "source": "T07n0220_547:0813c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「有諸惡魔作沙門像，至菩薩所方便破壞，令其毀厭甚深般若波羅蜜多，謂作是言：『汝所習誦無相經典非真般若波羅蜜多，我所習誦有相經典是真般若波羅蜜多。』",
        "translation": "The Buddha told Śubhavyūha, \"Some evil demons make images of ascetics and come to the bodhisattvas to skillfully destroy them, causing them to dislike the profound perfection of wisdom, saying, 'That scripture you've been chanting without characteristics is not the true perfection of wisdom, but the scripture I've been chanting with characteristics is the true perfection of wisdom.'",
        "source": "T07n0220_547:0813c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語時，有諸菩薩未得受記，新學大乘智慧狹劣，便於般若波羅蜜多相應經典心生疑惑，由疑惑故便於般若波羅蜜多而生毀厭，由毀厭故遂不書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When they say this, some bodhisattvas who have yet to be ordained and are new to the great vehicle and have limited wisdom become doubtful of the teachings associated with the perfection of wisdom, and because of that doubt, they become disillusioned with the perfection of wisdom, and because of that disillusionment, they don't write, memorize, recite, cultivate, contemplate, or expound the profound perfection of wisdom for others, which should be known as a demonic act for bodhisattvas.",
        "source": "T07n0220_547:0813c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0813c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔作苾芻像，至菩薩所語菩薩言：『若諸菩薩行深般若波羅蜜多，唯證實際得預流果乃至或得獨覺菩提，終不能證無上佛果，何緣於此唐設劬勞？』",
        "translation": "Some evil demons took the form of bhikṣu images and came to the bodhisattva and said, 'If bodhisattvas practice the profound perfection of wisdom and realize only the actual attainment of the fruit of stream-winner or even the enlightenment of the solitary realizer, but never realize the unsurpassed Buddhahood, what are the reasons for their tiring efforts here?'",
        "source": "T07n0220_547:0813c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩既聞，便不書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Once a bodhisattva hears about it, he doesn't write, memorize, recite, cultivate, contemplate, or expound the profound prajñāpāramitā for others, which should be known as a demonic act for bodhisattvas.",
        "source": "T07n0220_547:0813c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good present!",
        "source": "T07n0220_547:0814a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多書寫等時多諸魔事，菩薩應覺，覺已精勤正念、正知，方便遠離。」",
        "translation": "When writing and so forth, the profound prajñāpāramitā is full of demonic activities that bodhisattvas should perceive, and after perceiving them, they should diligently apply right mindfulness and right knowledge to skillfully avoid them.\"",
        "source": "T07n0220_547:0814a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「如是！",
        "translation": "The life-long good manifest then said to the Buddha, \"So it is!",
        "source": "T07n0220_547:0814a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_547:0814a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0814a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well gone!",
        "source": "T07n0220_547:0814a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多書寫等時多諸魔事。",
        "translation": "\"When the profound prajñāpāramitā is written, there are many demonic acts.",
        "source": "T07n0220_547:0814a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如無價大寶神珠，雖有勝能而多怨賊；如是般若波羅蜜多，雖有勝德而多留難。",
        "translation": "It's like the priceless great precious jewel of a god, which despite its ability is often resented by thieves, and the prajñāpāramitā which despite its excellent qualities is often obstructed.",
        "source": "T07n0220_547:0814a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住菩薩乘善男子等，少福德故，書寫等時有諸惡魔為作留難，雖有樂欲而不能成。",
        "translation": "Good sons who abide in the bodhisattva vehicle have little virtue, so when they write and so forth, there are many bad demons who make things difficult for them, and although they have pleasant desires, they can't achieve them.",
        "source": "T07n0220_547:0814a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0814a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有愚癡者為魔所惑，住菩薩乘善男子等，於深般若波羅蜜多書寫等時為作留難。",
        "translation": "A foolish man deluded by Māra abides in the bodhisattva vehicle, a good man, and so forth, who makes things difficult when writing the profound prajñāpāramitā.",
        "source": "T07n0220_547:0814a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_547:0814a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼愚癡者覺慧微昧，不能思議廣大佛法，自於般若波羅蜜多不能書寫、受持、讀誦、修習、思惟、聽聞、演說，復樂障他書寫等事。」",
        "translation": "That foolish man's awakening and wisdom are so ignorant that he can't contemplate the vast Buddha-dharma, and he himself can't write, retain, recite, cultivate, contemplate, hear, or expound the perfection of wisdom, and he's also happy to hinder others from writing and so forth.\"",
        "source": "T07n0220_547:0814a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śaṅgālī, \"So it is!",
        "source": "T07n0220_547:0814a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0814a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_547:0814a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有愚癡人為魔所使，未種善根福慧薄劣，未於佛所發弘誓願，未為善友之所攝受，自於般若波羅蜜多不能書寫乃至演說，新學大乘善男子等，於深般若波羅蜜多書寫等時為作留難。",
        "translation": "\"If there are foolish people who are led by Māra, haven't cultivated good roots, have weak fortune and wisdom, haven't made a great vow to the Buddha, haven't been accepted by a good friend, and can't write or speak the perfection of wisdom, then newly trained good men and women of the great vehicle will make things difficult for themselves when they write the profound perfection of wisdom.",
        "source": "T07n0220_547:0814a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於當來世有善男子、善女人等，福慧薄劣善根微少，於諸如來廣大功德心不欣樂，自於般若波羅蜜多不能書寫、受持、讀誦、修習、思惟、聽聞、演說，復樂障他書寫等事，當知彼類獲罪無邊。",
        "translation": "In a future life, if there are good men and good women whose merits are weak and whose good roots are meager, who aren't pleased at heart with the vast virtues of the Tathāgatas, who can't write, retain, recite, cultivate, contemplate, hear, or expound the prajñāpāramitā on their own, and who are happy to hinder others from writing and so forth, you should know that these kinds of people obtain infinite guilt.",
        "source": "T07n0220_547:0814a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0814a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有菩薩乘善男子等，於深般若波羅蜜多書寫等時，多有魔事為作留難，令書寫等皆不得成，由此不能圓滿功德，善根未熟、福慧少故。",
        "translation": "\"When there are good sons and gentlemen of the bodhisattva vehicle who write profound prajñāpāramitā, there are often demonic forces that make it difficult for them to complete their writing, which prevents them from perfecting their virtues and causes their good roots to be immature and their merits and wisdom to be low.",
        "source": "T07n0220_547:0814a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有菩薩乘善男子等，於深般若波羅蜜多書寫等時，若無魔事，當知皆是諸佛神力慈悲護念。",
        "translation": "If there are good sons and daughters of the bodhisattva vehicle who write the profound prajñāpāramitā, then they should know that it's because of the Buddha's spiritual power and compassionate protection and mindfulness if there are no demonic forces at the time they write it.",
        "source": "T07n0220_547:0814a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0814a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡魔眷屬雖勤方便欲滅般若波羅蜜多，諸佛世尊亦勤方便慈悲護念，令菩薩乘善男子等於深般若波羅蜜多書寫等時無諸留難，速證無上正等菩提。」",
        "translation": "Although evil demons and their followers diligently and skillfully seek to extinguish the perfection of wisdom, the Bhagavān also diligently and skillfully protects and kindly preserves them, so that when good sons and daughters of the bodhisattva vehicle write and compose the profound perfection of wisdom, they have no difficulty and quickly realize unsurpassed perfect enlightenment.\"",
        "source": "T07n0220_547:0814a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四分現世間品第十二",
        "translation": "The Fourth Part of the Present World: Chapter 12",
        "source": "T07n0220_547:0814b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0814b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如女人多有諸子，或五、或十、二十、三十、四十、五十、若百、若千。",
        "translation": "Suppose a woman has many sons, whether five, ten, twenty, thirty, forty, fifty, a hundred, or a thousand.",
        "source": "T07n0220_547:0814b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母得病諸子各別勤求醫藥，咸作是念：『云何令我母病除愈，令無障難身名不滅，久住安樂苦受不生，諸妙樂具咸歸我母？",
        "translation": "When their mother becomes ill, the sons each diligently seek medicine, thinking, 'How will my mother's illness be healed, so that her body's name won't cease because of the absence of hindrances, her long-abiding happiness and painful feelings won't arise, and all the wonderful things that bring joy to her will belong to my mother?'",
        "source": "T07n0220_547:0814b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "What is the reason?",
        "source": "T07n0220_547:0814b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生育我等，示世間事，甚大艱辛。』",
        "translation": "Giving birth to us shows how great the hardships of the world are.'",
        "source": "T07n0220_547:0814b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，競設方便，求安隱事覆護母身，勿為蚊虻、蛇蠍、風雨、人非人等非愛所觸，勤加修飾令離眾病、六根清淨無諸憂苦。",
        "translation": "After that thought, he contrived to find ways to protect his mother's body from unattractive things like mosquitoes, snakes, scorpions, wind, rain, and humans and non-humans, and he diligently cultivated it so that it would be free of illness and have six pure faculties free of grief and suffering.",
        "source": "T07n0220_547:0814b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以種種上妙樂具供養恭敬，而作是言：『我母慈悲生育我等，誨示一切世間事業，我等豈得不報母恩？』",
        "translation": "They also offer up various sublime implements of joy and respect, saying, 'My mother was kind and compassionate enough to give birth to us and to teach us all worldly tasks; how could we not repay her kindness?'",
        "source": "T07n0220_547:0814b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來、應、正等覺，常以種種善巧方便，護念般若波羅蜜多。",
        "translation": "Thus, the Tathāgata, the Worthy One, and the Perfectly Enlightened One always guard the mindfulness of the prajñāpāramitā with a variety of skillful means.",
        "source": "T07n0220_547:0814b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩乘善男子等，能於般若波羅蜜多書寫、受持、讀誦、修習、思惟、演說無懈倦者，如來亦以種種方便勤加護念令無損惱。",
        "translation": "If good sons and daughters of the bodhisattva vehicle can write, memorize, recite, practice, contemplate, and expound the perfection of wisdom without laziness, the Tathāgata also diligently protects and recollects it with various skillful means so that it won't harm or disturb them.",
        "source": "T07n0220_547:0814b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方現在餘世界中，一切如來、應、正等覺哀愍利樂諸有情者，亦以種種善巧方便，護念般若波羅蜜多，令諸惡魔不能毀滅，久住利樂一切世間。",
        "translation": "In the other worlds of the present and future in the ten directions, all tathāgatas, worthies, and right ascendants sympathize with and bring benefit to sentient beings and guard the prajñāpāramitā with various skillful means so that evil demons can't be destroyed and long abide for the benefit of all the world.",
        "source": "T07n0220_547:0814b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來、應、正等覺，皆以種種善巧方便，護持般若波羅蜜多。",
        "translation": "Thus, the Tathāgata, the Worthy One, and the Perfectly Enlightened One each guard the perfection of wisdom with a variety of skillful means.",
        "source": "T07n0220_547:0814b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0814b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多能生如來、應、正等覺，能正顯了一切智智，能示世間諸法實相，一切智智亦從彼生。",
        "translation": "The profound perfection of wisdom can give rise to the tathāgata, response, and correct enlightenment, can correctly reveal the cognition of all knowables, can show the true characteristics of worldly phenomena, and the cognition of all knowables arises from that.",
        "source": "T07n0220_547:0814b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_547:0814b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切過去未來現在諸佛世尊，皆依如是甚深般若波羅蜜多，精勤修學證得無上正等菩提。",
        "translation": "All the buddhas and world-honored ones of the past, future, and present have relied on such profound prajñāpāramitā and diligently cultivated it to realize unsurpassed correct enlightenment.",
        "source": "T07n0220_547:0814b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔亦依甚深般若波羅蜜多，精勤修學證得無上正等菩提。",
        "translation": "I also relied on the profound perfection of wisdom in the past to diligently cultivate and realize unsurpassed correct enlightenment.",
        "source": "T07n0220_547:0814c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故般若波羅蜜多能生如來、應、正等覺，能正顯了一切智智，能示世間諸法實相。」",
        "translation": "Therefore, the perfection of prajñā-pāramitā can give rise to tathāgatas, arhats, and correct enlightenment, can correctly reveal all wisdom, and can show the true characteristics of worldly phenomena.\"",
        "source": "T07n0220_547:0814c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「云何般若波羅蜜多能生如來、應、正等覺，能示世間諸法實相？」",
        "translation": "It was then that the good present said to the Buddha, \"How can the perfection of wisdom produce the Tathāgata, the arhat, and the correct enlightenment, and reveal the true characteristics of the world's dharmas?\"",
        "source": "T07n0220_547:0814c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多，能生如來一切智智及餘功德故，說般若波羅蜜多能生如來、應、正等覺。",
        "translation": "The Buddha told Śaṅgālī, \"Because the profound prajñāpāramitā is able to produce the tathāgata's omniscience and knowledge and other attributes, it's said that the prajñpāramitā is able to produce the tathāgata, response, and correct enlightenment.",
        "source": "T07n0220_547:0814c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能示世間諸法實相者，謂能示世間五蘊實相。」",
        "translation": "He who can show the true characteristics of worldly dharmas means he can show the true characteristics of the five aggregates of the world.\"",
        "source": "T07n0220_547:0814c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「云何般若波羅蜜多能示世間五蘊實相？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"How can the prajñāpāramitā reveal the true characteristics of the five aggregates of the world?\"",
        "source": "T07n0220_547:0814c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多能示世間色等五蘊無變壞相故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "The Buddha told Śaṅgālī, \"It's because the profound perfection of wisdom can show that the five aggregates of form and so forth in the world have no characteristics of change, and it's because the perfection of wisdom can show the true characteristics of dharmas in the world.",
        "source": "T07n0220_547:0814c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0814c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色等五蘊無自性故，說名為空、無相、無願、無造、無作、無生、無滅，即真法界非空等法可有變壞故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "It's because the five aggregates of form and so forth lack self-nature that they're called empty, markless, wishless, uncreated, unconstructed, uncreated, unarisen, and unceasing, which means that things like the true Dharma realm and nonempty are subject to change, and the prajñāpāramitā is said to reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0814c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0814c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，普能證知無量無數無邊有情施設差別故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to universally realize the immeasurable, countless, and limitless differences in the way sentient beings are defined, and it's because of that that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0814c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0814c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情心行差別故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly understand the immeasurable, countless, and limitless distinctions in the minds and actions of sentient beings, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0814c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0814c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情自性非有故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that the self-nature of measureless, innumerable, and limitless sentient beings doesn't exist, and they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0814c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0814c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情心無所住，猶如虛空無所依止故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that the minds of measureless, countless, and limitless sentient beings have no place to abide, just like space with no basis, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0814c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0814c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有略心，盡故、離故，無略心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "Relying on the perfection of wisdom, all tathāgatas, worthies, and right ascendants truly realize the abbreviated minds of measureless, countless, and limitless sentient beings, and because they are exhausted and removed, the nature of the mind is not abbreviated, it's said that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有散心，由法性故，無散心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the dissipated minds of measureless, innumerable, and limitless sentient beings, and it's because of the nature of dharmas and the absence of dissipated minds that they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸染污心，不可示故，無染心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the immeasurable, countless, and limitless defiled states of mind of sentient beings that can't be shown and the nature of undefiled minds, so they say the perfection of wisdom can show the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情不染污心，本性淨故，無雜染性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the undefiled mind of measureless, countless, and limitless sentient beings, which is inherently pure and without defiled qualities, and to teach that the perfection of wisdom reveals the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有下心，不可隱故，無下心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that the lower minds of measureless, countless, and limitless sentient beings are incomprehensible, and that the nature of lower minds doesn't exist, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有舉心，不可測故，無舉心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "Relying on the perfection of wisdom, all tathāgatas, arhats, and fully enlightened ones truly realize the immeasurable, limitless, and infinite number of raised minds of sentient beings, and because there's no nature of raised minds, they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有漏心，無自性故，無分別故，無有漏性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "Relying on the perfection of wisdom, all tathāgatas, worthies, and right ascendants truly realize that the contaminated minds of measureless, countless, and limitless sentient beings have no essence, no discrimination, and no contaminated nature, and they say that the perfection of wisdom reveals the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸無漏心，無自性故，無警覺故，非無漏性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "Relying on the perfection of wisdom, all tathāgatas, worthies, and right ascendants truly realize that the uncontaminated minds of measureless, countless, and limitless sentient beings have no essence, are not alert, and are not uncontaminated, and they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有貪心，如實之性非有貪心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the immeasurable, countless, and limitless desires of sentient beings, and because their true nature is not desire, they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815a29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸離貪心，如實之性非離貪心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the immeasurable, limitless, and infinite number of sentient beings who are free of desire, and it's because their true nature is not free of desire that they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有瞋心，如實之性非有瞋心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the immeasurable, limitless, and infinite number of sentient beings who have anger and whose true nature is not anger, and it's because of that that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸離瞋心，如實之性非離瞋心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the immeasurable, limitless, and infinite number of sentient beings who are free of anger and whose true nature is not free of anger, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有癡心，如實之性非有癡心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the deluded minds of measureless, innumerable, and limitless sentient beings, and because their true nature is not deluded, they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸離癡心，如實之性非離癡心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the countless, numerous, and limitless varieties of sentient beings who are free of deluded thought and whose true nature is not free of deluded thought, and it's because of that that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有小心，無來無去亦無繫屬，無小心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that there are countless, numerous, and limitless forms of care for sentient beings that lack coming and going, have no tethers, and are without caution, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有大心，自性平等、稱平等性，無大心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that the great minds of measureless, countless, and limitless sentient beings are equal in their own nature, are called equal in nature, and lack the nature of a great mind, so they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有狹心，無起方便、無所繫屬，無狹心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the narrow minds of measureless, countless, and limitless sentient beings, which arise from no skillful means, are unfettered, and have no nature of narrow minds, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815c03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有廣心，無增無減亦非遠離，已遠離故，無廣心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "\"All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the vast range of minds of measureless, countless, and limitless sentient beings, which neither increase nor decrease nor are isolated, and because they are isolated and lack the nature of a vast range of minds, it's said that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815c07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有量心，自性空故，非有量性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "Relying on the perfection of wisdom, all tathāgatas, worthies, and right ascendants truly realize that the measured minds of measureless, countless, and infinite sentient beings are empty in their own nature and not measured in nature, and they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815c08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815c11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸無量心，無生、無滅、無住、無異，無所依止如太虛空，非無量心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that the measureless and infinite number of sentient beings with measureless minds have no arising, no cessation, no abiding, and no difference, and have no basis like space, so it's not a measureless mind that explains the perfection of wisdom's ability to reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815c11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815c15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有見心，自性平等故，五眼不行故，非有見心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the viewable minds of measureless, innumerable, and limitless sentient beings, and because their own natures are equal, the five eyes don't function, and they aren't viewable minds, they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸無見心，無相可得故，離種種境故，非無見心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the countless, numerous, and limitless views of the nondiscriminating minds of sentient beings, to explain that the perfection of wisdom reveals the true characteristics of worldly phenomena because they have no characteristics to attain, are free of various objects, and are not nondiscriminating.",
        "source": "T07n0220_547:0815c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有對心，虛妄分別，於所緣境不自在故，非有對心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that there are an infinite number of sentient beings with opposable minds that falsely discriminate, that they aren't comfortable in their objects, and that they don't have opposable minds, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0815c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸無對心，如實無盡亦無生起，非無對心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the countless, numerous, and limitless sentient beings' lack of oppositional states of mind, which are truly inexhaustible and unarisen, and are not lacking in oppositional states of mind, so they say the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0815c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸有上心，如實之性無所思慮，非有上心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the immeasurable, countless, and infinite number of sentient beings who have superior minds, and because their true nature is beyond contemplation and not a superior mind, it's said that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0816a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸無上心，離諸戲論，少分心性亦不可得，非無上心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the unsurpassed minds of measureless, innumerable, and limitless sentient beings, which are free of conceptual elaborations and whose partial mental natures are unobtainable and not unsurpassed, so it's said that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0816a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸不定心，如實之性無等等故，非不定心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "Relying on the perfection of wisdom, all tathāgatas, worthies, and right ascendants truly know the infinite, limitless, and indeterminate minds of sentient beings, and because their true nature is unequalled and not an indeterminate mind, they say that the perfection of wisdom reveals the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0816a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情所有定心，如實之性平等平等猶若虛空，無定心性故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize the immeasurable, countless, and limitless concentrations of sentient beings, which are truly equal and homogeneous like space and lack the nature of a concentrated mind, so it's said that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0816a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情不解脫心，自性遠離故，無性為性故，非不解脫心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that the mind of measureless, countless, and limitless sentient beings is not liberated, that its own nature is isolated, that its nature is natureless, and that it's not an unliberated mind, and they say that the perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0816a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情諸解脫心，如實之性非心性故，三世推徵皆不可得，非解脫心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly know the liberation of the minds of measureless, innumerable, and limitless sentient beings, and it's because their true nature isn't mental, the three worlds are inferred to be unobtainable, and they aren't liberated minds that the perfection of wisdom is said to reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0816a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情不可見心，無自性故，不可見故，非真實故，越根境故，不可了故，非圓成故，尚非慧眼、天眼所取，況肉眼取！",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly realize that the invisible mind of measureless, countless, and limitless sentient beings has no self-nature, is invisible, is not real, transcends faculties and objects, is incomprehensible, and is not perfectly formed, and is not yet grasped by the eye of wisdom or the divine eye, so why should it be grasped by the physical eye?",
        "source": "T07n0220_547:0816a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切眼皆不能見名不可見，此不可見亦不可得故，不可說不可見心故，說般若波羅蜜多能示世間諸法實相。",
        "translation": "Because all eyes can't see what's called invisible, and because this invisibility is also unobtainable, it's not possible to say that the mind can't be seen, and therefore the prajñāpāramitā can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0816b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good present!",
        "source": "T07n0220_547:0816b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多能示如來、應、正等覺世間實相。",
        "translation": "The profound perfection of wisdom can reveal the true characteristics of the Tathāgata, Arhat, and Fully Awakened One in the world.",
        "source": "T07n0220_547:0816b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情若出若沒。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to accurately realize the innumerable, limitless, and infinite number of sentient beings who arise and disappear.",
        "source": "T07n0220_547:0816b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_547:0816b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情若出若沒？",
        "translation": "How do all tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly know the infinite, countless, and unlimited number of sentient beings that arise and disappear?",
        "source": "T07n0220_547:0816b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情心、心所法，皆依色、受、想、行、識生；如是如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情若出若沒。",
        "translation": "It means that Tathāgatas, Arhats, and Fully Awakened Ones all rely on the perfection of wisdom to truly realize that the minds and mental factors of measureless, innumerable, and limitless sentient beings all arise based on form, feeling, perception, volition, and consciousness; thus, Tathāgatas, Arhats, and Fully Awakened Ones all rely on the perfection of wisdom to truly realize that measureless, innumerable, and limitless sentient beings are produced and disappeared.",
        "source": "T07n0220_547:0816b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_547:0816b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何諸有情類心、心所法若出若沒，皆依色、受、想、行、識生？",
        "translation": "\"How do the minds and mental factors of all sentient beings that arise or perish depend on form, feeling, perception, volition, and consciousness?",
        "source": "T07n0220_547:0816b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸有情心、心所法，或有依色、受、想、行、識，執如來死後或有、或非有、或亦有亦非有、或非有非非有，此是諦實餘皆愚妄；或有依色、受、想、行、識，執我及世間或常、或無常、或亦常亦無常、或非常非無常，此是諦實餘皆愚妄；或有依色、受、想、行、識，執我及世間或有邊、或無邊、或亦有邊亦無邊、或非有邊非無邊，此是諦實餘皆愚妄；或有依色、受、想、行、識，執命者即身或復異身，此是諦實餘皆愚妄。",
        "translation": "謂諸有情心、心所法，或有依色、受、想、行、識，執如來死後或有、或非有、或亦有亦非有、或非有非非有，此是諦實餘皆愚妄；或有依色、受、想、行、識，執我及世間或常、或無常、或亦常亦無常、或非常非無常，此是諦實餘皆愚妄；或有依色、受、想、行、識，執我及世間或有邊、或無邊、或亦有邊亦無邊、或非有邊非無邊，此是諦實餘皆愚妄；或有依色、受、想、行、識，執命者即身或復異身，此是諦實餘皆愚妄。",
        "source": "T07n0220_547:0816b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good present!",
        "source": "T07n0220_547:0816b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情心、心所法若出若沒，皆依色、受、想、行、識生差別之想。",
        "translation": "Relying on the perfection of wisdom, all tathāgatas, worthies, and right ascendants truly realize that the mind and mental factors of sentient beings of measureless, countless, and limitless variety, whether emerging or disappearing, are based on the conceptions of form, feeling, perception, volition, and consciousness.",
        "source": "T07n0220_547:0816b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0816b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情若出若沒。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to accurately realize the innumerable, limitless, and infinite number of sentient beings who arise and disappear.",
        "source": "T07n0220_547:0816b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_547:0816b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何一切如來、應、正等覺皆依般若波羅蜜多，如實證知無量無數無邊有情若出若沒？",
        "translation": "How do all tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly know the infinite, countless, and unlimited number of sentient beings that arise and disappear?",
        "source": "T07n0220_547:0816b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸如來、應、正等覺皆依般若波羅蜜多，如實知色、受、想、行、識皆如真如無二無別。",
        "translation": "It means that all tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly know that form, feeling, perception, volition, and consciousness are all as they really are, without duality or distinction.",
        "source": "T07n0220_547:0816c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_547:0816c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來真如即五蘊真如，五蘊真如即世間真如。",
        "translation": "The Tathāgata's true thusness is the true thusness of the five aggregates, and the true thusness of the five aggregates is the true thusness of the world.",
        "source": "T07n0220_547:0816c04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0816c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如世尊說，依止五蘊立世間名。",
        "translation": "As the Bhagavān explains, the five aggregates are relied upon to create worldly names.",
        "source": "T07n0220_547:0816c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T07n0220_547:0816c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五蘊真如即世間真如，世間真如即預流果真如，預流果真如即一來果真如，展轉乃至一切菩薩摩訶薩行真如即諸佛無上正等菩提真如，諸佛無上正等菩提真如即一切如來、應、正等覺真如，一切如來、應、正等覺真如即一切有情真如。",
        "translation": "The true nature of the five aggregates is the worldly true nature, the worldly true nature is the true nature of the fruit of pre-flow, the true nature of the fruit of pre-flow is the true nature of the fruit of once-returning, the true nature of all bodhisattva-mahāsattva practices is the true nature of the unsurpassed correct enlightenment of the buddhas, the true nature of the unsurpassed correct enlightenment of the buddhas is the true nature of all tathāgatas, arhats, and completely enlightened beings, and the true nature of all tathāgatas, arhats, and completely enlightened beings is the true nature of all sentient beings.",
        "source": "T07n0220_547:0816c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_547:0816c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切如來、應、正等覺真如，若一切有情真如，若一切法真如，如是真如皆不相離，非一、非異、非一異故，無盡、無二亦無二分，不可分別。",
        "translation": "\"If all tathāgatas, arhats, and fully enlightened truly are, if all sentient beings truly are, and if all things truly are, such truly are not separate, not one, not different, not one and the same, and therefore are not exhaustive, not two, and not dichotomous, and cannot be discriminated.",
        "source": "T07n0220_547:0816c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_547:0816c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，證一切法真如究竟乃得無上正等菩提。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to realize the true reality of all things and then attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_547:0816c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由斯故說甚深般若波羅蜜多能生諸佛，是諸佛母，能示諸佛世間實相。",
        "translation": "Because of this, it's said that the profound perfection of wisdom can give rise to buddhas, which are the mothers of buddhas and can reveal the true characteristics of the buddha world.",
        "source": "T07n0220_547:0816c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well understand this!",
        "source": "T07n0220_547:0816c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，能如實覺諸法真如、不虛妄性、不變異性。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the perfection of wisdom to truly perceive the true, not false, and unchanging nature of things.",
        "source": "T07n0220_547:0816c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如實覺真如相故，說名如來、應、正等覺。」",
        "translation": "Because they truly perceive their true nature, they're called tathāgatas, arhats, and completely enlightened people.\"",
        "source": "T07n0220_547:0816c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「甚深般若波羅蜜多所證真如、不虛妄性、不變異性，極為甚深，難見難覺。",
        "translation": "It was then that the good present then said to the Buddha, \"The true nature, non-falsity, and unchanging difference in nature realized by the profound prajñāpāramitā is extremely profound and difficult to see and difficult to realize.",
        "source": "T07n0220_547:0816c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺，皆用真如顯示分別諸佛無上正等菩提。",
        "translation": "All tathāgatas, arhats, and right ascendants use true reality to show and discern the buddhas' unsurpassed correct enlightenment.",
        "source": "T07n0220_547:0816c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是真如甚深甚妙，誰能信解？",
        "translation": "Who can believe and understand such a profound and subtle form of true thusness?",
        "source": "T07n0220_547:0816c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有不退轉菩薩摩訶薩，及諸願滿大阿羅漢，并具正見善男子等，聞佛說此甚深真如能生信解。",
        "translation": "Only nonretrogressing bodhisattvas, great arhats who have fulfilled their vows, and good sons and daughters with right views hear the Buddha teach this profound truth and are able to give rise to faith and understanding.",
        "source": "T07n0220_547:0816c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來為彼，依自所證真如之相顯示分別。」",
        "translation": "For them, the Tathāgata shows and discerns the true reality based on the characteristics of that which he has realized.\"",
        "source": "T07n0220_547:0816c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told the good manifestation, \"So it is!",
        "source": "T07n0220_547:0817a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0817a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_547:0817a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0817a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如無盡是故甚深，唯有如來現等正覺無盡真如甚深之相，為諸菩薩摩訶薩眾宣說開示令生信解。」",
        "translation": "Truly, truly is inexhaustible; therefore, it's extremely profound; only the Tathāgata demonstrates the extremely profound character of the truly inexhaustible true enlightenment and explains and reveals it for the benefit of all the bodhisattvas, Mahāsattvas, and causes them to believe and understand it.\"",
        "source": "T07n0220_547:0817a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋將領欲界十千天子，大梵天王將領色界二萬天子，俱詣佛所，頂禮雙足，却住一面，同白佛言：「如來所說諸甚深法，以何為相？」",
        "translation": "At the time, the god Indra led 10,000 sons of gods in the desire realm and the king of Brahmā led 20,000 sons of gods in the form realm, and they both went to the Buddha, bowed their heads at their feet, withdrew to one side, and said to him, \"What are the characteristics of the profound dharmas that the Tathāgata teaches?\"",
        "source": "T07n0220_547:0817a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸天子言：「我所說法，以空、無相、無願、無造、無生、無滅、寂滅、涅槃、法界為相。",
        "translation": "It was then that the Buddha addressed the celestials, \"My teaching is based on emptiness, signlessness, wishlessness, uncreatedness, nonarising, nonceasing, tranquility, nirvāṇa, and the Dharma realm as its characteristics.",
        "source": "T07n0220_547:0817a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0817a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所說法無所依止，譬如虛空不可表示。",
        "translation": "The teaching of the Buddha has no basis, like space that's inexpressible.",
        "source": "T07n0220_547:0817a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "\"You must know, Son of God!",
        "source": "T07n0220_547:0817a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所說甚深法相，不墮色數，亦不墮受、想、行、識數；不依於色，亦復不依受、想、行、識。",
        "translation": "The Tathāgata teaches the profound character of the Dharma, which doesn't fall into the category of form, nor does it fall into the category of feeling, perception, volition, and consciousness; it doesn't rely on form, nor does it rely on feeling, perception, volition, or consciousness.",
        "source": "T07n0220_547:0817a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子當知！",
        "translation": "Son of God, you should know!",
        "source": "T07n0220_547:0817a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所說甚深法相，世間天、人、阿素洛等不能安立亦不能壞。",
        "translation": "The profound characteristics of the Dharma as explained by the Tathāgata cannot be posited or destroyed by worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_547:0817a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0817a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間天、人、阿素洛等皆是相故，諸有相者於無相相不能安立亦不能壞。",
        "translation": "Because the worldly gods, humans, and asuras are all marks, those who have marks can't be established or destroyed in the markless realm.",
        "source": "T07n0220_547:0817a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You must know, Prince of the gods!",
        "source": "T07n0220_547:0817a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所說甚深法相，不可以手安立破壞，亦不可以所餘諸法安立破壞。",
        "translation": "The Tathāgata teaches the profound character of the Dharma, which can't be posited and destroyed by the hand, nor can it be posited and destroyed by any other dharma.",
        "source": "T07n0220_547:0817a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "\"You must know, my lord!",
        "source": "T07n0220_547:0817a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有是問：『誰立虛空？",
        "translation": "Suppose you were to ask, 'Who established space?'",
        "source": "T07n0220_547:0817a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰復能壞？』",
        "translation": "Who can destroy it?'",
        "source": "T07n0220_547:0817a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是問者為正問耶？」",
        "translation": "Is this the right question to ask?\"",
        "source": "T07n0220_547:0817a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子言：「彼非正問。",
        "translation": "The celestials said, \"That's not the right question.",
        "source": "T07n0220_547:0817a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0817a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無體、無相、無為，不可安立、不可壞故。」",
        "translation": "Space has no body, no form, and no being, so it can't be posited and can't be destroyed.\"",
        "source": "T07n0220_547:0817a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸天子言：「如是！",
        "translation": "It was then that the Buddha addressed the celestials, saying, \"So it is!",
        "source": "T07n0220_547:0817a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0817a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_547:0817a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You must know, Prince of Heaven!",
        "source": "T07n0220_547:0817a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我所宣說甚深法相亦復如是，不可安立、不可破壞。",
        "translation": "This is likewise the profound dharma-character I've explained, which cannot be posited or destroyed.",
        "source": "T07n0220_547:0817a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛無佛法界法爾，佛於此相如實覺知，故名如來、應、正等覺。」",
        "translation": "Whether there's a buddha or no buddha, the Dharma realm is truly this, and the buddhas truly perceive this characteristic; therefore, they're called tathāgatas, arhats, and completely enlightened.\"",
        "source": "T07n0220_547:0817a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸天子復白佛言：「如來所覺如是諸相，極為甚深、難見、難覺。",
        "translation": "The celestials then again said to the Buddha, \"Such characteristics as those perceived by the Tathāgata are extremely profound, difficult to see, and difficult to apprehend.",
        "source": "T07n0220_547:0817a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來現覺如是相故，於一切法無礙智轉。",
        "translation": "Because the Tathāgata perceives such characteristics in the present, his knowledge of all things is unimpeded and transformative.",
        "source": "T07n0220_547:0817a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺住如是相，分別開示甚深般若波羅蜜多，為諸有情集諸法相方便開示，令於般若波羅蜜多得無礙智。",
        "translation": "All tathāgatas, worthies, and right ascendants abide in such characteristics, discern and reveal the profound perfection of wisdom, and gather the characteristics of all things for sentient beings to skillfully reveal them, so that they'll attain unhindered knowledge in the perfection of wisdom.",
        "source": "T07n0220_547:0817a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多是諸如來常所行處，一切如來行是處故，證得無上正等菩提，為諸有情分別開示。」",
        "translation": "The profound prajñāpāramitā is the constant locus of practice of the tathāgatas, and because all tathāgatas practice this locus, they realize unsurpassed correct perfect enlightenment and are shown separately for sentient beings.\"",
        "source": "T07n0220_547:0817b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸天子言：「如是！",
        "translation": "It was then that the Buddha addressed the celestials, saying, \"So it is!",
        "source": "T07n0220_547:0817b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0817b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_547:0817b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You must know, Prince of Heaven!",
        "source": "T07n0220_547:0817b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法相如來如實覺為無相。",
        "translation": "The Tathāgata who truly understands the characteristics of all things as they are has no characteristics.",
        "source": "T07n0220_547:0817b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，我說諸佛得無礙智，無與等者。」",
        "translation": "Because of this, I say that the buddhas attain unhindered cognition, and there's no equal.\"",
        "source": "T07n0220_547:0817b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告具壽善現：「甚深般若波羅蜜多是諸佛母，能示世間諸法實相。",
        "translation": "It was then that the Buddha addressed Kauśāmbī, \"The profound perfection of wisdom is the mother of all buddhas and can show the true characteristics of dharmas in the world.",
        "source": "T07n0220_547:0817b06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故如來、應、正等覺依法而住，供養恭敬、尊重讚歎、攝受、護持所依住法，此法即是甚深般若波羅蜜多。",
        "translation": "Therefore, the Tathāgata, Arhat, and Completely Awakened One abides according to the Dharma, making offerings, honoring, praising, accepting, and safeguarding the Dharma on which they stand, which is the profound perfection of wisdom.",
        "source": "T07n0220_547:0817b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺，無不依止甚深般若波羅蜜多，供養恭敬、尊重讚歎、攝受、護持。",
        "translation": "All Tathāgatas, Arhats, and Fully Awakened Ones invariably rely on the profound prajñāpāramitā to offer support, honor, praise, collect, accept, and safeguard it.",
        "source": "T07n0220_547:0817b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0817b12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多能生諸佛，能與諸佛作依止處，能示世間諸法實相。",
        "translation": "The profound perfection of wisdom can give rise to buddhas, can make buddhas their support, and can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0817b12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_547:0817b14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺，是知恩者、能報恩者。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones are those who know and are able to repay kindness.",
        "source": "T07n0220_547:0817b14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有問言：『誰是知恩、能報恩者？』",
        "translation": "If someone asks, 'Who is the one who knows and can repay kindness?'",
        "source": "T07n0220_547:0817b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應正答言：『佛是知恩、能報恩者。』",
        "translation": "You should correctly answer, 'The Buddha is someone who knows and can repay kindness.'",
        "source": "T07n0220_547:0817b16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0817b17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世間知恩、報恩無過佛故。」",
        "translation": "There's no one in the world who knows and repays kindnesses more than the Buddha.\"",
        "source": "T07n0220_547:0817b17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「云何如來、應、正等覺知恩、報恩？」",
        "translation": "The Kauśāmbī then said to the Buddha, \"How do tathāgatas, arhats, and virtually all enlightened ones know and repay kindness?\"",
        "source": "T07n0220_547:0817b17_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「一切如來、應、正等覺，乘如是乘、行如是道，來至無上正等菩提。",
        "translation": "The Buddha told Śaṅgālī, \"All tathāgatas, arhats, and right ascendants ride this vehicle and practice this path to unsurpassed perfect enlightenment.",
        "source": "T07n0220_547:0817b19_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得菩提已，於一切時供養恭敬、尊重讚歎、攝受、護持是乘是道曾無暫廢，此乘此道當知即是甚深般若波羅蜜多。",
        "translation": "After attaining enlightenment, at all times they will make offerings, respect, praise, accept, and defend this vehicle and this path without ever being inactive, and this vehicle and this path should be known as the profound perfection of wisdom.",
        "source": "T07n0220_547:0817b20_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名如來、應、正等覺知恩、報恩。",
        "translation": "This is called the Tathāgata, Worthy, and Completely Enlightened One who knows and repays kindness.",
        "source": "T07n0220_547:0817b23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0817b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺無不皆依甚深般若波羅蜜多，覺一切法無實作用，以能作者無所有故。",
        "translation": "\"All tathāgatas, associates, and right ascendants invariably rely on the profound perfection of wisdom and realize that all things have no real function because their authors lack [sentient beings].",
        "source": "T07n0220_547:0817b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺無不皆依甚深般若波羅蜜多，覺一切法無所成辦，以諸形質不可得故。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones invariably rely on the profound perfection of wisdom and realize that all things lack accomplishment because their form and substance are unobtainable.",
        "source": "T07n0220_547:0817b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this, good present!",
        "source": "T07n0220_547:0817b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸如來、應、正等覺知依如是甚深般若波羅蜜多，覺一切法皆無作用、無所成辦，於一切時供養恭敬、尊重讚歎、攝受、護持曾無間斷，故名真實知恩、報恩。",
        "translation": "Because the Tathāgatas, Arhats, and Fully Awakened Ones know that based on such profound prajñāpāramitā, they realize that all things have no function and nothing to accomplish, and they make offerings, honor, praise, accept, and protect them at all times without interruption, that's called truly knowing and repaying kindness.",
        "source": "T07n0220_547:0817b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0817c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺無不皆依甚深般若波羅蜜多，於一切法無作、無成、無生智轉，復能知此無轉因緣。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones invariably rely on the profound perfection of wisdom, which is the knowledge that all things are uncreated, unaccomplished, and unarisen, and that they can also know these uncreated causes and conditions.",
        "source": "T07n0220_547:0817c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故應知甚深般若波羅蜜多能生如來、應、正等覺，亦能如實示世間相。」",
        "translation": "Therefore, you should know that the profound perfection of wisdom can give rise to the Tathāgata, Arhat, and Fully Awakened One, and it can truly reveal worldly characteristics.\"",
        "source": "T07n0220_547:0817c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「如來常說一切法性無生、無起、無知、無見。",
        "translation": "It was then that the good present then said to the Buddha, \"The Tathāgata always says that the nature of all things is unarisen, unarisen, unknowable, and invisible.",
        "source": "T07n0220_547:0817c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如何可說甚深般若波羅蜜多能生如來、應、正等覺，亦能如實示世間相？」",
        "translation": "How can it be said that the profound perfection of wisdom can give rise to the Tathāgata, the Arhat, and the Completely Awakened One, and can also truly reveal worldly appearances?\"",
        "source": "T07n0220_547:0817c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「善哉！",
        "translation": "The Buddha told Śubhavyūha, \"Good!",
        "source": "T07n0220_547:0817c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_547:0817c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能問如來如是深義。",
        "translation": "He can ask the Tathāgata about such a profound meaning.",
        "source": "T07n0220_547:0817c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0817c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0817c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "\"As you've said.",
        "source": "T07n0220_547:0817c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法性無生、無起、無知、無見；依世俗說，甚深般若波羅蜜多能生如來、應、正等覺，亦能如實示世間相。",
        "translation": "'The nature of all dharmas is unarisen, unarisen, unknowable, and invisible; according to secular teaching, the profound perfection of wisdom can give rise to tathāgatas, arhats, and correct enlightenment, and it can accurately reveal worldly appearances.'",
        "source": "T07n0220_547:0817c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T07n0220_547:0817c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何一切法性無生、無起、無知、無見？",
        "translation": "\"How are all dharmas unarisen, unarisen, unknowable, and invisible?",
        "source": "T07n0220_547:0817c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法空、無所有、無所依止、無所繫屬，由此因緣，無生、無起、無知、無見。",
        "translation": "Because all things are empty, lack existence, have no support, and are not tied down, this is the cause and condition for their not being produced, not arising, not knowing, and not seeing.",
        "source": "T07n0220_547:0817c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_547:0817c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多雖能生佛示世間相，而無所生亦無所示。",
        "translation": "Although the profound perfection of wisdom can produce buddhas and show worldly appearances, nothing is produced and nothing is shown.",
        "source": "T07n0220_547:0817c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_547:0817c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多不見色故名示色相，不見受、想、行、識故名示受、想、行、識相。",
        "translation": "The profound prajñāpāramitā doesn't see form so it's called showing the characteristics of form, and it doesn't see feeling, perception, volition, and consciousness so it's called showing the characteristics of feeling, perception, volition, and consciousness.",
        "source": "T07n0220_547:0817c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，甚深般若波羅蜜多能示世間諸法實相。」",
        "translation": "Because of this meaning, the profound prajñāpāramitā can show the true characteristics of worldly phenomena.\"",
        "source": "T07n0220_547:0817c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「云何如是甚深般若波羅蜜多不見色故名示色相，不見受、想、行、識故名示受、想、行、識相？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"How is it that the profound prajñāpāramitā doesn't see form and therefore is called showing the characteristics of form and doesn't see feeling, perception, volition, and consciousness and therefore is called showing the characteristics of feeling, perception, volition, and consciousness?\"",
        "source": "T07n0220_547:0817c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多由不緣色而起於識，是為不見色故名示色相；不緣受、想、行、識而起於識，是為不見受、想、行、識故名示受、想、行、識相。",
        "translation": "The Buddha told Śaṃnara, \"The profound prajñāpāramitā arises from consciousness without focusing on form, which is called showing the characteristics of form because it doesn't see form; it arises from consciousness without focusing on feeling, perception, volition, and consciousness, which is called showing the characteristics of feeling, perception, volition, and consciousness because it doesn't see feeling, perception, volition, and consciousness.",
        "source": "T07n0220_547:0817c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，甚深般若波羅蜜多能示世間諸法實相。",
        "translation": "For this reason, the profound perfection of wisdom can reveal the true characteristics of worldly phenomena.",
        "source": "T07n0220_547:0817c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0817c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多能示如來、應、正等覺世間空故、世間遠離故、世間清淨故、世間寂靜故，說名能示世間實相。",
        "translation": "The profound perfection of wisdom is said to be able to show the true characteristics of the world because the Tathāgata, Arhat, and Fully Awakened One are empty, the world is free, the world is pure, and the world is tranquil.",
        "source": "T07n0220_547:0817c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0818a02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以空、遠離、清淨、寂靜，是諸世間如實相故。」",
        "translation": "Because emptiness, detachment, purity, and quiescence are the true characteristics of the world,\"",
        "source": "T07n0220_547:0818a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四分不思議等品第十三",
        "translation": "(4) Thirteenth Chapter of the Inconceivable, Etc.",
        "source": "T07n0220_547:0818a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現便白佛言：「世尊！",
        "translation": "It was then that Kauśāmbī Sunbeam said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_547:0818a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多為大事故出現世間，為不可思議事故出現世間，為不可稱量事故出現世間，為無數量事故出現世間，為無等等事故出現世間。」",
        "translation": "The profound perfection of wisdom appears in the world as a great occurrence, as an unfathomable occurrence, as an incalculable occurrence, as an incalculable occurrence, as an incalculable occurrence, and as an incalculable occurrence.\"",
        "source": "T07n0220_547:0818a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_547:0818a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_547:0818a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_547:0818a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well-presented!",
        "source": "T07n0220_547:0818a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何甚深般若波羅蜜多為大事故出現世間？",
        "translation": "How does the profound perfection of wisdom appear in the world as a great event?",
        "source": "T07n0220_547:0818a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸如來、應、正等覺，皆以濟拔一切有情，無時暫捨而為大事，甚深般若波羅蜜多為此事故出現世間。",
        "translation": "It means that all tathāgatas, arhats, and fully enlightened ones aim to save all sentient beings, and they make it a point to abandon them for a while, so the profound perfection of wisdom appears in the world for that reason.",
        "source": "T07n0220_547:0818a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Tathāgata!",
        "source": "T07n0220_547:0818a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何甚深般若波羅蜜多為不可思議事故、不可稱量事故、無數量事故、無等等事故出現世間？",
        "translation": "How do the profound perfections of wisdom appear in the world as inconceivable events, incalculable events, incalculable events, and incalculable events?",
        "source": "T07n0220_547:0818a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸如來、應、正等覺所有佛性、如來性、自然覺性、一切智性，皆不可思議、不可稱量、無數量、無等等，甚深般若波羅蜜多為此事故出現世間。」",
        "translation": "It means that all buddha-natures, tathāgatas, naturally enlightened natures, and the nature of all cognition of tathāgatas, deserving, and perfectly enlightened ones are inconceivable, immeasurable, without number, and without equal, and the profound prajñāpāramitā appears in the world for this reason.\"",
        "source": "T07n0220_547:0818a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「為但如來、應、正等覺所有佛性、如來性、自然覺性、一切智性不可思議、不可稱量、無數量、無等等，為色、受、想、行、識乃至一切法亦不可思議、不可稱量、無數量、無等等？」",
        "translation": "It was then that the good manifestation again said to the Buddha, \"Could it be that the buddha-nature, tathāgata-nature, naturally enlightened nature, and omniscience of the Tathāgata, Arhat, and Completely Awakened One are inconceivable, immeasurable, without number, and without equal, and that form, feeling, perception, volition, consciousness, and even all dharmas are also inconceivable, immeasurable, without number, and without equal?\"",
        "source": "T07n0220_547:0818a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「非但如來、應、正等覺所有佛性、如來性、自然覺性、一切智性不可思議、不可稱量、無數量、無等等，色、受、想、行、識乃至一切法亦不可思議、不可稱量、無數量、無等等。",
        "translation": "The Buddha told Śaṅgālī, \"Not only is the buddha-nature, tathāgata-nature, naturally enlightened nature, and nature of omniscience of the Tathāgata, Worthy, and Completely Enlightened One unfathomable, immeasurable, incalculable, and without equal, but form, feeling, perception, volition, and consciousness and even all things are also unfathomable, immeasurable, incalculable, and without equal.",
        "source": "T07n0220_547:0818a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0818a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法真實性中，心及心所皆不可得。",
        "translation": "\"In the true nature of all things, neither mind nor mental objects are obtainable.",
        "source": "T07n0220_547:0818a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_547:0818a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所有色、受、想、行、識及一切法皆不可施設故，不可思議、不可稱量、無數量、無等等。",
        "translation": "\"All form, feeling, perception, volition, consciousness, and all dharmas are inconceivable, immeasurable, without number, and without equal because they can't be imagined.",
        "source": "T07n0220_547:0818a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0818b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法無自性故、不可得故、自性空故。",
        "translation": "Thus, all dharmas lack self-nature, are unobtainable, and are empty of self-nature.",
        "source": "T07n0220_547:0818b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0818b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所有色、受、想、行、識及一切法皆不可得故，不可思議、不可稱量、無數量、無等等。",
        "translation": "All form, feeling, perception, volition, consciousness, and all dharmas are inconceivable, immeasurable, incalculable, without number, and without equal.",
        "source": "T07n0220_547:0818b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_547:0818b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法無限量故、無所有故、自性空故。",
        "translation": "Thus, the dharmas are limitless, nonexistent, and empty of their own nature.",
        "source": "T07n0220_547:0818b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_547:0818b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所有色、受、想、行、識及一切法皆無限量故，不可思議、不可稱量、無數量、無等等。」",
        "translation": "It's because all form, feeling, perception, volition, consciousness, and all dharmas are without limit and are unfathomable, immeasurable, without number, and without equal.\"",
        "source": "T07n0220_547:0818b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「何因緣故，所有諸色、受、想、行、識及一切法皆無限量？」",
        "translation": "The Gautama Good Seer then said to the Buddha, \"What are the causes and conditions that make all forms, feelings, perceptions, volitions, consciousnesses, and all dharmas without limit?\"",
        "source": "T07n0220_547:0818b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha addressed the Śākyamuni, \"What do you think?",
        "source": "T07n0220_547:0818b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空為有心、心所法能限量不？」",
        "translation": "Is there any limit to the amount of mind and mental factors that exist in space?\"",
        "source": "T07n0220_547:0818b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T07n0220_547:0818b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T07n0220_547:0818b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸所有色、受、想、行、識及一切法亦復如是，自性空故，心、心所法不能限量。",
        "translation": "The Buddha told Śaṅgālī, \"So it is with all form, feeling, perception, volition, consciousness, and all things, for their own nature is empty, and their minds and mental factors cannot be delimited.",
        "source": "T07n0220_547:0818b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，諸所有色、受、想、行、識及一切法無限量故，皆不可思議、不可稱量、無數量、無等等。",
        "translation": "As a result, all form, feeling, perception, volition, consciousness, and all dharmas have no limit and are therefore unfathomable, immeasurable, without number, and without equal.",
        "source": "T07n0220_547:0818b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_547:0818b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法皆不可思議、不可稱量、無數量、無等等故，一切如來、應、正等覺所有佛法、如來法、自然覺法、一切智法亦不可思議、不可稱量、無數量、無等等。",
        "translation": "Because all things are inconceivable, immeasurable, incalculable, and without equal, all the Tathāgatas, Arhats, and Fully Awakened Ones and all their buddha-teachings, tathāgata-teachings, naturally enlightened-teachings, and omniscient-teachings are also inconceivable, immeasurable, incalculable, and without equal.",
        "source": "T07n0220_547:0818b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know it well!",
        "source": "T07n0220_547:0818b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法皆不可思議，思議滅故；不可稱量，稱量滅故；無數量，數量滅故；無等等，等等滅故。",
        "translation": "Such things are inconceivable, which causes deliberation to cease; immeasurable, which causes deliberation to cease; without number, which causes number to cease; and without equal, which causes equal to cease.",
        "source": "T07n0220_547:0818b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well understand!",
        "source": "T07n0220_547:0818b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法皆不可思議，過思議故；不可稱量，過稱量故；無數量，過數量故；無等等，過等等故。",
        "translation": "Such things are inconceivable, which is why they're beyond deliberation; immeasurable, which is why they're beyond measurement; without number, which is why they're beyond number; and without equal, which is why they're beyond equal.",
        "source": "T07n0220_547:0818b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well understand!",
        "source": "T07n0220_547:0818b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可思議、不可稱量、無數量、無等等者，但有增語都無真實。",
        "translation": "Whatever is inconceivable, immeasurable, immeasurable, incalculable, and so forth, whatever is added to it is not true.",
        "source": "T07n0220_547:0818b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_547:0818b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可思議、不可稱量、無數量、無等等者，皆如虛空都無所有。",
        "translation": "\"They are unfathomable, immeasurable, incalculable, without number, and without equal, and they are all like space without any existence.",
        "source": "T07n0220_547:0818b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，一切如來、應、正等覺所有佛法、如來法、自然覺法、一切智法皆不可思議、不可稱量、無數量、無等等，聲聞、獨覺、世間天、人、阿素洛等皆悉不能思議、稱量、數量、等等此諸法故。」",
        "translation": "As a result, all the Tathāgatas, Arhats, and Fully Awakened Ones and all their buddha-teachings, tathāgata-teachings, naturally enlightened-teachings, and omniscience-teachings are inconceivable, immeasurable, incalculable, and without equal, and none of the śrāvakas, solitary realizers, worldly gods, humans, or asuras can conceive of, measure, number, or equal such things.\"",
        "source": "T07n0220_547:0818b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是不可思議、不可稱量、無數量、無等等法時，眾中有五百苾芻、二千苾芻尼不受諸漏心得解脫，復有六十鄔波索迦、三十鄔波斯迦於諸法中遠塵離垢生淨法眼，復有二萬菩薩摩訶薩得無生法忍，世尊記彼於賢劫中得受無上正等菩提不退轉記；即前所說鄔波索迦、鄔波斯迦於諸法中遠塵離垢生淨法眼者，佛亦記彼不久當證永盡諸漏心慧解脫。",
        "translation": "When the Buddha spoke about such inconceivable, immeasurable, incalculable, and incalculable qualities, there were 500 bhikṣus and 2,000 bhikṣuṇīs among the congregation who didn't experience liberation through mind without contaminants, 60 upāsaka and 30 upāsikā who became pure in the Dharma eye, and 20,000 bodhisattvas and mahāsattvas who attained the forbearance of the nonarising dharma, and the Bhagavān recorded that they had attained the unsurpassed, correct, and irreversible mark of enlightenment during the good eon; that is, the aforementioned upāsaka and upāsikā who attained the pure Dharma eye in the Dharma eye free from dust and dirt, and the Buddha also recorded that they would soon realize the liberation of mind and wisdom that permanently ends the contaminants.",
        "source": "T07n0220_547:0818c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大般若波羅蜜多經卷第五百四十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 547",
        "source": "T07n0220_547:0818c09_6",
        "is_bad_quality": false
    }
]