[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 409",
        "source": "T07n0220_493:0505b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三",
        "translation": "thirteen",
        "source": "T07n0220_493:0505b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_493:0505b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分善現品第三之十二",
        "translation": "Third Part of the Third Decade of Good Presentations",
        "source": "T07n0220_493:0505b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "At that point, Kauśāmbī said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_493:0505b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言大乘，大乘者普超一切世間天、人、阿素洛等最尊最勝，如是大乘與虛空等，譬如虛空普能容受無量無數無邊有情，大乘亦爾，普能容受無量無數無邊有情。",
        "translation": "Speaking of the great vehicle, the great vehicle universally transcends all worldly gods, humans, asuras, and so forth, and is the most honored and most superior; thus, the great vehicle and space are the same, just as space can universally accommodate measureless, countless, and limitless sentient beings, so too can the great vehicle universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0505b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如虛空無來無去無住可見，大乘亦爾，無來無去無住可見。",
        "translation": "Also, just as empty space has no coming or going and no abiding visible, so too does the great vehicle have no coming or going and no abiding visible.",
        "source": "T07n0220_493:0505b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如虛空，前、後、中際皆不可得，大乘亦爾，前、後、中際皆不可得。",
        "translation": "Also, just as space is inaccessible from before, after, and in the middle, so is the great vehicle, which is inaccessible from before, after, and in the middle.",
        "source": "T07n0220_493:0505b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是大乘最尊最勝與虛空等，多所容受、無動、無住，三世平等超過三世，故名大乘。」",
        "translation": "Thus, the great vehicle is most honored, most excellent, equal to space, tolerant of much, unmoving, unstable, and equal in all three worlds, and it's called the great vehicle because it transcends the three worlds.\"",
        "source": "T07n0220_493:0505b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_493:0505b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_493:0505b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "\"As you've said.",
        "source": "T07n0220_493:0505b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩大乘具如是等無邊功德。",
        "translation": "The bodhisattva's great vehicle possesses such limitless merit.",
        "source": "T07n0220_493:0505b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know it well!",
        "source": "T07n0220_493:0505b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩大乘者，即是六種波羅蜜多，所謂布施波羅蜜多乃至般若波羅蜜多。",
        "translation": "The great vehicle of the bodhisattvas, the great vehicle, is the six kinds of perfections, which are called the perfection of generosity and even the perfection of wisdom.",
        "source": "T07n0220_493:0505b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0505b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩大乘者，謂內空、外空、內外空、大空、空空、勝義空、有為空、無為空、畢竟空、無際空、無散空、本性空、自相空、一切法空、無性空、無性自性空。",
        "translation": "The bodhisattvas, mahāsattvas, and great vehicle are internal emptiness, external emptiness, internal and external emptiness, great emptiness, emptiness of emptiness, ultimate emptiness, emptiness without limit, emptiness without distraction, emptiness of original nature, emptiness of self-nature, emptiness of all things, emptiness without nature, and emptiness of self-nature without nature.",
        "source": "T07n0220_493:0505b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0505c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩大乘者，即是一切陀羅尼門，所謂文字陀羅尼等無量無數陀羅尼門。",
        "translation": "\"The bodhisattvas, the great vehicle, is the gate of all dhāraṇīs, which are called the incalculable and countless dhāraṇīs like the literal dhāraṇīs.",
        "source": "T07n0220_493:0505c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0505c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩大乘者，即是一切三摩地門，所謂健行三摩地等無量無數三摩地門。",
        "translation": "The bodhisattvas, the great vehicle, is the gate of all the samādhis, which are called the incalculable and countless gates of samādhi such as the practice of vigorous samādhi.",
        "source": "T07n0220_493:0505c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0505c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩大乘者，謂三十七菩提分法、三解脫門，廣說乃至十八佛不共法等無量無邊殊勝功德，當知皆是菩薩大乘。",
        "translation": "The bodhisattvas, the great vehicle, which refers to the 37 factors of enlightenment, the three gates of liberation, and the extensive explanation up to the 18 distinctive characteristics of the Buddha, are all known to be the bodhisattvas' great vehicle.",
        "source": "T07n0220_493:0505c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0505c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝說大乘普超一切世間天、人、阿素洛等最尊最勝者，如是！",
        "translation": "You say that the great vehicle universally transcends all worldly gods, humans, asuras, and so forth, and is the most honored and most excellent, and so it is!",
        "source": "T07n0220_493:0505c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_493:0505c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_493:0505c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know it well in the present!",
        "source": "T07n0220_493:0505c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲界、色界、無色界是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the desire realm, the form realm, and the formless realm are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent, eternal, unchanging, and substantial, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0505c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以欲界、色界、無色界，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the desire realm, the form realm, and the formless realm are pervasively attached, falsely combined, and subject to change, and because they are all impermanent, impermanent, changing, and lacking in true nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as the most honored and superior.",
        "source": "T07n0220_493:0505c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0505c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色蘊乃至識蘊是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the form aggregate and even the consciousness aggregate are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent, eternal, unchanging, and substantial, then this great vehicle is neither honored nor superior, and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0505c20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以色蘊乃至識蘊，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the aggregate of form and even the aggregate of consciousness are pervasively attached, falsely combined, and mobile, and because they are all impermanent, impermanent, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0505c24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0505c27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼處乃至意處是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the sense-field of the eye and even the sense-field of the mind are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent, eternal, unchanging, and substantial, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0505c27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眼處乃至意處，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the sense-field of the eye and even the sense-field of the mind are pervasively attached, falsely combined, and mobile, and because they are all impermanent, impermanent, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506a05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色處乃至法處是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the form realm and even the Dharma realm are true, not false, unchanging, not mistaken, not hypothetical, and truly real, permanent, eternal, unchanging, and having true nature, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506a05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以色處乃至法處，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the form realm and even the Dharma realm are pervasively attached, falsely combined, and mobile, and because they are all impermanent, impermanent, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506a09_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506a12_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界乃至意界是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the visual realm and even the mental realm are true, not false, unchanging, not mistaken, not hypothetical, and truly real, permanent, eternal, unchanging, and having true nature, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506a12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眼界乃至意界，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the visual realm and even the mental realm are pervasively attached, falsely combined, and mobile, and because they are all impermanent, impermanent, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506a16_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506a19_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界乃至法界是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the form realm and even the Dharma realm are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent, eternal, unchanging, and having true nature, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506a19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以色界乃至法界，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the form realm and even the Dharma realm are pervasively attached, falsely combined, and mobile, and because they are all impermanent, impermanent, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506a23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506a26_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界乃至意識界是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the objective consciousness realm and even the realm of consciousness are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent, eternal, unchanging, and having true nature, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506a26_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眼識界乃至意識界，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the element of visual consciousness and even the element of consciousness are pervasively attached, falsely combined, and mobile, and because everything is impermanent, eternal, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506b01_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506b04_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼觸乃至意觸是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If visual contact and even mental contact are true, not false, unchanging, not mistaken, not hypothetical, and truly real, permanent, eternal, unchanging, and substantial, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506b04_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眼觸乃至意觸，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because visual contact and even mental contact are pervasively discriminated, falsely combined, and mobile, and because they are impermanent, constant, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506b08_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506b11_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼觸為緣所生諸受乃至意觸為緣所生諸受是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent, eternal, unchanging, and substantial, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506b11_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眼觸為緣所生諸受乃至意觸為緣所生諸受，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are pervasively attached, falsely combined, and migrating, and because they are impermanent, constant, changing, and insubstantial, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as being the most honored and superior.",
        "source": "T07n0220_493:0506b15_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506b19_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若地界乃至識界是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the earth realm and even the consciousness realm are true, not false, unchanging, not mistaken, not hypothetical, and truly real, permanent, eternal, unchanging, and having true nature, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506b20_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以地界乃至識界，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the earth realm and even the consciousness realm are pervasively attached, falsely combined, and mobile, and because they are all impermanent, impermanent, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506b23_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506b26_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若因緣乃至增上緣是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If causes and conditions and even contributory conditions are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent and eternal, unchanging and unchanging, and have true nature, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506b27_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以因緣乃至增上緣，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because causes and conditions and even contributory conditions are pervasively discriminated, falsely combined, and mobile, and because they are impermanent, constant, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506c01_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無明乃至老死是真如，非虛妄、無變異、不顛倒、非假設，是真是實、有常有恒、無變無易、有實性者，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If nescience and even old age and death are true, not false, unchanging, not mistaken, and not hypothetical, and are truly real, permanent, eternal, unchanging, and substantial, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無明乃至老死，是遍計所執、是虛妄假合、是有遷動，乃至一切無常無恒、有變有易、都無實性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because nescience and even old age are pervasively attached, falsely combined, and mobile, and because everything is impermanent, eternal, changing, and impermanent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如乃至不思議界，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If true thusness and even the inconceivable realm are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以真如乃至不思議界，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because true thusness and even the inconceivable realm are not truly existent and not non-existent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good present!",
        "source": "T07n0220_493:0506c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若斷界、離界、滅界、安隱界、寂靜界、無生界、無滅界、無染界、無淨界、無作界、無為界，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the realms of ending, parting, ceasing, stabilizing, quiescent, unarisen, unceasing, undefiled, unpurified, uncreated, and uncreated are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't surpass all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以斷界乃至無為界，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the realm of ending and even the realm of nonbeing don't have true existence and are not non-existent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0506c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若布施波羅蜜多乃至般若波羅蜜多，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the perfection of generosity and even the perfection of wisdom are truly existent and not non-existent, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以布施波羅蜜多乃至般若波羅蜜多，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the perfection of generosity and even the perfection of wisdom aren't truly existent and aren't existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth, and is the most honored and superior.",
        "source": "T07n0220_493:0506c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0506c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若內空乃至無性自性空，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If internal emptiness and even the emptiness of a natureless self-nature are truly existent and not non-existent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0506c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以內空乃至無性自性空，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because internal emptiness and even the emptiness of a natureless self-nature are not truly existent and not non-existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth, and is the most honored and superior.",
        "source": "T07n0220_493:0506c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苦、集、滅、道聖諦，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the noble truths of suffering, arising, cessation, and the path are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以苦、集、滅、道聖諦，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the noble truths of suffering, arising, cessation, and the path don't really have natures and don't have natures, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and most superior.",
        "source": "T07n0220_493:0507a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good present!",
        "source": "T07n0220_493:0507a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四念住乃至八聖道支，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the four abodes of mindfulness and even the eight noble factors of the path are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以四念住乃至八聖道支，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the four abodes of mindfulness and even the eight noble factors of the path are not truly existent and not existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth, and is the most honored and most superior.",
        "source": "T07n0220_493:0507a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四靜慮、四無量、四無色定，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the four meditations, four immeasurable concentrations, and four formless concentrations are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以四無量、四無色定，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the four immeasurable and four formless concentrations are not truly existent and not non-existent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0507a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若空、無相、無願解脫門，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the liberation through emptiness, signlessness, and wishlessness were truly existent and not nonexistent, then this great vehicle would not be honored or superior and wouldn't surpass all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以空、無相、無願解脫門，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the liberation through emptiness, signlessness, and wishlessness is not truly existent and not existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0507a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫、九次第定，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the eight liberations and nine graduated concentrations are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以八解脫、九次第定，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the eight liberations and nine graduated concentrations aren't truly existent and aren't existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth, and is the most honored and superior.",
        "source": "T07n0220_493:0507a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若陀羅尼門、三摩地門，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the dhāraṇī aspect and the approach to samādhi are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以陀羅尼門、三摩地門，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the dhāraṇī aspect and the approach to samādhi aren't truly existent and aren't existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and most superior.",
        "source": "T07n0220_493:0507a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五眼、六神通，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the five eyes and six supernormal powers are truly existent and not nonexistent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以五眼、六神通，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the five eyes and six supernormal powers are not truly existent and not non-existent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0507b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來十力乃至十八佛不共法，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the Tathāgata's ten powers and even the 18 Buddha-principles were truly existent and not non-existent, then this great vehicle would not be honored or superior and wouldn't surpass all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如來十力乃至十八佛不共法，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the Tathāgata's ten powers and the 18 Buddha-principles are not truly existent and not existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0507b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若極喜地法乃至法雲地法，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the Dharma of the ground of ultimate bliss and even the Dharma-cloud ground are truly existent and not non-existent, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以極喜地法乃至法雲地法，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the Dharma of the ground of ultimate bliss and even the Dharma-cloud ground are not truly existent and not non-existent in nature, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and most superior.",
        "source": "T07n0220_493:0507b13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507b15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若極喜地補特伽羅乃至法雲地補特伽羅，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the ground of ultimate bliss, Pudgala, and even the ground of the Dharma-cloud, is truly existent and not non-existent, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507b15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以極喜地補特伽羅乃至法雲地補特伽羅，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the ground of ultimate bliss, Pudgala, and even the ground of the Dharma-cloud, is not truly existent and not existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth, and is the most honored and superior.",
        "source": "T07n0220_493:0507b18_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507b21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若淨觀地法乃至如來地法，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the method of purifying the contemplative stage and even the method of the tathāgata stage are truly existent and not nonexistent, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以淨觀地法乃至如來地法，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the teaching of the ground of pure contemplation and even the teaching of the Tathāgata's ground aren't truly existent and aren't existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and most superior.",
        "source": "T07n0220_493:0507b23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507b25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若淨觀地補特伽羅乃至如來地補特伽羅，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "\"If the Jingguandi pudgala ... the Tathāgata pudgala were truly existent and not nonexistent, then this great vehicle would not be honored or superior and wouldn't surpass all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507b26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以淨觀地補特伽羅乃至如來地補特伽羅，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the Jingguandi pudgala ... the Tathāgata ground pudgala is not truly existent and not existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth, and is the most honored and superior.",
        "source": "T07n0220_493:0507b28_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507c02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切世間天、人、阿素洛等，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If all worldly gods, humans, asuras, and so forth truly exist and don't have non-existence, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507c02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切世間天、人、阿素洛等，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because all worldly gods, humans, asuras, and so forth don't really have natures and don't have natures, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0507c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩從初發心乃至安坐妙菩提座，其中所起無量種心，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the measureless kinds of mind that arise in a bodhisattva's mind from the time he first arouses it until he sits on the marvelous seat of enlightenment are not truly existent but not nonexistent, then this great vehicle is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩從初發心乃至安坐妙菩提座，其中所起無量種心，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the measureless kinds of mind that arise in a bodhisattva's mind from the time he first arouses the intention until he sits on the marvelous seat of enlightenment aren't truly existent and aren't existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth, and is the most honored and superior.",
        "source": "T07n0220_493:0507c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good present!",
        "source": "T07n0220_493:0507c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩金剛喻智，是實有性，非非有性，則此大乘非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the bodhisattva-mahāsattva's adamantine metaphorical wisdom is truly existent and not non-existent, then this great vehicle is neither honored nor superior, and it doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩金剛喻智，非實有性，是非有性故，此大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the bodhisattva-mahāsattva's adamantine metaphorical wisdom isn't truly existent and isn't existent, this great vehicle universally surpasses all worldly gods, humans, asuras, and so forth as most honored and most superior.",
        "source": "T07n0220_493:0507c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩金剛喻智所斷煩惱習氣相續，是實有性，非非有性，則此能斷金剛喻智，不能達彼都無自性斷、已證得無上微妙一切智智，非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the continuity of afflictive karmic impressions that the bodhisattva-mahāsattva's vajra metaphorical wisdom ends is truly existent and not nonexistent, then this vajra metaphorical wisdom that ends can't comprehend their total absence of self-nature and the unsurpassed subtle omniscience that has been realized, which is neither honored nor superior and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以金剛喻智所斷煩惱習氣相續，非實有性，是非有性故，此能斷金剛喻智，能了達彼都無自性斷，已證得無上微妙一切智智，普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the continuity of afflictive habits that are ended by the adamantine metaphorical wisdom doesn't really have a nature and is non-existent, this adamantine metaphorical wisdom that ends it all can comprehend the absence of self-nature and has realized unsurpassed subtle omniscience that's most honored and superior to all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0507c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來、應、正等覺三十二大士相、八十隨好所莊嚴身，是實有性，非非有性，則諸如來、應、正等覺威光妙德非尊非勝，不超一切世間天、人、阿素洛等。",
        "translation": "If the bodies adorned by the thirty-two marks of a great personage and the eighty minor features of the Tathāgata, the Arhat, and the Completely Awakened One are truly existent and not nonexistent, then the Tathāgata, the Arhat, and the Completely Awakened One's awe-inspiring marvelous virtue is neither honored nor superior, and doesn't transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0507c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸如來、應、正等覺三十二大士相、八十隨好所莊嚴身，非實有性，是非有性故，諸如來、應、正等覺威光妙德普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the bodies adorned by the Tathāgatas, Ying and Zheng Jue are adorned by the thirty-two marks of a great personage and the eighty minor features are not truly existent and not existent, the Tathāgatas, Ying and Zheng Jue's awe-inspiring marvelous virtue universally surpasses that of all the world's gods, humans, asuras, and so forth, and is most honored and superior.",
        "source": "T07n0220_493:0508a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0508a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來、應、正等覺所放光明，是實有性，非非有性，則諸如來、應、正等覺所放光明非尊非勝，不能普照十方殑伽沙等世界，不超一切世間天、人、阿素洛等。",
        "translation": "If the light emitted by the Tathāgatas, Arhats, and Fully Awakened Ones is truly existent and not nonexistent, then the light emitted by the Tathāgatas, Arhats, and Fully Awakened Ones is neither honored nor superior, and it can't universally illuminate the sands of the world in the ten directions or transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0508a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸如來、應、正等覺所放光明，非實有性，是非有性故，諸如來、應、正等覺所放光明皆能普照十方殑伽沙等世界，普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "It's because the light emitted by the Tathāgatas, Arhats, and Fully Awakened Ones doesn't really have a nature and is nonexistent, so the light emitted by the Tathāgatas, Arhats, and Fully Awakened Ones can universally illuminate the sands of the world in the ten directions and transcend all worldly gods, humans, asuras, and so forth, being the most honored and most excellent.",
        "source": "T07n0220_493:0508a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0508a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來、應、正等覺所具六十美妙支音，是實有性，非非有性，則諸如來、應、正等覺所具六十美妙支音非尊非勝，不能遍告十方無量無數百千俱胝殑伽沙等世界所化有情，不超一切世間天、人、阿素洛等。",
        "translation": "If the 60 beautiful limbs of sound possessed by the Tathāgatas, Arhats, and Fully Awakened Ones were truly existent and not nonexistent, then the 60 beautiful limbs of sound possessed by the Tathāgatas, Arhats, and Fully Awakened Ones wouldn't be honored or superior, and wouldn't be able to address the sentient beings converted in the numberless, incalculable, hundreds of thousands of corpuscles of the sands of the world in the ten directions, and wouldn't transcend all the worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0508a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸如來、應、正等覺所具六十美妙支音，非實有性，是非有性故，諸如來、應、正等覺所具六十美妙支音皆能遍告十方無量無數百千俱胝殑伽沙等世界所化有情，普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "It's because the 60 beautiful part sounds that the Tathāgatas, Arhats, and Fully Awakened Ones possess aren't really existent and aren't existent, and because the 60 beautiful part sounds that the Tathāgatas, Arhats, and Fully Awakened Ones possess can address sentient beings created in the numberless, incalculable, hundreds of thousands of sands of the world in the ten directions, universally surpassing all worldly gods, humans, asuras, and so forth as most honored and superior.",
        "source": "T07n0220_493:0508a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0508a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來、應、正等覺所轉無上微妙法輪，是實有性，非非有性，則諸如來、應、正等覺所轉無上微妙法輪，非尊非勝、非極清淨，亦非一切世間沙門、婆羅門等所不能轉，不超一切世間天、人、阿素洛等。",
        "translation": "If the unsurpassed subtle dharma-wheel turned by the Tathāgatas, Arhats, and Fully Awakened Ones is truly existent and not nonexistent, then the unsurpassed subtle dharma-wheel turned by the Tathāgatas, Arhats, and Fully Awakened Ones is neither honored nor superior, not perfectly pure, and not something that all worldly ascetics and priests can turn, nor does it transcend all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0508a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸如來、應、正等覺所轉無上微妙法輪，非實有性，是非有性故，諸如來、應、正等覺所轉無上微妙法輪最極清淨，一切世間所有沙門、婆羅門等皆無有能如法轉者，普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "Because the unsurpassed subtle Dharma wheel turned by the Tathāgatas, Arhats, and Fully Awakened Ones doesn't really have an essence and is non-existent, the unsurpassed subtle Dharma wheel turned by the Tathāgatas, Arhats, and Fully Awakened Ones is most extremely pure, and there's no ascetic or priesthood in the world that can turn it according to that teaching, which is most honored and most excellent, surpassing all the worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0508a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0508b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來、應、正等覺所化有情，是實有性，非非有性，則諸如來、應、正等覺所轉無上微妙法輪非尊非勝，不能令彼諸有情類入無餘依般涅槃界，不超一切世間天、人、阿素洛等。",
        "translation": "If the sentient beings created by the Tathāgatas, Arhats, and Fully Awakened Ones are truly existent and not nonexistent, then the unsurpassed subtle dharma-wheel turned by the Tathāgatas, Arhats, and Fully Awakened Ones is neither honored nor superior, and it can't cause those sentient beings to enter the state of great extinction without remainder, which doesn't transcend all the worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_493:0508b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸如來、應、正等覺所化有情，非實有性，是非有性故，諸如來、應、正等覺所轉無上微妙法輪，皆能令彼諸有情類入無餘依般涅槃界，普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "It's because the sentient beings created by the Tathāgatas, Arhats, and Fully Awakened Ones don't really have natures, and because they don't have natures, the unsurpassed subtle Dharma wheel turned by the Tathāgatas, Arhats, and Fully Awakened Ones can cause all those sentient beings to enter the state of parinirvāṇa without remainder, surpassing all worldly gods, humans, asuras, and so forth, and being most honored and superior.",
        "source": "T07n0220_493:0508b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「由如是等種種因緣故，說大乘普超一切世間天、人、阿素洛等最尊最勝。",
        "translation": "\"It's for these kinds of reasons that the great vehicle is said to universally surpass all worldly gods, humans, asuras, and so forth, being the most honored and most excellent.",
        "source": "T07n0220_493:0508b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good present!",
        "source": "T07n0220_493:0508b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝作是說『如是大乘與虛空等。』",
        "translation": "Do you say, 'Thus is the great vehicle equal to space?'",
        "source": "T07n0220_493:0508b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，如是！",
        "translation": "Thus, it's like this!",
        "source": "T07n0220_493:0508b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_493:0508b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_493:0508b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0508b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空，東西南北四維上下一切方分皆不可得，大乘亦爾，東西南北四維上下一切方分皆不可得，故說大乘與虛空等。",
        "translation": "Just as in space, all directions up and down in the four dimensions east and west, north and south are unobtainable, so too is the great vehicle, for which all directions up and down in the four dimensions east and west, north and south are unobtainable, and therefore it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空長短、高下、方圓、邪正、一切形色皆不可得，大乘亦爾，長短、高下、方圓、邪正、一切形色皆不可得，故說大乘與虛空等。",
        "translation": "\"Also, just as the length, height, roundness, squareness, right and wrong, and all shapes and forms of space are unknowable, so too is the great vehicle, for which length, height, roundness, squareness, right and wrong, and all shapes and forms are unknowable, and so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空青黃赤白紅紫碧綠縹等顯色皆不可得，大乘亦爾，青黃赤白紅紫碧綠縹等顯色皆不可得，故說大乘與虛空等。",
        "translation": "\"Also, just as the blue, yellow, red, white, red, purple, turquoise, and other manifest forms of space are all unobtainable, so too is the great vehicle, for which the blue, yellow, red, white, red, purple, turquoise, and other manifest forms are all unobtainable, and it's therefore said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非過去非未來非現在，大乘亦爾，非過去非未來非現在，故說大乘與虛空等。",
        "translation": "\"Also, just as space was neither past, nor future, nor present, so too is the great vehicle, which is neither past, nor future, nor present, and so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非增非減非進非退，大乘亦爾，非增非減、非進非退，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither increase nor decrease, neither advance nor retreat, so too is the great vehicle, which is neither increase nor decrease, neither advance nor retreat, and so it's said to be equal to space.",
        "source": "T07n0220_493:0508b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非雜染非清淨，大乘亦爾，非雜染非清淨，故說大乘與虛空等。",
        "translation": "\"Also, just as space is not defiled or pure, so too is the great vehicle, which is not defiled or pure; therefore, it's said to be equal to space.",
        "source": "T07n0220_493:0508b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空無生、無滅、無住、無異，大乘亦爾，無生、無滅、無住、無異，故說大乘與虛空等。",
        "translation": "\"Also, just as space has no arising, no cessation, no abiding, and no difference, so too does the great vehicle have no arising, no cessation, no abiding, and no difference; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非善、非不善、非無記，大乘亦爾，非善、非不善、非無記，故說大乘與虛空等。",
        "translation": "\"Also, just as space is not good, not unskillful, and not indeterminate, so too is the great vehicle, which is not good, not unskillful, and not indeterminate; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空無見、無聞、無覺、無知，大乘亦爾，無見、無聞、無覺、無知，故說大乘與虛空等。",
        "translation": "\"Also, just as space has no views, no hearing, no awakening, and no knowledge, so too does the great vehicle have no views, no hearing, no awakening, and no knowledge; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非所知、非所識，大乘亦爾，非所知、非所識，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither known nor known by consciousness, so too is the great vehicle, which is neither known nor known by consciousness; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非遍知、非永斷、非作證、非修習，大乘亦爾，非遍知、非永斷、非作證、非修習，故說大乘與虛空等。",
        "translation": "\"Also, just as space is not pervasively known, not permanently stopped, not realized, and not cultivated, so too is the great vehicle not pervasively known, not permanently stopped, not realized, and not cultivated, and so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非果非果法、非異熟非異熟法，大乘亦爾，非果非果法、非異熟非異熟法，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither fruitful nor fruition, and neither ripe nor ripening, so too is the great vehicle, which is neither fruitful nor fruition, nor ripe nor ripening, and so it's said to be equal to space.",
        "source": "T07n0220_493:0508c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非有貪法非離貪法、非有瞋法非離瞋法、非有癡法非離癡法，大乘亦爾，非有貪法非離貪法、非有瞋法非離瞋法、非有癡法非離癡法，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither with nor without the law of craving, neither with nor without the law of anger, and neither with nor without the law of delusion, so too is the great vehicle, which is neither with nor without the law of craving, neither with nor without the law of anger, nor with the law of delusion, and which is neither with nor without the law of delusion, and so it's said to be equal to space.",
        "source": "T07n0220_493:0508c10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非墮欲界、非墮色界、非墮無色界，大乘亦爾，非墮欲界、非墮色界、非墮無色界，故說大乘與虛空等。",
        "translation": "\"Also, just as space doesn't fall into the desire realm, doesn't fall into the form realm, and doesn't fall into the formless realm, so too does the great vehicle, which doesn't fall into the desire realm, doesn't fall into the form realm, and doesn't fall into the formless realm, so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空無初發心，無第二、第三、第四、第五、第六、第七、第八、第九、第十發心，大乘亦爾，無初發心，乃至無有第十發心，故說大乘與虛空等。",
        "translation": "\"Also, just as there's no first arousal of mind and no second, third, fourth, fifth, sixth, seventh, eighth, ninth, or tenth arousal of mind in space, so too does the great vehicle have no first arousal of mind and no tenth arousal of mind, so it's said that the great vehicle is equal to space.",
        "source": "T07n0220_493:0508c16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空無淨觀地、種性地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地可得，大乘亦爾，無淨觀地乃至如來地可得，故說大乘與虛空等。",
        "translation": "\"Also, just as space has no stages of pure contemplation, seed nature, eighth stage, fully visible stage, thin stage, stage free of desire, accomplished stage, solitary realizer stage, bodhisattva stage, or tathāgata stage to attain, so does the great vehicle have no stages of pure contemplation or even tathāgata stage to attain, so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508c19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空無預流向預流果、一來向一來果、不還向不還果、阿羅漢向阿羅漢果、獨覺向獨覺果、菩薩如來可得，大乘亦爾，無預流向預流果乃至菩薩如來可得，故說大乘與虛空等。",
        "translation": "\"Also, just as there's nothing in space that can be attained from the stage of prestreaming to the stage of prestreaming, from the stage of first coming to the stage of first coming, from the stage of nonreturner to the stage of nonreturner, from the stage of arhat to the stage of arhat, from the stage of pratyekabuddha to the stage of pratyekabuddha, or from the stage of bodhisattva-tathāgata, so too does the great vehicle have nothing to be attained from the stage of prestreaming to the stage of pratyekabuddha-tathāgata, and so it's said that the great vehicle and space are the same.",
        "source": "T07n0220_493:0508c23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空無聲聞地、獨覺地、菩薩地、如來地可得，大乘亦爾，無聲聞地、獨覺地、菩薩地、如來地可得，故說大乘與虛空等。",
        "translation": "\"Also, just as there's no śrāvaka ground, pratyekabuddha ground, bodhisattva ground, or tathāgata ground that can be attained in space, so too does the great vehicle have no śrāvaka ground, pratyekabuddha ground, bodhisattva ground, or tathāgata ground that can be attained, so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0508c27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非有色非無色、非有見非無見、非有對非無對、非合非散，大乘亦爾，非有色非無色、非有見非無見、非有對非無對、非合非散，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither colored nor formless, neither seen nor unseen, neither with nor without opposition, and neither combined nor scattered, so too is the great vehicle, which is neither colored nor formless, neither seen nor unseen, neither with nor without opposition, and neither combined nor scattered, and so it's said to be equal to space.",
        "source": "T07n0220_493:0509a01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非常非無常、非樂非苦、非我非無我、非淨非不淨，大乘亦爾，非常非無常、非樂非苦、非我非無我、非淨非不淨，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither impermanent nor impermanent, neither pleasant nor painful, neither self nor selfless, and neither pure nor impure, so too is the great vehicle neither impermanent nor impermanent, neither pleasant nor painful, neither self nor selfless, nor pure nor impure, and so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非空非不空、非有相非無相、非有願非無願，大乘亦爾，非空非不空、非有相非無相、非有願非無願，故說大乘與虛空等。",
        "translation": "\"Also, just as space is not empty or nonempty, not with marks or without marks, and not with wishes or without wishes, so too is the great vehicle not empty or nonempty, not with marks or without marks, and not with wishes or without wishes, so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非寂靜非不寂靜、非遠離非不遠離，大乘亦爾，非寂靜非不寂靜、非遠離非不遠離，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither quiescent nor nonquiescent, and neither isolated nor nonisolated, so too is the great vehicle, which is neither quiescent nor nonquiescent and neither isolated nor nonisolated, and so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非明非闇，大乘亦爾，非明非闇，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither light nor dark, so too is the great vehicle, which is neither light nor dark; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非可得非不可得，大乘亦爾，非可得非不可得，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither obtainable nor unobtainable, so is the great vehicle, which is neither obtainable nor unobtainable; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非蘊、處、界非離蘊、處、界，大乘亦爾，非蘊、處、界非離蘊、處、界，故說大乘與虛空等。",
        "translation": "\"Also, just as space is not an aggregate, field, or element that's not free of aggregates, fields, or elements, so too is the great vehicle, which is not an aggregate, field, or element that's not free of aggregates, fields, or elements; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非可說非不可說，大乘亦爾，非可說非不可說，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither explicable nor ineffable, so too is the great vehicle, which is neither explicable nor ineffable, and so it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如虛空非有戲論非無戲論，大乘亦爾，非有戲論非無戲論，故說大乘與虛空等。",
        "translation": "\"Also, just as space is neither speculative nor non-specific, so too is the great vehicle, which is neither speculative nor non-specific; therefore, it's said that the great vehicle and space are equal.",
        "source": "T07n0220_493:0509a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是等種種因緣，故作是說：如是大乘與虛空等。",
        "translation": "Because of these kinds of causes and conditions, it's possible to say, 'Thus, the great vehicle and space are equal.'",
        "source": "T07n0220_493:0509a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0509a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝作是說『譬如虛空，普能容受無量無數無邊有情；大乘亦爾，普能容受無量無數無邊有情。』",
        "translation": "You say, 'It's like space, which can universally accommodate measureless, countless, and limitless sentient beings; so is the great vehicle, which can universally accommodate measureless, countless, and limitless sentient beings.'",
        "source": "T07n0220_493:0509a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，如是！",
        "translation": "If so, so it is!",
        "source": "T07n0220_493:0509a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_493:0509a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_493:0509a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0509a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無所有故，當知虛空亦無所有。",
        "translation": "Because sentient beings lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0509a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0509a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this meaning, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0509a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0509b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有情、若虛空、若大乘，如是一切皆無所有不可得故。",
        "translation": "Whether it's sentient beings, space, or the great vehicle, such things are all without existence and cannot be obtained.",
        "source": "T07n0220_493:0509b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0509b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無量故，當知虛空亦無量；虛空無量故，當知大乘亦無量。",
        "translation": "Because sentient beings are countless, you should know that space is also countless, and because space is countless, you should know that the great vehicle is also countless.",
        "source": "T07n0220_493:0509b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無數故，當知虛空亦無數；虛空無數故，當知大乘亦無數。",
        "translation": "It's because sentient beings are countless that you should know that space is also countless, and because space is countless that you should know that the great vehicle is also countless.",
        "source": "T07n0220_493:0509b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無邊故，當知虛空亦無邊；虛空無邊故，當知大乘亦無邊。",
        "translation": "Because sentient beings are limitless, you should know that space is also limitless, and because space is limitless, you should know that the great vehicle is also limitless.",
        "source": "T07n0220_493:0509b05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this meaning, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0509b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0509b08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有情無量無數無邊，若虛空無量無數無邊，若大乘無量無數無邊，如是一切皆無所有不可得故。",
        "translation": "If there are sentient beings without measure or number or limit, if space is without measure or number or limit, and if the great vehicle is without measure or number or limit, then all of these things are without existence and cannot be obtained.",
        "source": "T07n0220_493:0509b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0509b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無所有故，當知虛空亦無所有；虛空無所有故，當知大乘亦無所有；大乘無所有故，當知無量亦無所有；無量無所有故，當知無數亦無所有；無數無所有故，當知無邊亦無所有；無邊無所有故，當知一切法亦無所有。",
        "translation": "Because sentient beings lack existence, you should know that space also lacks existence; because space lacks existence, you should know that the great vehicle also lacks existence; because the great vehicle lacks existence, you should know that measurelessness lacks existence; because measurelessness lacks existence, you should know that countlessness lacks existence; because countlessness lacks existence, you should know that limitlessness lacks existence; and because limitlessness lacks existence, you should know that all dharmas also lack existence.",
        "source": "T07n0220_493:0509b11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0509b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0509b17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有情、若虛空、若大乘、若無量、若無數、若無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "Whether it's sentient beings, space, the great vehicle, immeasurable, incalculable, limitless, or all dharmas, such things are all without existence and cannot be obtained.",
        "source": "T07n0220_493:0509b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0509b19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我無所有故，當知有情亦無所有。",
        "translation": "Because I have nothing, you should know that sentient beings also have nothing.",
        "source": "T07n0220_493:0509b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情無所有故，當知命者亦無所有。",
        "translation": "Because sentient beings lack ownership, you should know that those who are born also lack ownership.",
        "source": "T07n0220_493:0509b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命者無所有故，當知生者亦無所有。",
        "translation": "Because living beings lack possessions, you should know that those who are born lack possessions as well.",
        "source": "T07n0220_493:0509b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生者無所有故，當知養者亦無所有。",
        "translation": "Because living beings lack possessions, you should know that those who are nurtured also lack possessions.",
        "source": "T07n0220_493:0509b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "養者無所有故，當知士夫亦無所有。",
        "translation": "Because nurturers lack possessions, you should know that men lack possessions as well.",
        "source": "T07n0220_493:0509b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "士夫無所有故，當知補特伽羅亦無所有。",
        "translation": "Because a man has nothing, you should know that a person in the pudgala also has nothing.",
        "source": "T07n0220_493:0509b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "補特伽羅無所有故，當知意生亦無所有。",
        "translation": "Because the person doesn't have possession, you should know that the mind-made also doesn't have possession.",
        "source": "T07n0220_493:0509b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意生無所有故，當知儒童亦無所有。",
        "translation": "Because mind-made beings lack [something], you should know that youths lack [something].",
        "source": "T07n0220_493:0509b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "儒童無所有故，當知作者亦無所有。",
        "translation": "Because the youth has nothing, you should know that the author also has nothing.",
        "source": "T07n0220_493:0509b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作者無所有故，當知受者亦無所有。",
        "translation": "Because the author has nothing, you should know that the recipient also has nothing.",
        "source": "T07n0220_493:0509b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受者無所有故，當知知者亦無所有。",
        "translation": "Because the recipient has nothing, you should know that the knower also has nothing.",
        "source": "T07n0220_493:0509b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知者無所有故，當知見者亦無所有。",
        "translation": "Because the knower has nothing, you should know that the seer also has nothing.",
        "source": "T07n0220_493:0509b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見者無所有故，當知虛空亦無所有。",
        "translation": "Because the seer has nothing, you should know that space also has nothing.",
        "source": "T07n0220_493:0509c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has nothing, you should know that the great vehicle also has nothing.",
        "source": "T07n0220_493:0509c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量亦無所有。",
        "translation": "Because the great vehicle has nothing, you should know that measurelessness also has nothing.",
        "source": "T07n0220_493:0509c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無所有故，當知無數亦無所有。",
        "translation": "Because immeasurable has no existence, you should know that countless has no existence.",
        "source": "T07n0220_493:0509c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無數無所有故，當知無邊亦無所有。",
        "translation": "Because numberlessness has no existence, you should know that limitlessness also has no existence.",
        "source": "T07n0220_493:0509c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊無所有故，當知一切法亦無所有。",
        "translation": "Because limitlessness has no existence, you should know that all dharmas are also without existence.",
        "source": "T07n0220_493:0509c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0509c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0509c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若虛空、若大乘、若無量、若無數、若無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "If I or even those who see, if it's empty, if it's the great vehicle, if it's immeasurable, if it's countless, if it's limitless, or if it's all dharmas, such things are all without existence and cannot be obtained.",
        "source": "T07n0220_493:0509c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0509c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者無所有故，當知真如乃至不思議界展轉亦無所有。",
        "translation": "Because I and even those who see have nothing, you should know that the true thusness and even the inconceivable realm of transmigration also have nothing.",
        "source": "T07n0220_493:0509c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如乃至不思議界無所有故，當知虛空亦無所有。",
        "translation": "Because the true Tathāgata and even the inconceivable realm lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0509c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0509c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量無數無邊展轉亦無所有。",
        "translation": "Because the great vehicle has nothing, you should know that measureless, countless, and limitless transmigration also has nothing.",
        "source": "T07n0220_493:0509c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無數無邊無所有故，當知一切法亦無所有。",
        "translation": "Because it's countless, numerous, and limitless, and has no existence, you should know that all dharmas also have no existence.",
        "source": "T07n0220_493:0509c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0509c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0509c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若真如乃至不思議界、若無量無數無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "If there's a self or even a viewer, if it's true or even inconceivable, if it's immeasurable, countless, and limitless, and if it's all dharmas, then all of these things are without existence and cannot be obtained.",
        "source": "T07n0220_493:0509c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0509c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者無所有故，當知斷界乃至無為界展轉亦無所有。",
        "translation": "Because I and even those who see have nothing, you should know that the realm of elimination and even the transition to the realm of nothingness also have nothing.",
        "source": "T07n0220_493:0509c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷界乃至無為界無所有故，當知虛空亦無所有。",
        "translation": "Because the elimination realm and even the realm of nothingness lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0509c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0509c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量無數無邊展轉亦無所有。",
        "translation": "Because the great vehicle has nothing, you should know that measureless, countless, and limitless transmigration also has nothing.",
        "source": "T07n0220_493:0509c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無數無邊無所有故，當知一切法亦無所有。",
        "translation": "Because it's countless, numerous, and limitless, and has no existence, you should know that all dharmas also have no existence.",
        "source": "T07n0220_493:0509c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0509c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0509c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若斷界乃至無為界、若虛空、若大乘、若無量無數無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "If there's a self or even a viewer, if there's a realm of elimination or even a realm of nothingness, if it's space, if it's the great vehicle, if it's measureless, countless, and limitless, and if it's all dharmas, such things are all without existence and cannot be obtained.",
        "source": "T07n0220_493:0509c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0509c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者無所有故，當知色蘊乃至識蘊展轉亦無所有。",
        "translation": "Because the self and even the viewer are without existence, you should know that the aggregate of form and even the aggregate of consciousness in their transmigration are also without existence.",
        "source": "T07n0220_493:0509c29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色蘊乃至識蘊無所有故，當知虛空亦無所有。",
        "translation": "Because the aggregate of form and even the aggregate of consciousness lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0510a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0510a03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量無數無邊展轉亦無所有。",
        "translation": "Because the great vehicle has no existence, you should know that measureless, countless, and limitless transmigration also has no existence.",
        "source": "T07n0220_493:0510a03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無數無邊無所有故，當知一切法亦無所有。",
        "translation": "Because it's countless, numerous, and limitless, and has no existence, you should know that all dharmas also have no existence.",
        "source": "T07n0220_493:0510a05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0510a06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0510a07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若色蘊乃至識蘊、若虛空、若大乘、若無量無數無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "If there's a self or even a viewer, if there's the aggregate of form or even the aggregate of consciousness, if it's space, if it's the great vehicle, if it's immeasurable, countless, and limitless, and if it's all dharmas, such things are all without existence and cannot be obtained.",
        "source": "T07n0220_493:0510a07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0510a10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者無所有故，當知眼處乃至意處展轉亦無所有。",
        "translation": "Because the self and even the viewer lack existence, you should know that the sense-field of the eye and even the mental field in its continuity also lack existence.",
        "source": "T07n0220_493:0510a10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處乃至意處無所有故，當知虛空亦無所有。",
        "translation": "Because the sense-field of the eye and even the sense-field of the mind lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0510a11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0510a12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量無數無邊展轉亦無所有。",
        "translation": "Because the great vehicle has nothing, you should know that measureless, countless, and limitless transmigration also has nothing.",
        "source": "T07n0220_493:0510a13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無數無邊無所有故，當知一切法亦無所有。",
        "translation": "Because it's countless, numerous, and limitless, and has no existence, you should know that all dharmas also have no existence.",
        "source": "T07n0220_493:0510a14_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0510a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0510a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若眼處乃至意處、若虛空、若大乘、若無量無數無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "If there's a self or even a viewer, if there's the locus of the eye or even the locus of the mind, if it's space, if it's the great vehicle, if it's measureless, countless, and limitless, and if it's all dharmas, such things are all without existence and cannot be obtained.",
        "source": "T07n0220_493:0510a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0510a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者無所有故，當知色處乃至法處展轉亦無所有。",
        "translation": "Because the self and even the viewer lack existence, you should know that the range of form and even the range of things in transition also lack existence.",
        "source": "T07n0220_493:0510a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處乃至法處無所有故，當知虛空亦無所有。",
        "translation": "Because the form realm and even the Dharma realm lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0510a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0510a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量無數無邊展轉亦無所有。",
        "translation": "Because the great vehicle has no existence, you should know that measureless, countless, and limitless transmigration also has no existence.",
        "source": "T07n0220_493:0510a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無數無邊無所有故，當知一切法亦無所有。",
        "translation": "Because it's countless, numerous, and limitless, and has no existence, you should know that all dharmas also have no existence.",
        "source": "T07n0220_493:0510a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0510a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0510a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若色處乃至法處、若虛空、若大乘、若無量無數無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "If there's a self or even a viewer, if there's a form or even a dharma-position, if it's space, if it's the great vehicle, if it's measureless, countless, and limitless, and if it's all dharmas, all of these things are without existence and cannot be obtained.",
        "source": "T07n0220_493:0510a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0510a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者無所有故，當知眼界乃至意界展轉亦無所有。",
        "translation": "Because the self and even the viewer lack existence, you should know that the visual realm and even the mental realm in their succession also lack existence.",
        "source": "T07n0220_493:0510b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界乃至意界無所有故，當知虛空亦無所有。",
        "translation": "Because the visual realm and even the mental realm lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0510b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0510b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量無數無邊展轉亦無所有，無量無數無邊無所有故，當知一切法亦無所有。",
        "translation": "Because the great vehicle has nothing, you should know that measureless, numberless, and limitless transmigration has nothing, and because measureless, numberless, and limitless has nothing, you should know that all dharmas have nothing.",
        "source": "T07n0220_493:0510b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0510b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0510b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若眼界乃至意界、若虛空、若大乘、若無量無數無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "If there's a self or even a viewer, if there's the visual realm or even the mental realm, if it's space, if it's the great vehicle, if it's measureless, countless, and limitless, and if it's all dharmas, then all of these things are without existence and cannot be obtained.",
        "source": "T07n0220_493:0510b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_493:0510b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至見者無所有故，當知色界乃至法界展轉亦無所有。",
        "translation": "Because the self and even the viewer lack existence, you should know that the form realm and even the transmigration of the Dharma realm also lack existence.",
        "source": "T07n0220_493:0510b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界乃至法界無所有故，當知虛空亦無所有。",
        "translation": "Because the form realm and even the Dharma realm lack existence, you should know that space also lacks existence.",
        "source": "T07n0220_493:0510b12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無所有故，當知大乘亦無所有。",
        "translation": "Because space has no existence, you should know that the great vehicle also has no existence.",
        "source": "T07n0220_493:0510b13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘無所有故，當知無量無數無邊展轉亦無所有，無量無數無邊無所有故，當知一切法亦無所有。",
        "translation": "Because the great vehicle has no existence, you should know that measureless, countless, and infinite transmigration also has no existence, and because measureless, countless, and infinite has no existence, you should know that all things also have no existence.",
        "source": "T07n0220_493:0510b14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，故說大乘譬如虛空，普能容受無量無數無邊有情。",
        "translation": "Because of this, it's said that the great vehicle is like space, which can universally accommodate measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_493:0510b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_493:0510b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我乃至見者、若色界乃至法界、若虛空、若大乘、若無量無數無邊、若一切法，如是一切皆無所有不可得故。",
        "translation": "\"If there's a self or even a viewer, if there's the form realm or even the Dharma realm, if it's space, if it's the great vehicle, if it's immeasurable, countless, and limitless, and if it's all dharmas, then all of these are without existence and cannot be obtained.",
        "source": "T07n0220_493:0510b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九十三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 493",
        "source": "T07n0220_493:0510b21_0",
        "is_bad_quality": false
    }
]