[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5.3",
        "source": "T07n0220_534:0740b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四",
        "translation": "fourteen",
        "source": "T07n0220_534:0740b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_534:0740b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分施等品第二十九之三",
        "translation": "Chapter Three: Twenty-nine Thirds of the Chapter on Charity and So forth",
        "source": "T07n0220_534:0740b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「若一切法皆本性空，本性空中都無差別，諸菩薩摩訶薩為何所住發趣無上正等菩提，作是願言：『我當趣證廣大無上正等菩提，轉妙法輪度有情眾？』",
        "translation": "It was then that the good manifestation then said to the Buddha, \"If all things are inherently empty and have no distinctions in their nature, what do bodhisattvas, mahāsattvas, and what is the purpose of their abiding and setting out for unsurpassed perfect enlightenment, making this vow, 'I will go and realize vast unsurpassed perfect enlightenment and turn the wonderful wheel of the Dharma to save all sentient beings?'",
        "source": "T07n0220_534:0740b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_534:0740c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無上正等菩提廣大甚深，無二行相、非二行相而能證得，諸菩薩摩訶薩云何能證所求無上正等菩提？",
        "translation": "How can bodhisattvas, mahāsattvas, realize the unsurpassed correct bodhi that they seek when it's so vast and profound that it can be realized without two defining activities or without two defining activities?",
        "source": "T07n0220_534:0740c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來哀愍為說！」",
        "translation": "May the Tathāgata have mercy on you and explain this!\"",
        "source": "T07n0220_534:0740c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_534:0740c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_534:0740c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_534:0740c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提廣大甚深，無二行相、非二行相而能證得。",
        "translation": "\"The buddhas' unsurpassed correct perfect enlightenment is vast and profound, and it can be realized without two defining activities or without two defining activities.",
        "source": "T07n0220_534:0740c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_534:0740c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提無二亦無分別，若於菩提行於二相、有分別者，必不能證廣大無上正等菩提。",
        "translation": "Bodhi is neither two nor discriminated, and if someone practices bodhi in two ways and has discrimination, they certainly won't be able to realize vast, unsurpassed, and perfect enlightenment.",
        "source": "T07n0220_534:0740c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_534:0740c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩不於菩提行於二相，亦不分別，都無所住，發趣無上正等菩提。",
        "translation": "\"Bodhisattvas, mahāsattvas, don't practice two aspects of enlightenment, don't discriminate between them, and don't abide in either, and they set out for unsurpassed perfect enlightenment.",
        "source": "T07n0220_534:0740c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於諸法中不行二相，亦不分別，都無所行，便能趣證廣大無上正等菩提。",
        "translation": "By not practicing two characteristics of things, not discriminating between them, and doing nothing at all, bodhisattvas, mahāsattvas, and so forth can attain the realization of vast, unsurpassed, and correct enlightenment.",
        "source": "T07n0220_534:0740c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_534:0740c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩所求無上正等菩提，非行二相而能證得。",
        "translation": "The unsurpassed correct enlightenment that bodhisattvas, mahāsattvas, and supreme bodhisattvas seek can be realized without the two marks of practice.",
        "source": "T07n0220_534:0740c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩所有菩提都無行處，謂不行色、受、想、行、識，不行眼處乃至意處，不行色處乃至法處，不行眼界乃至意界，不行色界乃至法界，不行眼識界乃至意識界，不行眼觸乃至意觸，不行眼觸為緣所生諸受乃至意觸為緣所生諸受，不行地界乃至識界，不行因緣乃至增上緣，不行從緣所生諸法，不行無明乃至老死，不行布施乃至般若波羅蜜多，不行內空乃至無性自性空，不行真如乃至不思議界，不行苦、集、滅、道聖諦，不行四念住乃至八聖道支，不行四靜慮、四無量、四無色定，不行空、無相、無願解脫門，不行八解脫乃至十遍處，不行淨觀地乃至如來地，不行極喜地乃至法雲地，不行陀羅尼門、三摩地門，不行五眼、六神通，不行如來十力乃至十八佛不共法，不行大慈、大悲、大喜、大捨，不行三十二大士相、八十隨好，不行無忘失法、恒住捨性，不行一切智、道相智、一切相智，不行預流果乃至獨覺菩提，不行菩薩摩訶薩行，不行無上正等菩提。",
        "translation": "諸菩薩摩訶薩所有菩提都無行處，謂不行色、受、想、行、識，不行眼處乃至意處，不行色處乃至法處，不行眼界乃至意界，不行色界乃至法界，不行眼識界乃至意識界，不行眼觸乃至意觸，不行眼觸為緣所生諸受乃至意觸為緣所生諸受，不行地界乃至識界，不行因緣乃至增上緣，不行從緣所生諸法，不行無明乃至老死，不行布施乃至般若波羅蜜多，不行內空乃至無性自性空，不行真如乃至不思議界，不行苦、集、滅、道聖諦，不行四念住乃至八聖道支，不行四靜慮、四無量、四無色定，不行空、無相、無願解脫門，不行八解脫乃至十遍處，不行淨觀地乃至如來地，不行極喜地乃至法雲地，不行陀羅尼門、三摩地門，不行五眼、六神通，不行如來十力乃至十八佛不共法，不行大慈、大悲、大喜、大捨，不行三十二大士相、八十隨好，不行無忘失法、恒住捨性，不行一切智、道相智、一切相智，不行預流果乃至獨覺菩提，不行菩薩摩訶薩行，不行無上正等菩提。",
        "source": "T07n0220_534:0740c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_534:0741a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩所有菩提，不緣名聲執我、我所。",
        "translation": "'All bodhisattvas, mahāsattvas, and their enlightenment doesn't focus on the attachment to self and what belongs to self based on name and sound.",
        "source": "T07n0220_534:0741a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂彼菩提不作是念：『我行於色、受、想、行、識乃至無上正等菩提。』",
        "translation": "That bodhisattva doesn't think, 'I've practiced form, feeling, perception, volition, and consciousness up to unsurpassed perfect enlightenment.'",
        "source": "T07n0220_534:0741a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_534:0741a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩所有菩提，非取故行、非捨故行，於一切法無所分別。」",
        "translation": "All bodhisattvas, mahāsattvas, and their enlightenment is formulated not in terms of grasping, not in terms of equanimity, and there's no discrimination among all dharmas.\"",
        "source": "T07n0220_534:0741a08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「若菩薩摩訶薩所有菩提，非取故行、非捨故行，於一切法無所分別，諸菩薩摩訶薩所有菩提當行何處？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"If the bodhisattvas, the mahāsattvas, possess enlightenment that's not acquired and that's not undertaken in response to equanimity, and there's no discrimination among all things, where will the bodhisattvas, the mahāsattvas, possess enlightenment that's undertaken?\"",
        "source": "T07n0220_534:0741a09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha addressed the Śākyamuni, \"What do you think?",
        "source": "T07n0220_534:0741a12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛化身所有菩提當行何處？",
        "translation": "\"Where will all the buddha-transformation bodies of bodhi go?",
        "source": "T07n0220_534:0741a12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為取故行？",
        "translation": "Do you act in order to grasp?",
        "source": "T07n0220_534:0741a13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為捨故行？」",
        "translation": "Do you practice for the sake of indifference?\"",
        "source": "T07n0220_534:0741a13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T07n0220_534:0741a14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_534:0741a14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛化身實無所有，云何可說所有菩提於是處行若取、若捨？」",
        "translation": "How can it be said that all buddha-transformation bodies really lack existence, so how can it be said that all bodhisattvas act in this way, whether grasping or rejecting?\"",
        "source": "T07n0220_534:0741a14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha addressed the Śākyamuni, \"What do you think?",
        "source": "T07n0220_534:0741a16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸阿羅漢夢中菩提當行何處？",
        "translation": "\"Where will arhats practice enlightenment in their dreams?",
        "source": "T07n0220_534:0741a16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為取故行？",
        "translation": "Do you act in order to grasp?",
        "source": "T07n0220_534:0741a17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為捨故行？」",
        "translation": "Do you practice for the sake of indifference?\"",
        "source": "T07n0220_534:0741a17_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T07n0220_534:0741a17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_534:0741a18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸阿羅漢煩惱永盡，惛沈、睡眠、蓋纏俱滅，畢竟無夢，云何當有夢中菩提於是處行若取、若捨？」",
        "translation": "When arhats' afflictions are permanently ended, their torpor, drowsiness, and hindrances are all extinguished, and they have no dreams at all, how could there be dreams in which bodhi is formulated, whether grasped or abandoned?\"",
        "source": "T07n0220_534:0741a18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_534:0741a20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_534:0741a20_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_534:0741a20_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，所有菩提亦復如是，非取故行，非捨故行，都無行處，達一切法本性空故。」",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the profound perfection of wisdom, this is also true of all bodhicitta, which is formulated not in terms of taking, not in terms of equanimity, and has no locus of action, because it's the realization that the original nature of all things is empty.\"",
        "source": "T07n0220_534:0741a21_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「若菩薩摩訶薩行深般若波羅蜜多，所有菩提非取故行，非捨故行，都無行處，謂不行色、受、想、行、識，廣說乃至不行無上正等菩提，亦復不行一切智智。",
        "translation": "Guoshou Shancheng then said to the Buddha, \"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, all bodhi is formulated as not acting because of grasping, not acting because of equanimity, and all lacking a locus of action, which means not form, feeling, perception, volition, or consciousness, and as explained in detail, not unsurpassed correct enlightenment, and also not omniscience.",
        "source": "T07n0220_534:0741a23_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將無菩薩摩訶薩眾，不行十地，不行布施乃至般若波羅蜜多，不行四念住乃至八聖道支，不行十六空，不行靜慮、等持、等至，乃至不行如來十力、四無所畏、四無礙解、十八佛不共法，不行大慈、大悲、大喜、大捨，廣說乃至八十隨好及餘無量無邊佛法，不住菩薩殊勝神通成熟有情、嚴淨佛土，而能證得一切智智？」",
        "translation": "將無菩薩摩訶薩眾，不行十地，不行布施乃至般若波羅蜜多，不行四念住乃至八聖道支，不行十六空，不行靜慮、等持、等至，乃至不行如來十力、四無所畏、四無礙解、十八佛不共法，不行大慈、大悲、大喜、大捨，廣說乃至八十隨好及餘無量無邊佛法，不住菩薩殊勝神通成熟有情、嚴淨佛土，而能證得一切智智？」",
        "source": "T07n0220_534:0741a27_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩所有菩提雖無行處，而諸菩薩摩訶薩眾為欲饒益諸有情故，要行十地及行布施波羅蜜多，廣說乃至要住菩薩殊勝神通成熟有情、嚴淨佛土，乃能證得一切智智。」",
        "translation": "The Buddha told Śaṅgālī, \"Although there's no place for all the bodhisattvas' enlightenment to go, the bodhisattvas, the mahāsattvas, in order to benefit sentient beings, must practice the ten stages and practice the perfection of generosity, which are explained in detail up to the point where they must abide in the bodhisattvas' extraordinary powers to ripen sentient beings and purify the Buddha's land before they can realize the knowledge of all cognition.\"",
        "source": "T07n0220_534:0741b05_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「諸菩薩摩訶薩所有菩提若無行處，將無菩薩摩訶薩眾為欲饒益諸有情故，不住十地久修令滿，不住布施乃至般若波羅蜜多久修令滿，廣說乃至不住菩薩殊勝神通成熟有情、嚴淨佛土久修令滿，而能證得一切智智？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Is there no place in Bodhisattva Mahāsattva's enlightenment that's lacking in practice, no place in Bodhisattva Mahāsattva's desire to benefit sentient beings that's not cultivated for a long time to bring the ten stages to completion, that's not cultivated for a long time to bring generosity and even prajñāpāramitā to completion, and that's not cultivated for a long time to bring the extensively explained Bodhisattva's extraordinary supernormal powers to ripen sentient beings and adorn and purify the Buddha-lands to completion, and then they'll be able to realize the cognition of all things?\"",
        "source": "T07n0220_534:0741b09_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩所有菩提雖無行處，而諸菩薩摩訶薩眾為欲饒益諸有情故，要住十地久修令滿，要住布施乃至般若波羅蜜多久修令滿，廣說乃至要住菩薩殊勝神通成熟有情、嚴淨佛土久修令滿，乃能證得一切智智。",
        "translation": "The Buddha told Shancheng, \"Although there's no place for all the bodhisattvas' enlightenment to be practiced, all the bodhisattvas, mahāsattvas, and others wanting to benefit sentient beings must abide long enough to cultivate the completion of the ten stages, abide long enough to cultivate generosity and even prajñāpāramit, and abide long enough to cultivate the completion of the bodhisattvas' excellent supernormal powers to ripen sentient beings and purify the Buddha's land, so that they can realize the wisdom of omniscience.",
        "source": "T07n0220_534:0741b15_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know it well, good present!",
        "source": "T07n0220_534:0741b20_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修諸善根未總圓滿，終不能得一切智智。",
        "translation": "If a bodhisattva-mahāsattva cultivates good roots that haven't been fully perfected, he'll never attain omniscience.",
        "source": "T07n0220_534:0741b20_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_534:0741b22_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得無上正等菩提，應住色本性空，應住受、想、行、識本性空，廣說乃至應住菩薩摩訶薩行本性空，應住無上正等菩提本性空，應住一切法本性空，應住一切有情本性空，修行十地令得圓滿，修行布施乃至般若波羅蜜多令得圓滿，廣說乃至修行菩薩殊勝神通成熟有情、嚴淨佛土令圓滿已，便得無上正等菩提。",
        "translation": "If a bodhisattva wants to attain unsurpassed correct enlightenment, he or she should abide in the emptiness of the original nature of form, abide in the emptiness of the original nature of feeling, perception, volition, and consciousness, explain in detail and even abide in the emptiness of the original nature of the bodhisattva's practice, abide in the emptiness of the original nature of unsurpassed correct enlightenment, abide in the emptiness of the original nature of all things, abide in the emptiness of the original nature of all sentient beings, cultivate the ten stages to make them complete, cultivate generosity and even the prajñāpāramitā to make them complete, and explain in detail and even cultivate the bodhisattva's extraordinary supernormal powers to ripen sentient beings and purify the Buddha-lands to make them complete, then he or she will attain unsurpassed correct enlightenment.",
        "source": "T07n0220_534:0741b22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_534:0741b29_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是一切法本性空理及諸有情本性空理，最極寂靜，無有少法能增能減、能生能滅、能斷能常、能染能淨、能得果能現觀。",
        "translation": "\"This principle of the inherent emptiness of all things and the inherent emptiness of all sentient beings is the most tranquil, and there's not a single thing that can increase or decrease, arise or cease, be stopped or made permanent, be defiled or purified, or attain fruition or be seen.",
        "source": "T07n0220_534:0741c01_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this well, now!",
        "source": "T07n0220_534:0741c03_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩依世俗故，說修般若波羅蜜多，如實了知本性空已，證得無上正等菩提，不依勝義。",
        "translation": "All bodhisattvas, mahāsattvas, rely on conventionality when they say they'll cultivate the perfection of wisdom and realize unsurpassed perfect enlightenment after truly understanding the emptiness of their original nature, not on the ultimate truth.",
        "source": "T07n0220_534:0741c04_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_534:0741c06_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝義諦中無色可得，亦無受、想、行、識可得，廣說乃至無諸菩薩摩訶薩行可得，亦無無上正等菩提可得，無行菩薩摩訶薩行者可得，亦無證得諸佛無上正等菩提者可得。",
        "translation": "In the ultimate truth, there's no form to be attained, no feeling, perception, volition, or consciousness to be attained, and it's explained in detail up to the point that there are no bodhisattva-mahāsattva practices to be attained, no unsurpassed correct enlightenment to be attained, no practitioner of bodhisattva-mahāsattva practices to be attained, and no realization of the unsurpassed correct enlightenment of the buddhas to be attained.",
        "source": "T07n0220_534:0741c06_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well understand!",
        "source": "T07n0220_534:0741c10_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法及諸有情，皆依世俗言說施設，不依勝義。",
        "translation": "Such things and sentient beings are defined based on worldly talk, not on the ultimate truth.",
        "source": "T07n0220_534:0741c10_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this well, now!",
        "source": "T07n0220_534:0741c11_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，從初發心雖極猛利為諸有情行菩提行，而於此心都無所得，於諸有情亦無所得，於大菩提亦無所得，於佛、菩薩亦無所得，以一切法、一切有情皆本性空、不可得故。」",
        "translation": "Although bodhisattvas, mahāsattvas, and practitioners of the profound perfection of wisdom may be extremely zealous in their initial aspiration to perform the enlightening practice for sentient beings, they obtain nothing from that aspiration, obtain nothing from sentient beings, obtain nothing from great enlightenment, and obtain nothing from buddhas and bodhisattvas because all things and all sentient beings are inherently empty and unobtainable.\"",
        "source": "T07n0220_534:0741c12_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「若一切法都無所有，皆本性空、無所得者，云何菩薩摩訶薩行菩提行？",
        "translation": "It was then that the good manifestation then said to the Buddha, \"If all things are devoid of existence and are intrinsically empty and unobtainable, then how do bodhisattvas and mahāsattvas practice bodhi?",
        "source": "T07n0220_534:0741c16_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何能得無上菩提？」",
        "translation": "How can I attain unsurpassed bodhi?\"",
        "source": "T07n0220_534:0741c18_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha addressed the Śākyamuni, \"What do you think?",
        "source": "T07n0220_534:0741c19_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於先時，依止斷界，斷身見等諸煩惱結得無漏根，住無間定，證預流果，次一來果、次不還果、後阿羅漢果。",
        "translation": "At the time, you relied on the elimination of the objective realm, cut off the afflictive bonds of body views and so forth and attained uncontaminated faculties, abiding in uninterrupted concentration, realized the fruit of pre-flow, followed by the fruit of the first coming, the fruit of nonreturn, and then the fruit of the arhat.",
        "source": "T07n0220_534:0741c19_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於彼時，頗見有夢若心、若道、若諸道果有可得不？」",
        "translation": "At the time, did you see any dream, any mind, any path, or any result of the path that's attainable?\"",
        "source": "T07n0220_534:0741c22_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T07n0220_534:0741c23_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T07n0220_534:0741c23_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若汝彼時都無所得，云何言得阿羅漢果？」",
        "translation": "The Buddha addressed the Śākyamuni, \"If you had nothing to gain at that point, how could you say you had attained the fruit of the arhat?\"",
        "source": "T07n0220_534:0741c23_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「依世俗說，不依勝義。」",
        "translation": "The Śaṅgālī replied, \"Reliance on secular teachings, not on the ultimate truth.\"",
        "source": "T07n0220_534:0741c25_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śaṅgālī, \"So it is!",
        "source": "T07n0220_534:0741c25_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_534:0741c26_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_534:0741c26_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩亦復如是，依世俗說行菩提行得大菩提，不依勝義。",
        "translation": "So it is with all bodhisattvas, Mahāsattvas, who practice enlightening actions based on secular teachings and attain great enlightenment but don't rely on the ultimate truth.",
        "source": "T07n0220_534:0741c26_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_534:0741c28_70",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依世俗故，施設有色、受、想、行、識，廣說乃至依世俗故施設菩薩摩訶薩行，施設無上正等菩提，依世俗故，施設有情、菩薩、諸佛，不依勝義。",
        "translation": "It's based on conventionality to define form, feeling, perception, volition, and consciousness, and it's explained in detail up to and including the definition of the bodhisattva-mahāsattva practice and the definition of unsurpassed correct enlightenment based on conventionality to define sentient beings, bodhisattvas, and buddhas, not the ultimate truth.",
        "source": "T07n0220_534:0741c28_71",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_534:0742a02_72",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩不見有法能於無上正等菩提有增有減、有益有損，以一切法本性空故。",
        "translation": "\"Bodhisattvas, mahāsattvas don't see any dharmas that increase or decrease, benefit or detract from the unsurpassed correct enlightenment because all dharmas are inherently empty.",
        "source": "T07n0220_534:0742a02_73",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_534:0742a04_74",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法，觀本性空尚不可得，況初發心而有可得！",
        "translation": "For all dharmas, it's still impossible for bodhisattvas and mahāsattvas to contemplate the emptiness of their original nature, so why should it be possible for the first arousal of the intention to attain it?",
        "source": "T07n0220_534:0742a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最初發心尚不可得，況修初地乃至十地布施等六波羅蜜多、三十七種菩提分法、三解脫門乃至無量無邊佛法而有可得！",
        "translation": "When the initial arousal of the intention is still unobtainable, how could it be possible to cultivate the six perfections of generosity from the first ground up to the tenth ground, the thirty-seven factors of enlightenment, the three gates of liberation, or even the countless and limitless Buddha-teachings?",
        "source": "T07n0220_534:0742a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有可得，定無是處。",
        "translation": "If there were such a thing to attain, there would surely be no place for it.",
        "source": "T07n0220_534:0742a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, good performance!",
        "source": "T07n0220_534:0742a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多方便善巧，行菩提行證大菩提，度有情眾常無間斷。」",
        "translation": "Those bodhisattvas, mahāsattvas, and practitioners of profound prajñāpāramitā skillful means perform enlightening actions and realize great enlightenment, and they liberate sentient beings without interruption.\"",
        "source": "T07n0220_534:0742a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「若菩薩摩訶薩雖勤精進修行布施乃至般若波羅蜜多，安住內空乃至無性自性空，安住真如乃至不思議界，安住苦、集、滅、道聖諦，修行四念住乃至八聖道支，修行四靜慮、四無量、四無色定，修行空、無相、無願解脫門，修行八解脫乃至十遍處，修行極喜地乃至法雲地，修行一切陀羅尼門、三摩地門，修行五眼、六神通，修行如來十力乃至十八佛不共法，修行大慈、大悲、大喜、大捨，修行三十二大士相、八十隨好，修行無忘失法、恒住捨性，修行一切智、道相智、一切相智，修行菩薩摩訶薩行，修行無上正等菩提。",
        "translation": "爾時，善現復白佛言：「若菩薩摩訶薩雖勤精進修行布施乃至般若波羅蜜多，安住內空乃至無性自性空，安住真如乃至不思議界，安住苦、集、滅、道聖諦，修行四念住乃至八聖道支，修行四靜慮、四無量、四無色定，修行空、無相、無願解脫門，修行八解脫乃至十遍處，修行極喜地乃至法雲地，修行一切陀羅尼門、三摩地門，修行五眼、六神通，修行如來十力乃至十八佛不共法，修行大慈、大悲、大喜、大捨，修行三十二大士相、八十隨好，修行無忘失法、恒住捨性，修行一切智、道相智、一切相智，修行菩薩摩訶薩行，修行無上正等菩提。",
        "source": "T07n0220_534:0742a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩提道修未圓滿，不能證得無上菩提，云何菩薩摩訶薩修菩提道令得圓滿，能證無上正等菩提？」",
        "translation": "If the path of enlightenment is cultivated but not yet perfected, how does a bodhisattva-mahāsattva cultivate the path of enlightenment so that it's perfected and he can realize unsurpassed correct enlightenment?\"",
        "source": "T07n0220_534:0742a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩行深般若波羅蜜多方便善巧，由此方便善巧力故，修行布施波羅蜜多時，不得布施，不得施者，不得受者，不得所為，亦不遠離如是諸法而行布施波羅蜜多。",
        "translation": "The Buddha told Śaṅgālī, \"Suppose a bodhisattva-mahāsattva practices the skillful means of the profound prajñāpāramitā and, because of the power of these skillful means, when he cultivates the perfection of generosity, he can't give, give to whom he doesn't give, receive what he doesn't receive, or do anything, and he doesn't practice the perfection of generosity apart from such things.",
        "source": "T07n0220_534:0742a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩如是施時，則能圓滿修菩提道速得成就。",
        "translation": "When bodhisattvas and mahāsattvas thus give, they can then fully cultivate the path to enlightenment and quickly achieve it.",
        "source": "T07n0220_534:0742b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, good present!",
        "source": "T07n0220_534:0742b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多方便善巧，修菩提道令得圓滿，能證無上正等菩提。",
        "translation": "Those bodhisattvas, mahāsattvas, and buddhas practice the profound perfection of wisdom and skillful means, cultivate the path of enlightenment so that it's perfected, and are able to realize unsurpassed correct enlightenment.",
        "source": "T07n0220_534:0742b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於淨戒等波羅蜜多，乃至菩薩摩訶薩行，及佛無上正等菩提，隨其所應廣說亦爾。」",
        "translation": "This is also true of the perfections of pure precepts, the practices of bodhisattvas, the actions of bodhisattvas, and the unsurpassed correct enlightenment of buddhas, as they are explained in detail as appropriate.\"",
        "source": "T07n0220_534:0742b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子白佛言：「世尊！",
        "translation": "It was then that Śāriputra said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_534:0742b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，勇猛正勤修菩提道？」",
        "translation": "How do bodhisattvas and mahāsattvas courageously and correctly endeavor to cultivate the path of enlightenment when they practice the profound prajñāparamitā?\"",
        "source": "T07n0220_534:0742b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「若菩薩摩訶薩行深般若波羅蜜多時方便善巧，不和合色乃至識，不離散色乃至識；不和合眼處乃至意處，不離散眼處乃至意處；不和合色處乃至法處，不離散色處乃至法處；不和合眼界乃至意界，不離散眼界乃至意界；不和合色界乃至法界，不離散色界乃至法界；不和合眼識界乃至意識界，不離散眼識界乃至意識界；不和合眼觸乃至意觸，不離散眼觸乃至意觸；不和合眼觸為緣所生諸受乃至意觸為緣所生諸受，不離散眼觸為緣所生諸受乃至意觸為緣所生諸受；不和合地界乃至識界，不離散地界乃至識界；不和合因緣乃至增上緣，不離散因緣乃至增上緣；不和合從緣所生諸法，不離散從緣所生諸法；不和合無明乃至老死，不離散無明乃至老死；不和合布施乃至般若波羅蜜多，不離散布施乃至般若波羅蜜多；不和合內空乃至無性自性空，不離散內空乃至無性自性空；不和合真如乃至不思議界，不離散真如乃至不思議界；不和合苦、集、滅、道聖諦，不離散苦、集、滅、道聖諦；不和合四念住乃至八聖道支，不離散四念住乃至八聖道支；不和合四靜慮、四無量、四無色定，不離散四靜慮、四無量、四無色定；不和合空、無相、無願解脫門，不離散空、無相、無願解脫門；不和合八解脫乃至十遍處，不離散八解脫乃至十遍處；不和合淨觀地乃至如來地，不離散淨觀地乃至如來地；不和合極喜地乃至法雲地，不離散極喜地乃至法雲地；不和合陀羅尼門、三摩地門，不離散陀羅尼門、三摩地門；不和合五眼、六神通，不離散五眼、六神通；不和合如來十力乃至十八佛不共法，不離散如來十力乃至十八佛不共法；不和合大慈、大悲、大喜、大捨，不離散大慈、大悲、大喜、大捨；不和合三十二大士相、八十隨好，不離散三十二大士相、八十隨好；不和合無忘失法、恒住捨性，不離散無忘失法、恒住捨性；不和合一切智、道相智、一切相智，不離散一切智、道相智、一切相智；不和合預流果乃至獨覺菩提，不離散預流果乃至獨覺菩提；不和合一切菩薩摩訶薩行、諸佛無上正等菩提，不離散一切菩薩摩訶薩行、諸佛無上正等菩提。",
        "translation": "佛告舍利子：「若菩薩摩訶薩行深般若波羅蜜多時方便善巧，不和合色乃至識，不離散色乃至識；不和合眼處乃至意處，不離散眼處乃至意處；不和合色處乃至法處，不離散色處乃至法處；不和合眼界乃至意界，不離散眼界乃至意界；不和合色界乃至法界，不離散色界乃至法界；不和合眼識界乃至意識界，不離散眼識界乃至意識界；不和合眼觸乃至意觸，不離散眼觸乃至意觸；不和合眼觸為緣所生諸受乃至意觸為緣所生諸受，不離散眼觸為緣所生諸受乃至意觸為緣所生諸受；不和合地界乃至識界，不離散地界乃至識界；不和合因緣乃至增上緣，不離散因緣乃至增上緣；不和合從緣所生諸法，不離散從緣所生諸法；不和合無明乃至老死，不離散無明乃至老死；不和合布施乃至般若波羅蜜多，不離散布施乃至般若波羅蜜多；不和合內空乃至無性自性空，不離散內空乃至無性自性空；不和合真如乃至不思議界，不離散真如乃至不思議界；不和合苦、集、滅、道聖諦，不離散苦、集、滅、道聖諦；不和合四念住乃至八聖道支，不離散四念住乃至八聖道支；不和合四靜慮、四無量、四無色定，不離散四靜慮、四無量、四無色定；不和合空、無相、無願解脫門，不離散空、無相、無願解脫門；不和合八解脫乃至十遍處，不離散八解脫乃至十遍處；不和合淨觀地乃至如來地，不離散淨觀地乃至如來地；不和合極喜地乃至法雲地，不離散極喜地乃至法雲地；不和合陀羅尼門、三摩地門，不離散陀羅尼門、三摩地門；不和合五眼、六神通，不離散五眼、六神通；不和合如來十力乃至十八佛不共法，不離散如來十力乃至十八佛不共法；不和合大慈、大悲、大喜、大捨，不離散大慈、大悲、大喜、大捨；不和合三十二大士相、八十隨好，不離散三十二大士相、八十隨好；不和合無忘失法、恒住捨性，不離散無忘失法、恒住捨性；不和合一切智、道相智、一切相智，不離散一切智、道相智、一切相智；不和合預流果乃至獨覺菩提，不離散預流果乃至獨覺菩提；不和合一切菩薩摩訶薩行、諸佛無上正等菩提，不離散一切菩薩摩訶薩行、諸佛無上正等菩提。",
        "source": "T07n0220_534:0742b09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_534:0742c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法皆無自性，可令和合及離散故。",
        "translation": "Thus, all dharmas lack their own nature, which allows them to be combined and dispersed.",
        "source": "T07n0220_534:0742c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，舍利子！",
        "translation": "\"So it is, Śāriputra!",
        "source": "T07n0220_534:0742c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多時，勇猛正勤修菩提道。」",
        "translation": "When bodhisattvas and mahāsattvas practice the profound perfection of wisdom, they courageously and correctly diligently cultivate the path of enlightenment.\"",
        "source": "T07n0220_534:0742c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子復白佛言：「若一切法都無自性可令和合及離散者，云何菩薩摩訶薩引發般若波羅蜜多於中修學？",
        "translation": "Śāriputra then again said to the Buddha, \"If all things lack self-nature and can be brought together and separated, how do bodhisattvas and mahāsattvas trigger the cultivation of prajñāpāramitā in this way?",
        "source": "T07n0220_534:0742c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩不學般若波羅蜜多，終不能得所求無上正等菩提。」",
        "translation": "If a bodhisattva-mahāsattva doesn't train in the perfection of wisdom, he'll never attain the unsurpassed perfect enlightenment he seeks.\"",
        "source": "T07n0220_534:0742c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「如是！",
        "translation": "The Buddha told Śāriputra, \"So it is!",
        "source": "T07n0220_534:0742c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_534:0742c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_534:0742c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩不學般若波羅蜜多，終不能得所求無上正等菩提。",
        "translation": "If a bodhisattva-mahāsattva doesn't train in the perfection of wisdom, he'll never attain the unsurpassed perfect enlightenment he seeks.",
        "source": "T07n0220_534:0742c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T07n0220_534:0743a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩求證無上正等菩提，要學般若波羅蜜多乃能證得。",
        "translation": "If a bodhisattva-mahāsattva wants to realize unsurpassed correct enlightenment, he'll have to train in the perfection of wisdom to realize it.",
        "source": "T07n0220_534:0743a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T07n0220_534:0743a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩所求無上正等菩提，要有方便善巧乃能證得，非無方便善巧而能證得。",
        "translation": "The unsurpassed correct enlightenment sought by bodhisattvas and mahāsattvas can be realized only with skillful means, not without skillful means.",
        "source": "T07n0220_534:0743a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0743a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多時，若見有法自性可得則應可取，不見有法自性可得當何所取？",
        "translation": "When bodhisattvas and mahāsattvas practice the profound perfection of wisdom, if they see that the self-nature of a dharma is obtainable, then they should obtain it; when they don't see that the self-nature of a dharma is obtainable, what should they obtain?",
        "source": "T07n0220_534:0743a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂不取此是般若波羅蜜多，此是靜慮、精進、安忍、淨戒、布施波羅蜜多，此是色蘊乃至識蘊，此是眼處乃至意處，此是色處乃至法處，此是眼界乃至意界，此是色界乃至法界，此是眼識界乃至意識界，此是眼觸乃至意觸，此是眼觸為緣所生諸受乃至意觸為緣所生諸受，此是地界乃至識界，此是因緣乃至增上緣，此是從緣所生諸法，此是無明乃至老死，此是內空乃至無性自性空，此是真如乃至不思議界，此是苦、集、滅、道聖諦，此是四念住乃至八聖道支，此是四靜慮、四無量、四無色定，此是空、無相、無願解脫門，此是八解脫乃至十遍處，此是淨觀地乃至如來地，此是極喜地乃至法雲地，此是陀羅尼門、三摩地門，此是五眼、六神通，此是如來十力乃至十八佛不共法，此是大慈、大悲、大喜、大捨，此是三十二大士相、八十隨好，此是無忘失法、恒住捨性，此是一切智、道相智、一切相智，此是預流果乃至獨覺菩提，此是一切菩薩摩訶薩行，此是諸佛無上正等菩提，此是異生，此是聲聞，此是獨覺，此是菩薩摩訶薩，此是如來、應、正等覺。",
        "translation": "所謂不取此是般若波羅蜜多，此是靜慮、精進、安忍、淨戒、布施波羅蜜多，此是色蘊乃至識蘊，此是眼處乃至意處，此是色處乃至法處，此是眼界乃至意界，此是色界乃至法界，此是眼識界乃至意識界，此是眼觸乃至意觸，此是眼觸為緣所生諸受乃至意觸為緣所生諸受，此是地界乃至識界，此是因緣乃至增上緣，此是從緣所生諸法，此是無明乃至老死，此是內空乃至無性自性空，此是真如乃至不思議界，此是苦、集、滅、道聖諦，此是四念住乃至八聖道支，此是四靜慮、四無量、四無色定，此是空、無相、無願解脫門，此是八解脫乃至十遍處，此是淨觀地乃至如來地，此是極喜地乃至法雲地，此是陀羅尼門、三摩地門，此是五眼、六神通，此是如來十力乃至十八佛不共法，此是大慈、大悲、大喜、大捨，此是三十二大士相、八十隨好，此是無忘失法、恒住捨性，此是一切智、道相智、一切相智，此是預流果乃至獨覺菩提，此是一切菩薩摩訶薩行，此是諸佛無上正等菩提，此是異生，此是聲聞，此是獨覺，此是菩薩摩訶薩，此是如來、應、正等覺。",
        "source": "T07n0220_534:0743a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0743b01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，如實了知一切法性皆不可取，所謂般若乃至布施波羅蜜多皆不可取，色蘊乃至識蘊皆不可取，眼處乃至意處皆不可取，色處乃至法處皆不可取，眼界乃至意界皆不可取，色界乃至法界皆不可取，眼識界乃至意識界皆不可取，眼觸乃至意觸皆不可取，眼觸為緣所生諸受乃至意觸為緣所生諸受皆不可取，地界乃至識界皆不可取，因緣乃至增上緣皆不可取，從緣所生諸法皆不可取，無明乃至老死皆不可取，四念住乃至八聖道支皆不可取，內空乃至無性自性空皆不可取，真如乃至不思議界皆不可取，苦、集、滅、道聖諦皆不可取，四靜慮、四無量、四無色定皆不可取，空、無相、無願解脫門皆不可取，八解脫乃至十遍處皆不可取，淨觀地乃至如來地皆不可取，極喜地乃至法雲地皆不可取，陀羅尼門、三摩地門皆不可取，五眼、六神通皆不可取，如來十力乃至十八佛不共法皆不可取，大慈、大悲、大喜、大捨皆不可取，三十二大士相、八十隨好皆不可取，無忘失法、恒住捨性皆不可取，一切智、道相智、一切相智皆不可取，預流果乃至獨覺菩提皆不可取，一切菩薩摩訶薩行、諸佛無上正等菩提皆不可取，一切異生、聲聞、獨覺、菩薩、如來皆不可取。",
        "translation": "諸菩薩摩訶薩行深般若波羅蜜多，如實了知一切法性皆不可取，所謂般若乃至布施波羅蜜多皆不可取，色蘊乃至識蘊皆不可取，眼處乃至意處皆不可取，色處乃至法處皆不可取，眼界乃至意界皆不可取，色界乃至法界皆不可取，眼識界乃至意識界皆不可取，眼觸乃至意觸皆不可取，眼觸為緣所生諸受乃至意觸為緣所生諸受皆不可取，地界乃至識界皆不可取，因緣乃至增上緣皆不可取，從緣所生諸法皆不可取，無明乃至老死皆不可取，四念住乃至八聖道支皆不可取，內空乃至無性自性空皆不可取，真如乃至不思議界皆不可取，苦、集、滅、道聖諦皆不可取，四靜慮、四無量、四無色定皆不可取，空、無相、無願解脫門皆不可取，八解脫乃至十遍處皆不可取，淨觀地乃至如來地皆不可取，極喜地乃至法雲地皆不可取，陀羅尼門、三摩地門皆不可取，五眼、六神通皆不可取，如來十力乃至十八佛不共法皆不可取，大慈、大悲、大喜、大捨皆不可取，三十二大士相、八十隨好皆不可取，無忘失法、恒住捨性皆不可取，一切智、道相智、一切相智皆不可取，預流果乃至獨覺菩提皆不可取，一切菩薩摩訶薩行、諸佛無上正等菩提皆不可取，一切異生、聲聞、獨覺、菩薩、如來皆不可取。",
        "source": "T07n0220_534:0743b01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0743b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，如實了知一切法性不可取故，於一切法得無障礙。",
        "translation": "\"When bodhisattvas and mahāsattvas practice the profound perfection of wisdom, they truly understand the unacceptability of the nature of all things and attain unobstructed access to all things.",
        "source": "T07n0220_534:0743b26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T07n0220_534:0743b28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此不可取波羅蜜多即是無障波羅蜜多，如是無障波羅蜜多即是般若波羅蜜多，諸菩薩摩訶薩應於中學。",
        "translation": "This undesirable perfection is the unobstructed perfection, and such unobstructed perfection is the prajñāpāramitā, which bodhisattvas and Mahāsattvas should take up in their secondary schools.",
        "source": "T07n0220_534:0743b28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_534:0743c02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能於中學，於一切法都無所得，尚不得學，況得無上正等菩提！",
        "translation": "If a bodhisattva-mahāsattva can go through the middle way and attain nothing from all dharmas, he still won't be able to train, so how could he attain unsurpassed perfect enlightenment?",
        "source": "T07n0220_534:0743c02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況得般若波羅蜜多！",
        "translation": "How much more so when one attains the perfection of wisdom!",
        "source": "T07n0220_534:0743c04_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況得異生、聲聞、獨覺、菩薩、佛法！",
        "translation": "How much more so when you attain the teachings of unenlightened sentient beings, direct disciples, solitary realizers, bodhisattvas, and buddhas!",
        "source": "T07n0220_534:0743c04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_534:0743c05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_534:0743c05_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有少法實有自性。",
        "translation": "\"There are few things that really have an own-nature.",
        "source": "T07n0220_534:0743c05_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無自性一切法中，何等是異生法？",
        "translation": "Of all the dharmas that lack their own nature, what are the oppositely produced dharmas?",
        "source": "T07n0220_534:0743c06_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是預流乃至諸佛法？",
        "translation": "What are the stream-winner and even the buddha-dharmas?",
        "source": "T07n0220_534:0743c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_534:0743c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法既不可得，依何等法可施設有補特伽羅？",
        "translation": "Since such things are unobtainable, what kind of dharma can be attributed to the existence of a person in the pudgala?",
        "source": "T07n0220_534:0743c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "補特伽羅既不可得，云何可說此是異生、此是預流乃至如來、應、正等覺？」",
        "translation": "Since the pudgala is unobtainable, how can it be said that this is a different birth, this is a stream-enterer, or even a tathāgata, deserving, or perfectly enlightened one?\"",
        "source": "T07n0220_534:0743c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子便白佛言：「若一切法都無自性、皆非實有，依何等事而可了知此是異生，此是異生法？",
        "translation": "Śāriputra then said to the Buddha, \"If all dharmas lack their own nature and don't really exist, based on what kinds of things can we know that these are unenlightened beings and that these are unenlightened beings?",
        "source": "T07n0220_534:0743c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至此是如來、應、正等覺，此是如來、應、正等覺法？」",
        "translation": "Is it explained at length, up to the point where this is the Tathāgata, Worthy, and Completely Enlightened One, and is this the Tathāgata, Worthy, and Completely Enlightened One?\"",
        "source": "T07n0220_534:0743c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「於汝意云何？",
        "translation": "The Buddha told Śāriputra, \"What do you think?",
        "source": "T07n0220_534:0743c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為實有色，或曾、或當如諸愚夫異生執不？",
        "translation": "Is it true that there is form, or has been, or will be, as some foolish person might attach to it?",
        "source": "T07n0220_534:0743c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為實有受、想、行、識，或曾、或當如諸愚夫異生執不？",
        "translation": "Are there really sensation, perception, volition, and consciousness, or have they ever been or will they be, as foolish people attach to them?",
        "source": "T07n0220_534:0743c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至為實有諸佛無上正等菩提，或曾、或當如諸愚夫異生執不？",
        "translation": "Does it explain in detail whether there really are buddhas who have unsurpassed perfect enlightenment, or whether they have been or will be like some foolish heretic who clings to it?",
        "source": "T07n0220_534:0743c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為實有異生乃至如來、應、正等覺，或曾、或當如諸愚夫異生執不？」",
        "translation": "Are there really unenlightened people, even Tathāgatas, Arhats, and Fully Awakened Ones, who have been or will be like foolish people who cling to unenlightenedness?\"",
        "source": "T07n0220_534:0743c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子曰：「不也！",
        "translation": "Śāriputra said, \"No!",
        "source": "T07n0220_534:0743c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_534:0743c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但由顛倒愚夫異生有如是執。」",
        "translation": "But it's because of the mistaken attachment of foolish people who are different beings.\"",
        "source": "T07n0220_534:0743c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「諸菩薩摩訶薩行深般若波羅蜜多方便善巧，雖觀諸法都無自性、皆非實有，而依世俗發趣無上正等菩提，為諸有情方便宣說，令得正解離諸顛倒。」",
        "translation": "The Buddha told Śāriputra, \"Bodhisattvas Mahāsattvas practice the profound method of prajñāpāramitā with skillful means, even though they observe that all dharmas are without an own-nature and don't really exist, they aim for unsurpassed correct enlightenment based on conventionality and explain it to sentient beings in a way that causes them to attain correct understanding and leave the mistaken attachments.\"",
        "source": "T07n0220_534:0743c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子復白佛言：「云何菩薩摩訶薩行深般若波羅蜜多時方便善巧，由此方便善巧力故，雖觀諸法都無自性、皆非實有，而依世俗發趣無上正等菩提，為諸有情方便宣說，令得正解離諸顛倒？」",
        "translation": "Śāriputra then again said to the Buddha, \"What is the skillful means by which a bodhisattva-mahāsattva practices profound prajñāparamitā and the power of such skillful means that, although he observes that all things are without an own-nature and don't really exist, he arouses unsurpassed correct enlightenment based on conventionality and skillfully explains it for sentient beings, so that they may attain right understanding and escape from their mistakenness?\"",
        "source": "T07n0220_534:0743c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「諸菩薩摩訶薩行深般若波羅蜜多時，成就如是方便善巧，謂都不見少有實法可於中住，由於中住而有罣礙，由罣礙故而有退沒，由退沒故心便羸劣，心羸劣故便生懈怠。",
        "translation": "The Buddha told Śāriputra, \"When bodhisattvas and mahāsattvas practice the profound perfection of wisdom, they accomplish this skillful means of not seeing few real things that can be abided in, and because of their abiding in the middle, they become obstructed, and because of their obstruction, they fall back, and because of their falling back, their mind becomes weakened, and because of their weakened mind, laziness arises.",
        "source": "T07n0220_534:0743c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0744a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法都無實事，無我、我所，皆用無性而為自性，本性空寂，自相空寂。",
        "translation": "Because all things lack real things, lack self and what belongs to self, they all use their lack of nature as their own nature, are empty in nature and empty of their own characteristics.",
        "source": "T07n0220_534:0744a04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有一切愚夫異生迷謬顛倒，執著色蘊乃至識蘊，執著眼處乃至意處，執著色處乃至法處，執著眼界乃至意界，執著色界乃至法界，執著眼識界乃至意識界，執著眼觸乃至意觸，執著眼觸為緣所生諸受乃至意觸為緣所生諸受，執著地界乃至識界，執著因緣乃至增上緣，執著從緣所生諸法，執著無明乃至老死，執著布施乃至般若波羅蜜多，執著內空乃至無性自性空，執著真如乃至不思議界，執著苦、集、滅、道聖諦，執著四念住乃至八聖道支，執著四靜慮、四無量、四無色定，執著空、無相、無願解脫門，執著八解脫乃至十遍處，執著淨觀地乃至如來地，執著極喜地乃至法雲地，執著陀羅尼門、三摩地門，執著五眼、六神通，執著如來十力乃至十八佛不共法，執著大慈、大悲、大喜、大捨，執著三十二大士相、八十隨好，執著無忘失法、恒住捨性，執著一切智、道相智、一切相智，執著預流果乃至獨覺菩提，執著菩薩摩訶薩行，執著無上正等菩提，執著異生乃至如來、應、正等覺。",
        "translation": "唯有一切愚夫異生迷謬顛倒，執著色蘊乃至識蘊，執著眼處乃至意處，執著色處乃至法處，執著眼界乃至意界，執著色界乃至法界，執著眼識界乃至意識界，執著眼觸乃至意觸，執著眼觸為緣所生諸受乃至意觸為緣所生諸受，執著地界乃至識界，執著因緣乃至增上緣，執著從緣所生諸法，執著無明乃至老死，執著布施乃至般若波羅蜜多，執著內空乃至無性自性空，執著真如乃至不思議界，執著苦、集、滅、道聖諦，執著四念住乃至八聖道支，執著四靜慮、四無量、四無色定，執著空、無相、無願解脫門，執著八解脫乃至十遍處，執著淨觀地乃至如來地，執著極喜地乃至法雲地，執著陀羅尼門、三摩地門，執著五眼、六神通，執著如來十力乃至十八佛不共法，執著大慈、大悲、大喜、大捨，執著三十二大士相、八十隨好，執著無忘失法、恒住捨性，執著一切智、道相智、一切相智，執著預流果乃至獨覺菩提，執著菩薩摩訶薩行，執著無上正等菩提，執著異生乃至如來、應、正等覺。",
        "source": "T07n0220_534:0744a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「由此因緣，諸菩薩摩訶薩觀一切法都無實事，無我、我所，皆用無性而為自性，本性空寂，自相空寂。",
        "translation": "\"As a result of these causes and conditions, bodhisattvas mahāsattvas observe that all things lack real things, lack self and what belongs to self, and use their lack of nature as their own nature, and that their nature and characteristics are empty and tranquil.",
        "source": "T07n0220_534:0744a26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行深般若波羅蜜多，自立如幻師為有情說法，諸慳貪者為說布施，諸犯戒者為說淨戒，諸瞋忿者為說安忍，諸懈怠者為說精進，諸散亂者為說靜慮，諸惡慧者為說般若。",
        "translation": "They practice the profound perfection of wisdom and set themselves up as illusory teachers to teach sentient beings, those who are stingy and greedy to teach generosity, those who violate the precepts to teach pure precepts, those who are angry to teach patience, those who are lazy to teach effort, those who are distracted to teach meditation, and those who have bad wisdom to teach prajñā.",
        "source": "T07n0220_534:0744a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩安立有情令住布施乃至般若波羅蜜多已，復為宣說能出生死殊勝聖法，令諸有情依之修學，或得預流果，或得一來果，或得不還果，或得阿羅漢果，或得獨覺菩提，或入菩薩摩訶薩位，或住無上正等菩提。」",
        "translation": "After establishing sentient beings to abide in generosity and even the perfection of wisdom, the bodhisattva Mahāsattva then proclaims the extraordinary noble teaching that escapes birth and death so that sentient beings who train in it will either attain the fruit of pre-flow, the fruit of the first coming, the fruit of nonreturn, the fruit of the arhat, the enlightenment of the pratyekabuddha, enter the bodhisattva-mahāsattva stage, or abide in unsurpassed correct enlightenment.\"",
        "source": "T07n0220_534:0744b03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子復白佛言：「諸菩薩摩訶薩行深般若波羅蜜多時，云何不名有所得者？",
        "translation": "Śāriputra then again said to the Buddha, \"When bodhisattvas, mahāsattvas, and bodhisattvas practice the profound prajñāpāramitā, isn't it called something that has attained?",
        "source": "T07n0220_534:0744b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸有情實無所有，而令安住布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，復為宣說能出生死殊勝聖法，或令得預流果，乃至或令證得無上正等菩提。」",
        "translation": "It means that all sentient beings really don't have anything, but they are made to abide in generosity, pure morality, patience, effort, meditation, and the perfection of wisdom, and it's also taught that the extraordinary noble teaching that can escape birth and death may cause them to attain the fruit of pre-flow, or it may cause them to realize unsurpassed perfect enlightenment.\"",
        "source": "T07n0220_534:0744b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「諸菩薩摩訶薩行深般若波羅蜜多時，於諸有情非有所得。",
        "translation": "The Buddha told Śāriputra, \"When bodhisattvas and mahāsattvas practice the profound prajñāpāramitā, they don't attain anything for sentient beings.",
        "source": "T07n0220_534:0744b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_534:0744b15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩行深般若波羅蜜多時，不見有情少實可得，唯有世俗假說有情。",
        "translation": "When this bodhisattva Mahāsattva practices the profound perfection of wisdom, he doesn't see little real sentient beings to attain, but only worldly beings who are nominally described as sentient beings.",
        "source": "T07n0220_534:0744b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T07n0220_534:0744b17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多時，安住二諦，為諸有情宣說正法。",
        "translation": "When bodhisattvas and mahāsattvas practice the profound perfection of wisdom, they abide in two truths and explain the right teaching for sentient beings.",
        "source": "T07n0220_534:0744b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are the two?",
        "source": "T07n0220_534:0744b19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、世俗。",
        "translation": "The first is worldly.",
        "source": "T07n0220_534:0744b19_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、勝義。",
        "translation": "The second is the ultimate truth.",
        "source": "T07n0220_534:0744b19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_534:0744b19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖二諦中有情施設俱不可得，而諸菩薩摩訶薩行深般若波羅蜜多時方便善巧，為諸有情宣說法要，令諸有情聞正法已，於現法中尚不得我，何況當得所求聖果！",
        "translation": "Although the two truths are both unknowable in terms of the designations of sentient beings, when bodhisattvas, mahāsattvas, and bodhisattvas practice the profound perfection of wisdom, they skillfully explain the essentials of the Dharma for sentient beings, so that after hearing the right Dharma, sentient beings will not yet attain self in the present life, much less the noble fruit that they seek!",
        "source": "T07n0220_534:0744b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T07n0220_534:0744b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行深般若波羅蜜多方便善巧，雖為有情宣說法要，令修正行得所證果，而心於彼都無所得，了知諸法不可得故。」",
        "translation": "Although the bodhisattvas, the mahāsattvas, practice profound prajñāpāramitā and many skillful means to teach sentient beings the essentials of the Dharma and cause them to cultivate practices that lead to the realization of something, their minds attain nothing from them, knowing that the dharmas are unobtainable.\"",
        "source": "T07n0220_534:0744b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子便白佛言：「此諸菩薩摩訶薩是真菩薩摩訶薩，雖於諸法不得一性，不得異性，不得總性，不得別性，而著如是大功德鎧。",
        "translation": "Śāriputra then said to the Buddha, \"These bodhisattvas and mahāsattvas are true bodhisattvas and mahāsattvas who wear such a great armor of merit even though they don't understand the singularity, dissimilarity, totality, or specificity of dharmas.",
        "source": "T07n0220_534:0744b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由著如是大功德鎧，不生欲界，不生色界，不生無色界，不見有為界，不見無為界。",
        "translation": "Because they wear such a great armor of merit, they aren't born in the desire realm, aren't born in the form realm, aren't born in the formless realm, don't see the realm of being, and don't see the realm of nothingness.",
        "source": "T07n0220_534:0744b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖化有情令出三界，而於有情都無所得，亦復不得有情施設。",
        "translation": "Even though they transform sentient beings and cause them to escape the three realms, they gain nothing from them, and they can't lay claim to sentient beings.",
        "source": "T07n0220_534:0744c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情施設不可得故無縛無解，無縛解故無染無淨，無染淨故諸趣差別不可了知，諸趣差別不可了知故無業無煩惱，無業煩惱故亦無異熟果。",
        "translation": "Because the designations of sentient beings are unobtainable, there's no bondage and no liberation, and because there's no bondage and liberation, there's no defilement and no purity, and because there's no defilement and purity, the distinctions between the various paths are incomprehensible, the distinctions between the various paths are incomprehensible, so there's no action and no affliction, and because there's no action and affliction, there's also no results of retribution.",
        "source": "T07n0220_534:0744c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既無異熟果如何得有我及有情流轉諸趣生三界等種種差別？」",
        "translation": "Since there are no results of [karmic] maturation, how can there be a self and various kinds of distinctions among sentient beings as they transmigrate through the various destinies and are born in the three realms?\"",
        "source": "T07n0220_534:0744c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「如是！",
        "translation": "The Buddha told Śāriputra, \"So it is!",
        "source": "T07n0220_534:0744c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_534:0744c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_534:0744c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_534:0744c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有情類先有後無，菩薩、如來應有過失，先無後有理亦不然，諸趣輪迴有無亦爾。",
        "translation": "If sentient beings are first existent and then nonexistent, there should be a mistake on the part of the bodhisattvas and tathāgatas, and it's not true that they're first nonexistent and then existent, nor is it true that the transmigration of all destinies is existent or nonexistent.",
        "source": "T07n0220_534:0744c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，舍利子！",
        "translation": "Therefore, Śāriputra!",
        "source": "T07n0220_534:0744c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來出世、若不出世，法性常住真如、法界、不虛妄性終無改易。",
        "translation": "If the Tathāgata were to appear or not appear in the world, the eternally abiding true nature of dharmas, the Dharma realm, and their not-falsely-formed nature would never change.",
        "source": "T07n0220_534:0744c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法法性、法界、法住、法定、真如、實際猶如虛空，此中尚無我等可得，況有色等諸法可得！",
        "translation": "Since the Dharma nature, Dharma realm, Dharma abiding, legal, true, and actuality of all dharmas are like space, there's still no self or so to be found in them, so why should there be such dharmas as form to be found?",
        "source": "T07n0220_534:0744c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既無色等諸法可得，如何當有諸趣輪迴？",
        "translation": "Since there are no form or other dharmas to be attained, how could there be transmigration through various destinies?",
        "source": "T07n0220_534:0744c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸趣輪迴既不可得，如何當有成熟有情令其解脫？",
        "translation": "Since the transmigration of all destinies is unobtainable, how will there ever be sentient beings ripe for liberation?",
        "source": "T07n0220_534:0744c16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但依世俗假說為有。",
        "translation": "But it's conventionally and nominally described as existing.",
        "source": "T07n0220_534:0744c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0744c18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是法自性皆空。",
        "translation": "It's because the own-nature of such things is empty.",
        "source": "T07n0220_534:0744c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩從過去佛如實聞已，為脫有情顛倒執著，求趣無上正等菩提，於求趣時不作是念：『我於此法已得當得，令彼有情已度當度所執著處生死眾苦。』",
        "translation": "After truly hearing this from past buddhas, the bodhisattvas, mahāsattvas, in order to free sentient beings from their mistaken attachment and pursue unsurpassed correct enlightenment, don't think this when they pursue it: 'I have attained and will attain this teaching, so that those sentient beings will be saved and will be saved from the suffering of birth-and-death in the places to which they are attached.'",
        "source": "T07n0220_534:0744c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0744c22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩為脫有情顛倒執著，被功德鎧大誓莊嚴，勇猛正勤無所戀著，不退無上正等菩提，恒於菩提不生疑惑，謂：『我當得、不當得耶？』",
        "translation": "In order to free sentient beings from mistaken attachment, this bodhisattva Mahāsattva is adorned by the armor of merit and great vows, courageously and correctly endeavors without attachment, doesn't retrogress from unsurpassed perfect enlightenment, and constantly has no doubt about enlightenment, saying, 'Will I attain it or won't I attain it?'",
        "source": "T07n0220_534:0744c22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但正念言：『我定當得所求無上正等菩提，作諸有情真實饒益，謂令解脫迷謬顛倒諸趣輪迴受生死苦。』",
        "translation": "He simply says with correct mindfulness, 'I will surely attain the unsurpassed correct enlightenment I seek and will truly benefit sentient beings by liberating them from the misconceptions and mistaken transmigration of rebirths and the suffering of birth-and-death.'",
        "source": "T07n0220_534:0744c25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T07n0220_534:0744c28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩雖脫有情迷謬顛倒諸趣生死而無所得，唯依世俗說有是事。",
        "translation": "Although this bodhisattva Mahāsattva is liberated from the misconceptions and delusions of sentient beings who go through birth and death without ever attaining it, he only relies on conventional explanations to explain that there are such things.",
        "source": "T07n0220_534:0744c28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0745a01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，依帝網術化作無量百千俱胝那庾多眾，復化種種上妙飲食施幻有情皆令飽滿，作此事已歡喜唱言：『我已獲得廣大福聚。』",
        "translation": "Suppose a clever illusionist or one of his disciples creates an incalculably large multitude of hundreds of thousands of koṭīs of nayutas by relying on the art of Tiberias, and then creates various kinds of wonderful food and drink to feed all the illusory beings, rejoicing after doing so and saying, 'I've obtained a great stock of merit.'",
        "source": "T07n0220_534:0745a01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_534:0745a04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此巧幻師或彼弟子，實使有情得飽滿不？」",
        "translation": "Does this magician or his disciple really fill sentient beings up?\"",
        "source": "T07n0220_534:0745a04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子曰：「不也！",
        "translation": "Śāriputra said, \"No!",
        "source": "T07n0220_534:0745a05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T07n0220_534:0745a06_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利子：「菩薩摩訶薩亦復如是，從初發心，為欲度脫諸有情故，修行布施乃至般若波羅蜜多，安住內空乃至無性自性空，安住真如乃至不思議界，安住苦、集、滅、道聖諦，修行四念住乃至八聖道支，修行四靜慮、四無量、四無色定，修行空、無相、無願解脫門，修行八解脫乃至十遍處，修行極喜地乃至法雲地，修行陀羅尼門、三摩地門，修行五眼、六神通，修行如來十力乃至十八佛不共法，修行大慈、大悲、大喜、大捨，修行三十二大士相、八十隨好，修行無忘失法、恒住捨性，修行一切智、道相智、一切相智，圓滿菩薩大菩提道，成熟有情、嚴淨佛土。",
        "translation": "佛告舍利子：「菩薩摩訶薩亦復如是，從初發心，為欲度脫諸有情故，修行布施乃至般若波羅蜜多，安住內空乃至無性自性空，安住真如乃至不思議界，安住苦、集、滅、道聖諦，修行四念住乃至八聖道支，修行四靜慮、四無量、四無色定，修行空、無相、無願解脫門，修行八解脫乃至十遍處，修行極喜地乃至法雲地，修行陀羅尼門、三摩地門，修行五眼、六神通，修行如來十力乃至十八佛不共法，修行大慈、大悲、大喜、大捨，修行三十二大士相、八十隨好，修行無忘失法、恒住捨性，修行一切智、道相智、一切相智，圓滿菩薩大菩提道，成熟有情、嚴淨佛土。",
        "source": "T07n0220_534:0745a06_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_534:0745a18_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩雖作此事，而於有情及一切法都無所得，不作是念：『我以此法調伏如是諸有情類，令其遠離顛倒執著，不復往來受生死苦。』」",
        "translation": "Even though they do this, the bodhisattvas and mahāsattvas attain nothing from sentient beings and all dharmas and don't think, 'By this teaching, I've disciplined such a class of sentient beings, causing them to be free of mistaken attachment and not to undergo the pain of birth-and-death again in the past.'\"",
        "source": "T07n0220_534:0745a18_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現便白佛言：「世尊！",
        "translation": "It was then that the life-size Good Samaritan then said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_534:0745a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩大菩提道？",
        "translation": "What is the bodhisattva's great bodhi path?",
        "source": "T07n0220_534:0745a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行此道方便善巧，成熟有情、嚴淨佛土，速證無上正等菩提。」",
        "translation": "Bodhisattvas, mahāsattvas cultivate the skillful means of this path to ripen sentient beings, adorn and purify the Buddha-lands, and quickly realize unsurpassed perfect enlightenment.\"",
        "source": "T07n0220_534:0745a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩從初發心，所行布施乃至般若波羅蜜多，廣說乃至所行一切智、道相智、一切相智及餘無量無邊佛法，皆是菩薩大菩提道。",
        "translation": "The Buddha told Śaṅgālī, \"From the first arousal of the intention, the generosity and even the prajñāpāramitā that bodhisattvas, mahāsattvas, and the extensive explanation and practice of omniscience, knowledge of the path, knowledge of all characteristics, and the rest of the Buddha's teachings that are measureless and limitless are all part of the bodhisattva's great path to enlightenment.",
        "source": "T07n0220_534:0745a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行此道，方便善巧成熟有情、嚴淨佛土，速證無上正等菩提，而無有情、佛土等想。」",
        "translation": "By cultivating this path, the bodhisattvas and mahāsattvas skillfully and conveniently mature sentient beings, adorn and purify the Buddha land, and quickly realize unsurpassed perfect enlightenment without having any thoughts of sentient beings or the Buddha land.\"",
        "source": "T07n0220_534:0745a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「云何菩薩摩訶薩修行布施波羅蜜多時，方便善巧成熟有情？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"How do bodhisattvas, mahāsattvas, skillfully and conveniently ripen sentient beings when they practice the perfection of generosity?\"",
        "source": "T07n0220_534:0745b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「有菩薩摩訶薩修行布施波羅蜜多時方便善巧，自行布施亦勸他行布施，慇懃教誡教授彼言：『諸善男子！",
        "translation": "The Buddha told Śaṅgālī, \"When a bodhisattva practices the perfection of generosity, he skillfully gives of his own accord and encourages others to give, teaching and admonishing them with all diligence, saying, 'Good sons!",
        "source": "T07n0220_534:0745b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫著布施，若著布施當更受身，若更受身，由斯展轉當受無量無邊大苦。",
        "translation": "Don't be attached to charity; if you are attached to charity, you'll accept another body, and if you accept another body, you'll experience measureless and limitless suffering as a result of this continual transformation.",
        "source": "T07n0220_534:0745b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_534:0745b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝義諦中都無布施，亦無施者、受者、施物及諸施果，如是諸法本性皆空，本性空中無法可取，諸法空性亦不可取。』",
        "translation": "In the ultimate truth, there's no generosity, no giver, no recipient, no goods given, and no results of generosity; thus, all things are empty in nature, and there's nothing to be grasped in the sky of their nature, nor is the emptiness of things to be grasped.'",
        "source": "T07n0220_534:0745b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, good present!",
        "source": "T07n0220_534:0745b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，雖於有情自能行施亦勸他施，而於布施、施者、受者、施物、施果都無所得，如是布施波羅蜜多名無所得波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice the perfection of giving, even though they are able to practice giving on their own and encourage others to give to sentient beings, they gain nothing from the giving, the donor, the recipient, the goods given, or the result of the giving, and thus the perfection of giving is called the perfection of gainlessness.",
        "source": "T07n0220_534:0745b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_534:0745b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於此諸法無所得時，方便善巧能化有情住預流果，廣說乃至或趣無上正等菩提。",
        "translation": "When these things are unobtainable, the bodhisattva Mahāsattva skillfully and conveniently trains sentient beings to abide in the fruit of pre-flow, explaining it in detail or even heading for unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_534:0745b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, good present!",
        "source": "T07n0220_534:0745b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，成熟有情令得利樂。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of generosity, they ripen sentient beings for their benefit and joy.",
        "source": "T07n0220_534:0745b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_534:0745b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩自行布施，亦勸他行布施，恒正稱揚行布施法，歡喜讚歎行布施者。",
        "translation": "\"Suppose a bodhisattva-mahāsattva makes alms on his own, encourages others to make alms, always praises the practice of almsgiving correctly, and rejoices in and praises those who practice almsgiving.",
        "source": "T07n0220_534:0745b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行如是大布施已，或生剎帝利大族，或生婆羅門大族，或生長者大族，或生居士大族豐饒財寶，或作小王於小國土富貴自在，或作大王於大國土富貴自在，或作輪王於四洲界富貴自在。",
        "translation": "After cultivating such great generosity, that bodhisattva Mahāsattva might be born into a large family of bhadrīs, a large family of brāhmaṇas, a large family of elders, or a large family of householders who are rich and wealthy, or might become a small king who's wealthy and comfortable in a small land, a large king who's wealthy and comfortable in a large land, or a wheel-turning king who's wealthy and comfortable in the four continental realms.",
        "source": "T07n0220_534:0745b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩生如是等諸尊貴處，以四攝事攝諸有情，先教有情安住布施，由此漸次令住淨戒、安忍、精進、靜慮、般若，復令安住四靜慮、四無量、四無色定，復令安住三十七種菩提分法，復令安住三解脫門。",
        "translation": "\"Thus, the bodhisattva Mahāsattva gives rise to such venerable places and uses the four methods of collecting sentient beings, first teaching them to abide in generosity, then gradually causing them to abide in pure morality, patience, effort, meditation, and wisdom, then causing them to abide in the four meditations, the four immeasurable concentrations, and the four formless concentrations, then causing them to abide in the 37 factors of enlightenment, and then causing them to abide in the three gates of liberation.",
        "source": "T07n0220_534:0745b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩令諸有情住如是等諸善法已，或令趣入正性離生，得預流果乃至令得阿羅漢果，或令趣入正性離生，漸次證得獨覺菩提，或令趣入正性離生，漸次修學諸菩薩地，速趣無上正等菩提。",
        "translation": "After causing sentient beings to abide in such good qualities, the bodhisattva Mahāsattva either causes them to enter the correct nature of freedom from birth, attain the fruit of pre-flow or cause them to attain the fruit of the arhat, enters the correct nature of freedom from birth, gradually realizes pratyekabuddha's enlightenment, or enters the correct nature of freedom from birth, gradually cultivates the bodhisattva stages, and quickly arrives at unsurpassed correct enlightenment.",
        "source": "T07n0220_534:0745c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告彼言：『諸善男子！",
        "translation": "Again, he told them, 'Good sons!",
        "source": "T07n0220_534:0745c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當發大願速趣無上正等菩提，作諸有情勝饒益事。",
        "translation": "\"You must make the great vow to quickly achieve unsurpassed correct perfect enlightenment and do things that will surpass the benefits of sentient beings.",
        "source": "T07n0220_534:0745c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有情類虛妄分別所執諸法皆無自性，但由顛倒妄執為有，是故汝等當勤精進，自斷顛倒亦勸他斷，自脫生死亦令他脫，自得大利亦令他得。』",
        "translation": "All the things that sentient beings falsely discriminate and attach to as having no self-nature but are possessed because of mistaken belief; therefore, you must diligently exert yourselves to end your own mistakenness and encourage others to end it, to free yourselves from birth and death and cause others to be freed, and to obtain great benefits for yourselves and cause others to obtain them.'",
        "source": "T07n0220_534:0745c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百三十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 534",
        "source": "T07n0220_534:0745c12_0",
        "is_bad_quality": false
    }
]