[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5.3",
        "source": "T07n0220_536:0751a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六",
        "translation": "sixteen",
        "source": "T07n0220_536:0751a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_536:0751a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分佛國品第三十之二",
        "translation": "Thirty-two of the Third Part of the Buddhadhātu Chapter",
        "source": "T07n0220_536:0751a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_536:0751a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩摩訶薩眾應修如是嚴淨佛土，謂彼土中恒不聞有三種惡趣，亦不聞有諸惡見趣，亦不聞有貪、瞋、癡毒，亦不聞有男女形相，亦不聞有聲聞、獨覺，亦不聞有無常、苦等不如意事，亦不聞有攝受資具，亦不聞有我、我所執，亦不聞有隨眠、纏、結，亦不聞有顛倒執著，亦不聞有施設有情果位差別。",
        "translation": "\"Such a group of bodhisattvas, mahāsattvas, should cultivate the strict purification of the Buddha's land in such a way that there are never heard of the three bad destinies, nor are there heard of the destinies of bad views, nor are there heard of the poison of greed, anger, and delusion, nor are there heard of the physical appearance of men and women, nor are there heard of śrāvakas and solitary realizers, nor are there heard of such unsatisfactory things as impermanence and suffering, nor are there heard of the gathering in of possessions, nor are there heard of attachment to self and what belongs to self, nor are there heard of latent dormancy, entanglement, and bonds, nor are there heard of mistaken attachment, nor are there any distinctions in the status of the fruits of conditioned beings.",
        "source": "T07n0220_536:0751a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯聞說空、無相、無願、無生、無滅、無性等聲。",
        "translation": "They only hear the sounds of emptiness, signlessness, wishlessness, nonarising, noncessation, and nonnature.",
        "source": "T07n0220_536:0751a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂隨有情意樂差別，於樹林等內外物中，常有微風更相衝擊，發起種種微妙音聲。",
        "translation": "That is, according to the differences in sentient beings' intentions, in internal and external things like trees and forests, there's always a gentle breeze that pounds against each other, producing a variety of subtle sounds.",
        "source": "T07n0220_536:0751a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸音聲中說：『一切法皆無自性，無性故空，空故無相，無相故無願，無願故無生，無生故無滅。",
        "translation": "Among those sounds, they say, 'All things lack self-nature, are empty because of lack of nature, formless because of emptiness, wishless because of lack of form, unborn because of lack of wish, and ceasing because of lack of birth.'",
        "source": "T07n0220_536:0751a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此諸法本來寂靜、自性涅槃，如來出世、若不出世，諸法法性法爾常住。』",
        "translation": "From this, all things are originally quiescent and inherently nirvāṇa, and whether the Tathāgata appears or doesn't appear in the world, the Dharma nature of all things is always eternally abiding.'",
        "source": "T07n0220_536:0751a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂一切法無性、空等，彼佛土中諸有情類若晝、若夜、若立、若行、若臥、若坐，常聞如是妙法音聲。",
        "translation": "It means that all things are natureless and empty, and so forth, and in that Buddha land, sentient beings of all kinds always hear the sound of such wonderful things, whether during day or night, while standing, walking, lying down, or sitting.",
        "source": "T07n0220_536:0751a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know, good present!",
        "source": "T07n0220_536:0751a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩摩訶薩眾各住所居嚴淨佛土，證得無上正等覺時，十方如來、應、正等覺，皆共稱讚彼彼佛名，若諸有情得聞如是諸佛名者，必於無上正等菩提得不退轉。",
        "translation": "When each of these bodhisattvas, mahāsattvas, and their entrenchments in the Vairocana and Vairocana buddha lands are cleansed and purified, the tathāgatas, arhats, and correct enlightenment in the ten directions all praise the names of those buddhas, and if sentient beings hear the names of such buddhas, they surely will attain irreversibility in their unsurpassed correct enlightenment.",
        "source": "T07n0220_536:0751a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩摩訶薩眾各住所居嚴淨佛土，證得無上正等覺時，為諸有情宣說正法。",
        "translation": "When these bodhisattvas, mahāsattvas, and their congregations each live in an ornately pure Buddha land and realize unsurpassed correct perfect enlightenment, they explain the right teaching for sentient beings.",
        "source": "T07n0220_536:0751a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情聞已定不生疑，謂為是法、為非法等。",
        "translation": "After hearing it, sentient beings definitely won't have doubts about whether it's the right teaching or not.",
        "source": "T07n0220_536:0751a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_536:0751a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有情類達一切法皆即真如、法界、法性，一切是法無非法等。",
        "translation": "\"They are sentient beings who understand that all things are true natures, the Dharma realm, and the Dharma nature, and that all such things are not non-lawful and so forth.",
        "source": "T07n0220_536:0751a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, good present!",
        "source": "T07n0220_536:0751b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩摩訶薩眾皆能嚴淨如是佛土。",
        "translation": "This multitude of bodhisattvas, mahāsattvas, and buddhas can all adorn and purify the Buddha's land like this.",
        "source": "T07n0220_536:0751b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_536:0751b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩摩訶薩眾有所化生具不善根，未於諸佛、菩薩、獨覺及聲聞等種諸善根，為惡知識所攝受故，離善友故，不聞正法，常為種種我、有情見及諸見趣之所攝藏，墮在斷、常二邊偏執。",
        "translation": "\"Suppose there are bodhisattvas, mahāsattvas, and sentient beings who are born with unwholesome roots, haven't acquired the good roots of buddhas, bodhisattvas, solitary realizers, and direct disciples, are taken in by bad friends, don't hear the right teaching, and are always subsumed by various views of self, sentient beings, and the destinies of views, and fall into the partiality of the two extremes of nihilism and permanence.",
        "source": "T07n0220_536:0751b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有情類，自起邪執，亦常教他令起邪執，於非三寶起三寶想，於三寶中謂非三寶，毀謗正法讚歎邪法。",
        "translation": "Those sentient beings themselves form mistaken attachments, and they often teach others to form mistaken attachments, give rise to conceptions of the Three Treasures that aren't the Three Treasures, deny the Three Treasures among themselves, and denigrate the right Dharma and praise mistaken teachings.",
        "source": "T07n0220_536:0751b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，身壞命終墮諸惡趣受種種苦。",
        "translation": "As a result, they are destined to fall into various bad destinies and experience various kinds of suffering when their bodies are destroyed and their lives end.",
        "source": "T07n0220_536:0751b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩摩訶薩眾各住自土證得無上正等菩提，見彼有情輪迴生死受無量苦，以神通力方便化導，令捨惡見住正見中，從惡趣出生於人趣。",
        "translation": "Those bodhisattvas, mahāsattvas, and others who each live in their own land and realize unsurpassed correct perfect enlightenment, see that the transmigration of sentient beings through birth and death is subject to measureless suffering, and they use their supernormal powers to skillfully guide them, causing them to abandon bad views and abide in right views, and they're born from bad destinies into human destinies.",
        "source": "T07n0220_536:0751b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以種種神通方便，化導令住正定聚中，畢竟不復墮諸惡趣。",
        "translation": "He also uses various supernormal powers and skillful means to guide and cause them to abide in the correctly determined class of beings, so that after all, they won't fall into bad destinies again.",
        "source": "T07n0220_536:0751b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復令修習殊勝善根，命終得生嚴淨佛土，受用淨土大乘法樂。",
        "translation": "He also causes them to cultivate excellent good roots, so that at the end of their lives they'll be born in an ornately pure Buddha land and experience the bliss of the great vehicle teaching of the pure land.",
        "source": "T07n0220_536:0751b15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good present!",
        "source": "T07n0220_536:0751b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩摩訶薩眾皆能如是嚴淨佛土。",
        "translation": "\"These bodhisattvas, mahāsattvas, and others are all able to thus purify the Buddha's land.",
        "source": "T07n0220_536:0751b17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由所居土極清淨故，生彼有情於一切法不起虛妄分別猶豫，謂此是善法、此是非善法，此是有記法、此是無記法，此是世間法、此是出世間法，此是有漏法、此是無漏法，此是有為法、此是無為法。",
        "translation": "Because the land they live in is so pure, sentient beings are born who don't falsely hesitate to discriminate among all things, meaning that this is a good dharma and this is a non-good dharma, this is a marked dharma and this is an indeterminate dharma, this is a worldly dharma and this is a supramundane dharma, this is a contaminated dharma and this is an uncontaminated dharma, and this is a conditioned dharma and this is an unconditioned dharma.",
        "source": "T07n0220_536:0751b18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸如是等分別猶豫畢竟不生。",
        "translation": "After all, these kinds of discriminating hesitations don't arise.",
        "source": "T07n0220_536:0751b22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，彼有情類，定得無上正等菩提，轉妙法輪度有情眾。",
        "translation": "As a result, those sentient beings will surely attain unsurpassed correct perfect enlightenment and turn the wonderful wheel of the Dharma to save all sentient beings.",
        "source": "T07n0220_536:0751b23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0751b24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩嚴淨佛土功德之相，利益安樂一切有情。」",
        "translation": "This is the bodhisattva-mahāsattva's mark of the merit of adorned and purified Buddha-lands, which benefits and pleases all sentient beings.\"",
        "source": "T07n0220_536:0751b25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分宣化品第三十一之一",
        "translation": "Chapter Three, Chapter Thirty-One, Chapter One of the Chapter on Proclaiming the Buddha's Teaching",
        "source": "T07n0220_536:0751b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「是菩薩摩訶薩為住定聚、不定聚耶？」",
        "translation": "It was then that the good present said to the Buddha, \"Does the bodhisattva Mahāsattva abide in a class of meditation or a class of indeterminate meditation?\"",
        "source": "T07n0220_536:0751b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩皆住定聚。」",
        "translation": "The Buddha told the Good Shepherd, \"These bodhisattvas, mahāsattvas, all abide in the class of concentration.\"",
        "source": "T07n0220_536:0751b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「是菩薩摩訶薩住何定聚？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"What is the cluster of concentration in which the bodhisattvas, the mahāsattvas, abide?",
        "source": "T07n0220_536:0751c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞乘耶？",
        "translation": "What about the vehicle of the direct disciples?",
        "source": "T07n0220_536:0751c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺乘耶？",
        "translation": "what about the pratyekabuddha vehicle?",
        "source": "T07n0220_536:0751c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無上乘耶？」",
        "translation": "Is it the unsurpassed vehicle?\"",
        "source": "T07n0220_536:0751c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩住無上乘。」",
        "translation": "The Buddha told the Good Present, \"This is the bodhisattva Mahāsattva abiding in the unsurpassed vehicle.\"",
        "source": "T07n0220_536:0751c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「是菩薩摩訶薩為於何時名住定聚？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"When is this known as the bodhisattva-mahāsattva abiding in the concentration cluster?",
        "source": "T07n0220_536:0751c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初發心耶？",
        "translation": "Is it the first arousal of the intention to come forth?",
        "source": "T07n0220_536:0751c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不退位耶？",
        "translation": "does he not abdicate?",
        "source": "T07n0220_536:0751c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最後有耶？」",
        "translation": "Is it the last thing that exists?\"",
        "source": "T07n0220_536:0751c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「是菩薩摩訶薩若初發心、若不退位、若最後有，皆住定聚。」",
        "translation": "The Buddha told the Good Shepherd, \"If this is a bodhisattva-mahāsattva who first arouses the intention, if he doesn't retire from the stage, or if he is the last to exist, he's all abiding in a cluster of concentration.\"",
        "source": "T07n0220_536:0751c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「此住定聚諸菩薩摩訶薩墮惡趣不？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Do these bodhisattvas and mahāsattvas who abide in the class of concentration fall into a bad destiny?\"",
        "source": "T07n0220_536:0751c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩若住定聚，決定不墮諸惡趣中。」",
        "translation": "The Buddha told Śaṅgālī, \"If bodhisattvas, mahāsattvas, and bodhisattvas abide in the class of meditation, they surely won't fall into the bad destinies.\"",
        "source": "T07n0220_536:0751c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告善現：「於意云何？",
        "translation": "Again, he told Śaṅgālī, \"What do you think?",
        "source": "T07n0220_536:0751c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第八、預流、一來、不還、阿羅漢、獨覺墮惡趣不？」",
        "translation": "Does the eighth, premature, first-returner, nonreturner, arhat, or solitary realizer fall into a bad destiny?\"",
        "source": "T07n0220_536:0751c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T07n0220_536:0751c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T07n0220_536:0751c11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩亦復如是，從初發心修行布施乃至般若波羅蜜多及餘無量無邊佛法，伏斷一切惡不善法。",
        "translation": "The Buddha told Śubhavyūha, \"So it is with bodhisattvas, too, when they first set out to cultivate generosity up to the perfection of wisdom and the other measureless and limitless Buddha-teachings to subdue all bad and unskillful qualities.",
        "source": "T07n0220_536:0751c12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，墮諸惡趣必無是處。",
        "translation": "As a result, there's certainly no place for those who fall into bad destinies.",
        "source": "T07n0220_536:0751c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生長壽天亦無是處，謂於彼處諸勝善法不得現行。",
        "translation": "There's also no place to be born in a long-lived heaven, meaning that the excellent good qualities there won't be present.",
        "source": "T07n0220_536:0751c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩若生邊鄙，或生達絮、蔑戾車中，亦無是處，謂於彼處，不能修行殊勝善法，多起惡見不信因果，常樂習行諸穢惡業，不聞三寶亦無四眾。",
        "translation": "There's no place for a bodhisattva Mahāsattva to be born in a remote and despicable place or in a dasyu or a contemptible chariot, meaning that there he can't cultivate excellent good qualities, often gives rise to bad views and doesn't believe in the law of cause and effect, always enjoys the habituation of bad and filthy deeds, and doesn't hear of the Three Treasures or the Four Companions.",
        "source": "T07n0220_536:0751c16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩生邪見家，亦無是處，謂生彼家執著種種諸惡見趣，撥無妙行、惡行及果，不修諸善樂作眾惡故，諸菩薩不生彼家。",
        "translation": "There's no place for a bodhisattva Mahāsattva to be born in a household of wrong views, which is to say that he's born in a household that's attached to various bad views and destinies, that's open to no wonderful actions, bad actions, or results, and that doesn't cultivate good qualities and enjoys doing numerous bad deeds.",
        "source": "T07n0220_536:0751c20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "\"Furthermore, good manifestation!",
        "source": "T07n0220_536:0751c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩初發無上正等覺心，以勝意樂受行十種不善業道，亦無是處。」",
        "translation": "There's no place for bodhisattvas, mahāsattvas, and novices who have first arisen the mind of unsurpassed correct enlightenment to accept the ten kinds of unwholesome courses of action with superior intent.\"",
        "source": "T07n0220_536:0751c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「若菩薩摩訶薩從初發心成就如是善根功德不生惡處。",
        "translation": "Guoshou Shanjin then said to the Buddha, \"Suppose a bodhisattva-mahāsattva accomplishes such good roots and virtues from the first arousal of his mind and doesn't give rise to bad places.",
        "source": "T07n0220_536:0751c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故世尊每為眾說自本生事多百千種，於中亦有生諸惡處，爾時善根為何所在？」",
        "translation": "Why does the Bhagavān explain to people that there are hundreds of thousands of ways in which their original lives were created, and yet there are also places of evil that arise from them, and where are the good roots at that point?\"",
        "source": "T07n0220_536:0751c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩不由穢業受惡處身，但為利樂諸有情類，由故思願而受彼身，是故不應引之為難。」",
        "translation": "The Buddha told Śaṅgālī, \"Bodhisattvas, mahāsattvas, don't receive the bodies of bad places from defiled activity, but they receive those bodies for the benefit and welfare of all sentient beings because of their thoughts and wishes; therefore, they shouldn't be led to believe that it's difficult.\"",
        "source": "T07n0220_536:0751c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告善現：「於意云何？",
        "translation": "Again, he told Śaṅgālī, \"What do you think?",
        "source": "T07n0220_536:0752a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸獨覺或阿羅漢，方便善巧如諸菩薩摩訶薩眾，成就殊勝方便善巧，受傍生身，有獵者來欲為損害，便起無上安忍慈悲，欲令彼人得利樂故，自捨身命不害彼不？」",
        "translation": "Are there any solitary realizers or arhats who are skilled in skillful means like the bodhisattvas, mahāsattvas, who have accomplished excellent skillful means, who accept the body of an unenlightened person, who are hunters, who want to harm them, and then arouse compassion based on unsurpassed patience, who want to give up their lives and not harm them because they want them to attain benefit and happiness?\"",
        "source": "T07n0220_536:0752a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「諸獨覺等無如是事。」",
        "translation": "The Śaṅgāmin replied, \"It's not like that for solitary realizers and so forth.\"",
        "source": "T07n0220_536:0752a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「由此因緣，當知菩薩為欲利樂諸有情故，為大慈悲速圓滿故，為疾證得大菩提故，雖受種種傍生之身，而非傍生過失所染。」",
        "translation": "The Buddha told the Sun-fields, \"By these causes and conditions, you should know that although bodhisattvas accept the bodies of various animals for the purpose of wanting to benefit sentient beings, for the sake of quickly fulfilling great compassion, and for the sake of quickly realizing great bodhi, they aren't stained by the faults of those animals.\"",
        "source": "T07n0220_536:0752a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「諸菩薩摩訶薩住何善根，為欲利樂諸有情故受惡處身？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"What good roots do bodhisattvas and mahāsattvas abide in that allow them to accept the bodies of negative rebirths for the sake of bringing benefit to sentient beings?\"",
        "source": "T07n0220_536:0752a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩有何善根不應圓滿？",
        "translation": "The Buddha told Śubhavyūha, \"What are the good roots of the bodhisattvas, the mahāsattvas, that should not be perfected?",
        "source": "T07n0220_536:0752a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然諸菩薩摩訶薩眾為得無上正等菩提，一切善根皆應圓滿，謂諸菩薩摩訶薩眾從初發心乃至安坐妙菩提座，無有善根不應圓滿。",
        "translation": "Still, in order for bodhisattvas, mahāsattvas, and others to attain unsurpassed correct enlightenment, all good roots should be perfected, meaning that there are no good roots that shouldn't be perfected by bodhisattvas, mahāsattvas, from their first arousal of mind until they're seated on the marvelous throne of enlightenment.",
        "source": "T07n0220_536:0752a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要具圓滿一切善法，乃得無上正等菩提，若一善法未能圓滿，而得無上正等菩提，定無是處。",
        "translation": "Only when all good qualities are perfected will they attain unsurpassed correct enlightenment, and if they fail to perfect a single good quality and then attain unsurpassed correct enlightenment, there's certainly no place for it.",
        "source": "T07n0220_536:0752a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, well done!",
        "source": "T07n0220_536:0752a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩從初發心乃至安坐妙菩提座，於其中間常學圓滿一切善法，學已當得一切相智，永斷一切習氣相續，乃能證得一切智智。」",
        "translation": "From the first arousal of their minds until they are seated in the marvelous seat of enlightenment, bodhisattvas, mahāsattvas, and their mothers always train in the interval to perfect all good qualities, and after training, they will attain the knowledge of all characteristics and permanently eliminate the continuity of all habituated tendencies before they can realize the knowledge of all things.\"",
        "source": "T07n0220_536:0752a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「諸菩薩摩訶薩云何成就種種白淨聖無漏法，而生惡趣受傍生身？」",
        "translation": "It was then that the good manifestation then said to the Buddha, \"How do bodhisattvas, mahāsattvas, accomplish all kinds of white, pure, noble, and uncontaminated dharmas and yet are they born in a bad destiny and subject to the body of an evening creature?\"",
        "source": "T07n0220_536:0752a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha addressed the Śākyamuni, \"What do you think?",
        "source": "T07n0220_536:0752a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來成就一切白淨聖無漏不？」",
        "translation": "Has the Tathāgata accomplished all that is white and pure, holy and uncontaminated?\"",
        "source": "T07n0220_536:0752a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如來成就一切白淨聖無漏法。」",
        "translation": "The Śaṅgālī replied, \"The Tathāgata has accomplished all the white, pure, noble, and uncontaminated dharmas.\"",
        "source": "T07n0220_536:0752a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Śaṅgālī, \"What do you think?",
        "source": "T07n0220_536:0752a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來化作傍生趣身，利樂有情作佛事不？」",
        "translation": "Does the Tathāgata transform into the body of an animal being and perform Buddha-works for the benefit of sentient beings?\"",
        "source": "T07n0220_536:0752a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如來化作傍生趣身，利樂有情作諸佛事。」",
        "translation": "The Śaṇḍinya replied, \"The Tathāgata transforms into the body of an evening life, and he performs Buddha-works for the benefit of sentient beings.\"",
        "source": "T07n0220_536:0752a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Śaṅgālī, \"What do you think?",
        "source": "T07n0220_536:0752a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來化作傍生身時，是實傍生受彼苦不？」",
        "translation": "When the Tathāgata transforms into the body of an evening life, is this a real evening life that suffers?\"",
        "source": "T07n0220_536:0752a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如來化作傍生身時，非實傍生不受彼苦。」",
        "translation": "The good present replied, \"When the Tathāgata transforms into the body of an evening life, it's not really an evening life that doesn't experience that suffering.\"",
        "source": "T07n0220_536:0752b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩亦復如是，雖具成就種種白淨聖無漏法，而為成熟諸有情類，以故思願受傍生身，如應成熟諸有情類。",
        "translation": "The Buddha told Śaṇḍinya, \"So it is with bodhisattvas, mahāsattvas, and even though they've accomplished various white and pure noble and uncontaminated things, they want to mature sentient beings, so they consider accepting the body of an evening life as it should be to mature sentient beings.",
        "source": "T07n0220_536:0752b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_536:0752b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_536:0752b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有阿羅漢諸漏永盡，能化作身起諸事業，由彼事業生他喜不？」",
        "translation": "Are there arhats whose contaminants are permanently ended and who can transform themselves into bodies that produce works, and from those works does the joy of others arise?\"",
        "source": "T07n0220_536:0752b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「有阿羅漢諸漏永盡，能化作身起諸事業，由彼事業令他生喜。」",
        "translation": "The Śaṅgāmin replied, \"There are arhats whose contaminants are permanently ended, and they can create bodies that give rise to undertakings, and from those undertakings, they cause others to rejoice.\"",
        "source": "T07n0220_536:0752b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩亦復如是，雖具成就種種白淨聖無漏法，而為利樂諸有情類，以故思願受傍生身作諸佛事。",
        "translation": "The Buddha told Śaṇḍinya, \"So it is with bodhisattvas, mahāsattvas, who, despite having accomplished various white and pure noble and uncontaminated dharmas, contemplate accepting the bodies of unenlightened sentient beings to perform Buddha-works for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_536:0752b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖受彼身而不同彼受諸苦惱，亦不為彼過失所污。",
        "translation": "Even though they accept their bodies, they won't be subject to suffering and distress like those other beings, and they won't be stained by their faults and displacements.",
        "source": "T07n0220_536:0752b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_536:0752b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_536:0752b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有巧幻師或彼弟子，幻作種種象、馬等事，令眾人見歡喜踊躍，於彼有實象、馬等不？」",
        "translation": "Is there a magician or a disciple who conjures up various things like elephants and horses that cause people to see and rejoice, or are there real elephants and horses there?\"",
        "source": "T07n0220_536:0752b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「於彼無實象、馬等事。」",
        "translation": "The Śaṅgālī replied, \"There's no such thing as a real elephant or horse.\"",
        "source": "T07n0220_536:0752b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩亦復如是，雖具成就種種白淨聖無漏法，而為利樂諸有情類，以故思願受傍生身。",
        "translation": "The Buddha told Śaṇḍinya, \"So it is with bodhisattvas, mahāsattvas, who, despite having accomplished various white and pure noble and uncontaminated things, contemplate accepting the body of an unenlightened person for the benefit and welfare of sentient beings.",
        "source": "T07n0220_536:0752b15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖受彼身而實非彼，亦不為彼過失所污。」",
        "translation": "Even though they accept their bodies, they really aren't them, and they aren't stained by their faults.\"",
        "source": "T07n0220_536:0752b18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「諸菩薩摩訶薩如是廣大方便善巧，雖具成就種種白淨聖無漏法而為有情，以故思願方便善巧受種種身，隨其所宜現作饒益。",
        "translation": "The life-long Good Seer then said to the Buddha, \"Although bodhisattvas, mahāsattvas, and their skillful means are so vast that they've accomplished various white, pure, noble, and uncontaminated things for the benefit of sentient beings, they therefore contemplate skillfully accepting various kinds of bodies that will presently benefit them as they see fit.",
        "source": "T07n0220_536:0752b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_536:0752b22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩住何等法，能作如是方便善巧，雖受種種傍生等身，而不為彼過失所污？」",
        "translation": "What kind of things do bodhisattvas and mahāsattvas abide in that enable them to perform such skillful means that, although they are subject to the bodies of various other beings, they aren't defiled by their faults and displacements?\"",
        "source": "T07n0220_536:0752b22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩住深般若波羅蜜多，能作如是方便善巧。",
        "translation": "The Buddha told Śaṅgālī, \"Bodhisattvas and Mahāsattvas abide in the profound perfection of wisdom and are able to perform such skillful means.",
        "source": "T07n0220_536:0752b24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此方便善巧力故，雖往十方殑伽沙等諸佛世界，現種種身利益安樂諸有情類，而於其中不起染著。",
        "translation": "Because of this skillful means, even though they travel to sands of buddha-worlds in ten directions and manifest various bodies to benefit and comfort sentient beings, they don't become defiledly attached to them.",
        "source": "T07n0220_536:0752b26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_536:0752b28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切法都無所得，謂都不得能染、所染及染因緣。",
        "translation": "\"This is the bodhisattva-mahāsattva who obtains nothing from all things, which means that he doesn't obtain anything that's defiled, that's defiled, or the causes and conditions of defilement.",
        "source": "T07n0220_536:0752b29_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_536:0752c01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_536:0752c01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0752c02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空性不能染著空性，空亦不能染著餘法，亦無餘法能染著空。",
        "translation": "Emptiness can't stain emptiness, and emptiness can't stain other things, and there are no other things that can stain emptiness.",
        "source": "T07n0220_536:0752c02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_536:0752c03_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空中空性尚不可得，況有餘法而可得者！",
        "translation": "The nature of emptiness in space is still unknowable, so how could any other thing be knowable?",
        "source": "T07n0220_536:0752c04_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為不可得空，諸菩薩摩訶薩安住此中，能證無上正等菩提，轉妙法輪度有情眾。」",
        "translation": "This is called the inaccessible emptiness in which bodhisattvas, mahāsattvas, and sentient beings can realize unsurpassed perfect enlightenment and turn the wonderful Dharma wheel to save them all.\"",
        "source": "T07n0220_536:0752c05_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「諸菩薩摩訶薩為但安住甚深般若波羅蜜多，能作如是方便善巧，為亦安住諸餘法耶？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Why do bodhisattvas, mahāsattvas, only abide in the profound perfection of wisdom and skillful means like this, and why do they also abide in other things?\"",
        "source": "T07n0220_536:0752c07_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「豈有餘法，非深般若波羅蜜多之所攝受，而汝今者復為此問？」",
        "translation": "The Buddha told Śaṇḍinya, \"Is there any other dharma that isn't taken in by the profound perfection of wisdom, and you're asking this question again?\"",
        "source": "T07n0220_536:0752c09_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「甚深般若波羅蜜多自性既空，云何可說甚深般若波羅蜜多攝一切法？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Since the own-nature of the profound prajñāpāramitā is empty, how can it be said that the profound prajñāpāramitā subsumes all dharmas?",
        "source": "T07n0220_536:0752c11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非空法中可說有法攝、與不攝。」",
        "translation": "Among the things that aren't empty, it can be said that there are things that are included and those that aren't included.\"",
        "source": "T07n0220_536:0752c13_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「豈不諸法自性皆空。」",
        "translation": "The Buddha told Śaṅgālī, \"Isn't it true that the own-natures of all dharmas are empty?\"",
        "source": "T07n0220_536:0752c14_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "The skillful manifestation replied, \"So it is!",
        "source": "T07n0220_536:0752c14_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！」",
        "translation": "Thus!\"",
        "source": "T07n0220_536:0752c15_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若一切法自性皆空，豈不空中攝一切法？」",
        "translation": "The Buddha told Śubhavyūha, \"If the own-natures of all dharmas are empty, wouldn't air subsume all dharmas?\"",
        "source": "T07n0220_536:0752c15_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "The skillful manifestation replied, \"So it is!",
        "source": "T07n0220_536:0752c16_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！」",
        "translation": "Thus!\"",
        "source": "T07n0220_536:0752c16_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「由此因緣，甚深般若波羅蜜多攝一切法，當知菩薩摩訶薩眾住深般若波羅蜜多，能作如是方便善巧利益有情。」",
        "translation": "The Buddha told Śaṅgālī, \"Because of this cause and condition, the profound prajñāpāramitā subsumes all dharmas, you should know that the bodhisattvas, mahāsattvas, and others abide in the profound prajñāpāramitā and can perform such skillful means to benefit sentient beings.\"",
        "source": "T07n0220_536:0752c17_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現復白佛言：「云何菩薩摩訶薩行深般若波羅蜜多時，住一切法自性空中，引發神通波羅蜜多，住此神通波羅蜜多，能至十方殑伽沙等諸佛世界，供養恭敬諸佛世尊，於諸佛所聽受正法種諸善根？」",
        "translation": "It was then that the good present again said to the Buddha, \"How does the profound prajñāpāramitā that the bodhisattvas, mahāsattvas, practice give rise to the perfection of supernormal powers when they abide in the air of the own-nature of all things, and how can they abide in this perfection of supernormal powers and reach the sands of the buddha-worlds in the ten directions, making offerings to and respecting the buddhas and world-honored ones, and planting good roots by listening to and accepting the right teaching in those buddha-places?\"",
        "source": "T07n0220_536:0752c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩行深般若波羅蜜多，遍觀十方殑伽沙等諸佛世界及諸佛眾并所說法自性皆空，但有世俗施設名字說為世界、佛眾及法，如是世俗施設名字自性亦空。",
        "translation": "The Buddha told Śaṃnara, \"If a bodhisattva-mahāsattva practices the profound perfection of wisdom and observes the emptiness of all the buddha-worlds and buddha-speeches in the ten directions, but there are worldly designations that are described as worlds, buddha-speeches, and teachings, then such worldly designations are also empty in their own nature.",
        "source": "T07n0220_536:0752c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0752c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若十方界及諸佛眾并所說法施設名字自性不空，則所說空應成少分，以所說空非成少分故，一切法自性皆空，其理周圓無二、無別。",
        "translation": "If the imagined names of the worlds and buddhas in the ten directions and the teachings they give aren't empty in nature, then the emptiness that's explained should become a minority, and it's because the emptiness that's explained doesn't become a minority that all things are empty in nature, and their principle is complete, without duality or distinction.",
        "source": "T07n0220_536:0752c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0753a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩行深般若波羅蜜多，由遍觀空方便善巧，便能引發殊勝神通波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva's practice of the perfection of profound wisdom can lead to the perfection of excellent supernormal abilities based on the skillful means of pervasively observing emptiness.",
        "source": "T07n0220_536:0753a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住此神通波羅蜜多，復能引發天眼、天耳、神境、他心、宿住隨念及知漏盡微妙通慧。",
        "translation": "Abiding in this perfection of supernormal abilities also gives rise to the divine eye, divine ear, divine objects, other minds, recall of past lives, and the subtle insight to know the end of contaminants.",
        "source": "T07n0220_536:0753a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0753a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩非離神通波羅蜜多，有能自在成熟有情、嚴淨佛土，證得無上正等菩提。",
        "translation": "\"It's not apart from the perfection of supernormal powers that bodhisattvas, mahāsattvas, and neutered beings can naturally ripen sentient beings, adorn and purify the Buddha land, and realize unsurpassed correct enlightenment.",
        "source": "T07n0220_536:0753a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故神通波羅蜜多是菩提道，諸菩薩摩訶薩皆依此道求趣無上正等菩提，於求趣時，能自圓滿一切善法，亦能勸他修諸善法，雖作是事而於其中無所執著。",
        "translation": "Therefore, the perfection of supernormal powers is the path to enlightenment, and all bodhisattvas, mahāsattvas, and haṃsattvas pursue this path to unsurpassed correct enlightenment, perfecting all good qualities on their own while pursuing it and encouraging others to cultivate good qualities, even though they do so without attaching to them.",
        "source": "T07n0220_536:0753a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_536:0753a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩知諸善法自性皆空，非自性空有所執著，若有執著則有愛味，由無執著亦無愛味。",
        "translation": "\"This is the bodhisattva-mahāsattva who knows that the self-natures of good qualities are empty, that there's no attachment to emptiness as self-nature, that if there were attachment there would be a pleasant taste, and that because there's no attachment there would be no pleasant taste.",
        "source": "T07n0220_536:0753a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自性空中無愛味故，能味、所味及味因緣，於空法中皆不可得。",
        "translation": "Because there's no pleasant taste in self-nature emptiness, neither the tasting agent nor the tasted nor the causes and conditions of the taste can be obtained in emptiness.",
        "source": "T07n0220_536:0753a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0753a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩行深般若波羅蜜多，安住神通波羅蜜多，引發天眼清淨過人，用此天眼觀一切法自性皆空。",
        "translation": "\"This bodhisattva Mahāsattva practices the perfection of profound wisdom and abides in the perfection of supernormal powers, which gives rise to the divine eye that's purer than human beings, and with that divine eye he observes that the own-natures of all things are empty.",
        "source": "T07n0220_536:0753a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見一切法自性空故，不依法相造作諸業，雖為有情說如是法，而亦不得諸有情相及彼施設。",
        "translation": "Because they see the emptiness of the own-nature of all things, they don't create actions based on the characteristics of the Dharma, and even though they teach such things to sentient beings, they don't obtain the characteristics of sentient beings or their designations.",
        "source": "T07n0220_536:0753a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以無所得而為方便，引發菩薩殊勝神通，用此神通作所應作一切事業。",
        "translation": "This is the method by which the bodhisattva Mahāsattva uses the ungraspable to give rise to the bodhisattva's extraordinary supernormal powers, and he uses those powers to do all the work that should be done.",
        "source": "T07n0220_536:0753a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0753a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以極清淨過人天眼，遍觀十方殑伽沙等諸佛世界，見已引發神境智通往彼饒益諸有情類，或以布施乃至般若波羅蜜多而作饒益，或以三十七種菩提分法而作饒益，或以靜慮、無量、無色而作饒益，或以解脫、等持、等至而作饒益，或以空、無相、無願解脫門而作饒益，或以諸餘殊勝善法而作饒益，或以聲聞、獨覺、菩薩及諸佛法而作饒益。",
        "translation": "With the supremely pure divine eye of superhumans, the bodhisattva Mahāsattva observes the sands of the Buddha-realms in the ten directions, and when he sees that, he triggers visionary wisdom that leads to them to benefit sentient beings, either by generosity up to the perfection of wisdom, by the thirty-seven factors of enlightenment, by meditation, immeasurability, and formlessness, by liberation, equipoise, and equipoise, by the liberation through emptiness, signlessness, and wishlessness, or by other excellent good qualities, or by the teachings of śrāvakas, pratyekbuddhas, bodhisattvas, and other buddhas.",
        "source": "T07n0220_536:0753a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩遊十方界，若見有情慳貪多者，深生憐愍說如是法：『汝等有情當行布施。",
        "translation": "\"Thus, when the bodhisattva Mahāsattva travels to the worlds of the ten directions and sees that sentient beings are stingy and greedy, he deeply pities them and teaches this teaching: 'You sentient beings must practice generosity.",
        "source": "T07n0220_536:0753b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸慳貪者受貧窮苦，由貧窮故無有威德，不能自益，況能益他！",
        "translation": "Those who are stingy and greedy suffer from poverty, and because they're poor, they lack the virtue to benefit themselves, so how could they benefit others?",
        "source": "T07n0220_536:0753b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等當勤布施，既自安樂亦安樂他，莫以貧窮更相食噉，俱不解脫諸惡趣苦。』",
        "translation": "Therefore, you must diligently give alms, so that you can comfort yourselves and comfort others, and don't further feed and gnaw on each other because you're poor, for neither of you will be freed from the suffering of the bad destinies.'",
        "source": "T07n0220_536:0753b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若見有情毀淨戒者，深生憐愍說如是法：『汝等有情當持淨戒，諸破戒者受惡趣苦，破戒之人無有威德，不能自益，況能益他！",
        "translation": "\"If he sees sentient beings who violate the pure precepts, he has deep compassion for them and teaches this teaching: 'You sentient beings should observe the pure precepts; those who violate the precepts are subject to the suffering of bad destinies, and those who violate the precepts lack authoritative qualities; they can't benefit themselves, so how could they benefit others?'",
        "source": "T07n0220_536:0753b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破戒因緣墮諸惡趣，受苦異熟楚毒難忍，不能自濟，況能濟他！",
        "translation": "When the causes and conditions of violating the precepts lead to falling into the evil destinies, the pain and suffering of retribution are intolerable, and they cannot help themselves, how could they help others?",
        "source": "T07n0220_536:0753b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等當持淨戒，不應容納犯戒之心經一念頃，況經多時！",
        "translation": "Therefore, you must observe pure precepts, and you mustn't allow the thought of violating them to pass through even a moment, much less many hours!",
        "source": "T07n0220_536:0753b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫縱自心後生憂悔。』",
        "translation": "Don't allow your mind to give rise to regret later.'",
        "source": "T07n0220_536:0753b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若見有情更相瞋忿，展轉結恨互相損惱，深生憐愍說如是法：『汝等有情當修安忍，莫相瞋忿結恨相害。",
        "translation": "\"If he sees sentient beings who become angry again and continue to form grudges and hate each other, he has deep compassion for them and teaches this teaching: 'You sentient beings should cultivate patience and not become angry and form grudges that harm each other.",
        "source": "T07n0220_536:0753b14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸忿恨心不順善法，增長惡法招現衰損。",
        "translation": "Hateful thoughts don't conform to good qualities, and they increase bad qualities and bring about their downfall.",
        "source": "T07n0220_536:0753b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等由此忿恨心故，身壞命終當墮惡趣，受諸劇苦難有出期，是故汝等不應容納忿恨之心經一念頃，何況令其多時相續！",
        "translation": "As a result of these resentful thoughts, you'll be destined to fall into a bad destiny when your body breaks up and your life ends, and you'll experience terrible suffering that's difficult to escape from.",
        "source": "T07n0220_536:0753b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今者展轉相緣，應起慈悲作饒益事。』",
        "translation": "Now, as you continue to make connections, you should arouse compassion and perform acts of benefit.'",
        "source": "T07n0220_536:0753b20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若見有情懈怠懶惰，深生憐愍說如是法：『汝等有情當勤精進，莫於善法懈怠懶惰，諸懶惰者於諸善法及諸勝事皆不能成。",
        "translation": "\"If he sees that sentient beings are lazy and indolent, he has deep compassion for them and teaches this teaching: 'You sentient beings must make diligent effort not to be lazy and indolent about good qualities, for when you're lazy, you won't be able to achieve good qualities and excellent things.",
        "source": "T07n0220_536:0753b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等由斯墮諸惡趣受無邊苦，是故汝等不應容納懶惰之心經一念頃，何況令其多時相續！』",
        "translation": "As a result, you'll fall into bad destinies and experience limitless suffering; therefore, you shouldn't allow a lazy mind to go through even a single moment of thought, let alone allow it to continue for many hours!'",
        "source": "T07n0220_536:0753b24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若見有情失念散亂心不寂靜，深生憐愍說如是法：『汝等有情當修靜慮，莫起失念散亂之心，如是之心不順善法，增長惡法招現衰損。",
        "translation": "\"If he sees that the mind of sentient beings is distracted by loss of mindfulness and is not calm, he has deep compassion for them and teaches this teaching: 'You sentient beings must cultivate meditation and not give rise to a mind that's distracted by loss of mindfulness; such a mind doesn't accord with good qualities, and it produces the debilitation of bad qualities.",
        "source": "T07n0220_536:0753b26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等由此身壞命終，當墮惡趣受無邊苦，是故汝等不應容納失念散亂相應之心經一念頃，何況令其多時相續！』",
        "translation": "As a result, you'll be destined to fall into a bad destiny and experience limitless suffering when your body breaks up and your life ends; therefore, you shouldn't allow the mind associated with distracted thoughts to pass through a single moment of thought, let alone cause it to continue for many hours!'",
        "source": "T07n0220_536:0753b29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若見有情愚癡惡慧，深生憐愍說如是法：『汝等有情當修勝慧莫起惡慧，起惡慧者於諸善趣尚不能往，況得解脫！",
        "translation": "\"If he sees the foolish and mistaken wisdom of sentient beings, he has deep compassion for them and teaches this teaching, 'You sentient beings must cultivate superior wisdom and not give rise to bad wisdom; when you give rise to bad wisdom, you won't be able to go to the good destinies, so how could you attain liberation?'",
        "source": "T07n0220_536:0753c03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等由此惡慧因緣，當墮惡趣受無邊苦，是故汝等不應容納愚癡惡慧相應之心經一念頃，何況令其多時相續！』",
        "translation": "You will fall into a bad destiny and experience limitless suffering as a result of this bad wisdom; therefore, you shouldn't allow the mind associated with foolish bad wisdom to pass through a single moment of thought, much less cause it to continue for many hours!'",
        "source": "T07n0220_536:0753c05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若見有情貪欲多者，深生憐愍，方便令其修不淨觀。",
        "translation": "\"If someone sees that sentient beings have lots of desire, they'll have deep compassion for them, and he'll skillfully cause them to cultivate contemplation of impurity.",
        "source": "T07n0220_536:0753c08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見有情瞋恚多者，深生憐愍，方便令其修慈悲觀。",
        "translation": "If you see that sentient beings have a lot of anger, you will deeply pity them and skillfully cause them to cultivate contemplation of compassion.",
        "source": "T07n0220_536:0753c09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見有情愚癡多者，深生憐愍，方便令其修緣起觀。",
        "translation": "If he sees that sentient beings' foolishness is abundant, he deeply commiserates with them and skillfully causes them to cultivate contemplation of dependent arising.",
        "source": "T07n0220_536:0753c10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見有情憍慢多者，深生憐愍，方便令其修諸界觀。",
        "translation": "If he sees that there are many sentient beings who are proud, he'll deeply pity them and skillfully cause them to cultivate contemplation of the elements.",
        "source": "T07n0220_536:0753c11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見有情尋伺多者，深生憐愍，方便令其修持息念。",
        "translation": "If he sees that sentient beings are prone to discursive thought, he'll have deep compassion for them and will skillfully cause them to cultivate mindfulness of calming.",
        "source": "T07n0220_536:0753c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見有情失正道者，深生憐愍，方便令其趣入正道，謂聲聞道、或獨覺道、或菩薩道、或如來道，方便為彼說如是法：『汝等所執自性皆空，非空法中可有所執，以無所執為空相故。』",
        "translation": "If he sees that sentient beings have lost the right path, he has deep pity for them and skillfully leads them to the right path, which is the path of the direct disciples, the path of the solitary realizers, the path of the bodhisattvas, or the path of the Tathāgata, and skillfully explains this teaching for them: 'The essential nature of your attachments is empty, and there can be attachments to things that aren't empty because the absence of attachments is the characteristic of emptiness.'",
        "source": "T07n0220_536:0753c14_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good man!",
        "source": "T07n0220_536:0753c18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，要住神通波羅蜜多，方能自在宣說正法，利益安樂諸有情類。",
        "translation": "Only when bodhisattvas and mahāsattvas practice the perfection of profound wisdom and abide in the perfection of supernormal powers can they freely explain the right teaching and benefit and delight all sentient beings.",
        "source": "T07n0220_536:0753c18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_536:0753c20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩遠離神通波羅蜜多，不能自在宣說正法，與諸有情作利樂事。",
        "translation": "If a bodhisattva-mahāsattva is separated from the perfection of supernormal powers, he can't freely proclaim the right teaching and work for the benefit of sentient beings.",
        "source": "T07n0220_536:0753c21_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well know!",
        "source": "T07n0220_536:0753c22_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如鳥無翼，不能自在飛翔虛空遠有所至，諸菩薩摩訶薩亦復如是，若無神通波羅蜜多，不能自在宣說正法，與諸有情作利樂事。",
        "translation": "Like a bird without wings that can't fly freely through the sky and reach far away, so too do bodhisattvas, mahāsattvas, and without the perfection of their supernormal powers, they can't freely proclaim the right teaching and work for the benefit of sentient beings.",
        "source": "T07n0220_536:0753c23_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T07n0220_536:0753c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，應引發神通波羅蜜多，若引發神通波羅蜜多，即能自在宣說正法，隨意利樂諸有情類。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of profound wisdom, they should give rise to the perfection of supernormal powers, and if they give rise to the perfection of supernormal powers, they'll be able to freely proclaim the right teaching and follow the wishes of sentient beings for their benefit.",
        "source": "T07n0220_536:0753c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0753c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩以最清淨過人天眼，遍觀十方殑伽沙等諸佛世界，及觀生彼諸有情類，見已引發神境智通，經須臾間往至彼界，以他心智如實了知彼諸有情心、心所法，隨其所應為說法要，謂說布施乃至般若波羅蜜多，或說四念住乃至八聖道支，或說四靜慮、四無量、四無色定，或說空、無相、無願解脫門，或說八解脫乃至十遍處，或說陀羅尼門、三摩地門，或說內空乃至無性自性空，或說真如乃至不思議界，或說苦、集、滅、道聖諦，或說因緣乃至增上緣，或說從緣所生諸法，或說無明乃至老死，或說種種蘊、處、界門，或說聲聞道，或說獨覺道，或說菩薩道，或說菩提，或說涅槃，令彼有情聞此法已皆獲殊勝利益安樂。",
        "translation": "諸菩薩摩訶薩以最清淨過人天眼，遍觀十方殑伽沙等諸佛世界，及觀生彼諸有情類，見已引發神境智通，經須臾間往至彼界，以他心智如實了知彼諸有情心、心所法，隨其所應為說法要，謂說布施乃至般若波羅蜜多，或說四念住乃至八聖道支，或說四靜慮、四無量、四無色定，或說空、無相、無願解脫門，或說八解脫乃至十遍處，或說陀羅尼門、三摩地門，或說內空乃至無性自性空，或說真如乃至不思議界，或說苦、集、滅、道聖諦，或說因緣乃至增上緣，或說從緣所生諸法，或說無明乃至老死，或說種種蘊、處、界門，或說聲聞道，或說獨覺道，或說菩薩道，或說菩提，或說涅槃，令彼有情聞此法已皆獲殊勝利益安樂。",
        "source": "T07n0220_536:0753c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0754a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以最清淨過人天耳，能聞一切人非人聲。",
        "translation": "\"This bodhisattva Mahāsattva has the most pure divine ear that's superior to the human ear and can hear all human and nonhuman sounds.",
        "source": "T07n0220_536:0754a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此天耳，遍聞十方殑伽沙等諸佛世界一切如來、應、正等覺所說正法，聞已受持思惟義趣，隨所聞法能為有情如實宣說，或說布施乃至般若波羅蜜多，廣說乃至或說菩提，或說涅槃，令彼有情聞此法已皆獲殊勝利益安樂。",
        "translation": "From this divine ear, it can omnisciently hear the right teaching of all the tathāgatas, arhats, and virtually all the other buddha-worlds in the ten directions, and after hearing it, it can assimilate it, retain it, contemplate its meaning, and accurately explain it for sentient beings according to the teaching heard, whether it's about generosity or the perfection of wisdom, or whether it's about enlightenment or nirvāṇa, so that when sentient beings hear this teaching, they'll attain excellent benefit and well-being.",
        "source": "T07n0220_536:0754a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0754a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以最清淨他心智通，如實了知諸有情類心、心所法，隨其所應為說法要，謂說布施乃至般若波羅蜜多，廣說乃至或說菩提，或說涅槃，令彼有情聞此法已，皆獲殊勝利益安樂。",
        "translation": "With the most pure knowledge of other minds, the bodhisattva Mahāsattva truly knows the minds and mental factors of sentient beings and explains the essentials of the Dharma as they arise, which is to say that he teaches generosity up to the perfection of wisdom, explains it in detail, and perhaps teaches enlightenment or nirvāṇa, so that when sentient beings hear this teaching, they'll attain excellent benefit and well-being.",
        "source": "T07n0220_536:0754a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0754a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以淨宿住隨念智通，如實念知過去諸佛及弟子眾名等差別，若諸有情樂聞過去諸宿住事而獲益者，便為宣說諸宿住事，因斯方便為說正法，謂說布施乃至般若波羅蜜多，廣說乃至或說菩提，或說涅槃，令彼有情聞此法已皆獲殊勝利益安樂。",
        "translation": "Because of this knowledge of the knowledge of pure past lives, the bodhisattva Mahāsattva accurately recollects the names and distinctions of past buddhas and disciples, and if sentient beings are delighted to hear about the benefits of past lives, he then explains the events of those lives for them, and because of this method, he explains the right teaching, which is to say that he explains generosity up to the perfection of wisdom, and he explains it in detail, even if he explains enlightenment or nirvāṇa, so that when sentient beings hear this teaching, they'll attain excellent benefits and well-being.",
        "source": "T07n0220_536:0754a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0754b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以極迅疾神境智通，往至十方殑伽沙等諸佛世界，親近供養諸佛世尊，於諸佛所種諸善根，還歸本土為有情說諸佛土事，因斯方便為說正法，謂說布施乃至般若波羅蜜多，廣說乃至或說菩提，或說涅槃，令彼有情聞此法已，皆獲殊勝利益安樂。",
        "translation": "With supreme swiftness and supernormal abilities, that bodhisattva Mahāsattva travels to the sands of the buddha-worlds in the ten directions, becomes intimate with and makes offerings to the buddha-honored ones, plants good roots in the buddha-places, returns to his homeland, teaches sentient beings about the buddha-lands, and explains the right teaching because of this method, which is to say that he teaches generosity up to the perfection of wisdom, and explains it in detail, even teaching enlightenment or nirvāṇa, so that when sentient beings hear this teaching, they'll attain excellent benefits and well-being.",
        "source": "T07n0220_536:0754b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0754b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以隨所得漏盡智通，如實了知諸有情類漏盡未盡，亦如實知漏盡方便，為未盡者宣說法要，謂說布施乃至般若波羅蜜多，廣說乃至或說菩提，或說涅槃，令彼有情聞此法已皆獲殊勝利益安樂。",
        "translation": "With the knowledge of how to end the contaminants as they arise, the bodhisattva Mahāsattva truly knows that the contaminants in various sentient beings have ended and have not ended, and he also truly knows the method for ending the contaminants and explains the essentials of the Dharma for those who have not ended them, which is to say that he teaches generosity up to the perfection of wisdom and explains it in detail, whether he's talking about enlightenment or nirvāṇa, so that when sentient beings hear this teaching, they'll attain excellent benefit and well-being.",
        "source": "T07n0220_536:0754b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good man!",
        "source": "T07n0220_536:0754b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，應引發神通波羅蜜多。",
        "translation": "\"As bodhisattvas and mahāsattvas practice the profound perfection of wisdom, they should give rise to the perfection of supernormal powers.",
        "source": "T07n0220_536:0754b14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修習神通波羅蜜多得圓滿故，隨意所樂受種種身，不為苦樂過失所染，如佛化身雖能施作種種事業，而不為彼苦樂過失之所雜染。",
        "translation": "Because they cultivate the perfection of the perfection of supernormal powers, bodhisattvas and mahāsattvas experience a variety of bodies as they wish and aren't stained by the discomforts of suffering and pleasure, just as the transformation body of a Buddha can perform various tasks but isn't stained by the discomforts of suffering and pleasure.",
        "source": "T07n0220_536:0754b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good performance!",
        "source": "T07n0220_536:0754b19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，應遊戲神通波羅蜜多，若遊戲神通波羅蜜多，則能成熟有情、嚴淨佛土，疾能證得一切智智。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of profound wisdom, they should play with the perfection of supernormal powers, and if they play with the perfection of supernormal powers, they'll be able to ripen sentient beings, adorn and purify the Buddha's land, and quickly realize the wisdom of omniscience.",
        "source": "T07n0220_536:0754b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_536:0754b22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩不成熟有情、嚴淨佛土，終不能得一切智智。",
        "translation": "If the bodhisattvas, mahāsattvas, don't mature sentient beings and adorn and purify the Buddha's land, they'll never attain the knowledge of omniscience.",
        "source": "T07n0220_536:0754b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_536:0754b24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩菩提資糧若未圓滿，必不能得一切智智。」",
        "translation": "If the bodhisattvas, mahāsattvas, and their accumulation of enlightenment hasn't been fully completed, they surely won't be able to attain the cognition of all knowables.\"",
        "source": "T07n0220_536:0754b24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「何等名為諸菩薩摩訶薩菩提資糧；諸菩薩摩訶薩圓滿如是菩提資糧，方能證得一切智智？」",
        "translation": "It was then that the good present then said to the Buddha, \"What are the bodhisattvas, the mahāsattvas, and what are the bodhisattvas' fulfillment of such bodhisattva accumulation before they can realize the cognition of all things?\"",
        "source": "T07n0220_536:0754b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「一切善法皆是菩薩菩提資糧，諸菩薩摩訶薩圓滿如是菩提資糧，方能證得一切智智。」",
        "translation": "The Buddha told the Good Present, \"All good qualities are the bodhisattvas' accumulation of enlightenment, and it's only when bodhisattvas, mahāsattvas, and bodhisattvas complete such accumulation of enlightenment that they can realize the wisdom of omniscience.\"",
        "source": "T07n0220_536:0754b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為一切善法？」",
        "translation": "Guishou Shōshō then said to the Buddha, \"What's called all good qualities?\"",
        "source": "T07n0220_536:0754c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩從初發心修行布施乃至般若波羅蜜多，於中都無分別執著，謂作是念：『此是布施乃至般若波羅蜜多，由此、為此而修布施乃至般若波羅蜜多。』",
        "translation": "The Buddha told Śaṅgālī, \"From the very first moment they set out to cultivate generosity ... the perfection of wisdom, bodhisattvas and mahāsattvas have no discriminating attachments, which are thoughts like, 'This is generosity ... the perfection of wisdom, and it's from this and for this that they cultivate generosity ... the perfection of wisdom.'",
        "source": "T07n0220_536:0754c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是三分別執著都無，知一切法自性空故。",
        "translation": "These three kinds of discriminating attachments are all nonexistent, and it's because they know that the self-nature of all things is empty.",
        "source": "T07n0220_536:0754c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此所修布施等六波羅蜜多，能自饒益，亦能饒益一切有情令出生死得涅槃故，說為善法，亦名菩薩菩提資糧，亦名菩薩摩訶薩道。",
        "translation": "Because this cultivation of the six perfections of generosity and so forth can benefit oneself and all sentient beings and cause them to escape birth-and-death and attain nirvāṇa, it's called a good teaching, the bodhisattva's accumulation of enlightenment, and the bodhisattva-mahāsattva path.",
        "source": "T07n0220_536:0754c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去未來現在菩薩摩訶薩眾行此道故，已得今得當得無上正等菩提，亦令有情已、當、今度生死大海證涅槃樂。",
        "translation": "Because many past, future, and present bodhisattvas and mahāsattvas practice this path, they have attained, will now attain, and will attain unsurpassed perfect enlightenment, and they cause sentient beings to realize the bliss of nirvāṇa after having, in the future, and in the present by liberating the ocean of birth-and-death.",
        "source": "T07n0220_536:0754c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_536:0754c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩從初發心修四靜慮及四無量、四無色定，修四念住乃至八聖道支，安住內空乃至無性自性空，安住真如乃至不思議界，安住苦、集、滅、道聖諦，修空、無相、無願解脫門，修八解脫乃至十遍處，修諸菩薩摩訶薩地，修陀羅尼門、三摩地門，修佛十力乃至十八佛不共法，修大慈、大悲、大喜、大捨，修無忘失法、恒住捨性，修一切智、道相智、一切相智，於中都無分別執著，謂作是念：『此是四靜慮廣說乃至一切相智，由此、為此而修四靜慮廣說乃至一切相智。』",
        "translation": "諸菩薩摩訶薩從初發心修四靜慮及四無量、四無色定，修四念住乃至八聖道支，安住內空乃至無性自性空，安住真如乃至不思議界，安住苦、集、滅、道聖諦，修空、無相、無願解脫門，修八解脫乃至十遍處，修諸菩薩摩訶薩地，修陀羅尼門、三摩地門，修佛十力乃至十八佛不共法，修大慈、大悲、大喜、大捨，修無忘失法、恒住捨性，修一切智、道相智、一切相智，於中都無分別執著，謂作是念：『此是四靜慮廣說乃至一切相智，由此、為此而修四靜慮廣說乃至一切相智。』",
        "source": "T07n0220_536:0754c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是三分別執著都無，知一切法自性空故。",
        "translation": "These three kinds of discriminating attachments are all nonexistent, and it's because they know that the self-nature of all things is empty.",
        "source": "T07n0220_536:0754c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此所修四靜慮等，能自饒益，亦能饒益一切有情令出生死得涅槃故，說為善法，亦名菩薩菩提資糧，亦名菩薩摩訶薩道。",
        "translation": "Because this cultivation of the four meditations and so forth can benefit themselves and all sentient beings and cause them to escape birth-and-death and attain nirvāṇa, it's called a good teaching, the bodhisattva's accumulation of enlightenment, and the bodhisattva-mahāsattva path.",
        "source": "T07n0220_536:0754c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去未來現在菩薩摩訶薩眾行此道故，已得當得今得無上正等菩提，亦令有情已、今、當度生死大海證涅槃樂。",
        "translation": "Because many past, future, and present bodhisattvas and mahāsattvas practice this path, they have attained, will attain, and will attain unsurpassed perfect enlightenment, and they cause sentient beings to realize the bliss of nirvāṇa after having crossed the great ocean of birth-and-death, now, and in the future.",
        "source": "T07n0220_536:0754c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0755a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量諸菩薩眾所修功德，皆名善法，亦名菩薩菩提資糧，亦名菩薩摩訶薩道。",
        "translation": "\"Furthermore, there are measureless bodhisattvas who cultivate merits that are called good qualities, which are also called the bodhisattvas' accumulation of enlightenment and the bodhisattva-mahāsattva path.",
        "source": "T07n0220_536:0755a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩要修如是諸勝善法令極圓滿，方能證得一切智智，要已證得一切智智，乃能無倒轉正法輪，令諸有情脫生死苦證得究竟常樂涅槃。」",
        "translation": "Only when bodhisattvas, mahāsattvas, and bodhisattvas cultivate such excellent good qualities and perform them to the utmost completion can they realize omniscience, and only after realizing omniscience can they turn the right Dharma wheel without error and cause sentient beings to escape the suffering of birth-and-death and realize the ultimate nirvāṇa of permanence and bliss.\"",
        "source": "T07n0220_536:0755a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「若此諸法是菩薩法，復有何等名佛法耶？」",
        "translation": "It was then that the good manifestation then said to the Buddha, \"If these things are bodhisattva qualities, what else do they call buddha qualities?\"",
        "source": "T07n0220_536:0755a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「即菩薩法亦名佛法。",
        "translation": "The Buddha told Śaṅgālī, \"That is, bodhisattva dharmas are also called Buddha dharmas.",
        "source": "T07n0220_536:0755a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩於一切法覺一切相，由此當得一切相智，永斷一切習氣相續。",
        "translation": "It means that bodhisattvas perceive all characteristics in all things, and as a result, they'll attain the knowledge of all characteristics and permanently end the continuity of all habituated tendencies.",
        "source": "T07n0220_536:0755a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來、應、正等覺，於一切法以一剎那相應般若現等覺已，證得無上正等菩提。",
        "translation": "If tathāgatas, arhats, and correct enlightenment come into existence after manifesting virtual enlightenment associated with a single moment in all things, they'll realize unsurpassed correct enlightenment.",
        "source": "T07n0220_536:0755a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩與佛有異。",
        "translation": "This is called a bodhisattva who's different from a Buddha.",
        "source": "T07n0220_536:0755a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如二聖者雖俱是聖，而有行向、住果差別，所成就法非不有異。",
        "translation": "Although the two sages are both sages, they have differences in their courses of conduct and abodes of accomplishment, and the things they accomplish are not necessarily different.",
        "source": "T07n0220_536:0755a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, Sunetra!",
        "source": "T07n0220_536:0755a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無間道中行於一切法，未離闇障，未到彼岸，未得自在，未得果時，名為菩薩。",
        "translation": "If someone practices all things in the path of instantaneity before they've parted with the dark hindrances, reached the other shore, attained independence, and attained fruition, they're called a bodhisattva.",
        "source": "T07n0220_536:0755a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若解脫道中行於一切法，已離闇障、已到彼岸，已得自在，已得果時，乃名為佛。",
        "translation": "If someone practices all things in the path to liberation and has parted with the dark hindrances, reached the other shore, attained independence, and attained fruition, then they're called a buddha.",
        "source": "T07n0220_536:0755a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩與佛有異，由位有異法非無別，而不可說法性有異。」",
        "translation": "This is a difference between a bodhisattva and a Buddha, because the states are different and the qualities aren't distinct, but it can't be said that the nature of the qualities is different.\"",
        "source": "T07n0220_536:0755a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現便白佛言：「若一切法自相皆空，自相空中云何得有種種差別，謂此是地獄乃至此是天，此是種性廣說乃至此是如來？",
        "translation": "Guoshou Shancheng then said to the Buddha, \"If all things are empty in their own nature, how could there be various distinctions in their own nature, meaning this is hell and this is heaven, and this is the seed nature explained in detail and this is the Tathāgata?",
        "source": "T07n0220_536:0755a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說補特伽羅既不可得，彼所造業亦不可得，如所造業既不可得，彼異熟果亦不可得。",
        "translation": "As it's said, since Pudgala is unobtainable, the actions he creates are also unobtainable, and as the actions he creates are unobtainable, so are the results of his retribution.",
        "source": "T07n0220_536:0755a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何得有種種差別？」",
        "translation": "How can there be various kinds of distinctions?\"",
        "source": "T07n0220_536:0755a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_536:0755a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_536:0755a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "\"As you've said.",
        "source": "T07n0220_536:0755a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法自相空，自相空中補特伽羅既無所有，業果異熟亦無所有，無所有中無差別相。",
        "translation": "'The own-identity of all things is empty, and since Potala has nothing in the own-identity, the results of karma ripening also have nothing, and there are no discriminating characteristics in that nothingness.'",
        "source": "T07n0220_536:0755a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然諸有情於一切法自相空理不能盡知，造作諸業或善、或惡、或復無漏，由於善業造作增長，生天、人中，由於惡業造作增長，墮三惡趣。",
        "translation": "However, sentient beings who don't fully understand the principle of the emptiness of all things in their own nature and who create actions that are either good, bad, or uncontaminated will be born among gods and humans because of the growth of the creation of good actions and will fall into the three evil destinies because of the growth of the creation of bad actions.",
        "source": "T07n0220_536:0755a28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善業中，由於定業造作增長，得生色界或無色界，由無漏業加行根本，有種性等賢聖差別。",
        "translation": "Among the good actions, because of the growth of the actions created in concentration, they'll be born in the form realm or the formless realm, and because of the root of the application of uncontaminated actions, there's a distinction between good and noble in terms of their seed nature.",
        "source": "T07n0220_536:0755b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，諸菩薩摩訶薩修行布施乃至般若波羅蜜多，乃至修行一切相智及餘無量無邊佛法。",
        "translation": "As a result, bodhisattvas, mahāsattvas, cultivate generosity up to the perfection of wisdom, and even cultivate omniscience and the other measureless and limitless Buddha dharmas.",
        "source": "T07n0220_536:0755b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於此所說菩提分法，無間無缺修令圓滿。",
        "translation": "\"Thus, the bodhisattvas, mahāsattvas, cultivate the factors of enlightenment described here without gap or deficiency, and cause them to be perfected.",
        "source": "T07n0220_536:0755b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既圓滿已，便能引發近助菩提金剛喻定，證得無上正等菩提，與諸有情作大饒益常無失壞，無失壞故，令諸有情解脫生死證得常樂清涼涅槃。」",
        "translation": "Once they've completed it, they can then induce the adamantine concentration that's a close aid to enlightenment, realize unsurpassed perfect enlightenment, work for the great benefit of sentient beings without loss, and without loss, cause sentient beings to be liberated from birth and death and realize nirvāṇa of eternal bliss and coolness.\"",
        "source": "T07n0220_536:0755b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「佛證無上正等覺已，為得諸趣生死法耶？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"After realizing unsurpassed correct perfect enlightenment, did the Buddha attain the state of birth-and-death in all destinies?\"",
        "source": "T07n0220_536:0755b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不爾！」",
        "translation": "The Buddha said, \"No!\"",
        "source": "T07n0220_536:0755b12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「佛證無上正等覺已，為得黑業、白業、黑白業、非黑白業耶？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"After realizing unsurpassed perfect enlightenment, did the Buddha attain black karma, white karma, black and white karma, and non-black and white karma?\"",
        "source": "T07n0220_536:0755b13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不爾！」",
        "translation": "The Buddha said, \"No!\"",
        "source": "T07n0220_536:0755b14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「若佛不得諸趣生死及業差別，云何施設此是地獄乃至人、天，此是種性乃至如來分位差別？」",
        "translation": "Kauśāmbī again said to the Buddha, \"If the Buddha doesn't allow distinctions in birth-and-death and karma in the various destinies, how would he define these as hells and even humans and gods, and these as distinctions in seed nature and even the Tathāgata's status?\"",
        "source": "T07n0220_536:0755b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸有情類自知諸法自相空不？」",
        "translation": "The Buddha addressed the Śākyamuni, \"Do all sentient beings know for themselves that all things are empty in their own nature?\"",
        "source": "T07n0220_536:0755b17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T07n0220_536:0755b18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T07n0220_536:0755b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若諸有情自知諸法自相空者，諸菩薩摩訶薩便於無上正等菩提，不應求證方便善巧，拔諸有情惡趣生死。",
        "translation": "The Buddha told Śaṅgālī, \"If sentient beings knew for themselves that the own characteristics of dharmas are empty, then bodhisattvas, mahāsattvas, would attain unsurpassed perfect enlightenment and wouldn't seek to realize the skillful means to remove the bad destinies of birth and death for sentient beings.",
        "source": "T07n0220_536:0755b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸有情不知諸法自相空故，輪迴諸趣受無邊苦。",
        "translation": "It's because sentient beings don't know that the own characteristics of things are empty that they are reborn into various destinies and experience limitless suffering.",
        "source": "T07n0220_536:0755b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩從諸佛所聞一切法自相空已，為欲饒益諸有情故，求證無上正等菩提，方便善巧拔諸有情惡趣生死。",
        "translation": "Therefore, after hearing from the buddhas about the emptiness of the own-nature of all things, the bodhisattvas seek to realize unsurpassed correct perfect enlightenment in order to benefit sentient beings, and they skillfully and conveniently remove the bad destinies of birth and death from sentient beings.",
        "source": "T07n0220_536:0755b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_536:0755b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩常作是念：『非一切法實有自相，如諸愚夫異生所執。",
        "translation": "All bodhisattvas and mahāsattvas always think, 'It's not true that all things have their own characteristics, as foolish people attach to ordinary beings.",
        "source": "T07n0220_536:0755b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼分別顛倒力故，非實有中起實有想，於無我中起於我想，廣說乃至無見者中起見者想。",
        "translation": "Still, because of the power of their mistaken discrimination, thoughts of real existence arise when there's not real existence, thoughts of self arise when there's no self, and, as explained in detail, thoughts of viewers arise when there are no viewers.",
        "source": "T07n0220_536:0755b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無色中起於色想，無受、想、行、識中起受、想、行、識想，廣說乃至無無為中起無為想。",
        "translation": "It also gives rise to conceptions of form in the absence of form, conceptions of feeling, perception, volition, and consciousness in the absence of feeling, perception, volition, and consciousness, and, as explained in detail, conceptions of nonbeing in the absence of nonbeing.",
        "source": "T07n0220_536:0755b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是分別顛倒力故，非實有中起實有想，虛妄執著倒亂其心，造身、語、意善、不善業，不能解脫惡趣生死，我當拔濟令得解脫。』",
        "translation": "As a result of the power of mistaken discrimination, thoughts of real existence arise when there's not real existence, and false attachments confuse the mind and create good and unskillful actions of body, speech, and thought that are incapable of liberating from the bad destinies of birth and death, which I will rescue and cause to be liberated.'",
        "source": "T07n0220_536:0755c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩作此念已，行深般若波羅蜜多，以諸善法攝在其中，無倒修行諸菩薩行，漸次圓滿菩提資糧。",
        "translation": "After this thought, the bodhisattva Mahāsattva practices the profound perfection of wisdom, taking in the good qualities within them and cultivating the bodhisattva practices without error, gradually perfecting the necessary preparations for enlightenment.",
        "source": "T07n0220_536:0755c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提資糧得圓滿已，證得無上正等菩提。",
        "translation": "After fulfilling the necessary accumulation of bodhi, he then realizes unsurpassed perfect enlightenment.",
        "source": "T07n0220_536:0755c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得菩提已，為諸有情宣說開示分別建立四聖諦義，謂此是苦聖諦，此是苦集聖諦，此是苦滅聖諦，此是趣苦滅道聖諦。",
        "translation": "After attaining enlightenment, he explains, discloses, discerns, and establishes for sentient beings the meaning of the four noble truths, which are the noble truth of suffering, the noble truth of suffering's accumulation, the noble truth of suffering's cessation, and the noble truth of the path to suffering's cessation.",
        "source": "T07n0220_536:0755c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以一切菩提分法，攝在如是四聖諦中。",
        "translation": "Furthermore, these are the four noble truths in which all the factors of enlightenment are included.",
        "source": "T07n0220_536:0755c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復依一切菩提分法，施設建立佛、法、僧寶，由此三寶出現世間，諸有情類解脫生死。",
        "translation": "Also, based on all the factors of enlightenment, they define and establish the treasures of Buddha, Dharma, and Saṃgha, from which these three treasures appear in the world and sentient beings are freed from birth and death.",
        "source": "T07n0220_536:0755c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情不能歸信佛、法、僧寶，造作諸業輪迴諸趣受苦無窮故，應歸依佛、法、僧寶，勤求自他利益安樂。」",
        "translation": "If sentient beings are unable to place their trust in the buddhas, Dharma, and saṃgha treasures and create actions that take them around to various destinies and suffer endlessly, they should place their trust in the buddhas, Dharma, and saṃgha treasures and diligently seek their own benefit and well-being.\"",
        "source": "T07n0220_536:0755c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現便白佛言：「為由苦、集、滅、道聖諦，諸有情類證般涅槃？",
        "translation": "It was then that the good manifestation then said to the Buddha, \"Is it because of the noble truths of suffering, arising, cessation, and the path that all sentient beings realize parinirvāṇa?",
        "source": "T07n0220_536:0755c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為由苦、集、滅、道聖智，諸有情類證般涅槃？」",
        "translation": "Is it because of the noble cognition of suffering, arising, cessation, and the path that all sentient beings realize parinirvāṇa?\"",
        "source": "T07n0220_536:0755c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「非由苦、集、滅、道聖諦，諸有情類證般涅槃；非由苦、集、滅、道聖智，諸有情類證般涅槃。",
        "translation": "The Buddha told Shancheng, \"It's not from the noble truths of suffering, arising, ceasing, and the path that sentient beings attain parinirvāṇa; it's not from the noble wisdom of suffering, arising, ceasing, and the path that sentient beings attain parinirvāṇa.",
        "source": "T07n0220_536:0755c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good performance!",
        "source": "T07n0220_536:0755c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我說四聖諦平等性即是涅槃，如是涅槃非由苦、集、滅、道諦證，非由苦、集、滅、道智證，但由般若波羅蜜多證平等性名證涅槃。」",
        "translation": "I say that the equality of the four noble truths is nirvāṇa, and such nirvāṇa is not realized by the truth of suffering, arising, ceasing, and the path, nor by the knowledge of suffering, arising, ceasing, and the path, but by the realization of the equality of the prajñāpāramitā that is called the realization of nirvāṇa.\"",
        "source": "T07n0220_536:0755c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為四聖諦平等性？」",
        "translation": "Kauśāmbī again said to the Buddha, \"What's called the equality of the four noble truths?\"",
        "source": "T07n0220_536:0755c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若於是處，無苦、集、滅、道諦，無苦、集、滅、道智，名四聖諦平等之性，此平等性即四聖諦。",
        "translation": "The Buddha told Śaṅgālī, \"If there were no truths of suffering, arising, cessation, and the path, and no knowledge of suffering, arising, cessation, and the path, that would be called the equality of the four noble truths, and this equality would be the four noble truths.",
        "source": "T07n0220_536:0755c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有真如廣說乃至不思議界，如來出世、若不出世，性相常住無失壞、無變易，如是名為四聖諦平等性。",
        "translation": "The extensively explained and inconceivable realms in which the Tathāgata appears or doesn't appear in the world and whose nature and characteristics are eternally abiding, not subject to loss or change, are thus called the equality of the four noble truths.",
        "source": "T07n0220_536:0755c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多時，為欲隨覺此四聖諦平等性故，行深般若波羅蜜多。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of profound prajñā in order to follow the realization of the equality of these four noble truths, they practice the perfection of profound prajñā.",
        "source": "T07n0220_536:0756a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能隨覺此四聖諦平等性時，名真隨覺一切聖諦，速證無上正等菩提。」",
        "translation": "When they can truly awaken to the equality of these four noble truths, that's called truly awakening to all the noble truths and quickly realizing unsurpassed correct perfect enlightenment.\"",
        "source": "T07n0220_536:0756a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「云何菩薩摩訶薩行深般若波羅蜜多時，為欲隨覺此四聖諦平等性故，行深般若波羅蜜多。",
        "translation": "Guoshou Shancheng then said to the Buddha, \"When a bodhisattva Mahāsattva practices profound prajñāpāramitā, he practices profound prajñpāramitā because he wants to awaken to the equality of these four noble truths.",
        "source": "T07n0220_536:0756a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能隨覺此四聖諦平等性時，名真隨覺一切聖諦，不墮聲聞、獨覺等地，趣入菩薩正性離生？」",
        "translation": "When they can truly awaken to the equality of these four noble truths, is that called truly awakening to all the noble truths, not falling into the stages of śrāvaka or pratyekabuddha, and then proceeding to the bodhisattva's correct nature of freedom from birth?\"",
        "source": "T07n0220_536:0756a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩行深般若波羅蜜多時，無有少法不如實見。",
        "translation": "The Buddha told Shancheng, \"When bodhisattvas and mahāsattvas practice the profound prajñāpāramitā, there's not a single thing they don't truly see.",
        "source": "T07n0220_536:0756a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法如實見時，於一切法都無所得。",
        "translation": "When they truly see all things, they have nothing to gain from all things.",
        "source": "T07n0220_536:0756a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法無所得時，則如實見一切法空，謂如實見四諦所攝及所不攝諸法皆空。",
        "translation": "When all things are unobtainable, then they truly see the emptiness of all things, which is to say that they truly see the emptiness of all things that are included in the four truths and all things that are not included in them.",
        "source": "T07n0220_536:0756a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見時，能入菩薩正性離生。",
        "translation": "When they see it that way, they can enter the bodhisattva's correct nature and part with birth.",
        "source": "T07n0220_536:0756a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由能入菩薩正性離生故，便住菩薩種性地中。",
        "translation": "Because they can enter the bodhisattva's correct nature and escape birth, they then abide in the ground of the bodhisattva's nature.",
        "source": "T07n0220_536:0756a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既住菩薩種性地中，則能決定不從頂墮，若從頂墮應墮聲聞或獨覺地。",
        "translation": "Once they abide in the ground of the bodhisattva's nature, then they can be certain that they won't fall from the top, or if they did, they would fall into the stage of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_536:0756a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩安住菩薩種性地中，起四靜慮及四無量、四無色定。",
        "translation": "Such a bodhisattva-mahāsattva abides in the bodhisattva's ground of nature and produces the four meditations, the four immeasurable, and the four formless concentrations.",
        "source": "T07n0220_536:0756a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩安住如是奢摩他地，便能決擇一切法性，及能隨悟四聖諦理。",
        "translation": "Once the bodhisattva Mahāsattva is settled in this stabilizing state of calming the mind, he'll be able to discern the nature of all dharmas and awaken to the principle of the four noble truths accordingly.",
        "source": "T07n0220_536:0756a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，菩薩雖遍知苦而能不起緣執苦心，雖永斷集，而能不起緣執集心，雖能證滅而能不起緣執滅心，雖能修道而能不起緣執道心。",
        "translation": "At that point, although the bodhisattva has full knowledge of suffering, he's able to refrain from arousing the mind conditioned by attachment to suffering, although he permanently ends accumulation, he's able to refrain from arousing the mind conditioned by attachment to accumulation, although he's able to realize cessation, he's able to refrain from arousing the mind conditioned by attachment to cessation, and although he's able to cultivate the path, he's able to refrain from arousing the mind conditioned by attachment to the path.",
        "source": "T07n0220_536:0756a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但起隨順、趣向、臨入菩提之心，如實覺知諸法實相。」",
        "translation": "They simply give rise to the mind of following, heading toward, and approaching enlightenment, and they truly perceive the true characteristics of dharmas.\"",
        "source": "T07n0220_536:0756a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百三十六",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 536",
        "source": "T07n0220_536:0756a25_0",
        "is_bad_quality": false
    }
]