[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百五",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 405",
        "source": "T07n0220_453:0284c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三",
        "translation": "thirteen",
        "source": "T07n0220_453:0284c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_453:0284c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二分增上慢品第六十之二",
        "translation": "Second Part of the Chapter on Pride in Aggregates (60bis)",
        "source": "T07n0220_453:0284c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_453:0284c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩未久修行布施、淨戒、安忍、精進、靜慮般若波羅蜜多，乃至遠離方便善巧故，為惡魔之所誑惑，勸諸菩薩應善覺知？",
        "translation": "How do bodhisattvas and mahāsattvas who have not long cultivated the prajñāpāramitā of generosity, pure precepts, patience, exertion, and meditation, even when they are free from skillful means, become deluded by evil demons, and bodhisattvas are encouraged to well perceive this?",
        "source": "T07n0220_453:0284c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有惡魔為誑惑故，方便化作種種形像，來至菩薩摩訶薩前，作如是言：『咄哉！",
        "translation": "It means that a bad demon, in order to deceive, skillfully transforms itself into various forms and comes to the bodhisattva Mahāsattva and says, 'Duh!",
        "source": "T07n0220_453:0284c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "男子！",
        "translation": "Man!",
        "source": "T07n0220_453:0284c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝自知不？",
        "translation": "Do you know it yourself?",
        "source": "T07n0220_453:0284c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去諸佛已曾授汝大菩提記，汝於無上正等菩提決定當得不復退轉。",
        "translation": "The buddhas of the past have granted you the mark of great enlightenment, and you will surely attain unsurpassed perfect enlightenment and never turn back.",
        "source": "T07n0220_453:0284c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝身父母、兄弟、姊妹、親友、眷屬乃至七世名字差別我悉善知。",
        "translation": "I know well the differences in names of your parents, brothers, sisters, relatives, friends, and dependents up to seven generations ago.",
        "source": "T07n0220_453:0284c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝身生在某方、某國、某城、某邑、某聚落中，汝在某年、某月、某日、某時、某宿、相王中生。』",
        "translation": "You were born in a certain place, country, city, town, or village, and you were born in a certain year, month, day, hour, night, or king of signs.'",
        "source": "T07n0220_453:0284c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是惡魔若見菩薩稟性柔軟，諸根昧鈍，便詐記言：『汝於先世所稟根性已曾如是。』",
        "translation": "If such an evil demon sees that a bodhisattva has a flexible nature and dull faculties, he fraudulently remembers, 'You had such a faculty in a prior life.'",
        "source": "T07n0220_453:0284c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見菩薩稟性剛強，諸根明利，便詐記言：『汝於先世所稟根性亦曾如是。』",
        "translation": "If he sees a bodhisattva with a strong nature and sharp faculties, he fraudulently remembers, 'This was also true of the faculties you possessed in a prior life.'",
        "source": "T07n0220_453:0284c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見菩薩居阿練若、或常乞食、或一受食、或一坐食、或一鉢食、或居塚間、或居露地、或居樹下、或糞掃衣、或但三衣、或常坐不臥、或如舊敷具、或少欲、或喜足、或樂遠離、或具正念、或樂寂定、或具妙慧、或不重利養、或不貴名譽、或好廉儉不塗其足、或少睡眠、或離掉舉、或樂軟語、或好少言，如是惡魔見此菩薩差別行已，便詐記言：『汝於先世亦曾如是。",
        "translation": "If he sees a bodhisattva living in a forest, or always begging for food, or receiving food once, or sitting down for food once, or eating from a bowl, or living in a tomb, or on bare ground, or under a tree, or wearing robes made of rags, or wearing only three robes, or always sitting and not lying down, or wearing old clothes as before, or having few desires, or delighting in contentment, or enjoying seclusion, or possessing right mindfulness, or enjoying tranquil concentration, or possessing sublime wisdom, or not valuing profit, or not valuing fame, or preferring to be cheap and not using one's feet, or having little sleep, or being free of agitation, or preferring soft words, or preferring few words, then a bad demon sees this bodhisattva's different ways and fraudulently remembers, 'You were likewise in a previous life.'",
        "source": "T07n0220_453:0284c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0284c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今成就如是如是差別功德，世間同見，先世定應亦有如是種種功德，應深慶慰無得自輕。』",
        "translation": "Now, you've achieved such and such distinctive qualities that are shared by the world, and you must have had such and such various qualities in prior lifetimes, so you should deeply rejoice and not despise yourself.'",
        "source": "T07n0220_453:0284c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩聞彼惡魔說其過去當來功德，及說現在親友自身名等差別，兼讚種種殊勝善根，歡喜踊躍生增上慢，凌蔑毀罵諸餘菩薩。",
        "translation": "\"When the bodhisattva Mahāsattva heard that demon talk about his past and future virtues, about the distinctions in his own name and those of his friends and relatives in the present, and about the praise of various excellent good roots, he rejoiced and jumped for joy, becoming arrogant and insulting the other bodhisattvas.",
        "source": "T07n0220_453:0285a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，惡魔知其闇鈍起增上慢凌蔑他人，復告之言：『汝定成就殊勝功德，過去如來、應、正等覺已授汝記。",
        "translation": "Knowing that he was dull and ignorant, the demon aroused pride and disparaged others, and then told him, 'You certainly have achieved excellent qualities, and the Tathāgata, Arhat, and Completely Awakened One of the past has granted you assurance of future attainment.",
        "source": "T07n0220_453:0285a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於無上正等菩提，定當證得不復退轉，已有如是瑞相現前。』",
        "translation": "You will surely realize unsurpassed correct enlightenment and never turn back, and you've already had such an auspicious appearance.'",
        "source": "T07n0220_453:0285a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時惡魔為嬈彼故，或矯化作苾芻形像，或矯化作居士形像，或矯化作父母、親友、人非人等形像，現前高聲唱言：『善哉！",
        "translation": "Then, for the purpose of seducing them, some evil demons transformed themselves into the image of a monk, or they transformed themselves into the image of a householder, or they transformed themselves into the image of a parent, relative, friend, human being, or non-human being, and they appeared before them, shouting, 'Good!",
        "source": "T07n0220_453:0285a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大士乃能成就如是功德，過去諸佛久已授汝大菩提記，汝於無上正等菩提已不退轉。",
        "translation": "\"Great man, you've accomplished such virtue, the buddhas of the past have long since granted you the mark of great enlightenment, and you've never turned back from unsurpassed perfect enlightenment.",
        "source": "T07n0220_453:0285a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0285a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸不退轉地菩薩摩訶薩勝功德相，汝皆具有，應自尊重，勿生疑惑。』",
        "translation": "You possess all the excellent attributes of the nonretrogressing bodhisattvas and mahāsattvas, so honor them yourself and don't have any doubts.'",
        "source": "T07n0220_453:0285a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此菩薩聞彼語已，增上慢心轉復堅固。",
        "translation": "After hearing his words, this bodhisattva's intensified conceit became more resolute.",
        "source": "T07n0220_453:0285a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T07n0220_453:0285a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我所說，實得不退轉菩薩摩訶薩諸行、狀、相，是菩薩摩訶薩實皆非有。",
        "translation": "As I've said, the practices, appearances, and characteristics of the truly irreversible bodhisattvas and mahāsattvas really don't exist.",
        "source": "T07n0220_453:0285a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well understand!",
        "source": "T07n0220_453:0285a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩魔所執持，為魔所嬈不得自在。",
        "translation": "This is a bodhisattva-mahāsattva held by Māra, who's tampered with by Māra and can't be at ease.",
        "source": "T07n0220_453:0285a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0285a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於得不退轉菩薩摩訶薩諸行、狀、相實皆未有，但聞惡魔矯說其德及名字等，生增上慢，凌蔑毀罵諸餘菩薩。",
        "translation": "That bodhisattva really doesn't have the conduct, appearance, and characteristics of the irreversible bodhisattvas, but when he hears that Māra falsely describes their virtues and names, he becomes arrogant and haughty, and he disparages and ridicules the other bodhisattvas.",
        "source": "T07n0220_453:0285a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T07n0220_453:0285a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩欲證無上正等菩提，應善覺知諸惡魔事，勿為欺誑生憍慢心。",
        "translation": "If a bodhisattva-mahāsattva wants to realize unsurpassed correct perfect enlightenment, he should well perceive the works of evil demons and not deceive and become proud of them.",
        "source": "T07n0220_453:0285a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, well-presented!",
        "source": "T07n0220_453:0285a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有菩薩摩訶薩魔所執持，為魔所嬈，但聞虛名而生憍慢。",
        "translation": "\"When a bodhisattva Mahāsattva is held by Māra and is seduced by Māra, he simply hears a false name and becomes proud.",
        "source": "T07n0220_453:0285a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0285a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩先未修學布施波羅蜜多乃至般若波羅蜜多，先未安住內空乃至無性自性空，先未安住真如乃至不思議界，先未安住苦、集、滅、道聖諦，先未修學四念住乃至八聖道支，先未修學四靜慮、四無量、四無色定，先未修學八解脫乃至十遍處，先未修學空、無相、無願解脫門，先未修學極喜地乃至法雲地，先未修學陀羅尼門、三摩地門，先未修學五眼、六神通，先未修學如來十力乃至十八佛不共法，先未修學無忘失法、恒住捨性，先未修學一切智、道相智、一切相智，先未修學一切菩薩摩訶薩行、諸佛無上正等菩提，由是因緣令魔得便。",
        "translation": "是菩薩摩訶薩先未修學布施波羅蜜多乃至般若波羅蜜多，先未安住內空乃至無性自性空，先未安住真如乃至不思議界，先未安住苦、集、滅、道聖諦，先未修學四念住乃至八聖道支，先未修學四靜慮、四無量、四無色定，先未修學八解脫乃至十遍處，先未修學空、無相、無願解脫門，先未修學極喜地乃至法雲地，先未修學陀羅尼門、三摩地門，先未修學五眼、六神通，先未修學如來十力乃至十八佛不共法，先未修學無忘失法、恒住捨性，先未修學一切智、道相智、一切相智，先未修學一切菩薩摩訶薩行、諸佛無上正等菩提，由是因緣令魔得便。",
        "source": "T07n0220_453:0285a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不能了知四魔行相，由此因緣令魔得便。",
        "translation": "It's because the bodhisattvas, mahāsattvas, and devils can't understand the four demonic forces, and this is the cause and condition that makes it easy for Māra.",
        "source": "T07n0220_453:0285b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩不了知色、受、想、行、識，不了知眼處乃至意處，不了知色處乃至法處，不了知眼界乃至意界，不了知色界乃至法界，不了知眼識界乃至意識界，不了知眼觸乃至意觸，不了知眼觸為緣所生諸受乃至意觸為緣所生諸受，不了知地界乃至識界，不了知無明乃至老死，不了知布施波羅蜜多乃至般若波羅蜜多，不了知內空乃至無性自性空，不了知真如乃至不思議界，不了知苦、集、滅、道聖諦，不了知四念住乃至八聖道支，不了知四靜慮、四無量、四無色定，不了知八解脫乃至十遍處，不了知空、無相、無願解脫門，不了知極喜地乃至法雲地，不了知陀羅尼門、三摩地門，不了知五眼、六神通，不了知如來十力乃至十八佛不共法，不了知無忘失法、恒住捨性，不了知預流果乃至獨覺菩提，不了知一切智、道相智、一切相智，亦不了知有情諸法名字實相，所謂無相。",
        "translation": "「是菩薩摩訶薩不了知色、受、想、行、識，不了知眼處乃至意處，不了知色處乃至法處，不了知眼界乃至意界，不了知色界乃至法界，不了知眼識界乃至意識界，不了知眼觸乃至意觸，不了知眼觸為緣所生諸受乃至意觸為緣所生諸受，不了知地界乃至識界，不了知無明乃至老死，不了知布施波羅蜜多乃至般若波羅蜜多，不了知內空乃至無性自性空，不了知真如乃至不思議界，不了知苦、集、滅、道聖諦，不了知四念住乃至八聖道支，不了知四靜慮、四無量、四無色定，不了知八解脫乃至十遍處，不了知空、無相、無願解脫門，不了知極喜地乃至法雲地，不了知陀羅尼門、三摩地門，不了知五眼、六神通，不了知如來十力乃至十八佛不共法，不了知無忘失法、恒住捨性，不了知預流果乃至獨覺菩提，不了知一切智、道相智、一切相智，亦不了知有情諸法名字實相，所謂無相。",
        "source": "T07n0220_453:0285b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣令魔得便，方便化作種種形像，語此菩薩摩訶薩言：『汝所修行願行已滿，當證無上正等菩提，汝成佛時當得如是殊勝功德尊貴名號！』",
        "translation": "This cause and condition allowed Māra to skillfully conjure up various forms and images, saying to this bodhisattva Mahāsattva, 'Once you've fulfilled your vows and practices, you will realize unsurpassed perfect enlightenment, and when you become a buddha, you will attain the distinguished and honored name of Such Exceptional Merit!'",
        "source": "T07n0220_453:0285b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂彼惡魔知此菩薩長夜思願：『我成佛時，當得如是功德名號！』",
        "translation": "That evil demon knows that this bodhisattva has long vowed, 'When I become a buddha, I will attain this meritorious name!'",
        "source": "T07n0220_453:0285c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其思願而記說之。",
        "translation": "He then explained it according to his desires.",
        "source": "T07n0220_453:0285c05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此菩薩遠離般若波羅蜜多，無方便善巧故，聞魔記說，作是念言：『奇哉！",
        "translation": "When this bodhisattva, who was far removed from the perfection of wisdom and lacked skillful means, heard Māra's prediction, he had this thought, 'Amazing!",
        "source": "T07n0220_453:0285c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人為我記說當得成佛功德名號，與我長夜思願相應。",
        "translation": "This person's explanation of the meritorious name of the buddha who will attain Buddhahood is in line with my long-night meditation and vow.",
        "source": "T07n0220_453:0285c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此故知過去諸佛必已授我大菩提記，我於無上正等菩提決定當得不復退轉。",
        "translation": "Because of this, I know that the buddhas of the past must have granted me the mark of great enlightenment, and I'm certain that I'll attain unsurpassed perfect enlightenment and never turn back.",
        "source": "T07n0220_453:0285c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成佛時必定當得如是功德尊重名號。』",
        "translation": "When I become a buddha, I surely will attain such a reputation of respect for merit.'",
        "source": "T07n0220_453:0285c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩如是惡魔、或魔眷屬、或魔所使諸沙門等記說當來成佛名號，如是如是憍慢轉增：『我於未來定當作佛，獲得如是功德名號，諸餘菩薩無與我等。』",
        "translation": "When that bodhisattva Mahāsattva is told by some evil demon, or by one of his followers, or by some ascetic whom the demon has sent to teach him the name of a future Buddha, his arrogance increases as he says, 'I will surely become a future Buddha and attain a name of such merit that no other bodhisattva will be equal to me.'",
        "source": "T07n0220_453:0285c11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know, good present!",
        "source": "T07n0220_453:0285c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我所說，已得不退轉菩薩摩訶薩諸行、狀、相，此菩薩摩訶薩皆未成就，但聞魔說成佛虛名，便生憍慢，輕弄毀蔑諸餘菩薩摩訶薩眾。",
        "translation": "As I said, this bodhisattva Mahāsattva has not yet accomplished the irreversible buddha's practices, appearance, and form, but when he hears Māra's false claim to be a buddha, he becomes proud and despises the other bodhisattvas and Mahāsattvas.",
        "source": "T07n0220_453:0285c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this, good present!",
        "source": "T07n0220_453:0285c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩由起憍慢，輕弄毀蔑諸餘菩薩摩訶薩故，遠離無上正等菩提。",
        "translation": "Because of this bodhisattva's arrogance and disdain for the other bodhisattvas, he's distantly removed from unsurpassed perfect enlightenment.",
        "source": "T07n0220_453:0285c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should well know!",
        "source": "T07n0220_453:0285c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩遠離般若波羅蜜多，無方便善巧故，棄善友故，常為惡友所攝受故，當墮聲聞或獨覺地。",
        "translation": "Because this bodhisattva Mahāsattva is estranged from the perfection of wisdom, lacks skillful means, and abandons good friends, he'll always be taken in by bad friends, and will fall into the stage of śrāvaka or pratyekabuddha.",
        "source": "T07n0220_453:0285c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_453:0285c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩或有此身還得正念，至心悔過捨憍慢心，數數親近真勝善友。",
        "translation": "\"Suppose a bodhisattva regains right mindfulness in this body, repents with utmost sincerity and abandon pride, and repeatedly approaches a truly excellent and good friend.",
        "source": "T07n0220_453:0285c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼雖流轉生死多時，而後還依甚深般若波羅蜜多方便善巧漸次修學，當證無上正等菩提。",
        "translation": "Although they've been transiting through birth and death for many lifetimes, they'll gradually cultivate it based on the skillful means of the profound prajñāpāramitā, and they'll realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_453:0285c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good present, you should know!",
        "source": "T07n0220_453:0285c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩若有此身不得正念，不能悔過，不捨慢心，不樂親近真勝善友，彼定流轉生死多時，後雖精進修諸善業，而墮聲聞或獨覺地。",
        "translation": "\"If this bodhisattva-mahāsattva doesn't have right mindfulness of this body, doesn't repent of faults, doesn't abandon conceit, and doesn't enjoy being close to truly excellent good friends, he'll surely be reborn in birth-and-death for a long time, and even though he makes effort to cultivate good actions later, he'll fall into the stage of śrāvaka or pratyekabuddha.",
        "source": "T07n0220_453:0285c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如苾芻求聲聞者，於四重罪若隨犯一，便非沙門非釋迦子，彼於現在定不能得四沙門果。",
        "translation": "For example, if a monk seeking to become a direct disciple commits any one of the four grave crimes, he's not an ascetic or not a son of the Śākyas, and he certainly won't attain the fruit of the four ascetics in the present.",
        "source": "T07n0220_453:0286a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄執虛名菩薩亦爾，但聞魔說成佛空名，便起慢心，輕弄毀蔑諸餘菩薩摩訶薩眾，當知此罪過彼苾芻所起四重無量倍數，置彼苾芻所犯四重，此菩薩罪過五無間亦無量倍。",
        "translation": "So too, a bodhisattva who falsely clings to the false name of Buddhahood and then becomes conceited after hearing the devil's teaching about the Buddha's emptiness and disparages the rest of the bodhisattva-mahāsattva community, should know that this offense is measureless and many times greater than the four grave offenses committed by that monk, and if he considers the four grave offenses committed by that monk, this bodhisattva's offense is measureless and many times greater than the five interminable offenses.",
        "source": "T07n0220_453:0286a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0286a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩實不成就殊勝功德，聞惡魔說成佛虛名，便自憍慢輕餘菩薩，是故此罪過五無間。",
        "translation": "\"This is a bodhisattva who really hasn't achieved extraordinary virtue and who, upon hearing evil demons speak of the false name of becoming a buddha, becomes proud of other bodhisattvas, which is a misdeed that has five limitless consequences.",
        "source": "T07n0220_453:0286a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此當知若菩薩摩訶薩欲證無上正等菩提，應善覺知如是記說虛名號等微細魔事，勤求無上正等菩提。",
        "translation": "From this, you should know that if a bodhisattva-mahāsattva wants to realize unsurpassed perfect enlightenment, he or she should well recognize such subtle demonic things as the prediction of false names and diligently pursue unsurpassed perfect enlightenment.",
        "source": "T07n0220_453:0286a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_453:0286a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有菩薩摩訶薩修遠離行，謂隱山林、空澤、曠野，居阿練若宴坐思惟。",
        "translation": "\"There's a bodhisattva Mahāsattva who cultivates seclusion, which is defined as staying in a mountain forest, in a vacant swamp, or in a wilderness, and living in a forest, sitting in repose, and reflecting.",
        "source": "T07n0220_453:0286a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有惡魔來至其所，恭敬讚歎謂作是言：『善哉！",
        "translation": "When an evil demon comes to him, he respectfully praises him and says, 'Good!",
        "source": "T07n0220_453:0286a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大士！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_453:0286a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能修如是真遠離行。",
        "translation": "'You can cultivate such truly isolated practices.",
        "source": "T07n0220_453:0286a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此遠離行，一切如來、應、正等覺共所稱讚，天帝釋等諸天神仙皆共守護供養尊重，應常住此勿往餘處。』",
        "translation": "Such isolated practice is praised by all tathāgatas, worthies, and correct enlightenment, and is guarded, supported, and honored by gods and sages like Indra, who should always abide here and not go to other places.'",
        "source": "T07n0220_453:0286a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this, good present!",
        "source": "T07n0220_453:0286a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不讚歎諸菩薩摩訶薩居阿練若、曠野、山林，宴坐思惟修遠離行。」",
        "translation": "I don't praise bodhisattvas and mahāsattvas who live in a forest or wilderness, sit in contemplation, and practice seclusion.\"",
        "source": "T07n0220_453:0286a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現白言：「世尊！",
        "translation": "Guoshou Shanjin said, \"Bhagavān!",
        "source": "T07n0220_453:0286a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩應修何等餘遠離行，而佛不讚居阿練若、曠野、山林，棄勝臥具思惟宴坐遠離功德？」",
        "translation": "What other kinds of seclusion practices should bodhisattvas and mahāsattvas practice that the Buddha doesn't praise as merits of seclusion when they live in a forest or wilderness or in a mountain grove and abandon their excellent bedding to contemplate sitting and relaxing?\"",
        "source": "T07n0220_453:0286a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩若居山林、空澤、曠野阿練若處，若住城邑、聚落、王都喧雜之處，但能遠離煩惱惡業及諸聲聞獨覺作意，勤修般若波羅蜜多，及修諸餘殊勝功德，是名菩薩真遠離行。",
        "translation": "The Buddha told Śaṅgālī, \"If bodhisattvas and mahāsattvas live in mountain forests, open swamps, or wild araṇya places, or in the noisy places of cities, towns, or royal capitals, but can be free of afflictive and unwholesome activity and the contemplations of śrāvakas and solitary realizers, and diligently cultivate the perfection of wisdom and cultivate other excellent qualities, this is called a bodhisattva's true seclusion practice.",
        "source": "T07n0220_453:0286a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此遠離行一切如來、應、正等覺共所稱讚，諸佛世尊共所開許，諸菩薩眾常應修學，若晝若夜應正思惟，精進修行此遠離法，是名菩薩修遠離行。",
        "translation": "This secluded practice is praised by all tathāgatas, worthies, and righteous ones, approved by all the buddhas and world-honored ones, and should always be cultivated by all bodhisattvas, correctly contemplated day and night, and diligently cultivated as a secluded practice, which is called the bodhisattva's cultivated secluded practice.",
        "source": "T07n0220_453:0286a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此遠離行不雜聲聞、獨覺作意，不雜一切煩惱惡業，離諸喧雜畢竟清淨，令諸菩薩速證無上正等菩提，利樂有情常無斷盡。",
        "translation": "This secluded practice is unadulterated by the contemplations of śrāvakas and pratyekbuddhas, unadulterated by all the bad karma of affliction, and free of all the clamor and confusion that ultimately purifies it, causing bodhisattvas to quickly realize unsurpassed perfect enlightenment and to bring benefit and joy to sentient beings without ever being cut off.",
        "source": "T07n0220_453:0286b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡魔所讚隱於山林、空澤、曠野阿練若處，棄勝臥具宴坐思惟，非諸菩薩真遠離行。",
        "translation": "Praised by Māra, staying hidden in a mountain forest, a hollow swamp, or a wild alembic place, abandoning superior bedding, and sitting in repose and contemplation are not truly isolated practices of bodhisattvas.",
        "source": "T07n0220_453:0286b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0286b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼遠離行猶有喧雜，謂彼或雜惡業煩惱，或雜聲聞、獨覺作意，於深般若波羅蜜多，不能精勤信受修學，不能圓滿一切智智。",
        "translation": "Their seclusion practices are still noisy and complicated, meaning that they're sometimes complicated by the afflictions of bad actions or by the contemplations of direct disciples and solitary realizers, and they can't diligently believe in and train in the profound prajñāparamitā, nor can they perfect the knowledge of all things.",
        "source": "T07n0220_453:0286b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_453:0286b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有菩薩摩訶薩雖樂修行魔所稱讚遠離行法，而起憍慢不清淨心，輕蔑毀呰諸餘菩薩摩訶薩眾。",
        "translation": "\"Although there are bodhisattvas and mahāsattvas who delight in cultivating the practices praised by Māra and who distance themselves from the Dharma, they become arrogant and impure, and they despise and disparage the rest of the bodhisattva-mahāsattva community.",
        "source": "T07n0220_453:0286b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有菩薩摩訶薩眾雖居城邑、聚落、王都而心清淨不雜種種煩惱惡業及諸聲聞、獨覺作意，精勤修學布施波羅蜜多乃至般若波羅蜜多，精勤安住內空乃至無性自性空，精勤安住真如乃至不思議界，精勤安住苦、集、滅、道聖諦，精勤修學四念住乃至八聖道支，精勤修學四靜慮、四無量、四無色定、五神通等世間功德，精勤修學空、無相、無願解脫門，精勤修學菩薩十地，精勤修學陀羅尼門、三摩地門，精勤修學五眼、六神通，精勤修學八解脫乃至十遍處，精勤修學如來十力乃至十八佛不共法，精勤修學無忘失法、恒住捨性，精勤修學一切智、道相智、一切相智，嚴淨佛土、成熟有情。",
        "translation": "謂有菩薩摩訶薩眾雖居城邑、聚落、王都而心清淨不雜種種煩惱惡業及諸聲聞、獨覺作意，精勤修學布施波羅蜜多乃至般若波羅蜜多，精勤安住內空乃至無性自性空，精勤安住真如乃至不思議界，精勤安住苦、集、滅、道聖諦，精勤修學四念住乃至八聖道支，精勤修學四靜慮、四無量、四無色定、五神通等世間功德，精勤修學空、無相、無願解脫門，精勤修學菩薩十地，精勤修學陀羅尼門、三摩地門，精勤修學五眼、六神通，精勤修學八解脫乃至十遍處，精勤修學如來十力乃至十八佛不共法，精勤修學無忘失法、恒住捨性，精勤修學一切智、道相智、一切相智，嚴淨佛土、成熟有情。",
        "source": "T07n0220_453:0286b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖居憒閙而心寂靜，恒勤修習真遠離行。",
        "translation": "Although he lives in a state of anxiety, his mind is still, and he constantly and diligently cultivates truly isolated practices.",
        "source": "T07n0220_453:0286b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於如是真淨菩薩摩訶薩眾，心常傲慢，輕弄毀呰，誹謗凌蔑。",
        "translation": "In this truly pure bodhisattva-mahāsattva assembly, their minds are always arrogant, they despise and disparage them, and they denigrate them.",
        "source": "T07n0220_453:0286b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_453:0286b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩遠離般若波羅蜜多，無方便善巧故，雖居曠野百踰繕那，其中絕無諸惡禽獸、蛇蝎、盜賊，唯有鬼神、羅剎娑等遊止其中。",
        "translation": "\"Suppose a bodhisattva Mahāsattva secludes himself from the perfection of wisdom and lacks skillful means, and although he lives in a wilderness for a hundred yojanas, there are absolutely no unwholesome animals, snakes, scorpions, or thieves in it, except for ghosts, spirits, or rājñas that roam it.",
        "source": "T07n0220_453:0286b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼住如是阿練若處，設經一年、或五、或十、或復乃至百千俱胝，若過是數修遠離行，而不了知真遠離行。",
        "translation": "If they live in such a forest for a year, or five, ten, or even a hundred thousand koṭīs, and if they cultivate seclusion practices for more than that, they won't know the true seclusion practices.",
        "source": "T07n0220_453:0286c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩摩訶薩眾雖居憒閙而心寂靜，遠離種種煩惱惡業及諸聲聞、獨覺作意，發趣無上正等菩提。",
        "translation": "That is, although they live in a state of hubbub, the bodhisattvas and mahāsattvas calm their minds, become free of the various afflictive and unwholesome activities and the intentions of śrāvakas and solitary realizers, and set out for unsurpassed perfect enlightenment.",
        "source": "T07n0220_453:0286c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know it well, Sugata!",
        "source": "T07n0220_453:0286c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩雖居曠野經歷多時，而雜聲聞、獨覺作意，於彼二地深生樂著，依二地法修遠離行，復於此行深生躭染。",
        "translation": "Although these bodhisattvas live in the wilderness for many lifetimes, they are mixed with the contemplations of direct disciples and solitary realizers, become deeply attached to those two stages, cultivate isolation practices based on the teachings of those two stages, and then become deeply defiled by those practices.",
        "source": "T07n0220_453:0286c07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well, Sugata!",
        "source": "T07n0220_453:0286c09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼雖如是修遠離行，而不稱順諸如來心。",
        "translation": "Although they thus cultivate practices that are isolated, they don't praise the minds of the Tathāgatas.",
        "source": "T07n0220_453:0286c09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know, good present!",
        "source": "T07n0220_453:0286c10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我所稱讚諸菩薩摩訶薩真遠離行，是菩薩摩訶薩都不成就，彼於真勝遠離行中亦不見有相似行相。",
        "translation": "The bodhisattvas, mahāsattvas, and truly isolated practitioners that I praise don't accomplish anything, and they don't see similar forms of conduct in their truly superior isolated practices.",
        "source": "T07n0220_453:0286c11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0286c13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於菩薩真遠離行不生愛樂，但樂勤修聲聞、獨覺空遠離行。",
        "translation": "They don't have cravings for the truly isolated practices of bodhisattvas, but instead enjoy diligently cultivating the empty, isolated practices of direct disciples and solitary realizers.",
        "source": "T07n0220_453:0286c13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T07n0220_453:0286c15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩修不真勝遠離行時，魔來空中，歡喜讚歎告言：『大士！",
        "translation": "When these bodhisattvas were cultivating practices that were not truly superior and far removed, Māra came into the air, rejoiced and praised them, saying, 'Maestro!",
        "source": "T07n0220_453:0286c15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_453:0286c16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_453:0286c16_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能勤修真遠離行，此遠離行一切如來、應、正等覺共所稱讚。",
        "translation": "'Can you diligently cultivate the truly isolated practice that's praised by all tathāgatas, worthies, and correct ascendants?",
        "source": "T07n0220_453:0286c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於此行精勤修學，速能證得一切智智。』",
        "translation": "Striving to cultivate this practice, you'll quickly realize the wisdom of omniscience.'",
        "source": "T07n0220_453:0286c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good present, you should know!",
        "source": "T07n0220_453:0286c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩樂著如是二乘所修遠離行法，輕弄毀蔑住菩薩乘雖居憒閙而心寂靜諸苾芻等，言彼不能修遠離行，身居憒閙心不寂靜無調善法。",
        "translation": "Such bodhisattvas are attracted to the secluded practices cultivated by these two vehicles, and they despise bodhisattvas who abide in the vehicle even though their minds are calm, saying that they can't cultivate secluded practices and that their bodies are calm and their minds aren't calm, and they lack the cultivation of good qualities.",
        "source": "T07n0220_453:0286c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_453:0286c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩於佛所讚住真遠離行菩薩摩訶薩輕蔑毀呰，謂居憒閙心不寂靜，不能勤修真遠離行；於諸如來、應、正等覺所不稱讚住真喧雜行菩薩摩訶薩尊重讚歎，謂不喧雜，其心寂靜，能正修行真遠離行。",
        "translation": "\"Such bodhisattvas despise and disparage those bodhisattvas and mahāsattvas praised by the Buddha for abiding in truly detached practice, which means they live in a state of agitation and lack mental equanimity and can't diligently cultivate truly detached practice; whereas bodhisattvas and mahāsattvas praised by the Tathāgatas, Arhats, and Fully Awakened Ones who don't praise them for abiding in truly noisy practice respect and praise them for not being noisy, having a calm mind, and being able to correctly cultivate truly detached practice.",
        "source": "T07n0220_453:0286c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this, good present!",
        "source": "T07n0220_453:0286c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩於應親近恭敬供養如諸佛者，而不親近恭敬供養，反生輕毀；於應遠離不應親近恭敬供養如惡友者，而反親近恭敬供養如事諸佛。",
        "translation": "Such bodhisattvas don't approach and venerate and make offerings to those who should approach and venerate them like buddhas, but instead they despise them, and they avoid those who shouldn't approach and venerate and make offerings to those who are bad friends, but instead they approach and venerate and make offerings to those who serve buddhas.",
        "source": "T07n0220_453:0286c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this, good present!",
        "source": "T07n0220_453:0287a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩遠離般若波羅蜜多，無方便善巧故，妄生種種分別執著。",
        "translation": "\"Such bodhisattvas are free of the perfection of wisdom and lack the skillful means to falsely create various discriminating attachments.",
        "source": "T07n0220_453:0287a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0287a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作是念：『我所修學是真遠離，故為非人稱歎護念。",
        "translation": "They think, 'My training is truly isolated, so I'm praised and guarded by no one.",
        "source": "T07n0220_453:0287a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居城邑者，身心擾亂，誰當護念恭敬讚美？』",
        "translation": "Who will guard, honor, and praise a person living in a town who's disturbed in body and mind?'",
        "source": "T07n0220_453:0287a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩由此因緣，心多憍慢，輕蔑毀呰諸餘菩薩摩訶薩眾，煩惱惡業晝夜增長。",
        "translation": "As a result, these bodhisattvas become very proud at heart, despise the other bodhisattvas and mahāsattvas, and their bad karma increases day and night with affliction.",
        "source": "T07n0220_453:0287a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_453:0287a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩於餘菩薩摩訶薩眾為旃茶羅，染污菩薩摩訶薩眾。",
        "translation": "\"These bodhisattvas make the other bodhisattva-mahāsattva congregations into chandhāra, a tainted bodhisattva-mahāsattva congregation.",
        "source": "T07n0220_453:0287a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖似菩薩摩訶薩相，而是天上人中大賊，誑惑天、人、阿素洛等，其身雖服沙門法衣，而心常懷盜賊意樂。",
        "translation": "Although they may look like bodhisattvas and mahāsattvas, they are great thieves among gods, humans, and asuras who deceive gods, humans, and so forth, and although they wear the ascetic's religious robes, their minds always harbor the desire to steal.",
        "source": "T07n0220_453:0287a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有發趣菩薩乘者，不應親近恭敬供養、尊重讚歎如是惡人。",
        "translation": "Those who have set out for the bodhisattva vehicle shouldn't get close to, honor, support, respect, and praise such a bad person.",
        "source": "T07n0220_453:0287a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0287a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是人懷增上慢，外似菩薩內多煩惱。",
        "translation": "You should know that this person harbors arrogance, which outwardly resembles a bodhisattva and inwardly causes much affliction.",
        "source": "T07n0220_453:0287a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T07n0220_453:0287a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩真實不捨一切智智，不捨無上正等菩提，深心欲求一切智智，欲證無上正等菩提，普為利樂諸有情者，不應親近恭敬供養、尊重讚歎如是惡人。",
        "translation": "If bodhisattvas, mahāsattvas, and true beings don't abandon omniscience, don't abandon unsurpassed correct enlightenment, deeply desire to pursue omniscience, want to realize unsurpassed correct enlightenment, and generally work for the benefit and welfare of sentient beings, they shouldn't approach, honor, support, respect, and praise such a bad person.",
        "source": "T07n0220_453:0287a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T07n0220_453:0287a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩應常精進修自事業，遠離生死，不著三界，於彼惡賊旃茶羅人，常應發生慈、悲、喜、捨，應作是念：『我不應起如彼惡人所起過患，設當失念如彼暫起，即應覺知令速除滅。』",
        "translation": "All bodhisattvas, mahāsattvas, should always exert themselves in cultivating their own works, secluding themselves from birth-and-death and not becoming attached to the three realms, and should always have compassion, pity, joy, and equanimity for that bandit Cāmara, always thinking, 'I shouldn't give rise to the faults caused by that evil person; if I lose mindfulness of what's temporarily caused by that person, I should immediately perceive it and cause it to quickly cease.'",
        "source": "T07n0220_453:0287a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩眾欲證無上正等菩提，當善覺知諸惡魔事，應勤精進遠離除滅如彼菩薩所起過患，勤求無上正等菩提。",
        "translation": "Therefore, bodhisattvas, mahāsattvas, and others who want to realize unsurpassed correct enlightenment should well perceive the works of evil demons, diligently and energetically avoid and extinguish the faults that arise like those bodhisattvas, and diligently pursue unsurpassed correct enlightenment.",
        "source": "T07n0220_453:0287a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_453:0287a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩增上作意，欲證無上正等菩提，應常親近恭敬供養、尊重讚歎真善知識。」",
        "translation": "If bodhisattvas, mahāsattvas, and bodhisattvas intensify their intent to realize unsurpassed perfect enlightenment, they should always approach, respect, offer support, and venerate and praise true good teachers.\"",
        "source": "T07n0220_453:0287a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善現即白佛言：「何等名為諸菩薩摩訶薩真善知識？」",
        "translation": "It was then that the good present said to the Buddha, \"What are the names of the bodhisattvas, the mahāsattvas, and the truly good teachers?\"",
        "source": "T07n0220_453:0287a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「一切如來、應、正等覺是諸菩薩真善知識，一切菩薩摩訶薩眾亦是菩薩真善知識。",
        "translation": "The Buddha told Śaṅgālī, \"All tathāgatas, arhats, and fully enlightened ones are true good teachers of the bodhisattvas, and all the bodhisattva-mahāsattva congregations are true good teachers of the bodhisattvas.",
        "source": "T07n0220_453:0287a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有聲聞及餘善士，能為菩薩摩訶薩眾宣說開示，分別顯了布施、淨戒、安忍、精進、靜慮、般若波羅蜜多相應義趣令易解者，亦是菩薩真善知識。",
        "translation": "Those śrāvakas and other good people who can explain and instruct the bodhisattva-mahāsattvas and discern and make easy to understand the many concomitant meanings of generosity, pure morality, patience, effort, meditation, and prajñāpāramit are also true good bodhisattva teachers.",
        "source": "T07n0220_453:0287b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_453:0287b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多是諸菩薩真善知識，四念住乃至八聖道支亦是菩薩真善知識，四靜慮、四無量、四無色定亦是菩薩真善知識，八解脫乃至十遍處亦是菩薩真善知識，空、無相、無願解脫門亦是菩薩真善知識，極喜地乃至法雲地亦是菩薩真善知識，陀羅尼門、三摩地門亦是菩薩真善知識，五眼、六神通亦是菩薩真善知識，如來十力乃至十八佛不共法亦是菩薩真善知識，無忘失法、恒住捨性亦是菩薩真善知識，一切智、道相智、一切相智亦是菩薩真善知識，一切菩薩摩訶薩行亦是菩薩真善知識，諸佛無上正等菩提亦是菩薩真善知識，永斷一切習氣相續亦是菩薩真善知識。",
        "translation": "布施波羅蜜多乃至般若波羅蜜多是諸菩薩真善知識，四念住乃至八聖道支亦是菩薩真善知識，四靜慮、四無量、四無色定亦是菩薩真善知識，八解脫乃至十遍處亦是菩薩真善知識，空、無相、無願解脫門亦是菩薩真善知識，極喜地乃至法雲地亦是菩薩真善知識，陀羅尼門、三摩地門亦是菩薩真善知識，五眼、六神通亦是菩薩真善知識，如來十力乃至十八佛不共法亦是菩薩真善知識，無忘失法、恒住捨性亦是菩薩真善知識，一切智、道相智、一切相智亦是菩薩真善知識，一切菩薩摩訶薩行亦是菩薩真善知識，諸佛無上正等菩提亦是菩薩真善知識，永斷一切習氣相續亦是菩薩真善知識。",
        "source": "T07n0220_453:0287b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_453:0287b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦、集、滅、道聖諦是諸菩薩真善知識，諸法緣性亦是菩薩真善知識，諸緣起支亦是菩薩真善知識，內空乃至無性自性空亦是菩薩真善知識，真如乃至不思議界亦是菩薩真善知識。",
        "translation": "The noble truths of suffering, arising, cessation, and the path are true and good knowledge for bodhisattvas, the conditional nature of dharmas is true and good knowledge for bodhisattvas, the branches of dependent arising are true and good knowledge for bodhisattvas, internal emptiness and even the emptiness of the natureless nature of itself is true and good knowledge for bodhisattvas, and true thusness and even the inconceivable realm is true and good knowledge for bodhisattvas.",
        "source": "T07n0220_453:0287b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_453:0287b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多，與諸菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The perfection of generosity ... the perfection of wisdom ... is given to the bodhisattvas, the mahāsattvas, as teacher and guide, as light and torch, as lamp and shining, as understanding and awakening, as knowledge and wisdom, as rescue and protection, as shelter and home, as island and islet, as refuge and destination, and as father and mother.",
        "source": "T07n0220_453:0287b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住乃至八聖道支，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The four abodes of mindfulness up to the eight noble factors of the path also serve as teachers and guides for the bodhisattvas, torches for insight, lamps for illumination, understanding and awakening, wisdom for understanding, salvation for protection, homes for mansions, oases for islets, destinies for refuge, and fathers for mothers.",
        "source": "T07n0220_453:0287b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The four meditations, four immeasurable, and four formless concentrations are also shared with the bodhisattvas, mahāsattvas, as teachers and guides, as lights and torches, as lamps and illumination, as understanding and awakening, as wisdom and knowledge, as rescue and protection, as homes and dwellings, as continents and islets, as refuge and destinations, and as fathers and mothers.",
        "source": "T07n0220_453:0287c02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫乃至十遍處，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The eight liberations up to the ten universal abodes are also shared with the bodhisattva-mahāsattva community as teacher and guide, as light as torch, as lamp as illumination, as understanding and awakening, as wisdom and knowledge, as rescue and protection, as shelter as home, as island as islet, as refuge as destination, and as father and mother.",
        "source": "T07n0220_453:0287c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「空、無相、無願解脫門，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "\"The gate of liberation through emptiness, signlessness, and wishlessness is also shared with the bodhisattvas, mahāsattvas, as teachers and guides, as clarity as torches, as lamps as illumination, as understanding as awakening, as wisdom, as rescue as protection, as homes as mansions, as continents as islets, as refuge as destinies, and as fathers and mothers.",
        "source": "T07n0220_453:0287c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地乃至法雲地，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "From the stage of ultimate joy up to the stage of the Dharma cloud, they also share with the bodhisattva-mahāsattvas a teacher and a guide, a light and a torch, a lamp and a light, understanding and awakening, knowledge and wisdom, rescue and protection, a house and a dwelling, a continent and an islet, a refuge and a destination, and a father and a mother.",
        "source": "T07n0220_453:0287c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陀羅尼門、三摩地門，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The dhāraṇī approach and the samādhi approach are also shared with the bodhisattvas, mahāsattvas, as teachers and guides, as insights as torches, as lamps as illuminations, as understandings as awakenings, as cognitions as wisdoms, as rescues as protections, as homes as mansions, as continents as islets, as refuge as destinies, and as fathers and mothers.",
        "source": "T07n0220_453:0287c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼、六神通，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The five eyes and six supernormal powers also serve as teachers and guides for the bodhisattvas, mahāsattvas, torches for insight, lamps for illumination, understanding and awakening, knowledge and wisdom, rescue and protection, homes for mansions, continents for islets, refuge for destinies, and fathers and mothers.",
        "source": "T07n0220_453:0287c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來十力乃至十八佛不共法，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The Tathāgata's ten powers up to the 18 buddha-uncommon dharmas are also shared with the bodhisattvas, mahāsattvas, as teachers and guides, as lights as torches, as lamps as illumination, as understanding and awakening, as wisdom and knowledge, as rescue and protection, as homes as mansions, as continents as islets, as refuge as destinations, and as fathers and mothers.",
        "source": "T07n0220_453:0287c23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無忘失法、恒住捨性，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "\"The Dharma of no forgetfulness and the nature of constantly abiding equanimity are also shared with the bodhisattvas, Mahāsattvas, as teachers and guides, as lights and torches, as lamps and illumination, as understanding and awakening, as wisdom and knowledge, as rescue and protection, as homes and dwellings, as continents and islets, as refuge and destinations, and as fathers and mothers.",
        "source": "T07n0220_453:0287c27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "Omniscience, knowledge of the path, and knowledge of all characteristics are also shared with the bodhisattva-mahāsattvas as teachers and guides, as insights as torches, as lamps as illuminations, as understandings as awakenings, as cognitions as wisdom, as rescues as protections, as homes as dwellings, as continents as islets, as refuge as destinies, and as fathers and mothers.",
        "source": "T07n0220_453:0288a01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩行，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "All bodhisattva-mahāsattva practices are also undertaken with the bodhisattva-mahāsattva community as teacher and guide, as light as torch, as lamp as illumination, as understanding and awakening, as wisdom as knowledge, as rescue and protection, as shelter as home, as island as islet, as refuge as destination, and as father and mother.",
        "source": "T07n0220_453:0288a05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The buddhas of unsurpassed correct perfect enlightenment also give the bodhisattvas, mahāsattvas, and their followers a teacher and a guide, a light and a torch, a lamp and a light, understanding and awakening, knowledge and wisdom, rescue and protection, a house and a dwelling, an island and a islet, a refuge and a destination, and a father and a mother.",
        "source": "T07n0220_453:0288a08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "永斷一切習氣相續，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "They permanently end all continuity of habituated tendencies and also make the bodhisattva-mahāsattvas their teachers and guides, their insights and torches, their lamps and illuminations, their understanding and awakening, their knowledge and wisdom, their rescues and protections, their homes and dwellings, their continents and islets, their refuge and destiny, and their fathers and mothers.",
        "source": "T07n0220_453:0288a12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T07n0220_453:0288a15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦、集、滅、道聖諦，亦與諸菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The noble truths of suffering, arising, cessation, and the path are also shared with the bodhisattva-mahāsattvas as teacher and guide, as clarity as torch, as lamp as illumination, as understanding as awakening, as wisdom as knowledge, as rescue as protection, as shelter as residence, as island as islet, as refuge as destination, and as father as mother.",
        "source": "T07n0220_453:0288a15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法緣性及緣起支，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "The conditional nature of all dharmas and the link of dependent arising are also associated with the bodhisattvas, mahāsattvas, as teachers and guides, as lights and torches, as lamps and illumination, as understanding and awakening, as knowledge and wisdom, as rescue and protection, as homes and dwellings, as continents and islets, as refuge and destinations, and as fathers and mothers.",
        "source": "T07n0220_453:0288a19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無性自性空，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "Internal emptiness ... even emptiness as the natureless nature of itself ... is also shared with the bodhisattvas, mahāsattvas, as teachers and guides, as insights and torches, as lamps and illuminations, as understandings and awakenings, as cognitions and wisdoms, as rescues and guardians, as homes and dwellings, as continents and islets, as refuge and destinations, and as fathers and mothers.",
        "source": "T07n0220_453:0288a22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如乃至不思議界，亦與菩薩摩訶薩眾為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "True thusness and even the inconceivable realm are also shared with the bodhisattva-mahāsattva community as teacher and guide, as clarity and torch, as lamp and illumination, as understanding and awakening, as knowledge and wisdom, as rescue and protection, as shelter and home, as island and islet, as refuge and destination, and as father and mother.",
        "source": "T07n0220_453:0288a26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0288a29_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切過去、未來、現在諸佛世尊皆以布施波羅蜜多，廣說乃至不思議界為師為導，為明為炬，為燈為照，為解為覺，為智為慧，為救為護，為舍為宅，為洲為渚，為歸為趣，為父為母。",
        "translation": "All the buddhas of the past, future, and present have made the perfection of generosity, which is explained in detail up to the inconceivable realm as teacher and guide, light and torch, lamp and shining, understanding and awakening, knowledge and wisdom, salvation and protection, shelter and home, island and islet, refuge and destination, and father and mother.",
        "source": "T07n0220_453:0288a29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0288b04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_453:0288b05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切過去、未來、現在諸佛世尊皆從布施波羅蜜多，廣說乃至不思議界而出生故。",
        "translation": "All the buddhas and world-honored ones of the past, future, and present have arisen from the perfection of generosity, which is explained in detail and reaches inconceivable realms.",
        "source": "T07n0220_453:0288b05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故，善現！",
        "translation": "\"Therefore, good performance!",
        "source": "T07n0220_453:0288b07_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩增上作意欲證無上正等菩提，成熟有情、嚴淨佛土，當學布施波羅蜜多乃至般若波羅蜜多，當學四念住乃至八聖道支，當學四靜慮、四無量、四無色定，當學八解脫乃至十遍處，當學空、無相、無願解脫門，當學極喜地乃至法雲地，當學陀羅尼門、三摩地門，當學五眼、六神通，當學如來十力乃至十八佛不共法，當學無忘失法、恒住捨性，當學一切智、道相智、一切相智，當學一切菩薩摩訶薩行，當學諸佛無上正等菩提，當學永斷一切習氣相續，當學苦、集、滅、道聖諦，當學諸法緣性及緣起支，當學內空乃至無性自性空，當學真如乃至不思議界。",
        "translation": "若菩薩摩訶薩增上作意欲證無上正等菩提，成熟有情、嚴淨佛土，當學布施波羅蜜多乃至般若波羅蜜多，當學四念住乃至八聖道支，當學四靜慮、四無量、四無色定，當學八解脫乃至十遍處，當學空、無相、無願解脫門，當學極喜地乃至法雲地，當學陀羅尼門、三摩地門，當學五眼、六神通，當學如來十力乃至十八佛不共法，當學無忘失法、恒住捨性，當學一切智、道相智、一切相智，當學一切菩薩摩訶薩行，當學諸佛無上正等菩提，當學永斷一切習氣相續，當學苦、集、滅、道聖諦，當學諸法緣性及緣起支，當學內空乃至無性自性空，當學真如乃至不思議界。",
        "source": "T07n0220_453:0288b07_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T07n0220_453:0288b20_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩既學布施波羅蜜多，廣說乃至不思議界，復應以四攝事攝諸有情。",
        "translation": "\"Since he has studied the perfection of generosity and explained it in detail up to the inconceivable realm, the bodhisattva Mahāsattva should also use four ways to gather sentient beings.",
        "source": "T07n0220_453:0288b20_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T07n0220_453:0288b22_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、布施。",
        "translation": "One, generosity.",
        "source": "T07n0220_453:0288b22_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、愛語。",
        "translation": "Two, loving words.",
        "source": "T07n0220_453:0288b22_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、利行。",
        "translation": "3. beneficial actions ...",
        "source": "T07n0220_453:0288b22_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、同事。",
        "translation": "Four, coworkers.",
        "source": "T07n0220_453:0288b23_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good performance!",
        "source": "T07n0220_453:0288b23_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我觀此義故作是說，所有布施波羅蜜多，廣說乃至不思議界，與諸菩薩摩訶薩眾為師為導，廣說乃至為父為母。",
        "translation": "Because I observe this meaning, I therefore say that the perfection of generosity that's explained in detail up to the inconceivable realm is to be a teacher and guide to all the bodhisattvas, Mahāsattvas, and explained in detail up to the point of being father and mother.",
        "source": "T07n0220_453:0288b23_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T07n0220_453:0288b26_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲得不隨他語行，欲得不依他語住，欲斷一切有情疑，欲滿一切有情願，欲嚴淨佛土，欲成熟有情，應學般若波羅蜜多。",
        "translation": "If bodhisattvas, mahāsattvas, want to be able to practice without following the words of others, want to be able to abide without relying on the words of others, want to end the doubts of all sentient beings, want to fulfill the vows of all sentient beings, want to purify the Buddha land, and want to ripen sentient beings, they should train in the perfection of wisdom.",
        "source": "T07n0220_453:0288b26_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0288b29_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_453:0288b29_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多甚深經中，廣說菩薩摩訶薩眾所應學法，一切菩薩摩訶薩眾，皆於其中應勤修學。」",
        "translation": "In this profound scripture, the prajñāpāramitā explains in detail the teachings that all bodhisattvas, mahāsattvas, and multitudes of bodhisattvas should diligently train in.\"",
        "source": "T07n0220_453:0288b29_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善現白言：「世尊！",
        "translation": "It was then that the good manifestation said, \"Bhagavān!",
        "source": "T07n0220_453:0288c03_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多以何為相？」",
        "translation": "What are the characteristics of the profound perfection of wisdom?\"",
        "source": "T07n0220_453:0288c03_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多虛空為相，無著為相，無相為相。",
        "translation": "The Buddha told Śubhavyūha, \"The profound perfection of wisdom has space as its characteristic, no attachment as its characteristic, and no characteristic as its characteristic.",
        "source": "T07n0220_453:0288c04_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0288c05_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_453:0288c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多甚深相中，諸法諸相皆無所有不可得故。」",
        "translation": "In this profound aspect of the perfection of wisdom, the characteristics of all dharmas are without existence and cannot be obtained.\"",
        "source": "T07n0220_453:0288c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「頗有因緣可說般若波羅蜜多所有妙相，諸法亦有如是相耶？」",
        "translation": "Guoshou Shancheng then said to the Buddha, \"Could there be a reason to say that the prajñāpāramitā has all these marvelous characteristics and that all dharmas also have such characteristics?\"",
        "source": "T07n0220_453:0288c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Śubhavyūha, \"So it is!",
        "source": "T07n0220_453:0288c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_453:0288c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "\"As you said.",
        "source": "T07n0220_453:0288c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有因緣故可說般若波羅蜜多所有妙相，諸法亦有如是妙相。",
        "translation": "'It's because of causes and conditions that we can say the prajñāpāramitā has all these marvelous characteristics, and all dharmas also have such marvelous characteristics.'",
        "source": "T07n0220_453:0288c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0288c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T07n0220_453:0288c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多遠離為相，諸法亦以遠離為相；甚深般若波羅蜜多性空為相，諸法亦以性空為相。",
        "translation": "As the profound prajñāpāramitā is characterized by remoteness, so are the dharmas characterized by remoteness, and as the nature of the profound prajñāpāramitā is emptiness, so are the dharmas characterized by emptiness.",
        "source": "T07n0220_453:0288c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣可作是說：甚深般若波羅蜜多所有妙相，諸法亦有如是妙相。",
        "translation": "This is the reason you can say, 'The marvelous marks of the profound prajñāpāramitā exist, and so do all dharmas.'",
        "source": "T07n0220_453:0288c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法皆自性空離諸相故。」",
        "translation": "It's because all things are empty of their own nature and free of marks.\"",
        "source": "T07n0220_453:0288c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現復白佛言：「若一切法皆自性空遠離諸相，則一切法一切法空，亦一切法一切法離，云何有情施設染淨？",
        "translation": "The long-lived Sunetra then said to the Buddha, \"If all things are empty of their own nature and free of marks, then how could all things be empty of all things and free of all things, and how could sentient beings be defiled and purified by defining them?",
        "source": "T07n0220_453:0288c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非性空法有染有淨，亦非離法有染有淨；非性空法能證無上正等菩提，亦非離法能證無上正等菩提；非性空中有法可得，亦非離中有法可得；非性空中有菩薩摩訶薩證得無上正等菩提，亦非離中有菩薩摩訶薩證得無上正等菩提。",
        "translation": "It's not that intrinsically empty things are defiled and purified, nor that isolated things are defiled and purified; it's not that intrinsically empty things can realize unsurpassed correct enlightenment, nor that isolated things can realize unsurpassed correct enlightenment; it's not that intrinsically empty things are obtainable, nor that isolated middle things are obtainable; it's not that intrinsically empty bodhisattvas and mahāsattvas realize unsurpassed correct enlightenment, nor that isolated middle things realize unsurpassed correct enlightenment.",
        "source": "T07n0220_453:0288c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_453:0288c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何令我解佛所說甚深義趣？」",
        "translation": "How can I understand the profound import of what the Buddha has taught?\"",
        "source": "T07n0220_453:0288c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha addressed the Śākyamuni, \"What do you think?",
        "source": "T07n0220_453:0288c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情長夜有我、我所，心執我、我所不？」",
        "translation": "For a long time, sentient beings have a self and what belongs to self, and the mind clings to self and what belongs to self...\"",
        "source": "T07n0220_453:0288c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "The skillful manifestation replied, \"So it is!",
        "source": "T07n0220_453:0288c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_453:0288c27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情長夜有我、我所，心執著我、我所。」",
        "translation": "For a long time, sentient beings have a self and what belongs to self, and their minds are attached to self and what belongs to self.\"",
        "source": "T07n0220_453:0288c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Śubhavyūha, \"What do you think?",
        "source": "T07n0220_453:0288c28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情所執我及我所空、遠離不？」",
        "translation": "Is the self and what belongs to self that sentient beings attach to empty and free from?\"",
        "source": "T07n0220_453:0288c28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "The skillful manifestation replied, \"So it is!",
        "source": "T07n0220_453:0288c29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_453:0288c29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情所執我及我所皆空、遠離。」",
        "translation": "The self and what belongs to self that sentient beings attach to are empty and removed.\"",
        "source": "T07n0220_453:0288c29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Śubhavyūha, \"What do you think?",
        "source": "T07n0220_453:0289a01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈不有情由我、我所執馳流生死？」",
        "translation": "Does it not mean that sentient beings chase through birth and death based on attachment to self and what is self?\"",
        "source": "T07n0220_453:0289a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "The skillful manifestation replied, \"So it is!",
        "source": "T07n0220_453:0289a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_453:0289a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有情類由我、我所執馳流生死。」",
        "translation": "All sentient beings chase through birth and death based on their attachment to self and what's self.\"",
        "source": "T07n0220_453:0289a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如是有情馳流生死，由有雜染，是故有情施設有染。",
        "translation": "The Buddha told Śaṅgālī, \"Thus, sentient beings chase through birth and death because of defilements; therefore, sentient beings are defined as having defilements.",
        "source": "T07n0220_453:0289a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情無心執著我及我所則無雜染，若無雜染，則不得有馳流生死。",
        "translation": "If sentient beings don't mentally attach to self and what belongs to self, then there's no defilement, and if there's no defilement, then there can't be churning birth-and-death.",
        "source": "T07n0220_453:0289a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馳流生死既不可得，當知有情遠離雜染，由無雜染施設有情。",
        "translation": "Since it's impossible to have chase after birth and death, you should know that sentient beings are free of defilements, and it's because of the absence of defilements that sentient beings are imagined.",
        "source": "T07n0220_453:0289a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T07n0220_453:0289a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知有情雖自性空，遠離諸相，而可施設有染有淨。」",
        "translation": "You should know that although the nature of sentient beings is empty and free from characteristics, it's possible to define defiled and pure.\"",
        "source": "T07n0220_453:0289a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時具壽善現復白佛言：「世尊！",
        "translation": "It was then that Kauśāmbī Sunbeam again said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_453:0289a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能行如是甚深般若波羅蜜多及一切法空、遠離相，是菩薩摩訶薩則不行色，亦不行受、想、行、識；不行眼處，亦不行耳、鼻、舌、身、意處；不行色處，亦不行聲、香、味、觸、法處；不行眼界，亦不行耳、鼻、舌、身、意界；不行色界，亦不行聲、香、味、觸、法界；不行眼識界，亦不行耳、鼻、舌、身、意識界；不行眼觸，亦不行耳、鼻、舌、身、意觸；不行眼觸為緣所生諸受，亦不行耳、鼻、舌、身、意觸為緣所生諸受；不行地界，亦不行水、火、風、空、識界；不行因緣，亦不行等無間緣、所緣緣、增上緣；不行無明，亦不行行、識、名色、六處、觸、受、愛、取、有、生、老死；不行布施波羅蜜多，亦不行淨戒、安忍、精進、靜慮、般若波羅蜜多；不行內空，亦不行外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空；不行真如，亦不行法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；不行苦聖諦，亦不行集、滅、道聖諦；不行四念住，亦不行四正斷、四神足、五根、五力、七等覺支、八聖道支；不行四靜慮，亦不行四無量、四無色定；不行八解脫，亦不行八勝處、九次第定、十遍處；不行空解脫門，亦不行無相、無願解脫門；不行淨觀地，亦不行種姓地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地；不行極喜地，亦不行離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地；不行一切陀羅尼門，亦不行一切三摩地門；不行五眼，亦不行六神通；不行佛十力，亦不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；不行無忘失法，亦不行恒住捨性；不行預流果，亦不行一來、不還、阿羅漢果、獨覺菩提；不行一切智，亦不行道相智、一切相智。",
        "translation": "若菩薩摩訶薩能行如是甚深般若波羅蜜多及一切法空、遠離相，是菩薩摩訶薩則不行色，亦不行受、想、行、識；不行眼處，亦不行耳、鼻、舌、身、意處；不行色處，亦不行聲、香、味、觸、法處；不行眼界，亦不行耳、鼻、舌、身、意界；不行色界，亦不行聲、香、味、觸、法界；不行眼識界，亦不行耳、鼻、舌、身、意識界；不行眼觸，亦不行耳、鼻、舌、身、意觸；不行眼觸為緣所生諸受，亦不行耳、鼻、舌、身、意觸為緣所生諸受；不行地界，亦不行水、火、風、空、識界；不行因緣，亦不行等無間緣、所緣緣、增上緣；不行無明，亦不行行、識、名色、六處、觸、受、愛、取、有、生、老死；不行布施波羅蜜多，亦不行淨戒、安忍、精進、靜慮、般若波羅蜜多；不行內空，亦不行外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空；不行真如，亦不行法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；不行苦聖諦，亦不行集、滅、道聖諦；不行四念住，亦不行四正斷、四神足、五根、五力、七等覺支、八聖道支；不行四靜慮，亦不行四無量、四無色定；不行八解脫，亦不行八勝處、九次第定、十遍處；不行空解脫門，亦不行無相、無願解脫門；不行淨觀地，亦不行種姓地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地；不行極喜地，亦不行離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地；不行一切陀羅尼門，亦不行一切三摩地門；不行五眼，亦不行六神通；不行佛十力，亦不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；不行無忘失法，亦不行恒住捨性；不行預流果，亦不行一來、不還、阿羅漢果、獨覺菩提；不行一切智，亦不行道相智、一切相智。",
        "source": "T07n0220_453:0289a10_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0289b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法能行、所行及由此行、行時、行處皆不可得。",
        "translation": "Thus, it's impossible to know what can be done, what is done, or how, when, or where these things are done.",
        "source": "T07n0220_453:0289b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_453:0289b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能如是行，不為一切世間天、人、阿素洛等之所降伏，而能伏彼。",
        "translation": "If a bodhisattva-mahāsattva can thus practice, he won't be subdued by any worldly gods, humans, asuras, and so forth, but will be able to subdue them.",
        "source": "T07n0220_453:0289b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_453:0289b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能如是行，不為一切聲聞、獨覺之所降伏，而能伏彼。",
        "translation": "If a bodhisattva-mahāsattva can thus practice, he won't be subdued by all the śrāvakas and solitary realizers but will be able to subdue them.",
        "source": "T07n0220_453:0289b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_453:0289b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩已得安住無能伏位，謂菩薩離生位。",
        "translation": "This is the bodhisattva Mahāsattva who has attained the stage of no subjugation, which is the bodhisattva's stage of freedom from birth.",
        "source": "T07n0220_453:0289b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_453:0289b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩恒住一切智智作意不可屈伏。",
        "translation": "\"This is the bodhisattva Mahāsattva who constantly abides with the intention of knowing all cognitions and cannot be subjugated.",
        "source": "T07n0220_453:0289b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_453:0289b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩如是行時，則為隣近一切智智，疾證無上正等菩提。」",
        "translation": "When bodhisattvas, mahāsattvas thus practice, they come close to omniscience and quickly realize unsurpassed perfect enlightenment.\"",
        "source": "T07n0220_453:0289b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, \"Good performance!",
        "source": "T07n0220_453:0289b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_453:0289b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_453:0289b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_453:0289b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能行如是甚深般若波羅蜜多及一切法空、遠離相，是菩薩摩訶薩則不行色，亦不行受、想、行、識；乃至不行一切智，亦不行道相智、一切相智。",
        "translation": "If a bodhisattva-mahāsattva can practice such profound prajñāpāramitā and the emptiness and freedom from characteristics of all things, then that bodhisattva-mahāsattva doesn't practice form, doesn't practice feeling, perception, volition, and consciousness; it doesn't practice all cognition, nor does it practice knowledge of the path or knowledge of all characteristics.",
        "source": "T07n0220_453:0289b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸法能行、所行及由此行、行時、行處皆不可得。",
        "translation": "Thus, it's impossible to know what can be done, what is done, or how, when, or where these things are done.",
        "source": "T07n0220_453:0289b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能如是行，不為一切世間天、人、阿素洛等之所降伏，亦復不為聲聞、獨覺之所降伏，而能伏彼。",
        "translation": "If a bodhisattva-mahāsattva can thus practice, he won't be subdued by any worldly gods, humans, asuras, and so forth, nor will he be subdued by śrāvakas and solitary realizers, but will be able to subdue them.",
        "source": "T07n0220_453:0289c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩已得安住無能伏位，謂菩薩離生位，恒住一切智智作意不可屈伏，則為隣近一切智智，疾證無上正等菩提。",
        "translation": "Such a bodhisattva has attained the stage of being able to subdue none, which is defined as a bodhisattva who is free of the stage of birth and who constantly abides in the contemplation that all wisdom is knowledge and cannot be subdued, then he comes close to all wisdom and quickly realizes unsurpassed correct enlightenment.",
        "source": "T07n0220_453:0289c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百五十三",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 453",
        "source": "T07n0220_453:0289c07_0",
        "is_bad_quality": false
    }
]