[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百八",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 588",
        "source": "T07n0220_585:1024b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T07n0220_585:1024b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_585:1024b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第十二淨戒波羅蜜多分之二",
        "translation": "Portion Two of the Perfection of Twelve Pure Precepts",
        "source": "T07n0220_585:1024b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子復告具壽滿慈子言：「若諸菩薩修行淨戒波羅蜜多，見有少法名為作者，當知雖住菩薩法中，而名棄捨諸菩薩法，是為菩薩非理作意。",
        "translation": "Śāriputra then again addressed Kauśāmbīja, \"Suppose a bodhisattva cultivates the perfection of pure precepts and sees that there are few things called authors, then you should know that even though you're abiding in the bodhisattva dharmas, you're called abandoning the bodhisattva dharmas, which is a bodhisattva's improper intention.",
        "source": "T07n0220_585:1024b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若起如是非理作意，應知名為犯戒菩薩。」",
        "translation": "If they give rise to such nonrational contemplation, they should be known as a bodhisattva who violates the precepts.\"",
        "source": "T07n0220_585:1024b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，滿慈子便白具壽舍利子言：「若諸菩薩不見少法名為作者，是諸菩薩受持淨戒波羅蜜多無所違犯。",
        "translation": "Pūrṇa Maitrāyaniputra then said to Śāriputra, \"If bodhisattvas don't see a little dharma called author, then there's no violation of the perfection of pure precepts that bodhisattvas uphold.",
        "source": "T07n0220_585:1024b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何法於此菩薩淨戒波羅蜜多為益為損？」",
        "translation": "What is it that benefits or harms the perfection of these bodhisattvas' pure precepts?\"",
        "source": "T07n0220_585:1024b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子言：「無法於此菩薩淨戒波羅蜜多為益為損，若見少法於此淨戒波羅蜜多為益為損，當知執取菩薩淨戒。",
        "translation": "Śāriputra said, \"It's impossible to make the pāramitā of the bodhisattva's pure precepts beneficial or detrimental, and if you see a little something that makes the pāramitā of the pure precepts beneficial or detrimental, you should know that you're appropriating the bodhisattva's pure precepts.",
        "source": "T07n0220_585:1024b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩見有少法於此淨戒波羅蜜多為益為損，是諸菩薩不能攝受菩薩淨戒波羅蜜多。",
        "translation": "If bodhisattvas see that there are few things that are beneficial and detrimental to the perfection of these pure precepts, then bodhisattvas can't take in the perfection of the bodhisattva's pure precepts.",
        "source": "T07n0220_585:1024c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩不見少法名為作者，是諸菩薩能正攝受菩薩淨戒波羅蜜多。",
        "translation": "If bodhisattvas don't see a little dharma called author, then bodhisattvas can correctly take in the perfection of the bodhisattva's pure precepts.",
        "source": "T07n0220_585:1024c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩受持淨戒，迴向趣求一切智智，乃名淨戒波羅蜜多。",
        "translation": "If bodhisattvas uphold the pure precepts and turn their attention toward the knowledge of all things, then they're called the perfection of pure precepts.",
        "source": "T07n0220_585:1024c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩受持淨戒，不能迴求一切智智，應知此戒雖得戒名，而非淨戒波羅蜜多，或求二乘、世間果故。",
        "translation": "If bodhisattvas accept the pure precepts and aren't able to turn toward the knowledge of all things, you should know that although these precepts are given the name precepts, they aren't the perfection of pure precepts, or they may seek the results of the two vehicles or the world.",
        "source": "T07n0220_585:1024c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "\"Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_585:1024c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩隨所行施，無不皆用大悲為首，常能發起隨順迴向一切智智相應之心，應知是名具戒菩薩。",
        "translation": "If bodhisattvas invariably use great compassion as the leader of whatever generosity they practice, and they can always give rise to the mind that's associated with the knowledge of all things that are approached, you should know that this is called a bodhisattva in possession of the precepts.",
        "source": "T07n0220_585:1024c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "\"Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_585:1024c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩隨所護戒，無不皆用大悲為首，常能發起隨順迴向一切智智相應之心，應知名為具戒菩薩。",
        "translation": "If bodhisattvas invariably guard the precepts in ways that are headed by great compassion and can always give rise to the mind that's associated with the knowledge that follows and leads to the knowledge of all things, they should be known as bodhisattvas in possession of the precepts.",
        "source": "T07n0220_585:1024c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "\"Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_585:1024c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩於諸有情若打若罵、誹謗、凌辱、輕弄等事，隨所修忍，無不皆用大悲為首，常能發起隨順迴向一切智智相應之心，應知是名具戒菩薩。",
        "translation": "If bodhisattvas cultivate forbearance toward sentient beings in response to such things as beating, scolding, slander, abuse, and molestation, and so forth, and they invariably use great compassion as their leader, always generating the mind that's associated with the knowledge of all things that are approached, you should know that this is called a bodhisattva in full possession of the precepts.",
        "source": "T07n0220_585:1024c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "\"Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_585:1024c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩為欲拔濟一切有情惡趣生死種種苦惱，隨行精進，無不皆用大悲為首，常能發起隨順迴向一切智智相應之心，應知是名具戒菩薩。",
        "translation": "If bodhisattvas want to rescue all sentient beings from the various sufferings of birth and death in the evil destinies, and if they pursue their endeavors accordingly, they invariably use great compassion as their leader and can always give rise to the mind that's associated with the knowledge of all kinds of obediences, you should know that this is called a bodhisattva in full possession of the precepts.",
        "source": "T07n0220_585:1024c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "\"Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_585:1024c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩隨起靜慮，作是思惟：『我應引發殊勝靜慮，由斯發起殊勝神通，知諸有情心行差別說授法藥，令脫惡趣生死眾苦；又為調伏自身煩惱，與有情類作淨福田，堪任引發一切智智。』",
        "translation": "If bodhisattvas accordingly give rise to meditation and thus contemplate, 'Should I give rise to exceptional meditation and thus give rise to exceptional supernormal powers that know the differences in the minds and actions of sentient beings and teach them the medicine that will liberate them from the many sufferings of birth-and-death in the evil destinies, and in order to tame my own afflictions and make a pure field of merit for sentient beings, I'd be capable of giving rise to the knowledge of all kinds of cognition.'",
        "source": "T07n0220_585:1024c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是思惟隨修靜慮，一切皆用大悲為首，常能發起隨順迴向一切智智相應之心，應知是名具戒菩薩。",
        "translation": "Thus contemplating and following the cultivation of meditation, he always uses great compassion as the foremost thing, and he can always give rise to the mind that's associated with the knowledge of all things in a compliant manner, which should be known as a bodhisattva in possession of the precepts.",
        "source": "T07n0220_585:1024c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "\"Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_585:1024c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩隨所修行甚深妙慧，皆為於法遠離顛倒、得諸善巧，謂蘊善巧、若界善巧、若處善巧、若諦善巧、若緣起善巧、若是處非處善巧。",
        "translation": "\"If bodhisattvas cultivate the profound and subtle wisdom that follows, it's all for the purpose of avoiding mistakenness in regard to qualities and attaining the skillful means of the aggregates, the skillful means of the elements, the skillful means of the locations, the skillful means of the truths, the skillful means of dependent arising, and the skillful means of what is and isn't a location.",
        "source": "T07n0220_585:1024c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為於蘊善巧？",
        "translation": "\"What's called skillfulness in the aggregates?",
        "source": "T07n0220_585:1025a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如實了知所有色蘊種種自相，如實了知所有受、想、行、識蘊種種自相，如是名為於蘊善巧。",
        "translation": "It means that bodhisattvas truly know the various aspects of all the form aggregates and truly know the various aspects of all the sensation, perception, volition, and consciousness aggregates, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊種種自相皆不可得，如實了知所有受、想、行、識蘊種種自相皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that the various aspects of all the form aggregates are unknowable, and they truly know that the various aspects of all the sensation, perception, volition, and consciousness aggregates are unknowable, which is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊種種共相，如實了知所有受、想、行、識蘊種種共相，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of all the form aggregates and truly know the various common characteristics of all the sensation, perception, volition, and consciousness aggregates, which is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊種種共相皆不可得，如實了知所有受、想、行、識蘊種種共相皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that the characteristics common to all the varieties of the form aggregate are unknowable, and they truly know that the characteristics common to all the varieties of the feeling, perception, volition, and consciousness aggregates are unknowable, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若常若無常皆不可得，如實了知所有受、想、行、識蘊若常若無常皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are impermanent whether permanent or impermanent, and they truly know that all feeling, perception, volition, and consciousness aggregates are impermanent whether permanent or impermanent, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若樂若苦皆不可得，如實了知所有受、想、行、識蘊若樂若苦皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are unknowable whether they are pleasant or painful, and they truly know that all feeling, perception, volition, and consciousness aggregates are unknowable whether they are pleasant or painful, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若我若無我皆不可得，如實了知所有受、想、行、識蘊若我若無我皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are unobtainable whether they are self or selfless, and they truly know that all feeling, perception, volition, and consciousness aggregates are unobtainable whether they are self or selfless, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若淨若不淨皆不可得，如實了知所有受、想、行、識蘊若淨若不淨皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are inaccessible whether they are pure or impure, and they truly know that all feeling, perception, volition, and consciousness aggregates are inaccessible whether they are pure or impure, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若空若不空皆不可得，如實了知所有受、想、行、識蘊若空若不空皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are unknowable whether empty or nonempty, and they truly know that all feeling, perception, volition, and consciousness aggregates are unknowable whether empty or nonempty, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若有相若無相皆不可得，如實了知所有受、想、行、識蘊若有相若無相皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are unknowable whether they are similar or not, and they truly know that all feeling, perception, volition, and consciousness aggregates are unknowable whether they are similar or not, which is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若有願若無願皆不可得，如實了知所有受、想、行、識蘊若有願若無願皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are unknowable whether they have wishes or lack wishes, and they truly know that all feeling, perception, volition, and consciousness aggregates are unknowable whether they have wishes or lack wishes, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若寂靜若不寂靜皆不可得，如實了知所有受、想、行、識蘊若寂靜若不寂靜皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates are unknowable whether they are quiescent or not, and they truly know that all feeling, perception, volition, and consciousness aggregates are unknowable whether they are quiescent or not, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色蘊若遠離若不遠離皆不可得，如實了知所有受、想、行、識蘊若遠離若不遠離皆不可得，如是名為於蘊善巧。",
        "translation": "Also, bodhisattvas truly know that all form aggregates that are remote and not remote are unobtainable, and they truly know that all feeling, perception, volition, and consciousness aggregates that are remote and not remote are unobtainable, and this is called skillfulness in the aggregates.",
        "source": "T07n0220_585:1025b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為於界善巧？",
        "translation": "\"What is called skillfulness in regard to the elements?",
        "source": "T07n0220_585:1025b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如實了知所有眼界種種自相，如實了知所有耳、鼻、舌、身、意界種種自相，如是名為於界善巧。",
        "translation": "It means that bodhisattvas truly know the various kinds of characteristics of the visual realm and truly know the various kinds of characteristics of the auditory, nasal, tongue, body, and mental realms, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1025b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界種種自相皆不可得，如實了知所有耳、鼻、舌、身、意界種種自相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas who truly know that the various kinds of self-marks of the whole eye realm are unobtainable and who truly know that the various kinds of self-marks of the whole ear, nose, tongue, body, and mind realms are unobtainable are thus skillful in the realm.",
        "source": "T07n0220_585:1025b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界種種共相，如實了知所有耳、鼻、舌、身、意界種種共相，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of the visual realm and truly know the various common characteristics of the ear, nose, tongue, body, and mental realms, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1025b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界種種共相皆不可得，如實了知所有耳、鼻、舌、身、意界種種共相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all the various common characteristics of the eye realm are unobtainable, and they truly know that all the various common characteristics of the ear, nose, tongue, body, and mind realms are unobtainable, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1025b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若常若無常皆不可得，如實了知所有耳、鼻、舌、身、意界若常若無常皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whatever is permanent and impermanent in the eye realm is unobtainable, and they truly know that whatever is permanent and impermanent in the ear, nose, tongue, body, and mind realms is unobtainable, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1025b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若樂若苦皆不可得，如實了知所有耳、鼻、舌、身、意界若樂若苦皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether it's pleasant or painful in the eye realm is unobtainable, and they truly know that whether it's pleasant or painful in the ear, nose, tongue, body, and mind realms is unobtainable, which is called skillfulness in the realms.",
        "source": "T07n0220_585:1025b24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若我若無我皆不可得，如實了知所有耳、鼻、舌、身、意界若我若無我皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that neither self nor selflessness is obtainable in the visual realm, and they truly know that neither self nor selflessness is obtainable in the ear, nose, tongue, body, and mental realms, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1025b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若淨若不淨皆不可得，如實了知所有耳、鼻、舌、身、意界若淨若不淨皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of the eye is pure or impure, it's unobtainable, and they truly know that whether the element of the ear, nose, tongue, body, and mind is pure or impure, it's unobtainable, and this is called skillfulness in the element.",
        "source": "T07n0220_585:1025c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若空若不空皆不可得，如實了知所有耳、鼻、舌、身、意界若空若不空皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of the eye is empty or not empty is unobtainable, and they truly know that whether the element of the ear, nose, tongue, body, and mind is empty or not empty is unobtainable, and this is called skillfulness in regard to the element.",
        "source": "T07n0220_585:1025c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若有相若無相皆不可得，如實了知所有耳、鼻、舌、身、意界若有相若無相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all of the eye realm is unobtainable whether it's similar or not, and they truly know that all of the ear, nose, tongue, body, and mind realms are unobtainable whether they are similar or not, which is called skillfulness in the realms.",
        "source": "T07n0220_585:1025c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若有願若無願皆不可得，如實了知所有耳、鼻、舌、身、意界若有願若無願皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the eye realm has a wish or lacks a wish is unobtainable, and they truly know that whether the ear, nose, tongue, body, or mind realm has a wish or lacks a wish is unobtainable, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1025c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若寂靜若不寂靜皆不可得，如實了知所有耳、鼻、舌、身、意界若寂靜若不寂靜皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the eye realm is quiescent or not quiescent is unobtainable, and they truly know that whether the ear, nose, tongue, body, and mind realms are quiescent or not quiescent is unobtainable, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1025c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼界若遠離若不遠離皆不可得，如實了知所有耳、鼻、舌、身、意界若遠離若不遠離皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all of the element of vision that is isolated and not isolated is unobtainable, and they truly know that all of the elements of ear, nose, tongue, body, and mind that are isolated and not isolated is unobtainable, and this is called skillfulness in the elements.",
        "source": "T07n0220_585:1025c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸菩薩如實了知所有色界種種自相，如實了知所有聲、香、味、觸、法界種種自相，如是名為於界善巧。",
        "translation": "\"Also, bodhisattvas truly know the various aspects of the form realm and truly know the various aspects of the sound, smell, taste, touch, and dharma realms, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1025c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界種種自相皆不可得，如實了知所有聲、香、味、觸、法界種種自相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that the various kinds of self-subjects of the form realm are unobtainable, and they truly know that the various kinds of self-subjects of the sound, smell, taste, touch, and dharma realms are unobtainable, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1025c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界種種共相，如實了知所有聲、香、味、觸、法界種種共相，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of all the form realms and truly know the various common characteristics of all the sound, smell, taste, touch, and dharma realms, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1025c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界種種共相皆不可得，如實了知所有聲、香、味、觸、法界種種共相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all the various common characteristics of the form realm are unknowable, and they truly know that all the various common characteristics of sound, smell, taste, touch, and the Dharma realm are unknowable, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1025c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若常若無常皆不可得，如實了知所有聲、香、味、觸、法界若常若無常皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whatever is permanent and impermanent in the form realm is unobtainable, and they truly know that whatever is permanent and impermanent in the sound, smell, taste, touch, and dharma realms is unobtainable, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1025c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若樂若苦皆不可得，如實了知所有聲、香、味、觸、法界若樂若苦皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether it's pleasant or painful in the form realm is unobtainable, and they truly know that whether it's pleasant or painful in the sound, smell, taste, touch, or Dharma realms is unobtainable, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1026a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若我若無我皆不可得，如實了知所有聲、香、味、觸、法界若我若無我皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that neither the form realm nor the absence of self is obtainable, and they truly know that neither the sound, smell, taste, touch, nor the Dharma realm is obtainable if it's self or selfless, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1026a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若淨若不淨皆不可得，如實了知所有聲、香、味、觸、法界若淨若不淨皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the form realm is pure or impure, it's unobtainable, and they truly know that whether the sound, smell, taste, touch, or Dharma realms are pure or impure, it's unobtainable, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1026a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若空若不空皆不可得，如實了知所有聲、香、味、觸、法界若空若不空皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all form realms, whether empty or nonempty, are unobtainable, and they truly know that all sound, smell, taste, touch, and the Dharma realm, whether empty or nonempty, are unobtainable, and this is called skillfulness in the realm.",
        "source": "T07n0220_585:1026a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若有相若無相皆不可得，如實了知所有聲、香、味、觸、法界若有相若無相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all of the form realm is unobtainable whether it's similar or not, and they truly know that all of the sound, smell, taste, touch, and dharma realms are unobtainable whether they are similar or not, which is called skillfulness in the realms.",
        "source": "T07n0220_585:1026a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若有願若無願皆不可得，如實了知所有聲、香、味、觸、法界若有願若無願皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all form realms are unknowable whether they have a wish or no wish, and they truly know that all sound, smell, taste, touch, and dharma realms are unknowable whether they have a wish or no wish, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1026a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若寂靜若不寂靜皆不可得，如實了知所有聲、香、味、觸、法界若寂靜若不寂靜皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the form realm is quiescent or not quiescent is unobtainable, and they truly know that whether the sound, smell, taste, touch, and dharma realms are quiescent or not quiescent is unobtainable, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1026a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色界若遠離若不遠離皆不可得，如實了知所有聲、香、味、觸、法界若遠離若不遠離皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all of the form realm that is isolated and not isolated is unobtainable, and they truly know that all of the sound, smell, taste, touch, and dharma realms that are isolated and not isolated is unobtainable, and this is called skillfulness in regard to the realms.",
        "source": "T07n0220_585:1026a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸菩薩如實了知所有眼識界種種自相，如實了知所有耳、鼻、舌、身、意識界種種自相，如是名為於界善巧。",
        "translation": "\"Also, bodhisattvas truly know the various aspects of the element of the visual consciousness and truly know the various aspects of the elements of ear, nose, tongue, body, and consciousness, and this is called skillfulness in the elements.",
        "source": "T07n0220_585:1026a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界種種自相皆不可得，如實了知所有耳、鼻、舌、身、意識界種種自相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that the various kinds of self-marks of the element of visual consciousness are unobtainable, and they truly know that the various kinds of self-marks of the elements of ear, nose, tongue, body, and consciousness are unobtainable, and this is called skillfulness in the elements.",
        "source": "T07n0220_585:1026b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界種種共相，如實了知所有耳、鼻、舌、身、意識界種種共相，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of the element of visual consciousness and truly know the various common characteristics of the elements of ear, nose, tongue, body, and consciousness, and this is called skillfulness in the elements.",
        "source": "T07n0220_585:1026b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界種種共相皆不可得，如實了知所有耳、鼻、舌、身、意識界種種共相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all the various common characteristics of the visual consciousness realm are unobtainable, and they truly know that all the various common characteristics of the ear, nose, tongue, body, and consciousness realms are unobtainable, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1026b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若常若無常皆不可得，如實了知所有耳、鼻、舌、身、意識界若常若無常皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whatever is permanent and impermanent in the element of the eye consciousness is unobtainable, and they truly know that whatever is permanent and impermanent in the elements of ear, nose, tongue, body, and consciousness is unobtainable, and this is called skillfulness in the elements.",
        "source": "T07n0220_585:1026b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若樂若苦皆不可得，如實了知所有耳、鼻、舌、身、意識界若樂若苦皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether it's pleasant or painful in the element of the visual consciousness is unobtainable, and they truly know that whether it's pleasant or painful in the element of the ear, nose, tongue, body, and consciousness is unobtainable, and this is called skillfulness in the element.",
        "source": "T07n0220_585:1026b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若我若無我皆不可得，如實了知所有耳、鼻、舌、身、意識界若我若無我皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that neither the self nor the absence of self in the element of the eye consciousness is obtainable, and they truly know that neither the self nor the absence of self in the elements of ear, nose, tongue, body, and consciousness is obtainable, which is called skillfulness in the elements.",
        "source": "T07n0220_585:1026b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若淨若不淨皆不可得，如實了知所有耳、鼻、舌、身、意識界若淨若不淨皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of the visual consciousness is pure or impure is unobtainable, and they truly know that whether the element of the ear, nose, tongue, body, or consciousness is pure or impure is unobtainable, and this is called skillfulness in the element.",
        "source": "T07n0220_585:1026b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若空若不空皆不可得，如實了知所有耳、鼻、舌、身、意識界若空若不空皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of the visual consciousness is empty or not empty, and they truly know that whether the element of the ear, nose, tongue, body, or consciousness is empty or not empty, it's unobtainable, and this is called skillfulness in the element.",
        "source": "T07n0220_585:1026b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若有相若無相皆不可得，如實了知所有耳、鼻、舌、身、意識界若有相若無相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of the visual consciousness is similar or not similar, it's unobtainable, and they truly know that whether the element of the ear, nose, tongue, body, or consciousness is similar or not similar, it's unobtainable, which is called skillfulness in the element.",
        "source": "T07n0220_585:1026b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若有願若無願皆不可得，如實了知所有耳、鼻、舌、身、意識界若有願若無願皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of the eye consciousness exists or doesn't exist, and they truly know that whether the ear, nose, tongue, body, or consciousness exists or doesn't exist is unobtainable, which is called skillfulness in regard to the elements.",
        "source": "T07n0220_585:1026b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若寂靜若不寂靜皆不可得，如實了知所有耳、鼻、舌、身、意識界若寂靜若不寂靜皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of the visual consciousness is quiescent or not quiescent is unobtainable, and they truly know that whether the element of the ear, nose, tongue, body, or consciousness is quiescent or not quiescent is unobtainable, and this is called skillfulness in regard to the element.",
        "source": "T07n0220_585:1026c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼識界若遠離若不遠離皆不可得，如實了知所有耳、鼻、舌、身、意識界若遠離若不遠離皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all the elements of the visual consciousness that are isolated or not isolated are unobtainable, and they truly know that all the elements of the ear, nose, tongue, body, and consciousness that are isolated or not isolated are unobtainable, and this is called skillfulness in regard to the elements.",
        "source": "T07n0220_585:1026c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸菩薩如實了知所有眼觸種種自相，如實了知所有耳、鼻、舌、身、意觸種種自相，如是名為於界善巧。",
        "translation": "\"Also, bodhisattvas truly know the various aspects of all eye contact and truly know the various aspects of all ear, nose, tongue, body, and mind contact, and this is called skillfulness in regard to the elements.",
        "source": "T07n0220_585:1026c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸種種自相皆不可得，如實了知所有耳、鼻、舌、身、意觸種種自相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that the various kinds of self-subjects of all eye contact are unobtainable, and they truly know that the various kinds of self-subjects of all ear, nose, tongue, body, and mind contact are unobtainable, and this is called skillfulness in the element.",
        "source": "T07n0220_585:1026c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸種種共相，如實了知所有耳、鼻、舌、身、意觸種種共相，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of all eye contact and truly know the various common characteristics of all ear, nose, tongue, body, and mind contact, and this is called skillfulness in the element.",
        "source": "T07n0220_585:1026c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸種種共相皆不可得，如實了知所有耳、鼻、舌、身、意觸種種共相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that the various common characteristics of all eye contact are unobtainable, and they truly know that the various common characteristics of all ear, nose, tongue, body, and mind contact are unobtainable, which is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1026c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若常若無常皆不可得，如實了知所有耳、鼻、舌、身、意觸若常若無常皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sense-tactile sensations of the eye that are permanent and impermanent are unobtainable, and they truly know that all sense-tactile sensations of the ear, nose, tongue, body, and mind that are permanent and impermanent are unobtainable, which is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1026c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若樂若苦皆不可得，如實了知所有耳、鼻、舌、身、意觸若樂若苦皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know whether all eye contact is pleasant or painful and unknowable, and they truly know whether all ear, nose, tongue, body, and mind contact is pleasant or painful and unknowable, which is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1026c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若我若無我皆不可得，如實了知所有耳、鼻、舌、身、意觸若我若無我皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all eye contact whether self or no-self is unobtainable, and they truly know that all ear, nose, tongue, body, and mind contact whether self or no-self is unobtainable, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1026c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若淨若不淨皆不可得，如實了知所有耳、鼻、舌、身、意觸若淨若不淨皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether all eye contact is pure or impure, it's unobtainable, and they truly know that whether all ear, nose, tongue, body, and mind contact is pure or impure, it's unobtainable, which is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1026c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若空若不空皆不可得，如實了知所有耳、鼻、舌、身、意觸若空若不空皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all eye contact, whether empty or nonempty, is unobtainable, and they truly know that all ear, nose, tongue, body, and mind contact, whether empty or nonempty, is unobtainable, which is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若有相若無相皆不可得，如實了知所有耳、鼻、舌、身、意觸若有相若無相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sense-tactile sensations are unknowable whether they are similar or not, and they truly know that all sense-tactile sensations of the ear, nose, tongue, body, and mind are unknowable whether they are similar or not, which is called skillfulness in the element.",
        "source": "T07n0220_585:1027a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若有願若無願皆不可得，如實了知所有耳、鼻、舌、身、意觸若有願若無願皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all eye contact with or without a wish is unobtainable, and they truly know that all ear, nose, tongue, body, and mind contact with or without a wish is unobtainable, which is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若寂靜若不寂靜皆不可得，如實了知所有耳、鼻、舌、身、意觸若寂靜若不寂靜皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all eye contact that's quiescent and that's not quiescent is unobtainable, and they truly know that all ear, nose, tongue, body, and mind contact that's quiescent and that's not quiescent is unobtainable, and this is called skillfulness in regard to the objective realm.",
        "source": "T07n0220_585:1027a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸若遠離若不遠離皆不可得，如實了知所有耳、鼻、舌、身、意觸若遠離若不遠離皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all eye contact that's isolated or not isolated is unobtainable, and they truly know that all ear, nose, tongue, body, and mind contact that's isolated or not isolated is unobtainable, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸菩薩如實了知所有眼觸為緣所生諸受種種自相，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受種種自相，如是名為於界善巧。",
        "translation": "\"Also, bodhisattvas truly know the various kinds of sensations that arise from visual contact as a condition, and they truly know the various kinds of sensations that arise from ear, nose, tongue, body, and mental contact as a condition, and this is called skillfulness in regard to the objective realm.",
        "source": "T07n0220_585:1027a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受種種自相皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受種種自相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that the various kinds of self-subjects of sensations that arise from visual contact are unobtainable, and they truly know that the various kinds of self-subjects of sensations that arise from contact with the ear, nose, tongue, body, and mind are unobtainable, and this is called skillfulness in regard to the objective realm.",
        "source": "T07n0220_585:1027a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受種種共相，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受種種共相，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of all the sensations that arise from visual contact as a condition, and they truly know the various common characteristics of all the sensations that arise from contact with the ear, nose, tongue, body, and mind as a condition, and this is called skillfulness in regard to the objective realm.",
        "source": "T07n0220_585:1027a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受種種共相皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受種種共相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that the various common characteristics of all feelings that arise from visual contact are unobtainable, and they truly know that the various common characteristics of all feelings that arise from contact with the ear, nose, tongue, body, and mind are unobtainable, and this is called skillfulness in regard to the objective realm.",
        "source": "T07n0220_585:1027a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若常若無常皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若常若無常皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all feelings that arise from visual contact as a condition are impermanent and impermanent, and they truly know that all feelings that arise from ear, nose, tongue, body, and mind contact as a condition are impermanent and impermanent, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若樂若苦皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若樂若苦皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition are neither pleasant nor painful, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition are neither pleasant nor painful, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若我若無我皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若我若無我皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition are neither self nor selfless, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition are neither self nor selfless, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若淨若不淨皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若淨若不淨皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition, whether pure or impure, are unobtainable, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition, whether pure or impure, are unobtainable, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若空若不空皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若空若不空皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition are neither empty nor nonempty, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition are neither empty nor nonempty, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若有相若無相皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若有相若無相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition are inapprehensible whether they have form or formlessness, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition are inapprehensible whether they have form or formlessness, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若有願若無願皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若有願若無願皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition are unknowable whether they are wished for or not, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition are unknowable whether they are wished for or not, and this is called skillfulness in the element.",
        "source": "T07n0220_585:1027b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若寂靜若不寂靜皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若寂靜若不寂靜皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition, whether quiescent or nonquiescent, are unobtainable, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition, whether quiescent or nonquiescent, are unobtainable, and this is called skillfulness in the objective realm.",
        "source": "T07n0220_585:1027b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼觸為緣所生諸受若遠離若不遠離皆不可得，如實了知所有耳、鼻、舌、身、意觸為緣所生諸受若遠離若不遠離皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all sensations that arise from visual contact as a condition, whether distant or not, are unobtainable, and they truly know that all sensations that arise from ear, nose, tongue, body, and mind contact as a condition, whether distant or not, are unobtainable, and this is called skillfulness in regard to the objective realm.",
        "source": "T07n0220_585:1027c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸菩薩如實了知所有地界種種自相，如實了知所有水、火、風、空、識界種種自相，如是名為於界善巧。",
        "translation": "\"Also, bodhisattvas truly know the various aspects of the element of earth and truly know the various aspects of the elements of water, fire, wind, air, and consciousness, and this is called skillfulness in regard to the elements.",
        "source": "T07n0220_585:1027c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界種種自相皆不可得，如實了知所有水、火、風、空、識界種種自相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that the various kinds of self-marks of all the earth realms are unknowable, and they truly know that the various kinds of self-marks of all the water, fire, wind, air, and consciousness realms are unknowable, which is called skillfulness in the realms.",
        "source": "T07n0220_585:1027c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界種種共相，如實了知所有水、火、風、空、識界種種共相，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of all the earth realms and truly know the various common characteristics of all the water, fire, wind, air, and consciousness realms, and this is called skillfulness in the realms.",
        "source": "T07n0220_585:1027c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界種種共相皆不可得，如實了知所有水、火、風、空、識界種種共相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all the various common characteristics of the earth realm are unknowable, and they truly know that all the various common characteristics of the water, fire, wind, air, and consciousness realms are unknowable, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1027c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若常若無常皆不可得，如實了知所有水、火、風、空、識界若常若無常皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whatever is permanent and impermanent in the earth realm is unobtainable, and they truly know that whatever is permanent and impermanent in the water, fire, wind, air, and consciousness realms is unobtainable, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1027c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若樂若苦皆不可得，如實了知所有水、火、風、空、識界若樂若苦皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether it's pleasant or painful in the earth realm is unobtainable, and they truly know that whether it's pleasant or painful in the water, fire, wind, air, and consciousness realms is unobtainable, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1027c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若我若無我皆不可得，如實了知所有水、火、風、空、識界若我若無我皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that neither self nor selflessness is obtainable in all the earth realm, and they truly know that neither self nor selflessness is obtainable in all the water, fire, wind, air, and consciousness realms, which is called skillfulness in the realm.",
        "source": "T07n0220_585:1027c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若淨若不淨皆不可得，如實了知所有水、火、風、空、識界若淨若不淨皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of earth is pure or impure, it's unobtainable, and they truly know that whether the element of water, fire, air, space, or consciousness is pure or impure, it's unobtainable, which is called skillfulness in regard to the element.",
        "source": "T07n0220_585:1027c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若空若不空皆不可得，如實了知所有水、火、風、空、識界若空若不空皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all elemental realms, whether empty or nonempty, are unobtainable, and they truly know that all water, fire, air, space, and the consciousness realm, whether empty or nonempty, are unobtainable, and this is called skillfulness in the elemental realm.",
        "source": "T07n0220_585:1027c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若有相若無相皆不可得，如實了知所有水、火、風、空、識界若有相若無相皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all elemental realms, whether comparable or not, are unknowable, and they truly know that all water, fire, wind, air, and consciousness realms, whether comparable or not, are unknowable, which is called skillfulness in the elemental realm.",
        "source": "T07n0220_585:1028a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若有願若無願皆不可得，如實了知所有水、火、風、空、識界若有願若無願皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all elemental realms are unknowable whether they are wished for or not, and they truly know that all elemental realms of water, fire, air, space, and consciousness are unknowable whether they are wished for or not, which is called skillfulness in the elemental realm.",
        "source": "T07n0220_585:1028a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若寂靜若不寂靜皆不可得，如實了知所有水、火、風、空、識界若寂靜若不寂靜皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that whether the element of earth is quiescent or not quiescent is unobtainable, and they truly know that whether the element of water, fire, air, space, or consciousness is quiescent or not quiescent is unobtainable, and this is called skillfulness in regard to the element.",
        "source": "T07n0220_585:1028a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有地界若遠離若不遠離皆不可得，如實了知所有水、火、風、空、識界若遠離若不遠離皆不可得，如是名為於界善巧。",
        "translation": "Also, bodhisattvas truly know that all elemental realms that are isolated or not isolated are unobtainable, and they truly know that all elemental realms of water, fire, air, space, and consciousness that are isolated or not isolated are unobtainable, and this is called skillfulness in the elemental realms.",
        "source": "T07n0220_585:1028a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為於處善巧？",
        "translation": "\"What's called skillfulness in the sense of location?",
        "source": "T07n0220_585:1028a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如實了知所有眼處種種自相，如實了知所有耳、鼻、舌、身、意處種種自相，如是名為於處善巧。",
        "translation": "It means that bodhisattvas truly know the various aspects of the sense-field of the eye and truly know the various aspects of the sense-field of the ear, nose, tongue, body, and mind, and this is called skillfulness in the sense-field.",
        "source": "T07n0220_585:1028a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處種種自相皆不可得，如實了知所有耳、鼻、舌、身、意處種種自相皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that the various aspects of the sense-field of the eye are unobtainable, and they truly know that the various aspects of the sense-fields of the ear, nose, tongue, body, and mind are unobtainable, and this is called skillfulness in the sense-field.",
        "source": "T07n0220_585:1028a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處種種共相，如實了知所有耳、鼻、舌、身、意處種種共相，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of the sense-field of the eye and truly know the various common characteristics of the sense-field of the ear, nose, tongue, body, and mind, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處種種共相皆不可得，如實了知所有耳、鼻、舌、身、意處種種共相皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that the various common characteristics of all the sense-fields of the eye are unobtainable, and they truly know that the various common characteristics of all the sense-fields of the ear, nose, tongue, body, and mind are unobtainable, and this is called skillfulness in the sense-fields.",
        "source": "T07n0220_585:1028a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若常若無常皆不可得，如實了知所有耳、鼻、舌、身、意處若常若無常皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that whatever is permanent and impermanent in the sense of the eye is unobtainable, and they truly know that whatever is permanent and impermanent in the sense of the ear, nose, tongue, body, and mind is unobtainable, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若樂若苦皆不可得，如實了知所有耳、鼻、舌、身、意處若樂若苦皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that whether anything is pleasant or painful in the sense of the eye is unobtainable, and they truly know that whether anything is pleasant or painful in the sense of the ear, nose, tongue, body, or mind is unobtainable, and this is called skillfulness in the sense of the locus.",
        "source": "T07n0220_585:1028a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若我若無我皆不可得，如實了知所有耳、鼻、舌、身、意處若我若無我皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that whether the sense-field of the eye is self or selfless is unobtainable, and they truly know that whether the sense-field of the ear, nose, tongue, body, or mind is self or selfless is unobtainable, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若淨若不淨皆不可得，如實了知所有耳、鼻、舌、身、意處若淨若不淨皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that the locus of the eye, whether pure or impure, is unobtainable, and they truly know that the locus of the ear, nose, tongue, body, and mind, whether pure or impure, is unobtainable, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若空若不空皆不可得，如實了知所有耳、鼻、舌、身、意處若空若不空皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all the sense-fields of the eye, whether empty or nonempty, are unobtainable, and they truly know that all the sense-fields of the ear, nose, tongue, body, and mind, whether empty or nonempty, are unobtainable, and this is called skillfulness in dealing with sense-fields.",
        "source": "T07n0220_585:1028b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若有相若無相皆不可得，如實了知所有耳、鼻、舌、身、意處若有相若無相皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all the sense-fields of the eye are unobtainable whether they are similar or not, and they truly know that all the sense-fields of the ear, nose, tongue, body, and mind are unobtainable whether they are similar or not, and this is called skillfulness in the sense-fields.",
        "source": "T07n0220_585:1028b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若有願若無願皆不可得，如實了知所有耳、鼻、舌、身、意處若有願若無願皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all the sense-fields of the eye are unobtainable whether they have a wish or no wish, and they truly know that all the sense-fields of the ear, nose, tongue, body, and mind are unobtainable whether they have a wish or no wish, and this is called skillfulness in dealing with situations.",
        "source": "T07n0220_585:1028b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若寂靜若不寂靜皆不可得，如實了知所有耳、鼻、舌、身、意處若寂靜若不寂靜皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that it's impossible for all the sense-fields of the eye to be quiescent or nonquiescent, and they truly know that it's impossible for all the sense-fields of the ear, nose, tongue, body, and mind to be quiescent or nonquiescent, which is called skillfulness in regard to sense-fields.",
        "source": "T07n0220_585:1028b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有眼處若遠離若不遠離皆不可得，如實了知所有耳、鼻、舌、身、意處若遠離若不遠離皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all the sense-fields of the eye that are isolated and not isolated are unobtainable, and they truly know that all the sense-fields of the ear, nose, tongue, body, and mind that are isolated and not isolated are unobtainable, and this is called skillfulness in regard to sense-fields.",
        "source": "T07n0220_585:1028b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸菩薩如實了知所有色處種種自相，如實了知所有聲、香、味、觸、法處種種自相，如是名為於處善巧。",
        "translation": "\"Also, bodhisattvas truly know the various aspects of all the sense-fields and truly know the various aspects of all the sense-fields of sound, odor, taste, touch, and dharma, and this is called skillfulness in the sense-fields.",
        "source": "T07n0220_585:1028b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處種種自相皆不可得，如實了知所有聲、香、味、觸、法處種種自相皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that the various aspects of all the places of form are unobtainable, and they truly know that the various aspects of all the places of sound, odor, taste, touch, and dharma are unobtainable, and this is called skillfulness in the sense of location.",
        "source": "T07n0220_585:1028b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處種種共相，如實了知所有聲、香、味、觸、法處種種共相，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of all the sense-fields and truly know the various common characteristics of all the sense-fields of sound, odor, taste, touch, and dharma, which is called skillfulness in the sense-field.",
        "source": "T07n0220_585:1028b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處種種共相皆不可得，如實了知所有聲、香、味、觸、法處種種共相皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that the characteristics common to all the varieties of the form realm are unknowable, and they truly know that the characteristics common to all the varieties of the sound, smell, taste, touch, and dharma realms are unknowable, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若常若無常皆不可得，如實了知所有聲、香、味、觸、法處若常若無常皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all sense-fields are impermanent whether permanent or impermanent, and they truly know that all sense-fields of sound, odor, taste, touch, and dharma are impermanent whether permanent or impermanent, which is called skillfulness in locating.",
        "source": "T07n0220_585:1028c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若樂若苦皆不可得，如實了知所有聲、香、味、觸、法處若樂若苦皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all sense-fields are unobtainable whether they are pleasant or painful, and they truly know that all sense-fields of sound, smell, taste, touch, and dharma are unobtainable whether they are pleasant or painful, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若我若無我皆不可得，如實了知所有聲、香、味、觸、法處若我若無我皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all sense-fields are unobtainable whether they are self or selfless, and they truly know that all sense-fields of sound, smell, taste, touch, and dharmas are unobtainable whether they are self or selfless, which is called skillfulness in locating.",
        "source": "T07n0220_585:1028c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若淨若不淨皆不可得，如實了知所有聲、香、味、觸、法處若淨若不淨皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all places of form, whether pure or impure, are unobtainable, and they truly know that all places of sound, odor, taste, touch, and dharma, whether pure or impure, are unobtainable, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若空若不空皆不可得，如實了知所有聲、香、味、觸、法處若空若不空皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all the abodes of form, whether empty or nonempty, are unobtainable, and they truly know that all the abodes of sound, smell, taste, touch, and dharma, whether empty or nonempty, are unobtainable, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若有相若無相皆不可得，如實了知所有聲、香、味、觸、法處若有相若無相皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all sense-fields are unobtainable whether they are similar or not, and they truly know that all sense-fields of sound, smell, taste, touch, and dharma are unobtainable whether they are similar or not, and this is called skillfulness in locating.",
        "source": "T07n0220_585:1028c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若有願若無願皆不可得，如實了知所有聲、香、味、觸、法處若有願若無願皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all places of form are unobtainable whether they have a wish or no wish, and they truly know that all places of sound, odor, taste, touch, and dharma are unobtainable whether they have a wish or no wish, which is called skillfulness in locating.",
        "source": "T07n0220_585:1028c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若寂靜若不寂靜皆不可得，如實了知所有聲、香、味、觸、法處若寂靜若不寂靜皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all places of form that are quiescent and those that are not quiescent are unobtainable, and they truly know that all places of sound, smell, taste, touch, and dharma that are quiescent and those that are not quiescent are unobtainable, and this is called skillfulness in locating such things.",
        "source": "T07n0220_585:1028c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有色處若遠離若不遠離皆不可得，如實了知所有聲、香、味、觸、法處若遠離若不遠離皆不可得，如是名為於處善巧。",
        "translation": "Also, bodhisattvas truly know that all places of form that are isolated or not isolated are unobtainable, and they truly know that all places of sound, odor, taste, touch, and dharma that are isolated or not isolated are unobtainable, and this is called skillfulness in regard to the place.",
        "source": "T07n0220_585:1028c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為於諦善巧？",
        "translation": "\"What is called skillfulness in regard to the truths?",
        "source": "T07n0220_585:1029a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如實了知所有苦聖諦種種自相，如實了知所有集、滅、道聖諦種種自相，如是名為於諦善巧。",
        "translation": "It means that bodhisattvas truly know the various aspects of the noble truth of suffering and truly know the various aspects of the noble truths of accumulation, cessation, and the path, and this is called skillfulness in truth.",
        "source": "T07n0220_585:1029a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦種種自相皆不可得，如實了知所有集、滅、道聖諦種種自相皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas who truly know that the various aspects of the noble truth of suffering are all unknowable and who truly know that the various aspects of the noble truths of accumulation, cessation, and the path are all unknowable are thus skillful in their truths.",
        "source": "T07n0220_585:1029a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦種種共相，如實了知所有集、滅、道聖諦種種共相，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know the various common characteristics of all the noble truths of suffering and truly know the various common characteristics of all the noble truths of arising, ceasing, and the path, and this is called skillfulness in regard to the truths.",
        "source": "T07n0220_585:1029a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦種種共相皆不可得，如實了知所有集、滅、道聖諦種種共相皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that the various common characteristics of all noble truths of suffering are unknowable, and they truly know that the various common characteristics of all noble truths of arising, ceasing, and the path are unknowable, and this is called skillfulness in truth.",
        "source": "T07n0220_585:1029a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若常若無常皆不可得，如實了知所有集、滅、道聖諦若常若無常皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that whatever is permanent and impermanent in the noble truth of suffering is unobtainable, and they truly know that whatever is permanent and impermanent in the noble truths of arising, ceasing, and the path is unobtainable, and this is called skillfulness in regard to the truths.",
        "source": "T07n0220_585:1029a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若樂若苦皆不可得，如實了知所有集、滅、道聖諦若樂若苦皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that all noble truths of suffering, whether pleasant or painful, are unknowable, and they truly know that all noble truths of arising, ceasing, and the path, whether pleasant or painful, are unknowable, and this is called skillfulness in regard to the truths.",
        "source": "T07n0220_585:1029a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若我若無我皆不可得，如實了知所有集、滅、道聖諦若我若無我皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that all noble truths of suffering whether self or no-self are unobtainable, and they truly know that all noble truths of arising, ceasing, and the path whether self or no-self are unobtainable, and this is called skillfulness in truth.",
        "source": "T07n0220_585:1029a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若淨若不淨皆不可得，如實了知所有集、滅、道聖諦若淨若不淨皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that all noble truths of suffering, whether pure or impure, are unknowable, and they truly know that all noble truths of arising, ceasing, and the path, whether pure or impure, are unknowable, and this is called skillfulness in truth.",
        "source": "T07n0220_585:1029a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若空若不空皆不可得，如實了知所有集、滅、道聖諦若空若不空皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that all noble truths of suffering, whether empty or nonempty, are unobtainable, and they truly know that all noble truths of arising, ceasing, and the path, whether empty or nonempty, are unobtainable, and this is called skillfulness in truth.",
        "source": "T07n0220_585:1029a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若有相若無相皆不可得，如實了知所有集、滅、道聖諦若有相若無相皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that all noble truths of suffering, whether existent or not, are unknowable, and they truly know that all noble truths of arising, ceasing, and the path, whether existent or not, are unknowable, and this is called skillfulness in regard to the truths.",
        "source": "T07n0220_585:1029a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若有願若無願皆不可得，如實了知所有集、滅、道聖諦若有願若無願皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that all noble truths of suffering are unknowable whether they are desired or not, and they truly know that all noble truths of arising, ceasing, and the path are unknowable whether they are desired or not, and this is called skillfulness in regard to the truths.",
        "source": "T07n0220_585:1029b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若寂靜若不寂靜皆不可得，如實了知所有集、滅、道聖諦若寂靜若不寂靜皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that whether the noble truth of suffering is quiescent or not quiescent is unobtainable, and they truly know that whether the noble truths of arising, ceasing, and the path are quiescent or not quiescent is unobtainable, and this is called skillfulness in regard to the truths.",
        "source": "T07n0220_585:1029b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸菩薩如實了知所有苦聖諦若遠離若不遠離皆不可得，如實了知所有集、滅、道聖諦若遠離若不遠離皆不可得，如是名為於諦善巧。",
        "translation": "Also, bodhisattvas truly know that all noble truths of suffering that are isolated and not isolated are unobtainable, and they truly know that all noble truths of arising, ceasing, and the path that are isolated and not isolated are unobtainable, and this is called skillfulness in regard to the truths.",
        "source": "T07n0220_585:1029b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百八十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 585",
        "source": "T07n0220_585:1029b13_0",
        "is_bad_quality": false
    }
]