[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 409",
        "source": "T07n0220_498:0532a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T07n0220_498:0532a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_498:0532a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分善現品第三之十七",
        "translation": "Third Part of the Third Part of the Chapter of Good Presentations, No. 17",
        "source": "T07n0220_498:0532a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "At that point, Kauśāmbī said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_498:0532a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多如實觀察一切法相，是時菩薩摩訶薩見我乃至見者無生，畢竟淨故；見色乃至識無生，畢竟淨故；見眼處乃至意處無生，畢竟淨故；見色處乃至法處無生，畢竟淨故；見眼界乃至意界無生，畢竟淨故；見色界乃至法界無生，畢竟淨故；見眼識界乃至意識界無生，畢竟淨故；見眼觸乃至意觸無生，畢竟淨故；見眼觸為緣所生諸受乃至意觸為緣所生諸受無生，畢竟淨故；見地界乃至識界無生，畢竟淨故；見因緣乃至增上緣無生，畢竟淨故；見無明乃至老死無生，畢竟淨故；見布施波羅蜜多乃至般若波羅蜜多無生，畢竟淨故；見內空乃至無性自性空無生，畢竟淨故；見真如乃至不思議界無生，畢竟淨故；見斷界乃至無為界無生，畢竟淨故；見苦、集、滅、道聖諦無生，畢竟淨故；見四念住乃至八聖道支無生，畢竟淨故；見四靜慮、四無量、四無色定無生，畢竟淨故；見八解脫、九次第定無生，畢竟淨故；見空、無相、無願解脫門無生，畢竟淨故；見淨觀地乃至如來地無生，畢竟淨故；見極喜地乃至法雲地無生，畢竟淨故；見五眼、六神通無生，畢竟淨故；見如來十力乃至十八佛不共法無生，畢竟淨故；見無忘失法、恒住捨性無生，畢竟淨故；見一切陀羅尼門、三摩地門無生，畢竟淨故；見一切智、道相智、一切相智無生，畢竟淨故；見異生及異生法無生，畢竟淨故；見預流及預流法無生，畢竟淨故；見一來及一來法無生，畢竟淨故；見不還及不還法無生，畢竟淨故；見阿羅漢及阿羅漢法無生，畢竟淨故；見獨覺及獨覺法無生，畢竟淨故；見菩薩摩訶薩及菩薩摩訶薩法無生，畢竟淨故；見諸如來、應、正等覺及諸如來、應、正等覺法無生，畢竟淨故。」",
        "translation": "若時菩薩摩訶薩行深般若波羅蜜多如實觀察一切法相，是時菩薩摩訶薩見我乃至見者無生，畢竟淨故；見色乃至識無生，畢竟淨故；見眼處乃至意處無生，畢竟淨故；見色處乃至法處無生，畢竟淨故；見眼界乃至意界無生，畢竟淨故；見色界乃至法界無生，畢竟淨故；見眼識界乃至意識界無生，畢竟淨故；見眼觸乃至意觸無生，畢竟淨故；見眼觸為緣所生諸受乃至意觸為緣所生諸受無生，畢竟淨故；見地界乃至識界無生，畢竟淨故；見因緣乃至增上緣無生，畢竟淨故；見無明乃至老死無生，畢竟淨故；見布施波羅蜜多乃至般若波羅蜜多無生，畢竟淨故；見內空乃至無性自性空無生，畢竟淨故；見真如乃至不思議界無生，畢竟淨故；見斷界乃至無為界無生，畢竟淨故；見苦、集、滅、道聖諦無生，畢竟淨故；見四念住乃至八聖道支無生，畢竟淨故；見四靜慮、四無量、四無色定無生，畢竟淨故；見八解脫、九次第定無生，畢竟淨故；見空、無相、無願解脫門無生，畢竟淨故；見淨觀地乃至如來地無生，畢竟淨故；見極喜地乃至法雲地無生，畢竟淨故；見五眼、六神通無生，畢竟淨故；見如來十力乃至十八佛不共法無生，畢竟淨故；見無忘失法、恒住捨性無生，畢竟淨故；見一切陀羅尼門、三摩地門無生，畢竟淨故；見一切智、道相智、一切相智無生，畢竟淨故；見異生及異生法無生，畢竟淨故；見預流及預流法無生，畢竟淨故；見一來及一來法無生，畢竟淨故；見不還及不還法無生，畢竟淨故；見阿羅漢及阿羅漢法無生，畢竟淨故；見獨覺及獨覺法無生，畢竟淨故；見菩薩摩訶薩及菩薩摩訶薩法無生，畢竟淨故；見諸如來、應、正等覺及諸如來、應、正等覺法無生，畢竟淨故。」",
        "source": "T07n0220_498:0532a23_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "時，舍利子謂善現言：「如我領解仁所說義，我、有情等畢竟不生，色乃至識畢竟不生，乃至如來、應、正等覺及如來法畢竟不生。",
        "translation": "Śāriputra then said to the good manifestation, \"As I understand the meaning of what you've explained, I understand that I, sentient beings, and so forth are ultimately unarisen, that form and even consciousness are ultimately unarisen, and that tathāgatas, arhats, and correct enlightenment and tathāgata dharmas are ultimately unarisen.",
        "source": "T07n0220_498:0532b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是者，諸異生類六趣受生應無差別，不應預流得預流果，不應一來得一來果，不應不還得不還果，不應阿羅漢得阿羅漢果，不應獨覺得獨覺菩提，不應菩薩摩訶薩為得一切相智，精勤修學漸次證得五種菩提。",
        "translation": "If that's the case, there should be no distinction among the six destinies of birth for different kinds of beings, and they shouldn't attain the fruit of pre-flow, the fruit of once-returning should not be attained, the fruit of non-returning should not be attained without returning, the fruit of arhatship should not be attained by arhats, the enlightenment of pratyekabuddha should not be attained by pratyekabuddhas, and the five kinds of enlightenment should not be gradually realized in sequence by the diligent cultivation of bodhisattvas and mahāsattvas in order to attain the wisdom of all characteristics.",
        "source": "T07n0220_498:0532c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good present!",
        "source": "T07n0220_498:0532c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切法畢竟不生，云何預流為預流果，勤修永斷三結真道？",
        "translation": "If all dharmas are ultimately unarisen, then how can the true path of permanently severing the three bonds be diligently cultivated as the fruit of preflow?",
        "source": "T07n0220_498:0532c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何一來為一來果，勤修永斷貪、恚、癡道？",
        "translation": "\"How do you diligently cultivate the path of permanently eliminating craving, ill-will, and delusion as the result of one coming?",
        "source": "T07n0220_498:0532c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不還為不還果，勤修永斷順下結道，建立五種分位差別？",
        "translation": "Why doesn't he return to the stage of the nonreturner, diligently cultivate the permanent elimination of the lower bonds, and establish five kinds of distinctions in status?",
        "source": "T07n0220_498:0532c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何阿羅漢為阿羅漢果，勤修永斷順上結道？",
        "translation": "\"How does an arhat attain the fruit of the arhat by diligently cultivating the path that permanently ends the higher bonds?",
        "source": "T07n0220_498:0532c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何獨覺為獨覺菩提，勤修獨悟緣起法道？",
        "translation": "\"How does the pratyekabuddha diligently cultivate the pratyekabuddha path of solitary awakening and dependent arising for the sake of pratyekabuddha's enlightenment?",
        "source": "T07n0220_498:0532c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩為度無量無數有情，修多百千難行苦行，備受無量難忍大苦？",
        "translation": "How does the bodhisattva Mahāsattva cultivate many hundreds of thousands of difficult and painful practices and undergo immeasurably difficult and great suffering in order to save measureless and countless sentient beings?",
        "source": "T07n0220_498:0532c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來、應、正等覺證得無上正等菩提轉妙法輪度有情類？」",
        "translation": "How have the Tathāgatas, Arhats, and Fully Awakened Ones realized unsurpassed perfect enlightenment and turned the wonderful Dharma wheel to save all sentient beings?\"",
        "source": "T07n0220_498:0532c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現報言：「舍利子！",
        "translation": "The good present replied, \"Śāriputra!",
        "source": "T07n0220_498:0532c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非我於彼無生法中，許有異生乘煩惱業往來六趣受生差別，非我於彼無生法中，許有能入諦現觀者，非我於彼無生法中，許有預流得預流果乃至有獨覺得獨覺菩提，非我於彼無生法中，許有菩薩摩訶薩為得一切相智，精勤修學漸次證得五種菩提，非我於彼無生法中，許有預流為預流果，勤修永斷三結真道，乃至有獨覺為獨覺菩提，勤修獨悟緣起法道，非我於彼無生法中，許有菩薩摩訶薩為度無量無數有情，修多百千難行苦行，備受無量難忍大苦。",
        "translation": "非我於彼無生法中，許有異生乘煩惱業往來六趣受生差別，非我於彼無生法中，許有能入諦現觀者，非我於彼無生法中，許有預流得預流果乃至有獨覺得獨覺菩提，非我於彼無生法中，許有菩薩摩訶薩為得一切相智，精勤修學漸次證得五種菩提，非我於彼無生法中，許有預流為預流果，勤修永斷三結真道，乃至有獨覺為獨覺菩提，勤修獨悟緣起法道，非我於彼無生法中，許有菩薩摩訶薩為度無量無數有情，修多百千難行苦行，備受無量難忍大苦。",
        "source": "T07n0220_498:0532c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「然諸菩薩摩訶薩雖為有情修無量種難行苦行，而於其中無苦行想。",
        "translation": "\"Still, although these bodhisattvas, mahāsattvas, and sentient beings cultivate measureless difficult and painful actions, they don't have the perception of those painful actions.",
        "source": "T07n0220_498:0532c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0532c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於苦行住苦行想，終不能為無量無數無邊有情作大饒益。",
        "translation": "If someone abides in the conception of ascetic practices, they'll never be able to do great good for measureless, innumerable, and limitless sentient beings.",
        "source": "T07n0220_498:0532c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩眾以無所得而為方便，於諸有情住如父母、兄弟、妻子及己身想，為度彼故發起無上正等覺心，乃能為彼無量無數無邊有情作大饒益。",
        "translation": "When all bodhisattvas, mahāsattvas, and others use the method of obtaining nothing to abide in the contemplation of sentient beings as parents, brothers, wives, and themselves, and they give rise to the mind of unsurpassed perfect enlightenment in order to save them, then they'll be able to do great good to measureless, innumerable, and limitless sentient beings.",
        "source": "T07n0220_498:0533a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0533a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩應作是念：『如我自性，於一切法以一切種、一切處時求不可得，內外諸法亦復如是，都無所有皆不可得。』",
        "translation": "All bodhisattvas and mahāsattvas should think, 'Just as my own nature is unobtainable for all things, in all kinds of ways, and when sought in all places, so are all internal and external dharmas, which are all lacking and unobtainable.'",
        "source": "T07n0220_498:0533a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若住此想便不見有難行苦行，由此能為無量無數無邊有情修多百千難行苦行作大饒益。",
        "translation": "If someone abides in this contemplation, they won't see difficult and painful actions, and as a result, they'll be able to cultivate hundreds of thousands of difficult and painful actions for the great benefit of measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_498:0533a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切法、一切有情以一切種、一切處時求不可得故，於其中無所執著。",
        "translation": "Because the bodhisattva Mahāsattva seeks to attain nothing for all things, all beings, and all places at all times, he doesn't attach to anything in them.",
        "source": "T07n0220_498:0533a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0533a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非我於彼無生法中，許有如來、應、正等覺證得無上正等菩提，轉妙法輪度有情類。",
        "translation": "\"It's not that I allow tathāgatas, arhats, and correct enlightenment to realize unsurpassed correct enlightenment and turn the wonderful Dharma wheel to save sentient beings of that type in the midst of the unborn Dharma.",
        "source": "T07n0220_498:0533a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_498:0533a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法、一切有情都無所有不可得故，無證、無度及證、度者。」",
        "translation": "It's because all things and all beings are without existence and unobtainable, and there's no realization, no salvation, and no one who realizes or salvages them.\"",
        "source": "T07n0220_498:0533a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「於意云何？",
        "translation": "It was then that Śāriputra asked Kauśāmbī, the good manifestation, \"What do you think?",
        "source": "T07n0220_498:0533a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為許生法證生法，為許無生法證無生法耶？」",
        "translation": "Do you permit the arising dharmas to realize the arising dharmas, or do you permit the unarisen dharmas to realize the unarisen dharmas?\"",
        "source": "T07n0220_498:0533a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「我不許生法證生法，亦不許無生法證無生法。」",
        "translation": "The Śubha-jñāniputra replied, \"I don't allow things that arise to realize things that arise, and I don't allow things that are unarisen to realize things that are unarisen.\"",
        "source": "T07n0220_498:0533a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子復問具壽善現言：「於意云何？",
        "translation": "Śāriputra then again asked Kauśāmbī, \"What do you think?",
        "source": "T07n0220_498:0533a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為許生法證無生法，為許無生法證生法耶？」",
        "translation": "Do you allow the arising dharmas to realize the unarisen dharmas, or do you allow the unarisen dharmas to realize the arising dharmas?\"",
        "source": "T07n0220_498:0533a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「我亦不許生法證無生法，亦復不許無生法證生法。」",
        "translation": "The good present replied, \"I also don't allow the arising dharmas to realize the unarisen dharmas, and I also don't allow the unarisen dharmas to realize the arising dharmas.\"",
        "source": "T07n0220_498:0533a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子言：「若如是者，豈都無得、無現觀耶？」",
        "translation": "Śāriputra said, \"If that's the case, then isn't it true that there's no attainment and no clear observation?\"",
        "source": "T07n0220_498:0533a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「雖有得、有現觀，然不由此二法而證。",
        "translation": "The good present replied, \"Although there is attainment and direct insight, they aren't realized by these two things.",
        "source": "T07n0220_498:0533a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但隨世間言說施設有得、現觀，非勝義中有得、現觀。",
        "translation": "It's only according to worldly speech that there's attainment and clear observation, not in the ultimate sense that there's attainment and clear observation.",
        "source": "T07n0220_498:0533a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但隨世間言說施設有預流、預流果，廣說乃至有諸如來、應、正等覺，有佛無上正等菩提，非勝義中有如是事。」",
        "translation": "But to follow worldly speech that posits there's stream-winner and stream-returner, and to explain in detail that there are tathāgatas, arhats, and right ascendants, and that there are buddhas who are unsurpassed in correct enlightenment, is not such a thing in the ultimate truth.\"",
        "source": "T07n0220_498:0533a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子言：「若隨世間言說施設有得、現觀及預流等，非勝義中有此事者，六趣差別亦隨世間言說施設，非勝義耶？」",
        "translation": "Śāriputra said, \"If this is not something that exists in the ultimate meaning according to worldly speech that posits there's attainment, clear observation, and pre-flow, then are the six kinds of distinctions in destinies also posited according to worldly speech that aren't the ultimate meaning?\"",
        "source": "T07n0220_498:0533a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "The good manifestation replied, \"So it is!",
        "source": "T07n0220_498:0533b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_498:0533b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "What is the reason?",
        "source": "T07n0220_498:0533b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非勝義中有諸煩惱業果異熟若生、若滅染淨法故。」",
        "translation": "It's not because there are defiled and pure dharmas in the ultimate sense that are the results of afflicted actions that are ripened, whether produced or ceased.\"",
        "source": "T07n0220_498:0533b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子復問具壽善現言：「於意云何？",
        "translation": "At that point, Śāriputra again asked Kauśāmbī, \"What do you think?",
        "source": "T07n0220_498:0533b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為許未生法生，為許已生法生耶？」",
        "translation": "Is it because you permit dharmas that have yet to arise to arise, or is it because you permit dharmas that have already arisen to arise?\"",
        "source": "T07n0220_498:0533b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「我不許未生法生，亦不許已生法生。」",
        "translation": "The good present replied, \"I won't allow things that have yet to arise to arise, and I won't allow things that have already arisen to arise.\"",
        "source": "T07n0220_498:0533b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子言：「何等是未生法而不許彼生？」",
        "translation": "Śāriputra said, \"What's the unarisen thing that you won't allow to arise?\"",
        "source": "T07n0220_498:0533b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「色乃至識是未生法，我不許彼生。",
        "translation": "The good present replied, \"Form and even consciousness are things that haven't yet arisen, and I won't allow them to arise.",
        "source": "T07n0220_498:0533b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自性空故。",
        "translation": "\"The self-nature is empty, so I won't allow it to arise.",
        "source": "T07n0220_498:0533b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至諸佛無上正等菩提是未生法，我不許彼生。",
        "translation": "Thus, even the buddhas' unsurpassed correct enlightenment is something that has yet to arise, and I won't allow it to arise.",
        "source": "T07n0220_498:0533b08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自性空故。」",
        "translation": "The self-nature is empty.\"",
        "source": "T07n0220_498:0533b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子言：「何等是已生法而不許彼生？」",
        "translation": "Śāriputra said, \"What's a dharma that has already arisen and doesn't allow its arising?\"",
        "source": "T07n0220_498:0533b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「色乃至識是已生法，我不許彼生。",
        "translation": "The good present replied, \"Form and even consciousness are things that have already arisen, and I won't allow them to arise.",
        "source": "T07n0220_498:0533b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自性空故。",
        "translation": "\"The self-nature is empty, so I won't allow it to arise.",
        "source": "T07n0220_498:0533b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至諸佛無上正等菩提是已生法，我不許彼生。",
        "translation": "Thus, even if the buddhas' unsurpassed correct enlightenment is something that has already arisen, I won't allow it to arise.",
        "source": "T07n0220_498:0533b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自性空故。」",
        "translation": "The self-nature is empty.\"",
        "source": "T07n0220_498:0533b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子復問具壽善現言：「於意云何？",
        "translation": "At that point, Śāriputra again asked Kauśāmbī, \"What do you think?",
        "source": "T07n0220_498:0533b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為許生生，為許不生生耶？」",
        "translation": "Is it permissible to give rise to birth, or is it permissible not to give rise to birth?\"",
        "source": "T07n0220_498:0533b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「我不許生生，亦不許不生生。",
        "translation": "The good present replied, \"I won't allow birth to take place, and I won't allow non-birth to take place.",
        "source": "T07n0220_498:0533b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生與不生，如是二法非合、非散、無色、無見、無對、一相，所謂無相。",
        "translation": "Whether it arises or doesn't arise, such two things are not combined, not dispersed, formless, without vision, without opposition, and with one characteristic, which is called formless.",
        "source": "T07n0220_498:0533b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，我不許生生，亦不許不生生。」",
        "translation": "Because of this meaning, I won't allow birth to occur, and I won't allow non-arising to occur.\"",
        "source": "T07n0220_498:0533b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「仁者！",
        "translation": "It was then that Śāriputra asked Kauśāmbī, a well-appointed manifestation, \"Sir!",
        "source": "T07n0220_498:0533b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於所說無生法樂辯說無生相耶？」",
        "translation": "Do you explain the marks of nonproduction in terms of the happiness of the nonproduced dharmas that are explained?\"",
        "source": "T07n0220_498:0533b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「我於所說無生法亦不樂辯說無生相。",
        "translation": "The good present replied, \"I don't enjoy explaining the aspects of nonproduction when I explain the nonproduction of dharmas.",
        "source": "T07n0220_498:0533b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無生法，若無生相，若樂若辯說，如是一切皆非合、非散、無色、無見、無對、一相，所謂無相，不可辯說。」",
        "translation": "If there are things that are unproduced, if there are aspects that are unproduced, and if they are explained with pleasure or eloquence, they are all not combined, not dispersed, formless, invisible, non-contradictory, or single in character, which is called formless and cannot be explained.\"",
        "source": "T07n0220_498:0533b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子問善現言：「於無生法起無生言，此無生言亦無生不？」",
        "translation": "Śāriputra then asked the good manifestation, \"If this unproduced thing gives rise to unproduced words, are these unproduced words also unproduced?\"",
        "source": "T07n0220_498:0533b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "The good manifestation replied, \"So it is!",
        "source": "T07n0220_498:0533b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_498:0533b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無生法起無生言，此法及言俱無生義。",
        "translation": "\"When unproduced words arise from unproduced things, both the things and the words have no meaning of production.",
        "source": "T07n0220_498:0533b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色乃至識一切無生。",
        "translation": "\"All forms and even consciousness are unarisen.",
        "source": "T07n0220_498:0533b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty, so.",
        "source": "T07n0220_498:0533b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處乃至意處一切無生。",
        "translation": "Everything from the sense-field of the eye to the sense-field of the mind is unarisen.",
        "source": "T07n0220_498:0533b28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty, so.",
        "source": "T07n0220_498:0533b29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處乃至法處一切無生。",
        "translation": "everything from the form realm to the dharmadhātu as realm is unarisen.",
        "source": "T07n0220_498:0533b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty, therefore.",
        "source": "T07n0220_498:0533c01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界乃至意界一切無生。",
        "translation": "everything from the visual realm to the mental realm is unarisen.",
        "source": "T07n0220_498:0533c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty, therefore.",
        "source": "T07n0220_498:0533c02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界乃至法界一切無生。",
        "translation": "everything from the form realm to the Dharma realm is unarisen.",
        "source": "T07n0220_498:0533c02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty, therefore.",
        "source": "T07n0220_498:0533c03_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識界乃至意識界一切無生。",
        "translation": "everything from the visual consciousness element to the consciousness element is unarisen.",
        "source": "T07n0220_498:0533c03_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature of the sense faculties is empty.",
        "source": "T07n0220_498:0533c04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸乃至意觸一切無生。",
        "translation": "everything from eye contact to mental contact is unarisen.",
        "source": "T07n0220_498:0533c04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"Because their nature is empty, the sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are all unarisen.",
        "source": "T07n0220_498:0533c05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受一切無生。",
        "translation": "All the sensations that arise from visual contact as a condition and all the sensations that arise from mental contact as a condition are unarisen.",
        "source": "T07n0220_498:0533c05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c07_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "Because their nature is empty, the earth realm ...",
        "source": "T07n0220_498:0533c07_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界乃至識界一切無生。",
        "translation": "Everything from the earth realm to the consciousness realm is unarisen.",
        "source": "T07n0220_498:0533c07_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty, so.",
        "source": "T07n0220_498:0533c08_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣乃至增上緣一切無生。",
        "translation": "All causes, conditions, and even contributory conditions are unarisen.",
        "source": "T07n0220_498:0533c08_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c09_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty, so.",
        "source": "T07n0220_498:0533c09_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明乃至老死一切無生。",
        "translation": "nescience ... old age and death are all unarisen.",
        "source": "T07n0220_498:0533c09_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c10_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"The original nature is empty.",
        "source": "T07n0220_498:0533c10_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身、語、意行一切無生。",
        "translation": "Nothing that's bodily, verbal, or mental activity arises.",
        "source": "T07n0220_498:0533c10_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c11_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "\"Because their nature is empty, the generosity pāramitā and even the prajñā pāramitā are all unarisen.",
        "source": "T07n0220_498:0533c11_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多一切無生。",
        "translation": "The perfection of generosity and even the perfection of wisdom are all unarisen.",
        "source": "T07n0220_498:0533c11_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故，本性空故。",
        "translation": "Why is that? It's because their nature is empty.",
        "source": "T07n0220_498:0533c12_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至一切智、道相智、一切相智一切無生。",
        "translation": "Thus, up to omniscience, cognition of the path, and cognition of all characteristics are all unarisen.",
        "source": "T07n0220_498:0533c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本性空故。",
        "translation": "The original nature is empty.",
        "source": "T07n0220_498:0533c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0533c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，於無生法起無生言，此法及言俱無生義。",
        "translation": "Because of this meaning, unproduced words arise from unproduced things, and both these things and words have the meaning of being unproduced.",
        "source": "T07n0220_498:0533c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0533c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若所說法、若能說言、說者、聽者皆無生義。",
        "translation": "If something is said, if words can be spoken, and if the speaker and listener are unproduced, that's the point.",
        "source": "T07n0220_498:0533c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法本性皆空，空中都無能所生義。」",
        "translation": "It's because the nature of all things is empty, and there's no meaning in the air that can or will arise.\"",
        "source": "T07n0220_498:0533c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子讚善現言：「說法人中仁為第一，除佛世尊無能及者。",
        "translation": "Śāriputra then praised the good present, saying, \"Among people who preach, benevolence is the best, unsurpassed except by the Buddha, the Bhagavān.",
        "source": "T07n0220_498:0533c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨所問詰種種法門皆能酬答無所滯礙。」",
        "translation": "They can answer any question about the various teachings without any obstruction.\"",
        "source": "T07n0220_498:0533c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現報言：「諸佛弟子於一切法無依著者，法爾皆能隨所問詰一一酬答自在無畏。",
        "translation": "The skillful manifestation replied, \"All disciples of the Buddha who have no attachment to any dharma are able to answer each and every question as it arises with ease and fearlessness.",
        "source": "T07n0220_498:0533c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法無所依故。」",
        "translation": "It's because all dharmas have no basis.\"",
        "source": "T07n0220_498:0533c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子問善現言：「云何諸法都無所依？」",
        "translation": "Śāriputra then asked the good present, \"How do all dharmas lack a basis?\"",
        "source": "T07n0220_498:0533c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「色乃至識本性空故，不依內不依外不依兩間，如是乃至一切智、道相智、一切相智本性空故，不依內不依外不依兩間。",
        "translation": "The good present replied, \"It's because the original nature of form and even consciousness are empty, they don't rely on internal, external, or two, and so it is because the original nature of omniscience, knowledge of the path, and knowledge of all characteristics is empty, and they don't rely on internal, external, or two.",
        "source": "T07n0220_498:0533c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_498:0533c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如是義，我說諸法都無所依。",
        "translation": "For this reason, I say that all dharmas have no basis.",
        "source": "T07n0220_498:0533c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，舍利子！",
        "translation": "\"So it is, Śāriputra!",
        "source": "T07n0220_498:0533c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行六種波羅蜜多時，應淨色，應淨受、想、行、識，如是乃至應淨一切智，應淨道相智、一切相智，如是亦應淨菩提道。」",
        "translation": "When bodhisattvas, when they practice the six perfections, form should be purified, feeling, perception, volition, and consciousness should be purified, and so on up to omniscience, knowledge of the path and omniscience should be purified, and so on should also purify the path to enlightenment.\"",
        "source": "T07n0220_498:0533c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子問善現言：「云何菩薩摩訶薩修行六種波羅蜜多時淨菩提道？」",
        "translation": "Śāriputra then asked the good present, \"How do bodhisattvas and mahāsattvas purify the path to enlightenment when they cultivate the six perfections?\"",
        "source": "T07n0220_498:0534a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T07n0220_498:0534a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施、淨戒、安忍、精進、靜慮、般若波羅蜜多各有二種，所謂世間及出世間。」",
        "translation": "There are two kinds of generosity, pure precepts, patience, effort, meditation, and the perfection of wisdom, which are called mundane and transmundane.\"",
        "source": "T07n0220_498:0534a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子言：「云何世間布施波羅蜜多？",
        "translation": "Śāriputra said, \"What's the perfection of worldly generosity?",
        "source": "T07n0220_498:0534a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何出世間布施波羅蜜多？」",
        "translation": "What is the perfection of supramundane generosity?\"",
        "source": "T07n0220_498:0534a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T07n0220_498:0534a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩為大施主，能施一切沙門、婆羅門、貧病、孤露、道行、乞者衣服、飲食及餘資具。",
        "translation": "\"Suppose a bodhisattva Mahāsattva is a great donor who gives clothing, food, and other necessities to all ascetics, priests, the poor, the sick, the orphaned, and those on the path, as well as to beggars.",
        "source": "T07n0220_498:0534a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有來乞男與男，乞女與女，乞妻妾與妻妾，乞官位與官位，乞國土與國土，乞王位與王位，乞頭與頭，乞目與目，乞手足與手足，乞支節與支節，乞血肉與血肉，乞皮骨與皮骨，乞僮僕與僮僕，乞生類與生類，如是一切隨其所求，內外之物悉皆施與。",
        "translation": "Again, if there are people who ask for a man and a man, a woman and a woman, a wife and a concubine, an official position and an official position, a land and a land, a throne and a throne, a head and a head, eyes and eyes, hands and feet and hands and feet, knuckles and knuckles, flesh and blood and flesh, skin and bones and skin and bones, servants and servants, living things and living things, and all of the like, they'll give whatever they ask for, both internal and external.",
        "source": "T07n0220_498:0534a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖作是施而有所依，謂作是念：『我施彼受，我為施主，我不慳貪，我隨佛教一切能捨，我行布施波羅蜜多。』",
        "translation": "Even though they make such gifts, they have some support, which is to say that they think, 'I give and they receive, I'm the donor, I don't save and covet, I follow Buddhism and am capable of abandoning everything, and I practice the perfection of generosity.'",
        "source": "T07n0220_498:0534a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行施時，以有所得而為方便，與諸有情平等共有迴向無上正等菩提。",
        "translation": "When they practice generosity, they use the method of obtaining something as a way to share equally with sentient beings and dedicate themselves to unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_498:0534a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『我持此福施諸有情，令得此世後世安樂，乃至證得無餘涅槃。』",
        "translation": "Again, they think, 'I will take this merit and give it to sentient beings, so that they may attain happiness in this world and the next, and realize nirvāṇa without remainder.'",
        "source": "T07n0220_498:0534a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼著三輪而行布施：一者、自想。",
        "translation": "They are attached to three wheels of giving: one, their own conceptions.",
        "source": "T07n0220_498:0534a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、他想。",
        "translation": "2. conceptions of others.",
        "source": "T07n0220_498:0534a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、施想。",
        "translation": "3. the conception of giving.",
        "source": "T07n0220_498:0534a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由著此三輪而行施，故名世間布施波羅蜜多。",
        "translation": "Because they practice generosity while attached to these three wheels, it's called the perfection of worldly generosity.",
        "source": "T07n0220_498:0534a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此施名為世間？",
        "translation": "How is this almsgiving called worldly?",
        "source": "T07n0220_498:0534a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以與世間同修行故，不能動出世間法故，如是名為世間布施波羅蜜多。",
        "translation": "Because they practice together with the world, they can't move supramundane dharmas, and this is called the perfection of worldly generosity.",
        "source": "T07n0220_498:0534a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T07n0220_498:0534a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行布施時三輪清淨：一者、不執我為施者。",
        "translation": "\"If a bodhisattva-mahāsattva's three wheels are purified when he practices generosity, one doesn't attach to self as the donor.",
        "source": "T07n0220_498:0534a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、不執彼為受者。",
        "translation": "2. doesn't attach to them as the recipient ...",
        "source": "T07n0220_498:0534a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、不執施及施果。",
        "translation": "Third, they don't attach to generosity and the result of that generosity.",
        "source": "T07n0220_498:0534a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩行布施時三輪清淨。",
        "translation": "These are the three wheels of purity when a bodhisattva-mahāsattva practices generosity.",
        "source": "T07n0220_498:0534a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T07n0220_498:0534a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以大悲心而為上首，所修施福普施有情，於諸有情都無所得，雖與有情平等共有迴向無上正等菩提，而於其中不見少相。",
        "translation": "\"If a bodhisattva Mahāsattva is the leader with great compassion and cultivates the practice of bestowing merit on sentient beings universally, he obtains nothing from them all even though he shares equally with them the same dedication to unsurpassed perfect enlightenment, yet he sees no little marks in them.",
        "source": "T07n0220_498:0534a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由都無所執而行施，故名出世間布施波羅蜜多。",
        "translation": "Because they all practice generosity without attachment, it's called the perfection of transmundane generosity.",
        "source": "T07n0220_498:0534b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此施名出世間？",
        "translation": "How is this generosity called transmundane?",
        "source": "T07n0220_498:0534b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不與世間同修行故，能永動出世間法故，如是名為出世布施波羅蜜多。」",
        "translation": "Not practicing in common with the world and being able to permanently activate supramundane dharmas are thus called the perfection of supramundane generosity.\"",
        "source": "T07n0220_498:0534b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子言：「云何世間淨戒波羅蜜多乃至般若波羅蜜多？",
        "translation": "Śāriputra said, \"What are the worldly perfection of pure precepts and even the perfection of wisdom?",
        "source": "T07n0220_498:0534b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何出世間淨戒波羅蜜多乃至般若波羅蜜多？」",
        "translation": "What is the perfection of transmundane morality or even the perfection of wisdom?\"",
        "source": "T07n0220_498:0534b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T07n0220_498:0534b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修行淨戒乃至般若時，有所依者著三輪故，名為世間波羅蜜多，以與世間同修行故，不能動出世間法故。",
        "translation": "If, when the bodhisattva-mahāsattva cultivates pure precepts ... even when he practices prajñā, he has some support because he's attached to the three wheels, that's called the supramundane paramitā, which is the result of practicing together with the world and being unable to move supramundane dharmas.",
        "source": "T07n0220_498:0534b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修行淨戒乃至般若時，無所依者三輪淨故，名出世間波羅蜜多，不與世間同修行故，能永動出世間法故。",
        "translation": "If a bodhisattva Mahāsattva cultivates pure precepts ... prajñā, then he has no support for the purity of the three wheels, which is called supramundane perfection, because he doesn't cultivate the same practices as the world and can permanently set in motion supramundane dharmas.",
        "source": "T07n0220_498:0534b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T07n0220_498:0534b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩所修般若波羅蜜多有是世間、有是出世，云何名為世間般若波羅蜜多？",
        "translation": "What do bodhisattvas, mahāsattvas, cultivate as the perfection of wisdom that's both mundane and transmundane, and what is called the perfection of wisdom that's mundane?",
        "source": "T07n0220_498:0534b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為出世般若波羅蜜多？",
        "translation": "\"What is called the perfection of supramundane wisdom?",
        "source": "T07n0220_498:0534b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0534b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修布施時，依有所得而行布施，謂作是念：『我能調伏慳貪之心而行布施。』",
        "translation": "If a bodhisattva-mahāsattva cultivates generosity based on having something to give, he thinks, 'I can temper my stinginess and greediness and then give.'",
        "source": "T07n0220_498:0534b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩依我、有情布施想故，雖捨一切內外所有，而不名為出世般若。",
        "translation": "Because the bodhisattva Mahāsattva relies on the idea of giving to self and sentient beings, even though he discards all internal and external possessions, he doesn't call it supramundane wisdom.",
        "source": "T07n0220_498:0534b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修淨戒時，依有所得而修淨戒，謂作是念：『我能安住杜多功德，我能調伏身、語及心，我能修行十善業道。』",
        "translation": "\"Suppose a bodhisattva Mahāsattva cultivates the pure precepts based on the attainment of something, which is the thought, 'I can abide in the virtue of dhūta, I can control body, speech, and mind, and I can cultivate the ten good karmic paths.'",
        "source": "T07n0220_498:0534b21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩依止我見及有情見、諸善法見，雖能修行種種淨戒，亦持施與一切有情平等共有，迴向無上正等菩提而於菩提謂為實有，依諸功德自讚毀他，亦不名為出世般若。",
        "translation": "Although this bodhisattva relies on the view of self and the views of sentient beings and good qualities, he cultivates various pure precepts, maintains that they're equally shared with all sentient beings, dedicates himself to unsurpassed perfect enlightenment and considers that enlightenment really exists, praises himself and disparages others based on their merits, and doesn't call it transcendent prajñāpāramitā.",
        "source": "T07n0220_498:0534b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修安忍時，依有所得而修安忍，謂作是念：『我能忍受一切有情於我所行種種惡事。』",
        "translation": "\"Suppose a bodhisattva Mahāsattva cultivates patience when he cultivates patience based on having attained it, which is to think, 'I can tolerate the various bad things that all sentient beings do to me.'",
        "source": "T07n0220_498:0534b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩依我、有情安忍見故，雖能忍受他所作惡，亦能持此安忍善根，與諸有情平等共有迴向無上正等菩提，而有所得為方便故，亦不名為出世般若。",
        "translation": "It's because the bodhisattva Mahāsattva depends on the view of the forbearance of self and sentient beings that even though he can tolerate the evil that others do, he can maintain the good root of this forbearance and equally share with sentient beings the dedication to unsurpassed correct perfect enlightenment, and because he has attained it as a method, it's not called transcendent prajñāpāramitā.",
        "source": "T07n0220_498:0534c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修精進時，依有所得而修精進，謂作是念：『我能發起身心精進，勤修福、慧二種資糧。』",
        "translation": "\"Suppose a bodhisattva-mahāsattva cultivates effort based on having attained it, which is to think, 'I can arouse physical and mental effort, and diligently cultivate the two kinds of accumulation of merit and wisdom.'",
        "source": "T07n0220_498:0534c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩雖常發起身心精進，勤修福、慧二種資糧，而得身心福、慧之相，及得我相、諸有情相，亦得所求菩提之相，由有所得為方便故，未得名為出世般若。",
        "translation": "Although this bodhisattva always generates physical and mental effort and diligently cultivates the two kinds of accumulation of merit and wisdom, and attains the marks of merit and wisdom in body and mind, the marks of self and sentient beings, and the marks of the bodhi that he seeks, it's because he has attained them as a method that he hasn't yet been called supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0534c07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修靜慮時，依有所得而修靜慮，謂作是念：『我能修行慈、悲、喜、捨、等持、等至、靜慮、神通入出自在。』",
        "translation": "\"If a bodhisattva Mahāsattva cultivates meditation when he cultivates meditation based on having attained it, he thinks, 'I can cultivate kindness, pity, joy, equanimity, equipoise, equipoise, meditation, and the entry of supernormal powers into self-reliance.'",
        "source": "T07n0220_498:0534c11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於諸靜慮深生味著，雖持所得靜慮善根，與諸有情平等共有迴向無上正等菩提，以有所得為方便故，而未名為出世般若。",
        "translation": "Such a bodhisattva-mahāsattva becomes deeply attached to those meditations, and even though he maintains the acquired wholesome roots of meditation and shares them equally with other sentient beings in their dedication to unsurpassed correct perfect enlightenment, he doesn't call it transcendent prajñāpāramitā because he has acquired them as a method.",
        "source": "T07n0220_498:0534c13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修般若時，依有所得而修般若，謂作是念：『我能觀察一切法空，所謂色空乃至識空，如是乃至諸佛無上正等菩提亦皆是空。』",
        "translation": "\"Suppose a bodhisattva Mahāsattva cultivates prajñā based on having attained it, which is to think, 'I can observe the emptiness of all things, which is called the emptiness of form and even the emptiness of consciousness, and thus even the unsurpassed correct enlightenment of the buddhas is also empty.'",
        "source": "T07n0220_498:0534c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以有所得而為方便，雖觀一切皆畢竟空，亦持善根施有情類迴向無上正等菩提，亦於自他所修善法平等發起隨喜之心，亦能悔除自所作惡，亦能勸請十方世界無量如來、應、正等覺轉妙法輪度有情眾，亦能發願起勝神通為諸有情作大饒益，而有所得為方便故，猶未名為出世般若。",
        "translation": "Although he observes that everything is ultimately empty, the bodhisattva Mahāsattva also maintains the good roots to give to sentient beings and dedicate them to unsurpassed correct enlightenment, equally gives rise to a joyful attitude toward the good qualities cultivated by self and others, repents of the bad deeds he's done, encourages measureless tathāgatas, arhats, and virtually universal beings in the ten directions to turn the wonderful Dharma wheel and save sentient beings, and makes the vow to give rise to excellent supernormal powers that will greatly benefit sentient beings, but because he has attained it as a method, he has yet to be called transcendent prajñā.",
        "source": "T07n0220_498:0534c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為世間般若波羅蜜多。",
        "translation": "Such is called the prajñāpāramitā of the world.",
        "source": "T07n0220_498:0534c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0534c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修布施時用微妙慧，以無所得而為方便，於我、有情及布施等都無所得，為趣無上正等菩提三輪清淨，而修布施波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "If a bodhisattva uses subtle wisdom when cultivating almsgiving, making it convenient because there's nothing to be gained, so that self, sentient beings, and almsgiving are all unobtained, and in order to attain the purity of the three wheels of unsurpassed correct enlightenment, he cultivates the pure bodhi path of the perfection of generosity, then this is called supramundane wisdom.",
        "source": "T07n0220_498:0534c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情及淨戒等都無所得，為趣無上正等菩提三輪清淨，而修淨戒波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "\"If the bodhisattva Mahāsattva uses subtle wisdom to make it skillful to have nothing to gain, so that self, sentient beings, and the pure precepts are all unobtainable, in order to attain the purity of the three wheels of unsurpassed correct enlightenment, and to cultivate the pure path of enlightenment that's based on the perfection of morality, this is called supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0535a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情及安忍等都無所得，為趣無上正等菩提三輪清淨，而修安忍波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "\"If the bodhisattva Mahāsattva uses subtle wisdom to make the method of attaining nothing, attaining nothing for self, sentient beings, and peaceful tolerance, etc., in order to attain the purity of the three wheels of unsurpassed correct enlightenment and cultivate the pure bodhi path of the perfection of patience, this is called supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0535a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情身心精進，福慧資糧都無所得，為趣無上正等菩提三輪清淨，而修精進波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "\"If the bodhisattva Mahāsattva uses subtle wisdom and makes unobtainable this method, making effort in body and mind for self and sentient beings, obtaining the accumulation of merit and wisdom, and cultivating the pure bodhi path of the perfection of effort for the purpose of purifying the three wheels of unsurpassed correct enlightenment, this is called supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0535a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情及諸靜慮、等持、等至都無所得，為趣無上正等菩提三輪清淨，而修靜慮波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "\"If the bodhisattva Mahāsattva uses subtle wisdom and makes unobtainable this method, attaining nothing for self, sentient beings, and the meditations, equipoises, and equipoises, and cultivates the pure bodhi path of the perfection of concentration in order to attain the purity of the three wheels of unsurpassed correct enlightenment, this is called supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0535a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於一切法、一切有情都無所得，為趣無上正等菩提三輪清淨，而修般若波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "\"If the bodhisattva Mahāsattva uses subtle wisdom to make the method of attaining nothing, attains nothing for all things and all sentient beings, and cultivates the pure bodhi path of the perfection of concentration in order to attain the purity of the three wheels of unsurpassed correct enlightenment, this is called supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0535a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩持如是等一切善根，與諸有情平等共有迴向無上正等菩提。",
        "translation": "\"Thus, the bodhisattvas, mahāsattvas, maintain all these good roots and so forth, and they equally share with sentient beings the same dedication to unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_498:0535a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迴向，當知即是無上迴向、無差別迴向、無等等迴向、不思議迴向、無對迴向、無量迴向、微妙迴向。",
        "translation": "Such dedication should be known as unsurpassed dedication, nondiscriminating dedication, unequalled dedication, inconceivable dedication, unopposed dedication, immeasurable dedication, and subtle dedication.",
        "source": "T07n0220_498:0535a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為出世般若波羅蜜多。",
        "translation": "Such is called the perfection of supramundane wisdom.",
        "source": "T07n0220_498:0535a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0535a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是六種波羅蜜多，何因緣故名為世間？",
        "translation": "What are the causes and conditions that give rise to these six perfections being called worldly?",
        "source": "T07n0220_498:0535a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復何因緣名為出世？",
        "translation": "What is the other cause and condition that is called supramundane?",
        "source": "T07n0220_498:0535a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0535a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間者，謂彼六種波羅蜜多，是世間故，名為世間；造世間故，名為世間；由世間故，名為世間；為世間故，名為世間；因世間故，名為世間；屬世間故，名為世間；依世間故，名為世間。",
        "translation": "\"The worldly refers to those six perfections that are called worldly because they are worldly, worldly because they're made, worldly because they're made, worldly because they're made, worldly because they're made, worldly because they're made, worldly because they're made, worldly because they're made, worldly because they're made, worldly because they're made, and worldly because they're made.",
        "source": "T07n0220_498:0535a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0535b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出世者，謂此六種波羅蜜多，是出世間故，名出世；拔出世間故，名出世；由世間出故，名出世；為世間出故，名出世；從世間出故，名出世；世間之出故，名出世；依世間出故，名出世。",
        "translation": "'Transcendent' means these six perfections are called transcendent because they transcend the world, transcend the world because they remove the world, transcend the world because they emerge from the world, transcend the world because they emerge from the world, transcend the world because they emerge from the world, transcend the world because they emerge from the world, and transcend the world because they emerge from the world.",
        "source": "T07n0220_498:0535b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T07n0220_498:0535b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩修行六種波羅蜜多時淨菩提道。」",
        "translation": "Thus, when bodhisattvas, mahāsattvas, and practitioners of the six perfections purify the path of enlightenment.\"",
        "source": "T07n0220_498:0535b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「何等名為諸菩薩摩訶薩菩提道？」",
        "translation": "It was then that Śāriputra asked Kauśāmbī, \"What's called the bodhisattva-mahāsattva path of enlightenment?\"",
        "source": "T07n0220_498:0535b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T07n0220_498:0535b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多是菩薩摩訶薩菩提道，內空乃至無性自性空是菩薩摩訶薩菩提道，真如乃至不思議界是菩薩摩訶薩菩提道，苦、集、滅、道聖諦是菩薩摩訶薩菩提道，四念住乃至八聖道支是菩薩摩訶薩菩提道，四靜慮、四無量、四無色定是菩薩摩訶薩菩提道，八解脫、九次第定是菩薩摩訶薩菩提道，空、無相、無願解脫門是菩薩摩訶薩菩提道，極喜地乃至法雲地是菩薩摩訶薩菩提道，一切陀羅尼門、三摩地門是菩薩摩訶薩菩提道，五眼、六神通是菩薩摩訶薩菩提道，如來十力乃至十八佛不共法是菩薩摩訶薩菩提道，無忘失法、恒住捨性是菩薩摩訶薩菩提道，一切智、道相智、一切相智是菩薩摩訶薩菩提道。",
        "translation": "布施波羅蜜多乃至般若波羅蜜多是菩薩摩訶薩菩提道，內空乃至無性自性空是菩薩摩訶薩菩提道，真如乃至不思議界是菩薩摩訶薩菩提道，苦、集、滅、道聖諦是菩薩摩訶薩菩提道，四念住乃至八聖道支是菩薩摩訶薩菩提道，四靜慮、四無量、四無色定是菩薩摩訶薩菩提道，八解脫、九次第定是菩薩摩訶薩菩提道，空、無相、無願解脫門是菩薩摩訶薩菩提道，極喜地乃至法雲地是菩薩摩訶薩菩提道，一切陀羅尼門、三摩地門是菩薩摩訶薩菩提道，五眼、六神通是菩薩摩訶薩菩提道，如來十力乃至十八佛不共法是菩薩摩訶薩菩提道，無忘失法、恒住捨性是菩薩摩訶薩菩提道，一切智、道相智、一切相智是菩薩摩訶薩菩提道。",
        "source": "T07n0220_498:0535b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_498:0535b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等無量無邊大功德聚一切皆是諸菩薩摩訶薩菩提道。」",
        "translation": "Such an immeasurable and limitless cluster of great merits are all part of the bodhisattvas, the great beings, and the path to enlightenment.\"",
        "source": "T07n0220_498:0535b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「如是所說大功德聚，為由何等波羅蜜多勢力所辦？」",
        "translation": "It was then that Śāriputra asked Kauśāmbī, the good manifestation, \"What is the reason that such a cluster of great merits as described here is made possible by the power of the perfections?\"",
        "source": "T07n0220_498:0535b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「如是所說大功德聚，皆由般若波羅蜜多勢力所辦。",
        "translation": "The good present replied, \"Thus explained, the great stock of merit is all produced by the power of the perfection of wisdom.",
        "source": "T07n0220_498:0535b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0535c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_498:0535c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多能與一切善法為母，一切聲聞、獨覺、菩薩、如來善法從此生故。",
        "translation": "\"Thus, the perfection of wisdom is the mother of all good qualities, and it's from this that all śrāvakas, pratyekbuddhas, bodhisattvas, and tathāgatas' good qualities arise.",
        "source": "T07n0220_498:0535c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多普能攝受一切善法，一切聲聞、獨覺、菩薩、如來善法依此住故。",
        "translation": "Thus, the perfection of wisdom can universally embrace all good qualities, and it's because all śrāvakas, pratyekbuddhas, bodhisattvas, and tathāgatas rely on that to abide in good qualities.",
        "source": "T07n0220_498:0535c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T07n0220_498:0535c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去菩薩摩訶薩眾，修學般若波羅蜜多極圓滿故，已得無上正等菩提；未來菩薩摩訶薩眾，修學般若波羅蜜多極圓滿故，當得無上正等菩提；現在十方諸佛國土無量菩薩摩訶薩眾，修學般若波羅蜜多極圓滿故，今得無上正等菩提。",
        "translation": "Because they had cultivated the perfect completion of the perfection of prajñā-pāramitā, the bodhisattvas, mahāsattvas, and their followers in the past had attained unsurpassed perfect enlightenment; because they will cultivate the perfect completion of the perfection of prajñā-pāramitā in the future, they will attain unsurpassed perfect enlightenment; and because they will cultivate the perfect completion of the perfection of prajñā-pāramitā in an unlimited number of bodhisattvas, mahāsattvas, and their followers in the lands of the buddhas in the ten directions in the present, they will attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_498:0535c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T07n0220_498:0535c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩聞說般若波羅蜜多，心無疑惑亦不迷悶，當知是菩薩摩訶薩住如是住恒不捨離，謂無所得而為方便，常勤救濟一切有情。",
        "translation": "If a bodhisattva Mahāsattva hears about the perfection of wisdom and doesn't have doubts or confusions in his mind, you should know that this is a bodhisattva Mahāsattva who abides in such a state and doesn't abandon it, which is to say that he works skillfully without gain and always endeavors to save all sentient beings.",
        "source": "T07n0220_498:0535c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是菩薩摩訶薩成就如是最勝作意，所謂大悲相應作意。」",
        "translation": "You should know that this is the bodhisattva-mahāsattva who has accomplished this most excellent intention, which is called the intention associated with great compassion.\"",
        "source": "T07n0220_498:0535c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子謂善現言：「若菩薩摩訶薩住如是住恒不捨離，成就大悲相應作意者，則一切有情亦應成就菩薩摩訶薩。",
        "translation": "Śāriputra then said to the good present, \"If the bodhisattva Mahāsattva abides in such a state of constant abiding and doesn't part with it and accomplishes the contemplation associated with great compassion, then all sentient beings should also accomplish the bodhisattva Mahāsattva.",
        "source": "T07n0220_498:0535c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0535c18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切有情亦於此住及此作意常不捨離，則諸菩薩摩訶薩與一切有情應無差別。」",
        "translation": "Because all sentient beings also abide here and have this contemplation and never abandon it, then there should be no difference between bodhisattvas, mahāsattvas, and all sentient beings.\"",
        "source": "T07n0220_498:0535c18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現報舍利子言：「善哉！",
        "translation": "It was then that the life-size, well-appearing Śāriputra replied, \"Good!",
        "source": "T07n0220_498:0535c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_498:0535c21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誠如所說，能如實知我所說意，雖似難我而成我義。",
        "translation": "\"It's true that someone who accurately knows what I mean by what I've said will make my meaning seem difficult even though it seems to be my own.",
        "source": "T07n0220_498:0535c21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0535c22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_498:0535c22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情乃至見者非有故，當知如是住及作意亦非有；有情乃至見者無實故，當知如是住及作意亦無實；有情乃至見者無性故，當知如是住及作意亦無性；有情乃至見者空故，當知如是住及作意亦空；有情乃至見者遠離故，當知如是住及作意亦遠離；有情乃至見者寂靜故，當知如是住及作意亦寂靜；有情乃至見者無覺知故，當知如是住及作意亦無覺知。",
        "translation": "\"Because sentient beings and even those who see are not existent, you should know that such abiding and contemplation are also not existent; because sentient beings and even those who see are without substance, you should know that such abiding and contemplation are also without substance; because sentient beings and even those who see are without nature, you should know that such abiding and contemplation are also without nature; because sentient beings and even those who see are empty, you should know that such abiding and contemplation are also empty; because sentient beings and even those who see are removed, you should know that such abiding and contemplation are also removed; because sentient beings and even those who see are quiescent, you should know that such abiding and contemplation are also quiescent; because sentient beings and even those who see are without perception, you should know that such abiding and contemplation are also without perception.",
        "source": "T07n0220_498:0535c22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_498:0536a02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色乃至識非有故、無實故、無性故、空故、遠離故、寂靜故、無覺知故，當知如是住及作意亦非有、無實、無性、空、遠離、寂靜、無覺知。",
        "translation": "It's because form and even consciousness are not existent, insubstantial, devoid of nature, empty, isolated, tranquil, and unaware that you should know that such abiding and contemplation are also not existent, insubstantial, devoid of nature, empty, isolated, tranquil, or unaware.",
        "source": "T07n0220_498:0536a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至聲聞、獨覺、無上菩提非有故、無實故、無性故、空故、遠離故、寂靜故、無覺知故，當知如是住及作意亦非有、無實、無性、空、遠離、寂靜、無覺知。",
        "translation": "Thus, even if it's true that śrāvakas, solitary realizers, and unsurpassed bodhi aren't existent, insubstantial, devoid of nature, empty, isolated, tranquil, and without perception, you should know that such abiding and contemplation are also not existent, insubstantial, devoid of nature, empty, isolated, tranquil, and without perception.",
        "source": "T07n0220_498:0536a05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_498:0536a08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，諸菩薩摩訶薩於如是住及此作意常不遠離，與諸有情亦無差別，以一切法及諸有情，皆畢竟空無差別故。」",
        "translation": "As a result, bodhisattvas, mahāsattvas, are always unseparated from such abiding and such contemplation, and there's no distinction between them and sentient beings because all things and sentient beings are ultimately empty and without distinction.\"",
        "source": "T07n0220_498:0536a08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚善現曰：「善哉！",
        "translation": "At that point, the Bhagavān praised the good manifestation, saying, \"Good!",
        "source": "T07n0220_498:0536a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T07n0220_498:0536a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝善能為諸菩薩摩訶薩宣說般若波羅蜜多，此皆如來威神之力。",
        "translation": "\"You're well able to explain the perfections of prajñā for the bodhisattvas, mahāsattvas, which are the authoritative power of the Tathāgata.",
        "source": "T07n0220_498:0536a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有欲為諸菩薩摩訶薩宣說般若波羅蜜多，皆應如汝之所宣說。",
        "translation": "If there are bodhisattvas, mahāsattvas, and bodhisattvas who want to teach the perfections of prajñā, they should do so according to what you teach.",
        "source": "T07n0220_498:0536a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩欲學般若波羅蜜多，皆應隨汝所說而學。",
        "translation": "If bodhisattvas, mahāsattvas, and bodhisattvas want to learn the perfection of wisdom, they should all learn it according to what you teach.",
        "source": "T07n0220_498:0536a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩隨汝所說而學般若波羅蜜多，是菩薩摩訶薩疾得無上正等菩提轉妙法輪，窮未來際利益安樂一切有情。」",
        "translation": "If a bodhisattva Mahāsattva trains in the prajñāpāramitā according to what you teach, that bodhisattva Mahāsattva will quickly attain unsurpassed perfect enlightenment, turn the wonderful Dharma wheel, and benefit and comfort all sentient beings well into the future.\"",
        "source": "T07n0220_498:0536a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現為眾宣說甚深般若波羅蜜多時，於此三千大千世界六種變動：東踊西沒，西踊東沒，南踊北沒，北踊南沒，中踊邊沒，邊踊中沒。",
        "translation": "When the Blessed One explained the profound perfection of wisdom to the crowd, the 3,000 great thousand worlds underwent six kinds of upheaval: east swept away, west swept away, west swept away, east swept away, south swept away, north swept away, south swept away, middle swept away, and middle swept away.",
        "source": "T07n0220_498:0536a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即便微笑，具壽善現白言：「世尊何因何緣現此微笑？」",
        "translation": "At the time, the Bhagavān smiled, and Kauśāmbī said, \"Bhagavān, what's the reason for this smile?\"",
        "source": "T07n0220_498:0536a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「如我今者於此三千大千世界，為諸菩薩摩訶薩眾宣說般若波羅蜜多，今於十方無量無數無邊世界，各有如來、應、正等覺，亦為菩薩摩訶薩眾宣說般若波羅蜜多。",
        "translation": "The Buddha told Śaṅgālī, \"Now, as I have taught the perfection of wisdom to a multitude of bodhisattvas, mahāsattvas, there are tathāgatas, arhats, and pratyekabuddhas in measureless, infinite, and limitless worlds in ten directions who also teach the perfection of wisdom to a multitude of bodhisattvas, mahāsattvas, and so forth.",
        "source": "T07n0220_498:0536a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今者於此三千大千世界，宣說般若波羅蜜多，有十二京天人等眾於一切法得無生忍；今於十方無量無數無邊世界，各有無量無數無邊諸有情類，聞彼諸佛為諸菩薩摩訶薩眾宣說般若波羅蜜多，於空法中深生信解，皆發無上正等覺心，勤修菩薩摩訶薩行。」",
        "translation": "Now, in this world of 3,000 great one-thousand worlds, I have taught the perfection of wisdom, and there are 12 gods, gods, humans, and other beings who have attained the patient acceptance of nonarising in regard to all dharmas. Now, in measureless, countless, and infinite worlds in the ten directions, there are measureless, countless, and infinite varieties of sentient beings who hear those buddhas teach the perfection of wisdom to the bodhisattva-mahāsattva community, deeply believe in the teaching of emptiness, arouse the mind of unsurpassed correct perfect enlightenment, and diligently cultivate the bodhisattva-mahāsattva practices.\"",
        "source": "T07n0220_498:0536a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分天帝品第四之一",
        "translation": "(1) of the Fourth Chapter of the Third Part of the Deva Heaven",
        "source": "T07n0220_498:0536b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，於此三千大千佛之世界，所有一切四大天王及諸天帝，展轉乃至色究竟天，各與無量百千俱胝那庾多眾俱來會坐。",
        "translation": "At the time, in this world of 3,000 great buddhas, all four great celestial kings and gods, spreading out to the gods of the form realm, each came together with a multitude of measureless hundreds of thousands of koṭīs and nayutas to sit in assembly.",
        "source": "T07n0220_498:0536b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸天眾淨業所感異熟身光雖能照曜，而比如來所現常光，百分不及一，千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "Although the light from the ripened bodies of these gods caused by their pure activities can shine, the constant light shown by the Buddha is less than one part in a hundred, less than one part in a thousand, and less than one part in the Upaniṣad.",
        "source": "T07n0220_498:0536b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0536b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛身常光威德熾盛，於諸光中最尊最勝、最上最妙、無比無等、無上第一，蔽諸天光皆令不現，如秋滿月映奪眾星。",
        "translation": "The Buddha's body is an ever-present radiance so blazing with power and authority that it's the most honored, most superior, most marvelous, peerless, unequaled, and unsurpassed among all the lights, blinding all the heavenly lights and preventing them from appearing like the full moon in autumn reflecting off the stars.",
        "source": "T07n0220_498:0536b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋白善現言：「今此三千大千世界所有一切四大天王及諸天帝，展轉乃至色究竟天，各與眷屬皆來集會，欲聞大德宣說般若波羅蜜多，唯願大德哀愍為說。",
        "translation": "Śakra then said to Śaṇḍinya, \"Now, all four great celestial kings and gods of the 3,000 great one-thousand worlds, spreading out to the gods of the form realm, have gathered here with their retinues, wanting to hear Mañjuśrī preach the perfection of wisdom, so please have mercy on Mañjuśrī and explain it for us.",
        "source": "T07n0220_498:0536b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Mañjuśrī!",
        "source": "T07n0220_498:0536b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩摩訶薩甚深般若波羅蜜多？",
        "translation": "What is the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas?",
        "source": "T07n0220_498:0536b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩應住般若波羅蜜多？",
        "translation": "\"How should a bodhisattva-mahāsattva abide in prajñāpāramitā?",
        "source": "T07n0220_498:0536b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩應學般若波羅蜜多？」",
        "translation": "How should bodhisattvas and mahāsattvas train in the perfection of wisdom?\"",
        "source": "T07n0220_498:0536b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現告天帝釋言：「憍尸迦！",
        "translation": "It was then that Kauśāmbī addressed Śakra, saying, \"Kauśika!",
        "source": "T07n0220_498:0536b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等天眾皆應諦聽！",
        "translation": "All of you gods, listen closely!",
        "source": "T07n0220_498:0536b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T07n0220_498:0536b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當承佛威神之力順如來意，為諸菩薩摩訶薩眾宣說般若波羅蜜多，如菩薩摩訶薩可於其中應如是住應如是學。",
        "translation": "I will accept the Buddha's authoritative power and follow the Tathāgata's wishes in teaching the perfection of wisdom to a multitude of bodhisattvas, such that bodhisattvas and mahāsattvas can thus abide and thus train therein.",
        "source": "T07n0220_498:0536b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_498:0536b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸天等未發無上菩提心者今皆應發。",
        "translation": "Now, you gods and others who have yet to give rise to the unsurpassed mind of enlightenment should do so.",
        "source": "T07n0220_498:0536b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有已入聲聞、獨覺正性離生，不復能發大菩提心。",
        "translation": "Those who have entered the direct lineage of śrāvakas and solitary realizers and have escaped birth can no longer generate the great mind of enlightenment.",
        "source": "T07n0220_498:0536b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0536b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於生死流已作限隔故。",
        "translation": "Because they've placed a limit on the flow of birth-and-death, I'm pleased with those who can give rise to the unsurpassed mind of enlightenment.",
        "source": "T07n0220_498:0536b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中若有能發無上菩提心者，我亦隨喜。",
        "translation": "If one of them can give rise to the unsurpassed mind of enlightenment, I'll also delight in that person.",
        "source": "T07n0220_498:0536b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0536c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有勝人應求勝法，我終不障他勝善品。",
        "translation": "All superior people should seek superior things, and I will never hinder the superior good qualities of others.",
        "source": "T07n0220_498:0536c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_498:0536c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝問『何謂菩薩摩訶薩甚深般若波羅蜜多？』",
        "translation": "You asked, 'What is the profound prajñāpāramitā of the bodhisattvas, the great?'",
        "source": "T07n0220_498:0536c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，諦聽！",
        "translation": "Those who do, listen closely!",
        "source": "T07n0220_498:0536c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen closely!",
        "source": "T07n0220_498:0536c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T07n0220_498:0536c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_498:0536c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟色蘊乃至識蘊，若無常、若苦，若無我、若不淨，若空、若無相、若無願，若寂靜、若遠離，若如病、若如癕，若如箭、若如瘡，若熱惱、若逼切，若敗壞、若衰朽，若變動、若速滅，若可畏、若可厭，若有災、若有橫，若有疫、若有癘，若不安隱、不可保信，無生、無滅、無染、無淨、無作、無為；思惟眼處乃至意處，思惟色處乃至法處，思惟眼界乃至意界，思惟色界乃至法界，思惟眼識界乃至意識界，思惟眼觸乃至意觸，思惟眼觸為緣所生諸受乃至意觸為緣所生諸受，思惟地界乃至識界，思惟無明乃至老死，亦復如是。",
        "translation": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟色蘊乃至識蘊，若無常、若苦，若無我、若不淨，若空、若無相、若無願，若寂靜、若遠離，若如病、若如癕，若如箭、若如瘡，若熱惱、若逼切，若敗壞、若衰朽，若變動、若速滅，若可畏、若可厭，若有災、若有橫，若有疫、若有癘，若不安隱、不可保信，無生、無滅、無染、無淨、無作、無為；思惟眼處乃至意處，思惟色處乃至法處，思惟眼界乃至意界，思惟色界乃至法界，思惟眼識界乃至意識界，思惟眼觸乃至意觸，思惟眼觸為緣所生諸受乃至意觸為緣所生諸受，思惟地界乃至識界，思惟無明乃至老死，亦復如是。",
        "source": "T07n0220_498:0536c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas.",
        "source": "T07n0220_498:0536c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_498:0536c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟無明緣行，行緣識，識緣名色，名色緣六處，六處緣觸，觸緣受，受緣愛，愛緣取，取緣有，有緣生，生緣老死乃至純大苦蘊集已；復以無所得為方便，思惟無明滅故行滅，行滅故識滅，識滅故名色滅，名色滅故六處滅，六處滅故觸滅，觸滅故受滅，受滅故愛滅，愛滅故取滅，取滅故有滅，有滅故生滅，生滅故老死乃至純大苦蘊滅，如是諸滅無我、空、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟無明緣行，行緣識，識緣名色，名色緣六處，六處緣觸，觸緣受，受緣愛，愛緣取，取緣有，有緣生，生緣老死乃至純大苦蘊集已；復以無所得為方便，思惟無明滅故行滅，行滅故識滅，識滅故名色滅，名色滅故六處滅，六處滅故觸滅，觸滅故受滅，受滅故愛滅，愛滅故取滅，取滅故有滅，有滅故生滅，生滅故老死乃至純大苦蘊滅，如是諸滅無我、空、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "source": "T07n0220_498:0536c18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas.",
        "source": "T07n0220_498:0536c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_498:0536c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟內空乃至無性自性空無我我所、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "\"Suppose a bodhisattva Mahāsattva arises the mind that responds to omniscience and uses ungraspable wisdom as a method to contemplate internal emptiness or even the emptiness of a natureless self-nature that has no self or anything, is without marks, lacks wishes, is tranquil, isolated, unarisen, unceased, undefiled, unpurified, uncreated, and unproduced.",
        "source": "T07n0220_498:0537a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas.",
        "source": "T07n0220_498:0537a04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟真如乃至不思議界無我我所、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "\"If bodhisattvas, mahāsattvas, arouse the mind that responds to omniscience, using the method of ungraspable knowledge, contemplate the true thusness ... inconceivable realms as selfless, without marks, without desire, quiescent, free, unarisen, unceasing, undefiled, unpurified, uncreated, and unproduced.",
        "source": "T07n0220_498:0537a05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas.",
        "source": "T07n0220_498:0537a09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟斷界乃至無為界無我我所、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "\"If bodhisattvas, mahāsattvas, arouse the mind that responds to omniscience, using the method of ungraspable knowledge, contemplate that the elimination realm ... the realm of nothingness has no self or object, is markless, wishless, tranquil, isolated, unarisen, uncealed, undefiled, unpurified, uncreated, and unproduced.",
        "source": "T07n0220_498:0537a10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas.",
        "source": "T07n0220_498:0537a13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a14_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟布施波羅蜜多乃至般若波羅蜜多，思惟四念住乃至八聖道支，思惟四靜慮、四無量、四無色定，思惟八解脫、九次第定，思惟空、無相、無願解脫門，思惟淨觀地乃至如來地，思惟極喜地乃至法雲地，思惟五眼、六神通，思惟如來十力乃至十八佛不共法，思惟無忘失法、恒住捨性，思惟一切陀羅尼門、三摩地門，思惟一切智、道相智、一切相智，皆是無常、無我、空、無相、無願、寂靜、遠離、變動、速滅、不可保信、無生、無滅、無染、無淨、無作、無為。",
        "translation": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟布施波羅蜜多乃至般若波羅蜜多，思惟四念住乃至八聖道支，思惟四靜慮、四無量、四無色定，思惟八解脫、九次第定，思惟空、無相、無願解脫門，思惟淨觀地乃至如來地，思惟極喜地乃至法雲地，思惟五眼、六神通，思惟如來十力乃至十八佛不共法，思惟無忘失法、恒住捨性，思惟一切陀羅尼門、三摩地門，思惟一切智、道相智、一切相智，皆是無常、無我、空、無相、無願、寂靜、遠離、變動、速滅、不可保信、無生、無滅、無染、無淨、無作、無為。",
        "source": "T07n0220_498:0537a15_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas.",
        "source": "T07n0220_498:0537a26_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a27_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，安住內空乃至無性自性空，安住真如乃至不思議界，安住斷界乃至無為界，安住苦聖諦乃至道聖諦。",
        "translation": "\"Suppose a bodhisattva Mahāsattva arises the mind that should have omniscience and knowledge, uses ungraspable skill as a means to abide in internal emptiness and even the emptiness of the natureless nature of itself, abides in true reality and even the inconceivable realm, abides in the elimination realm and even the nonproduct realm, and abides in the noble truth of suffering and even the noble truth of the path.",
        "source": "T07n0220_498:0537a27_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537b02_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattvas, the great mahāsattvas.",
        "source": "T07n0220_498:0537b02_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_498:0537b03_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，修行布施波羅蜜多乃至般若波羅蜜多，修行四念住乃至八聖道支，修行四靜慮、四無量、四無色定，修行八解脫、九次第定，修行空、無相、無願解脫門，修行極喜地乃至法雲地，修行五眼、六神通，修行如來十力乃至十八佛不共法，修行無忘失法、恒住捨性，修行一切陀羅尼門、三摩地門，修行一切智、道相智、一切相智，修行一切菩薩摩訶薩行，修行諸佛無上正等菩提。",
        "translation": "若菩薩摩訶薩起應一切智智心，以無所得為方便，修行布施波羅蜜多乃至般若波羅蜜多，修行四念住乃至八聖道支，修行四靜慮、四無量、四無色定，修行八解脫、九次第定，修行空、無相、無願解脫門，修行極喜地乃至法雲地，修行五眼、六神通，修行如來十力乃至十八佛不共法，修行無忘失法、恒住捨性，修行一切陀羅尼門、三摩地門，修行一切智、道相智、一切相智，修行一切菩薩摩訶薩行，修行諸佛無上正等菩提。",
        "source": "T07n0220_498:0537b03_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva Mahāsattva.",
        "source": "T07n0220_498:0537b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 4, No. 4, 98",
        "source": "T07n0220_498:0537b15_0",
        "is_bad_quality": false
    }
]