[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 504",
        "source": "T07n0220_540:0774a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十",
        "translation": "ten",
        "source": "T07n0220_540:0774a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T07n0220_540:0774a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四分供養窣堵波品第三之二",
        "translation": "The Fourth Part of the Chapter on Offerings to the Surūpa, 3rd-2nd",
        "source": "T07n0220_540:0774a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_540:0774a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多甚奇希有，能調菩薩摩訶薩眾令離高心，迴向所求一切智智。」",
        "translation": "Thus, the prajñāpāramitā is rare and extraordinary, and it can tame a multitude of bodhisattvas, mahāsattvas, and make them part with their high minds and turn them toward the wisdom of all that they seek.\"",
        "source": "T07n0220_540:0774a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「云何般若波羅蜜多甚奇希有，能調菩薩摩訶薩眾令離高心，迴向所求一切智智？」",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, \"How is the prajñāpāramitā so rare and extraordinary that it can tame the bodhisattva-mahāsattva multitude so that they part with their high minds and turn toward the cognition of all that they seek?\"",
        "source": "T07n0220_540:0774a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋白言：「世尊！",
        "translation": "Thereupon, Śakra Devānām-Indra said, \"Bhagavān!",
        "source": "T07n0220_540:0774a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩不依般若波羅蜜多，修行布施乃至般若及餘種種諸佛法時，無方便善巧故，雖修諸善而起高心，不能迴向一切智智；若菩薩摩訶薩依止般若波羅蜜多，修行布施乃至般若及餘種種諸佛法時，有方便善巧故，所修諸善調伏高心，迴向所求一切智智。」",
        "translation": "If a bodhisattva does not rely on the perfection of wisdom and cultivates generosity ... prajñāpāramitā and the other kinds of Buddhist teachings, then because there's no skillful means, even though he cultivates good qualities and becomes highly motivated, he can't turn his mind toward the knowledge of all knowables; if a bodhisattva relies on the perfection of wisdom and cultivates generosity ... prajñāpāramitā and the other kinds of Buddhist teachings, then because there are skillful means and skillful means, the good qualities he cultivates will subdue his high mind and turn it toward the knowledge of all that he seeks.\"",
        "source": "T07n0220_540:0774a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, \"So it is!",
        "source": "T07n0220_540:0774a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0774a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you say.",
        "source": "T07n0220_540:0774a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0774a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等能於般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，是善男子、善女人等身心安樂，不為一切災橫侵惱。",
        "translation": "\"If good men and good women wholeheartedly hear and retain the perfection of wisdom, recite it, diligently cultivate it, correctly contemplate it, write it down, explain it, and disseminate it, those good men and good women are comfortable in body and mind and aren't afflicted by any calamity.",
        "source": "T07n0220_540:0774a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在軍旅交戰陣時，至心念誦如是般若波羅蜜多，於諸有情慈悲護念，不為刀杖之所傷殺，所對怨敵皆起慈心，設起惡心自然退敗。",
        "translation": "If they wholeheartedly recite this prajñāpāramitā when engaged in battle, they'll be compassionate and mindful of sentient beings, won't be injured or killed by swords and staves, and become compassionate toward their enemies, so that if they give rise to bad thoughts, they'll naturally retreat.",
        "source": "T07n0220_540:0774a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，若在軍旅刀箭所傷失命喪身，終無是處。",
        "translation": "Good men and good women who are wounded by a sword or an arrow in battle and lose their lives and bodies will never find a place to go.",
        "source": "T07n0220_540:0774a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0774a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等修行般若波羅蜜多，自能降伏煩惱、惡業、種種刀杖，亦能除他煩惱、惡業、諸刀杖故。",
        "translation": "Good men and good women who practice the perfection of wisdom can subdue afflictions, bad karma, and various swords and blows themselves, and they can remove afflictions, bad karma, and swords and blows from others.",
        "source": "T07n0220_540:0774a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0774b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等能於般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、供養恭敬、尊重讚歎、書寫、解說、廣令流布，是善男子、善女人等，一切毒藥、蠱道、鬼魅、厭禱、呪術皆不能害，水不能溺，火不能燒、刀杖、惡獸、怨賊、惡神、眾邪、魍魎不能傷害。",
        "translation": "If good men and good women wholeheartedly hear and retain the perfection of wisdom, memorize it, recite it, diligently cultivate it, correctly contemplate it, make offerings, venerate and praise it, write it down, explain it, and disseminate it widely, then good men and good women will be unable to harm any poison, trickster, demon, disaffection, or spell, won't be drowned by water, won't be burned by fire, and won't be harmed by swords, beasts, thieves, bad spirits, evil spirits, and monsters.",
        "source": "T07n0220_540:0774b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0774b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多是大神呪，是大明呪，是無上呪，是無等等呪；如是般若波羅蜜多是諸呪王，最上、最妙、無能及者，具大威力，能伏一切，不為一切之所降伏。",
        "translation": "Thus, the prajñāpāramitā is a great incantation, a great incantation of insight, a peerless incantation, and a peerless incantation; thus, the prajñāpāramitā is the king of incantations, the most excellent, sublime, and unsurpassed, with great power that subdues all things and isn't subject to all of them.",
        "source": "T07n0220_540:0774b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等精勤修學如是呪王，不為自害，不為他害，不為俱害。",
        "translation": "Good men and good women diligently cultivate such a king of spells, so they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T07n0220_540:0774b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，於我及法雖無所得，而證無上正等菩提，由斯獲得一切智智，觀有情類心行差別，隨宜為轉無上法輪，令如說行得大饒益。",
        "translation": "When good sons and good women study this great dhāraṇī of prajñāpāramitā, they realize unsurpassed perfect enlightenment despite having nothing to gain from the self and the Dharma, and as a result they attain omniscience and knowledge, observe the differences in the minds and actions of sentient beings, and appropriately turn the unsurpassed wheel of the Dharma for them, causing them to practice as explained to attain great benefit.",
        "source": "T07n0220_540:0774b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0774b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去未來現在菩薩，皆學如是甚深般若波羅蜜多大神呪王，無所不得、無所不證，是故說名一切智智。",
        "translation": "Past, future, and present bodhisattvas all train in this kind of profound prajñāpāramitā, the great dhāraṇī king, and there's nothing they can't attain or realize, which is why it's called omniscience.",
        "source": "T07n0220_540:0774b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0774b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等於此般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、供養恭敬、尊重讚歎、書寫、解說、廣令流布，得如是等現法當來種種功德。",
        "translation": "If good men and good women wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, make offerings, venerate, praise, write, explain, and disseminate the perfection of wisdom, they'll attain such a variety of merits in the present and future.",
        "source": "T07n0220_540:0774b19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0774b23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，書此般若波羅蜜多大神呪王，置清淨處供養恭敬、尊重讚歎，雖不聽聞、受持、讀誦、精勤修學、如理思惟，亦不為他開示分別，而此住處國邑王都人非人等不為一切災橫疾疫之所傷害。",
        "translation": "If good sons and good women write this great Dhāraṇī king of spells, place it in a pure place, offer it in respect and veneration, honor and praise it, and although they don't hear it, retain it, recite it, diligently cultivate it, and correctly contemplate it, nor do they reveal and discern it for others, the people and non-people of the kingdoms and cities where they live won't be harmed by any calamity or epidemic.",
        "source": "T07n0220_540:0774b23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0774b28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，怖畏怨家、惡獸、災橫、厭禱、疾疫、毒藥、呪等，應書般若波羅蜜多大神呪王，隨多少分香囊盛貯置寶筒中，恒隨自身供養恭敬，諸怖畏事皆悉銷除，天、龍、鬼神常來守護，唯除宿世惡業應受。",
        "translation": "If good sons and good women fear enemies, harmful animals, calamity, disillusionment, epidemics, poisons, spells, and so forth, they should write a copy of the great mantra king Prajñāpāramitā, store it in a treasure bowl according to its size in a scented bag, always make offerings to themselves, and venerate it, for all their fears will be removed, and gods, dragons, and ghosts will always come to guard it, except for the bad karma of past lives that should be received.",
        "source": "T07n0220_540:0774b28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774c04_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人或傍生類，入菩提樹院或至彼院邊，人非人等不能傷害。",
        "translation": "\"Suppose a person or a group of animals enters the courtyard of a bodhi tree or goes to its edge, and neither humans nor non-humans can harm them.",
        "source": "T07n0220_540:0774c04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0774c05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774c06_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去未來現在諸佛皆坐此處，證得無上正等菩提，得菩提已施諸有情無恐、無怖、無怨、無害身心安樂。",
        "translation": "All the buddhas of the past, future, and present sit here, realize unsurpassed perfect enlightenment, and once they've achieved enlightenment, they give sentient beings fearlessness, fearlessness, hostility, and harmlessness, physical and mental well-being.",
        "source": "T07n0220_540:0774c06_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知般若波羅蜜多隨所住處亦復如是，一切天、龍、阿素洛等常來守護。",
        "translation": "You should know that this is likewise the place where the perfection of wisdom follows, where all the gods, dragons, asuras, and so forth always come to guard it.",
        "source": "T07n0220_540:0774c08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774c10_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多隨所住處，當知是處即真制多，一切有情皆應敬禮，當以種種上妙供具，供養恭敬、尊重讚歎。",
        "translation": "如是般若波羅蜜多隨所住處，當知是處即真制多，一切有情皆應敬禮，當以種種上妙供具，供養恭敬、尊重讚歎。",
        "source": "T07n0220_540:0774c10_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0774c13_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸有情歸依處故。」",
        "translation": "This is the place to which all sentient beings must turn.\"",
        "source": "T07n0220_540:0774c13_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「若善男子、善女人等書此般若波羅蜜多，種種莊嚴供養恭敬、尊重讚歎，復以種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養；有善男子、善女人等，佛涅槃後起窣堵波七寶嚴飾，寶函盛貯佛設利羅安置其中，供養恭敬、尊重讚歎，復以種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "Śakra then said to the Buddha, \"Suppose there are good men and good women who have written this prajñāpāramitā, have offered various adornments, respect, and praise it, and have made offerings with various kinds of fine flowers, scattered incense, clothing, jewelry, banners, flags, shrouds, marvelous, rare, music, tricks, and lamps; suppose there are good men and good women who, after the Buddha's nirvāṇa, build a stūpa adorned with seven treasures, store a treasure box full of the Buddha's śarīra, place it inside, offer respect, venerate, and praise it, and make offerings with various kinds of fine flowers, scattered incense, clothing, jewelry, banners, flags, shrouds, marvelous, rare, music, and lamps.",
        "source": "T07n0220_540:0774c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二所獲福，何者為多？」",
        "translation": "Which of these two kinds of merit will obtain the most?\"",
        "source": "T07n0220_540:0774c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「我還問汝，當隨意答。",
        "translation": "It was then that the Buddha addressed Śakra, saying, \"I'll ask you again, and you'll answer as you like.",
        "source": "T07n0220_540:0774c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0774c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所得一切智智，所證無上正等菩提及所依身，依何等道修學而得？」",
        "translation": "What path does the Tathāgata attain, based on the cultivation of omniscience, the unsurpassed correct enlightenment that he realizes, and the body on which he relies?\"",
        "source": "T07n0220_540:0774c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「如來所得一切智智，所證無上正等菩提及所依身，皆依般若波羅蜜多修學而得。」",
        "translation": "Śakra Devānām-Indra said, \"The Tathāgata attains omniscience, the unsurpassed correct enlightenment that he realizes, and the body on which he relies all rely on the cultivation of prajñāpāramitā.\"",
        "source": "T07n0220_540:0774c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T07n0220_540:0774c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0774c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "\"As you said.",
        "source": "T07n0220_540:0774c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我依般若波羅蜜多修學故，得一切智智、所證無上正等菩提及所依身。",
        "translation": "Because I rely on the practice of the perfection of wisdom, I've attained the wisdom of omniscience, the unsurpassed correct enlightenment that I've realized, and the body that I rely on.",
        "source": "T07n0220_540:0774c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0775a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不學般若波羅蜜多，有能獲得一切智智、所證無上正等菩提及所依身，無有是處。",
        "translation": "Without studying the perfection of wisdom, there's no place where one can attain the knowledge of all cognitions, the unsurpassed correct enlightenment that's realized, and the body that depends on it.",
        "source": "T07n0220_540:0775a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0775a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但獲得相好身故說名如來、應、正等覺，要由證得一切智智乃名如來、應、正等覺。",
        "translation": "It's not just that they're called tathāgatas, arhats, and fully enlightened because they've attained the body of good features; they're called tathāgatas, arhats, and fully enlightened because they've realized the wisdom of omniscience.",
        "source": "T07n0220_540:0775a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所得一切智智，要由般若波羅蜜多為因故起，佛相好身但為依處，若不依止佛相好身無由而起，是故般若波羅蜜多，正為因生一切智智，欲令此智現前相續故，復修集佛相好身。",
        "translation": "The Tathāgata's attained omniscience arises only because prajñā-pāramitā is the cause, and the Buddha's attractive body is merely a support; if it doesn't rely on the Buddha's attractive body, there's no way it can arise.",
        "source": "T07n0220_540:0775a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此相好身若非遍智所依處者，一切天、龍、人非人等不應竭誠供養恭敬。",
        "translation": "If this characteristic body isn't the basis of omniscience, all gods, dragons, humans and nonhumans shouldn't make every effort to offer support and respect it.",
        "source": "T07n0220_540:0775a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以相好身與佛遍智為所依止故，諸天、龍、人非人等供養恭敬。",
        "translation": "It's because the body of replete Buddhahood and pervasive wisdom are the bases of their offerings and veneration from gods, dragons, humans, and non-humans.",
        "source": "T07n0220_540:0775a11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故，我涅槃後，諸天、龍神、人非人等供養恭敬我設利羅。",
        "translation": "For this reason, after I die, gods, dragons, humans, and non-humans will make offerings to and venerate me, Śāriputra.",
        "source": "T07n0220_540:0775a12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0775a14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多，供養恭敬、尊重讚歎，則為供養一切智智及所依止佛相好身并涅槃後佛設利羅。",
        "translation": "\"If good sons and good women write these prajñāpāramitās, offer them up in respect and admiration, then they're making offerings to the omniscience, the Buddha's beautiful body that they rely on, and the post-nirvāṇa Buddha's śarīra.",
        "source": "T07n0220_540:0775a14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0775a17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智及相好身并設利羅，皆以般若波羅蜜多為根本故。",
        "translation": "\"Omniscient knowledge, the body with its beautiful features, and the śarīra all have prajñāpāramitā as their root.",
        "source": "T07n0220_540:0775a17_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，憍尸迦！",
        "translation": "Therefore, Kauśika!",
        "source": "T07n0220_540:0775a18_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多，種種莊嚴供養恭敬、尊重讚歎，復以種種上妙華鬘乃至燈明而為供養。",
        "translation": "\"Suppose good men and good women write these prajñāpāramitās, adorn them in various ways, offer them up in respect and admiration, and venerate and praise them, and then they make offerings with various kinds of the finest flowers and garlands and even lamps.",
        "source": "T07n0220_540:0775a19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等，佛涅槃後起窣堵波七寶嚴飾，寶函盛貯佛設利羅安置其中，供養恭敬、尊重讚歎，復以種種上妙華鬘乃至燈明而為供養。",
        "translation": "After the Buddha's nirvāṇa, some good sons and good women erect a stūpa adorned with seven treasures, store a jeweled box full of the Buddha's śarīra, place it there, make offerings, venerate, respect, and praise it, and then make offerings with a variety of beautiful flower garlands and even lamps.",
        "source": "T07n0220_540:0775a21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二所獲福，前者為多無量倍數。",
        "translation": "The merits obtained by these two things are immeasurably greater than the former.",
        "source": "T07n0220_540:0775a25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0775a25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a26_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等供養般若波羅蜜多，即為供養一切智智佛相好身設利羅故。」",
        "translation": "If good sons and good women make offerings to the perfection of wisdom, that's because they're making offerings to the Buddha of omniscience and wisdom in terms of his beautiful body, śarīra.\"",
        "source": "T07n0220_540:0775a26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「贍部洲人於此般若波羅蜜多，不能書寫眾寶莊嚴、供養恭敬、尊重讚歎，不能聽聞、受持、讀誦、精勤修學、如理思惟，彼豈不知書此般若波羅蜜多，眾寶莊嚴、供養恭敬、尊重讚歎、至心聽聞、受持、讀誦、精勤修學、如理思惟，獲得種種功德勝利？」",
        "translation": "Thereupon, Śakra then said to the Buddha, \"Wouldn't someone from Jambudvīpa be able to write this prajñāpāramitā that's adorned with treasures, offered with respect and admiration, and praised with reverence, and that's not heard, upheld, recited, diligently cultivated, and considered according to reason, knowing that writing this prajñapāramitā that's adorned with treasures, offered with respect and admiration, praised with reverence, wholeheartedly heard, upheld, recited, diligently cultivated, and considered according to reason will obtain various merits and benefits?\"",
        "source": "T07n0220_540:0775a28_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「我還問汝，當隨意答。",
        "translation": "It was then that the Buddha addressed Śakra, saying, \"I'll ask you again, and you'll answer as you like.",
        "source": "T07n0220_540:0775b04_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0775b05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內有幾許人成佛證淨、成法證淨、成僧證淨？",
        "translation": "How many people in Jambudvīpa have realized the purification of buddhas, the purification of dharmas, and the purification of monks?",
        "source": "T07n0220_540:0775b06_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾許人得預流果、或一來果、或不還果、或阿羅漢果？",
        "translation": "How many people attain the fruit of pre-flow, the fruit of the first coming, the fruit of nonreturn, or the fruit of the arhat?",
        "source": "T07n0220_540:0775b07_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾許人發心定趣獨覺菩提？",
        "translation": "How many people have arisen the intention to set out for the enlightenment of the pratyekabuddhas?",
        "source": "T07n0220_540:0775b08_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾許人發心定趣諸佛無上正等菩提？」",
        "translation": "How many people have the intention to proceed to the unsurpassed perfect enlightenment of the buddhas?\"",
        "source": "T07n0220_540:0775b09_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「贍部洲內有少許人成佛證淨、成法證淨、成僧證淨，轉少許人得預流果、或一來果、或不還果、或阿羅漢果，轉少許人發心定趣獨覺菩提，轉少許人發心定趣諸佛無上正等菩提。」",
        "translation": "Śakra Devānām-Indra said, \"A few people on Jambudvīpa will become buddhas and realize purity, dharmas and saṃgha will become purity, a few people will attain the fruit of pre-flow, the fruit of the first coming, the fruit of no-return, or the fruit of the arhat, a few people will become determined to go to pratyekabuddha, and a few people will become determined to go to the unsurpassed perfect enlightenment of the buddhas.\"",
        "source": "T07n0220_540:0775b10_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T07n0220_540:0775b14_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0775b15_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you say.",
        "source": "T07n0220_540:0775b15_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0775b15_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內極少分人成佛證淨、成法證淨、成僧證淨，轉少分人得預流果、或一來果、或不還果、或阿羅漢果，轉少分人發心定趣獨覺菩提，轉少分人發心定趣諸佛無上正等菩提，轉少分人既發心已，精勤修學趣菩提行，轉少分人精勤修學菩提行時，於此般若波羅蜜多深心信受，轉少分人深信受已，修行般若波羅蜜多，轉少分人既修行已，漸次安住不退轉地，轉少分人，住此地已，疾證無上正等菩提。",
        "translation": "A tiny fraction of the people on Jambudvīpa achieve the realization of the Buddha, the realization of the Dharma, and the realization of the saṃgha, and a transient fraction of them attain the fruit of pre-flow, the fruit of the first coming, the fruit of no-return, or the fruit of the arhat.",
        "source": "T07n0220_540:0775b15_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0775b24_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩已得安住不退轉地，求證無上正等菩提，乃能深心恭敬信受甚深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟，亦能為他無倒宣說，復以種種上妙華鬘乃至燈明供養恭敬、尊重讚歎。",
        "translation": "If a bodhisattva-mahāsattva has attained the stage of nonretrogression and seeks to realize unsurpassed correct perfect enlightenment, then he or she can deeply respect and believe in the profound perfection of wisdom, wholeheartedly hear and retain it, recite it, diligently cultivate it, and correctly contemplate it, as well as explain it without error for others and offer various kinds of exquisite flowers and lanterns for their respect and admiration.",
        "source": "T07n0220_540:0775b24_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0775b29_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以無障清淨佛眼遍觀十方無邊世界，雖有無量無數有情發菩提心修菩薩行，而由遠離甚深般若波羅蜜多方便善巧，若一、若二、若三有情得住菩薩不退轉地，多分退墮聲聞、獨覺下意、下行、下劣地中。",
        "translation": "\"With the unobstructed pure Buddha eye, I've looked around at the limitless world in the ten directions, and even though there are measureless and countless sentient beings who arouse the aspiration for enlightenment and cultivate the bodhisattva practice, if one, two, or three sentient beings become established in the bodhisattva stage of nonretrogression because they're far removed from the profound prajñāpāramitā and the skillful means, many of them fall back into the lower mental, lower practice, and lower stages of the direct disciples and solitary realizers.",
        "source": "T07n0220_540:0775b29_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0775c05_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775c05_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提功德無邊甚難可證，惡慧懈怠下劣、精進下劣、勝解下劣有情不能證得。",
        "translation": "The buddhas' unsurpassed correct perfect enlightenment has limitless merit and is very difficult to realize, and it can't be realized by sentient beings whose wisdom is lazy and inferior, whose effort is inferior, or whose resolve is inferior.",
        "source": "T07n0220_540:0775c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故，憍尸迦！",
        "translation": "\"Therefore, Kauśika!",
        "source": "T07n0220_540:0775c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等發菩提心修菩薩行，欲住菩薩不退轉地，疾證無上正等菩提無留難者，應於般若波羅蜜多數數聽聞、受持、讀誦、精勤修學、如理思惟，好請問師，樂為他說，復應書寫、眾寶莊嚴、供養恭敬、尊重讚歎。",
        "translation": "\"If good men and good women arouse the mind of enlightenment and cultivate the bodhisattva practice, want to abide in the bodhisattva's stage of nonretrogression, and quickly realize unsurpassed perfect enlightenment without any remaining difficulty, they should repeatedly hear and retain the prajñāpāramitā, recite it, diligently cultivate it, correctly contemplate it, ask questions of their teachers, readily explain it for others, write it down, adorn it with various treasures, offer it in respect, and venerate and praise it.",
        "source": "T07n0220_540:0775c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0775c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等應作是念：『如來昔住菩薩地時，常勤修學如是般若波羅蜜多甚深義趣，證得無上正等菩提，我等亦應精勤修學如是般若波羅蜜多。",
        "translation": "Good men and good women, you should think, 'Thus did the Tathāgata always diligently cultivate the profound meaning of such prajñā-pāramitā when he was staying at the bodhisattva ground and realized unsurpassed perfect enlightenment; we should also diligently cultivate such prajñ-pāramitā.",
        "source": "T07n0220_540:0775c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我大師，我隨彼學所願當滿。』",
        "translation": "This is my great teacher, and I will fulfill my vow to follow his example.'",
        "source": "T07n0220_540:0775c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩若佛住世、若涅槃後，常應依止甚深般若波羅蜜多精勤修學。」",
        "translation": "If bodhisattvas, mahāsattvas, or nuns ever live in the world or after nirvāṇa, they should always rely on the profound perfection of wisdom and diligently train in it.\"",
        "source": "T07n0220_540:0775c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「若善男子、善女人等於深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說流布，或有書寫、眾寶嚴飾，復持種種上妙華鬘乃至燈明，供養恭敬、尊重讚歎。",
        "translation": "Śakra then again said to the Buddha, \"Suppose good sons and good women wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate the profound perfection of wisdom, widely expound it for sentient beings, disseminate it, write it down, adorn it with many treasures, and carry a variety of excellent flower garlands and even lamps, offering them respect and veneration, and praise them.",
        "source": "T07n0220_540:0775c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣得幾許福？」",
        "translation": "How much merit will these good sons and good women attain as a result?\"",
        "source": "T07n0220_540:0775c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「是善男子、善女人等所獲福聚，無量無邊、不可思議、不可稱計，算數、譬喻所不能及。",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"The merits gained by these good sons and good women are measureless and limitless, unfathomable and incalculable, and beyond the ability of calculation or metaphor.",
        "source": "T07n0220_540:0775c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0775c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等於諸如來般涅槃後，為供養佛設利羅故，以妙七寶起窣堵波，種種珍奇間雜嚴飾，復持種種天妙華鬘乃至燈明，盡其形壽供養恭敬、尊重讚歎。",
        "translation": "\"Suppose good men and good women, after the Tathāgatas' parinirvāṇa, make offerings to the Buddha's śarīra by creating a stūpa of marvelous seven treasures, adorned with various treasures and finery, and carrying a variety of marvelous flower garlands and even lamps from the gods, and they spend their whole lives offering support, veneration, respect, and praise.",
        "source": "T07n0220_540:0775c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Are these good men and good women able to obtain much merit as a result of this?\"",
        "source": "T07n0220_540:0776a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "The emperor explained, \"Very much!",
        "source": "T07n0220_540:0776a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_540:0776a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_540:0776a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，以增上慧審諦觀察。",
        "translation": "The Buddha told Kauśika, \"Are there good men and good women who, with a pure heart, respect, believe, and understand the profound meaning of this perfection of wisdom, wholeheartedly listen, retain, recite, diligently cultivate, and correctly contemplate it in order to pursue unsurpassed perfect enlightenment, and widely explain and reveal it for sentient beings, examining it with superior wisdom.",
        "source": "T07n0220_540:0776a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙。",
        "translation": "For the sake of making the right teaching long-lasting, for the sake of making the Buddha's eye uninterrupted, for the sake of making the right teaching not disappear, for the sake of taking in bodhisattvas and making them grow, and for the sake of making the world's pure eye for the teaching uninterrupted, they write these very profound prajñāpāramitā ornaments of many treasures, and they also carry a variety of excellent flower garlands, scattered incense, clothing, jewelry, banners, banners, and many wonderful things.",
        "source": "T07n0220_540:0776a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "珍奇、伎樂、燈明，供養恭敬、尊重讚歎。",
        "translation": "They offer up treasures, music, and lamps, respect, venerate, and praise them.",
        "source": "T07n0220_540:0776a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。",
        "translation": "The merits these good men and good women attain are immeasurable and incalculable.",
        "source": "T07n0220_540:0776a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0776a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "置此一事。",
        "translation": "\"Let's place this one thing here.",
        "source": "T07n0220_540:0776a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等於諸如來般涅槃後，為供養佛設利羅故，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是充滿一贍部洲、或四大洲、或小千界、或中千界、或復三千大千世界，皆持種種天妙華鬘乃至燈明，盡其形壽供養恭敬、尊重讚歎。",
        "translation": "Suppose good sons and good women, after the Tathāgatas' parinirvāṇa, make offerings to the Buddha Śāriputra by creating a stūpa of seven wonderful treasures, decorated with a variety of treasures, and thus filling one of the five continents, four continents, a small thousand worlds, a medium thousand worlds, or another 3,000 great thousand worlds with a variety of marvelous divine flower garlands and lamps that will last their whole lives, offering support, respect, and praise them.",
        "source": "T07n0220_540:0776a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Are these good men and good women able to obtain much merit as a result of this?\"",
        "source": "T07n0220_540:0776a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "The emperor explained, \"Very much!",
        "source": "T07n0220_540:0776a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_540:0776a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_540:0776a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，以增上慧審諦觀察。",
        "translation": "The Buddha told Kauśika, \"Are there good men and good women who, with a pure heart, respect, believe, and understand the profound meaning of this perfection of wisdom, wholeheartedly listen, retain, recite, diligently cultivate, and correctly contemplate it in order to pursue unsurpassed perfect enlightenment, and widely explain and reveal it for sentient beings, examining it with superior wisdom.",
        "source": "T07n0220_540:0776a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，供養恭敬、尊重讚歎。",
        "translation": "For the sake of making the right teaching long-lasting, for the sake of making the Buddha's eye uninterrupted, for the sake of making the right teaching not disappear, for the sake of taking in bodhisattvas and making them grow, and for the sake of making the world's pure eye for the teaching uninterrupted, they write such adornments of the many treasures of the profound prajñāparamitā, and they also carry a variety of excellent flower garlands, scattered incense, clothing, jewelry, banners, banners and shrouds, and many wonderful, precious things, music, and lamps that they offer, venerate, and praise.",
        "source": "T07n0220_540:0776a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。",
        "translation": "The merits these good men and good women attain are immeasurable and incalculable.",
        "source": "T07n0220_540:0776b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0776b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "置如是事。",
        "translation": "\"Suppose this is the case.",
        "source": "T07n0220_540:0776b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使於此贍部洲中一切有情，或四大洲一切有情，或小千界一切有情，或中千界一切有情，或復三千大千世界一切有情，各於如來般涅槃後，為供養佛設利羅故，以妙七寶各各起一大窣堵波，種種珍奇間雜嚴飾，皆持種種天妙華鬘乃至燈明，盡其形壽各各於自窣堵波所供養恭敬、尊重讚歎。",
        "translation": "Suppose all sentient beings on the alphabetical continent, or all sentient beings on the four continents, or all sentient beings in the small thousand worlds, or all sentient beings in the medium thousand worlds, or all sentient beings in the 3,000 great thousand worlds, after the Tathāgata's parinirvāṇa, each made offerings to the Buddha's śarīra by creating a large stūpa of seven wonderful treasures, decorated with a variety of rare and indirect adornments, and carrying a variety of marvelous divine flower garlands and even lamps, and each made offerings to, venerated, and praised their stūpa for the rest of their lives.",
        "source": "T07n0220_540:0776b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此贍部洲、或四大洲、或小千界、或中千界、或大千界諸有情類，由是因緣獲福多不？」",
        "translation": "Are these categories of sentient beings in the Jambudvīpa, or in the four continents, or in the small thousand, medium thousand, or great thousand realms, greatly endowed with good fortune because of these causes and conditions?\"",
        "source": "T07n0220_540:0776b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "The emperor explained, \"Very much!",
        "source": "T07n0220_540:0776b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_540:0776b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_540:0776b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，以增上慧審諦觀察。",
        "translation": "The Buddha told Kauśika, \"Are there good men and good women who, with a pure heart, respect, believe, and understand the profound meaning of this perfection of wisdom, wholeheartedly listen, retain, recite, diligently cultivate, and correctly contemplate it in order to pursue unsurpassed perfect enlightenment, and widely explain and reveal it for sentient beings, examining it with superior wisdom.",
        "source": "T07n0220_540:0776b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，供養恭敬、尊重讚歎。",
        "translation": "For the sake of making the right teaching long-lasting, for the sake of making the Buddha's eye uninterrupted, for the sake of making the right teaching not disappear, for the sake of taking in bodhisattvas and making them grow, and for the sake of making the world's pure eye for the teaching uninterrupted, they write such adornments of the many treasures of the profound prajñāparamitā, and they also carry a variety of excellent flower garlands, scattered incense, clothing, jewelry, banners, banners and shrouds, and many wonderful, precious things, music, and lamps that they offer, venerate, and praise.",
        "source": "T07n0220_540:0776b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。",
        "translation": "The merits these good men and good women attain are immeasurable and incalculable.",
        "source": "T07n0220_540:0776b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0776b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "置如是事。",
        "translation": "\"Suppose this is the case.",
        "source": "T07n0220_540:0776b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使於此贍部洲中諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿贍部洲；或四大洲諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿四大洲；或小千界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿小千界；或中千界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿中千界；或復三千大千世界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿大千界。",
        "translation": "假使於此贍部洲中諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿贍部洲；或四大洲諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿四大洲；或小千界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿小千界；或中千界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿中千界；或復三千大千世界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿大千界。",
        "source": "T07n0220_540:0776b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸人，各持種種天妙華鬘乃至燈明，或經一劫或一劫餘，各各於自窣堵波所，供養恭敬、尊重讚歎。",
        "translation": "Each of these people carries a variety of the gods' wonderful flower garlands and even lamps, and either for one eon or more than one eon, they each make offerings to their own stūpa, venerate, respect, and praise it.",
        "source": "T07n0220_540:0776c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此贍部洲、或四大洲、或小千界、或中千界、或大千界諸有情類，由是因緣獲福多不？」",
        "translation": "Are these categories of sentient beings in the Jambudvīpa, or in the four continents, or in the small thousand, medium thousand, or great thousand realms, greatly endowed with good fortune because of these causes and conditions?\"",
        "source": "T07n0220_540:0776c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "The emperor explained, \"Very much!",
        "source": "T07n0220_540:0776c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多！",
        "translation": "very much!",
        "source": "T07n0220_540:0776c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Well gone!\"",
        "source": "T07n0220_540:0776c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，以增上慧審諦觀察。",
        "translation": "The Buddha told Kauśika, \"Are there good men and good women who, with a pure heart, respect, believe, and understand the profound meaning of this perfection of wisdom, wholeheartedly listen, retain, recite, diligently cultivate, and correctly contemplate it in order to pursue unsurpassed perfect enlightenment, and widely explain and reveal it for sentient beings, examining it with superior wisdom.",
        "source": "T07n0220_540:0776c21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，供養恭敬、尊重讚歎。",
        "translation": "For the sake of making the right teaching long-lasting, for the sake of making the Buddha's eye uninterrupted, for the sake of making the right teaching not disappear, for the sake of taking in bodhisattvas and making them grow, and for the sake of making the world's pure eye for the teaching uninterrupted, they write such adornments of the many treasures of the profound prajñāparamitā, and they also carry a variety of excellent flower garlands, scattered incense, clothing, jewelry, banners, banners and shrouds, and many wonderful, precious things, music, and lamps that they offer, venerate, and praise.",
        "source": "T07n0220_540:0776c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。」",
        "translation": "These good sons and good women have attained merits that are immeasurable and incalculable.\"",
        "source": "T07n0220_540:0777a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「如是！",
        "translation": "Thereupon, Śakra then said to the Buddha, \"So it is!",
        "source": "T07n0220_540:0777a03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0777a04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0777a04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well gone!",
        "source": "T07n0220_540:0777a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等供養恭敬、尊重讚歎甚深般若波羅蜜多，當知則為供養恭敬、尊重讚歎過去、未來、現在諸佛一切智智。",
        "translation": "\"If good men and good women make offerings to, venerate, and praise the profound perfection of wisdom, you should know that they are making offerings to, venerating, and praising the past, future, and present buddhas for their omniscience.",
        "source": "T07n0220_540:0777a04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T07n0220_540:0777a07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且置所說三千大千世界一切有情，為供養佛設利羅故，各於如來般涅槃後，以妙七寶起窣堵波。",
        "translation": "\"Suppose it were explained that all sentient beings in a world of 3,000 great one-thousand worlds each arouse a stūpa with seven wonderful treasures after the Tathāgata's parinirvāṇa in order to make offerings to the Buddha Śāriputra.",
        "source": "T07n0220_540:0777a07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使十方各如殑伽沙等世界一切有情，非前非後皆得為人，此一一人各於如來般涅槃後，為供養佛設利羅故，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一各滿十方殑伽沙等諸佛世界，各持種種天妙華鬘乃至燈明，或經一劫或一劫餘，供養恭敬、尊重讚歎。",
        "translation": "Suppose there were all sentient beings in each of the sands of the ten directions, whether former or subsequent, who could become human beings, and each of them, after the Tathāgata's parinirvāṇa, raises a rustle with seven marvelous treasures, decorated with various treasures and finery, and each of them thus fills the sands of the buddha-worlds in the ten directions with various kinds of heavenly, marvelous flower garlands and even lamps, either for an eon or for more than an eon, to offer them respect, veneration, and praise.",
        "source": "T07n0220_540:0777a09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸有情由此因緣所獲福聚，雖復無量而復有餘。",
        "translation": "Although the merits gained by these sentient beings as a result of these causes are countless, there are still others.",
        "source": "T07n0220_540:0777a15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，以增上慧審諦觀察。",
        "translation": "Regarding the profound meaning of this perfection of wisdom, good sons and good women respect, revere, and understand it with a pure heart, sincerely listen, retain, recite, diligently cultivate, and correctly contemplate it in order to pursue unsurpassed correct enlightenment, and widely explain and instruct it for sentient beings, examining it with superior wisdom.",
        "source": "T07n0220_540:0777a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，供養恭敬、尊重讚歎。",
        "translation": "For the sake of making the right teaching long-lasting, for the sake of making the Buddha's eye uninterrupted, for the sake of making the right teaching not disappear, for the sake of taking in bodhisattvas and making them grow, and for the sake of making the world's pure eye for the teaching uninterrupted, they write such adornments of the many treasures of the profound prajñāparamitā, and they also carry a variety of excellent flower garlands, scattered incense, clothing, jewelry, banners, banners and shrouds, and many wonderful, precious things, music, and lamps that they offer, venerate, and praise.",
        "source": "T07n0220_540:0777a21_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於彼無量無邊不可思議、不可稱計，算數、譬喻所不能及。」",
        "translation": "The merits attained by these good sons and good women are unfathomable, incalculable, and beyond calculation, and cannot be matched by metaphors.\"",
        "source": "T07n0220_540:0777a26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T07n0220_540:0777a28_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0777a29_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_540:0777a29_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777a29_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，於深般若波羅蜜多所獲福聚無量無邊不可思議、不可稱計，算數、譬喻所不能及。",
        "translation": "\"The merits gained by these good sons and good women from the profound perfection of wisdom are unfathomable, limitless, and incalculable, and cannot be calculated or compared with metaphors.",
        "source": "T07n0220_540:0777a29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777b03_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777b03_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多能生如來一切智智，一切如來一切智智，能生諸佛設利羅故。",
        "translation": "The profound prajñāpāramitā can give rise to the tathāgatas' omniscience and the omniscience of all tathāgatas can give rise to the buddha-śarīra.",
        "source": "T07n0220_540:0777b03_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以是故，憍尸迦！",
        "translation": "\"Therefore, Kauśika!",
        "source": "T07n0220_540:0777b05_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，能於般若波羅蜜多甚深義趣，以清淨心恭敬信解，為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，以增上慧審諦觀察。",
        "translation": "\"If good men and good women can respect, honor, and understand the profound meaning of the perfection of wisdom with a pure heart, wholeheartedly listen, retain, recite, diligently cultivate, and correctly contemplate it in order to pursue unsurpassed correct enlightenment, they should explain and reveal it to sentient beings in detail and examine it with superior wisdom.",
        "source": "T07n0220_540:0777b05_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，供養恭敬、尊重讚歎。",
        "translation": "For the sake of making the right teaching long-lasting, for the sake of making the Buddha's eye uninterrupted, for the sake of making the right teaching not disappear, for the sake of taking in bodhisattvas and making them grow, and for the sake of making the world's pure eye for the teaching uninterrupted, they write such adornments of the many treasures of the profound prajñāparamitā, and they also carry a variety of excellent flower garlands, scattered incense, clothing, jewelry, banners, banners and shrouds, and many wonderful, precious things, music, and lamps that they offer, venerate, and praise.",
        "source": "T07n0220_540:0777b09_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德於前所造諸窣堵波及供養福，百倍為勝，千倍為勝，乃至鄔波尼殺曇倍亦復為勝。」",
        "translation": "The merit gained by these good sons and good women is one hundred times greater than the merits of the previous stūpas and offerings, one thousand times greater, and even more than the upāniṣada.\"",
        "source": "T07n0220_540:0777b15_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中四萬天子，同聲共白天帝釋言：「大仙！",
        "translation": "At that point, 40,000 celestials in the assembly spoke with one voice to Indra, saying, \"Great sage!",
        "source": "T07n0220_540:0777b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此甚深般若波羅蜜多，應當聽聞、受持、讀誦、精勤修學、如理思惟，及廣為他分別解說，供養恭敬、尊重讚歎。",
        "translation": "You should hear, retain, recite, diligently cultivate, and correctly contemplate this profound prajñāpāramitā, explain it in detail for others, and offer support, respect, and veneration to them.",
        "source": "T07n0220_540:0777b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能於此甚深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟，及廣為他分別解說，供養恭敬、尊重讚歎，則令一切惡法損減、善法增益。」",
        "translation": "If you wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate this profound perfection of wisdom, widely discern and explain it for others, and offer support, respect, and praise it, it will cause all bad qualities to decrease and good qualities to increase.\"",
        "source": "T07n0220_540:0777b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「汝應於此甚深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟，及廣為他分別解說，供養恭敬、尊重讚歎。",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, \"You should wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate this profound prajñāpāramitā, explain it in detail for others, and offer support, honor, and praise it with respect.",
        "source": "T07n0220_540:0777b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若阿素洛及惡朋黨起如是念：『我等當與三十三天共興戰諍。』",
        "translation": "Suppose Asura and his evil friends think, 'We will join the Trāyastriṃśa gods in a war.'",
        "source": "T07n0220_540:0777b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，汝等諸天眷屬，應各至誠誦念如是甚深般若波羅蜜多，供養恭敬、尊重讚歎。",
        "translation": "At that point, you members of the celestials' retinue should each sincerely recite this profound prajñāpāramitā, offering support, respect, and praise.",
        "source": "T07n0220_540:0777c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，阿素洛及彼朋黨所起惡心即皆息滅。」",
        "translation": "That will put an end to the evil thoughts that Asura and her cohorts have.'\"",
        "source": "T07n0220_540:0777c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋即白佛言：「甚深般若波羅蜜多是大神呪，是大明呪，是無上呪，是無等等呪，是一切呪王，最尊最勝、最上最妙，能伏一切，不為一切之所降伏。",
        "translation": "Thereupon, Śakra Devānām-Indra said to the Buddha, \"This is a very profound prajñāpāramitā that's a great super dhāraṇī, a great incantation, an unsurpassed dhāraṇī, an unequalled dhāraṇī, and the king of all dhāras, the most honored, the most excellent, the highest, and the most sublime, which subdues all things and isn't subdued by any of them.",
        "source": "T07n0220_540:0777c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多能滅一切惡不善法，能滿一切殊勝善法。」",
        "translation": "The profound perfection of wisdom can cease all bad and unskillful qualities and can fulfill all excellent good qualities.\"",
        "source": "T07n0220_540:0777c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T07n0220_540:0777c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0777c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T07n0220_540:0777c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去未來現在諸佛，皆依如是甚深般若波羅蜜多大神呪王，證得無上正等菩提，轉妙法輪度有情眾。",
        "translation": "All the buddhas of the past, future, and present relied on this great incantation king of the profound prajñāpāramitā to realize unsurpassed perfect enlightenment and turn the wonderful wheel of the Dharma to save sentient beings.",
        "source": "T07n0220_540:0777c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦依此甚深般若波羅蜜多大神呪王，證得無上正等菩提，為諸天、人說無上法。",
        "translation": "I also relied on this great, profound, prajñāpāramitā, the king of great incantations, to realize unsurpassed, correct, and equal enlightenment and to teach the unsurpassed Dharma to gods and humans.",
        "source": "T07n0220_540:0777c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0777c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依深般若波羅蜜多大神呪王，世間便有覺支相應十善業道、若四靜慮、若四無量、若四無色定、若三十七菩提分法、若六神通、若餘無量無邊佛法。",
        "translation": "\"By relying on the great spell-king of profound prajñāpāramitā, the world will then have the ten good actions associated with the factors of awakening, the four meditations, the four immeasurables, the four formless concentrations, the thirty-seven factors of enlightenment, the six supernormal powers, and the other measureless and limitless Buddha-teachings.",
        "source": "T07n0220_540:0777c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以要言之，八萬四千諸善法蘊，無不皆依甚深般若波羅蜜多大神呪王出現於世。",
        "translation": "In a nutshell, the 84,000 aggregates of good qualities all appear in the world based on the profound prajñāpāramitā, the great incantation king.",
        "source": "T07n0220_540:0777c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切佛智、自然起智、不思議智，皆依般若波羅蜜多大神呪王出現於世。",
        "translation": "All buddha-wisdom, naturally-arisen wisdom, and inconceivable wisdom appear in the world based on the great dhāraṇī king of prajñāpāramitā.",
        "source": "T07n0220_540:0777c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依深般若波羅蜜多大神呪王，世間便有菩薩出現；依菩薩故，世間便有覺支相應十善業道、若四靜慮、若四無量、若四無色定、若三十七菩提分法、若六神通、若餘無量無邊佛法皆得出現。",
        "translation": "Based on the profound prajñāpāramitā, a great incantation king, a bodhisattva will appear in the world, and based on that bodhisattva, the ten good activities associated with the factors of awakening, the four meditations, the four immeasurables, the four formless concentrations, the thirty-seven factors of enlightenment, the six supernormal powers, and the other measureless and limitless Buddha-teachings will all appear in the world.",
        "source": "T07n0220_540:0777c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來、應、正等覺不出世時，唯有菩薩由先所聞甚深般若波羅蜜多等流勢力，成就殊勝方便善巧，哀愍世間諸有情故，施設建立覺支相應十善業道、若四靜慮、若四無量、若四無色定、若三十七菩提分法、若六神通、若餘無量無邊佛法。",
        "translation": "When the Tathāgatas, Arhats, and Fully Awakened Ones don't emerge from the world, only bodhisattvas achieve extraordinary skillful means and skillful means because of the power of the profound prajñāpāramitā equipoise they've heard before, and they compassionately establish the ten good courses of action associated with the factors of awakening, the four meditations, the four immeasurable, the four formless concentrations, the thirty-seven factors of enlightenment, the six supernormal powers, and the other measureless and limitless Buddha-teachings.",
        "source": "T07n0220_540:0777c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如夜分因滿月輪光明照觸，星宿、藥等隨其勢力皆得增盛。",
        "translation": "It's like when the full moon shines brightly during the nighttime divisions, and the stars, medicines, and so forth are all strengthened according to their momentum.",
        "source": "T07n0220_540:0778a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來、應、正等覺，前已滅度，正法隱沒，後未出時，世間所有法行、妙行，一切皆依菩薩出現。",
        "translation": "Thus, when the Tathāgata, the Worthy One, and the Perfectly Enlightened One had previously ceased and the true teaching had disappeared and hadn't yet emerged, all the world's Dharma practices and marvelous actions relied on the bodhisattva for their appearance.",
        "source": "T07n0220_540:0778a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所有方便善巧，皆依般若波羅蜜多而得成辦。",
        "translation": "All of the bodhisattvas' skillful means and techniques are accomplished based on the perfection of wisdom.",
        "source": "T07n0220_540:0778a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故般若波羅蜜多是諸殊勝善法根本。",
        "translation": "Therefore, the perfection of wisdom is the root of all excellent good qualities.",
        "source": "T07n0220_540:0778a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T07n0220_540:0778a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等於深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，當得成就現在、未來世、出世間功德勝利。」",
        "translation": "If good sons and good women wholeheartedly hear and retain the profound perfection of wisdom, memorize it, recite it, diligently cultivate it, correctly contemplate it, write it down, explain it, and disseminate it, they will attain superior merit in the present, future, and transmundane realms.\"",
        "source": "T07n0220_540:0778a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「是善男子、善女人等，云何成就現在未來世、出世間功德勝利？」",
        "translation": "Thereupon, Śakra then said to the Buddha, \"Good sons and good women, what will be the accomplishment of merits that are superior in the present, future, and transmundane realms?\"",
        "source": "T07n0220_540:0778a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「是善男子、善女人等，現在不為一切毒藥、厭禱、呪術之所傷害，火不能燒，水不能溺，諸刀杖等亦不能害，乃至不為四百四病之所殀歿，唯除先世定業異熟現世應受。",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, \"Good sons and good women, we won't be harmed by any poison, prayer or curse, won't be burned by fire, won't be drowned by water, won't be harmed by swords or other things, and won't die from 400 or 400 illnesses, except for the ripening of past lives' karma in the present life.",
        "source": "T07n0220_540:0778a14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等若遭官事、怨賊逼迫，至心誦念甚深般若波羅蜜多，若至其所終不為彼譴罰加害，欲求其短皆不能得。",
        "translation": "\"If good sons and good women are persecuted by officials or enemies and wholeheartedly recite the profound perfection of wisdom, then they won't be condemned or harmed by them if they go to their place, and they won't be able to find a shortcoming if they want to.",
        "source": "T07n0220_540:0778a19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0778a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多威神勢力法令爾故。",
        "translation": "\"Because of the profound prajñāpāramitā's authoritative power, it's possible.",
        "source": "T07n0220_540:0778a22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，若有欲至國王、王子、大臣等處，至心誦念甚深般若波羅蜜多，定為王等歡喜問訊、供養恭敬、尊重讚歎。",
        "translation": "\"Good men and good women, if you want to go to a king, prince, minister, or other place and wholeheartedly recite the profound perfection of wisdom, you will surely be greeted joyfully by the king and others, offered support and respect, and praised with respect.",
        "source": "T07n0220_540:0778a23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0778a26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等所誦般若波羅蜜多，常於有情引發種種慈悲事故，由此因緣，曠野、險難、人非人等，諸求短者皆不得便。",
        "translation": "This is the prajñāpāramitā that good men and good women recite, which always produces various compassionate events for sentient beings, and as a result, those seeking shortages in wildernesses, difficult situations, humans and non-humans alike aren't able to get by.",
        "source": "T07n0220_540:0778a26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，當得成就諸如是等所有現在功德勝利。",
        "translation": "These good men and good women will attain the present merits and benefits of such-and-such.",
        "source": "T07n0220_540:0778a29_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T07n0220_540:0778b02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等隨所生處，常不遠離諸勝善法，不墮惡趣，饒益有情，漸能證得一切智智。",
        "translation": "\"Whereever these good men and good women are born, they're always free of excellent good qualities, don't fall into bad destinies, benefit sentient beings, and gradually realize the knowledge of all cognitions.",
        "source": "T07n0220_540:0778b02_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778b04_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，當得成就諸如是等所有未來功德勝利。」",
        "translation": "These good sons and good women will attain the future merits and benefits of such and such.\"",
        "source": "T07n0220_540:0778b04_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾多外道梵志，欲求佛過來詣佛所。",
        "translation": "At the time, a large group of non-Buddhist priests wanted to seek the Buddha's rebirth and came to visit him.",
        "source": "T07n0220_540:0778b05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋見已，念言：「今此眾多外道梵志，來趣法會伺求佛短，將非般若留難事耶？",
        "translation": "When the god Śakra saw this, he thought, \"Wouldn't this multitude of non-Buddhist priests who have come to the Dharma assembly to seek the shortcomings of the Buddha be a matter of difficulty for Prajñāpradīpa?",
        "source": "T07n0220_540:0778b06_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當誦念從佛所受甚深般若波羅蜜多，令彼邪徒復道而去。」",
        "translation": "I will recite the recitation of the profound perfection of wisdom that I received from the Buddha, so that that mistaken person will return to the path and leave.\"",
        "source": "T07n0220_540:0778b08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念已便誦甚深般若波羅蜜多。",
        "translation": "After reciting that, he then recited the profound prajñā-pāramitā.",
        "source": "T07n0220_540:0778b10_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是眾多外道梵志遙申敬禮、右遶世尊復道而去。",
        "translation": "That large group of non-Buddhist priests then paid homage to the Bhagavān, circled him to his right, resumed the path, and departed.",
        "source": "T07n0220_540:0778b10_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子見已念言：「彼有何緣適來還去？」",
        "translation": "When Śāriputra saw this, he thought, \"What are the reasons why they've come and gone?\"",
        "source": "T07n0220_540:0778b12_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知其意，告舍利子：「彼諸外道來求我失，由天帝釋誦念般若波羅蜜多令彼還去。",
        "translation": "Knowing what he meant, the Buddha told Śāriputra, \"Those non-Buddhists who came to seek my loss were made to return by the god Śakra's recitation of the prajñāpāramitā.",
        "source": "T07n0220_540:0778b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_540:0778b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我都不見彼諸外道有少白法，唯懷惡心為求我過來至我所。",
        "translation": "I don't even see those non-Buddhists who have a little white dharma and only have bad intentions about coming to me.",
        "source": "T07n0220_540:0778b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T07n0220_540:0778b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我都不見一切世間有諸天魔及外道等，有情之類說般若時懷勃惡心來求得便，般若威力無能壞故。」",
        "translation": "I don't see any gods, demons, non-Buddhists, or other sentient beings in the world who come seeking an advantage over others with harsh intentions when they teach prajñā, because prajñā's power can't destroy them.\"",
        "source": "T07n0220_540:0778b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，惡魔竊作是念：「今佛四眾前後圍遶，欲、色界天皆來集會，宣說般若波羅蜜多。",
        "translation": "At the time, the demons secretly thought, \"Now, the Buddha's four groups of people are surrounded by him, and the gods of the desire realm and form realm have come to assemble and preach the perfection of wisdom.",
        "source": "T07n0220_540:0778b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中必有諸大菩薩，親於佛前受菩提記，當得無上正等菩提，轉妙法輪空我境界。",
        "translation": "There must be some great bodhisattvas here who have personally received the prediction of enlightenment from the Buddha and will attain unsurpassed perfect enlightenment and turn the wonderful Dharma wheel into the realm of emptiness and self.",
        "source": "T07n0220_540:0778b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當往至破壞其眼。」",
        "translation": "I will go there and destroy their eyes.\"",
        "source": "T07n0220_540:0778b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，化作四軍，奮威勇銳來詣佛所。",
        "translation": "After he had this thought, he transformed into four armies that rallied with authority and courage and went to the Buddha.",
        "source": "T07n0220_540:0778b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋見已念言：「將非惡魔化作斯事，欲來惱佛并與般若波羅蜜多而作留難。",
        "translation": "When he saw them, the god Indra thought, \"Wouldn't this be something bad that Māra would do in order to trouble the Buddha and make things difficult for him and the Prajñāparamitra?",
        "source": "T07n0220_540:0778b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0778b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是四軍嚴飾殊麗，諸王軍眾皆不能及，定是惡魔之所化作。",
        "translation": "These four armies are so resplendent and beautiful that the king's army couldn't match them, but they must have been created by a bad demon.",
        "source": "T07n0220_540:0778b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡魔長夜伺求佛短，壞諸有情所修勝事，我當誦念從佛所受甚深般若波羅蜜多，令彼惡魔復道而去。」",
        "translation": "For a long time, that evil demon has been longing for the shortcomings of the Buddha and has destroyed the excellent things that sentient beings cultivate, so I will recite the recitation of the profound prajñāpāramitā that I received from the Buddha, which will cause that evil demon to return to the path and leave.\"",
        "source": "T07n0220_540:0778b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋念已，便誦甚深般若波羅蜜多，於是惡魔漸退而去，甚深般若波羅蜜多大神呪王威力逼故。",
        "translation": "After he remembered this, the god Śakra then recited the Vātsīpa-prajñāpāramitā, and the evil demon gradually retreated and left because of the mighty power of the Vātsīpa-prajñāpāramitā great incantation king.",
        "source": "T07n0220_540:0778c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有無量三十三天俱時化作天妙音華，踊身空中而散佛上，合掌恭敬同白佛言：「願此般若波羅蜜多在贍部洲人中久住，乃至般若波羅蜜多在贍部洲人間流布。",
        "translation": "At the time, measureless Trāyastriṃśa gods simultaneously transformed into heavenly flowers of wonderful sound, rose up in the air, scattered over the Buddha, joined their palms in respect, and said to the Buddha, \"May this prajñāpāramitā be long-lasting among the people of Jambudvīpa, even as prajñāpāramitā spreads among the people of Jambudvīpa.",
        "source": "T07n0220_540:0778c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是處佛、法、僧寶常不滅沒，饒益世間令獲殊勝利益安樂。」",
        "translation": "You should know that this is a place where the buddhas, Dharma, and saṃgha treasures never perish and enrich the world to obtain excellent benefits and well-being.\"",
        "source": "T07n0220_540:0778c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼諸天復各化作天妙音華而散佛上，重白佛言：「若諸有情修行般若波羅蜜多，一切惡魔及彼眷屬伺求其短不能得便。」",
        "translation": "The gods then each transformed themselves into a heavenly, marvelous-sounding flower and scattered it on top of the Buddha, repeating to him, \"If sentient beings cultivate the perfection of wisdom, all the evil demons and their retinues who seek their shortcomings won't be able to get an advantage over them.\"",
        "source": "T07n0220_540:0778c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「若諸有情但聞般若波羅蜜多功德名字，當知如是諸有情類，已曾供養無量諸佛，於諸佛所發弘誓願，多集善根能成是事，非從少小善根中來，況能聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布、供養恭敬、尊重讚歎！",
        "translation": "Tendai then said to the Buddha, \"If sentient beings only hear the name of the merit of prajñāpāramitā, they should know that such sentient beings have made offerings to measureless buddhas, made great vows to the buddhas, and have gathered many good roots to accomplish this task, not from a few small good roots, let alone being able to hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, widely disseminate, offer support, respect, and praise them!",
        "source": "T07n0220_540:0778c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知如是諸有情類，功德智慧不可思議。",
        "translation": "You should know that such a category of sentient beings has unfathomable qualities and unfathomable wisdom.",
        "source": "T07n0220_540:0778c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0778c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲求諸佛一切智智，應於般若波羅蜜多理趣中求，如有情類欲求大寶，應於大海方便勤求，如是欲求一切智智，應於般若波羅蜜多理趣中求。」",
        "translation": "If you want to pursue the buddhas' omniscience, you should pursue it in the principle and destiny of prajñāpāramitā; just as sentient beings who want to pursue great treasures should diligently pursue them in the ocean of skillful means, so they want to pursue omniscience, and they should pursue it in the principle and destiny of prajñpāramitā.\"",
        "source": "T07n0220_540:0778c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T07n0220_540:0778c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0778c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T07n0220_540:0778c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛所得一切智智，皆依般若波羅蜜多而得成辦。",
        "translation": "All the cognition and knowledge obtained by the buddhas depends on the perfection of wisdom.",
        "source": "T07n0220_540:0778c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故般若波羅蜜多，是諸佛法最勝根本。」",
        "translation": "Therefore, prajñā-pāramitā is the most excellent root of all the buddha-teachings.\"",
        "source": "T07n0220_540:0778c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，慶喜便白佛言：「世尊！",
        "translation": "It was then that Heiji said to the Buddha, \"Bhagavān!",
        "source": "T07n0220_540:0778c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣不讚布施、淨戒、安忍、精進、靜慮、波羅蜜多及餘功德，唯讚般若波羅蜜多？」",
        "translation": "What are the reasons for not praising generosity, pure morality, patience, effort, meditation, the perfections, and other virtues but praising the perfections of prajñā?\"",
        "source": "T07n0220_540:0778c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「由此般若波羅蜜多能與前五波羅蜜多及餘功德為尊為導，故我偏讚。",
        "translation": "The Buddha told Heiji, \"Thus, the perfection of wisdom is honored and guided by the five preceding perfections and the other virtues, so I give it partial praise.",
        "source": "T07n0220_540:0778c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "\"Furthermore, Śrī Siṃha!",
        "source": "T07n0220_540:0778c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0778c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不迴向一切智智，而修布施乃至般若，此可名為真修布施乃至般若波羅蜜多不？」",
        "translation": "If someone cultivates generosity and even prajñā without dedicating themselves to omniscience, can this be called truly cultivating generosity and even prajñāpāramitā?\"",
        "source": "T07n0220_540:0778c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "He said, \"No!",
        "source": "T07n0220_540:0779a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要由迴向一切智智，而修布施乃至般若，乃可名為真修布施乃至般若波羅蜜多。」",
        "translation": "Only by dedicating oneself to the wisdom of omniscience and cultivating generosity ... prajñāpāramitā can one be called someone who truly cultivates generosity ... prajñpāramitā.\"",
        "source": "T07n0220_540:0779a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Śrī Siṃha, \"What do you think?",
        "source": "T07n0220_540:0779a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不迴向一切智智，而修布施乃至般若，如是所修得名布施等波羅蜜多不？」",
        "translation": "If someone doesn't dedicate themselves to the knowledge of all cognitions and cultivates generosity and even prajñā, can such cultivation be called generosity and other pāramitā?\"",
        "source": "T07n0220_540:0779a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "He said, \"No!",
        "source": "T07n0220_540:0779a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要由迴向一切智智，而修布施乃至般若，如是所修乃得布施等波羅蜜多名。」",
        "translation": "It's by dedicating oneself to the knowledge of all cognitions and cultivating generosity up to prajñāpāramitā that one attains the perfection of generosity and so forth through such cultivation.\"",
        "source": "T07n0220_540:0779a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Śrī Siṃha, \"What do you think?",
        "source": "T07n0220_540:0779a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不迴向一切智智，而修善根，如是善根得究竟不？」",
        "translation": "If someone cultivates good roots without dedicating themselves to the knowledge of all cognitions, will such good roots ultimately obtain?\"",
        "source": "T07n0220_540:0779a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "He said, \"No!",
        "source": "T07n0220_540:0779a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要由迴向一切智智，而修善根，如是善根乃得究竟。」",
        "translation": "It's by dedicating oneself to the knowledge of all things and cultivating good roots that one will attain the ultimate good root.\"",
        "source": "T07n0220_540:0779a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Śrī Siṃha, \"What do you think?",
        "source": "T07n0220_540:0779a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離般若波羅蜜多為能真迴向一切智智不？」",
        "translation": "If we part with the perfection of wisdom, can we truly dedicate ourselves to the cognition of all knowables?\"",
        "source": "T07n0220_540:0779a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "He said, \"No!",
        "source": "T07n0220_540:0779a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要有般若波羅蜜多乃真迴向一切智智。」",
        "translation": "Only when there's prajñā-pāramitā will we truly return to the knowledge of everything.\"",
        "source": "T07n0220_540:0779a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Śrī Siṃha, \"What do you think?",
        "source": "T07n0220_540:0779a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多威神功德可思議不？」",
        "translation": "Is the awesome power of the profound perfection of wisdom to be conceived?\"",
        "source": "T07n0220_540:0779a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "He said, \"No!",
        "source": "T07n0220_540:0779a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多威神功德不可思議，諸餘善根皆不能及。」",
        "translation": "The profound prajñāpāramitā's awesome power and merit are unfathomable, and no other good root can match it.\"",
        "source": "T07n0220_540:0779a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「由此因緣，我說般若波羅蜜多能與前五波羅蜜多及餘功德為尊為導，能令前五波羅蜜多及餘功德究竟圓滿，故我偏讚。",
        "translation": "The Buddha told Revelation, \"Because of this, I say that the perfection of wisdom is both honored and guided by the first five perfections and the other virtues, and it causes the first five perfections and the other virtues to be completely consummated, so I'm partial to praising it.",
        "source": "T07n0220_540:0779a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若讚般若波羅蜜多，亦讚前五波羅蜜多及餘功德。」",
        "translation": "If you praise the perfection of wisdom, you'll also praise the first five perfections and their remaining virtues.\"",
        "source": "T07n0220_540:0779a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，慶喜復白佛言：「云何迴向一切智智，而修布施乃至般若波羅蜜多及餘功德？」",
        "translation": "At that point, Qixi again said to the Buddha, \"How do you dedicate yourself to the wisdom of omniscience and cultivate generosity up to the perfection of prajñāpāramitā and the remaining virtues?\"",
        "source": "T07n0220_540:0779a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「以無二為方便、無生為方便、無所得為方便，迴向一切智智，應修布施乃至般若波羅蜜多及餘功德。」",
        "translation": "The Buddha told Qingshi, \"By making nonduality the method, nonproduction the method, and nonacquisition the method, you should cultivate generosity ... prajñāpāramitā and its remaining merits in order to dedicate yourself to the wisdom of all things.\"",
        "source": "T07n0220_540:0779a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽慶喜復白佛言：「以何無二為方便、無生為方便、無所得為方便，迴向一切智智，應修布施乃至般若波羅蜜多及餘功德？」",
        "translation": "Guishou Qingxi then said to the Buddha, \"What is the method of nonduality, the method of nonproduction, and the method of nonacquisition that leads to the cognition of all things and that cultivates the virtues of generosity and even prajñāparamitā and the remainder?\"",
        "source": "T07n0220_540:0779a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慶喜：「以色乃至識無二為方便、無生為方便、無所得為方便，迴向一切智智，應修布施乃至般若波羅蜜多及餘功德。",
        "translation": "The Buddha told Śrī Siṃha: \"By making it skillful that form and even consciousness are nondual, unborn, and unobtained, and by dedicating oneself to the wisdom of omniscience, one should cultivate the virtues of generosity, even prajñāpāramitā, and the rest.",
        "source": "T07n0220_540:0779b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以色等法皆性空故，色等性空與布施等皆無二故。",
        "translation": "It's because form and other things are empty in nature, and because form and other things are empty in nature and generosity and so forth are not two.",
        "source": "T07n0220_540:0779b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慶喜當知！",
        "translation": "You should know this, Rejoice!",
        "source": "T07n0220_540:0779b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由深般若波羅蜜多，乃能迴向一切智智，由能迴向一切智智，令布施等無邊功德究竟圓滿。",
        "translation": "Because of profound prajñā-pāramitā, it's possible to dedicate oneself to the cognition of all knowables, and because of that ability to dedicate oneself to the cognition of all knowables, limitless virtues like generosity are completely consummated.",
        "source": "T07n0220_540:0779b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故般若波羅蜜多，與布施等一切功德為尊為導。",
        "translation": "Therefore, prajñā-pāramitā and all the virtues of generosity and so forth are honored and guided.",
        "source": "T07n0220_540:0779b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "\"You should know this joyfully!",
        "source": "T07n0220_540:0779b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大地以種散中，眾緣和合便得生長，應知大地與種生長為所依止、為能建立。",
        "translation": "\"It's like when the earth is scattered with seeds, and when the various conditions combine, growth is possible, so you should know that the earth and the seeds that grow are the supports and the things that can be built.",
        "source": "T07n0220_540:0779b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多及所迴向一切智智，與布施等一切功德為所依止、為能建立，令得生長故，說般若波羅蜜多與布施等一切功德為尊為導故，我偏讚甚深般若波羅蜜多非餘功德，若讚般若即讚餘故。」",
        "translation": "Thus, the prajñāpāramitā and the omniscience that they direct their attention to, along with all the virtues of generosity and so forth, serve as supports and builders that make growth possible, and it's because it's said that the prajñāpāramitā and all the virtues of generosity and so forth are honored and guided that I praise the profound prajñāpāramitā and not other virtues, and if I praise prajñāpāramitā, I praise the others.\"",
        "source": "T07n0220_540:0779b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百四十",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 540",
        "source": "T07n0220_540:0779b16_0",
        "is_bad_quality": false
    }
]