[
    {
        "source_sentence": "摩訶般若波羅蜜經卷第八",
        "translation": "Mohe bore boloumi jing roll 8",
        "source": "T08n0223_008:0276a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, Tripiṭaka of Kucha, Later Qin Dynasty",
        "source": "T08n0223_008:0276a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎幻聽品第二十八(丹本作幻人聽法品)爾時諸天子心念：「應用何等人聽須菩提所說法？」",
        "translation": "It was then that the sons of gods thought to themselves, \"Who is this person listening to the teaching given by Subhūti?\"",
        "source": "T08n0223_008:0276a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提知諸天子心所念，語諸天子言：「如幻化人聽法，我應用如是人。",
        "translation": "Knowing what the gods were thinking, Subhūti said to the gods, \"Just as an illusory transformation person listens to the teaching, I apply it to such a person.",
        "source": "T08n0223_008:0276a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0276a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是人無聞無聽、無知無證故。」",
        "translation": "Thus, a person has no hearing, no listening, no knowledge, and no realization.\"",
        "source": "T08n0223_008:0276a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子語須菩提：「是眾生如幻，聽法者亦如幻；眾生如化，聽法者亦如化耶？」",
        "translation": "The celestials said to Subhūti, \"Are sentient beings illusory and those who listen to the teaching illusory, and are sentient beings transformed and those who listen to the teaching transformed?\"",
        "source": "T08n0223_008:0276a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，如是！",
        "translation": "\"So it is, so it is!",
        "source": "T08n0223_008:0276a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "all the sons of gods!",
        "source": "T08n0223_008:0276a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生如幻，聽法者亦如幻；眾生如化，聽法者亦如化。",
        "translation": "\"As sentient beings are illusory, so are those who listen to the teaching, and as sentient beings are transformed, so are those who listen to the teaching.",
        "source": "T08n0223_008:0276a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "Sons of the gods!",
        "source": "T08n0223_008:0276a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如幻如夢，眾生乃至知者、見者亦如幻如夢。",
        "translation": "\"I am as illusory as a dream, and so are sentient beings ... knowing and seeing them as illusory and dreamlike.",
        "source": "T08n0223_008:0276a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "My lords!",
        "source": "T08n0223_008:0276a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色如幻如夢，受想行識如幻如夢，眼乃至意觸因緣生受如幻如夢。",
        "translation": "Form is as illusory as a dream, feeling, perception, volition, and consciousness are as illusory as a dream, and the sensations that arise from the causes and conditions of vision and even mental contact are as illusory as a dream.",
        "source": "T08n0223_008:0276a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無法有法空、檀那波羅蜜乃至般若波羅蜜，如幻如夢。",
        "translation": "Internal emptiness ... emptiness of nonexistence ... dāna-pāramitā ... prajñā-pāramitā are as illusory as a dream.",
        "source": "T08n0223_008:0276a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "My lords!",
        "source": "T08n0223_008:0276b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念處乃至十八不共法如幻如夢，須陀洹果如幻如夢，斯陀含果、阿那含果、阿羅漢果、辟支佛道，如幻如夢。",
        "translation": "The four abodes of mindfulness and even the 18 distinctive qualities are illusory and dreamlike, the fruit of stream entry is illusory and dreamlike, and the fruit of once-returning, the fruit of non-returning, the fruit of arhatship, and the path of the solitary realizers are illusory and dreamlike.",
        "source": "T08n0223_008:0276b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "Sons of gods!",
        "source": "T08n0223_008:0276b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛道如幻如夢。」",
        "translation": "The Buddha Way is like an illusion and a dream.\"",
        "source": "T08n0223_008:0276b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸天子問須菩提：「汝說佛道如幻如夢，汝說涅槃亦復如幻如夢耶？」",
        "translation": "It was then that the celestials asked Subhūti, \"You say the Buddha Way is as illusory as a dream, and you say nirvāṇa is also as illusory as a dream?\"",
        "source": "T08n0223_008:0276b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語諸天子：「我說佛道如幻如夢，我說涅槃亦如幻如夢。",
        "translation": "Subhūti told the celestials, \"I say that the Buddha Way is as illusory as a dream, and I say that nirvāṇa is also as illusory as a dream.",
        "source": "T08n0223_008:0276b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當有法勝於涅槃者，我說亦復如幻如夢。",
        "translation": "If there's a teaching that's superior to nirvāṇa, I say it's also as illusory as a dream.",
        "source": "T08n0223_008:0276b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0276b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "all the sons of gods!",
        "source": "T08n0223_008:0276b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是幻夢、涅槃不二不別。」",
        "translation": "This is an illusion and a dream, and nirvāṇa are not two and not separate.\"",
        "source": "T08n0223_008:0276b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時慧命舍利弗、摩訶目揵連、摩訶拘絺羅、摩訶迦旃延、富樓那彌多羅尼子、摩訶迦葉，及無數千菩薩，問須菩提：「般若波羅蜜如是甚深，難見難解難知、寂滅微妙。",
        "translation": "It was then that Śāriputra, Mahāmaudgalyāyana, Mahākauṣṭhila, Mahākātyāyana, Pūrṇa Maitrāyaniputra, Mahākāśyapa, and countless thousands of other bodhisattvas asked Subhūti, \"Such is the profundity of prajñāpāramitā, which is difficult to see, difficult to understand, difficult to know, and subtle in its extinction.",
        "source": "T08n0223_008:0276b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當受者？」",
        "translation": "Who will accept it?\"",
        "source": "T08n0223_008:0276b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難語諸大弟子及諸菩薩：「阿惟越致諸菩薩摩訶薩，能受是甚深難見難解難知、寂滅微妙般若波羅蜜；正見成就人，漏盡阿羅漢所願已滿亦能信受。",
        "translation": "It was then that Ānanda told the great disciples and bodhisattvas, \"Advaita, the bodhisattvas, mahāsattvas, and bodhisattvas can accept this profound, difficult to see, difficult to understand, and difficult to know, subtle, tranquil, and marvelous prajñāpāramitā; those who have accomplished right view and have fulfilled the wishes of an arhat whose contaminants have ended can also believe and accept it.",
        "source": "T08n0223_008:0276b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，善男子、善女人，多見佛於諸佛所，多供養，種善根，親近善知識，有利根，是人能受，不言是法非法。」",
        "translation": "Furthermore, good sons and good women who often see the buddhas, make many offerings, plant good roots, become close to good friends, and have beneficial roots are capable of accepting such things, not saying that they are unlawful.\"",
        "source": "T08n0223_008:0276b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「不以空分別色，不以色分別空，受想行識亦如是。",
        "translation": "Suppository said, \"Not discriminating form by emptiness and not discriminating emptiness by form, it's likewise with feeling, perception, volition, and consciousness.",
        "source": "T08n0223_008:0276b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以無相、無作分別色，不以色分別無相、無作，受想行識亦如是。",
        "translation": "Not discriminating form by being markless and unconstructed, and not discriminating marklessness and unconstructedness by form, feeling, perception, volition, and consciousness are likewise.",
        "source": "T08n0223_008:0276b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以無生無滅、寂滅、離分別色，不以色分別無生無滅、寂滅、離，受想行識亦如是。",
        "translation": "Not discriminating form by its absence of arising and ceasing, extinction, and seclusion, and not discriminating absence of arising and ceasing, extinction, and seclusion by form, feeling, perception, volition, and consciousness are likewise.",
        "source": "T08n0223_008:0276b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼乃至意觸因緣生受亦如是。",
        "translation": "It's likewise with sensation that arises from the causes and conditions of vision and even mental contact.",
        "source": "T08n0223_008:0276b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀羅尼門，須陀洹乃至阿羅漢、辟支佛、佛、一切智，不以空分別一切智，不以一切智分別空，不以空分別一切種智，不以一切種智分別空，無相、無作、無生無滅、寂滅、離亦如是。」",
        "translation": "So it is with the perfection of giving, the perfection of wisdom, internal emptiness and the emptiness of nonexistence, the four abodes of mindfulness and the 18 distinctive qualities, all samādhis and all dhāraṇīs, streams and arhats, solitary realizers, buddhas, and all cognitions, not discriminating all cognitions by emptiness, not discriminating emptiness by all cognitions, not discriminating all kinds of cognitions by emptiness, not discriminating emptiness by all kinds of cognitions, and marklessness, unconstructedness, nonarising and noncessation, extinction, and seclusion.\"",
        "source": "T08n0223_008:0276b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語諸天子言：「是般若波羅蜜甚深，誰能受者？",
        "translation": "Subhūti told the celestials, \"This is the profundity of the perfection of wisdom, who is capable of accepting it?",
        "source": "T08n0223_008:0276c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜中無法可示、無法可說。",
        "translation": "There's nothing in the perfection of wisdom that can be shown or explained.",
        "source": "T08n0223_008:0276c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無法可示、無法可說，受人亦不可得。」",
        "translation": "If there's nothing that can be shown and nothing that can be explained, it's impossible for the recipient to obtain it.\"",
        "source": "T08n0223_008:0276c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗語須菩提言：「般若波羅蜜中廣說三乘之教及護持菩薩之教。",
        "translation": "It was then that Śāriputra said to Subhūti, \"In the perfection of wisdom, the teachings of the three vehicles are explained in detail, and the teachings of the bodhisattvas are safeguarded.",
        "source": "T08n0223_008:0276c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從初發意地乃至十地，檀那波羅蜜乃至般若波羅蜜，四念處乃至八聖道分，佛十力乃至十八不共法護持菩薩之教。",
        "translation": "From the stage of the first arousal of the mind up to the ten stages, from the perfection of giving and the perfection of wisdom up to the perfection of wisdom, from the four abodes of mindfulness up to the eight noble factors of the path, and from the Buddha's ten powers up to the eighteen distinctive qualities, they safeguard the bodhisattva's teaching.",
        "source": "T08n0223_008:0276c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜，常化生，不失神通，遊諸佛國具足善根，隨其所欲供養諸佛即得如願，從諸佛所聽受法教，乃至薩婆若初不斷絕，未曾離三昧時。",
        "translation": "Thus practicing the perfection of wisdom, the bodhisattva Mahāsattva always transforms beings, doesn't lose his supernormal powers, travels to the buddha lands with perfect good roots, makes offerings to the buddhas as he wishes, and receives the teaching from the buddhas up to the time when sarvajñas first cease without break and never leave samādhi.",
        "source": "T08n0223_008:0276c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當得捷疾辯、利辯、不盡辯、不可斷辯、隨應辯、義辯、一切世間最上辯。」",
        "translation": "They will attain quick eloquence, sharp eloquence, inexhaustible eloquence, unbreakable eloquence, responsive eloquence, purposeful eloquence, and the most excellent eloquence of all the world.\"",
        "source": "T08n0223_008:0276c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「如是，如是！",
        "translation": "Subhūti said, \"So it is, so it is!",
        "source": "T08n0223_008:0276c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如舍利弗言，般若波羅蜜廣說三乘之教及護持菩薩之教，乃至菩薩摩訶薩得一切世間最上辯，不可得故。",
        "translation": "As Śāriputra said, it's because the prajñāpāramitā teaches extensively the teachings of the three vehicles and guards the teachings of the bodhisattvas, and because the bodhisattvas, the mahāsattvas, attain the highest level of eloquence in all the world, but it's unobtainable.",
        "source": "T08n0223_008:0276c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我乃至知者、見者不可得，色受想行識、檀那波羅蜜乃至般若波羅蜜不可得，內空乃至無法有法空不可得，四念處乃至八聖道分、佛十力乃至一切種智，亦不可得故。」",
        "translation": "It's because I and even those who know and those who see are unobtainable, form, feeling, perception, volition, consciousness, the perfection of giving, the perfection of wisdom, internal emptiness and even the emptiness of nonexistence are unobtainable, and the four abodes of mindfulness and even the eight noble factors of the path, the ten powers of the Buddha and even all kinds of cognition are also unobtainable.\"",
        "source": "T08n0223_008:0276c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗語須菩提：「何因緣故，般若波羅蜜中廣說三乘而不可得？",
        "translation": "Śāriputra said to Subhūti, \"What are the reasons why the three vehicles are explained in detail in the perfection of wisdom but are unobtainable?",
        "source": "T08n0223_008:0276c23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣故，般若波羅蜜中護持菩薩？",
        "translation": "What are the causes and conditions that make a bodhisattva guarded in the perfection of wisdom?",
        "source": "T08n0223_008:0276c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣故，菩薩摩訶薩得捷疾辯乃至一切世間最上辯？",
        "translation": "What are the reasons why the bodhisattvas, the great mahāsattvas, attain speedy eloquence and even the greatest eloquence of all the world?",
        "source": "T08n0223_008:0276c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可得故。」",
        "translation": "It's therefore unobtainable.\"",
        "source": "T08n0223_008:0276c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語舍利弗言：「以內空故，般若波羅蜜廣說三乘不可得。",
        "translation": "Subhūti said to Śāriputra, \"It's because of internal emptiness that the perfection of wisdom explains in detail that the three vehicles are unobtainable.",
        "source": "T08n0223_008:0276c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外空乃至無法有法空故，廣說三乘不可得。",
        "translation": "It's because external emptiness and even the emptiness of nonexistence as dharmas that the Threefold Vehicle is explained in detail as being unobtainable.",
        "source": "T08n0223_008:0276c29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空故，護持菩薩乃至一切世間最上辯。",
        "translation": "Because of internal emptiness, it's the supreme eloquence that protects bodhisattvas and even the whole world.",
        "source": "T08n0223_008:0277a01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可得故。",
        "translation": "It's because it's unobtainable.",
        "source": "T08n0223_008:0277a02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外空乃至無法有法空故，護持菩薩乃至一切世間最上辯。",
        "translation": "It's because external emptiness and the nonexistence of emptiness of dharmas that the supreme eloquence of the bodhisattvas and even of the whole world is upheld.",
        "source": "T08n0223_008:0277a02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可得故。」",
        "translation": "It's therefore unobtainable.\"",
        "source": "T08n0223_008:0277a03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎摩訶般若波羅蜜經散花品第二十九爾時釋提桓因及三千大千世界中四天王天乃至阿迦尼吒諸天，作是念：「慧命須菩提為雨法雨。",
        "translation": "Śakra Devānām-Indra and the four heavenly kings and Akaniṣṭha gods of the 3,000 great one-thousand worlds then thought, \"Wisdom lives on as Supporti rains down the Dharma rain.",
        "source": "T08n0223_008:0277a04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等寧可化作花，散佛、菩薩摩訶薩、比丘僧、須菩提及般若波羅蜜上。」",
        "translation": "We could rather turn them into flowers and scatter them on top of the Buddha, the bodhisattvas, the monks, the bhikṣus, Subhūti, and Prajñāparamitra.\"",
        "source": "T08n0223_008:0277a08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時釋提桓因及三千大千世界中諸天，化作花，散佛、菩薩摩訶薩、比丘僧及須菩提上，亦供養般若波羅蜜。",
        "translation": "Śakra Devānām-Indra and the gods of the 3,000 great one-thousand worlds then turned into flowers and scattered them on top of the Buddha, Bodhisattvas, Mahāsattvas, Bhikṣus, and Śubha Bodhisattva, and offered them to Prajñāparamitra.",
        "source": "T08n0223_008:0277a09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時三千大千世界花悉周遍於虛空中，化成花臺，端嚴殊妙。",
        "translation": "The flowers of the 3,000 great one-thousand worlds then were all spread out across the sky and transformed into flower stands that were beautiful in their appearance.",
        "source": "T08n0223_008:0277a12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提心念：「是諸天子所散花，天上未曾見如是花比，是花是化花、非樹生花。",
        "translation": "Suppository thought, \"Such flowers scattered by the sons of gods have never been seen in the heavens, and they are transformation flowers, not tree-grown flowers.",
        "source": "T08n0223_008:0277a13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸天子所散花，從心樹生、非樹生花。」",
        "translation": "Those flowers scattered by the celestials are flowers that arise from the mind as a tree, not as a tree.\"",
        "source": "T08n0223_008:0277a15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因知須菩提心所念，語須菩提言：「大德！",
        "translation": "Śakrodevānī knew what was on Subhūti's mind and said to him, \"Mañjuśrī!",
        "source": "T08n0223_008:0277a16_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是花非生花亦非意樹生。」",
        "translation": "This is a flower that doesn't grow, and it's not produced by a tree of thought.\"",
        "source": "T08n0223_008:0277a17_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「憍尸迦！",
        "translation": "Subhūti said to Śakrodevānām-Indra, \"Kauśika!",
        "source": "T08n0223_008:0277a18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝言是華非生花亦非意樹生。",
        "translation": "'You say this flower doesn't grow as a flower, and it doesn't grow from a tree of thought.'",
        "source": "T08n0223_008:0277a19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0277a19_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是花若非生法，不名為花。」",
        "translation": "If this flower isn't a produced dharma, it isn't called a flower.\"",
        "source": "T08n0223_008:0277a20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因語須菩提言：「大德！",
        "translation": "Śakrodevānām Indra said to Subhūti, \"Great man!",
        "source": "T08n0223_008:0277a20_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但是花不生，色亦不生，受想行識亦不生。」",
        "translation": "But flowers don't arise, form doesn't arise, and sensation, conception, volition, and consciousness don't arise.\"",
        "source": "T08n0223_008:0277a21_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「憍尸迦！",
        "translation": "Subhūti said, \"Kauśika!",
        "source": "T08n0223_008:0277a22_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但是花不生，色亦不生。",
        "translation": "Not only do flowers not arise, but form doesn't arise either.",
        "source": "T08n0223_008:0277a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不生，是不名為色。",
        "translation": "If it doesn't arise, it's not called form.",
        "source": "T08n0223_008:0277a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識亦不生，若不生是不名為識。",
        "translation": "*Feelings, perceptions, volitions, and consciousness also don't arise, and if they didn't arise, it wouldn't be called consciousness.",
        "source": "T08n0223_008:0277a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六入、六識、六觸，六觸因緣生諸受亦如是。",
        "translation": "So it is with the six sense-fields, six consciousnesses, six tactile sensations, and the sensations that arise from the causes and conditions of the six tactile sensations.",
        "source": "T08n0223_008:0277a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "檀那波羅蜜不生，若不生，是不名檀那波羅蜜。",
        "translation": "The perfection of giving doesn't arise, and if it doesn't arise, it isn't called the perfection of giving.",
        "source": "T08n0223_008:0277a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至般若波羅蜜不生，若不生，是不名般若波羅蜜。",
        "translation": "Even the perfection of wisdom doesn't arise, and if it doesn't arise, it's not called the perfection of wisdom.",
        "source": "T08n0223_008:0277a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空不生，若不生，是不名內空。",
        "translation": "If internal emptiness doesn't arise, and if it doesn't arise, it's not called internal emptiness.",
        "source": "T08n0223_008:0277a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至無法有法空不生，若不生，是不名無法有法空。",
        "translation": "... emptiness of nonexistence doesn't arise, and if it doesn't arise, it's not called the emptiness of nonexistence.",
        "source": "T08n0223_008:0277a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念處不生，若不生，是不名四念處。",
        "translation": "The four abodes of mindfulness don't arise, and if they don't arise, it's not called the four abodes of mindfulness.",
        "source": "T08n0223_008:0277b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至十八不共法不生，若不生，是不名十八不共法。",
        "translation": "... the 18 distinctive qualities don't arise, and if they don't arise, it's not called the 18 distinctive qualities.",
        "source": "T08n0223_008:0277b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智不生，若不生，是不名一切種智。」",
        "translation": "... all-inclusive cognition doesn't arise, and if it doesn't arise, it isn't called all-inclusive cognition.\"",
        "source": "T08n0223_008:0277b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋提桓因心念：「是慧命須菩提，其智甚深，不壞假名而說諸法相。」",
        "translation": "It was then that Śakra Devānām-Indra thought to himself, \"This is the wise life of Subhūti, whose knowledge is so profound that it doesn't destroy nominal names and explains the characteristics of dharmas.\"",
        "source": "T08n0223_008:0277b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知釋提桓因心所念，語釋提桓因言：「如是，如是！",
        "translation": "Knowing what Śakra Devānām-Indra was thinking, the Buddha said to Śakra Devānām-Indra, \"So it is, so it is!",
        "source": "T08n0223_008:0277b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0277b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提其智甚深，不壞假名而說諸法相。」",
        "translation": "Subhūti's knowledge is so profound that he doesn't decay nominal names and explains the characteristics of dharmas.\"",
        "source": "T08n0223_008:0277b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因白佛言：「世尊！",
        "translation": "Śakrodevānām said to the Buddha, \"Bhagavān!",
        "source": "T08n0223_008:0277b08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德須菩提云何不壞假名而說諸法相？」",
        "translation": "Venerable Subhūti, why doesn't he explain the characteristics of dharmas while destroying their nominal names?\"",
        "source": "T08n0223_008:0277b09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告釋提桓因：「色但假名，須菩提不壞假名而說諸法相。",
        "translation": "The Buddha told Śakra Devānām-Indra, \"Form is only nominal, but Subhūti doesn't destroy nominal names and speak of the characteristics of dharmas.",
        "source": "T08n0223_008:0277b10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識但假名，須菩提亦不壞假名而說諸法相。",
        "translation": "*Feelings, perceptions, volitions, and consciousness are only nominal, but Suppository Bodhisattva doesn't destroy nominal names and explain the characteristics of dharmas.",
        "source": "T08n0223_008:0277b11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸法相無壞不壞故，須菩提所說亦無壞不壞。",
        "translation": "Because the characteristics of these things are neither broken nor destroyed, what Subhūti teaches is also neither broken nor destroyed.",
        "source": "T08n0223_008:0277b13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼乃至意觸因緣生諸受亦如是。",
        "translation": "*Up to and including the sensations that arise from the causes and conditions of visual and mental contact, it's likewise.",
        "source": "T08n0223_008:0277b14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法亦如是。",
        "translation": "So it is with the perfection of giving and the perfection of wisdom, internal emptiness and the emptiness of nonexistence, and the four abodes of mindfulness and the 18 distinctive qualities.",
        "source": "T08n0223_008:0277b15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須陀洹果乃至阿羅漢果，辟支佛道、菩薩道、佛道，一切智、一切種智，亦如是。",
        "translation": "So it is with the fruit of stream entry up to the fruit of the arhat, the path of the pratyekabuddhas, the path of the bodhisattvas, the path of the buddhas, and omniscience and omniscience of all kinds.",
        "source": "T08n0223_008:0277b17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須陀洹乃至阿羅漢、辟支佛佛是但假名，須菩提不壞假名而說諸法相。",
        "translation": "The stream-winner ... arhat ... pratyekabuddha ... buddha is only a nominal name, and Subhūti doesn't destroy nominal names and explain the characteristics of dharmas.",
        "source": "T08n0223_008:0277b19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277b20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸法相無壞不壞故，須菩提所說亦無壞不壞。",
        "translation": "Because the characteristics of these things are neither broken nor destroyed, what Subhūti teaches is also neither broken nor destroyed.",
        "source": "T08n0223_008:0277b20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，憍尸迦！",
        "translation": "Thus, Kauśika!",
        "source": "T08n0223_008:0277b22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提不壞假名而說諸法相。」",
        "translation": "Subhūti doesn't destroy nominal names and explain the characteristics of dharmas.\"",
        "source": "T08n0223_008:0277b22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「如是，如是！",
        "translation": "Subhūti said to Śakra Devānām-Indra, \"So it is, so it is!",
        "source": "T08n0223_008:0277b23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0277b24_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說，諸法但假名。",
        "translation": "As the Buddha has taught, dharmas are nothing but nominal names.",
        "source": "T08n0223_008:0277b24_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩當作是知，諸法但假名。",
        "translation": "The bodhisattvas, mahāsattvas, should know in this way that all dharmas are nothing but nominal names.",
        "source": "T08n0223_008:0277b24_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是學般若波羅蜜。",
        "translation": "They should thus train in the perfection of wisdom.",
        "source": "T08n0223_008:0277b25_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0277b26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩作如是學，為不學色、不學受想行識。",
        "translation": "The bodhisattvas, mahāsattvas, do this training in order not to train in form and not to train in feeling, perception, volition, and consciousness.",
        "source": "T08n0223_008:0277b26_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277b27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見色當可學者，不見受想行識當可學者。",
        "translation": "\"It's possible to train someone who doesn't see form, and it's possible to train someone who doesn't see sensation, perception, volition, and consciousness.",
        "source": "T08n0223_008:0277b27_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是學，為不學檀那波羅蜜。",
        "translation": "Thus, the bodhisattvas, mahāsattvas, train, but they don't train in the perfection of giving.",
        "source": "T08n0223_008:0277b28_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277b29_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見檀那波羅蜜當可學者。",
        "translation": "\"If you don't see the perfection of giving, you can learn.",
        "source": "T08n0223_008:0277c01_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至不學般若波羅蜜。",
        "translation": "It's not even possible to train in the perfection of wisdom.",
        "source": "T08n0223_008:0277c01_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277c02_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見般若波羅蜜當可學者。",
        "translation": "\"If you don't see the perfection of wisdom, you can learn.",
        "source": "T08n0223_008:0277c02_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是學，為不學內空乃至無法有法空。",
        "translation": "Such training is not training in internal emptiness or even the emptiness of nonexistence.",
        "source": "T08n0223_008:0277c03_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277c04_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見內空乃至無法有法空當可學者。",
        "translation": "\"Not seeing internal emptiness or even the emptiness of nonexistence as a principle should be something to learn.",
        "source": "T08n0223_008:0277c04_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是學，為不學四念處乃至十八不共法。",
        "translation": "Such training is not to train in the four abodes of mindfulness or even the 18 distinctive qualities.",
        "source": "T08n0223_008:0277c05_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277c06_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見四念處乃至十八不共法當可學者。",
        "translation": "Not seeing the four abodes of mindfulness or even the 18 distinctive qualities should make it possible for someone to train.",
        "source": "T08n0223_008:0277c06_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是學，為不學須陀洹果乃至一切種智。",
        "translation": "Such training is not training in the fruit of stream entry or even in the knowledge of all kinds.",
        "source": "T08n0223_008:0277c07_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0277c08_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見須陀洹果乃至一切種智當可學者。」",
        "translation": "Those who don't see the fruit of stream entry or even the knowledge of all kinds will be able to learn.\"",
        "source": "T08n0223_008:0277c08_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋提桓因語須菩提言：「菩薩摩訶薩何因緣故，不見色乃至不見一切種智？」",
        "translation": "It was then that Śakra Devānām-Indra said to Subhūti, \"What are the reasons why a bodhisattva doesn't see form ... and doesn't even see the cognition of all distinct types?\"",
        "source": "T08n0223_008:0277c09_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「色色空乃至一切種智一切種智空。",
        "translation": "Subhūti said, \"Form is empty, even to the extent that all kinds of cognition and all kinds of cognition are empty.",
        "source": "T08n0223_008:0277c11_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0277c12_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色空不學色空，乃至一切種智空不學一切種智空。",
        "translation": "They don't train in the emptiness of form, and they don't train in the emptiness of all kinds of knowledge, even if they know the emptiness of all kinds of knowledge.",
        "source": "T08n0223_008:0277c12_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0277c13_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是不學空，是名學空，以不二故。",
        "translation": "\"If someone thus doesn't train in emptiness, this is called training in emptiness because it's not two.",
        "source": "T08n0223_008:0277c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩學色空，以不二故，乃至學一切種智空，不二故。",
        "translation": "It's because the bodhisattva Mahāsattva trains in emptiness of form and not dual, and it's because he trains in the emptiness of all kinds of cognition and not dual.",
        "source": "T08n0223_008:0277c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若學色空不二故，乃至學一切種智空不二故，是菩薩摩訶薩能學檀那波羅蜜，不二故。",
        "translation": "If it's because learning form and emptiness are not two and even learning the emptiness of all kinds of cognition is not two, then it's because the bodhisattva Mahāsattva can train in the perfection of giving and that's not two.",
        "source": "T08n0223_008:0277c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至能學般若波羅蜜，不二故。",
        "translation": "It's because they can train in the perfection of wisdom and not be two.",
        "source": "T08n0223_008:0277c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能學四念處，不二故。",
        "translation": "It's because they can train in the four abodes of mindfulness, which are not two.",
        "source": "T08n0223_008:0277c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至能學十八不共法，不二故。",
        "translation": "... can train in the 18 distinctive qualities, it's not two.",
        "source": "T08n0223_008:0277c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能學須陀洹果，不二故。",
        "translation": "He's able to train in the fruit of stream entry because it's not two.",
        "source": "T08n0223_008:0277c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至能學一切種智，不二故。",
        "translation": "... can train in the cognition of all distinctive qualities, it's not two.",
        "source": "T08n0223_008:0277c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩能學無量無邊阿僧祇佛法，若能學無量無邊阿僧祇佛法，是菩薩不為色增學不為色減學。",
        "translation": "If a bodhisattva can train measureless and limitless incalculable Buddha qualities, and if he can train measureless and limitless incalculable Buddha qualities, then that bodhisattva doesn't train more for form and doesn't train less for form.",
        "source": "T08n0223_008:0277c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至不為一切種智增學，不為一切種智減學。",
        "translation": "... doesn't train more for the sake of omniscience and doesn't train less for the sake of omniscience.",
        "source": "T08n0223_008:0277c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不為色增減學，乃至不為一切種智增減學，是菩薩不為色受學，不為色滅學，亦不為受想行識受學，亦不為滅學。",
        "translation": "If he doesn't train for the increase or decrease of form and doesn't train for the increase or decrease of all kinds of cognition, then the bodhisattva doesn't train for the sensation of form and doesn't train for the cessation of form, nor does he train for the sensation of feeling, perception, volition, consciousness, nor does he train for the cessation of it.",
        "source": "T08n0223_008:0277c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智，亦不為受學，亦不為滅學。」",
        "translation": "Even cognition of all kinds doesn't lead to the apprehension and training of form or the cessation of form, nor does it lead to the apprehension and cessation of consciousness.\"",
        "source": "T08n0223_008:0277c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗語須菩提：「菩薩摩訶薩如是學，不為受色學，不為滅色學。",
        "translation": "Śāriputra told Subhūti, \"A bodhisattva Mahāsattva thus trains not for the sake of feeling form, and he doesn't train for the sake of cessation of form.",
        "source": "T08n0223_008:0277c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智，亦不為受學，亦不為滅學。」",
        "translation": "Even cognition of all kinds doesn't train for sensation and doesn't train for cessation.\"",
        "source": "T08n0223_008:0278a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩若如是學，不為受色學，不為滅色學。",
        "translation": "Subhūti said, \"If the bodhisattva Mahāsattva thus trains, he doesn't train for the sake of feeling form and doesn't train for the sake of cessation of form.",
        "source": "T08n0223_008:0278a02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智，亦不為受學，亦不為滅學。",
        "translation": "Even cognition of all kinds doesn't train for sensation and doesn't train for cessation.'",
        "source": "T08n0223_008:0278a04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_008:0278a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣故，菩薩摩訶薩不為受色學，不為滅色學？",
        "translation": "What are the reasons why the bodhisattvas, the mahāsattvas, don't train for sensation of form and don't train for the cessation of form?",
        "source": "T08n0223_008:0278a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智，亦不為受學，亦不為滅學？」",
        "translation": "Even to the extent that all-inclusive cognition is not acquired for training and not acquired for cessation?\"",
        "source": "T08n0223_008:0278a06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「是色不可受亦無受色者，乃至一切種智不可受亦無受者，內外空故。",
        "translation": "Subhūti said, \"This is because form is unacceptable and there's no accepter of form, and even all kinds of cognition are unacceptable and there's no accepter, so internal and external are empty.",
        "source": "T08n0223_008:0278a07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0223_008:0278a09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩一切法不受故，能到一切種智。」",
        "translation": "It's because the bodhisattva-mahāsattva doesn't accept all dharmas that he can attain the cognition of all kinds.\"",
        "source": "T08n0223_008:0278a09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時舍利弗語須菩提：「菩薩摩訶薩如是學般若波羅蜜，能到一切種智耶？」",
        "translation": "Śāriputra then said to Subhūti, \"Can a bodhisattva-mahāsattva thus train in the perfection of wisdom reach all kinds of cognition?\"",
        "source": "T08n0223_008:0278a10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩如是學般若波羅蜜，能到一切種智，一切法不受故。」",
        "translation": "Subhūti said, \"Thus does the bodhisattva Mahāsattva train in the perfection of wisdom, which enables him to attain the cognition of all kinds and not accept all dharmas.\"",
        "source": "T08n0223_008:0278a12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗語須菩提：「若菩薩摩訶薩於一切法不受不滅學者，菩薩摩訶薩云何能到一切種智？」",
        "translation": "Śāriputra said to Subhūti, \"If the bodhisattva Mahāsattva doesn't accept the one who doesn't cease to exist in regard to all dharmas, how can the bodhisattva Mahāsattva attain the cognition of all kinds?\"",
        "source": "T08n0223_008:0278a14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩行般若波羅蜜，不見色生不見色滅，不見色受不見色不受，不見色垢不見色淨，不見色增不見色減。",
        "translation": "Subhūti said, \"When the bodhisattva Mahāsattva practices the perfection of wisdom, he doesn't see form arise and doesn't see form cease, doesn't see form receive and doesn't see form not receive, doesn't see form defiled and doesn't see form purified, and doesn't see form increase and doesn't see form decrease.",
        "source": "T08n0223_008:0278a16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0278a19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_008:0278a19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色色性空故，受想行識亦不見生亦不見滅，亦不見受亦不見不受，亦不見垢亦不見淨，亦不見增亦不見減。",
        "translation": "Because the nature of form is empty, feeling, perception, volition, and consciousness don't see birth and don't see extinction, don't see sensation and don't see non-acquisition, don't see dirt and don't see purity, and don't see increase and don't see decrease.",
        "source": "T08n0223_008:0278a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0278a22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識識性空故。",
        "translation": "consciousness is empty by nature.",
        "source": "T08n0223_008:0278a23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智，亦不見生亦不見滅，亦不見受亦不見不受，亦不見垢亦不見淨，亦不見增亦不見減。",
        "translation": "Up to the full range of cognition, it doesn't see birth and doesn't see cessation, doesn't see sensation and doesn't see non-acquisition, doesn't see dirt and doesn't see purity, and doesn't see increase or decrease.",
        "source": "T08n0223_008:0278a23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0278a25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切種智一切種智性空故。",
        "translation": "\"All kinds of cognition are empty in nature because of all kinds of cognition.",
        "source": "T08n0223_008:0278a26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0223_008:0278a26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為一切法不生不滅、不受不捨、不垢不淨、不合不散、不增不減故，學般若波羅蜜，能到一切種智。",
        "translation": "Because all things neither arise nor cease, don't accept nor abandon, are unsullied and impure, don't fit together, don't disperse, and don't increase or decrease, the bodhisattvas Mahāsattvas train in the perfection of wisdom and are able to reach all kinds of cognition.",
        "source": "T08n0223_008:0278a27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所學、無所到故。」",
        "translation": "There's nothing to learn, and nothing to reach.\"",
        "source": "T08n0223_008:0278a29_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋提桓因語舍利弗：「菩薩摩訶薩般若波羅蜜當於何處求？」",
        "translation": "It was then that Śakra Devānām-Indra said to Śāriputra, \"Where should the bodhisattvas, the great beings, and the perfection of wisdom be sought?\"",
        "source": "T08n0223_008:0278b01_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「菩薩摩訶薩般若波羅蜜，當於〈須菩提品〉中求。」",
        "translation": "Śāriputra said, \"The bodhisattva-mahāsattva's perfection of wisdom should be sought in the Chapter of Subhūti.\"",
        "source": "T08n0223_008:0278b02_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因語須菩提：「是汝神力使舍利弗言：『菩薩摩訶薩般若波羅蜜，當於〈須菩提品〉中求。』",
        "translation": "Śakra Devānām-Indra said to Subhūti, \"Was it your supernormal power that caused Śāriputra to say, 'The bodhisattva-mahāsattva prajñāpāramitā will be sought in the Chapter of Subhūti.'",
        "source": "T08n0223_008:0278b04_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "？」",
        "translation": "What?\"",
        "source": "T08n0223_008:0278b06_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語釋提桓因：「非我神力。」",
        "translation": "Subhūti said to Śakra Devānām-Indra, \"It's not my supernormal powers.\"",
        "source": "T08n0223_008:0278b06_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因語須菩提：「是誰神力？」",
        "translation": "Śakrodevānām Indra said to Subhūti, \"Who is it that has supernormal powers?\"",
        "source": "T08n0223_008:0278b06_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「是佛神力。」",
        "translation": "Subhūti said, \"This is the Buddha's supernormal power.\"",
        "source": "T08n0223_008:0278b07_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因言：「一切法皆無受處，何以故言：『是佛神力。』",
        "translation": "Śakrodevānām said, \"All dharmas have no place to be received, so why do you say, 'It's the Buddha's supernormal powers.'",
        "source": "T08n0223_008:0278b08_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "？",
        "translation": "What is the reason?",
        "source": "T08n0223_008:0278b09_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離無受處相，如來不可得；離如，如來亦不可得。」",
        "translation": "Apart from the characteristic of no appropriation, the Tathāgata is unknowable; apart from that, the Tathāgata is also unknowable.\"",
        "source": "T08n0223_008:0278b09_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「如是，如是！",
        "translation": "Subhūti said to Śakra Devānām-Indra, \"So it is, so it is!",
        "source": "T08n0223_008:0278b10_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0278b11_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離無受處相，如來不可得；離如，如來亦不可得。",
        "translation": "Without the mark of imperceptibility, the Tathāgata is unobtainable, and without thusness, the Tathāgata is also unobtainable.",
        "source": "T08n0223_008:0278b11_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無受處相中如來不可得，如中如來不可得。",
        "translation": "The Tathāgata is unobtainable in the absence of the marks of sensation, and the Tathāgata is unobtainable in thusness.",
        "source": "T08n0223_008:0278b12_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色如中如來如不可得，如來如中色如不可得。",
        "translation": "The Tathāgata in form as such is unobtainable, and the Tathāgata in form as such is unobtainable.",
        "source": "T08n0223_008:0278b13_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色法相中如來法相不可得，如來法相中色法相不可得。",
        "translation": "The tathāgata's dharmas in the dharmas of form are unobtainable, and the dharmas of form in the dharmas of the Tathāgata are unobtainable.",
        "source": "T08n0223_008:0278b14_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識法相中，乃至一切種智如法，亦如是。",
        "translation": "It's likewise with the reality of feeling, perception, volition, and consciousness and even with the reality of all kinds of cognition.",
        "source": "T08n0223_008:0278b16_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0278b17_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來色如中不合不散，受想行識如中不合不散。",
        "translation": "\"The Tathāgata's form thus doesn't fit or disperse, and feelings, perceptions, volitions, and consciousness thus don't fit or disperse.",
        "source": "T08n0223_008:0278b17_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來離色如不合不散，離受想行識如不合不散。",
        "translation": "The Tathāgata parts with form as such that isn't unconfused and discrete, and parts with feeling, perception, volition, and consciousness as such that isn't unconfused and discrete.",
        "source": "T08n0223_008:0278b18_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "*Up to and including the cognition of all distinctive qualities is likewise.*",
        "source": "T08n0223_008:0278b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來色法相中不合不散，受想行識法相中不合不散。",
        "translation": "Thus, what's in the characteristics of form doesn't fit or disperse, and what's in the characteristics of feeling, perception, volition, and consciousness doesn't fit or disperse.",
        "source": "T08n0223_008:0278b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來離色法相中不合不散，離受想行識法相中不合不散。",
        "translation": "As such, what's free of form doesn't disperse in the characteristics of things, and what's free of feelings, perceptions, volitions, and consciousness doesn't disperse in the characteristics of things.",
        "source": "T08n0223_008:0278b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "*Up to and including the cognition of all distinctive qualities is likewise.*",
        "source": "T08n0223_008:0278b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0278b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等一切法中不合不散，是佛神力用無所受法故。",
        "translation": "Thus, in all these things, they don't fit or scatter, which is because the Buddha's spiritual power works without any accepted dharmas.",
        "source": "T08n0223_008:0278b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如憍尸迦言：『菩薩摩訶薩般若波羅蜜，當於何處求？』",
        "translation": "As Kauśika said, 'Where should the bodhisattva-mahāsattva prajñāpāramitā be sought?'",
        "source": "T08n0223_008:0278b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0278b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應色中求般若波羅蜜，亦不應離色求般若波羅蜜。",
        "translation": "\"The perfection of wisdom should not be sought in form, nor should the perfection of wisdom be sought apart from form.",
        "source": "T08n0223_008:0278b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應受想行識中求，亦不應離受想行識求。",
        "translation": "It shouldn't be sought in feeling, perception, volition, and consciousness, nor should it be sought apart from feeling, perception, volition, and consciousness.",
        "source": "T08n0223_008:0278b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0278b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜、色受想行識，是一切法皆不合不散、無色無形無對，一相所謂無相。",
        "translation": "\"The perfection of wisdom and form, feeling, perception, volition, and consciousness are all things that don't fit together and don't disperse, lack form and shape, and have no object, and their single characteristic is called formless.",
        "source": "T08n0223_008:0278b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智中不應求般若波羅蜜，亦不應離一切種智求般若波羅蜜。",
        "translation": "Even within omniscience, the perfection of wisdom shouldn't be sought, and the perfection of wisdom shouldn't be sought apart from omniscience.",
        "source": "T08n0223_008:0278c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0278c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜、一切種智，是一切法皆不合不散、無色無形無對、一相所謂無相。",
        "translation": "\"This is the perfection of wisdom and all-inclusive cognition, which is that all things are unconformable and undistorted, formless, immaterial, and without opposition, and that one characteristic is called formless.",
        "source": "T08n0223_008:0278c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0278c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜非色亦非離色，非受想行識亦非離受想行識，乃至非一切種智亦非離一切種智。",
        "translation": "The perfection of wisdom is neither form nor free of form, neither feeling-conception-conduct consciousness nor free of feeling-conception-conduct consciousness, and it's neither omniscience nor free of omniscience.",
        "source": "T08n0223_008:0278c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜非色如亦非離色如，非受想行識如亦非離受想行識如。",
        "translation": "The prajñāpāramitā is neither such as form nor such as is free from form, and it's neither such as feeling, conception, volition, nor such as is free from feeling, conception, volition, consciousness.",
        "source": "T08n0223_008:0278c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜非色法亦非離色法，非受想行識法亦非離受想行識法，乃至非一切種智如亦非離一切種智如。",
        "translation": "The prajñāpāramitā is not form as such and not free of form as such, not feeling, conception, volition, consciousness as such and not free of feeling, conception, volition, consciousness as such, ... it's not omniscience as such and not free of omniscience as such.",
        "source": "T08n0223_008:0278c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜非一切種智法亦非離一切種智法。",
        "translation": "The perfection of wisdom is neither omniscience-principled nor distinct from omniscience-principled.",
        "source": "T08n0223_008:0278c13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0278c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0278c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是一切法皆無所有、不可得。",
        "translation": "\"These are all things that lack existence and are unobtainable.",
        "source": "T08n0223_008:0278c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無所有、不可得故，般若波羅蜜非色亦非離色，非色如亦非離色如，非色法亦非離色法，乃至非一切種智亦非離一切種智，非一切種智如亦非離一切種智如，非一切種智法亦非離一切種智法。」",
        "translation": "Because they lack existence and are unobtainable, the perfection of prajñā is neither form nor apart from form, neither form as such nor apart from form as such, neither form nor apart from form as such, and it's neither omniscience nor apart from omniscience, neither omniscience as such nor apart from omniscience as such, and neither omniscience as such nor apart from omniscience as such.\"",
        "source": "T08n0223_008:0278c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因語須菩提：「是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜；無量波羅蜜、無邊波羅蜜，是菩薩摩訶薩般若波羅蜜。",
        "translation": "Śakra Devānām-Indra said to Subhūti, \"This is the perfection of mahāprajñāpāramitā, which is the prajñāpāramitā of the bodhisattvas, and this is the perfection of measurelessness and limitlessness, which is the prajñpāramitā of the bodhisattvas.",
        "source": "T08n0223_008:0278c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸須陀洹須陀洹果，從是般若波羅蜜中學成。",
        "translation": "It's from this perfection of wisdom that the fruits of stream entry and stream entry are produced.",
        "source": "T08n0223_008:0278c22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至諸阿羅漢阿羅漢果、諸辟支佛辟支佛道、諸菩薩摩訶薩，皆從是般若波羅蜜中學成。",
        "translation": "Even the fruit of arhats, the fruit of arhats, the path of pratyekabuddhas and pratyekabuddhas, and the bodhisattvas and mahāsattvas all learn from this perfection of wisdom.",
        "source": "T08n0223_008:0278c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能成就眾生、淨佛國土；得阿耨多羅三藐三菩提，皆從是學成。」",
        "translation": "It's the way they accomplish the accomplishment of sentient beings, purify the Buddha's land, and attain unsurpassed, perfect enlightenment.\"",
        "source": "T08n0223_008:0278c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「如是，如是！",
        "translation": "Subhūti said to Śakra Devānām-Indra, \"So it is, so it is!",
        "source": "T08n0223_008:0278c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0278c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜。",
        "translation": "\"This is the perfection of mahā, and this is the perfection of prajñā of the bodhisattva Mahāsattva.",
        "source": "T08n0223_008:0278c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量波羅蜜、無邊波羅蜜，是菩薩摩訶薩般若波羅蜜。",
        "translation": "The immeasurable perfection and limitless perfection are the bodhisattva-mahāsattva prajñāpāramitā.",
        "source": "T08n0223_008:0278c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是中學成須陀洹果乃至阿羅漢果、辟支佛道、諸菩薩摩訶薩，從是般若波羅蜜中學成。",
        "translation": "From this, the high school achieves the fruit of stream entry, up to the fruit of the arhat, the path of the solitary realizers, and the bodhisattvas, the great bodhisattvas, and from this the perfection of wisdom.",
        "source": "T08n0223_008:0279a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能成就眾生、淨佛國土，得阿耨多羅三藐三菩提——已得、今得、當得。",
        "translation": "They can accomplish the success of sentient beings, purify the Buddha's land, and attain supreme perfect enlightenment - which they have attained, will attain, and will attain.",
        "source": "T08n0223_008:0279a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0279a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色大故，般若波羅蜜亦大。",
        "translation": "Because form is great, so is prajñā-pāramitā.",
        "source": "T08n0223_008:0279a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是色前際不可得、後際不可得、中際不可得。",
        "translation": "'This is form that's unobtainable at the front end, unobtainable at the back end, and unobtainable at the middle end.'",
        "source": "T08n0223_008:0279a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識大故，般若波羅蜜亦大。",
        "translation": "Because feeling, perception, volition, and consciousness are great, so is prajñā-pāramitā.",
        "source": "T08n0223_008:0279a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識前際不可得、後際不可得、中際不可得。",
        "translation": "The prior end of feeling, perception, volition, and consciousness are unknowable, the latter end is unknowable, and the middle end is unknowable.",
        "source": "T08n0223_008:0279a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "Even omniscience is likewise.",
        "source": "T08n0223_008:0279a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，憍尸迦！",
        "translation": "For this reason, Kauśika!",
        "source": "T08n0223_008:0279a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是摩訶波羅蜜是菩薩摩訶薩般若波羅蜜。",
        "translation": "\"This perfection of mahāprajñāpāramitā is the bodhisattva Mahāsattva's perfection of wisdom.",
        "source": "T08n0223_008:0279a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0279a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色無量故，般若波羅蜜無量。",
        "translation": "Because form is immeasurable, the perfection of wisdom is immeasurable.",
        "source": "T08n0223_008:0279a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色量不可得故。",
        "translation": "\"It's because the amount of form is unknowable.",
        "source": "T08n0223_008:0279a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0279a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空量不可得，色亦如是，量不可得。",
        "translation": "Just as space is immeasurable in its amount, so is form, which is immeasurable in its amount.",
        "source": "T08n0223_008:0279a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無量故，色無量。",
        "translation": "Because space is immeasurable, form is immeasurable.",
        "source": "T08n0223_008:0279a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色無量故，般若波羅蜜無量。",
        "translation": "Because form is limitless, the perfection of wisdom is limitless.",
        "source": "T08n0223_008:0279a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識乃至一切種智無量故，般若波羅蜜無量。",
        "translation": "because feeling, perception, volition, and consciousness up to the cognition of all types are without measure, the prajñā-pāramitā is without measure.",
        "source": "T08n0223_008:0279a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279a16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切種智量不可得。",
        "translation": "\"The amount of all kinds of cognition is unknowable.",
        "source": "T08n0223_008:0279a16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空量不可得，一切種智亦如是，量不可得。",
        "translation": "Just as the amount of space is immeasurable, so too is the knowledge of all kinds, which is immeasurable in amount.",
        "source": "T08n0223_008:0279a17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空無量故，一切種智無量。",
        "translation": "Because space is immeasurable, all kinds of cognition are immeasurable.",
        "source": "T08n0223_008:0279a18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切種智無量故，般若波羅蜜無量。",
        "translation": "Because all kinds of cognition are immeasurable, prajñā-pāramitā is immeasurable.",
        "source": "T08n0223_008:0279a19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，憍尸迦！",
        "translation": "Because of these reasons, Kauśika!",
        "source": "T08n0223_008:0279a20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩般若波羅蜜無量。",
        "translation": "\"This is the immeasurable prajñā-pāramitā of the bodhisattvas and the great mahāsattvas.",
        "source": "T08n0223_008:0279a20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0279a21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色無邊故，諸菩薩摩訶薩般若波羅蜜無邊。",
        "translation": "Because form is limitless, the bodhisattvas, the mahāsattvas, and the prajñāpāramitā are limitless.",
        "source": "T08n0223_008:0279a21_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279a22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0279a22_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是色前際不可得、後際不可得、中際不可得。",
        "translation": "\"This is the first limit of form that's unobtainable, the last limit that's unobtainable, and the middle limit that's unobtainable.",
        "source": "T08n0223_008:0279a22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識無邊故，般若波羅蜜無邊。",
        "translation": "Because feeling, perception, volition, and consciousness are limitless, prajñā-pāramitā is limitless.",
        "source": "T08n0223_008:0279a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受想行識前際、後際、中際皆不可得故。",
        "translation": "It's because the first, last, and middle extremes of feeling, perception, volition, and consciousness are all unobtainable.",
        "source": "T08n0223_008:0279a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至一切種智無邊故，般若波羅蜜無邊。",
        "translation": "Up to the extent that the knowledge of all kinds is limitless, the prajñā-pāramitā is limitless.",
        "source": "T08n0223_008:0279a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切種智前、後、中際皆不可得故。",
        "translation": "It's because the prior, subsequent, and middle reaches of all kinds of cognition are all unobtainable.",
        "source": "T08n0223_008:0279a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，憍尸迦！",
        "translation": "For this reason, Kauśika!",
        "source": "T08n0223_008:0279a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜無邊，色無邊，乃至一切種智無邊。",
        "translation": "\"This is the limitlessness of the perfection of wisdom, the limitlessness of form, and the limitlessness of all kinds of cognition.",
        "source": "T08n0223_008:0279a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_008:0279a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣無邊故，般若波羅蜜無邊。」",
        "translation": "Because conditions are limitless, prajñā-pāramitā is limitless.\"",
        "source": "T08n0223_008:0279a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "\"Subhūti!",
        "source": "T08n0223_008:0279b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何緣無邊故，般若波羅蜜無邊？」",
        "translation": "How is the perfection of wisdom boundless because the conditions are boundless?\"",
        "source": "T08n0223_008:0279b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「緣一切無邊法故，般若波羅蜜無邊。」",
        "translation": "Subhūti said, \"It's because the perception of all limitless dharmas that the perfection of wisdom is limitless.\"",
        "source": "T08n0223_008:0279b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何緣一切無邊法故，般若波羅蜜無邊？」",
        "translation": "\"How is the perfection of wisdom limitless because it takes all limitless dharmas as condition?\"",
        "source": "T08n0223_008:0279b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「緣無邊法性故，般若波羅蜜無邊。",
        "translation": "Subhūti said, \"It's because of the limitless nature of reality that prajñā-pāramitā has no limit.",
        "source": "T08n0223_008:0279b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_008:0279b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣無邊如故，般若波羅蜜無邊。」",
        "translation": "It's because conditions are limitless that the perfection of wisdom is limitless.\"",
        "source": "T08n0223_008:0279b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因言：「云何緣無邊如故，般若波羅蜜無邊？」",
        "translation": "Śakra Devānām-Indra said, \"How is the prajñā-pāramitā without limit because conditions are limitless?\"",
        "source": "T08n0223_008:0279b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「如無邊故，緣亦無邊；緣無邊故，如亦無邊。",
        "translation": "Subhūti said, \"Because thusness is limitless, conditions are also limitless, and because conditions are limitless, thusness is also limitless.",
        "source": "T08n0223_008:0279b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，諸菩薩摩訶薩般若波羅蜜無邊。",
        "translation": "Because of these causes and conditions, the bodhisattvas, the mahāsattvas, and the prajñāpāramitā have no limit.",
        "source": "T08n0223_008:0279b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_008:0279b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生無邊故，般若波羅蜜無邊。」",
        "translation": "It's because sentient beings are limitless that prajñā-pāramitā is limitless.\"",
        "source": "T08n0223_008:0279b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因問須菩提：「云何眾生無邊故，般若波羅蜜無邊？」",
        "translation": "Śakra Devānām-Indra asked Subhūti, \"How is prajñā-pāramitā limitless because sentient beings are limitless?\"",
        "source": "T08n0223_008:0279b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「於意云何，何等法名眾生？」",
        "translation": "Subhūti said, \"What do you think, what do you call sentient beings?\"",
        "source": "T08n0223_008:0279b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因言：「無有法名眾生，假名故為眾生。",
        "translation": "Śakrodevānām said, \"There's no such thing as sentient beings, and it's called sentient beings because it's a false name.",
        "source": "T08n0223_008:0279b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名字本無有法亦無所趣，強為作名。」",
        "translation": "These are names that originally had no dharmas and no destinies but were forced to create names.\"",
        "source": "T08n0223_008:0279b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T08n0223_008:0279b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何，是般若波羅蜜中說眾生有實不？」",
        "translation": "What do you think, is it true that in the perfection of wisdom it's said that sentient beings exist?\"",
        "source": "T08n0223_008:0279b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因言：「無也。」",
        "translation": "Śakrodevānām said, \"No.\"",
        "source": "T08n0223_008:0279b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T08n0223_008:0279b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若般若波羅蜜實不說眾生，無邊亦不可得。",
        "translation": "\"If the perfection of wisdom really doesn't mean that sentient beings are limitless and unobtainable, then it's true.",
        "source": "T08n0223_008:0279b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0279b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何，佛如恒河沙劫壽說眾生眾生名字。",
        "translation": "What do you think, Buddha, for as long as the Ganges River eon, explains the names of sentient beings and living beings?",
        "source": "T08n0223_008:0279b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗有眾生法有生有滅不？」",
        "translation": "Could it be that there are sentient beings and dharmas that are produced and ceased?\"",
        "source": "T08n0223_008:0279b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因言：「不也。」",
        "translation": "Śakrodevānām said, \"No.\"",
        "source": "T08n0223_008:0279b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T08n0223_008:0279b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生從本已來常清淨故。",
        "translation": "It's because sentient beings have always been pure since the distant past.",
        "source": "T08n0223_008:0279b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，憍尸迦！",
        "translation": "For this reason, Kauśika!",
        "source": "T08n0223_008:0279b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生無邊故，當知般若波羅蜜亦無邊。」",
        "translation": "Because sentient beings are limitless, you should know that the perfection of wisdom is also limitless.\"",
        "source": "T08n0223_008:0279b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶般若波羅蜜經三歎品第三十(丹本作顧視品)爾時諸天王及諸天、諸梵王及諸梵天、伊賒那天及諸神仙并諸天女，同時三反稱歎：「快哉，快哉！",
        "translation": "At the time, the Heavenly Kings and Gods, the Brahma Kings and Brahma Gods, Īśāna, the sages, and the goddesses were all praising them three times, \"How pleasant, how pleasant!",
        "source": "T08n0223_008:0279b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧命須菩提所說法，皆是佛出世間因緣恩力演布是教。",
        "translation": "\"The teachings that Wisdom Life Subhūti gives are all the result of the Buddha's grace in explaining the causes and conditions for his appearances in the world.",
        "source": "T08n0223_008:0279b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩摩訶薩行是般若波羅蜜不遠離者，我輩視是人如佛。",
        "translation": "If there are bodhisattvas, mahāsattvas, and people who practice this prajñāpāramit and don't stray from it, we regard those people as buddhas.",
        "source": "T08n0223_008:0279b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜中雖無法可得——所謂色受想行識乃至一切種智；而有三乘之教——所謂聲聞乘、辟支佛乘、佛乘。」",
        "translation": "Although there's nothing to attain in the perfection of wisdom - the so-called form, feeling, perception, volition, and consciousness - there are the teachings of the three vehicles - the so-called śrāvaka vehicle, pratyekabuddha vehicle, and buddha vehicle.\"",
        "source": "T08n0223_008:0279c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸天子：「如是，如是！",
        "translation": "It was then that the Buddha addressed the celestials, \"So it is, so it is!",
        "source": "T08n0223_008:0279c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "all the sons of gods!",
        "source": "T08n0223_008:0279c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言，是般若波羅蜜中雖無法可得——所謂色受想行識乃至一切種智；而有三乘之教——所謂聲聞乘辟支佛乘佛乘。",
        "translation": "As you say, although there's nothing to attain in the perfection of wisdom - that is, form, feeling, perception, volition, and consciousness - there are the teachings of the three vehicles - the so-called śrāvaka vehicle, the pratyekabuddha vehicle, and the Buddha vehicle.",
        "source": "T08n0223_008:0279c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "My lords!",
        "source": "T08n0223_008:0279c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩摩訶薩行是般若波羅蜜不遠離者，視是人當如佛。",
        "translation": "\"If there's a bodhisattva Mahāsattva who practices this prajñāpāramit and doesn't stray from it, he or she will regard that person as a Buddha.",
        "source": "T08n0223_008:0279c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無所得故。",
        "translation": "That's because they have nothing to gain.",
        "source": "T08n0223_008:0279c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0279c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜中廣說三乘之教，所謂聲聞、辟支佛、佛乘。",
        "translation": "\"In this perfection of wisdom, the teachings of the three vehicles are explained in detail, which are called the śrāvaka, pratyekabuddha, and buddha vehicles.",
        "source": "T08n0223_008:0279c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "檀那波羅蜜中佛不可得，離檀那波羅蜜佛亦不可得。",
        "translation": "A Buddha in the perfection of giving can't be obtained, and a Buddha apart from the perfection of giving can't be obtained either.",
        "source": "T08n0223_008:0279c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至般若波羅蜜中佛不可得，離般若波羅蜜佛亦不可得。",
        "translation": "Even the Buddha in the perfection of wisdom is unobtainable, and the Buddha apart from the perfection of wisdom is also unobtainable.",
        "source": "T08n0223_008:0279c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空乃至無法有法空，四念處乃至十八不共法，一切種智亦如是。」",
        "translation": "So is internal emptiness ... emptiness of nonexistence ... the four abodes of mindfulness ... the 18 distinctive qualities ... and all kinds of cognition.\"",
        "source": "T08n0223_008:0279c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸天子：「菩薩摩訶薩若能學是一切法，所謂檀那波羅蜜乃至一切種智，以是事故，當視是菩薩摩訶薩如佛。",
        "translation": "The Buddha said to the celestials, \"If a bodhisattva Mahāsattva can train in all these things, which are called the perfection of giving and even the cognition of all distinctive qualities, this is an event that will cause him to be considered a bodhisattva Mahāsattva like a Buddha.",
        "source": "T08n0223_008:0279c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "Sons of the gods!",
        "source": "T08n0223_008:0279c18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔於然燈佛時，花嚴城內四衢道頭見佛聞法，即得不離檀那波羅蜜行，不離尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜行。",
        "translation": "In the past, when I saw the Buddha and heard the Dharma at the head of the four roads in the city of Huayan, I attained the practice of not parting from the perfection of giving, not parting from the perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of prajñā.",
        "source": "T08n0223_008:0279c18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不離內空乃至無法有法空，四念處乃至八聖道分。",
        "translation": "They don't part with internal emptiness or even the emptiness of nonexistence, the four abodes of mindfulness or even the eight noble factors of the path.",
        "source": "T08n0223_008:0279c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不離四禪、四無量心、四無色定、一切三昧門、一切陀羅尼門。",
        "translation": "They don't part with the four meditations, the four immeasurable states of mind, the four formless concentrations, all samādhi teachings, and all dhāraṇī teachings.",
        "source": "T08n0223_008:0279c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不離四無所畏、佛十力、四無礙智、十八不共法、大慈大悲，及餘無量諸佛法行。",
        "translation": "They don't part from the four fearlessnesses, the Buddha's ten powers, the four unhindered cognitions, the 18 distinctive qualities, great kindness and compassion, and countless other Buddha-teachings.",
        "source": "T08n0223_008:0279c24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所得故。",
        "translation": "There's nothing to be gained from them.",
        "source": "T08n0223_008:0279c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時然燈佛記我當來世過一阿僧祇劫當作佛，號釋迦牟尼多陀阿伽度、阿羅訶、三藐三佛陀、毘侈遮羅那、修伽度、路伽憊、無上士、調御丈夫、天人師、佛世尊。」",
        "translation": "Randana then remembered that I would become a buddha in a future incalculably long eon and be called Śākyamuni, Tathāgata, Ārāha, Samyak-saṃbuddha, Vidyā-caraṇa, Sugata, Rājagṛha, the unsurpassed man, the tamer, the teacher of gods and humans, and the world honored Buddha.\"",
        "source": "T08n0223_008:0279c26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸天子白佛言：「世尊！",
        "translation": "It was then that the celestials said to the Buddha, \"Bhagavān!",
        "source": "T08n0223_008:0280a01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚希有是般若波羅蜜，能令諸菩薩摩訶薩得薩婆若，於色不取不捨故，於受想行識不取不捨故，乃至一切種智不取不捨故。」",
        "translation": "Rarely does this prajñā-pāramitā enable bodhisattvas, mahāsattvas, to attain sarvajña, so that they don't grasp or disregard form, don't grasp or disregard feeling, perception, volition, and consciousness, and don't grasp or disregard all kinds of cognition.\"",
        "source": "T08n0223_008:0280a01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛觀四眾和合——比丘、比丘尼、優婆塞、優婆夷——及諸菩薩摩訶薩，并四天王天乃至阿迦尼吒諸天皆會坐。",
        "translation": "It was then that the Buddha observed the four groups of people in harmony - monks, bhikṣus and nuns, laymen, and laywomen - and the bodhisattvas, mahāsattvas, and the four heavenly kings and gods of Akaniṣṭha all sitting together.",
        "source": "T08n0223_008:0280a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普觀是已，佛告釋提桓因言：「憍尸迦！",
        "translation": "After observing them all, the Buddha addressed Śakrodevānām-Indra, saying, \"Kauśika!",
        "source": "T08n0223_008:0280a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩、若比丘、若比丘尼、若優婆塞、若優婆夷、若諸天子、若諸天女，是般若波羅蜜，若聽受持親近讀誦、為他說正憶念、不離薩婆若心，諸天子！",
        "translation": "\"If bodhisattvas, or monks, or bhikṣuṇīs, or laymen, or laywomen, or gods and goddesses, hear, uphold, intimately recite, teach others about right recollection, and do not part from the mind of the sarvajña, sons of gods!",
        "source": "T08n0223_008:0280a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人，魔若魔民不能得其便。",
        "translation": "\"This is a person whom Māra would not be able to get an advantage over if he were a demon or a demon's people.",
        "source": "T08n0223_008:0280a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0280a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，諦了知色空，空不能得空便，無相不能得無相便，無作不能得無作便。",
        "translation": "\"Good men and good women, when you truly know that form is empty, it's not possible to be empty, it's not possible to be without form, and it's not possible to be without form without doing anything.",
        "source": "T08n0223_008:0280a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦了知受想行識空，空不能得空便，乃至無作不能得無作便。",
        "translation": "Truthfully knowing the emptiness of feeling, perception, volition, and consciousness, it's not possible to be empty and obtain the skill of emptiness, and it's not possible to be unconstructed and obtain the skill of unconstructedness.",
        "source": "T08n0223_008:0280a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至諦了知一切種智空，空不能得空便，乃至無作不能得無作便。",
        "translation": "... truly knowing the emptiness of all kinds of cognition, it's not possible to be empty and it's not possible to be unconstructed without effort.",
        "source": "T08n0223_008:0280a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0280a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸法自相性不可得，無事可得便，誰受惱者？",
        "translation": "Who is afflicted by the fact that the own-natures of these things are unobtainable and that nothing can be done about them?",
        "source": "T08n0223_008:0280a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T08n0223_008:0280a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，人非人不能得其便。",
        "translation": "\"Good men and good women, humans and non-humans can't get an advantage over them.",
        "source": "T08n0223_008:0280a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0280a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，一切眾生中善修慈心，悲、喜、捨心，以無所得故。",
        "translation": "\"Good men and good women, among all sentient beings, they well cultivate the mind of kindness, pity, joy, and equanimity because they have nothing to gain.",
        "source": "T08n0223_008:0280a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0280a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，終不橫死。",
        "translation": "\"Good men and good women, they will never cross over to death.",
        "source": "T08n0223_008:0280a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0280a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人行檀那波羅蜜，於一切眾生等心供給故。",
        "translation": "These good men and good women practice the perfection of giving because they make offerings to all sentient beings with equal attention.",
        "source": "T08n0223_008:0280a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T08n0223_008:0280a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天、梵天、光音天、遍淨天、廣果天，是諸天中有發阿耨多羅三藐三菩提心者，未聞是般若波羅蜜、未受持親近，是諸天子今應聞受持親近讀誦、正憶念、不離薩婆若心。",
        "translation": "\"Among the four heavenly kings, the Trāyastriṃśa Heaven, the Yama Heaven, the Tuṣita Heaven, the Nirmāṇarati Heaven, the Paranirmitavaśavartin Heaven, the Brahma Heaven, the Luminous Sound Heaven, the Pervasively Pure Heaven, and the Vairocana Heaven of the trichiliocosm, there are gods who have aroused the mind of unsurpassed, correct recollection, and the mind of not departing from the sarvajña, but who have not heard of this perfection of wisdom and have not yet received it close to them.",
        "source": "T08n0223_008:0280a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T08n0223_008:0280b01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善男子、善女人聞是般若波羅蜜，受持親近讀誦、正憶念、不離薩婆若心，是諸善男子、善女人，若在空舍、若在曠野、若人住處，終不怖畏。",
        "translation": "\"Good men and good women who hear this perfection of wisdom and who accept, read, and recite it intimately, correctly recollect it, and don't part with the mind of a sarvajña, those good men and good women will never be afraid if they're in an empty house, in the wilderness, or in a human dwelling.",
        "source": "T08n0223_008:0280b02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0280b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人明於內空，以無所得故。",
        "translation": "Good sons and good women understand internal emptiness because it's unobtainable.",
        "source": "T08n0223_008:0280b05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明於外空乃至無法有法空，以無所得故。」",
        "translation": "They understand external emptiness and the emptiness of nonexistence as well as dharmas because they have nothing to gain.\"",
        "source": "T08n0223_008:0280b06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時三千大千世界中諸四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天，乃至首陀婆諸天，白佛言：「世尊！",
        "translation": "It was then that the four heavenly kings, the Trāyastriṃśa gods, the Yama gods, the Tuṣita gods, the Nirmāṇarati gods, the Paranirmitavaśavartin gods, and even the Śuddhâvāsa gods of the 3,000 great one-thousand worlds said to the Buddha, \"Bhagavān!",
        "source": "T08n0223_008:0280b07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人能受持般若波羅蜜，親近讀誦、正憶念、不離薩婆若心者，我等常當守護。",
        "translation": "\"We will always guard good men and good women who can accept the perfection of wisdom, intimately recite it, correctly remember it, and not part with the mind of a sarvajña.",
        "source": "T08n0223_008:0280b10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0280b12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_008:0280b12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩因緣故，斷三惡道、斷天人貧、斷諸災患疾病飢餓。",
        "translation": "Because of the bodhisattva's causes and conditions, the three bad destinies are ended, the poverty of gods and humans is ended, and disasters, illness, hunger, and starvation are ended.",
        "source": "T08n0223_008:0280b12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩因緣故，便有十善道現於世間，四禪、四無量心、四無色定，檀那波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜，內空乃至無法有法空，四念處乃至一切種智。",
        "translation": "Because of the bodhisattva's causes and conditions, there are the ten good destinies that appear in the world, the four meditations, the four immeasurable states of mind, the four formless concentrations, the perfection of giving, the perfection of śīla, the perfection of adultery, the perfection of vairocana, the perfection of meditation, the perfection of wisdom, internal emptiness up to the emptiness of nonexistence, and the four abodes of mindfulness up to the knowledge of all kinds.",
        "source": "T08n0223_008:0280b14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩因緣故，世間便有剎利大姓、婆羅門大姓、居士大家、諸王及轉輪聖王，四天王天乃至阿迦尼吒天。",
        "translation": "Because of the bodhisattva's causes, there are in the world great families of warriors, great families of brāhmaṇas, great families of householders, kings and wheel-turning sage kings, and the four heavenly kings and even the Akaniṣṭha Heaven.",
        "source": "T08n0223_008:0280b18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩因緣故，有須陀洹須陀洹果乃至阿羅漢阿羅漢果、辟支佛辟支佛道。",
        "translation": "Because of bodhisattva causes and conditions, there's the fruit of stream entry, the fruit of the arhat, the fruit of the arhat, and the path of the pratyekabuddha and pratyekabuddha.",
        "source": "T08n0223_008:0280b21_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩因緣故，有成就眾生、淨佛國土，便有諸佛出現於世，便有轉法輪，知有佛寶、法寶、比丘僧寶。",
        "translation": "Because of bodhisattva causes and conditions, there's the consummation of sentient beings and the purification of buddha-lands, then the buddhas appear in the world, then the turning of the wheel of the Dharma, and the knowledge that there are buddha-jewel, dharma-jewel, and monk-jewel.",
        "source": "T08n0223_008:0280b22_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_008:0280b25_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，一切世間諸天及人、阿修羅，應守護是菩薩摩訶薩。」",
        "translation": "Because of these causes and conditions, all the gods, humans, and asuras of the world should guard this bodhisattva Mahāsattva.\"",
        "source": "T08n0223_008:0280b25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語釋提桓因：「如是，如是！",
        "translation": "The Buddha said to Śakra Devānām-Indra, \"So it is, so it is!",
        "source": "T08n0223_008:0280b26_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0280b27_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩因緣故，斷三惡道乃至三寶出現於世。",
        "translation": "It's because of the causes and conditions of the bodhisattva Mahāsattva that the three bad destinies and even the Three Treasures appear in the world.",
        "source": "T08n0223_008:0280b27_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，諸天及人、阿修羅，常應守護供養、恭敬尊重讚歎是菩薩摩訶薩。",
        "translation": "Because of this, gods, humans, and asuras should always guard, support, respect, and venerate this bodhisattva-mahāsattva.",
        "source": "T08n0223_008:0280b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0280c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養恭敬尊重讚歎是菩薩摩訶薩，即是供養我。",
        "translation": "Making offerings to, honoring, respecting, and praising this bodhisattva-mahāsattva is making offerings to me.",
        "source": "T08n0223_008:0280c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，是諸菩薩摩訶薩，諸天及人、阿修羅，常應守護供養、恭敬尊重讚歎。",
        "translation": "Because of this, these bodhisattvas, mahāsattvas, gods, humans, and asuras should always guard, support, respect, venerate, and praise them.",
        "source": "T08n0223_008:0280c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0280c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界滿中聲聞、辟支佛，譬如竹葦稻麻叢林。",
        "translation": "Suppose the 3,000 great one-thousand worlds were filled with śrāvakas and pratyekabuddhas like groves of bamboo, reeds, rice, and hemp.",
        "source": "T08n0223_008:0280c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子、善女人供養恭敬、尊重讚歎。",
        "translation": "Suppose there are good men and good women who make offerings, venerate, respect, and praise them.",
        "source": "T08n0223_008:0280c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不如供養恭敬尊重讚歎初發心菩薩摩訶薩不離六波羅蜜所得福德。",
        "translation": "They don't offer support, honor, respect, and praise the merit gained by first-aspiring bodhisattvas and mahāsattvas who don't part with the six perfections.",
        "source": "T08n0223_008:0280c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0280c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以聲聞、辟支佛因緣故，有菩薩摩訶薩及諸佛出現於世。",
        "translation": "It's not because of the causes and conditions of śrāvakas and pratyekbuddhas that there are bodhisattvas, mahāsattvas, and buddhas who appear in the world.",
        "source": "T08n0223_008:0280c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以有菩薩摩訶薩因緣故，有聲聞、辟支佛、諸佛出現於世。",
        "translation": "It's because of the presence of bodhisattvas, great buddhas, and buddhas in the world that there are śrāvakas and pratyekbuddhas.",
        "source": "T08n0223_008:0280c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，憍尸迦！",
        "translation": "Therefore, Kauśika!",
        "source": "T08n0223_008:0280c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩摩訶薩，一切世間諸天及人、阿修羅，常應守護供養恭敬尊重讚歎。」",
        "translation": "Such are the bodhisattvas, mahāsattvas, gods, humans, and asuras of the world who should always guard, support, respect, honor, and praise them.\"",
        "source": "T08n0223_008:0280c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶般若波羅蜜經滅諍品第三十一(丹本名為現功德品)爾時釋提桓因白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, \"Bhagavān!",
        "source": "T08n0223_008:0280c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚奇希有。",
        "translation": "\"It's rare and amazing.",
        "source": "T08n0223_008:0280c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩，是般若波羅蜜若聞受持、親近讀誦、為他說、正憶念時，得如是今世功德。",
        "translation": "When bodhisattvas, mahāsattvas, hear, retain, intimately recite, teach for others, and correctly remember this prajñāpāramit, they attain such merits in the present life.",
        "source": "T08n0223_008:0280c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦成就眾生、嚴淨佛國土。",
        "translation": "It also completes sentient beings and glorifies and purifies the Buddha's land.",
        "source": "T08n0223_008:0280c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從一佛國至一佛國供養諸佛，所欲供養之具隨意即得。",
        "translation": "From one Buddha land to another, he makes offerings to the buddhas, and he obtains the necessities he needs to make offerings at will.",
        "source": "T08n0223_008:0280c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從諸佛聞法，至得阿耨多羅三藐三菩提終不中忘。",
        "translation": "From the buddhas they hear the Dharma, they'll attain unsurpassed, correct, and complete enlightenment that's never lost.",
        "source": "T08n0223_008:0280c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦得家成就、母成就、生成就、眷屬成就、相成就、光明成就、眼成就、耳成就、三昧成就、陀羅尼成就。",
        "translation": "They also attain the accomplishment of a home, the accomplishment of a mother, the accomplishment of a birth, the accomplishment of an attendant, the accomplishment of characteristics, the accomplishment of light, the accomplishment of the eye, the accomplishment of the ear, the accomplishment of samādhi, and the accomplishment of a dhāraṇī.",
        "source": "T08n0223_008:0280c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩以方便力故，變身如佛，從一國至一國到無佛處，讚檀那波羅蜜乃至般若波羅蜜，讚四禪、四無量心、四無色定，讚四念處乃至十八不共法，以方便力而為說法，以三乘法度脫眾生，所謂聲聞、辟支佛、佛乘。",
        "translation": "Because of the power of skillful means, this bodhisattva transforms himself into a buddha, going from one country to another to no buddha at all, praising the perfection of dhyāna and even the perfection of prajñāpāramitā, the four meditations, the four immeasurable states of mind, the four formless concentrations, the four abodes of mindfulness, and even the 18 distinctive qualities, teaching by the power of skillful means, and liberating sentient beings with the teachings of the three vehicles, which are called the śrāvaka, pratyekabuddha, and buddha vehicles.",
        "source": "T08n0223_008:0280c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_008:0281a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快哉希有。",
        "translation": "How wonderful and rare!",
        "source": "T08n0223_008:0281a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受持般若波羅蜜，為已總攝五波羅蜜乃至十八不共法，亦攝須陀洹果乃至阿羅漢果、辟支佛道、佛道，一切智、一切種智。」",
        "translation": "By upholding the perfection of wisdom, I've collected the five perfections up to the 18 distinctive qualities, as well as the fruit of stream entry up to the fruit of the arhat, the pratyekabuddha path, the Buddha path, and omniscience and omniscience.\"",
        "source": "T08n0223_008:0281a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告釋提桓因：「如是，如是！",
        "translation": "The Buddha told Śakra Devānām-Indra, \"So it is, so it is!",
        "source": "T08n0223_008:0281a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0281a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持般若波羅蜜，為已總攝五波羅蜜乃至一切種智。",
        "translation": "\"By upholding the perfection of wisdom, they've collected the five perfections up to the knowledge of all kinds.",
        "source": "T08n0223_008:0281a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_008:0281a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜受持親近讀誦、為他說、正憶念，是善男子、善女人所得今世功德，汝一心諦聽。」",
        "translation": "This prajñāpāramit, which is memorized, intimately recited, explained for others, and correctly recollected, is the merit in this world that good sons and good women attain, so listen with single-minded attention.\"",
        "source": "T08n0223_008:0281a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因言：「唯然，世尊！",
        "translation": "Śakrodevānām said, \"Yes, Bhagavān!",
        "source": "T08n0223_008:0281a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受教。」",
        "translation": "Receive the teaching.\"",
        "source": "T08n0223_008:0281a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告釋提桓因言：「憍尸迦！",
        "translation": "The Buddha told Śakrodevānām-Indra, \"Kauśika!",
        "source": "T08n0223_008:0281a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有外道諸梵志、若魔若魔民、若增上慢人，欲乖錯破壞菩薩般若波羅蜜心。",
        "translation": "\"If there are non-Buddhist priests, Māra, Māra's people, or conceited people who want to misconstrue and disrupt the bodhisattva's mind of prajñāpāramitā, then they'll immediately cease, never following their vow.",
        "source": "T08n0223_008:0281a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸人適生此心，即時滅去，終不從願。",
        "translation": "Those people then suitably give rise to this mind, which immediately goes away and never follows their vows.",
        "source": "T08n0223_008:0281a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0281a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0281a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩長夜行檀那波羅蜜，行尸羅、羼提、毘梨耶、禪那、般若波羅蜜。",
        "translation": "For a long time, the bodhisattva Mahāsattva practiced the perfection of giving, and he practiced the perfections of śīla, kṣanti, vīrya, dhyāna, and prajñā.",
        "source": "T08n0223_008:0281a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生長夜貪諍故，菩薩悉捨內外物，安立眾生於檀那波羅蜜中。",
        "translation": "Because of the many long nights of greed and strife, the bodhisattva fully abandons internal and external things and establishes sentient beings in the perfection of dāna.",
        "source": "T08n0223_008:0281a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生長夜破戒故，菩薩悉捨內外法，安立眾生於戒。",
        "translation": "Because there are many long nights when the precepts are violated, the bodhisattvas readily abandon internal and external things and establish sentient beings in the precepts.",
        "source": "T08n0223_008:0281a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生長夜鬪諍故，菩薩悉捨內外法，安立眾生於忍辱。",
        "translation": "Because of the many long nights of struggle, the bodhisattva always gives up internal and external things and establishes sentient beings in forbearance.",
        "source": "T08n0223_008:0281a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生長夜懈怠故，菩薩悉捨內外法，安立眾生於精進。",
        "translation": "Because of the many long nights of laziness, the bodhisattva always gives up internal and external principles and establishes in sentient beings their effort.",
        "source": "T08n0223_008:0281a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生長夜亂心故，菩薩悉捨內外法，安立眾生於禪那。",
        "translation": "Because of the many long nights of mental agitation, the bodhisattva always gives up internal and external principles and establishes sentient beings in meditation.",
        "source": "T08n0223_008:0281a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生長夜愚癡故，菩薩悉捨內外法，安立眾生於般若波羅蜜。",
        "translation": "Because of the many long nights of folly, the bodhisattva always gives up internal and external principles and establishes sentient beings in the perfection of wisdom.",
        "source": "T08n0223_008:0281a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生長夜為愛結故流轉生死，是菩薩摩訶薩以方便力斷眾生愛結，安立眾生於四禪、四無量心、四無色定，四念處乃至八聖道分，空、無相、無作三昧。",
        "translation": "Because the bond of craving for sentient beings grows during the long night and transmigration, the bodhisattva Mahāsattva uses the power of skillful means to sever the bond of craving for sentient beings and establish them in the four meditations, the four immeasurable states of mind, the four formless concentrations, the four abodes of mindfulness ... the eight noble factors of the path, and the samādhi of emptiness, signlessness, and unconstructedness.",
        "source": "T08n0223_008:0281a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安立眾生於須陀洹果乃至阿羅漢果、辟支佛道、佛道。",
        "translation": "It establishes sentient beings in the fruit of stream entry ... the fruit of the arhat, the path of the pratyekabuddhas, and the path of the buddhas.",
        "source": "T08n0223_008:0281a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0281a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩行般若波羅蜜得現世功德、後世功德，得阿耨多羅三藐三菩提、轉法輪，所願滿足入無餘涅槃。",
        "translation": "This is the bodhisattva-mahāsattva who practices prajñāpāramit to attain merits in the present life and merits in the hereafter, attain supreme perfect enlightenment, turn the wheel of the Dharma, and fulfill his vows to enter nirvāṇa without remainder.",
        "source": "T08n0223_008:0281a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0281b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩後世功德。",
        "translation": "This is the bodhisattva Mahāsattva's merit in later lifetimes.",
        "source": "T08n0223_008:0281b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T08n0223_008:0281b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子、善女人，是般若波羅蜜若聞受持親近讀誦、為他說、正憶念，其所住處，魔若魔民、若外道梵志、增上慢人，欲輕毀難問破壞般若波羅蜜，終不能成。",
        "translation": "\"Good sons and good women, if you hear, retain, intimately recite, teach, and correctly remember this prajñāpāramit, where they live, Māra, Māra's people, heretics, priests, and conceited people who want to despise the Prajñāpāramit and disrupt it will never be able to do so.",
        "source": "T08n0223_008:0281b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人惡心轉滅，功德轉增，聞是般若波羅蜜故，漸以三乘道得盡眾苦。",
        "translation": "That person's bad intentions are gradually extinguished, their virtues are increased, and they gradually end their many sufferings by following the path of the three vehicles because they hear this prajñāparamit.",
        "source": "T08n0223_008:0281b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如，憍尸迦！",
        "translation": "Such is the case, Kauśika!",
        "source": "T08n0223_008:0281b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有藥名摩祇。",
        "translation": "\"There's a medicine called maghī.",
        "source": "T08n0223_008:0281b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有蛇飢行索食，見虫欲噉。",
        "translation": "A snake walks around hungry for food and sees a bug that wants to eat it.",
        "source": "T08n0223_008:0281b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虫趣藥所，藥氣力故，蛇不能前，即自還去。",
        "translation": "When the insect goes to the medicine, the snake can't get ahead because of the medicine's energy, so it just returns.",
        "source": "T08n0223_008:0281b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0281b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是藥力能勝毒故。",
        "translation": "\"It's because of the power of this medicine that it's superior to poison.",
        "source": "T08n0223_008:0281b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_008:0281b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩祇藥有如是力。",
        "translation": "\"This is the power of magical herbs.",
        "source": "T08n0223_008:0281b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，是般若波羅蜜若聞受持親近讀誦、為他說、正憶念，若有種種鬪諍起，欲來破壞者，以般若波羅蜜威力故，隨所起處即疾消滅。",
        "translation": "\"Good men and good women, if you hear, retain, recite, read for others, and correctly remember this prajñāparamit, and if various kinds of quarrels arise that want to disrupt them, then by the power of prajñāparamit, whatever place it arises will quickly go away.",
        "source": "T08n0223_008:0281b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人即生善心增益功德。",
        "translation": "That person then produces good thoughts and gains merit.",
        "source": "T08n0223_008:0281b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0223_008:0281b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜能滅諸法諍亂。",
        "translation": "\"This perfection of wisdom can end disputes and disagreements about dharmas.",
        "source": "T08n0223_008:0281b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等諸法？",
        "translation": "What are these dharmas?",
        "source": "T08n0223_008:0281b18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂婬、怒、癡、無明乃至大苦聚、諸蓋結使纏。",
        "translation": "They are lust, anger, delusion, ignorance, the great mass of suffering, and the binding of afflictive tendencies.",
        "source": "T08n0223_008:0281b18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見、人見、眾生見，斷見常見、垢見淨見、有見無見。",
        "translation": "They are views of self, views of people, views of sentient beings, views of elimination and commonness, views of defilement and purity, and views of existence and nonexistence.",
        "source": "T08n0223_008:0281b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切諸見，慳貪犯戒、瞋恚懈怠、亂意無智，常想樂想淨想我想，如是等愛行，著色著受想行識，著檀那波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜，著內空、外空、內外空乃至無法有法空，著四念處乃至十八不共法，著一切智、一切種智，著涅槃。",
        "translation": "Thus, all views, stinginess, greed, transgressions, anger, laziness, disturbed thoughts, ignorance, thoughts of permanence, pleasure, purity, and self, such desirous actions, attachment to form, attachment to feeling, perception, volition, and consciousness, attachment to the perfection of giving, the perfection of morality, the perfection of śīla, the perfection of kṣatriya, the perfection of meditation, the perfection of prajñā, attachment to internal emptiness, external emptiness, internal and external emptiness, and even the emptiness of nonexistence, attachment to the four abodes of mindfulness and even the 18 distinctive qualities, attachment to omniscience and omniscience, and attachment to nirvāṇa.",
        "source": "T08n0223_008:0281b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是一切法諍亂，盡能消滅不令增長。",
        "translation": "These are all the phenomenal disputes and disturbances that can be completely extinguished and won't grow.",
        "source": "T08n0223_008:0281b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T08n0223_008:0281b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界中諸四天王天、諸釋提桓因、諸梵天王乃至阿迦尼吒天，常守護是善男子、善女人能聞受持般若波羅蜜，供養讀誦、為他說、正憶念般若波羅蜜者。",
        "translation": "The four heavenly kings, the Śakra Devānām-Indra, the Brahmakāyika gods, and even the Akaniṣṭha gods in the trichiliocosm always guard that good man or woman who can hear and retain the prajñāpāramitā, make offerings, recite it, teach it for others, and correctly recall it.",
        "source": "T08n0223_008:0281b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方現在諸佛亦共擁護是善男子、善女人能聞受持、供養讀誦、為他說、正憶念般若波羅蜜者。",
        "translation": "The buddhas of the present in the ten directions also share that protection with that good man or woman who can hear and retain, make offerings, recite, teach for others, and correctly recall the prajñāpāramitā.",
        "source": "T08n0223_008:0281c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，不善法滅，善法轉增。",
        "translation": "Such a good man or woman will cease unskillful qualities and increase good qualities.",
        "source": "T08n0223_008:0281c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂檀那波羅蜜轉增，以無所得故。",
        "translation": "The so-called perfection of giving increases because it's unobtainable.",
        "source": "T08n0223_008:0281c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至般若波羅蜜轉增，以無所得故。",
        "translation": "... the perfection of prajñā increases because it's unobtainable.",
        "source": "T08n0223_008:0281c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空轉增，乃至無法有法空轉增，以無所得故。",
        "translation": "internal emptiness increases, and even the emptiness of nonexistence and dharmas increases because there's nothing to be gained.",
        "source": "T08n0223_008:0281c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念處乃至十八不共法轉增，以無所得故。",
        "translation": "The four abodes of mindfulness and even the 18 distinctive qualities increase because they are unobtainable.",
        "source": "T08n0223_008:0281c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸三昧門、諸陀羅尼門、一切智、一切種智轉增，以無所得故。",
        "translation": "The approach of samādhi, the approach of dhāraṇī, omniscience, and omniscience increase because there's nothing to be gained.",
        "source": "T08n0223_008:0281c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人所說，人皆信受。",
        "translation": "These are teachings by good men and good women that are believed and accepted by people.",
        "source": "T08n0223_008:0281c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親友堅固。",
        "translation": "Their friends and relatives are resolute.",
        "source": "T08n0223_008:0281c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不說無益之語，不為瞋恚所覆，不為憍慢、慳貪、嫉妬所覆。",
        "translation": "They don't speak useless words, aren't hindered by anger, and aren't hindered by pride, stinginess, and jealousy.",
        "source": "T08n0223_008:0281c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人自不殺生，教人不殺生，讚歎不殺生法，亦歡喜讚歎不殺生者。",
        "translation": "That person doesn't kill life themselves, teaches others not to kill life, praises the teaching not to kill life, and rejoices in praising someone who doesn't kill life.",
        "source": "T08n0223_008:0281c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自遠離不與取，亦教人遠離不與取，讚遠離不與取法，亦歡喜讚歎遠離不與取者。",
        "translation": "He himself parts with taking what's not given, teaches others to part with taking what's not given, praises what's part with taking what's not given, and rejoices in praising someone who parts with taking what's not given.",
        "source": "T08n0223_008:0281c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自不邪婬，教人不邪婬，讚不邪婬法，亦歡喜讚歎不邪婬者。",
        "translation": "He himself doesn't commit sexual misconduct, teaches others not to commit sexual misconduct, praises the teaching of not committing sexual misconduct, and rejoices in and praises those who don't commit sexual misconduct.",
        "source": "T08n0223_008:0281c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自不妄語，教人不妄語，讚不妄語法，亦歡喜讚歎不妄語者。",
        "translation": "He himself doesn't lie, teaches others not to lie, praises the teaching not to lie, and rejoices in and praises those who don't lie.",
        "source": "T08n0223_008:0281c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩舌、惡口、無利益語亦如是。",
        "translation": "So it is with duplicity, harsh words, and unprofitable speech.",
        "source": "T08n0223_008:0281c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自不貪，教人不貪，讚不貪法，亦歡喜讚歎不貪者。",
        "translation": "He himself doesn't crave, teaches others not to crave, praises the teaching not to crave, and rejoices in and praises someone who doesn't crave.",
        "source": "T08n0223_008:0281c20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不瞋惱、不邪見亦如是。",
        "translation": "So it is when they don't get angry and don't hold wrong views.",
        "source": "T08n0223_008:0281c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行檀那波羅蜜，教人行檀那波羅蜜，讚檀那波羅蜜法，亦歡喜讚歎行檀那波羅蜜者。",
        "translation": "He himself gives the perfection of giving, teaches others to practice the perfection of giving, praises the teaching of the perfection of giving, and rejoices in and praises those who practice the perfection of giving.",
        "source": "T08n0223_008:0281c22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行尸羅波羅蜜，教人行尸羅波羅蜜，讚尸羅波羅蜜法，亦歡喜讚歎行尸羅波羅蜜者。",
        "translation": "He himself practices the perfection of śīla, teaches others to practice the perfection of śīla, praises the teachings of the perfection of śīla, and rejoices in and praises those who practice the perfection of śīla.",
        "source": "T08n0223_008:0281c24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行羼提波羅蜜，教人行羼提波羅蜜，讚羼提波羅蜜法，亦歡喜讚歎行羼提波羅蜜者。",
        "translation": "He himself practices the perfection of śrāvaka, teaches others to practice the perfection of śrāvaka, praises the method of the perfection of śrāvaka, and rejoices in and praises those who practice the perfection of śrāvaka.",
        "source": "T08n0223_008:0281c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行毘梨耶波羅蜜，教人行毘梨耶波羅蜜，讚毘梨耶波羅蜜法，亦歡喜讚歎行毘梨耶波羅蜜者。",
        "translation": "He himself practices the perfection of vairocana, teaches others to practice the perfection of vairocana, praises the teachings of the perfection of vairocana, and rejoices in and praises those who practice the perfection of vairocana.",
        "source": "T08n0223_008:0281c29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行禪那波羅蜜，教人行禪那波羅蜜，讚禪那波羅蜜法，亦歡喜讚歎行禪那波羅蜜者。",
        "translation": "He himself practices the perfection of meditation, teaches others to practice the perfection of meditation, praises the teachings of the perfection of meditation, and rejoices in and praises those who practice the perfection of meditation.",
        "source": "T08n0223_008:0282a02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行般若波羅蜜，教人行般若波羅蜜，讚般若波羅蜜法，亦歡喜讚歎行般若波羅蜜者。",
        "translation": "He himself practices the perfection of prajñā, teaches others to practice the perfection of prajñā, praises the teachings of the perfection of prajñā, and rejoices in and praises those who practice the perfection of prajñā.",
        "source": "T08n0223_008:0282a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自修內空，教人修內空，讚內空法，亦歡喜讚歎修內空者。",
        "translation": "He cultivates internal emptiness on his own, teaches others to cultivate internal emptiness, praises the teaching of internal emptiness, and rejoices in and praises those who cultivate internal emptiness.",
        "source": "T08n0223_008:0282a06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至自修無法有法空，教人修無法有法空，讚無法有法空法，亦歡喜讚歎修無法有法空者。",
        "translation": "Even he himself cultivates the emptiness of nonexistence, teaches others to cultivate the emptiness of nonexistence, praises the emptiness of nonexistence, and rejoices in and praises those who cultivate the emptiness of nonexistence.",
        "source": "T08n0223_008:0282a08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自入一切三昧中，教人入一切三昧中，讚一切三昧法，亦歡喜讚歎行一切三昧者。",
        "translation": "He enters into all samādhis, teaches others to enter into all samādhis, praises the teaching of all samādhis, and rejoices in and praises those who practice all samādhis.",
        "source": "T08n0223_008:0282a10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自得陀羅尼，教人得陀羅尼，讚陀羅尼法，亦歡喜讚歎得陀羅尼者。",
        "translation": "He himself attains the dhāraṇī, teaches others to attain the dhāraṇī, praises the dhāraṇī teaching, and rejoices in and praises those who have attained the dhāraṇī.",
        "source": "T08n0223_008:0282a12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自入初禪，教人入初禪，讚初禪法，亦歡喜讚歎入初禪者。",
        "translation": "He himself enters the first dhyāna, teaches others to enter the first dhyāna, praises the teaching of the first dhyāna, and rejoices in and praises those who enter the first dhyāna.",
        "source": "T08n0223_008:0282a14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二禪、三禪、四禪亦如是。",
        "translation": "The second, third, and fourth meditations are likewise.",
        "source": "T08n0223_008:0282a15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自入慈心中，教人入慈心，讚慈心法，亦歡喜讚歎入慈心者。",
        "translation": "He himself enters the mind of kindness, teaches others to enter the mind of kindness, praises the teaching of the mind of kindness, and rejoices and praises those who enter the mind of kindness.",
        "source": "T08n0223_008:0282a16_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悲、喜、捨心亦如是。",
        "translation": "So it is with the mind of compassion, joy, and equanimity.",
        "source": "T08n0223_008:0282a17_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自入無邊空處，教人入無邊空處，讚無邊空處法，亦歡喜讚歎入無邊空處者。",
        "translation": "He enters the sphere of infinite emptiness himself, teaches others to enter the sphere of infinite emptiness, praises the teaching of the sphere of infinite emptiness, and rejoices in and praises those who enter the sphere of infinite emptiness.",
        "source": "T08n0223_008:0282a18_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊識處、無所有處、非有想非無想處亦如是。",
        "translation": "So it is with the sphere of infinite consciousness, the sphere of nothingness, and the sphere of neither perception nor non-perception.",
        "source": "T08n0223_008:0282a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自修四念處，教人修四念處，讚四念處法，亦歡喜讚歎修四念處者。",
        "translation": "He cultivates the four abodes of mindfulness himself, teaches others to cultivate the four abodes of mindfulness, praises the teaching of the four abodes of mindfulness, and rejoices in and praises those who cultivate the four abodes of mindfulness.",
        "source": "T08n0223_008:0282a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四正懃、四如意足、五根、五力、七覺分、八聖道分亦如是。",
        "translation": "So it is with the four correct endeavors, the four basis of supernormal power, the five faculties, the five powers, the seven factors of awakening, and the eight factors of the noble path.",
        "source": "T08n0223_008:0282a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自修空、無相、無作三昧，教人修空、無相、無作三昧，讚空、無相、無作三昧法，亦歡喜讚歎修空、無相、無作三昧者。",
        "translation": "He himself cultivates the samādhi of emptiness, signlessness, and noncontrivance, teaches others to cultivate the samādhi of emptiness, signlessness, and noncontrivance, praises the samādhi of emptiness, signlessness, and noncontrivance, and rejoices in and praises those who cultivate the samādhi of emptiness, signlessness, and noncontrivance.",
        "source": "T08n0223_008:0282a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自入八背捨，教人入八背捨，讚八背捨法，亦歡喜讚歎入八背捨者。",
        "translation": "He enters the eightfold equanimity, teaches people to enter the eightfold equanimity, praises the eightfold equanimity, and rejoices in and praises those who enter the eightfold equanimity.",
        "source": "T08n0223_008:0282a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自入九次第定，教人入九次第定，讚九次第定法，亦歡喜讚歎入九次第定者。",
        "translation": "He enters the ninth concentration, teaches others to enter the ninth concentration, praises the teaching of the ninth concentration, and rejoices in and praises those who enter the ninth concentration.",
        "source": "T08n0223_008:0282a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自修佛十力、四無所畏、四無礙智、大慈大悲、十八不共法，亦如是。",
        "translation": "So it is when he cultivates the Buddha's ten powers, the four fearlessnesses, the four unhindered cognitions, great kindness and compassion, and the 18 distinctive qualities.",
        "source": "T08n0223_008:0282b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行無謬錯法，自行常捨法，教人行無謬錯法、常捨法，讚無錯謬法、常捨法法，亦歡喜讚歎行無錯謬法、常捨法者。",
        "translation": "He himself has no mistaken dharmas, teaches others to practice the Dharma of no mistaken dharmas and constant equanimity, praises the Dharma of no mistaken dharmas and constant equanimity, and rejoices in and praises those who practice the Dharma of no mistaken dharmas and constant equanimity.",
        "source": "T08n0223_008:0282b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自得一切種智，教人得一切種智，讚一切種智法，亦歡喜讚歎得一切種智者。",
        "translation": "He attains omniscience on his own, teaches others to attain omniscience, praises the teaching of omniscience, and rejoices in and praises those who have attained omniscience.",
        "source": "T08n0223_008:0282b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩行六波羅蜜時，所有布施與眾生共已，迴向阿耨多羅三藐三菩提，以無所得故。",
        "translation": "When this bodhisattva Mahāsattva practices the six perfections, all the alms he gives to sentient beings in common with him will be directed toward unsurpassed, correct enlightenment because it's unobtainable.",
        "source": "T08n0223_008:0282b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有持戒忍辱精進禪定智慧，與眾生共已，迴向阿耨多羅三藐三菩提，以無所得故。",
        "translation": "All the observance of precepts, forbearance, diligence, meditation, and wisdom that are shared with sentient beings are directed back to unsurpassed, correct, and complete enlightenment because there's nothing to be gained.",
        "source": "T08n0223_008:0282b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，如是行六波羅蜜時，作是念：『我若不布施，當生貧窮家，不能成就眾生、淨佛國土，亦不能得一切種智。",
        "translation": "When good sons and good women thus practice the six perfections, they think, 'If I don't give alms, I'll be born in a poor family, won't be able to accomplish the lives of sentient beings or purify the Buddha's land, and won't be able to attain all kinds of wisdom.",
        "source": "T08n0223_008:0282b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若不持戒，當生三惡道中，尚不得人身，何況能成就眾生、淨佛國土、得一切種智。",
        "translation": "If I don't observe precepts, I'll be born in one of the three evil destinies and won't yet be able to attain a human body, so how could I attain sentient beings, purify the Buddha's land, or attain all kinds of cognition?",
        "source": "T08n0223_008:0282b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若不修忍辱，則當諸根毀壞色不具足，不能得菩薩具足色身，眾生見者必至阿耨多羅三藐三菩提，亦不能得以具足色身成就眾生、淨佛國土、得一切種智。",
        "translation": "If I don't cultivate forbearance, then my faculties will be destroyed and my form won't be complete, and I won't be able to attain the fully formed body of a bodhisattva, which will surely bring sentient beings to unsurpassed, corrected buddha-lands, and attain the knowledge of all kinds.",
        "source": "T08n0223_008:0282b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若懈怠，不能得菩薩道，亦不能得成就眾生、淨佛國土、得一切種智。",
        "translation": "If I'm lazy, I won't be able to attain the bodhisattva path, and I won't be able to accomplish sentient beings, purify the Buddha's land, or attain all kinds of cognition.",
        "source": "T08n0223_008:0282b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若亂心，不能得生諸禪定，不能以此禪定成就眾生、淨佛國土、得一切種智。",
        "translation": "If I distract myself, I won't be able to give rise to meditations, and I won't be able to use those meditations to achieve sentient beings, purify the Buddha's land, and attain all kinds of cognition.",
        "source": "T08n0223_008:0282b22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若無智，不能得方便智，以方便智過聲聞、辟支佛地，成就眾生、淨佛國土、得一切種智。』",
        "translation": "If I lack knowledge, I won't be able to attain the knowledge of skillful means by which I surpass the stages of direct disciples and solitary realizers and accomplish the sentient beings, purify the Buddha's land, and attain the knowledge of all kinds.'",
        "source": "T08n0223_008:0282b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩復如是思惟：『我不應隨慳貪故，不具足檀那波羅蜜。",
        "translation": "Again, the bodhisattva thinks, 'I shouldn't not fully possess the perfection of the perfection of dāna-pāramitā because of my stinginess and greed.",
        "source": "T08n0223_008:0282b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應隨犯戒故，不具足尸羅波羅蜜。",
        "translation": "I shouldn't have refrained from perfecting the perfection of the śīla-pāramitā because I violated the precepts.",
        "source": "T08n0223_008:0282b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應隨瞋恚故，不具足羼提波羅蜜。",
        "translation": "I shouldn't have refrained from the perfection of the perfection of kṣatriya because of anger.",
        "source": "T08n0223_008:0282b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應隨懈怠故，不具足毘梨耶波羅蜜。",
        "translation": "Not according to laziness, it's not the perfect pāramitā of vīrya.",
        "source": "T08n0223_008:0282b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應隨亂意故，不具足禪那波羅蜜。",
        "translation": "Not according to confusion, it's not the perfection of the perfection of dhyāna.",
        "source": "T08n0223_008:0282c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應隨癡心故，不具足般若波羅蜜。",
        "translation": "The perfection of prajñā-pāramitā should not be possessed because of a deluded mind.",
        "source": "T08n0223_008:0282c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不具足檀那波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜，我終不能成就一切種智。』",
        "translation": "If I don't possess the perfection of the perfection of dona, the perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of prajñā, I'll never be able to achieve the full range of cognition.'",
        "source": "T08n0223_008:0282c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是善男子、善女人，是般若波羅蜜受持親近讀誦、為他說、正憶念，亦不離薩婆若心，得是今世後世功德。」",
        "translation": "Thus, good sons and good women, this prajñāpāramit is something to be memorized, recited, taught for others, and correctly recollected, and it doesn't part from the mind of a sāvajña, which obtains merit in the present and in the hereafter.\"",
        "source": "T08n0223_008:0282c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因白佛言：「世尊！",
        "translation": "Śakrodevānāmī said to the Buddha, \"Bhagavān!",
        "source": "T08n0223_008:0282c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有。",
        "translation": "Rarely does it exist.",
        "source": "T08n0223_008:0282c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩般若波羅蜜，為迴向薩婆若心故亦為不高心故。」",
        "translation": "This is the bodhisattva-mahāsattva prajñāpāramit, which is for the purpose of dedicating one's mind back to the mind of sarvajña and for the purpose of not elevating it.\"",
        "source": "T08n0223_008:0282c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告釋提桓因言：「憍尸迦！",
        "translation": "The Buddha told Śakrodevānām-Indra, \"Kauśika!",
        "source": "T08n0223_008:0282c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩般若波羅蜜，為迴向薩婆若心故亦為不高心故？」",
        "translation": "What is the bodhisattva-mahāsattva prajñāpāramit, in order to return to the mind of sarvajña and for the reason that it's not a higher mind?\"",
        "source": "T08n0223_008:0282c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因白佛言：「世尊！",
        "translation": "Śakrodevānām said to the Buddha, \"Bhagavān!",
        "source": "T08n0223_008:0282c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，若行世間檀那波羅蜜，布施諸佛、辟支佛、聲聞及諸貧窮乞匃行路人。",
        "translation": "\"Suppose a bodhisattva-mahāsattva practices the secular perfection of giving to the buddhas, pratyekbuddhas, direct disciples, and poor beggars on the road.",
        "source": "T08n0223_008:0282c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩無方便故，生高心。",
        "translation": "This is because the bodhisattva has no skillful means and gives rise to a high attitude.",
        "source": "T08n0223_008:0282c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行世間尸羅波羅蜜，言：『我行尸羅波羅蜜，我能具足尸羅波羅蜜。』",
        "translation": "If they practice the secular perfection of morality and say, 'I practice the perfection of morality, I can fully attain the perfection of morality.'",
        "source": "T08n0223_008:0282c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無方便故，生高心。",
        "translation": "Because of the lack of skillful means, this gives rise to an elevated state of mind.",
        "source": "T08n0223_008:0282c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言：『我行羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜，我行般若波羅蜜，我修般若波羅蜜。』",
        "translation": "They say, 'I practice the perfection of kṣanti, the perfection of vīrya, and the perfection of meditation, I practice the perfection of prajñā, and I cultivate the perfection of prajñā.'",
        "source": "T08n0223_008:0282c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是世間般若波羅蜜無方便故，生高心。",
        "translation": "Because this worldly prajñā-pāramitā has no method, it gives rise to a high attitude of mind.",
        "source": "T08n0223_008:0282c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_008:0282c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩修世間四念處時，自念言：『我修四念處，我具足四念處。』",
        "translation": "When a bodhisattva cultivates the four worldly abodes of mindfulness, he thinks to himself, 'I cultivate the four abodes of mindfulness, and I am fully equipped with them.'",
        "source": "T08n0223_008:0282c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無方便力故，生高心。",
        "translation": "Because of the lack of the power of skillful means, they give rise to a high state of mind.",
        "source": "T08n0223_008:0282c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『我修四正懃、四如意足、五根、五力、七覺分、八聖道分。』",
        "translation": "'I cultivate the four correct endeavors, the four basis of supernormal power, the five faculties, the five powers, the seven factors of awakening, and the eight factors of the noble path.'",
        "source": "T08n0223_008:0282c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自念言：『我修空、無相、無作三昧。",
        "translation": "He thinks to himself, 'I'm cultivating the samādhi of emptiness, signlessness, and noncontrivance.",
        "source": "T08n0223_008:0282c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我修一切三昧門，當得一切陀羅尼門。",
        "translation": "I cultivate all samādhis, and I will attain all dhāraṇī teachings.",
        "source": "T08n0223_008:0282c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我修佛十力、四無所畏、十八不共法，我當成就眾生，我當淨佛國土，我當得一切種智。』",
        "translation": "I cultivate the Buddha's ten powers, four forms of fearlessness, and 18 distinctive qualities, and I will accomplish the success of sentient beings, I will purify the Buddha's land, and I will attain all kinds of cognition.'",
        "source": "T08n0223_008:0282c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著吾我，無方便力故，生高心。",
        "translation": "Because they're attached to self and don't have the power of skillful means, they become arrogant.",
        "source": "T08n0223_008:0282c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_008:0282c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩行世間善法，著吾我故，生高心。",
        "translation": "Thus, the bodhisattva Mahāsattva practices worldly good qualities and becomes attached to self, so he gives rise to an elevated state of mind.",
        "source": "T08n0223_008:0282c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_008:0283a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行出世間檀那波羅蜜，不得施者、不得受者、不得施物。",
        "translation": "\"If a bodhisattva-mahāsattva practices the supramundane perfection of giving, he mustn't give to anyone, mustn't accept anyone, and mustn't give anything.",
        "source": "T08n0223_008:0283a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩行出世間檀那波羅蜜。",
        "translation": "Thus, the bodhisattva-mahāsattva practices the supramundane perfection of giving.",
        "source": "T08n0223_008:0283a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為迴向薩婆若故，亦不生高心。",
        "translation": "They don't become arrogant for the sake of dedicating their mind back to the sahāvajña.",
        "source": "T08n0223_008:0283a04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行尸羅波羅蜜，尸羅不可得。",
        "translation": "He practices the perfection of śīla, but śīla is unobtainable.",
        "source": "T08n0223_008:0283a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行羼提波羅蜜，羼提不可得。",
        "translation": "He practices the perfection of kṣatriya, but kṣatriya is unobtainable.",
        "source": "T08n0223_008:0283a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行毘梨耶波羅蜜，毘梨耶不可得。",
        "translation": "He practices the perfection of vīrya, but vīrya is unobtainable.",
        "source": "T08n0223_008:0283a06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行禪那波羅蜜，禪那不可得。",
        "translation": "He practices the perfection of meditation, but meditation is unobtainable.",
        "source": "T08n0223_008:0283a07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行般若波羅蜜，般若不可得。",
        "translation": "He practices the perfection of prajñā, but prajñā is unobtainable.",
        "source": "T08n0223_008:0283a08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修四念處，四念處不可得。",
        "translation": "He cultivates the four abodes of mindfulness, but the four abodes of mindfulness are unobtainable.",
        "source": "T08n0223_008:0283a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至修十八不共法，十八不共法不可得。",
        "translation": "Even when they cultivate the 18 distinctive qualities, the 18 distinctive qualities are unobtainable.",
        "source": "T08n0223_008:0283a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修大慈大悲，大慈大悲不可得。",
        "translation": "They cultivate great kindness and great compassion, but great kindness and great compassion are unobtainable.",
        "source": "T08n0223_008:0283a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至修一切種智，一切種智不可得。",
        "translation": "... cultivates all kinds of cognition, but all kinds of cognition are unobtainable.",
        "source": "T08n0223_008:0283a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_008:0283a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩般若波羅蜜，為迴向薩婆若故亦為不生高心故。」",
        "translation": "Thus, the bodhisattva Mahāsattva prajñāpāramitā is for the purpose of dedicating himself back to the paranirmita-vaśavartin and for the purpose of not producing a high attitude.\"",
        "source": "T08n0223_008:0283a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶般若經卷第八",
        "translation": "*Mahāsattva Prajñāpāramitā, Vol. 8",
        "source": "T08n0223_008:0283a15_0",
        "is_bad_quality": false
    }
]