[
    {
        "source_sentence": "大乘理趣六波羅蜜多經卷第四",
        "translation": "Dasheng liqiu liuboluomi tu jing, vol. 4",
        "source": "T08n0261_004:0881c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罽賓國三藏般若奉　詔譯",
        "translation": "Imperial Translation of the Tripiṭaka of the State of Kāśmīra",
        "source": "T08n0261_004:0881c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多品第五",
        "translation": "The Fifth Chapter of the Perfection of Giving",
        "source": "T08n0261_004:0881c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛薄伽梵於大眾中作師子吼，廣說五種發菩提心已。",
        "translation": "It was then that the Buddha Bhagavān made a lion's roar in the crowd and explained in detail the five ways to arouse the mind of enlightenment.",
        "source": "T08n0261_004:0881c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時慈氏菩薩摩訶薩與無量無數百千俱胝諸大菩薩摩訶薩眾，文殊師利菩薩摩訶薩而為上首，皆已成就六種波羅蜜多。",
        "translation": "At the time, the Bodhisattva Mercy and the great multitude of bodhisattvas, mahāsattvas, and Mañjuśrī as the head, had all accomplished the six perfections.",
        "source": "T08n0261_004:0881c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量大阿羅漢，諸漏已盡所作已辦，捨離重擔梵行清淨。",
        "translation": "There are also measureless great arhats whose contaminants have been ended, whose tasks have been accomplished, and who have abandoned the heavy burdens of the religious practice and are pure.",
        "source": "T08n0261_004:0881c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及無數俱胝百千萬億那庾多天、龍、阿蘇羅、乾闥婆、迦嚕羅、緊捺羅、摩怙洛迦、藥叉羅剎、鳩畔茶、薜荔多、毘舍遮、人非人等。",
        "translation": "There are countless koṭīs, hundreds of thousands of millions of nayutas, gods, dragons, asuras, gandharvas, garuḍas, kiṃnara, mahoraga, yakṣa rāṣas, kumbhâṇḍas, velītas, piśācīs, humans, and nonhumans.",
        "source": "T08n0261_004:0881c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時慈氏菩薩摩訶薩在大眾中即從座起，整理衣服偏袒右肩，長跪合掌一心恭敬而白佛言：「世尊已說大乘菩薩不退轉心，菩薩摩訶薩修習幾法得名菩薩摩訶薩？",
        "translation": "The Bodhisattva Mahāsattva Maitreya then rose from his seat in the midst of the assembly, adjusted his robes, bared his right shoulder, knelt down, put his palms together with one heart and respect, and said to the Buddha, \"The Bhagavān has explained the irreversible mind of a great vehicle bodhisattva, how many things does a bodhisattva cultivate to become known as a bodhisattva-mahāsattva?",
        "source": "T08n0261_004:0881c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊分別解說。」",
        "translation": "Please let the Bhagavān explain it clearly.\"",
        "source": "T08n0261_004:0881c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時薄伽梵告慈氏菩薩摩訶薩言：「若有善男子、善女人，以清淨心歸依佛法僧寶，發阿耨多羅三藐三菩提心，得不退轉即名菩薩，生我法中名摩訶薩。",
        "translation": "It was then that the Bhagavān addressed the Maitreya bodhisattva Mahāsattva, \"If there are good men and good women who rely on the treasures of buddhas, Dharma, and Saṃgha with a pure heart and arouse the mind of unsurpassed, correct, and complete enlightenment, they will be called bodhisattvas and be born among my teachings and be called Mahāsattvas.",
        "source": "T08n0261_004:0881c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與殑伽沙等諸佛菩薩而為法子，為彼有情而為父母，以大福德光明照曜過百千日莊嚴其身。」",
        "translation": "He becomes a Dharma child with sons of buddhas and bodhisattvas, a father and mother for those sentient beings, and adorns his body with the radiance of great merit that lasts more than a hundred thousand days.\"",
        "source": "T08n0261_004:0881c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時慈氏菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Maitreya Bodhisattva Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T08n0261_004:0881c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩摩訶薩，云何遠離？",
        "translation": "How do these bodhisattvas and mahāsattvas get rid of it?",
        "source": "T08n0261_004:0881c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何親近？",
        "translation": "How do we get close?",
        "source": "T08n0261_004:0881c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以何人而為伴侶？",
        "translation": "Who else should I take as my companion?",
        "source": "T08n0261_004:0881c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先作何事？",
        "translation": "What should I do first?",
        "source": "T08n0261_004:0881c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應云何住？",
        "translation": "How should I stay?",
        "source": "T08n0261_004:0881c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修行？",
        "translation": "How do we practice?",
        "source": "T08n0261_004:0881c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何降伏其心？",
        "translation": "How do they subdue their minds?",
        "source": "T08n0261_004:0881c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何攝持？",
        "translation": "How is it collected and maintained?",
        "source": "T08n0261_004:0881c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰之勢力速疾證得阿耨多羅三藐三菩提？」",
        "translation": "Whose power will quickly realize unsurpassed, perfect enlightenment?\"",
        "source": "T08n0261_004:0881c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛薄伽梵告慈氏菩薩摩訶薩言：「若善男子、善女人，應當導引五趣眾生，置於無上正等菩提，遠離外道邪法及惡知識，應當親近修行布施、持戒、忍辱、精進、禪定、智慧具足，行大乘者而為伴侶。",
        "translation": "It was then that the Buddha Bhagavān addressed the Maitreya bodhisattva Mahāsattva, \"If good sons and good women should guide sentient beings in the five destinies and set them on unsurpassed correct enlightenment, they should keep close to those who cultivate generosity, observe precepts, tolerate humiliation, make effort, meditate, perfect wisdom, and practice the great vehicle as their companions.",
        "source": "T08n0261_004:0882a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應於自身，聽聞正法精勤誦持，應常安住如是六種波羅蜜多精進修行，降伏心意攝護六根，由此勢力疾證無上正等菩提，是名菩薩摩訶薩。",
        "translation": "In and of themselves, they should diligently recite and memorize the right teaching, always abide in the diligent practice of these six perfections, subdue their minds, and guard their six faculties, and by this power they'll quickly realize unsurpassed perfect enlightenment, which is called a bodhisattva-mahāsattva.",
        "source": "T08n0261_004:0882a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為六種波羅蜜多？",
        "translation": "What are the six kinds of perfections?",
        "source": "T08n0261_004:0882a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂布施、持戒、忍辱、精進、禪定、智慧，是為六種波羅蜜多。",
        "translation": "These are the six perfections of generosity, observance of precepts, forbearance, effort, meditation, and wisdom.",
        "source": "T08n0261_004:0882a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故先說檀波羅蜜？」",
        "translation": "Why do we first talk about the perfection of giving?\"",
        "source": "T08n0261_004:0882a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慈氏：「我今為汝廣分別說。",
        "translation": "The Buddha told Maitreya, \"Now, I'll explain this in detail for you.",
        "source": "T08n0261_004:0882a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其布施者，於六度中最易修習，是故先說。",
        "translation": "Of the six perfections, generosity is the easiest to cultivate, so I'll explain it first.",
        "source": "T08n0261_004:0882a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間諸所作事，若易作者先當作之，是故先說布施波羅蜜多。",
        "translation": "Just as there are works in the world that are easy to do, if they're done first, therefore the perfection of generosity is explained first.",
        "source": "T08n0261_004:0882a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切有情無有不能行布施者，若藥叉，若羅剎，師子虎狼，及諸獄卒屠兒魁膾，此等眾生於有情中極為暴惡，尚能離慳而行布施。",
        "translation": "There's no sentient being who can't practice generosity, such as yakṣas, rāṣas, lions, tigers, wolves, and jailers, butchers, boys, and men, which are extremely violent among sentient beings but are still able to avoid stinginess and practice generosity.",
        "source": "T08n0261_004:0882a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何布施？",
        "translation": "How do they give alms?",
        "source": "T08n0261_004:0882a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂養育男女慈念乳哺。",
        "translation": "\"It's called nurturing a man and a woman with loving care and concern for feeding them.",
        "source": "T08n0261_004:0882a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此眾生雖不能知福利之事，以憐愛故，令得色力壽命安樂、離飢渴苦，亦名布施。",
        "translation": "Even though these sentient beings can't know about welfare, loving them so that they'll attain form and strength, longevity and happiness, and freedom from hunger and thirst is also called generosity.",
        "source": "T08n0261_004:0882a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，於六波羅蜜多先說檀波羅蜜。",
        "translation": "For this reason, the six perfections are first explained as the perfection of giving.",
        "source": "T08n0261_004:0882a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如一切貧窮有情，飢寒裸露身心不安，何能造作種種事業？",
        "translation": "\"Again, suppose all poor sentient beings are hungry, cold, and naked, and their bodies and minds are uneasy, how could they create various works?",
        "source": "T08n0261_004:0882a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若與衣食令得安樂，然後能修種種事業。",
        "translation": "If they are given food and clothing to make themselves comfortable, then they'll be able to cultivate various undertakings.",
        "source": "T08n0261_004:0882a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，見諸有情貧窮所逼，不能發起無上信心，修行大乘種種事業。",
        "translation": "So it is with the bodhisattvas, Mahāsattvas, who see that sentient beings are so poor and so constrained that they can't summon the unsurpassed faith to cultivate the various undertakings of the great vehicle.",
        "source": "T08n0261_004:0882a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先施一切衣服飲食、房舍臥具、病瘦醫藥，令心安樂，然後令發無上正等覺心，修行大乘種種事業。",
        "translation": "They first give them all clothing, food, shelter, bedding, and medicines for illness and debility to make their minds comfortable, and then they cause them to arouse the mind of unsurpassed perfect enlightenment and cultivate the various undertakings of the great vehicle.",
        "source": "T08n0261_004:0882a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，六度彼岸布施為門，四攝之行而為其首。",
        "translation": "Because of this, generosity on the other side of the six perfections is the gate, and the four practices that comprise them are the head of the list.",
        "source": "T08n0261_004:0882a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如大地一切萬物依之生長，以是義故，先說布施波羅蜜多。",
        "translation": "It's like the earth on which all living things grow, and for this reason, the perfection of generosity is explained first.",
        "source": "T08n0261_004:0882a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如上所說藥叉等類，不知福田及非福田，由愛念故施於乳哺，當作人身，富有資財所須無乏。",
        "translation": "As was mentioned above, such people as the yakṣas don't know about fields of merit or non-fields of merit, but out of love and mindfulness they give milk and feed themselves as human beings, becoming rich with possessions that are needed without fail.",
        "source": "T08n0261_004:0882a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此習故，所生之處常離慳貪，給施一切，能除有情貧窮困苦。",
        "translation": "Because of this habituation, the place where they're born is always free of parsimony and greed, and they give generously to all living things, which removes the poverty and hardship of sentient beings.",
        "source": "T08n0261_004:0882b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0882b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩，為欲利樂諸有情故，先行布施波羅蜜多。",
        "translation": "\"Bodhisattvas, Mahāsattvas first give the perfect amount of alms for the welfare of sentient beings.",
        "source": "T08n0261_004:0882b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有來乞者皆施與之，不得顰蹙，亦不邪視忿恚懷恨而行布施，隨其所有而施與之，不得遲疑而生慳悋。",
        "translation": "They give to anyone who comes begging, don't knit the brows, don't look askance at anger and resentment, and give as much as they have, without hesitation or stinginess.",
        "source": "T08n0261_004:0882b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於所愛物衣服臥具、飲食湯藥、國城妻子、奴婢僮僕、象馬七珍，不生慳悋隨乞與之，乃至一念不生追悔。",
        "translation": "He doesn't become stingy and stingy with the things he loves, such as clothing and bedding, food and drink, medicine, a town wife, slaves and servants, and the seven treasures of elephants and horses, and then gives them as he begs, even to the point of not regretting a single thought.",
        "source": "T08n0261_004:0882b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生疑惑，當知是魔。",
        "translation": "If they have any doubts, they should know that they're Māra.",
        "source": "T08n0261_004:0882b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0882b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王波旬化為財寶令使慳悋，以此方便惑亂我心，於大菩提而為障礙。",
        "translation": "The demon king Pāpīyān transforms them into treasures and makes them scarce, which skillfully distracts my mind and creates obstacles to great bodhi.",
        "source": "T08n0261_004:0882b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，不應慳悋。",
        "translation": "For this reason, you shouldn't be stingy with them.",
        "source": "T08n0261_004:0882b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是思惟，一切珍財愛戀之心，皆應捨離。」",
        "translation": "Thus contemplate that all thoughts of attachment to treasures should be abandoned.\"",
        "source": "T08n0261_004:0882b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時慈氏菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Mahāsattva of Mercy said to the Buddha, \"Bhagavān!",
        "source": "T08n0261_004:0882b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若所愛財寶皆應布施不生悋惜，菩薩摩訶薩為轉輪王，所有七寶千子圍遶不知云何？",
        "translation": "If all the treasures that they desire should be given away without being stingy, what would become of the seven treasures that the bodhisattva Mahāsattva, as the wheel-turning king, has surrounded by a thousand sons?",
        "source": "T08n0261_004:0882b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如微細草木處於谿澗遇天暴雨，大水汎漲漂盡無遺。",
        "translation": "\"It's like a tiny blade of grass or tree that's caught in a squabble when there's a deluge of water from the sky, and it drifts away without leaving anything behind.",
        "source": "T08n0261_004:0882b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其轉輪王五欲自恣，雄猛自在千子隨身，滌菩提心皆悉漂盡，云何修習布施行耶？",
        "translation": "How would a wheel-turning king who freely indulges in the five desires and has a thousand sons who are powerful and unimpeded carry around a clean, enlightened mind all drift away, and how would he cultivate its dissemination?",
        "source": "T08n0261_004:0882b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣難為捨離。」",
        "translation": "Because of these causes, it's difficult to part with them.\"",
        "source": "T08n0261_004:0882b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時薄伽梵告慈氏菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Maitreya bodhisattva Mahāsattva, \"Good sons!",
        "source": "T08n0261_004:0882b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所生之處，常得富貴財寶豐足，法應如是。",
        "translation": "Where bodhisattvas, mahāsattvas, and bodhisattvas are born, they'll always attain wealth and possessions in abundance, and this should be the case with the Dharma.",
        "source": "T08n0261_004:0882b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為轉輪聖王，應作如是二種思惟：一者思惟過去諸佛難行之行，及佛菩薩所有教法。",
        "translation": "If you are a wheel-turning sage king, you should do these two kinds of contemplation: first, you should contemplate the difficult actions of past buddhas and all the teachings of buddhas and bodhisattvas.",
        "source": "T08n0261_004:0882b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此轉輪王五欲勝樂，皆從妄計分別而生，猶如幻夢。",
        "translation": "These five desires and pleasures of the wheel-turning sage king all arise from false discrimination, just like an illusion or a dream.",
        "source": "T08n0261_004:0882b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王於五欲境，不起分別不生計著，何能障礙菩提之心？",
        "translation": "When the wheel-turning sage king doesn't discriminate or become attached to the five desires, how can that obstruct the mind of enlightenment?",
        "source": "T08n0261_004:0882b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者思惟一切有情，我已引入阿耨多羅三藐三菩提安樂之地，亦如過去殑伽沙等諸佛如來難捨能捨，我亦誓當作如是捨，為欲滌除慳悋之垢，發如是心：『願從今身乃至成佛，誓以此身捨與法界一切眾生，所修福業若多若少，願與一切眾生共之，迴向無上正等菩提。",
        "translation": "Second, I thought, \"All sentient beings, I have been introduced to the peaceful and joyous stage of unsurpassed, correct, and complete enlightenment, just as the Tathāgatas and other buddhas of the past did and could abandon, and I vow to abandon it as such.",
        "source": "T08n0261_004:0882b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是觀之，我昔已捨一切身命如妙高山。",
        "translation": "Looking at it this way, I used to abandon all my bodies and lives like a marvelous high mountain.",
        "source": "T08n0261_004:0882c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀我此身猶如芥子，身命尚捨何況珍財。",
        "translation": "Observing that this body of mine is like a mustard seed, how could I let go of my body and life, much less my valuables?",
        "source": "T08n0261_004:0882c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩多積珍財不行布施，猶如白象於殑伽河淨澡浴已，以鼻噏取糞穢塵土遍身坌之。",
        "translation": "If bodhisattvas accumulate much precious wealth and don't give it away, they're like a white elephant that's been purified and bathed in the Gaṅgā River and then picks up dung and dirt with its trunk and spreads it all over its body.",
        "source": "T08n0261_004:0882c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以福德淨水澡浴其身端嚴清潔，不應慳悋愛惜財寶坌污其身。』",
        "translation": "I bathe my body in pure, virtuous water that's upright and clean, so I shouldn't be stingy and cherish treasures that defile my body.'",
        "source": "T08n0261_004:0882c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏！",
        "translation": "Maitreya!",
        "source": "T08n0261_004:0882c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知菩薩應作如是思惟：『若有人來乞我身皮，我即剝之不生瞋恨，歡喜施與。",
        "translation": "You should know that a bodhisattva should think in this way, 'Suppose someone comes begging for my skin, and I strip it off without getting angry and joyfully give it to them.",
        "source": "T08n0261_004:0882c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若乞身首血肉骨髓，皆悉能施。』",
        "translation": "If I were to ask for the head of my body, flesh, blood, bones, and marrow, I would be able to give them all.'",
        "source": "T08n0261_004:0882c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，菩薩摩訶薩利益安樂諸有情故，不捨生死而取涅槃。",
        "translation": "Because of these reasons, the bodhisattva Mahāsattva benefits and pleases sentient beings by not abandoning birth-and-death and attaining nirvāṇa.",
        "source": "T08n0261_004:0882c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『我今此身，前際不來後亦無去，父母和合不淨種子而有我身，處不淨中生熟藏間，猶如種樹枝葉茂盛花果成實，我身亦爾，以苦為枝、憂悲為葉、欺誑為花、癡為根本，瞋恚羅剎而居此樹，又為惡業虎豹犲狼師子等獸圍遶此樹。",
        "translation": "Again, he thinks, 'Now, in this body of mine, there's nothing past, nothing to come, and nothing to go afterward, and I was born from the union of parents and impure seeds, and I'm in the middle of an impure store of birth and maturation, just like a seed tree with branches and leaves that flourish and flowers and fruits that come into fruition, so too is my body, with suffering as its branch, grief and sorrow as its leaves, deceit as its flower, and delusion as its root.",
        "source": "T08n0261_004:0882c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今暫時憩此樹下，何為愛惜此毒樹耶？",
        "translation": "Now, why do I cherish this poisonous tree when I temporarily rest under it?",
        "source": "T08n0261_004:0882c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此樹身無我我所，設復有者我亦捨之，願奉眾生任彼所須終無悋惜。",
        "translation": "\"But this tree's body has no self or property, so even if there were one, I'd abandon it and vow to serve sentient beings as long as they need it and never have to begrudge it.",
        "source": "T08n0261_004:0882c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0882c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已捨故，不求果報、不求恩德，無所著故。",
        "translation": "Because I've abandoned it, I don't seek rewards or merits, and I'm not attached to anything.",
        "source": "T08n0261_004:0882c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0882c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此毒身有三惡法之所纏繞。",
        "translation": "Because of this toxic body, he's tethered by three bad qualities.",
        "source": "T08n0261_004:0882c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為三？",
        "translation": "What are the three?",
        "source": "T08n0261_004:0882c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者不淨，二者極苦，三者無恩。",
        "translation": "One is impure, two is extremely painful, and three is ungrateful.",
        "source": "T08n0261_004:0882c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，於此羅剎毒害惡獸圍遶眾中救拔我身，當知此人於我大恩，而於我身作大利益。",
        "translation": "If another person were to rescue me from this Rāṣṭrapāla, which is surrounded by poisonous and harmful animals, you should know that person is greatly indebted to me and has done great good for my body.",
        "source": "T08n0261_004:0882c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於此人常懷恩德，豈更於此而惜身耶？",
        "translation": "Since I've always had kindness for this person, how could I have spared my body?",
        "source": "T08n0261_004:0882c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此大地所有園林草木藥等，根芽枝葉花果成實，而堪服食及帶持者，若以利斧斬此草木，枝葉花果分析與人，而能利益無量眾生。",
        "translation": "\"Furthermore, if he were to use a sharp ax to chop down this forest, herbs, trees, medicines, and so forth, whose roots, buds, leaves, flowers, and fruits are formed into fruits that can be eaten and carried, and if he were to analyze the branches, leaves, flowers, and fruits of these trees and plants and give them to people, it would benefit measureless sentient beings.",
        "source": "T08n0261_004:0882c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此大地，不念眾生食我身分枝葉花菓而得除病。",
        "translation": "This earth, however, doesn't think about the illnesses that result from sentient beings eating my branches, leaves, flowers, and fruits.",
        "source": "T08n0261_004:0883a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼無情物尚不分別，而能利益一切有情，而況我身不能於他而興利益行於布施，反於乞者起我慢心輕罵凌懱？』",
        "translation": "They don't discriminate among insentient things and yet they're able to benefit all sentient beings, so why wouldn't I myself be able to give alms that benefit others and instead become proud of beggars and despise them?'",
        "source": "T08n0261_004:0883a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於自身內外觀察。",
        "translation": "\"Again, he observes himself both inside and outside.",
        "source": "T08n0261_004:0883a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先觀內身，眼是我耶？",
        "translation": "First, he observes the internal body: \"Is the eye the self?",
        "source": "T08n0261_004:0883a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我所耶？",
        "translation": "Is it mine?",
        "source": "T08n0261_004:0883a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非我者，云何悋惜，耳鼻舌身亦復如是，周遍觀察無我我所。",
        "translation": "\"If it's not a self, then why do you cherish it? Similarly, the ear, nose, tongue, and body are examined in detail to see that there's no self or self.",
        "source": "T08n0261_004:0883a08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀外身，色是我耶？",
        "translation": "\"What about the external body, is form a self?",
        "source": "T08n0261_004:0883a09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我所耶？",
        "translation": "Is it mine?",
        "source": "T08n0261_004:0883a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲香味觸亦復如是。",
        "translation": "\"So it is with sound, smells, tastes, and tactile objects.",
        "source": "T08n0261_004:0883a10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此內外周遍觀察皆無有我，既無有我，云何慳惜而不施耶？",
        "translation": "Looking around inside and out, they all lack self, and since they don't have self, why is it that they are stingy and don't give?",
        "source": "T08n0261_004:0883a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應當決定如是思惟：『願將此身速奉一切。",
        "translation": "You should definitely think in this way, 'May I quickly devote this body to all of them.'",
        "source": "T08n0261_004:0883a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0883a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此身無常遷變不定，剎那生滅無所有故。』」",
        "translation": "This body is impermanent, changing, and indeterminate, and it arises and ceases momentarily without having any existence.'\"",
        "source": "T08n0261_004:0883a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「若他逼捨身命財，　　制不自由無利益，　如是知已諦思惟，　　開心自施為最勝。",
        "translation": "It was then that the Bhagavān spoke this verse, \"If others force them to abandon their bodies, lives, and possessions, and they are restrained, not free, and have no benefit, then after knowing this, they truly consider it, and they open their minds to self-giving as the most excellent.",
        "source": "T08n0261_004:0883a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迷人若悟夢幻法，　　內外皆捨無所著，　如是布施等虛空，　　無我無受為最勝，「復次，慈氏！",
        "translation": "If an attractive person realizes that things are illusory and dreamlike, they abandon both internal and external attachments, and thus gives alms equal to space, the absence of self and feelings is the most excellent.",
        "source": "T08n0261_004:0883a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修行大乘求阿耨多羅三藐三菩提者，當修空法。",
        "translation": "\"If a bodhisattva-mahāsattva cultivates the great vehicle and seeks unsurpassed, correct enlightenment, he must cultivate the dharma of emptiness.",
        "source": "T08n0261_004:0883a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以觀空故心得自在，於殑伽沙佛所得受記別，心不退轉而行布施無有劬勞，檀施為刀破慳悋賊，慳悋賊者眾苦根本。",
        "translation": "Because he observes emptiness, his mind is at ease, he receives assurance of the attainment of distinction by the buddhas of the skandhas, doesn't falter in mind, and practices generosity without trouble, and his giving of alms is a sword that breaks the thief of stinginess, which is the root of many sufferings.",
        "source": "T08n0261_004:0883a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於此不生愛著。",
        "translation": "The bodhisattva doesn't become attached to this.",
        "source": "T08n0261_004:0883a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0883a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩雖有煩惱，皆是方便利物而生，然彼煩惱不為過失，以諸菩薩隨願生故。",
        "translation": "Although bodhisattvas and mahāsattvas have afflictions that arise from skillful means to benefit things, those afflictions aren't faults because they arise according to the bodhisattvas' vows.",
        "source": "T08n0261_004:0883a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身口意業住無功用，得清淨故。",
        "translation": "The bodily, verbal, and mental actions abide without exertion and become pure.",
        "source": "T08n0261_004:0883a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善調五根，無放逸故。",
        "translation": "Because they are well disciplined by the five faculties, they don't become careless.",
        "source": "T08n0261_004:0883a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能多利樂一切眾生，能知勝義及世俗諦。",
        "translation": "They are able to enjoy all sentient beings and know the ultimate truth and the conventional truth.",
        "source": "T08n0261_004:0883a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以正定水洗滌慳垢，除此垢已於施自在，說大乘法威光照曜，如日流輝破諸黑闇，說法聲光除心昏冥。」",
        "translation": "With the water of right concentration, he cleanses himself of the stain of stinginess, and after removing this stain, he freely bestows the Dharma of the great vehicle in a radiant light that shines like a sun streaming brightly and destroying darkness, and he explains the sound of the Dharma in a light that removes mental darkness.\"",
        "source": "T08n0261_004:0883a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏菩薩摩訶薩白佛言：「世尊！",
        "translation": "The Maitreya bodhisattva Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T08n0261_004:0883b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣先明法施？」",
        "translation": "By what causes and conditions was dharma-giving first explained?\"",
        "source": "T08n0261_004:0883b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慈氏菩薩摩訶薩：「此法施者，有三種事勝於財施。",
        "translation": "The Buddha told the Bodhisattva Mahāsattva Maitreya, \"There are three things about this kind of Dharma-giving that are superior to financial giving.",
        "source": "T08n0261_004:0883b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為三？",
        "translation": "What are the three?",
        "source": "T08n0261_004:0883b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一財施者而有竭盡，法施增長則無有盡，以是校量勝於財施。",
        "translation": "First, there's no limit to the amount of material gifts that can be given, but there's no limit to the amount of Dharma gifts that can be given, so this measure is superior to material gifts.",
        "source": "T08n0261_004:0883b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二受財施者現在利益，受法施者現在未來俱有利益，於無量世恒相隨逐無人侵奪，乃至無上正等菩提不相捨離。",
        "translation": "Second, someone who accepts a gift of goods will receive benefits in the present, and someone who accepts a gift of the Dharma will receive benefits in the present and future that will always be followed and not be taken away by anyone throughout measureless time, up to unsurpassed correct enlightenment that won't be abandoned by either of them.",
        "source": "T08n0261_004:0883b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三財施者能施獲益受者無益，若法施者自他俱益，由聞法故發心速趣無上菩提。",
        "translation": "Those who give three things will receive benefit from the donation of goods, but those who give the Dharma will receive benefit from both themselves and others, and because they've heard the Dharma, they'll be motivated to quickly reach unsurpassed bodhi.",
        "source": "T08n0261_004:0883b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此三義，法施之者勝於財施。",
        "translation": "Because of these three things, giving Dharma is superior to giving material things.",
        "source": "T08n0261_004:0883b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由行法施名稱遠聞，一切人天尊重恭敬，以此因緣先說法施。",
        "translation": "Because practicing Dharma-giving is known far and wide, all humans and gods respect and venerate it, and this is the reason I first talked about Dharma-giving.",
        "source": "T08n0261_004:0883b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修習布施波羅蜜多，為三種事，與諸功德而為其本：一者能利自他，若不利他自受世樂非菩薩行；二者於大乘中無有退轉；三者隨修少分乃為無量功德之本。",
        "translation": "If a bodhisattva Mahāsattva cultivates the perfection of generosity, it's based on three things and merits: first, it benefits self and others, and it's not a bodhisattva practice to deny self and worldly happiness to others; second, there's no turning away from the great vehicle; and third, cultivating a small amount of it is the basis of measureless merit.",
        "source": "T08n0261_004:0883b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0883b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由清淨心無分別故。",
        "translation": "\"It's because the pure mind doesn't discriminate.",
        "source": "T08n0261_004:0883b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日出照於世間，情與非情皆蒙利益，是日不言我能照觸，亦不分別情與非情。",
        "translation": "Like when the sun rises and shines in the world, both sentient and insentient beings are benefited, so the sun doesn't say I can shine and touch, and it doesn't discriminate between sentient and insentient beings.",
        "source": "T08n0261_004:0883b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是菩薩所作功德，乃至布施一花一果，皆為利益一切眾生，以此功德成無上果，悲化十方示導一切。",
        "translation": "Because of this, the bodhisattva's merits, even down to giving a single flower or fruit, are all for the benefit of all sentient beings, and this merit accomplishes the unsurpassed result of compassionately teaching and guiding all people in ten directions.",
        "source": "T08n0261_004:0883b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0883b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩以施為寶作莊嚴具，乃至成佛相好莊嚴。",
        "translation": "The bodhisattvas, mahāsattvas, make ornaments of generosity, up to becoming buddhas with adorned features.",
        "source": "T08n0261_004:0883b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何少施功德多耶？",
        "translation": "How does a little generosity have much merit?",
        "source": "T08n0261_004:0883b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以方便力少分布施，迴向發願，與一切眾生同證無上正等菩提。",
        "translation": "By sparingly distributing alms with the power of skillful means, he dedicates his mind to the vow that all sentient beings will realize unsurpassed correct perfect enlightenment together.",
        "source": "T08n0261_004:0883b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是功德無量無邊，猶如少雲漸遍世界。",
        "translation": "Such merit is immeasurable and limitless, like a few clouds gradually spreading across the world.",
        "source": "T08n0261_004:0883b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0883b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施有三種：一者小施，二者大施，三者第一義施。",
        "translation": "There are three kinds of giving: first, small gifts, second, great gifts, and third, gifts of the highest meaning.",
        "source": "T08n0261_004:0883b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言小施者，謂以種種飲食衣服諸莊嚴具，財寶象馬庫藏倉廩，城邑聚落園林屋宅，及轉輪王所有樂具而行布施，是名小施。",
        "translation": "This is called small giving, which is defined as giving with various kinds of food and drink, clothing, adornments, wealth, elephants, horses, stores, warehouses, towns, villages, parks, forests, homes, and the turning wheel king's implements of pleasure.",
        "source": "T08n0261_004:0883b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二大施者，輪王所愛后妃眷屬及與己身，以施乞者，是名大施。",
        "translation": "Second, great generosity is when a wheel-turning king gives to a beggar the queen, her retinue, and her retinue that he loves, as well as to himself.",
        "source": "T08n0261_004:0883c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三第一義施者，能以身命而行布施，以無所得心相應故，名為第一義施。",
        "translation": "The third kind of first-meaning gift is when someone gives with their life, which is called first-meaning giving because it's associated with an ungraspable mind.",
        "source": "T08n0261_004:0883c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩以是三種而行布施，是故名為檀波羅蜜。",
        "translation": "The bodhisattva Mahāsattva gives generosity in these three ways, and therefore it's called the perfection of giving.",
        "source": "T08n0261_004:0883c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0883c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以食施者當施五事。",
        "translation": "Someone who gives food as alms should give five things.",
        "source": "T08n0261_004:0883c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為五。",
        "translation": "What are the five?",
        "source": "T08n0261_004:0883c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者施命，若人無食難以濟命。",
        "translation": "One is giving life, for without food it's difficult to save a person's life.",
        "source": "T08n0261_004:0883c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者施色，因得食故顏色和悅。",
        "translation": "Second, it's a gift of form, for it's because of the food that they get that their color is pleasant.",
        "source": "T08n0261_004:0883c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者施力，以是食故增益氣力。",
        "translation": "Third, it's a gift of strength. Because of this food, vitality is increased.",
        "source": "T08n0261_004:0883c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者施樂，以此食故身心安樂。",
        "translation": "The fourth gives happiness, for it's because of this food that he's comfortable in body and mind.",
        "source": "T08n0261_004:0883c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者施辯，若飢餓者身心怯弱，言說謇訥不能辯了，飲食充足身心勇銳，得大辯才智慧無礙。",
        "translation": "The fifth is giving eloquence. If a hungry person is physically and mentally weak, and their speech is stilted and incomprehensible, and they have enough food to make them physically and mentally vigorous, they attain great eloquence and unimpeded wisdom.",
        "source": "T08n0261_004:0883c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩施飯食時，應作如是迴向發願：『我施食時施此五事。",
        "translation": "When a bodhisattva-mahāsattva gives food, he should make this comeback and vow, 'When I give food, I'll give these five things.",
        "source": "T08n0261_004:0883c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施命者，願與一切眾生得佛壽命長遠無盡，一劫二劫隨願而住。",
        "translation": "If I give life, may all sentient beings attain a Buddha's life span that's both long and inexhaustible, and may they live for one or two eons as they wish.",
        "source": "T08n0261_004:0883c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二施色者，願與一切眾生得佛色身如紫金色，照曜世間過百千日。",
        "translation": "Second, whoever gives form, may all sentient beings attain a Buddha's body that's purple-gold in color and shines in the world for more than a hundred thousand days.",
        "source": "T08n0261_004:0883c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三施力者，願與一切眾生得佛十力，一一節中皆有八萬四千六百六十三種那羅延力。",
        "translation": "Third, he gives strength, vowing that all sentient beings will attain the Buddha's ten powers, each of which contains 84,000,663 kinds of power of a nārāyaṇa.",
        "source": "T08n0261_004:0883c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四施樂者，願與一切眾生得佛無比涅槃安樂。",
        "translation": "Four, who gives happiness, vows that all sentient beings will attain the Buddha's unsurpassed peace and happiness in nirvāṇa.",
        "source": "T08n0261_004:0883c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五施辯者，願與一切眾生得佛世尊四無礙辯。",
        "translation": "For those who give five kinds of eloquence, may all sentient beings attain the four unhindered eloquences of the Bhagavān.",
        "source": "T08n0261_004:0883c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施味時，願與一切眾生得佛無上甘露法味具足充滿，安置無比清淨涅槃。",
        "translation": "When giving flavor, may all sentient beings attain the Buddha's unsurpassed taste of ambrosia and Dharma, which fills them completely and places them in unsurpassed pure nirvāṇa.",
        "source": "T08n0261_004:0883c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施漿時，願與一切眾生除其渴愛。",
        "translation": "When giving milk, may all sentient beings be freed from thirst and craving.",
        "source": "T08n0261_004:0883c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施美飲砂糖石蜜甘蔗蒲萄種種香飲，得如來口中四牙，所有飲食及諸毒藥，至此牙時變成甘露。",
        "translation": "If he gives a nice drink of sugar, rock honey, sugarcane, and grapes with various fragrances, he'll obtain four teeth in the Tathāgata's mouth, and when all the food and drink and poisons reach those teeth, they'll turn into sweet nectar.",
        "source": "T08n0261_004:0883c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施醫藥，願與一切眾生得六度藥療生死病，悉得痊除獲涅槃樂。",
        "translation": "If I give medicine, may all sentient beings receive the six perfections for the illnesses of birth and death, and they'll all be cured and attain the joy of nirvāṇa.",
        "source": "T08n0261_004:0883c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施衣服，願與一切眾生得慚愧服以覆其身，離諸陋形端嚴殊勝，獲金色身最勝無比。",
        "translation": "If I were to give clothing, may all sentient beings obtain robes of conscience to cover their bodies, part with ugly forms and beautiful features, and attain a golden body that's unsurpassed.",
        "source": "T08n0261_004:0883c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施塗香種種末香，願與一切眾生戒香塗身，悉除煩惱臭穢習氣。",
        "translation": "If I were to give a gift of perfume, may I give all sentient beings the fragrance of precepts to coat my body, which will remove all the afflictive, smelly, and defiled karmic impressions.",
        "source": "T08n0261_004:0884a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施象馬車乘輦輿船筏，願與一切眾生皆得如來隨心三昧，遊止自在無所障礙。",
        "translation": "If I were to give an elephant, horse, chariot, carriage, mule, or boat and raft, may all sentient beings attain the samādhi of the Tathāgata's accordant mind and travel freely without any obstruction.",
        "source": "T08n0261_004:0884a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施橋梁時，願與一切眾生得六度橋，越生死河至涅槃岸。",
        "translation": "When I give a bridge, may all sentient beings attain the bridge of the six perfections and cross the river of birth-and-death to the shore of nirvāṇa.",
        "source": "T08n0261_004:0884a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施瓔珞，願與一切眾生得三十二相八十種好瓔珞莊嚴。",
        "translation": "When I donate a necklace, may all sentient beings attain the jewelry adorned with the thirty-two marks and eighty beauties of a necklace.",
        "source": "T08n0261_004:0884a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於曠野沙磧之處，往來渴乏為日所曝，施以井池飲水沐浴，願與一切眾生離於流轉生死曠野，三毒炎火渴愛之苦。",
        "translation": "If I were to give a well or pond of water to drink and bathe in a wilderness or sandy hill where thirst has been reduced to exposure to the sun, may I rid all sentient beings of the wilderness of transmigration through birth and death and the suffering of thirst from the three poisons and fires.",
        "source": "T08n0261_004:0884a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復願我身為法泉池，一切智水充滿其中，隨彼眾生飲水沐浴，竭生死源得真解脫。",
        "translation": "May I also be a spring of the Dharma filled with the water of all wisdom, and may I follow those sentient beings as they drink and bathe, drying up the source of birth-and-death and attaining true liberation.",
        "source": "T08n0261_004:0884a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施義堂屋令諸眾生，離風雨怨賊惡獸怖懼，身得安樂，願與一切眾生悉得入於涅槃堂屋，離煩惱賊地獄寒熱生死風雨，永無怖畏。",
        "translation": "May I give them a purposeful dwelling so that all sentient beings will be freed from the fear of wind and rain, resentments, thieves, and harmful animals, and will attain physical well-being, and may all sentient beings be admitted to the dwelling of nirvāṇa, freed from the fear of afflictions and thieves, the cold and heat of hell, the wind and rain of birth-and-death, and forever free from fear.",
        "source": "T08n0261_004:0884a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施氈褥細軟敷具，願與眾生坐菩提座，自然覺悟得真平等。",
        "translation": "If he were to give blankets and mats, fine and soft cloths, may he and all sentient beings sit on the throne of enlightenment and attain true equality with natural awakening.",
        "source": "T08n0261_004:0884a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施種種上妙衣服，願與一切眾生得三乘法衣，普覆一切苦惱眾生。",
        "translation": "If he gives various kinds of fine clothing, may he give them to all sentient beings to attain the three-vehicle Dharma robe that covers all suffering sentient beings.",
        "source": "T08n0261_004:0884a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施三寶師僧父母種種燈燭，願與一切眾生得一切智眼。",
        "translation": "If I were to give various candles and lamps to the Three Treasures' teachers, monks, and parents, may all sentient beings attain the all-seeing eye.",
        "source": "T08n0261_004:0884a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施音樂，願與一切眾生得真天耳，十方世界所有音聲皆悉聞知。",
        "translation": "If I give music, may all sentient beings attain the true divine ear, which hears all the sounds of the world in the ten directions.",
        "source": "T08n0261_004:0884a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於逈遠無佛法處，建立僧坊及招提舍，置諸資具飲食湯藥，願與一切眾生置涅槃城安樂之處，永離流轉生死之苦。",
        "translation": "If he were to build a monastery or a summer residence far away from the Buddha's teaching and install provisions, food, drink, and medicine, may all sentient beings be placed in the city of nirvāṇa and in a place of comfort, freeing them forever from the pain of transmigration through birth and death.",
        "source": "T08n0261_004:0884a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施湯藥，願與一切眾生施以法藥除煩惱病。",
        "translation": "If he gives hot water and medicine, may he give all sentient beings medicine from the Dharma to remove the disease of affliction.",
        "source": "T08n0261_004:0884a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施僕使，願與一切眾生悉如阿難奉侍如來。",
        "translation": "If I were to give alms to a servant, may all sentient beings be like Ānanda in serving the Tathāgata.",
        "source": "T08n0261_004:0884a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若救囚繫令得解脫，願與眾生遠離一切煩惱囚繫，得真解脫住法王位。",
        "translation": "If he rescues prisoners and makes them free, may he free sentient beings from all the bonds of affliction and attain true liberation as Dharma king.",
        "source": "T08n0261_004:0884a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施金銀及無價寶，願與一切眾生得百福相莊嚴其身。",
        "translation": "If he were to give gold and silver and priceless jewelry, may he and all sentient beings attain a hundred blessings to adorn their bodies.",
        "source": "T08n0261_004:0884a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施寶冠莊嚴之具，瓔珞環釧耳璫珠鬘種種校飾，願與一切眾生獲八十種好莊嚴法身。",
        "translation": "If he were to give a jeweled crown of adornment, a necklace, rings, pins, earrings, and jewelry, may he and all sentient beings attain 80 kinds of beauty that adorn the Dharma body.",
        "source": "T08n0261_004:0884a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施阿蘭若修道之處，願與一切眾生得四聖種依止之所。",
        "translation": "If he were to give monks a place to practice, may all sentient beings attain the four holy types of support.",
        "source": "T08n0261_004:0884b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施伏藏，願與一切眾生得佛無上功德法財。",
        "translation": "If I were to give offerings of ambrosia, may all sentient beings attain the Buddha's unsurpassed treasures of merit and Dharma.",
        "source": "T08n0261_004:0884b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施七寶及轉輪王位自在安樂，願與一切眾生得大力用，以妙法手拔濟眾生出十惡業，以十善水洗令清淨，以淨戒香用塗其身，除斷一切惡名臭氣，以慚愧衣服而為覆蓋，以佛功德而為瓔珞，以忍辱為花鬘莊嚴其身，以靜慮為床座安處不動，以菩提冠置於頂上，處法王位而受灌頂。』",
        "translation": "If I were to give a gift of the seven treasures and the position of wheel-turning king for their own enjoyment, may I give all sentient beings the mighty power to rescue them from the ten bad karmas with the hand of the wonderful Dharma, purify them with the ten good waters, anoint their bodies with the scent of pure precepts, rid them of all bad repute and odor, cover them with the garment of modesty, adorn their bodies with the jewelry of the Buddha's merits, adorn their bodies with the flower garland of patience, stand motionless with the seat of meditation, place the crown of enlightenment on their heads, and place them at the position of Dharma king to receive the consecration.'",
        "source": "T08n0261_004:0884b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏！",
        "translation": "Maitreya!",
        "source": "T08n0261_004:0884b10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知如是施者，此即名為菩薩行於小施。",
        "translation": "You should know that this is called a bodhisattva practicing minor generosity when he thus gives.",
        "source": "T08n0261_004:0884b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，言大施者，菩薩摩訶薩於所愛敬貞順妻妾，及以端正孝友男女愛無雙者，以用布施。",
        "translation": "\"Furthermore, when it comes to great generosity, the bodhisattva Mahāsattva gives to a wife and concubine whom he loves, respects, and is loyal to, and to a man and woman whom he loves correctly and dutifully.",
        "source": "T08n0261_004:0884b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我不捨此妻子者，云何得與一切眾生為法父母，及能憐愛一切眾生，悲愍救護如己愛子，能令離於生老病死。",
        "translation": "If I didn't abandon this wife, how would I be able to be a father and mother to all sentient beings, have compassion for all sentient beings, and rescue them as my own beloved child, capable of ridding them of birth, old age, illness, and death?",
        "source": "T08n0261_004:0884b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，菩薩摩訶薩一切寵愛珍惜之者悉皆布施，乃至成佛無上菩提。",
        "translation": "Because of this, the bodhisattva Mahāsattva gives alms to all those whom he loves and cherishes, even up to the point of achieving the Buddha's unsurpassed enlightenment.",
        "source": "T08n0261_004:0884b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏！",
        "translation": "Maitreya!",
        "source": "T08n0261_004:0884b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知如是施者，名為菩薩行於大施。",
        "translation": "You should know that someone who thus gives is called a bodhisattva who practices great generosity.",
        "source": "T08n0261_004:0884b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，第一義施者，菩薩摩訶薩以清淨心，於自身手足皮肉骨髓頭目耳鼻乃至身命，以用布施，心無悋惜。",
        "translation": "\"Furthermore, the first-meaning gift is when a bodhisattva gives with a pure heart to his own hands, feet, skin, bones, marrow, head, eyes, ears, nose, and even his own life, without stinginess or stinginess of mind.",
        "source": "T08n0261_004:0884b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此功德，願與一切眾生於當來世得佛金剛不壞之身。",
        "translation": "With this merit, he wishes for all sentient beings to attain the Buddha's adamantine, indestructible body in a future life.",
        "source": "T08n0261_004:0884b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施手足心無悋惜，願與一切眾生於生死流轉漂溺瀑河無救護者，授正法手拔濟令出置安樂地。",
        "translation": "If he gives his hands and feet without stinginess of mind, may he give his right Dharma hand to rescue all sentient beings who are caught in the current of birth-and-death and drown in the Cascade River and have no means of protection, so that they can escape and be placed in a state of comfort.",
        "source": "T08n0261_004:0884b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施耳鼻舌時，願與一切眾生於當來世，悉得諸佛清淨五根，以是妙法莊嚴眾生。",
        "translation": "If he gives his ears, nose, and tongue, may all sentient beings in the future attain the five pure faculties of the buddhas and adorn sentient beings with this wondrous Dharma.",
        "source": "T08n0261_004:0884b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以血肉施諸眾生，如是施時，願與一切眾生當得此身猶如大地，與諸有情作依止處，亦如大水能除垢穢，潤澤枯涸百卉滋長，又如大火能除闇冥成就一切，復如大風能鼓一切，開發生長使得敷榮。",
        "translation": "When giving flesh and blood to sentient beings, may all sentient beings attain a body like the earth that serves as a support for sentient beings, like great water that removes pollution and moistens dried-up plants, like a great fire that removes darkness and accomplishes everything, and like a great wind that encourages everything to develop, grow, and spread prosperity.",
        "source": "T08n0261_004:0884b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施眼時，願與一切眾生而得佛眼。",
        "translation": "When he gives an offering of the eye, he wishes that all sentient beings would attain the Buddha's eye.",
        "source": "T08n0261_004:0884c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施頭首及施寶冠，願與一切眾生得佛無上七覺寶冠。",
        "translation": "If I were to give a headdress and a jeweled crown, may all sentient beings attain the Buddha's unsurpassed jeweled crown of seven awakenings.",
        "source": "T08n0261_004:0884c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0884c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所有世間妙好之物，不生貪著，常能惠施一切有情。",
        "translation": "\"The bodhisattva Mahāsattva doesn't become attached to all the world's wonderful things and always gives generously to all sentient beings.",
        "source": "T08n0261_004:0884c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0884c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以大悲心等視眾生猶如一子，願與一切眾生永息貧窮，於所求願悉令滿足，而於生死曠野之中備七聖財得佛智寶。",
        "translation": "With great compassion, he regards sentient beings equally as if they were a single child, wishes to end poverty forever with all sentient beings, fulfills all of their aspirations, and equips them with the seven noble assets in the wilderness of birth and death to attain the Buddha's wisdom treasure.",
        "source": "T08n0261_004:0884c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0884c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩修行布施無諸過患？",
        "translation": "\"How does the practice of generosity by the bodhisattvas and mahāsattvas have no faults?",
        "source": "T08n0261_004:0884c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂自手營作而行布施，非嫉妬他、非畏惡名、非求恩德而行布施，為濟貧乏惸獨困苦而行布施，是名為施。",
        "translation": "Doing charity with your own hands, not being jealous of others, not fearing bad publicity, and not seeking favors, and doing it to help the poor and lonely who are suffering is called giving.",
        "source": "T08n0261_004:0884c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為名聞而作師長行於布施，如商賈人非真施也。",
        "translation": "If someone makes themselves a teacher and gives alms for the sake of fame and reputation, they're like a merchant who doesn't really give alms.",
        "source": "T08n0261_004:0884c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起大悲心，不擇怨親財物多少而行布施，名真施也。",
        "translation": "Giving alms with great compassion and without discriminating the amount of property owed to enemies and relatives is called true almsgiving.",
        "source": "T08n0261_004:0884c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0884c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二種田！",
        "translation": "There are two kinds of fields!",
        "source": "T08n0261_004:0884c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為二？",
        "translation": "What are the two?",
        "source": "T08n0261_004:0884c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者悲田，謂諸孤露貧窮困苦。",
        "translation": "The first is the field of compassion, which refers to the orphaned, poor, and distressed.",
        "source": "T08n0261_004:0884c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者敬田，謂佛法僧父母師長。",
        "translation": "The second is the field of veneration, which refers to the buddhas, Dharma, saṃgha, parents, teachers, and elders.",
        "source": "T08n0261_004:0884c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於悲田所，不應輕賤言無福田。",
        "translation": "In the field of compassion, you shouldn't despise them and say there's no field of merit.",
        "source": "T08n0261_004:0884c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於敬田所，不應求報。",
        "translation": "In the field of respect, they shouldn't seek reward.",
        "source": "T08n0261_004:0884c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以大悲心，無所分別等施一切，名真施也。",
        "translation": "Giving everything equally and without discrimination with a mind of great compassion is called true giving.",
        "source": "T08n0261_004:0884c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又布施者勿起希求，而於財物不能捨離。",
        "translation": "Also, a person who gives alms should not wish for it but is unable to part with possessions.",
        "source": "T08n0261_004:0884c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或被官逼奪而行布施，或畏損失而行布施。",
        "translation": "He might be forced by an official to give, or he might fear loss while giving.",
        "source": "T08n0261_004:0884c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於三寶所不得輕慢，應生尊重，不自稱說而行布施。",
        "translation": "They mustn't despise the three treasures, but must respect them and give alms without claiming to do so.",
        "source": "T08n0261_004:0884c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以重寶無所愛著，不生我慢亦不貢高而行布施，名真布施。",
        "translation": "If someone gives alms because they have no attachment to valuable treasures and don't become proud of or haughty about them, that's called true almsgiving.",
        "source": "T08n0261_004:0884c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於敬田不生恭敬，將所厭物而施與之，不名為施。",
        "translation": "If someone doesn't respect a field of veneration and gives something they dislike to it, that's not called generosity.",
        "source": "T08n0261_004:0884c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或為家貧無妙好物，而有麤鄙，恥不施之，以是因緣都不行施。",
        "translation": "If a person's family is poor and lacks marvelous good things, and they have coarse things, they're ashamed not to give them, and this is not a cause for giving.",
        "source": "T08n0261_004:0884c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T08n0261_004:0884c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫行施者不應分別，隨其所有來即與之，是即名為檀波羅蜜。",
        "translation": "\"Someone who practices generosity without discriminating and gives to others as they have it is called the perfection of giving.",
        "source": "T08n0261_004:0884c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩不應自恃持戒、多聞、禪定、智慧而行布施，亦不輕慢他人貪恚、愚癡、寡聞、破戒而行布施，非淨施也。",
        "translation": "A bodhisattva Mahāsattva shouldn't practice giving because he's proud of his observance of precepts, learning, meditation, and wisdom, and he doesn't despise others for their craving, foolishness, lack of learning, or breaking of precepts, which is not pure giving.",
        "source": "T08n0261_004:0884c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行布施，無不活畏、無惡趣畏，隨其多少而施與之。",
        "translation": "When a bodhisattva-mahāsattva makes alms, he has no fear of not living and no fear of bad destinies, and he gives to them as much or as little as he wants.",
        "source": "T08n0261_004:0885a03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以廣大心，皆得無盡無量功德，是即名為檀波羅蜜。",
        "translation": "With a generous heart, they all attain inexhaustible and measureless merit, which is called the perfection of giving.",
        "source": "T08n0261_004:0885a04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為布施互相嫉妬，令家眷屬鬪諍不和，不名布施。",
        "translation": "If mutual jealousy exists because of generosity, and it causes family members to fight and become discordant, that's not called generosity.",
        "source": "T08n0261_004:0885a06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為布施譏毀乞人：『汝今丁壯，諸根具足，何不自作營理生業而求乞耶？』",
        "translation": "Suppose you criticize a beggar for giving alms, saying, 'Now that you're young and strong and have sufficient faculties, why don't you create your own business of livelihood and ask for alms?'",
        "source": "T08n0261_004:0885a07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是施者不名布施。",
        "translation": "Such a donor doesn't call it generosity.",
        "source": "T08n0261_004:0885a08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或施已追悔而作是言：『我為愚癡枉費財物。』",
        "translation": "Perhaps they repent after giving and say, 'Foolishly, I wasted my money and property.'",
        "source": "T08n0261_004:0885a09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是施者不名為施。",
        "translation": "Such a donor doesn't call it generosity.",
        "source": "T08n0261_004:0885a10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或希他讚歎、或怖惡名，如是施者不名布施。",
        "translation": "Whether someone wants to be praised by others or fears a bad reputation, such a donor doesn't call it generosity.",
        "source": "T08n0261_004:0885a10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或為惡願而行布施，不名布施。",
        "translation": "Whether someone gives for a bad wish is not called generosity.",
        "source": "T08n0261_004:0885a11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或擇日而施——謂白月一日、八日、十四日、十五日，黑月三日、八日、九日、十三日、十四日、十五日，如是日施餘日不施——不名為施。",
        "translation": "Whether someone chooses the days to give - that is, the first, eighth, fourteenth, or fifteenth day of a white moon, or the third, eighth, ninth, thirteenth, fourteenth, or fifteenth day of a black moon, and thus gives on those days but doesn't give on the others - it's not called giving.",
        "source": "T08n0261_004:0885a12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或擇時施——晨朝布施，午時不施，日暮餘時亦復如是——如此施者不名布施。",
        "translation": "Whether someone chooses the right time to give - giving in the morning, not at noon, or at sunset for the rest of the day - such a gift is not called giving.",
        "source": "T08n0261_004:0885a15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或擇人施——施與貧者不施富者，或貧富俱施不施病者，或與病者不施餘類，或施此人不施彼人——如是施者不名布施。",
        "translation": "Sometimes they choose people to give to - to give to the poor and not to the rich, or to give to both the rich and the poor and not to the sick, or to give to the sick and not to others, or to give to this person and not to another - such giving is not called generosity.",
        "source": "T08n0261_004:0885a16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或選知識顏貌端正而與好物，餘施惡物，不名為施。",
        "translation": "Perhaps selecting a friend with a decent countenance and giving him or her nice things and giving the rest bad things is not called giving.",
        "source": "T08n0261_004:0885a19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或見乞者俳優鼓樂善戲談笑而施與之，餘者不施，如是施者不名布施。",
        "translation": "Sometimes they see a beggar who is entertaining, plays music, laughs, and gives to him; the rest they don't give; such a donor doesn't call it generosity.",
        "source": "T08n0261_004:0885a20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫布施者不求果報——輪王、護世、釋梵諸天、剎帝利家及婆羅門長者、居士，如是家生——而為已身自求解脫而行布施，亦不厭退生疲倦心，言：『我已施，不應更施。』",
        "translation": "A person who gives alms without expecting rewards - wheel-turning kings, guardian gods, Śakra gods, Śakra gods, elders of brāhmaṇas, householders, and so forth - but instead gives alms for his own personal liberation, and doesn't grow weary of retrogressing, saying, 'I've given, so I shouldn't give any more.'",
        "source": "T08n0261_004:0885a22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等施但名布施，不得名為檀波羅蜜。",
        "translation": "Such giving is simply called giving, and it doesn't get to be called giving the perfection of giving.",
        "source": "T08n0261_004:0885a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0885a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩不為如上非法布施，以正解脫迴向發願無上菩提是真布施，檀波羅蜜究竟清淨，於阿耨多羅三藐三菩提得不退轉。",
        "translation": "\"The bodhisattva Mahāsattva doesn't give unlawful alms like these; this is true almsgiving that returns with right liberation, vowing unsurpassed enlightenment, and which is ultimately purified by the perfection of the perfection of giving, so that he attains irreversibility in the unsurpassed, correct, and contemplated enlightenment.",
        "source": "T08n0261_004:0885a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是，離諸過失行無相施，所得功德無量無邊，廣大如法界，究竟若虛空。",
        "translation": "If they can thus part with their faults and practice formless generosity, the merits they attain are measureless and limitless, vast as the Dharma realm, and perfect as space.",
        "source": "T08n0261_004:0885b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩以如是心，若施一華、若施一果乃至施水一滴，而於此經受持讀誦乃至一偈一句，令他聽聞經一剎那，所得功德無量無邊。",
        "translation": "With this kind of mind, if a bodhisattva-mahāsattva gives a flower, a fruit, or even a drop of water, and he or she accepts, reads, and recites even a single verse or sentence from this sūtra, causing others to hear it for a single moment, the merit gained is immeasurable and limitless.",
        "source": "T08n0261_004:0885b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人從無量阿僧祇劫所行布施，以金銀七寶及餘種種上妙珍財以用布施，求轉輪王、釋梵護世或求阿羅漢果、獨覺菩提及餘作業，於無量無邊阿僧祇劫受持淨戒所有功德，比前菩薩摩訶薩無住相施所得功德，百分千分萬分億分俱胝分乃至鄔波尼殺曇分不及其一。",
        "translation": "If another person has made alms from countless incalculable eons, using gold, silver, seven treasures, and other kinds of wonderful treasures to give to the wheel-turning king, Brahmā and Brahmā to protect the world, or to pursue the fruit of the arhat, the enlightenment of the pratyekabuddhas, and other endeavors, the merits of upholding pure precepts over countless and limitless incalculable eons would be no greater than the merits obtained from the previous bodhisattva-mahāsattva's markless gift of a hundred thousand parts, ten thousand parts, billion parts, or even the upaniṣad part.",
        "source": "T08n0261_004:0885b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此菩薩願力所施，一滴之水投於大海，海水有盡滴水無盡。",
        "translation": "However, when a drop of water from this bodhisattva's vow is cast into the ocean, the water has an end and the drop is inexhaustible.",
        "source": "T08n0261_004:0885b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0885b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生無盡故菩薩願力亦無有盡，虛空、法界亦復如是。",
        "translation": "Because sentient beings are inexhaustible, the power of the bodhisattva's vow also has no limit, and so does space and the Dharma realm.",
        "source": "T08n0261_004:0885b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩如是漸次勤行精進，得大神通昇妙高山，或至大海獲無價寶，還贍部洲雨種種寶給施有情，或雨飲食、衣服、臥具、救病醫藥，除斷有情飢渴疾病貧窮困苦。",
        "translation": "\"Furthermore, by thus gradually and diligently exerting himself, the bodhisattva Mahāsattva attains great supernormal powers and rises to a high, marvelous mountain, or he might reach the ocean and obtain priceless treasures and return to the Jambudvīpa continent to rain down various treasures to give to sentient beings, or he might rain down food, drink, clothing, bedding, and medicines to save them from hunger, thirst, disease, poverty, and hardship.",
        "source": "T08n0261_004:0885b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此功德願施有情，盡未來際常無休息，廣大如法界，究竟若虛空，若但自利而行布施。",
        "translation": "Because of this merit, he vows to give to sentient beings, always without rest for the rest of time, vast as the Dharma realm, and ultimately like space, if he only gives alms for his own benefit.",
        "source": "T08n0261_004:0885b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如空片雲風吹即散，豈能利益一切眾生。",
        "translation": "Like a hollow cloud that scatters when the wind blows, how could it benefit all sentient beings?",
        "source": "T08n0261_004:0885b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩如是布施，同真際、等法界，火不能燒，水不能漂，風不能吹，金剛堅寶不能碎壞，是故菩薩布施願力，能令眾生得大利益究竟安樂，亦令一切有情同此行願，乃至無上正等菩提，誓不退轉常行是行，乃至涅槃利益有情令得解脫。",
        "translation": "\"Furthermore, when a bodhisattva so gives alms, it's the same as the true state and the same realm of reality, which cannot be burned by fire, cannot be sunk by water, cannot be blown by wind, and cannot be broken by adamantine jewels.",
        "source": "T08n0261_004:0885b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0885b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來在世，一切有情而以種種上妙衣服、房舍、臥具、飲食、湯藥、酥燈、油燈、瞻蔔油燈、種種花香，以奉供養尊重恭敬歌唄讚歎，於佛滅後取佛舍利起窣堵波，亦作如上種種供養尊重讚歎。",
        "translation": "When the Tathāgata was alive, all sentient beings made offerings of various kinds of fine clothing, dwellings, bedding, food, medicine, ghee lamps, oil lamps, camphor oil lamps, and various flowers and incense, honoring, respecting, venerating, singing, and praising them, and when they took the Buddha's relics after he died and raised a stūpa, they also made the above kinds of offerings, honoring, and praising them.",
        "source": "T08n0261_004:0885b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二事，功德果報等無差別。",
        "translation": "These two things have no distinction in terms of their merits and rewards.",
        "source": "T08n0261_004:0885c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此義利，令諸有情發慇重心虔誠愛樂，以敬慕故，發菩提心聽聞正法如說修行，便能趣證阿羅漢果、辟支佛果及諸菩薩成就十地圓滿六度，乃至佛果無上正等菩提。",
        "translation": "Because of this benefit, it causes sentient beings to arouse devotion and respect, and because of that respect, they arouse the aspiration to hear the right teaching and practice it as it's taught, which then leads them to realize the fruit of the arhat, the fruit of the pratyekabuddha, the accomplishment of the ten stages by the bodhisattvas, and the full accomplishment of the six perfections, up to the fruit of the Buddha's unsurpassed perfect enlightenment.",
        "source": "T08n0261_004:0885c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即此有情復能勸喻諸有情等，同修勝行乃至證得無上正等菩提。",
        "translation": "That sentient being can also encourage other sentient beings to similarly cultivate superior practices and realize unsurpassed correct enlightenment.",
        "source": "T08n0261_004:0885c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，菩薩摩訶薩修行布施波羅蜜多，乃至施水一滴所有利益，同真際、等法界，無有窮盡。",
        "translation": "Because of this, the bodhisattva Mahāsattva's practice of the perfection of generosity, up to giving a single drop of water, brings benefits that are the same as the true reality and equal to the Dharma realm, which knows no limit.",
        "source": "T08n0261_004:0885c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行施時，不能普為一切有情迴向無上正等菩提，設以寶聚如妙高山而用布施，利益甚少。",
        "translation": "If, when practicing generosity, they can't dedicate themselves to the unsurpassed perfect enlightenment of all sentient beings, and if they were to use a jeweled heap like a marvelous high mountain to give alms, the benefits would be minimal.",
        "source": "T08n0261_004:0885c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如芥子易可窮盡，亦如片雲風飄即滅。",
        "translation": "It's like a mustard seed that's easily exhaustible, or like a cloud that disappears in the wind.",
        "source": "T08n0261_004:0885c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0885c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩修習大乘布施行時，猶如伏藏隨自身行，如如意樹隨有情意能滿彼願。",
        "translation": "When the bodhisattva Mahāsattva cultivates the practice of the great vehicle, it's like a quiescent store that follows its own actions, like a wishing tree that fulfills the wishes of sentient beings according to their intentions.",
        "source": "T08n0261_004:0885c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩應當更發二種勝心：一者所有資財庫藏諸物知自性空：猶如陽焰：夢想：幻化；二者於諸有情起大悲心，若見貧窮起憐愍心。",
        "translation": "The bodhisattva Mahāsattva should further arouse two kinds of superior thoughts: first, knowing the self-nature of all the things in his wealth and treasure store to be empty: they're like sunflames, dreams, and illusions; and second, arousing a mind of great compassion for sentient beings, and if he sees poverty, he should become compassionate.",
        "source": "T08n0261_004:0885c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發是心已應正了知，於是財寶不應慳悋，手自行施，願與一切有情同證無上正等菩提。",
        "translation": "After you give rise to this mind, you should correctly understand that you shouldn't be stingy with your possessions, and you should give them to yourself with your bare hands, hoping to realize unsurpassed perfect enlightenment with all sentient beings.",
        "source": "T08n0261_004:0885c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之財真我所有，設畜財物終不為已，皆為饒益一切眾生，悉皆成就檀波羅蜜。",
        "translation": "Such wealth really belongs to me, and even if I were to store it, I would never do it for the benefit of all sentient beings, and it would all accomplish the perfection of giving.",
        "source": "T08n0261_004:0885c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我積聚種種財物不能自施，如是之物非是我有，用不自在同於裸形，如守藏人自無其分，無常賊來風刀解體，所愛財物、妻妾持去別奉他人。",
        "translation": "If I amass various possessions that I can't give to myself, such things are not mine, and I use them uncomfortably like a naked person, like a person guarding a stash who has no part of it, or a thief who comes along and disembowels me with a wind knife, he takes my favorite possessions and wives and concubines and presents them to others.",
        "source": "T08n0261_004:0885c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人得已倍復慳惜，乃至命終亦復如是，展轉慳悋終不能捨。",
        "translation": "After acquiring them, that person doubly covets them, and so will he be until the end of his life, continuously coveting them and never being able to abandon them.",
        "source": "T08n0261_004:0885c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等人暫時守護，以是當知如是資財定非我物，王、賊、水、火及與惡子悉皆有分、常懼侵奪思寄親知、寢息不安恒憂散失。",
        "translation": "Such a person temporarily guards it, knowing that such possessions are certainly not his own, and that the king, thieves, water, fire, and evil sons all have a share in it, are always afraid of being plundered, want to send their relatives to know, and are constantly worried about losing it when they sleep and rest.",
        "source": "T08n0261_004:0885c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由慳不施招此憂危。",
        "translation": "This misfortune is caused by being stingy and not giving.",
        "source": "T08n0261_004:0886a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0886a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行此施已，水、火、怨賊不能侵奪，寢息安隱心無憂慮。",
        "translation": "After bestowing this gift, water, fire, and enemies can't harm them, and they rest peacefully with no worries at heart.",
        "source": "T08n0261_004:0886a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若自手施迴向發願，彼諸有情方霑其分，乃至佛果恒相隨逐，心常安隱離諸憂怖。",
        "translation": "If he dedicates his generosity to the vow, those sentient beings will then receive their share, and the fruit of the Buddha will always follow them, always at ease, and free from grief and fear.",
        "source": "T08n0261_004:0886a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若慳悋者常懷憂惱，現在世中諸苦根本，於未來世當知亦然。",
        "translation": "If stinginess always causes grief, the root of suffering in the present world will know that it's the same in the future.",
        "source": "T08n0261_004:0886a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0886a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慳悋不施所畜財物，如把草炬逆風而行，草盡燒手當受痛苦；若速棄者則無諸苦。",
        "translation": "Being stingy and not giving to those whose possessions are stored is like holding a straw torch against the wind, which burns up your hand and causes pain; if you quickly discard it, there'll be no suffering.",
        "source": "T08n0261_004:0886a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，當觀此財猶如火炬亦如幻焰，應速捨之求真實果。",
        "translation": "Once you know this, you should observe that this wealth is like a torch and an illusory flame, and you should quickly abandon it in search of its true fruit.",
        "source": "T08n0261_004:0886a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若慳貪有情互相讚歎：『汝有黠慧守護珍財，莫如愚人妄行惠施。』",
        "translation": "If stingy and greedy beings praise each other, 'You have the wisdom to guard your precious treasures, so don't be like a foolish man who gives generosity in vain.'",
        "source": "T08n0261_004:0886a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之人謗無因果，當墮地獄，餓鬼，畜生，設得為人常多貧賤。",
        "translation": "Such a person denigrating the lack of cause and effect will fall into hell, hungry ghosts, and animals, and will always be poor if they ever become human beings.",
        "source": "T08n0261_004:0886a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，能行施者，國王、大臣、婆羅門、居士之所稱讚，所出言詞人皆信受。",
        "translation": "\"Furthermore, those who practice generosity are praised by kings, ministers, priests, and householders, and their words are accepted by everyone.",
        "source": "T08n0261_004:0886a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慳悋之人不能惠施，常懷憂惱，謂施無福，當墮三塗。",
        "translation": "A stingy person who can't give generously is always sad and thinks giving is not beneficial, and he'll fall into the three destinies.",
        "source": "T08n0261_004:0886a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，能施之人一切敬愛，慳貪之輩眾所憎嫌。",
        "translation": "\"Furthermore, those who are generous are loved by everyone, and those who are stingy are disliked by everyone.",
        "source": "T08n0261_004:0886a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能布施者如僧伽藍，一切人天悉皆歸向；慳貪之人如陷塜墓，一切賢聖皆悉遠之，亦如涸池眾鳥不集。",
        "translation": "A person who gives generously is like the Saṃghârāma, to which all humans and gods turn, while a stingy person is like being stuck in a graveyard, from which all the noble and virtuous are distant, or like a dry pond in which many birds don't gather.",
        "source": "T08n0261_004:0886a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二人處大眾中，若讚於施聞之怡暢，若訶慳悋赧而媿之。",
        "translation": "If these two people are in the midst of a large crowd, they'll be pleased to hear the praise of generosity, and if they scorn parsimony, they'll blush and be embarrassed.",
        "source": "T08n0261_004:0886a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，行布施者諸天賢聖樂與同處，慳不施者餓鬼、畜生自然會集。",
        "translation": "\"Furthermore, when they practice generosity, the gods, noble people, and sages are happy to be in the same place, and when they are stingy and don't give, hungry ghosts and animals will naturally gather.",
        "source": "T08n0261_004:0886a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，行無相施，住第一義，得人法空，能利自他究竟圓滿。",
        "translation": "\"Furthermore, when they practice formless generosity, they abide in the ultimate truth, attaining the emptiness of people and things, and they are able to benefit themselves and others with complete fulfillment.",
        "source": "T08n0261_004:0886a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0886a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子、善女人，自稱菩薩修行大乘，應當決定正念思惟：『布施功德無量無邊，慳悋過失亦復無量。』",
        "translation": "If there are good men and good women who claim to be bodhisattvas cultivating the great vehicle, they should definitely and correctly contemplate, 'The merits of generosity are measureless and limitless, and the demerits of stinginess are also measureless.'",
        "source": "T08n0261_004:0886a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，決定斷除無有障礙。",
        "translation": "After thus knowing this, you'll be certain to remove no obstruction whatsoever.",
        "source": "T08n0261_004:0886b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見乞者來，顏色和悅言無譏毀，若聞乞聲歡喜愍念。",
        "translation": "When they see a beggar coming, their appearance is pleasant, their words aren't derogatory, and if they hear the sound of begging, they rejoice and are kind.",
        "source": "T08n0261_004:0886b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如孝子違離父母五十餘年，忽聞還家不勝喜躍聞。",
        "translation": "It's like a filial son who's been absent from his parents for more than 50 years and suddenly he hears that he's returned home and is overjoyed to hear it.",
        "source": "T08n0261_004:0886b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乞者聲亦復如是，迎至家中瞻覩如佛，發如是心：『此善知識今受我施，除我慳貪惡趣過失，無量利益莊嚴我身，無上菩提瑩飾我體。",
        "translation": "Similarly, the beggar's voice welcomes him home, looks up at him like the Buddha, and arouses this thought, 'This good man has now accepted my gift, removed my stinginess and greed for the faults of bad destinies, adorned my body with measureless benefits, and adorned my body with the unsurpassed bodhi.'",
        "source": "T08n0261_004:0886b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乞士著弊垢衣，和顏軟語愍我而來，是我良友。",
        "translation": "Such a beggar wearing robes made of rags and gentle words comforts me and is a good friend.",
        "source": "T08n0261_004:0886b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0261_004:0886b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除我身中慳貪過惡。",
        "translation": "'Remove the faults of stinginess and greed from my body.",
        "source": "T08n0261_004:0886b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之乞者是我郎主，我即奴僕，應受教命。』",
        "translation": "This beggar is my lord and master, and I am his slave, so I should accept his teaching and order.'",
        "source": "T08n0261_004:0886b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發是心已，從座而起，手自捧持所施之物，右膝著地歡喜奉施，願與一切眾生利益安樂，迴向無上正等菩提。",
        "translation": "Having given rise to this thought, he rose from his seat, held the offering in his hand, knelt on his right knee, and joyfully offered it, wishing to bring benefit and happiness to all sentient beings and to dedicate it to unsurpassed perfect enlightenment.",
        "source": "T08n0261_004:0886b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於乞者起利益心：『如是之人即是能行天如意樹，若無是者，如何得度生死曠野，不乏資糧，達於人天涅槃彼岸。』",
        "translation": "Again, he gives the beggar the benefit of his thought, 'Such a person is a godlike tree capable of doing what's expected of him; without such a person, how could he cross the wilderness of birth and death without running out of provisions and reach the other shore of nirvāṇa among humans and gods?'",
        "source": "T08n0261_004:0886b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是當知，人天安樂無上解脫，皆因乞者而得成就。",
        "translation": "You should therefore know that the happiness and unsurpassed liberation of humans and gods are all made possible by a beggar.",
        "source": "T08n0261_004:0886b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0886b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時乞者至菩薩所起大希望，菩薩是時家貧無物，應當軟語慰諭彼人，無令瞋恨不生疑惑令悉有無。",
        "translation": "If a beggar then comes to the bodhisattva with great hope, the bodhisattva's family is poor and lacks possessions, so he should speak softly to comfort that person, not make them angry, not give rise to doubt, and make them understand whether there's anything.",
        "source": "T08n0261_004:0886b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣歡喜而去。",
        "translation": "Because of this cause, he rejoices and departs.",
        "source": "T08n0261_004:0886b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩行布施時，應當慈悲寬其心意，所有乞者任彼往來，隨其所須皆不遮悋。",
        "translation": "\"Furthermore, when practicing almsgiving, the bodhisattva Mahāsattva should be compassionate and generous with his mind, allowing all the beggars to come and go as they need, and not covering up any shortage.",
        "source": "T08n0261_004:0886b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T08n0261_004:0886b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切財物，無常敗壞眾苦之本，如身瘡疣鳥持敗肉，其慳悋者不自食用，功德不修復不與人。",
        "translation": "\"All possessions are impermanent and corrupting sources of suffering, like a bird with sores and warts that carries spoiled flesh, which is stingy and won't be eaten by itself and whose virtues aren't cultivated and won't be given to others.",
        "source": "T08n0261_004:0886b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堅守財寶亦復如是，當知此人非行施者、不名菩薩，於大乘法不發勝心，亦不能成不退轉位。",
        "translation": "So it is when someone clings to possessions, knowing that they aren't practicing generosity and aren't called a bodhisattva, and they don't arouse a superior intention for the great vehicle teaching, nor can they achieve the stage of irreversibility.",
        "source": "T08n0261_004:0886b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海不宿死屍，大乘海中不容慳者。",
        "translation": "Like the ocean that doesn't harbor dead corpses, the great vehicle ocean doesn't allow stinginess.",
        "source": "T08n0261_004:0886b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所以修大乘行，為欲遠離一切罪垢、具修功德，於佛法中不生疑慮，於諸有情及諸財寶一切時中心無分別，常行惠施利樂群生。",
        "translation": "That's why bodhisattvas cultivate the practice of the great vehicle, because they want to be free of all the stain of sin, fully cultivate merit, have no doubts about the Buddha's teaching, have no discrimination among sentient beings and their possessions at all times, and always practice generosity for the benefit of all sentient beings.",
        "source": "T08n0261_004:0886c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是行圓滿布施波羅蜜多，速得成就阿耨多羅三藐三菩提。",
        "translation": "By thus practicing the perfection of the perfection of generosity, they'll quickly achieve supreme perfect enlightenment.",
        "source": "T08n0261_004:0886c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則名為第三勝義檀波羅蜜多。」",
        "translation": "This is called the third excellent pāramitā.\"",
        "source": "T08n0261_004:0886c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘理趣六波羅蜜多經卷第四",
        "translation": "Dasheng liqiu liuboluomi tuo jing, vol. 4",
        "source": "T08n0261_004:0886c07_0",
        "is_bad_quality": false
    }
]