[
    {
        "source_sentence": "光讚經卷第七",
        "translation": "Guangzan jing, vol. 7",
        "source": "T08n0222_007:0193a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉三藏竺法護譯",
        "translation": "Translated by Dharmarakṣa of the Western Jin Dynasty",
        "source": "T08n0222_007:0193a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶般若波羅蜜觀品第十七",
        "translation": "Mahāprajñāpāramitā-prajñāpāramitā-sūtra XVII",
        "source": "T08n0222_007:0193a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須菩提：「菩薩摩訶薩摩訶衍者，謂四意止。",
        "translation": "The Buddha told Subhūti, \"The bodhisattva Mahāsattva Mahāyāna refers to four kinds of mental cessation.",
        "source": "T08n0222_007:0193a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂四意止？",
        "translation": "What are the four kinds of mental cessation?",
        "source": "T08n0222_007:0193a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內自觀身，不與身俱，亦不想念、亦不得身。",
        "translation": "He observes the body internally, doesn't partake of it, doesn't conceive of it, and doesn't obtain it.",
        "source": "T08n0222_007:0193a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀于外身，不與身俱，亦不想念、亦不得身，於是安詳調御其意。",
        "translation": "He observes the external body, doesn't associate it with the body, doesn't miss it, and doesn't obtain it, and thus regulates his mind in a peaceful way.",
        "source": "T08n0222_007:0193a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀於世間無明愁慼，內觀痛痒彼心法者，於是安詳調御其意。",
        "translation": "He observes the world's ignorance and grief and observes internally the mental factors that cause pain and itch, and he thus regulates his mind in a peaceful way.",
        "source": "T08n0222_007:0193a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩於世間無明愁慼，觀外痛痒，不與痛痒俱，亦不想念，亦不得身。",
        "translation": "He observes worldly nescience and grief and observes external pain and itching, doesn't associate it with pain and itching, doesn't conceive of it, and doesn't attain the body.",
        "source": "T08n0222_007:0193a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀內思想，不與想俱，亦無想念，不得思想。",
        "translation": "He observes internal thoughts that aren't accompanied by perceptions, doesn't have perceptions, and doesn't allow perceptions.",
        "source": "T08n0222_007:0193a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀外思想，不與想俱，亦無想念，不得思想。",
        "translation": "He observes external thoughts that aren't accompanied by perceptions, doesn't have perceptions, and doesn't allow perceptions.",
        "source": "T08n0222_007:0193a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀於內法，不與法俱，亦無法想，亦不得法。",
        "translation": "He observes internal thoughts that aren't accompanied by perceptions, doesn't have perceptions, and doesn't obtain perceptions.",
        "source": "T08n0222_007:0193a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀于外法，不與法俱，亦無法念，亦不得法。",
        "translation": "When he observes external qualities that aren't accompanied by qualities, he can't think about them, and he doesn't attain the qualities.",
        "source": "T08n0222_007:0193a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是寂然調御其意於世無明愁慼之事。",
        "translation": "They then calmly regulate their thoughts and worldly matters of ignorance and grief.",
        "source": "T08n0222_007:0193a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂，須菩提！",
        "translation": "What's the meaning of this, Subhūti!",
        "source": "T08n0222_007:0193a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩內觀身？",
        "translation": "What is the bodhisattva-mahāsattva's internal contemplation of the body?",
        "source": "T08n0222_007:0193a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此菩薩摩訶薩，知心所行若住已住，亦知已坐當坐，亦知行臥已當行臥，如身應住所志所趣，皆悉知之。",
        "translation": "Here, the bodhisattva-mahāsattva knows what the mind is doing if it's standing and has stood, knows when he's sitting and should sit, and knows when he's walking and lying down and should walk and lie down, knowing exactly where the body should reside and what it aspires to.",
        "source": "T08n0222_007:0193b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩觀內身也。",
        "translation": "This is the bodhisattva-mahāsattva's contemplation of the internal body.",
        "source": "T08n0222_007:0193b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是安詳調御其意於世無明愁慼之事。",
        "translation": "He then calmly regulates his thoughts and worldly matters of ignorance and grief.",
        "source": "T08n0222_007:0193b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩往反安詳觀察視瞻而不卒暴，進止屈伸、著衣持鉢、飲食臥寐，懈息所從律行去來，坐起臥覺，有所說者，常懷徐詳，憙在閑居心不馳騁。",
        "translation": "The bodhisattva Mahāsattva goes back and forth, carefully observes and looks around without rushing, makes effort, bends and stretches, puts on his robe and bowl, eats and sleeps, goes and comes from his resting place and follows the restraints, sits up and lies down, and awakens to something that's being said, always with a calm and collected mind, and doesn't run around in his leisurely abode.",
        "source": "T08n0222_007:0193b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0193b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜自觀內身而不可得。",
        "translation": "A bodhisattva practicing prajñā-pāramit observes for himself the internal body, but it's unobtainable.",
        "source": "T08n0222_007:0193b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩其心專一覩出入息，息長、息短亦悉知之；意息若近、若遠亦悉知之；意息若遲、若疾亦悉知之；意息卒暴、柔和亦悉知之。",
        "translation": "When the bodhisattva Mahāsattva focuses his mind on observing his breathing in and out, he knows it well, whether it's long or short, whether his mind is near or far, whether it's slow or fast, and whether it's violent or gentle.",
        "source": "T08n0222_007:0193b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如，轉輪聖王知土地長短廣狹！",
        "translation": "It's like the wheel-turning sage king who knows the length and breadth of land!",
        "source": "T08n0222_007:0193b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如，瓦師作器知大小深淺！",
        "translation": "For example, a tile maker who makes a vessel knows its size and depth!",
        "source": "T08n0222_007:0193b14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, shall bodhi!",
        "source": "T08n0222_007:0193b14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩知息出入、長短、遲疾、剛柔。",
        "translation": "The bodhisattva Mahāsattva knows that his breath is in and out, long and short, slow and stiff, and flexible.",
        "source": "T08n0222_007:0193b15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是觀其內身，知其安詳，調御其心令順法教。",
        "translation": "Thus, the bodhisattva observes his internal body, knows its well-being, and regulates his mind so that it conforms to the teaching.",
        "source": "T08n0222_007:0193b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Suppository!",
        "source": "T08n0222_007:0193b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩內自觀身調御其意於世無明愁慼之事。",
        "translation": "\"The bodhisattva Mahāsattva observes himself internally and regulates his thoughts about the sadness of worldly ignorance.",
        "source": "T08n0222_007:0193b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩自觀其身四分諸種，今身有是地種、水種、火種、風種。",
        "translation": "\"The bodhisattva Mahāsattva observes for himself the four parts of his body, which now are the seeds of earth, water, fire, and wind.",
        "source": "T08n0222_007:0193b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如，屠兒以持利刀，殺害牛、畜解為四段，為四段已，坐起省察則無牛，因緣合成。",
        "translation": "It's like a butcher's son who uses a sharp knife to kill a cow or animal and dismember it into four pieces; after dismembering it into four pieces, he sits up and examines it, but there's no cow, and the causes and conditions combine.",
        "source": "T08n0222_007:0193b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0193b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜自觀是身，而身有此地種、水種、火種、風種。",
        "translation": "When a bodhisattva practicing prajñā-pāramit observes the body for himself, the body has this type of seed, this type of water, this type of fire, and this type of wind.",
        "source": "T08n0222_007:0193b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜自觀內身，亦不見身，亦無所得。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom observe the body within themselves, they don't see the body, and they don't acquire it.",
        "source": "T08n0222_007:0193b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩自察其身從頭至足，有身、髮、髓、腦，惡穢不淨具足充滿。",
        "translation": "\"The bodhisattva Mahāsattva examines his body from head to toe, and he finds that it's filled with body, hair, marrow, and brain that are filled with bad and unclean things.",
        "source": "T08n0222_007:0193b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有此身者，有髮毛、爪齒、皮革、筋脈、骨節、腸胃、腹、肝、肺、心、腎、五臟、血肉、脂髓、涕唾、垢濁、不淨、大便、小便。",
        "translation": "That body contains hair, nails, teeth, leather, sinews, bones, intestines, stomach, belly, liver, lungs, heart, kidneys, five viscera, flesh and blood, fat and marrow, tears and spittle, dirt and impurity, bowels, and urine.",
        "source": "T08n0222_007:0193b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如，佃家以囊器盛若干種穀、麻、米、粟、豆、大麥、小麥、稻穬。",
        "translation": "For example, a tenant farmer puts a container full of various kinds of grain, hemp, rice, millet, beans, barley, wheat, and rice drives.",
        "source": "T08n0222_007:0193b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明目之人寫之置地分別知之，是為麻油、是為粳米、是為豆粟、是為稻穬。",
        "translation": "A person with good eyes writes it down and places it on the ground, knowing that it's sesame oil, round-grained rice, beans and millet, and rice drive.",
        "source": "T08n0222_007:0193c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0193c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩今此身者，從足至頭，髮毛、爪齒、皮革、筋脈、骨節、腸胃、腹、肝、肺、心、腎、五臟、血肉、脂髓、[口*弟]唾、垢濁、不淨、大便、小便。",
        "translation": "Now, this body of the bodhisattva Mahāsattva extends from feet to head, with hair, nails, teeth, leather, tendons, bones, intestines, stomach, abdomen, liver, lungs, heart, kidneys, five viscera, flesh and blood, fat and marrow, [mouth*die] saliva, impurity, impurity, bowel movements, and urination.",
        "source": "T08n0222_007:0193c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0193c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩內自觀身調御其意於世無明愁慼之事，亦無所得。",
        "translation": "When a bodhisattva observes himself internally and regulates his mind, he obtains nothing from the world's ignorance and sadness.",
        "source": "T08n0222_007:0193c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如今觀身遭諸寒熱，若其壽終一日、若三日四日五日，其身膖脹，其色變青，臭爛膿血流出，計如此身，則不能離無常之法。",
        "translation": "Now, when a bodhisattva observes that his body is exposed to cold and heat, and if his life span ends in a day or in three, four, or five days, his body becomes swollen and swollen, his color turns blue, and his smelly, pusy blood flows out, and he considers such a body, then he can't escape the dharma of impermanence.",
        "source": "T08n0222_007:0193c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, Suppository!",
        "source": "T08n0222_007:0193c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩自觀內身！",
        "translation": "The bodhisattva-mahāsattva observes his own internal body!",
        "source": "T08n0222_007:0193c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知其安詳，調御其意於世無明愁慼之事，亦無所得，亦無所見。",
        "translation": "They know their well-being and control their thoughts about the world's ignorant grief, and they don't attain or see anything.",
        "source": "T08n0222_007:0193c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩觀人壽終遭是寒熱日炙風飄，死至一日、若至二日三日四日五日六日七日，為鳥烏所食，狐、狼、熊、羆、虎、豹、鵄、梟、狗犬所食，無央數蟲從其身出還食其體。",
        "translation": "When the bodhisattva observes that his life will end in cold, heat, sun, heat, and wind, he'll die in a day, or in two, three, four, five, six, or seven days, and be eaten by birds and crows, foxes, wolves, bears, bears, tigers, leopards, shields, lions, dogs, and dogs, and countless other insects will emerge from his body and eat it again.",
        "source": "T08n0222_007:0193c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人自察身所遊處，法無有常，分散離別，無脫此者。",
        "translation": "That person personally observes where their body travels, recognizing that things are impermanent and scattered, and there's nothing separate from that.",
        "source": "T08n0222_007:0193c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內自觀身調御其意於世無明愁慼之事，亦無所見。",
        "translation": "He personally observes himself, regulates his mind, and sees nothing of the world's ignorance and grief.",
        "source": "T08n0222_007:0193c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩假使見身非常之後，寒熱所遭、日炙風飄，膖腫青脹，鳥獸所噉，臭處不淨。",
        "translation": "Suppose a bodhisattva-mahāsattva sees that his body is impermanent, that it's exposed to cold and heat, that it's scorched by the sun and wind, that it's swollen and blue, that it's eaten by birds and animals, and that it has an impure odor.",
        "source": "T08n0222_007:0193c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還自觀身亦當如是，調御其意於世無明愁慼之事，亦無所得，亦無所見。",
        "translation": "Looking back at himself, he should likewise observe his body and regulate his mind so that he doesn't acquire or see anything that's the result of ignorance and grief in the world.",
        "source": "T08n0222_007:0193c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩假使觀身終亡之後，遭於寒熱、日炙風飄，骨節相連譬如交璅，肉塗血澆、筋纏革裹皮覆。",
        "translation": "Suppose a bodhisattva Mahāsattva observes that after his body dies, it's subject to cold and heat, the sun burns and winds blow, bones are connected like a jigsaw, flesh is coated with blood, and sinews are wrapped in leather and covered with skin.",
        "source": "T08n0222_007:0193c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自觀身調定其意於世無明愁慼之事，亦無所得，亦無所見。",
        "translation": "He observes the body himself, calms his mind, and sees nothing that's the result of ignorance and grief in the world.",
        "source": "T08n0222_007:0193c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0193c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩假使見人終亡之後，但白骨鉤璅相連，有血脈皮肉筋髓，則而察之：『今此軀體其法如是，分散別離，此非常法，無有脫者。』",
        "translation": "Suppose a bodhisattva-mahāsattva sees a person who has perished but has white bones, hooked and connected, with blood, veins, skin, tendons, and marrow, and then examines it, 'Now, this body is like this, scattered and separated, which is not the usual thing; there's no escape from it.'",
        "source": "T08n0222_007:0193c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0194a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩觀身，調定其意於世無明愁慼之事，亦無所得，亦無所見。",
        "translation": "The bodhisattva Mahāsattva observes the body and calms his mind to the things that make the world naive and sad, and he doesn't attain or see them.",
        "source": "T08n0222_007:0194a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩假使見骨髓筋纏碎壞分散還與土合。",
        "translation": "Suppose a bodhisattva sees bones, marrow, sinews, and tethers broken up and scattered, and then they're merged with earth.",
        "source": "T08n0222_007:0194a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀察如是：『今此軀體，其法如是。』",
        "translation": "He observes it like this, 'Now, this body is like this in terms of its qualities.'",
        "source": "T08n0222_007:0194a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內自觀身，調御其意於世無明愁慼之事，亦無所得，亦無所見。",
        "translation": "He observes his own body internally and regulates his thoughts regarding worldly ignorance and grief, and he doesn't attain or see anything.",
        "source": "T08n0222_007:0194a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194a08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使覩見骨散在地，東西南北腳骨異處，膝臏、項頸、胸脇、頭髗各自異處，則而察之：『今此軀體，其法如是，手足分散別離，此非常法，無脫此者。』",
        "translation": "Suppose you see bones scattered on the ground, bones of the feet in the east and west that are separate, and bones of the knees, neck, chest, and back, and head, each in a different place, then you examine them, 'Now, this body is like this, with its hands and feet scattered and separated, which is not the usual thing; there's nothing beyond this.'",
        "source": "T08n0222_007:0194a08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內觀其身，調定其意於世無明愁慼之事，亦無所得，亦無所見。",
        "translation": "He observes his body internally and calms his mind to the fact that he's neither attained nor seen anything that causes ignorance and grief in the world.",
        "source": "T08n0222_007:0194a12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194a13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩便觀身，死來久遠骨散在地，積有年歲，不可稱數難量之載，青骨碎壞與灰土合：『今此軀體其法如是，分散別離，此非常法，無有脫者。』",
        "translation": "The bodhisattva then observes his body as bones scattered on the ground after a long period of death, accumulating years that are incalculable and difficult to fathom, and ashes that are broken up and combined with ashes: 'Now, this body is like this, scattered and separated, which is not the usual thing; there's no escape from it.'",
        "source": "T08n0222_007:0194a13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0194a17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩內自觀身，調定其意於世無明愁慼之事，亦無所得，亦無所見。",
        "translation": "The bodhisattva Mahāsattva observes himself internally, calming his mind to the things of worldly ignorance and sorrow, which he doesn't attain or see.",
        "source": "T08n0222_007:0194a17_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛痒思想觀法，亦復如是。",
        "translation": "This is also true of the contemplation of pain and itchiness.",
        "source": "T08n0222_007:0194a19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以持誘進初發意者為無常觀，稍稍入空乃知無本；以為發意達者，觀內外身亦無有身，觀內外想亦無有想，觀內外法亦無有法，亦無所觀亦無所見，道不離俗、俗不離道，二者俱空，亦無所獲。",
        "translation": "Those who first arouse the mind by upholding the enticement are those who observe impermanence and, after slightly realizing emptiness, come to know that there's no basis; those who achieve the aspiration in order to arouse the mind are those who observe the internal and external bodies as being without body, observe internal and external perceptions as being without perceptions, observe internal and external dharmas as being without dharmas, observe nothing, and see nothing, and the path doesn't part from the conventional and the conventional doesn't part from the path; both are empty, and nothing is obtained.",
        "source": "T08n0222_007:0194a19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194a24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行摩訶衍者，四意斷。",
        "translation": "\"When a bodhisattva-mahāsattva practices Mahāyāna, he stops with four intentions.",
        "source": "T08n0222_007:0194a24_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四意斷？",
        "translation": "What are the four kinds of intentional elimination?",
        "source": "T08n0222_007:0194a25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是菩薩摩訶薩，諸惡未起不善之法，設來興者，制令不生；慇懃精進攝其心本，令斷諸瑕，諸惡不善非法之事，適興尋斷，慇懃精進自攝其心，使平等斷；諸善德本設來興者，假欲斷者，慇懃精進救攝其心，平等解脫；懷善法生，堅住不失，思惟具足，廣普令備益加歡樂，慇懃精進救攝其心，平等解脫。",
        "translation": "Thus, the bodhisattva Mahāsattva supposes unwholesome things that have yet to arise to arise, and he restrains them from arising; he endeavors to gather the fundamentals of his mind and cause them to cease their flaws; he intends to seek to stop unwholesome and unlawful things that are unwholesome and appropriate, and he endeavors to gather his own mind and cause it to cease equally; he supposes the fundamentals of good qualities to arise, firmly abides in them without losing them, contemplates them fully, and generally makes them more joyful, and he endeavors to gather his mind and cause it to liberate equally.",
        "source": "T08n0222_007:0194a25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所見。",
        "translation": "He has something to attain, nothing to attain, and nothing to see.",
        "source": "T08n0222_007:0194b03_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0194b04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍也！",
        "translation": "Pusa mahāsattva mahāyāna!",
        "source": "T08n0222_007:0194b04_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎「復次，須菩提！",
        "translation": "â€œAgain, Subhūti!",
        "source": "T08n0222_007:0194b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行摩訶衍，謂五根：信根、精進根、意根、定根、慧根。",
        "translation": "The bodhisattva-mahāsattva's practice of mahāyāna refers to five faculties: the faculty of faith, the faculty of effort, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom.",
        "source": "T08n0222_007:0194b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩摩訶衍，有所得亦無所得、亦無所獲。",
        "translation": "This is the bodhisattva-mahāsattva-mahāyāna that has something to attain, nothing to attain, and nothing to acquire.",
        "source": "T08n0222_007:0194b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍者，謂五力也。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna refers to the five powers.",
        "source": "T08n0222_007:0194b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂五力？",
        "translation": "What are the five powers?",
        "source": "T08n0222_007:0194b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信力、精進力、意力、定力、慧力。",
        "translation": "\"The powers of faith, effort, mindfulness, concentration, and wisdom.",
        "source": "T08n0222_007:0194b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩摩訶衍五力也。",
        "translation": "These are the five powers of the bodhisattva-mahāsattva-mahāyāna.",
        "source": "T08n0222_007:0194b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲也。",
        "translation": "They are attained, unattained, and unobtained.",
        "source": "T08n0222_007:0194b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍，謂七覺意。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna refers to the seven awakening intentions.",
        "source": "T08n0222_007:0194b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂七覺意？",
        "translation": "What are the seven awakening intentions?",
        "source": "T08n0222_007:0194b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0194b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩專修思覺意，依於寂然，無有貪欲，亦無所依，除於諍訟、捨諸法，是謂思覺意。",
        "translation": "The bodhisattva-mahāsattva focuses on the awakening intention of contemplation, which is based on tranquility, has no desire, and no support, and which removes arguments and disregards phenomena.",
        "source": "T08n0222_007:0194b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有行精進覺意，依於寂然，無有貪欲，亦無所依，除諍訟、捨諸法，是謂精進覺意。",
        "translation": "This is called the awakening intention of effort, which is based on quiescence, lacks desire, and has no support, and which removes arguments and disregards dharmas.",
        "source": "T08n0222_007:0194b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又行悅豫覺意、行信覺意、行安覺意、定覺意、行觀覺意，依於寂然，無有貪欲，亦無所依，除諍訟、捨諸法，是謂菩薩摩訶薩摩訶衍行七覺也。",
        "translation": "Also, the awakening mind of practicing gladness, the awakening mind of practicing faith, the awakening mind of practicing peace, the awakening mind of concentration, and the awakening mind of practicing contemplation are based on quiescence, lack of desire, and lack of support, and the removal of disputes and the abandonment of dharmas, which are called the seven awakenings of the bodhisattva-mahāsattva-mahāyāna practice.",
        "source": "T08n0222_007:0194b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲。",
        "translation": "There's something to be attained, nothing to be attained, and nothing to be attained.",
        "source": "T08n0222_007:0194b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍，謂八由行賢聖之路。",
        "translation": "\"The bodhisattva-mahāsattva-mahāyāna are eight ways to practice goodness and holiness.",
        "source": "T08n0222_007:0194b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂八？",
        "translation": "What are the eight?",
        "source": "T08n0222_007:0194b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正見、正念、正語、正治、正業、正方便、正意、正定，是為八由行賢聖之法。",
        "translation": "Right view, right mindfulness, right speech, right discipline, right action, right method, right intention, and right concentration are the eight ways to practice the noble principles.",
        "source": "T08n0222_007:0194b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲，是為菩薩摩訶薩摩訶衍也。",
        "translation": "To have something to attain, nothing to attain, and nothing to obtain is considered bodhisattva-mahāsattva-mahāyāna.",
        "source": "T08n0222_007:0194b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍者，謂三品三昧。",
        "translation": "\"A bodhisattva-mahāsattva-mahāyāna is a samādhi of three kinds.",
        "source": "T08n0222_007:0194b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為三？",
        "translation": "What are the three?",
        "source": "T08n0222_007:0194b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空三昧，無相、無願三昧。",
        "translation": "\"Emptiness samādhi is markless, wishless samādhi.",
        "source": "T08n0222_007:0194b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂空三昧？",
        "translation": "What does it mean by the samādhi of emptiness?",
        "source": "T08n0222_007:0194b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已相法空，空者脫門，則為無相，其無相者便為脫門，其所行者無所行也，是為無願脫門也。",
        "translation": "Once the marks are empty, the gate of liberation is emptiness, which is markless, and the markless one is the gate of liberation, and the one who practices has nothing to practice, which is the gate of liberation through wishlessness.",
        "source": "T08n0222_007:0194b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0194b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍也。",
        "translation": "\"So is the bodhisattva Mahāsattva Mahāyāna.",
        "source": "T08n0222_007:0194b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逮得此已，亦無所得、亦無所獲。",
        "translation": "After attaining this, there's nothing to be gained and nothing to be attained.",
        "source": "T08n0222_007:0194c01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍，當分別若曉了所習、決斷滅盡、覺知由路、知所盡者、知無所起。",
        "translation": "\"Bodhisattvas, Mahāsattvas, and Mahāyāna should discern what's accumulated, what's definitely ended and extinguished, the path of awakening, what's ended, and what's not arisen.",
        "source": "T08n0222_007:0194c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了諸法，分別無我。",
        "translation": "They know the dharmas and discern that they lack self.",
        "source": "T08n0222_007:0194c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了柔和終沒之事，自知其心、了他人心，是謂為慧。",
        "translation": "This is called wisdom that understands things that are gentle and end up disappearing, and that knows one's own mind and discerns the minds of others.",
        "source": "T08n0222_007:0194c04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂分別？",
        "translation": "What does this mean by discernment?",
        "source": "T08n0222_007:0194c05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於苦知苦、無所從生、亦無所起，是謂分別苦。",
        "translation": "To know suffering as suffering, know that it arises from nothing, and know that it arises from nothing is called discriminating suffering.",
        "source": "T08n0222_007:0194c06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為曉了所習？",
        "translation": "What's meant by understanding what's being cultivated?",
        "source": "T08n0222_007:0194c07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂蠲除所習令不復生。",
        "translation": "It's removing what's been accumulated so that it won't arise again.",
        "source": "T08n0222_007:0194c07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為決斷滅盡？",
        "translation": "What is definitive cessation and extinction?",
        "source": "T08n0222_007:0194c08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂苦已盡，令無根本。",
        "translation": "It means that suffering has ended, so that there's no root.",
        "source": "T08n0222_007:0194c08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等覺知由路？",
        "translation": "What is the path of awakening and knowing?",
        "source": "T08n0222_007:0194c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂賢聖之法八由路也。",
        "translation": "It's the eightfold path of the noble teaching.",
        "source": "T08n0222_007:0194c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂知所盡者？",
        "translation": "What's meant by knowing what's exhausted?",
        "source": "T08n0222_007:0194c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂婬、怒、癡滅。",
        "translation": "It's the cessation of lust, anger, and delusion.",
        "source": "T08n0222_007:0194c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂知無所起？",
        "translation": "What does it mean to know that nothing arises?",
        "source": "T08n0222_007:0194c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無所從生不起之慧。",
        "translation": "It's the wisdom that arises and doesn't arise from nowhere.",
        "source": "T08n0222_007:0194c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂曉了法慧？",
        "translation": "What's the wisdom of comprehending the teaching?",
        "source": "T08n0222_007:0194c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於五陰所造罪福，斷絕為慧。",
        "translation": "It's the wisdom of cutting off the sins and merits created by the five aggregates.",
        "source": "T08n0222_007:0194c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂分別無我？",
        "translation": "What's meant by discriminating selflessness?",
        "source": "T08n0222_007:0194c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色非常，痛痒思想生死識非常。",
        "translation": "That is, form is impermanent, and the consciousnesses of pain and itch, thought of birth and death are impermanent.",
        "source": "T08n0222_007:0194c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼耳鼻舌身心，非我所有；色聲香味細滑法，非我所有；眼色識、耳聲識、鼻香識、舌味識、身細滑識、意法識，亦非我所有；何謂曉了柔和終沒之事？",
        "translation": "The eyes, ears, nose, tongue, and body don't belong to me, and the fine and smooth qualities of form, sound, odor, and taste don't belong to me; the consciousnesses of form in the eyes, sound in the ears, odor in the nose, taste in the tongue, fine and smooth qualities in the body, and qualities in the mind don't belong to me either; what's the meaning of knowing and understanding something that's gentle and ultimately disappears?",
        "source": "T08n0222_007:0194c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所咨嗟多所發起。",
        "translation": "\"There's something to be contested and much to be aroused.",
        "source": "T08n0222_007:0194c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂自知其心？",
        "translation": "What's the meaning of knowing one's own mind?",
        "source": "T08n0222_007:0194c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自知古來根原。",
        "translation": "He knows the origin of ancient times.",
        "source": "T08n0222_007:0194c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂知人心？",
        "translation": "What does it mean to know the hearts of people?",
        "source": "T08n0222_007:0194c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能別他人眾生心之所念。",
        "translation": "It's the mind that discerns what's in the minds of other sentient beings.",
        "source": "T08n0222_007:0194c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂如所慧心？",
        "translation": "What does that mean, 'such a mind of wisdom'?",
        "source": "T08n0222_007:0194c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂怛薩阿竭薩芸若慧，是謂如所慧心。",
        "translation": "This is called the wisdom of the tathāgatas and the wisdom of the thusness of the mind.",
        "source": "T08n0222_007:0194c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已得，是以亦無所得，亦無所獲。",
        "translation": "Having attained it, there's nothing to be gained and nothing to be attained as a result.",
        "source": "T08n0222_007:0194c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍謂有三根！",
        "translation": "The bodhisattva Mahāsattva Mahāyāna is said to have three faculties!",
        "source": "T08n0222_007:0194c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異人根、異根、別根。",
        "translation": "It's a different person's faculty, a different faculty, and a separate faculty.",
        "source": "T08n0222_007:0194c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂異人根？",
        "translation": "What does that mean by different person's faculties?",
        "source": "T08n0222_007:0194c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有諸學士未得平等信根、精進根、意根、定根、慧根。",
        "translation": "It means there are buddhas who haven't yet attained the faculties of equal faith, effort, mindfulness, concentration, and wisdom.",
        "source": "T08n0222_007:0194c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂異根？",
        "translation": "What are the different faculties?",
        "source": "T08n0222_007:0194c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其學士者無有異信、信根、精進根、意根、定根、慧根，是謂異根。",
        "translation": "Their first degree has no different faculties of faith, faithfulness, effort, mindfulness, concentration, or wisdom, which are called different faculties.",
        "source": "T08n0222_007:0194c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂別根？",
        "translation": "What do they mean by different faculties?",
        "source": "T08n0222_007:0194c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂未學士而發大意——辟支佛、菩薩、怛薩阿竭、阿羅訶、三耶三佛——信根、精進根、意根、定根、慧根！",
        "translation": "It means to give rise to the great intention before one's bachelor's degree - the pratyekabuddha, the bodhisattva, the tathāgata, the arhat, the three samyak-saṃbuddhas - the faculty of faith, the faculty of effort, the faculty of intention, the faculty of concentration, and the faculty of wisdom!",
        "source": "T08n0222_007:0194c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩別根摩訶衍也。",
        "translation": "This is called the bodhisattva-mahāsattva's distinctive faculties mahāyāna.",
        "source": "T08n0222_007:0194c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得者亦無所得、亦無所獲也。",
        "translation": "Whatever is attained, it's also unattained and unobtainable.",
        "source": "T08n0222_007:0194c29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0194c29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍者，謂平等定也。",
        "translation": "\"Bodhisattva-mahāsattva-mahāyāna is also called equal concentration.",
        "source": "T08n0222_007:0195a01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三事：有想有行三昧、無想有行三昧、無想無行三昧。",
        "translation": "There are three things: samādhi with perception and volition, samādhi without perception and volition, and samādhi without perception and volition.",
        "source": "T08n0222_007:0195a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂有想有行三昧？",
        "translation": "What does that mean, the samādhi of ideation with practice?",
        "source": "T08n0222_007:0195a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脫諸欲，寂除諸惡不善之法，有想有行，行第一寂，是謂有想有行三昧。",
        "translation": "Being free of desire and tranquilizing bad and unskillful things, having perception and volition, and volition being the first to become tranquil, is called the samādhi of perception and volition.",
        "source": "T08n0222_007:0195a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂無想有行三昧？",
        "translation": "What does it mean by the samādhi of absence of perceptions and formations?",
        "source": "T08n0222_007:0195a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂其心之內無想有行，亦無所著至第二寂，亦無內外，是謂無想有行三昧。",
        "translation": "This is called the samādhi of no ideation, no formations, and no attachment to the second quiescence in his mind, and there's no internal or external, which is called the samādhi of no ideation, no formations, and no formations.",
        "source": "T08n0222_007:0195a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂無想無行三昧？",
        "translation": "What does it mean by the samādhi of no ideation and no formations?",
        "source": "T08n0222_007:0195a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過第二、第三寂，度於無量有慧之定，越於無量識慧之宜，過於無量不用慧定，越於無量有想無想之定，是謂無想無行。",
        "translation": "After the second and third quiescence, he crosses over to measureless concentrations of wisdom, transcends measureless concentrations of consciousness and wisdom, crosses over to measureless concentrations of no wisdom, and transcends measureless concentrations of perception and no perception, which is called the absence of perception and the absence of practice.",
        "source": "T08n0222_007:0195a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂須菩提菩薩摩訶薩摩訶衍也。",
        "translation": "This is called the bodhisattva *Mahāsattva* Mahāyāna, Subhūti.",
        "source": "T08n0222_007:0195a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0195a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍者，當行十念。",
        "translation": "\"A bodhisattva-mahāsattva-mahāyāna should practice ten kinds of mindfulness.",
        "source": "T08n0222_007:0195a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂十念？",
        "translation": "What are the ten kinds of mindfulness?",
        "source": "T08n0222_007:0195a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛、念法、念聖眾、念戒、念布施、念天、念恬怕、念無所起、念觀身、念當終亡，是為十念。",
        "translation": "Mindfulness of the Buddha, mindfulness of the Dharma, mindfulness of the noble people, mindfulness of the precepts, mindfulness of generosity, mindfulness of the gods, mindfulness of calm, mindfulness of nothing arising, mindfulness of contemplating the body, and mindfulness of what will happen when it dies are the ten kinds of mindfulness.",
        "source": "T08n0222_007:0195a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩摩訶衍。",
        "translation": "These are the bodhisattva-mahāsattva-mahāyāna.",
        "source": "T08n0222_007:0195a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲。",
        "translation": "There's something to be attained, nothing to be attained, and nothing to be attained.",
        "source": "T08n0222_007:0195a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0195a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍，謂四禪、四無色定、四等心、八脫門、未曾所獲味之定，是謂須菩提菩薩摩訶薩摩訶衍也。",
        "translation": "The bodhisattva Mahāsattva Mahāyāna refers to the four meditations, the four formless concentrations, the four equipoises, the eight liberations, and the concentration of taste that has never been attained before, which is called the bodhisattva Mahāsattva Mahāyāna of Subhūti.",
        "source": "T08n0222_007:0195a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得者亦無所得、亦無所獲。",
        "translation": "Whatever is attained, it's also unattained and unobtainable.",
        "source": "T08n0222_007:0195a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0195a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍，謂怛薩阿竭十種力也。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna is known as the tathāgata, which has ten kinds of power.",
        "source": "T08n0222_007:0195a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂十種力？",
        "translation": "What are the ten kinds of strength?",
        "source": "T08n0222_007:0195a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂知他人、眾生之類處處非處，處有限無限。",
        "translation": "It's knowing where other people and types of sentient beings are and aren't, and where they're limited and unlimited.",
        "source": "T08n0222_007:0195a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知過去、當來、今現在因緣罪福所行之處有所報應。",
        "translation": "He thus perceives the rewards of past, future, and present causes and conditions for actions that are crimes and merits.",
        "source": "T08n0222_007:0195a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知，世間之人有若干種，其體不同。",
        "translation": "He perceives that there are various kinds of people in the world, and their bodies are different.",
        "source": "T08n0222_007:0195a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知，他人眾生若干種心，所憙各異。",
        "translation": "He thus perceives that there are various kinds of minds in which other sentient beings rejoice, and they are different.",
        "source": "T08n0222_007:0195a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知，他人眾生根原所趣，本末各異。",
        "translation": "As he examines and knows, the faculties and origins of other sentient beings are different in origin and destination.",
        "source": "T08n0222_007:0195a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知，一切五道終始所歸。",
        "translation": "As he examines and knows it, he knows the final destination of all five paths.",
        "source": "T08n0222_007:0195a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知，知於眾人行者之心，根、力、覺意、一心、脫門、三昧正受，結縛、瞋恨、鬪訟之事，能慧分別。",
        "translation": "As he examines and fully knows, he's able to discern with insight the minds of human practitioners, their faculties, powers, awarenesses, single-mindedness, liberation approaches, samādhi proper feelings, and the things that bind, hate, and fight.",
        "source": "T08n0222_007:0195a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知，無數寂然。",
        "translation": "He perceives them all as they are, and they are countless and quiescent.",
        "source": "T08n0222_007:0195a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉識過去無數億劫之事。",
        "translation": "He fully recognizes the events of countless millions of eons in the past.",
        "source": "T08n0222_007:0195a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識過去無數億劫之所。",
        "translation": "He knows the places of countless millions of eons in the past.",
        "source": "T08n0222_007:0195b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊居眾生察其終沒之所歸趣。",
        "translation": "He wanders among sentient beings and discerns where they've ended up.",
        "source": "T08n0222_007:0195b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道眼徹視於十方一切佛界。",
        "translation": "The eye of the Way thoroughly examines all the buddha-realms in the ten directions.",
        "source": "T08n0222_007:0195b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五道生死、善惡、禍福、起滅終始。",
        "translation": "It sees the five destinies of birth and death, good and evil, woe and fortune, and the beginning and end of arising and ceasing.",
        "source": "T08n0222_007:0195b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如審悉知，諸漏已盡，無有塵垢，度於想念，以知慧脫現在造行，自以神通證知諸行，生死已斷，稱舉梵行，所作已辦知未度者。",
        "translation": "As he fully perceives them, he has ended the contaminants, is spotless, frees himself from longing, knows that wisdom liberates presently created actions, personally discerns the actions with his own supernormal powers, has ended birth-and-death, praises the religious practice, and knows those he hasn't yet liberated after accomplishing what he's done.",
        "source": "T08n0222_007:0195b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0195b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna.",
        "source": "T08n0222_007:0195b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲。",
        "translation": "There's something to be attained, nothing to be attained, and nothing to be attained.",
        "source": "T08n0222_007:0195b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0195b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍，謂四無所畏。",
        "translation": "The bodhisattva Mahāsattva Mahāyāna is described as having four forms of fearlessness.",
        "source": "T08n0222_007:0195b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂四無所畏？",
        "translation": "What are the four forms of fearlessness?",
        "source": "T08n0222_007:0195b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今吾已逮成平等覺，若有沙門、梵志、諸天、人民，若復異天、異覺之人，來欲訟理求佛之短，謂為不成平等之覺，不見瑞應，敢有發意當如來者！",
        "translation": "Now that I have achieved perfect enlightenment, if ascetics, priests, gods, or people of another god or another enlightened person come seeking the shortcomings of the Buddha by defining the principle, thinking that they haven't achieved perfect enlightenment and haven't seen the auspicious response, how dare they have the intention to become the Tathāgata!",
        "source": "T08n0222_007:0195b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無敢發念，故佛安隱所行，無難亦無畏。",
        "translation": "Not daring to give rise to thoughts, the Buddha's peaceful actions are neither difficult nor intimidating.",
        "source": "T08n0222_007:0195b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勇猛行達無所著，而為他人師子之吼，講說分別清淨法輪，沙門、梵志、諸天宮魔及諸梵天，天上、世間無有能及道法之誼，諸漏已盡，無有終始。",
        "translation": "When he boldly practices without attachment and becomes the lion's roar for others, he teaches the pure Dharma wheel of discrimination, and there are no ascetics, priests, gods, palaces, Māra, or Brahmā gods in heaven or in the world who can match the friendship of the Way and Dharma, whose contaminants have ended and who have no beginning or end.",
        "source": "T08n0222_007:0195b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門、梵志、諸天魔梵、天上、世間，欲求佛短，謂不然者，諸漏未盡。",
        "translation": "Ascetics, priests, gods, Māra, Brahmā, gods, and the world want to pursue the shortage of buddhas, but they say that if they don't, the contaminants haven't ended.",
        "source": "T08n0222_007:0195b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "都了不見發心求短者，故佛安隱無有恐懼，則為眾人而師子吼。",
        "translation": "Not seeing anyone who arouse the intention to seek shortcomings, the Buddha is at ease and has no fear, and then he gives a lion's roar for all of them.",
        "source": "T08n0222_007:0195b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉知內法，無有內外，不見吾我。",
        "translation": "He fully knows the internal teaching that there's no inside or outside, and he doesn't see himself.",
        "source": "T08n0222_007:0195b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門、梵志、諸天魔梵、天上、世間，欲求佛短，謂不然者，不知內法計有吾我。",
        "translation": "Ascetics, priests, gods, Māra, Brahmā, gods, and the world want to seek the shortcomings of the Buddha, but they say otherwise, they don't know that internal things are imagined to have a self.",
        "source": "T08n0222_007:0195b21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "都了不見發心求短者，故佛安隱無有恐懼，則為眾人而師子吼。",
        "translation": "They don't see anyone who arouse the intention to seek shortcomings, so the Buddha is peaceful and fearless, and then he's the lion's roar for everyone.",
        "source": "T08n0222_007:0195b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "講說賢聖，不解者解、不達者達、無乘者乘，而以平等普除苦惱，終不能求得佛短也。",
        "translation": "He teaches the noble ones, those who don't understand, those who don't reach, and those who don't have the vehicle, and he uses equality to remove suffering and distress universally, but ultimately he can't seek to attain the shortcomings of the Buddha.",
        "source": "T08n0222_007:0195b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以奉法故，不違道誼，勇猛、無恐、無懼，而為他人講說清淨法輪，為師子吼。",
        "translation": "Because he serves the teaching, he doesn't disregard the fellowship of the path, and he has the courage, fearlessness, and fearlessness to preach the pure dharma-wheel for others, which is called the lion's roar.",
        "source": "T08n0222_007:0195b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0195b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍也。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna.",
        "source": "T08n0222_007:0195b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲。",
        "translation": "There's something to be attained, nothing to be attained, and nothing to be attained.",
        "source": "T08n0222_007:0195b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0195b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍，謂四分別辯。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna refers to four kinds of discernment.",
        "source": "T08n0222_007:0195b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are the four?",
        "source": "T08n0222_007:0195c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一曰分別誼、二曰分別法、三曰所歸順分別、四曰分別辯。",
        "translation": "One is discriminating meaning, two is discriminating qualities, three is discerning what's to be followed, and four is discerning eloquence.",
        "source": "T08n0222_007:0195c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂，須菩提！",
        "translation": "This is called, Subhūti!",
        "source": "T08n0222_007:0195c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna.",
        "source": "T08n0222_007:0195c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲。",
        "translation": "There's something to be attained, nothing to be attained, and nothing to be attained.",
        "source": "T08n0222_007:0195c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0195c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍者，謂十八不共諸佛之法。",
        "translation": "\"The bodhisattva-mahāsattva-mahāyāna refers to the 18 distinctive characteristics of the buddhas.",
        "source": "T08n0222_007:0195c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂十八？",
        "translation": "What are the 18?",
        "source": "T08n0222_007:0195c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者如來無有瑕短。",
        "translation": "\"One, the Tathāgata has no blemishes or deficiencies.",
        "source": "T08n0222_007:0195c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說應時，無有短乏心、無忘失、無有若干想、無有不定心、無有不辯。",
        "translation": "When it's explained, there's no lack of thought, no forgetfulness, no certain conceptions, no uncertain thought, and no lack of discernment.",
        "source": "T08n0222_007:0195c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別所觀無有所樂。",
        "translation": "There's nothing to observe with discernment that's pleasing to him.",
        "source": "T08n0222_007:0195c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷精進無失，終無失意。",
        "translation": "There's no loss of effort when he stops making effort, and there's no loss of intention when he ends up there.",
        "source": "T08n0222_007:0195c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧無損解脫不闕。",
        "translation": "Wisdom is not impaired, and liberation is not lacking.",
        "source": "T08n0222_007:0195c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "度知見不減。",
        "translation": "Their knowledge and vision of liberty aren't diminished.",
        "source": "T08n0222_007:0195c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸身之事無所不達。",
        "translation": "There's nothing about the whole body that isn't comprehended.",
        "source": "T08n0222_007:0195c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切口所言說無所不通，各令得所。",
        "translation": "Nothing that's spoken by the mouth is unobstructed, and each makes it attain its place.",
        "source": "T08n0222_007:0195c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切心所念，以智慧心悉知其原。",
        "translation": "With a mind of wisdom, he fully knows the origin of every thought in his mind.",
        "source": "T08n0222_007:0195c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知過去不可計會無央數劫事，智慧悉見。",
        "translation": "He also knows the events of incalculably long eons in the past, and he sees them all with wisdom.",
        "source": "T08n0222_007:0195c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知當來不可計會無央數劫事，智慧悉見。",
        "translation": "He also knows the events of an incalculably long eon in the future and sees them fully with wisdom.",
        "source": "T08n0222_007:0195c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知現在不可計會無央數劫事，智慧悉見。",
        "translation": "He also knows and fully sees with wisdom the events of the present incalculable and incalculably long eon.",
        "source": "T08n0222_007:0195c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0195c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍。",
        "translation": "\"The bodhisattva Mahāsattva Mahāyāna.",
        "source": "T08n0222_007:0195c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所得亦無所得、亦無所獲。",
        "translation": "There's something to be attained, nothing to be attained, and nothing to be attained.",
        "source": "T08n0222_007:0195c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0195c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩摩訶衍者，謂總持門。",
        "translation": "\"A bodhisattva-mahāsattva-mahāyāna is someone who takes the Dhāraṇī approach.",
        "source": "T08n0222_007:0195c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂總持門？",
        "translation": "What does it mean by the approach of maintaining everything?",
        "source": "T08n0222_007:0195c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸文字等，所說平等，文字之門、文字所入。",
        "translation": "\"All words and so forth are explained to be equal, which are the gate of words and the entry of words.",
        "source": "T08n0222_007:0195c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂文字門、文字所入因緣之門？",
        "translation": "What's the gate of words and the gate of causes and conditions into which words enter?",
        "source": "T08n0222_007:0195c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法，以過去者亦無所起。",
        "translation": "\"All dharmas that exist in the past also have nothing to give rise to.",
        "source": "T08n0222_007:0195c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其門所作是羅之門，法離諸垢是波之門，分別諸誼是遮之門。",
        "translation": "Their gate of doing is the gate of lah, the gate of rushing when the dharmas are freed from defilement, and the gate of discerning the meanings is the gate of cessation.",
        "source": "T08n0222_007:0195c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逮得一切諸法之行，亦無所得，亦無所沒者、亦無所生者，是那之門。",
        "translation": "The gate of apprehending the condition of all dharmas, which is nothing to be attained, nothing to be lost, and nothing to be produced is the gate of that.",
        "source": "T08n0222_007:0195c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法離諸號字，計其本淨而不可得，是羅之門。",
        "translation": "The gate of ascertaining all dharmas that are free of words and letters and whose original purity is considered unobtainable is the gate of lākṣa.",
        "source": "T08n0222_007:0195c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆悉超度一切世法——恩愛、報應、因緣——是陀之門。",
        "translation": "To completely transcend all worldly dharmas - craving, retribution, and causes and conditions - is the gate of the dhāraṇī.",
        "source": "T08n0222_007:0195c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法悉為本無，有、無斷絕，是為波之門。",
        "translation": "All dharmas are originally nonexistent, and their existence and nonexistence are severed, which is the gate of the wave.",
        "source": "T08n0222_007:0195c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆悉解結諸法所縛，是咤之門。",
        "translation": "They are all unbound by the bonds of all dharmas, which is the gate of tha.",
        "source": "T08n0222_007:0195c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燒盡諸法逮至清淨，是沙之門。",
        "translation": "To burn up all dharmas and obtain their purity is the gateway of sand.",
        "source": "T08n0222_007:0195c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法，無有罣礙不得諸事，是惒之門。",
        "translation": "Being unobstructed by all dharmas and not being able to obtain anything is the gate of the musician.",
        "source": "T08n0222_007:0195c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷除一切諸法音聲句跡所趣，是多之門。",
        "translation": "To eliminate the paths of all the sounds, phrases, and traces of all dharmas is the gate of many.",
        "source": "T08n0222_007:0195c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法而無有本不可動搖，是計之門。",
        "translation": "To have no basis for all dharmas that's unshakeable is the gate of calculation.",
        "source": "T08n0222_007:0196a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法而無所起，是吒之門。",
        "translation": "To have nothing to give rise to in all dharmas is the gate of contemplation.",
        "source": "T08n0222_007:0196a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法得至究竟，是阿之門。",
        "translation": "The attainment of the ultimate in all things is the gate of a.",
        "source": "T08n0222_007:0196a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法所當作為皆悉逮得，是娑之門。",
        "translation": "All things that are supposed to be done are completely obtained, which is the gate of śa.",
        "source": "T08n0222_007:0196a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法皆已時得，通不悉節，是摩之門。",
        "translation": "The gate of mo, which is the attainment of all things in time, both shared and unshared.",
        "source": "T08n0222_007:0196a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解知諸法從吾我起，是迦之門。",
        "translation": "Understanding that all dharmas arise from self is the gate of kha.",
        "source": "T08n0222_007:0196a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法逮得擁護，是癉之門。",
        "translation": "Acquiring the protection of all dharmas is the gate of the śramaṇa.",
        "source": "T08n0222_007:0196a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法逮得諸法之處，是闍之門。",
        "translation": "Where all dharmas have been apprehended is the gate of the jhāna.",
        "source": "T08n0222_007:0196a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法而無所起，是波之門。",
        "translation": "The gate of waves is the gate of nothing that arises from all dharmas.",
        "source": "T08n0222_007:0196a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法而無所起，是陀呵之門。",
        "translation": "The gate of dharmas in which all things arise but nothing arises is the gate of dharmas.",
        "source": "T08n0222_007:0196a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法諸種無所起會，是奢之門。",
        "translation": "The combination of all the various things that arise and nothing that arises is the gate of śaṅgha.",
        "source": "T08n0222_007:0196a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法寂然不起，是呿之門。",
        "translation": "Being still and nonarising in regard to all dharmas is the gate of yawning.",
        "source": "T08n0222_007:0196a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法猶如虛空而無所生，是叉之門。",
        "translation": "All dharmas are like space and nothing arises, which is the gate of forking.",
        "source": "T08n0222_007:0196a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法皆悉滅盡而不可得，是尸癉之門。",
        "translation": "All things that are existent are completely extinguished and cannot be obtained, which is the gate of śrāvaka.",
        "source": "T08n0222_007:0196a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法堅住於處而不可動，亦不可得，是[怡-台+若]之門。",
        "translation": "All things that are firmly present and immovable cannot be moved, nor can they be obtained, which is the gate of [yi-tai+jñāna].",
        "source": "T08n0222_007:0196a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法慧不可得，是咤呵之門。",
        "translation": "The insight of all things is unobtainable, which is the gate of thahā.",
        "source": "T08n0222_007:0196a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法逮得所持，是披何之門。",
        "translation": "The acquisition and maintenance of all dharmas is the gate of piṭaka.",
        "source": "T08n0222_007:0196a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法已得閑靜，是車之門。",
        "translation": "Having attained calmness in all dharmas is the gate of the chariot.",
        "source": "T08n0222_007:0196a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法皆已焚燒，是那之門。",
        "translation": "All things that are burned up is the gate of nada.",
        "source": "T08n0222_007:0196a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法而無所作，是沙波之門。",
        "translation": "The absence of effort in all things is the gate of sabhā.",
        "source": "T08n0222_007:0196a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法而得至信，是嗟之門。",
        "translation": "Attaining the utmost faith in all things is the gate of contempt.",
        "source": "T08n0222_007:0196a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法皆得盡滅，是迦何之門。",
        "translation": "To attain the cessation of all dharmas is the gate of Kāśyapa.",
        "source": "T08n0222_007:0196a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法得輪數所在，是咤徐之門。",
        "translation": "Attaining the location of the number of turns for all dharmas is the gate of tzarjuna.",
        "source": "T08n0222_007:0196a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法有所住處得無所住，是那之門。",
        "translation": "Attaining no abiding place for all dharmas is the gate of Nāgârjuna.",
        "source": "T08n0222_007:0196a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法，不來不去不立不坐不臥不寐，無應不應、無想不想，是頗之門。",
        "translation": "The gate of all things that don't come or go, don't stand or sit or lay down or sleep, and have nothing to be desired or thought about or not desired is the gate of nonreturning.",
        "source": "T08n0222_007:0196a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法不可所奏，是尸迦之門。",
        "translation": "All things that are not to be played with are the gate of Śīkya.",
        "source": "T08n0222_007:0196a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法不得五陰，是磋之門。",
        "translation": "Not allowing the five aggregates to exist for all dharmas is the gate of polarization.",
        "source": "T08n0222_007:0196a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法不得他念，是伊陀之門。",
        "translation": "Not to be mindful of others in regard to all things is the gate of ita.",
        "source": "T08n0222_007:0196a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨一切法而無所得，伊陀之門。",
        "translation": "It's the gate of ita to abandon all things and not attain them.",
        "source": "T08n0222_007:0196a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法不得所在，是吒之門。",
        "translation": "The gate of not allowing all dharmas to be located is the gate of ṭa.",
        "source": "T08n0222_007:0196a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法，究竟邊際盡其處所，無生無死、無有無作，拔去文字音聲之說。",
        "translation": "All things that are the ultimate limit exhaust their location, have no birth and death, have nothing to do, and are unconstructed, and they are uprooted from the teaching of words and sounds.",
        "source": "T08n0222_007:0196a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_007:0196a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "厭諸罣礙，無彼無名、無處所言，亦不可得、亦不可說、亦不可盡、亦不可見。",
        "translation": "Tiring of obstructions, there's nothing that's nameless, nothing that's spoken of anywhere, and which is unobtainable, inexplicable, inexhaustible, and invisible.",
        "source": "T08n0222_007:0196a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如，須菩提！",
        "translation": "Like this, Subhūti!",
        "source": "T08n0222_007:0196b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空虛無，一切諸法亦悉如是。",
        "translation": "Space is empty and nonexistent, and all dharmas are likewise.",
        "source": "T08n0222_007:0196b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為，須菩提！",
        "translation": "Thus, Subhūti!",
        "source": "T08n0222_007:0196b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總持所入因緣，文字分別所入。",
        "translation": "\"It's a general overview of the causes and conditions for entry and a textual discernment of what's entered.",
        "source": "T08n0222_007:0196b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有菩薩摩訶薩知是一切因緣，文字方便分別，則不復著音聲言說，則能次第曉了諸法之所歸趣也。」",
        "translation": "If a bodhisattva knows these causes and conditions and discerns them with the skill of words, then he or she won't be attached to sounds and words anymore and will be able to sequentially understand the destinies of all dharmas.\"",
        "source": "T08n0222_007:0196b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶般若波羅蜜十住品第十八",
        "translation": "Chapter 18 of the Ten Abodes of Mahāprajñāpāramitā",
        "source": "T08n0222_007:0196b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須菩提：「如汝所言：『何謂菩薩摩訶薩為摩訶衍三拔致？』",
        "translation": "The Buddha told Subhūti, \"As you said, 'What does it mean for a bodhisattva, a mahāyāna, to be a samāpatti?'",
        "source": "T08n0222_007:0196b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, shall bodhi!",
        "source": "T08n0222_007:0196b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行六波羅蜜入於道地。",
        "translation": "The bodhisattva Mahāsattva practices the six perfections and enters the stage of the path.",
        "source": "T08n0222_007:0196b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩入於道地？",
        "translation": "How does a bodhisattva enter the stage of the path?",
        "source": "T08n0222_007:0196b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入一切諸法，無來亦無所去，無去亦無所壞。",
        "translation": "\"They enter all dharmas, have nothing that comes, nothing that goes, and nothing that goes and nothing that is destroyed.",
        "source": "T08n0222_007:0196b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法不可知處、亦無想念，行十道地不見道地。",
        "translation": "Where all dharmas are unknowable and without perception, he practices the ten stages of the path and doesn't see the stage of the path.",
        "source": "T08n0222_007:0196b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩行十道地者？",
        "translation": "What's meant by a bodhisattva who practices in the ten stages of the path?",
        "source": "T08n0222_007:0196b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩行第一住者，當行十事。",
        "translation": "\"This is the first abode of a bodhisattva-mahāsattva who practices the ten things he should do.",
        "source": "T08n0222_007:0196b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T08n0222_007:0196b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修治志性不為顛倒；修治愍哀除去眾想；等心眾生不得眾生；行布施事受者無異；敬善知識無有輕慢；求法為業而無所得；慇懃出學無所貪慕；求於佛身不想相好；開闡法事悉於眾生無所希望；棄除貢高則於諸法而無所著；口之所言至誠為業。",
        "translation": "He cultivates a mindfulness that's not mistaken, cultivates kindness and pity that removes the conceptions of many, equates his mind with sentient beings and doesn't allow them to be sentient beings, performs acts of generosity that are accepted without distinction, honors good teachers without disdain, seeks the teaching as an action without gain, endeavors to train without craving, seeks the Buddha's body without wishing for its appearance, expounds the teaching as an action, fully expects nothing from sentient beings, abandons pride and has no attachment to the teachings, and conducts his business with sincerity in what he says.",
        "source": "T08n0222_007:0196b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十事。",
        "translation": "These are the ten things.",
        "source": "T08n0222_007:0196b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0222_007:0196b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第一道地也。",
        "translation": "\"The bodhisattva Mahāsattva also practices in the first ground of the path.",
        "source": "T08n0222_007:0196b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0196b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第二住者，當行八法。",
        "translation": "\"When a bodhisattva-mahāsattva practices the second abode, he should practice eight things.",
        "source": "T08n0222_007:0196b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為八？",
        "translation": "What are the eight?",
        "source": "T08n0222_007:0196b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其戒清淨而有反復；能知報恩；住於忍力；常行歡喜；不捨眾生勤於大哀；受尊長教；其出家者視如世尊；行波羅蜜慕求善權。",
        "translation": "Their precepts are pure and reversible, they know how to repay kindness, abide in forbearance, always conduct themselves joyfully, don't abandon sentient beings, diligently exercise great compassion, accept the teaching of venerable elders, regard their renunciant as the Bhagavān, and practice paramitas and seek good authority.",
        "source": "T08n0222_007:0196b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為八事。",
        "translation": "These are the eight things.",
        "source": "T08n0222_007:0196b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0196b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第三住者，行五法。",
        "translation": "\"When a bodhisattva-mahāsattva practices the third abode, he practices five things.",
        "source": "T08n0222_007:0196b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為五？",
        "translation": "What are the five?",
        "source": "T08n0222_007:0196b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "博問無厭不著文字；開化法施無衣食想；淨於佛土；勸眾德本；亦無所望。",
        "translation": "He's learned to ask questions without tire and without attachment to words, to teach Dharma and give without the notion of clothing or food, to purify the Buddha's land, to encourage the virtues of all people, and to have no expectations.",
        "source": "T08n0222_007:0196b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為五事。",
        "translation": "These are the five things.",
        "source": "T08n0222_007:0196b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0196b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第四住者，當行十法終不為捨。",
        "translation": "\"When a bodhisattva-mahāsattva practices the fourth abode, he'll perform ten things that will never be abandoned.",
        "source": "T08n0222_007:0196c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T08n0222_007:0196c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不捨閑居；志在少求；而知止足；不離宴坐；不毀禁戒；不厭受欲；不止滅度；一切所有施而不惜；而不怯弱；於諸所有而無所慕。",
        "translation": "He doesn't abandon quiet living, aims for little, knows restraint, doesn't leave sitting in repose, doesn't disparage the precepts, doesn't tire of accepting desires, doesn't stop at cessation, doesn't shy away from giving everything, doesn't shrink from it, and doesn't long for anything.",
        "source": "T08n0222_007:0196c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十事。",
        "translation": "These are the ten things.",
        "source": "T08n0222_007:0196c05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0196c05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第五住者，當棄八事。",
        "translation": "\"When a bodhisattva-mahāsattva practices the fifth abode, he should discard eight things.",
        "source": "T08n0222_007:0196c06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為八？",
        "translation": "What are the eight?",
        "source": "T08n0222_007:0196c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棄捐家居；離比丘尼；捨棄動性；不貪功德；捨於睡臥；離於瞋爭；不自稱譽；不毀他人。",
        "translation": "They abandon their homes, leave their nuns, abandon their active nature, don't crave merit, abandon sleeping and lying down, leave their anger, don't praise themselves, and don't disparage others.",
        "source": "T08n0222_007:0196c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為八事。",
        "translation": "These are the eight things.",
        "source": "T08n0222_007:0196c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0196c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第六住者，以具六法。",
        "translation": "\"The sixth abode of a bodhisattva-mahāsattva's practice is characterized by the presence of six things.",
        "source": "T08n0222_007:0196c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為六？",
        "translation": "What are the six?",
        "source": "T08n0222_007:0196c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂六波羅蜜；不為六法；不求聲聞、無緣覺想、不念於小；見貧乞者心色和悅；有所施與不以憂慼；心不懷恨。",
        "translation": "These are the six perfections; they don't pursue the six dharmas, don't seek the conceptions of śrāvakas and unconditional awakening, don't think of the small, look pleasantly at poor beggars, don't be sad when they give something, and don't harbor resentment in their hearts.",
        "source": "T08n0222_007:0196c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為六事。",
        "translation": "These are the six things.",
        "source": "T08n0222_007:0196c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0196c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第七住者，為以離二十法。",
        "translation": "The bodhisattva-mahāsattva who practices the seventh abode does so in order to part with 20 things.",
        "source": "T08n0222_007:0196c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂二十？",
        "translation": "What are the twenty?",
        "source": "T08n0222_007:0196c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所受；無吾我；不計人；不有命；不念壽；不念常；不著斷滅；無諸想著；離因緣見；不倚諸陰；不慕諸種；捨於諸種；捨於諸入；無三界想；不著於佛；不著於法；不著聖眾；護禁捨見；不猗念空；捨諸邪見無所染污，是為二十事。",
        "translation": "To have no sensation, no self, no discrimination of persons, no life, no mindfulness of life span, no mindfulness of permanence, no attachment to cessation, no conceptual attachments, free of the view of causes and conditions, no reliance on the aggregates, no admiration for species, equanimity in species, equanimity in sense-fields, no conceptions of the three realms, no attachment to buddhas, no attachment to the Dharma, no attachment to the noble multitude, a view that protects prohibitions and equanimity, no abiding mindfulness of emptiness, and equanimity in mistaken views that aren't stained are the 20 things.",
        "source": "T08n0222_007:0196c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當復具足二十法事。",
        "translation": "These are also the 20 things that should be fully present.",
        "source": "T08n0222_007:0196c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂二十。",
        "translation": "What are the twenty?",
        "source": "T08n0222_007:0196c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了於空；不證無相；惠無所願；淨於三場；愍哀眾生；不見眾生；無所輕慢；等觀諸法；體解法義；無所分別；曉了真正；亦無所著；無從生忍；講說一品；滅除眾想；棄捐塵勞；寂然離邪；其心調定；不離智慧；無有卒暴。",
        "translation": "They are comprehending emptiness, not realizing marklessness, bestowing no wishes, purifying the three sites, pitying sentient beings, not seeing sentient beings, not despising anything, observing things equally, understanding the meaning of the Dharma in essence, not discriminating anything, comprehending the truth, not attaching anything, not producing forbearance from anything, expounding the one class, ceasing all conceptions, discarding worldly sufferings, being still and free of error, having a mind that's calm and collected, not parting with wisdom, and not being violent.",
        "source": "T08n0222_007:0196c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為二十。",
        "translation": "These are the twenty.",
        "source": "T08n0222_007:0196c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，須菩提！",
        "translation": "Furthermore, Subhūti!",
        "source": "T08n0222_007:0196c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第八住者，以為具足四法。",
        "translation": "\"The eighth abode of a bodhisattva-mahāsattva's practice is based on the fulfillment of four things.",
        "source": "T08n0222_007:0196c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are the four?",
        "source": "T08n0222_007:0196c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入眾生心神通自樂；現諸佛土隨所觀察；具成己土稽首諸佛；以真諦觀諸佛之身。",
        "translation": "He enters the minds of sentient beings with supernormal powers and spontaneous pleasure, manifests the buddha-lands as he observes them, fully forms his own land, looks up at the buddhas, and observes the bodies of the buddhas with true truth.",
        "source": "T08n0222_007:0196c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four things.",
        "source": "T08n0222_007:0197a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0197a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第九住者，當復具足四法。",
        "translation": "\"When a bodhisattva-mahāsattva practices the ninth abode, he'll also be fully equipped with four things.",
        "source": "T08n0222_007:0197a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are the four?",
        "source": "T08n0222_007:0197a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了諸根成諸佛土；慇懃奉修於幻三昧；順化眾生令其造德本處於淳淑；為眾示現具足之身為說道義。",
        "translation": "They understand the faculties and form the buddha-lands, diligently cultivate the illusory concentration, conform to the transformation of sentient beings so that their merit-making roots are in a pure state, and present a body complete for all to teach the meaning of the path.",
        "source": "T08n0222_007:0197a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四事。",
        "translation": "These are the four things.",
        "source": "T08n0222_007:0197a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0197a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行第十住者，於十二事悉具足。",
        "translation": "When a bodhisattva-mahāsattva practices the tenth abode, he's fully equipped with 12 things.",
        "source": "T08n0222_007:0197a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂十二？",
        "translation": "What are the twelve?",
        "source": "T08n0222_007:0197a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為無量處而設擁護；隨眾所願各令得所；口所演說，諸天、龍神、揵沓惒、阿須倫、迦樓羅、真陀羅、摩烋勒聞其音各各解了；辯才如是；胞胎眾事、種姓尊貴、所生之處、眷屬國土、棄國捐家、詣於佛樹、清淨具足；一切名德，皆為備悉。",
        "translation": "They are protected by measureless locations, make each place available according to their wishes, explain by word of mouth what the gods, dragons, gandharvas, asuras, garuḍas, maheulas, and mahoraghuls hear and understand, and are thus eloquent in their discernment, producing a multitude of tasks, castes, dignities, places of birth, retinues, lands, renunciations, visits to the buddha tree, and purity and sufficiency, all of which are fully known as virtues.",
        "source": "T08n0222_007:0197a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十二。",
        "translation": "These are the twelve.",
        "source": "T08n0222_007:0197a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T08n0222_007:0197a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第十菩薩摩訶薩者，即謂是佛。」",
        "translation": "The tenth bodhisattva, Mahāsattva, is known as a Buddha.\"",
        "source": "T08n0222_007:0197a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提白佛言：「何謂菩薩遵修志性？」",
        "translation": "Subhūti said to the Buddha, \"What's meant by a bodhisattva following the nature of cultivation?\"",
        "source": "T08n0222_007:0197a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「所作德本，心皆勸助薩芸若慧故。",
        "translation": "The Buddha said, \"The virtues underlying what they do are all mental states that encourage the wisdom of the saṃgha.",
        "source": "T08n0222_007:0197a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩等心？",
        "translation": "What's meant by a mind like a bodhisattva's?",
        "source": "T08n0222_007:0197a16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切志薩芸若，行四等心——慈悲喜護——故。",
        "translation": "\"All aspirants are like wise men who practice the four kinds of mind - kindness, pity, joy, and protection - and so forth.",
        "source": "T08n0222_007:0197a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩為布施業？",
        "translation": "What does it mean for a bodhisattva to do the act of giving?",
        "source": "T08n0222_007:0197a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施於一切，無所想念故。",
        "translation": "By bestowing it on all, they don't miss anything.",
        "source": "T08n0222_007:0197a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩結善知識？",
        "translation": "What does it mean for a bodhisattva to associate with a good teacher?",
        "source": "T08n0222_007:0197a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸化一切令立正道，稽首問信恭敬尊長故。",
        "translation": "They encourage all people to establish the right path by bowing their heads, asking for confidence, and honoring their elders.",
        "source": "T08n0222_007:0197a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩具足求法？",
        "translation": "What's meant by a bodhisattva fully seeking the Dharma?",
        "source": "T08n0222_007:0197a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所求法，心常在於薩芸若慧，而不墮落聲聞、辟支佛地故。",
        "translation": "Whenever they seek the Dharma, their minds are always focused on the wisdom of the śrāvaka and pratyekabuddha stages, so they don't fall into the stages of the śrāvakas and pratyekabuddhas.",
        "source": "T08n0222_007:0197a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩慇懃出家？",
        "translation": "What's meant by a bodhisattva's devotion to leaving home?",
        "source": "T08n0222_007:0197a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所生之處，世世捨業無所毀壞，隨怛薩阿竭教，其出家者修無上行故。",
        "translation": "Where he's born, his worldly indifference to karma won't be destroyed, and he follows the Tathāgata Aggregates teaching as he leaves home and cultivates unsurpassed practices.",
        "source": "T08n0222_007:0197a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩遵求佛身？",
        "translation": "What does it mean for a bodhisattva to follow the pursuit of the Buddha's body?",
        "source": "T08n0222_007:0197a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見佛形，其心未曾離佛爾，乃至於薩芸若慧故。",
        "translation": "\"If someone sees the Buddha's form, their mind has never been free of the Buddha, even up to the point where it's the wisdom of the śrāvaka.",
        "source": "T08n0222_007:0197a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩開闡諸法？",
        "translation": "What does it mean for a bodhisattva to expound the teachings?",
        "source": "T08n0222_007:0197a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩現在見佛若般泥洹，而為眾生講說經法，初語亦善、中語亦善、竟語亦善，其義備悉，微妙具足清淨之行，及十二部經——聞經、德經、聽經、分別經、示現經、譬喻經、所說經、所生經、方等經、未曾有經章句經、所行經，是為菩薩十二部經——開闡諸法。",
        "translation": "Suppose a bodhisattva now sees the Buddha's parinirvāṇa and explains to sentient beings the teachings of sūtras that are good in the beginning, good in the middle, and good in the end, whose meanings are complete, subtle and complete in their pure conduct, and twelve sūtras - the Sutra of Hearing, the Sutra of Virtue, the Sutra of Listening, the Sutra of Discernment, the Sutra of Revealing, the Sutra of Parables, the Sutra of What's Explained, the Sutra of What's Arisen, the Sutra of Equality, the Sutra of Never Before Existing, the Sutra of Chapter and Verse, and the Sutra of What's Done - these are the bodhisattva's twelve sūtras - which explain the various teachings.",
        "source": "T08n0222_007:0197a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄捐憍慢心？",
        "translation": "What does it mean for a bodhisattva to relinquish his mind of pride?",
        "source": "T08n0222_007:0197b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未曾懷自大，終不生小姓家故。",
        "translation": "They've never harbored pride, so they'll never be born into a family of lesser beings.",
        "source": "T08n0222_007:0197b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩所言至誠？",
        "translation": "What is meant by what the bodhisattvas say about supreme sincerity?",
        "source": "T08n0222_007:0197b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有所說，言行相副故。」",
        "translation": "If something is explained, it's because words and deeds go together.\"",
        "source": "T08n0222_007:0197b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語須菩提：「是為菩薩摩訶薩行第一住奉行十事！」",
        "translation": "The Buddha said to Subhūti, \"These are the ten things that a bodhisattva-mahāsattva does when he practices the first abode of devotion!\"",
        "source": "T08n0222_007:0197b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提白佛言：「何謂菩薩戒品清淨？」",
        "translation": "Subhūti said to the Buddha, \"What is meant by the purity of the bodhisattva's moral character?\"",
        "source": "T08n0222_007:0197b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「心不念求聲聞、辟支佛乘，亦不毀訾於諸菩薩。",
        "translation": "The Buddha said, \"The mind doesn't long for the vehicle of the śrāvakas and pratyekbuddhas, and it doesn't disparage the bodhisattvas.",
        "source": "T08n0222_007:0197b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若犯戒者，而以勸喻，令不墮壍故。",
        "translation": "If someone violates the precepts, he encourages and instructs them so that they won't fall into error.",
        "source": "T08n0222_007:0197b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而有反復知報恩者？",
        "translation": "What's the meaning of a bodhisattva who knows how to repay kindness in return?",
        "source": "T08n0222_007:0197b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使菩薩行菩薩道時，若施少者不以廢忘，何況於多。",
        "translation": "Suppose a bodhisattva practicing the bodhisattva path gives a little and doesn't forget it, so why wouldn't he give a lot?",
        "source": "T08n0222_007:0197b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩住於忍力？",
        "translation": "What does it mean for a bodhisattva to abide in the power of forbearance?",
        "source": "T08n0222_007:0197b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常於眾生無有亂心，志不懷害故。",
        "translation": "He's always unconfused about sentient beings and doesn't harbor harmful intentions.",
        "source": "T08n0222_007:0197b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩心色和悅？",
        "translation": "What's meant by a bodhisattva's mind being pleasant in appearance?",
        "source": "T08n0222_007:0197b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念化眾生不違正行故。",
        "translation": "\"It's because mindfulness transforms sentient beings and doesn't contradict proper behavior.",
        "source": "T08n0222_007:0197b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不捨眾生？",
        "translation": "What does it mean for a bodhisattva not to abandon sentient beings?",
        "source": "T08n0222_007:0197b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能救濟護一切人故。",
        "translation": "It's because they can save and protect all people.",
        "source": "T08n0222_007:0197b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩近於大悲？",
        "translation": "What does it mean for a bodhisattva to approach great compassion?",
        "source": "T08n0222_007:0197b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩行道之時，心自念言：『因一切人故，恒河沙劫在於地獄，若見考署終不懈怠，當令彼人成於佛乘，以得滅度。』",
        "translation": "Suppose a bodhisattva mindfully says to himself when he's on the path, 'Because of all the people who have been in hell for eons, if he sees an examiner and never becomes lazy, he'll cause that person to achieve the Buddha vehicle and be liberated.'",
        "source": "T08n0222_007:0197b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是比類一切眾生，其心自勸，微妙如是。",
        "translation": "Such is the subtlety of their own mental encouragement compared to that of all sentient beings.",
        "source": "T08n0222_007:0197b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩受尊長教？",
        "translation": "What does it mean for a bodhisattva to accept the teaching of a venerable elder?",
        "source": "T08n0222_007:0197b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有出家，若見師父視之如佛。",
        "translation": "\"If a renunciant sees a master, he regards him as a Buddha.",
        "source": "T08n0222_007:0197b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩求波羅蜜？",
        "translation": "What's meant by a bodhisattva seeking paramountcy?",
        "source": "T08n0222_007:0197b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使菩薩不志餘業、不念他法，無所輕慢，求無極故。",
        "translation": "\"If a bodhisattva doesn't aspire to other karma, doesn't think about other things, and doesn't despise anything, then his pursuit will have no limit.",
        "source": "T08n0222_007:0197b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩博聞無厭？",
        "translation": "What does it mean for a bodhisattva to be well-versed and not weary?",
        "source": "T08n0222_007:0197b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛天中天所可言說於此所講，及十方佛口所演說，悉奉受持故。",
        "translation": "The buddhas, gods of gods, and the buddhas of the ten directions all respect and uphold what's being taught here and what's being explained by their mouths.",
        "source": "T08n0222_007:0197b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩所說法施無衣食想？",
        "translation": "What's meant by a bodhisattva's explanation of giving the Dharma without the perception of clothing or food?",
        "source": "T08n0222_007:0197b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此法施，心念如是，不想佛道故。",
        "translation": "Because the mind is thus mindful of this kind of Dharma gift, it doesn't want to follow the Buddha's path.",
        "source": "T08n0222_007:0197b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩淨於佛土？",
        "translation": "What does it mean for a bodhisattva to purify the Buddha's land?",
        "source": "T08n0222_007:0197b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所殖德本，皆以勸助嚴淨佛土故。",
        "translation": "The virtues they cultivate are all rooted in encouraging and assisting in the adornment and purification of the Buddha's land.",
        "source": "T08n0222_007:0197b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不厭生死？",
        "translation": "What's meant by a bodhisattva not being disillusioned with birth and death?",
        "source": "T08n0222_007:0197b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常欲具足一切功德，成就善本開化眾生，淨於佛土未曾懈惓，至令具足薩芸若慧故。",
        "translation": "They always want to be fully endowed with all the virtues, accomplish the roots of goodness, enlighten sentient beings, and purify the Buddha's land without ever being lazy, so that they can fully possess the wisdom of the śrāvaka.",
        "source": "T08n0222_007:0197b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而知慚愧？",
        "translation": "What does it mean for a bodhisattva to know shame?",
        "source": "T08n0222_007:0197b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常無聲聞、辟支佛心故。",
        "translation": "It's because the minds of śrāvakas and pratyekbuddhas are always absent.",
        "source": "T08n0222_007:0197b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不捨閑居？",
        "translation": "What's the meaning of a bodhisattva who doesn't abandon his quiet life?",
        "source": "T08n0222_007:0197b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不入聲聞、辟支佛地故。",
        "translation": "It's because they don't enter the stages of śrāvakas and pratyekbuddhas.",
        "source": "T08n0222_007:0197b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩志在少求？",
        "translation": "What's the meaning of a bodhisattva's aiming for less?",
        "source": "T08n0222_007:0197c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行菩薩道無所貪慕，志在佛道故。",
        "translation": "\"They practice the bodhisattva path without craving, so their intention is to follow the Buddha's path.",
        "source": "T08n0222_007:0197c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而知止足？",
        "translation": "What is meant by a bodhisattva who knows the limits of cessation?",
        "source": "T08n0222_007:0197c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用成薩芸若故。",
        "translation": "It's because it's used to achieve sarvajña.",
        "source": "T08n0222_007:0197c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不捨節限？",
        "translation": "What's meant by a bodhisattva not abandoning restraint?",
        "source": "T08n0222_007:0197c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂能分別曉深法故。",
        "translation": "It's because they can discern the profundity of the teaching.",
        "source": "T08n0222_007:0197c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不捨學戒？",
        "translation": "What does it mean for a bodhisattva not to abandon training in the precepts?",
        "source": "T08n0222_007:0197c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所持禁戒而不放逸故。",
        "translation": "It's because they observe the precepts and don't get carried away.",
        "source": "T08n0222_007:0197c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不厭受欲？",
        "translation": "What does it mean for a bodhisattva not to become disillusioned with desiring?",
        "source": "T08n0222_007:0197c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其心未曾起貪欲故。",
        "translation": "That's because their mind has never given rise to craving.",
        "source": "T08n0222_007:0197c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩心不滅度？",
        "translation": "What's meant by a bodhisattva's mind not being consummated?",
        "source": "T08n0222_007:0197c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法而無所行故。",
        "translation": "It's because there's nothing to do with all dharmas.",
        "source": "T08n0222_007:0197c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩一切所有？",
        "translation": "What does it mean for a bodhisattva to have all that exists?",
        "source": "T08n0222_007:0197c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能以布施而悉將護，內外諸法無所貪故。",
        "translation": "They can protect them all with almsgiving, so they don't crave internal or external things.",
        "source": "T08n0222_007:0197c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩志不怯弱？",
        "translation": "What's meant by a bodhisattva's resolve not being fainthearted?",
        "source": "T08n0222_007:0197c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心未曾發而為二識故。",
        "translation": "It's because the mind has never yet arisen and it's the two consciousnesses.",
        "source": "T08n0222_007:0197c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩觀諸所有而無所貪？",
        "translation": "What does it mean for a bodhisattva to contemplate all existence and not desire anything?",
        "source": "T08n0222_007:0197c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸萬物無所念故。",
        "translation": "\"It's because they don't have any thoughts about the myriad things.",
        "source": "T08n0222_007:0197c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄國捐家？",
        "translation": "What's meant by a bodhisattva abandoning his country and renouncing his family?",
        "source": "T08n0222_007:0197c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從一佛國復遊一國，所生之處，除其鬚髮而被袈裟，現作沙門故。",
        "translation": "They travel from one Buddha-land to another, and wherever they're born, they remove their hair and put on a reddish-brown robe, so they now become ascetics.",
        "source": "T08n0222_007:0197c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩捨比丘尼？",
        "translation": "What does it mean for a bodhisattva to abandon his nuns?",
        "source": "T08n0222_007:0197c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彈指之頃不與從事，於彼因緣心無所起故。",
        "translation": "In the instant it snaps its fingers, it doesn't follow them, so the mind has nothing to give rise to for those reasons.",
        "source": "T08n0222_007:0197c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩捨棄種姓？",
        "translation": "What does it mean for a bodhisattva to abandon his family?",
        "source": "T08n0222_007:0197c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩當念：『令眾生處在安隱，以自然安。』",
        "translation": "Bodhisattvas should think, 'Let's put sentient beings in a peaceful place so that they'll be naturally at ease.'",
        "source": "T08n0222_007:0197c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使見者，終不起嫉心故。",
        "translation": "If someone sees that, they'll never become jealous.",
        "source": "T08n0222_007:0197c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄捐眾貪及與睡臥？",
        "translation": "What does it mean for a bodhisattva to relinquish numerous cravings and sleep and lay down?",
        "source": "T08n0222_007:0197c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩所在眾會，若有興發聲聞、辟支佛心者，不當於彼與從事故。",
        "translation": "Suppose a bodhisattva is present in a congregation and someone arouses the minds of śrāvakas and pratyekabuddhas, they won't be given an opportunity to follow them.",
        "source": "T08n0222_007:0197c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩離瞋恚？",
        "translation": "What does it mean for a bodhisattva to be free of anger?",
        "source": "T08n0222_007:0197c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不從恨怒危害之心，無鬪訟意無所爭故。",
        "translation": "They don't follow hatred, anger, or harmful thoughts, and they don't fight or have intentions to fight.",
        "source": "T08n0222_007:0197c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不自稱譽？",
        "translation": "What's the meaning of a bodhisattva not claiming fame for himself?",
        "source": "T08n0222_007:0197c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見內法，無所觀故。",
        "translation": "Not seeing internal dharmas, they contemplate nothing.",
        "source": "T08n0222_007:0197c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不毀他人？",
        "translation": "What does it mean for a bodhisattva not to disparage others?",
        "source": "T08n0222_007:0197c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於外一切無所見故。",
        "translation": "It's because there's nothing to see outside.",
        "source": "T08n0222_007:0197c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄於十惡？",
        "translation": "What does it mean for a bodhisattva to renounce the ten evils?",
        "source": "T08n0222_007:0197c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "習賢聖道為上行，淨身、口、意故。",
        "translation": "\"The cultivation of the noble path of the good is the highest practice, which purifies body, speech, and mind.",
        "source": "T08n0222_007:0197c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄捐憍慢？",
        "translation": "What does it mean for a bodhisattva to renounce pride?",
        "source": "T08n0222_007:0197c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所行，不見諸法而有慢故。",
        "translation": "Such a practice is the result of not seeing things and having conceit.",
        "source": "T08n0222_007:0197c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩捨於自大？",
        "translation": "What does it mean for a bodhisattva to abandon pride?",
        "source": "T08n0222_007:0197c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所行不見形貌及與所有故。",
        "translation": "What's practiced doesn't see form and form and what's possessed.",
        "source": "T08n0222_007:0197c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩離於顛倒？",
        "translation": "What does it mean for a bodhisattva to be free of mistakenness?",
        "source": "T08n0222_007:0197c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "察諸所有而不可得故。",
        "translation": "It's because they can't be obtained after examining all of them.",
        "source": "T08n0222_007:0197c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄婬怒癡？",
        "translation": "What does it mean for a bodhisattva to abandon lust, anger, and delusion?",
        "source": "T08n0222_007:0197c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "永不覩見婬、怒、癡垢之所在故。",
        "translation": "It's because they never see the defiling places of lust, anger, and delusion.",
        "source": "T08n0222_007:0197c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩具足六法？",
        "translation": "What is meant by a bodhisattva being fully equipped with the six dharmas?",
        "source": "T08n0222_007:0197c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六住者當具六法。",
        "translation": "\"The sixth abode should be replete with six things.",
        "source": "T08n0222_007:0197c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為六？",
        "translation": "What are the six?",
        "source": "T08n0222_007:0197c28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂六波羅蜜當具足之。",
        "translation": "\"The six perfections should be fulfilled.",
        "source": "T08n0222_007:0197c29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何具足六波羅蜜？",
        "translation": "How are the six perfections fulfilled?",
        "source": "T08n0222_007:0197c29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住六波羅蜜則能超越聲聞、辟支佛故。",
        "translation": "By abiding in the six perfections, they're able to transcend the śrāvakas and pratyekabuddhas.",
        "source": "T08n0222_007:0198a01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不起聲聞、辟支佛心？",
        "translation": "What does it mean for a bodhisattva not to arise from the minds of śrāvakas and pratyekabuddhas?",
        "source": "T08n0222_007:0198a01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等所行不應為道，行小乘者不順佛道。",
        "translation": "Such practices shouldn't be considered the path, and those who practice the lesser vehicle don't follow the Buddha's path.",
        "source": "T08n0222_007:0198a02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見乞求者則懷怯弱。",
        "translation": "If they see someone begging, they'll be intimidated.",
        "source": "T08n0222_007:0198a03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行菩薩者當捨離之，心無憂慼。",
        "translation": "A practitioner of the bodhisattva path will abandon them and have no sadness in his heart.",
        "source": "T08n0222_007:0198a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_007:0198a04_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯等所行為不入道，從初發意常行布施，心不忘捨故。",
        "translation": "Such things are done because they don't enter the path, and because they always practice generosity from the very beginning when they set their minds to it and don't forget to abandon it.",
        "source": "T08n0222_007:0198a05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不自貪身？",
        "translation": "What does it mean for a bodhisattva not to crave himself?",
        "source": "T08n0222_007:0198a06_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以爾者？",
        "translation": "So, what is it?",
        "source": "T08n0222_007:0198a06_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "推求本末無有吾我，計人壽命亦復如是。",
        "translation": "\"As we examine the past and future, there's no self, and so is the calculation of a person's life span.",
        "source": "T08n0222_007:0198a07_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_007:0198a08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀察之心無所有故。",
        "translation": "It's because the mind that observes with care has no existence.",
        "source": "T08n0222_007:0198a08_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不墮滅見？",
        "translation": "What does it mean for a bodhisattva not to fall into the view of cessation?",
        "source": "T08n0222_007:0198a08_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以爾者，一切諸法心無所斷，本末不起，一切諸法亦無所生故。",
        "translation": "That's why there's nothing cut off in the mind and nothing that arises from the beginning and end of all dharmas.",
        "source": "T08n0222_007:0198a09_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不計有常？",
        "translation": "What does it mean for a bodhisattva not to consider existence to be permanent?",
        "source": "T08n0222_007:0198a10_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以爾者，假使諸法悉無所起，則無有常故。",
        "translation": "That's why, if all dharmas are unarisen, then they lack permanence.",
        "source": "T08n0222_007:0198a11_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不為想著？",
        "translation": "What does it mean for a bodhisattva not to be attached to perceptions?",
        "source": "T08n0222_007:0198a12_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以爾者，如是計之無有塵勞，無因緣見。",
        "translation": "Therefore, it's thus considered to be without defilement and without views of cause and condition.",
        "source": "T08n0222_007:0198a12_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以爾者，彼所見者不見諸見故。",
        "translation": "Therefore, it's because those who see don't see views.",
        "source": "T08n0222_007:0198a13_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不猗名色？",
        "translation": "What does it mean to say that a bodhisattva isn't concerned about names and forms?",
        "source": "T08n0222_007:0198a14_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以爾者，一切有所為無所有故。",
        "translation": "\"That's why everything that has been created has nothing.",
        "source": "T08n0222_007:0198a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不著諸陰？",
        "translation": "What does it mean for a bodhisattva not to be attached to the aggregates?",
        "source": "T08n0222_007:0198a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不猗諸種、不慕諸入。",
        "translation": "\"They don't get caught up in the aggregates or seeds and don't look for the sense sense bases.",
        "source": "T08n0222_007:0198a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以爾者，如是行者悉為自怨而無所有，以是故，不當猗著陰、種、諸入故。",
        "translation": "That's why such a practitioner is self-hating and lacks possessions; therefore, he shouldn't be concerned about aggregates, seeds, and sense-fields.",
        "source": "T08n0222_007:0198a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不猗三界？",
        "translation": "What does it mean for a bodhisattva not to be concerned about the three elements?",
        "source": "T08n0222_007:0198a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其三界者自然無形，雖在三界而無所猗故。",
        "translation": "The three realms are naturally formless, and although they're in the three realms, they have nothing to interfere with.",
        "source": "T08n0222_007:0198a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不處所有？",
        "translation": "What does it mean to say that a bodhisattva doesn't have possessions anywhere?",
        "source": "T08n0222_007:0198a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以剋期而為虛空，一切所有悉無所有故。",
        "translation": "It doesn't take a gram period to be space, so all that exists is completely nonexistent.",
        "source": "T08n0222_007:0198a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩見佛不著？",
        "translation": "What does it mean when a bodhisattva sees a Buddha and doesn't cling to it?",
        "source": "T08n0222_007:0198a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以猗見為見諸佛故。",
        "translation": "\"It's because they don't see the buddhas with an interlocutor's view.",
        "source": "T08n0222_007:0198a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不爭於空？",
        "translation": "What does it mean for a bodhisattva not to argue about emptiness?",
        "source": "T08n0222_007:0198a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法悉為空無，空不亂空，無所爭故。",
        "translation": "All things are empty and nonexistent, and emptiness doesn't confuse emptiness, so there's no argument.",
        "source": "T08n0222_007:0198a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩具足於空？",
        "translation": "What does it mean to say that a bodhisattva is fully equipped with emptiness?",
        "source": "T08n0222_007:0198a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身相虛空則為菩薩具足於空故。",
        "translation": "\"When the body's characteristics are empty, it's because the bodhisattva is fully equipped with emptiness.",
        "source": "T08n0222_007:0198a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不證無相？",
        "translation": "What does it mean to say that a bodhisattva doesn't realize marklessness?",
        "source": "T08n0222_007:0198a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切相而無所念故。",
        "translation": "It's because they don't think of anything in terms of all characteristics.",
        "source": "T08n0222_007:0198a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩志無願慧？",
        "translation": "What is meant by the bodhisattva's wisdom of aspiring and not wishing?",
        "source": "T08n0222_007:0198a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而於三界皆無所行故。",
        "translation": "There's nothing to do in the three realms.",
        "source": "T08n0222_007:0198a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩淨於三場？",
        "translation": "What does it mean for a bodhisattva to purify the three venues?",
        "source": "T08n0222_007:0198a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便能具足十善德故。",
        "translation": "It's because they can then fully possess the ten good qualities.",
        "source": "T08n0222_007:0198a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩愍哀一切眾生之類？",
        "translation": "What is meant by the category of bodhisattvas who are compassionate toward all sentient beings?",
        "source": "T08n0222_007:0198a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便能行德無極大哀故？",
        "translation": "Is it possible to practice virtue and infinite compassion?",
        "source": "T08n0222_007:0198a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不慢眾生？",
        "translation": "What is meant by a bodhisattva not being arrogant toward sentient beings?",
        "source": "T08n0222_007:0198a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而欲具足佛土故。",
        "translation": "They want to fully realize the Buddha's land.",
        "source": "T08n0222_007:0198a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩等觀諸法？",
        "translation": "What does it mean for a bodhisattva to contemplate all dharmas equally?",
        "source": "T08n0222_007:0198b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "察於諸法無高無下故。",
        "translation": "It's because they examine all dharmas, which are neither higher nor lower.",
        "source": "T08n0222_007:0198b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩諦觀道地？",
        "translation": "What is meant by a bodhisattva's stage of the path when he observes them with care?",
        "source": "T08n0222_007:0198b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法而無所習，無所動轉故。",
        "translation": "Because there's nothing to accumulate and nothing to move in regard to all dharmas, it's possible.",
        "source": "T08n0222_007:0198b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩無從生忍？",
        "translation": "What does it mean for a bodhisattva to have the patience of not being born from anything?",
        "source": "T08n0222_007:0198b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法悉無所起，亦無所滅，忍無所有故。",
        "translation": "\"All dharmas have nothing to give rise to and nothing to cease, so tolerance has nothing to offer.",
        "source": "T08n0222_007:0198b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩無所生慧？",
        "translation": "What's meant by the bodhisattva's wisdom that arises from nothing?",
        "source": "T08n0222_007:0198b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其於名色，慧無所起故。",
        "translation": "In name-and-form, there's no place for wisdom to arise.",
        "source": "T08n0222_007:0198b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩說於一品？",
        "translation": "What does it mean when a bodhisattva teaches one thing?",
        "source": "T08n0222_007:0198b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不行二事故。",
        "translation": "\"He doesn't practice two things.",
        "source": "T08n0222_007:0198b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不念諸念？",
        "translation": "What's meant by a bodhisattva not being mindful of mindfulness?",
        "source": "T08n0222_007:0198b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法而無所念故。",
        "translation": "It's because they don't have any thoughts about all dharmas.",
        "source": "T08n0222_007:0198b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄捐諸見？",
        "translation": "What does it mean for a bodhisattva to abandon views?",
        "source": "T08n0222_007:0198b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能捨離聲聞、辟支佛地故。",
        "translation": "It's because they can part with the stages of śrāvakas and pratyekbuddhas.",
        "source": "T08n0222_007:0198b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩滅除塵勞？",
        "translation": "What's meant by a bodhisattva who has ceased defilement?",
        "source": "T08n0222_007:0198b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸漏所習止處，欲垢悉斷故。",
        "translation": "It's because all the contaminants are cultivated and stopped, and the stain of desire is completely removed.",
        "source": "T08n0222_007:0198b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩寂離見地？",
        "translation": "What's meant by the bodhisattva's stage of quiescent free vision?",
        "source": "T08n0222_007:0198b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂能逮成薩芸若慧故。",
        "translation": "It's because they can acquire the wisdom of the saṃyuktâgama.",
        "source": "T08n0222_007:0198b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂心調？",
        "translation": "What's meant by mental conditioning?",
        "source": "T08n0222_007:0198b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於三界無所患難故。",
        "translation": "It's because there's no trouble in the three realms.",
        "source": "T08n0222_007:0198b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂心寂？",
        "translation": "What does it mean for the mind to be quiescent?",
        "source": "T08n0222_007:0198b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能御六根故。",
        "translation": "It's because they can control the six faculties.",
        "source": "T08n0222_007:0198b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不捨智慧？",
        "translation": "What's meant by a bodhisattva not abandoning wisdom?",
        "source": "T08n0222_007:0198b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂能逮得明眼故。",
        "translation": "It's because they can acquire the insight.",
        "source": "T08n0222_007:0198b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩無有卒暴？",
        "translation": "What does it mean to say that a bodhisattva has no trouble getting up?",
        "source": "T08n0222_007:0198b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀於六入無染著故。",
        "translation": "\"It's because they contemplate the six sense-fields without defiled attachment.",
        "source": "T08n0222_007:0198b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩心有所入？",
        "translation": "What does it mean for a bodhisattva's mind to have some entry?",
        "source": "T08n0222_007:0198b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則以一心普見一切眾生之念故。",
        "translation": "\"It's because of the mindfulness that sees all sentient beings with one mind.",
        "source": "T08n0222_007:0198b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩神通自娛？",
        "translation": "What is meant by a bodhisattva's self-possession by supernormal powers?",
        "source": "T08n0222_007:0198b15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則以神通而自娛樂，從一佛國復至一國，所遊之處無佛土想故。",
        "translation": "Then, with supernormal powers, they entertain themselves by going from one Buddha-land to another, and there's no conception of a Buddha-land anywhere they go.",
        "source": "T08n0222_007:0198b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩見諸佛國？",
        "translation": "What does it mean for a bodhisattva to see all the buddha lands?",
        "source": "T08n0222_007:0198b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住此佛國則見十方無量佛國，於諸佛國亦無所著故。",
        "translation": "\"When he lives in this Buddha-land, he sees measureless Buddha-lands in the ten directions, and he doesn't get attached to any of them.",
        "source": "T08n0222_007:0198b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩如所觀察？",
        "translation": "What does it mean for a bodhisattva to thus observe?",
        "source": "T08n0222_007:0198b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸佛國具足嚴淨，三千世界所遊之處，輒為轉輪聖王故。",
        "translation": "When they see the perfect splendor and purity of the buddha lands and the places they travel in the 3,000 worlds, they easily become wheel-turning sage kings.",
        "source": "T08n0222_007:0198b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩稽首諸佛供事歸念？",
        "translation": "What does it mean when a bodhisattva looks up to the buddhas and makes offerings to them in remembrance?",
        "source": "T08n0222_007:0198b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切經法分別義趣故。",
        "translation": "It's because all the sūtras and dharmas discern their own meanings.",
        "source": "T08n0222_007:0198b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而常審諦觀諸佛身？",
        "translation": "What is meant by a bodhisattva always observing the body of the buddhas with an attentive eye?",
        "source": "T08n0222_007:0198b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以真正見諸佛則為法身故。",
        "translation": "\"It's because a true vision of the buddhas is the Dharma body.",
        "source": "T08n0222_007:0198b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩曉了諸根？",
        "translation": "What's meant by a bodhisattva's knowledge of the faculties?",
        "source": "T08n0222_007:0198b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能住於怛薩阿竭十種力者，則能曉了一切眾生諸根本故。",
        "translation": "If someone abides in the ten powers of the tathāgata, then they'll be able to understand the fundamentals of all sentient beings.",
        "source": "T08n0222_007:0198b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩佛土清淨？",
        "translation": "What's meant by the purity of a bodhisattva's Buddha land?",
        "source": "T08n0222_007:0198b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人民清淨是則名曰佛土清淨故。",
        "translation": "When the people are purified, it's called the Buddha land being purified.",
        "source": "T08n0222_007:0198b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩如幻三昧？",
        "translation": "What's called the bodhisattva's illusory samādhi?",
        "source": "T08n0222_007:0198b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住此三昧菩薩則能變現一切，無所不入，心無所處故。",
        "translation": "A bodhisattva who abides in this concentration is then able to manifest everything, entering nowhere, because his mind has no place to be.",
        "source": "T08n0222_007:0198b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而等三昧？",
        "translation": "What's meant by bodhisattva and such samādhi?",
        "source": "T08n0222_007:0198b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於諸三昧無所希望故。",
        "translation": "\"It's because a bodhisattva has no hope for these samādhis.",
        "source": "T08n0222_007:0198b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩能教眾生？",
        "translation": "What does it mean for a bodhisattva to be able to teach sentient beings?",
        "source": "T08n0222_007:0198b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所造德本各隨其行而開化，菩薩摩訶薩則以至誠而護己身，隨其眾生而開度之。",
        "translation": "The virtues they create are each developed according to their actions, and the bodhisattvas, the mahāsattvas, guard themselves with utmost sincerity and liberate their fellow beings according to their actions.",
        "source": "T08n0222_007:0198c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩至誠？",
        "translation": "What's meant by a bodhisattva's utmost sincerity?",
        "source": "T08n0222_007:0198c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自然有所勸發，欲以度脫一切眾生故。",
        "translation": "They are naturally encouraged, wanting to liberate all sentient beings.",
        "source": "T08n0222_007:0198c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩如其志願必能得之？",
        "translation": "What is meant by a bodhisattva who does what he wishes will surely attain it?",
        "source": "T08n0222_007:0198c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩常具足六波羅蜜故。",
        "translation": "\"It's because a bodhisattva always has the full set of the six perfections.",
        "source": "T08n0222_007:0198c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩所演出音，諸天、龍神及揵沓惒聞其音者，各得解了而順化之？",
        "translation": "What is meant by a voice performed by a bodhisattva that's heard by gods, dragons, gods, and gandharvas, who each understand it and conform to its transformation?",
        "source": "T08n0222_007:0198c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用有大哀普等音故。",
        "translation": "It's because there's a sound like great compassion and universality.",
        "source": "T08n0222_007:0198c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩入於胞胎？",
        "translation": "What does it mean for a bodhisattva to enter into the womb?",
        "source": "T08n0222_007:0198c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩世世所生而無所生故。",
        "translation": "\"It's because bodhisattvas, mahāsattvas, are produced in the world and nothing is produced.",
        "source": "T08n0222_007:0198c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩在於尊貴？",
        "translation": "What does it mean to say that a bodhisattva is honored?",
        "source": "T08n0222_007:0198c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所生在諸種姓則能化之故。",
        "translation": "It's because the bodhisattvas are born in various castes that they can transform them.",
        "source": "T08n0222_007:0198c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩所生具足？",
        "translation": "What does it mean to say that what's produced by a bodhisattva is complete?",
        "source": "T08n0222_007:0198c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩在君子種、在梵志種、在居士種，則能勸化故。",
        "translation": "Suppose a bodhisattva is of the gentlemanly type, the priestly type, or the householder type, then he's able to encourage and teach.",
        "source": "T08n0222_007:0198c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩在於尊姓？",
        "translation": "What does it mean for a bodhisattva to be in a noble lineage?",
        "source": "T08n0222_007:0198c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸以過去眾菩薩性等無差別故。",
        "translation": "\"It's because the natures of all the bodhisattvas in the past were equally nondistinguished.",
        "source": "T08n0222_007:0198c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩眷屬具足？",
        "translation": "What's meant by having a full complement of bodhisattva followers?",
        "source": "T08n0222_007:0198c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所從諸眷屬侍使無所乏故。",
        "translation": "There's nothing a bodhisattva lacks in the service of his retinue.",
        "source": "T08n0222_007:0198c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩土地嚴淨？",
        "translation": "What's meant by the bodhisattva's land being ornamented and purified?",
        "source": "T08n0222_007:0198c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始生之時，光明照曜無數世界，其蒙光者皆得安隱故。",
        "translation": "When they first arise, their light shines brightly in countless worlds, and those who are blinded by that light are all made comfortable.",
        "source": "T08n0222_007:0198c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩棄國捐家？",
        "translation": "What does it mean when a bodhisattva abandons his country and renounces his family?",
        "source": "T08n0222_007:0198c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩捨家學道時，化無央數億百千人而與從俱，能令眾生立於三乘故。",
        "translation": "When the bodhisattva Mahāsattva leaves home to train on the path, he transforms measureless millions of hundreds of thousands of people and accompanies them, which enables sentient beings to establish themselves in the three vehicles.",
        "source": "T08n0222_007:0198c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩詣諸佛樹？",
        "translation": "What does it mean when a bodhisattva goes to the buddha trees?",
        "source": "T08n0222_007:0198c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其樹則為根莖枝葉華實，皆為七寶紫磨金色，照於十方無數佛土悉為大明，是為菩薩詣佛樹嚴淨。",
        "translation": "The tree's roots, stems, branches, leaves, flowers, and fruit are all purple-gray-gold colored with seven treasures, and they all shine brightly in the countless Buddha lands in the ten directions.",
        "source": "T08n0222_007:0198c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩一切名德而悉具足？",
        "translation": "What is meant by a bodhisattva having all the well-known qualities and being fully endowed with them?",
        "source": "T08n0222_007:0198c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使菩薩人清淨者則佛國淨，是為菩薩名德具足。",
        "translation": "If a bodhisattva's person is purified, then the Buddha's kingdom is purified, and this is a bodhisattva whose name and virtue are complete.",
        "source": "T08n0222_007:0198c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩住十道地成為如來？",
        "translation": "What's meant by a bodhisattva abiding in the ten destinies and becoming a tathāgata?",
        "source": "T08n0222_007:0198c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩具足六波羅蜜，十力、無畏、十八不共諸佛之法，得薩芸若慧，斷除塵勞、無所罣礙，是為菩薩住十道地成為如來。",
        "translation": "When a bodhisattva fulfills the six perfections, the ten powers, fearlessness, and the 18 distinctive characteristics of the buddhas, attains the wisdom of sarvaṇa, and ends worldly sufferings and has no obstructions, this is a bodhisattva who abides in the ten destinies and becomes a tathāgata.",
        "source": "T08n0222_007:0198c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, Suppository!",
        "source": "T08n0222_007:0198c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩漚惒拘舍羅行六波羅蜜，意止、意斷、神足、根、力、七覺、八道、三十七品、十力、無畏、四分別辯、十八不共諸佛之法，寂然離見，現入種性八等之地。",
        "translation": "The bodhisattva Mahāsattva Avalokitêśvara practices the six perfections, mental stabilization, mental cessation, spiritual abilities, faculties, powers, seven feelings, eight paths, thirty-seven factors, ten powers, fearlessness, fourfold discernment, and eighteen distinctive qualities of the buddhas, and he tranquilizes and parts with views, manifesting himself in the eightfold ground of seed nature.",
        "source": "T08n0222_007:0198c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有所處，離欲之地、所作辦地，離於聲聞辟、支佛地、菩薩之地，是為菩薩摩訶薩入第九住於佛地，是為菩薩摩訶薩第十行住，是為菩薩摩訶薩三拔致！」",
        "translation": "If there's a place that's free of the stage of desire and the stage of accomplishment, free of the stage of the śrāvakas, the pratyekabuddhas, and the stage of the bodhisattvas, this is the ninth abode of the bodhisattva entering the buddha stage, the tenth abode of the bodhisattva's practice, and the third abode of the bodhisattva's withdrawal!\"",
        "source": "T08n0222_007:0199a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光讚經卷第七",
        "translation": "Guangzan jing, vol. 7",
        "source": "T08n0222_007:0199a06_0",
        "is_bad_quality": false
    }
]