[
    {
        "source_sentence": "佛說最上根本大樂金剛不空三",
        "translation": "Fo shuo zuishang fuqie dalai jingang bukong san",
        "source": "T08n0244_002:0790b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昧大教王經卷第二",
        "translation": "Mahāmegha-dharma-hṛdaya-rāja-paripṛcchā(sūtra), Volume II",
        "source": "T08n0244_002:0790b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Minister of Light for the Tripiṭaka Translation of the Sutra of the Western Paradise, the Grand Master of the Chaofeng",
        "source": "T08n0244_002:0790b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao dashi ministers, Faxian, in accordance with the imperial edict, translated",
        "source": "T08n0244_002:0790b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "降伏三界金剛三昧大儀軌分第三",
        "translation": "The Third Part of the Great Ritual Procedure for the Vajrasamādhi of Subduing the Three Worlds",
        "source": "T08n0244_002:0790b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼佛，說一切法平等最勝攝般若波羅蜜多法門。",
        "translation": "It was then that Śākyamuni Buddha explained the method of the most excellent collection of prajñāpāramitā that makes all things equal.",
        "source": "T08n0244_002:0790b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：「貪無性故，瞋亦無性；瞋無性故，癡亦無性；癡無性故，諸法亦無性；諸法無性故，般若波羅蜜多亦無性。",
        "translation": "It said, \"Because greed is devoid of nature, anger is devoid of nature; because anger is devoid of nature, delusion is devoid of nature; because delusion is devoid of nature, the dharmas are devoid of nature; and because the dharmas are devoid of nature, the prajñāpāramitā is devoid of nature.",
        "source": "T08n0244_002:0790b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人於如是般若波羅蜜多法門，聽聞受持讀誦記念者，是人設造殺害三界一切眾生所有之業，亦不復受，不墮諸惡趣，速證阿耨多羅三藐三菩提。」",
        "translation": "If someone hears, retains, recites, reads, and remembers this teaching of the perfection of wisdom, they won't be subject to any actions that would cause harm to all sentient beings in the three realms, won't fall into bad destinies, and will quickly realize unsurpassed, correct, and complete enlightenment.\"",
        "source": "T08n0244_002:0790b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛手菩薩，聞佛說此真實理法門已，即現顰眉利牙喜怒之相，於蓮花上立，如張弩勢，結降三界印而說心明。",
        "translation": "After hearing the Buddha teach this true principle as a Dharma entry, the Vajrapāṇi Bodhisattva then showed his characteristic expression of excitement with knitted brows and sharp teeth, stood on a lotus flower like a crossbow, formed the sign of subduing the three realms, and spoke his mind.",
        "source": "T08n0244_002:0790b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「吽(引)」說此心明時，三界諸天主及三界主，乃至大自在天，悉皆鉤召入於曼拏羅中，以調伏法皆令調伏，與作安慰，令住三昧。",
        "translation": "When he said, \"Unh (citation needed),\" he explained this clarification of the mind, the lords of the three realms, the lords of the three realms, and even the Mahêśvara gods all summoned him into the maṇḍala, subdued him with the Dharma of submission, comforted him, and caused him to abide in samādhi.",
        "source": "T08n0244_002:0790b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復現大忿怒相，於是大自在天及三界天主并諸眷屬，見金剛手菩薩作大忿怒相降伏三界，皆悉驚怖發聲告言：「金剛手菩薩！",
        "translation": "Again, they showed a great angry expression, and when the Mahêśvara gods, the lords of the three realms, and their retinues saw the Vajrapāṇi Bodhisattva's great angry expression as he subdued the three realms, they were all terrified and raised their voices, saying, \"Vajrapāṇi Bodhisattva!",
        "source": "T08n0244_002:0790b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "救護我等。",
        "translation": "We are saved and protected by the Buddha.",
        "source": "T08n0244_002:0790b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等歸依於佛，受佛聖旨安住三昧。」",
        "translation": "We all take refuge in the Buddha and accept his holy command to abide in samādhi.\"",
        "source": "T08n0244_002:0790b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有諸摩怛哩等，見菩薩現忿怒相，皆大驚怖苦惱迷悶，彼邪明邪印咸皆破壞，乃至宿曜執持及諸病苦、一切毒藥皆令銷除。",
        "translation": "All the mātṛs who saw the bodhisattva's wrathful appearance were terrified, afflicted, and confused, and their wrong insights and wrong signs were all destroyed, even their long-held obsessions, illnesses, and all poisons were all eliminated.",
        "source": "T08n0244_002:0790b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸摩怛哩等，亦發聲告言：「金剛手菩薩！",
        "translation": "The mātṛs then also raised their voices and said, \"Vajrapāṇi, bodhisattva!",
        "source": "T08n0244_002:0790c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "救護我等。",
        "translation": "Save and protect us.",
        "source": "T08n0244_002:0790c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今已後，歸依於佛，願賜加被。」",
        "translation": "From now on, I'll put my trust in the Buddha and ask for his blessing.\"",
        "source": "T08n0244_002:0790c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛手菩薩現微笑相，引諸天等入曼拏羅，令住三昧，以寶部法授與灌頂；復以金剛部法授其灌頂，令盡眾生界作大饒益事，安外金剛部中。",
        "translation": "Vajrapāṇi Bodhisattva then appeared with a smile on his face, lured the gods into the maṇḍala, made them stay in samādhi, conferred a consecration with the Precious Division teaching, and then conferred a consecration with the Vajra Division teaching, causing them to do great works of merit to bring peace to the whole realm of sentient beings outside the Vajra Division.",
        "source": "T08n0244_002:0790c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時金剛手菩薩，化一明王，作忿怒降三界相，具種種莊嚴，作大威猛，利牙齩唇鬚髮赤豎，執金剛杵、鉤劍、刀杖、芻哩迦等，是大明王依金剛手曼拏羅儀法而住。",
        "translation": "The Vajrapāṇi Bodhisattva then transformed into a bright king who took on the appearance of wrathful descent into the three realms, was resplendent in every way, assumed great authority, had sharp teeth and pearly lips, had red hair, and carried a vajra, a hooked sword, a sword, a staff, and a gurika, etc. This great bright king abides according to the rituals of the Vajrapāṇi maṇḍala.",
        "source": "T08n0244_002:0790c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天等安置於外曼拏羅，此曼拏羅外安諸宿曜。",
        "translation": "The gods placed him in an external maṇḍala, and outside of that maṇḍala were placed the constellations and celestial lights.",
        "source": "T08n0244_002:0790c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛手菩薩，即入一切如來大悲方便金剛三摩地。",
        "translation": "At that point, the Vajrapāṇi Bodhisattva then entered the vajra absorption of the Tathāgatas' great compassion and skillful means.",
        "source": "T08n0244_002:0790c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，說此降三界最勝安想金剛大曼拏羅儀法。",
        "translation": "After emerging from that concentration, he explained the rituals for this great adamantine maṇḍala of the most excellent tranquility perception for subduing the three realms.",
        "source": "T08n0244_002:0790c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌曰：「我今略說此，　　最勝曼拏羅，　名降伏三界，　　能調難調者。",
        "translation": "The verse goes, \"Now, I'll briefly explain this most excellent maṇḍala, which is called the subduer of the three realms and is capable of regulating those who are difficult to regulate.",
        "source": "T08n0244_002:0790c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　依前說法儀，　　畫外曼拏羅，　而於內輪中，　　分列八尊位。",
        "translation": "Relying on the previously explained ritual, he drew an outer maṇḍala and placed eight honored ones in the inner circle.",
        "source": "T08n0244_002:0790c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　中安忿怒尊，　　身如青蓮色，　具種種莊嚴，　　顰眉出利牙，　作忿怒微笑，　　立如張弩勢，　是降三界相，　　而於兩足下，　左蹋自在天，　　右蹋於天后，　熾盛光普照。",
        "translation": "In the center, he's positioned as a wrathful figure with a body the color of a blue lotus and a variety of adornments, a sinuous brow with sharp teeth, a wrathful smile, and a stance like a crossbow, which subdues the three realms, and he places his left foot underneath the Śivaites and his right foot behind the gods with a blazing light that shines everywhere.",
        "source": "T08n0244_002:0790c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　內畫八輻輪，　光明普照耀，　　依前外壇儀，　畫外曼拏羅。",
        "translation": "There are eight-spoked wheels painted on the inside, which shine brightly, and an outer maṇḍala is drawn according to the previous outer altar's ritual.",
        "source": "T08n0244_002:0790c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　四門各安置，　大忿怒之相，　　弓、箭與劍、輪，　是為四幖幟。",
        "translation": "Positioned at each of the four gates are the four corpuscles, which are the symbols of great wrath, the bow, the arrow, the sword, and the wheel.",
        "source": "T08n0244_002:0790c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於外曼拏羅，　安諸曜幖幟，　　種種上味食，　滿鉢為出生，　　安置青色鈴，　并眾色幢幡。",
        "translation": "On the outside of the maṇḍala, he placed radiating boards, filled a bowl with food of the highest flavor, placed a blue bell, and placed banners of various colors.",
        "source": "T08n0244_002:0790c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是時阿闍梨，　當著青色衣，　　而現忿怒相，　即結三昧印，　　入於曼拏羅。",
        "translation": "The preceptor then puts on a blue robe, assumes an angry expression, puts on the concentration mudrā, and enters the maṇḍala.",
        "source": "T08n0244_002:0791a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿闍梨當須，　　依法作佛事，　從是日已後，　　諸天不能見，　能成壞一切，　　得其諸最勝，　所有成就法，　　皆令得成就。",
        "translation": "The preceptor then must perform Buddha-works according to the teaching, so that from that day forward, the gods can't see them, they can destroy them all and attain their greatest excellence, and they'll achieve the accomplishment of all the things that they've accomplished.",
        "source": "T08n0244_002:0791a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是時引弟子，　　入於曼拏羅，　當結金剛印，　　授金剛灌頂，　即授金剛杵，　　而施與誓願：『此金剛手杵，　　能調難調者，　汝當常受持，　　成就最上法。』",
        "translation": "He then led his disciple into the maṇḍala, sealed the vajra seal, conferred the vajra consecration, and then gave him the vajra and pounder and vowed, 'This vajra hand and pounder is capable of taming those who are difficult to tame, so you must always accept it and achieve the most excellent Dharma.'",
        "source": "T08n0244_002:0791a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　施其誓願已，　　出於曼拏羅。」",
        "translation": "After bestowing that vow, it emerged from the maṇḍala.\"",
        "source": "T08n0244_002:0791a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是頌已，復說[巾*((ㄇ@人)/登)]像法：「當依金剛曼拏羅儀畫金剛忿怒尊，及畫大菩薩諸天與摩怛哩眾等，是為最上成就[巾*((ㄇ@人)/登)]像法。",
        "translation": "After speaking this verse, he then explained the [turban*(śrāvastī)/dhāraṇī] image teaching, \"This is the supreme accomplishment [turban*(śrāvastī)/dhāraṇī] image teaching, which depicts the vajra-wrathful gods, great bodhisattvas, gods, and the multitude of mātṛs according to the vajra maṇḍala's deportment.",
        "source": "T08n0244_002:0791a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後於[巾*((ㄇ@人)/登)]前依法供養，敷座而坐，結根本印，持誦百千徧。",
        "translation": "Then, he makes offerings according to the rules, spreads out his seat, puts his fundamental seal on it, and recites it a hundred thousand times.",
        "source": "T08n0244_002:0791a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是持誦，所有世間出世間一切之法皆悉成就。",
        "translation": "When you recite it this way, all the teachings that exist in the world and those that transcend the world will be accomplished.",
        "source": "T08n0244_002:0791a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設復於法未得精熟，但常持誦者，是人能作敬愛、鉤召、入寤、禁縛、解除等種種之法。」",
        "translation": "Even if someone has yet to perfect the teaching but always recites it, that person will be able to perform various things like veneration, seduction, awakening, restraint, and release.\"",
        "source": "T08n0244_002:0791a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說諸成就法：「若欲破壞諸惡者，當依金剛忿怒明王法。",
        "translation": "They also explain the accomplishment of these things: \"If you want to destroy evils, you must rely on the Dharma of the wrathful, luminous king of the vajras.",
        "source": "T08n0244_002:0791a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破諸邪印者，當現忿怒顧視而持誦之。",
        "translation": "\"If you want to break the signs of evil, you must chant it while gazing angrily at them.",
        "source": "T08n0244_002:0791a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲滅壞諸魔者，當持金剛杵，現大忿怒相持誦。",
        "translation": "\"If you want to destroy Māra, you must hold a vajra and recite it with a large, wrathful expression.",
        "source": "T08n0244_002:0791a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲作禁制者，當現忿怒相持誦，復以金剛杵打其方位。",
        "translation": "\"If you want to impose restraints, you will recite it in anger and strike it in its direction with the vajra.",
        "source": "T08n0244_002:0791a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲作諸離散者，當依微妙金剛尾提[寧*也]尊法。",
        "translation": "\"Those who want to do things that scatter should rely on the teaching of the subtle Vajra-vidyā [nin*ya].",
        "source": "T08n0244_002:0791b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲鉤召諸惡宿曜者，當現忿怒調伏相旋轉金剛杵。",
        "translation": "\"If you want to summon the celestial beings of bad fortune, you'll present the wrathful form and twirl the vajra in its revolving motion.",
        "source": "T08n0244_002:0791b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令他憎恚者，當以鐵末作護摩法。",
        "translation": "\"If you want to cause others to hate you, you'll use iron dust as a protective shield.",
        "source": "T08n0244_002:0791b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲發遣諸藥剎者，當依大笑尊法持誦。",
        "translation": "\"If you want to send away the Yakṣas, you'll recite it according to the teaching of the Great Laughing Honored One.",
        "source": "T08n0244_002:0791b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲降諸龍者，當以金剛杵打於地面持誦。",
        "translation": "\"If you want to subdue dragons, you'll beat the vajra to the ground with it and recite it.",
        "source": "T08n0244_002:0791b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲調伏諸天者，當依金剛儞波多尊法持誦。",
        "translation": "\"If you want to subdue the gods, you'll recite it according to the teaching of Vajrapratibhāta.",
        "source": "T08n0244_002:0791b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲鉤召諸天及降伏破壞者，當依降三界尊法持誦。",
        "translation": "\"If you want to summon the gods and subdue their destruction, you'll recite it according to the teaching of the honored one who subdues the three realms.",
        "source": "T08n0244_002:0791b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求毘沙門天王成就法者，當以手按毘沙門天像，而作忿怒相持誦。",
        "translation": "\"If you want to pursue the accomplishment of the Vaiśravaṇa gods, you should press your hand against the image of the Vaiśravaṇa gods, make angry faces, and recite it.",
        "source": "T08n0244_002:0791b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求增長天王成就法者，當依金剛補嚕沙法持誦。",
        "translation": "\"If you want to pursue the accomplishment of the Virūḍhaka Heavenly Kings, you should recite it according to the Vajrapārṣa Method.",
        "source": "T08n0244_002:0791b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就欲天者，當於欲天像前作忿怒相持誦。",
        "translation": "\"If you want to achieve the status of desire god, you should recite it in front of the image of the desire god as a wrathful expression.",
        "source": "T08n0244_002:0791b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就大梵天者，當用妙樂金剛印。",
        "translation": "\"If you want to accomplish the Heaven of Great Bliss, you'll use the adamantine seal of marvelous bliss.",
        "source": "T08n0244_002:0791b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就那羅延天者，當用金剛輪鏁印。",
        "translation": "\"If you want to achieve the Nārāyaṇa Heaven, you'll use the sign of the vajra wheel of reckoning.",
        "source": "T08n0244_002:0791b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就大自在天者，當用金剛戍羅鏁印。",
        "translation": "\"If he wants to achieve the Mahêśvara Heaven, he'll use the sign of the vajraśūla.",
        "source": "T08n0244_002:0791b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就諸魔怛哩眾者，當依金剛眾囉剎法。",
        "translation": "\"If he wants to accomplish the multitude of Mātṛ, he'll rely on the Vajraśrāvastī dharma.",
        "source": "T08n0244_002:0791b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破壞諸外道邪壇呪法等者，當依金剛大忿怒畔惹那尊法。",
        "translation": "\"If you want to disrupt the wrong altar spells and other teachings of non-Buddhists, you must rely on the vajra dhāraṇī of the great wrathful vajra.",
        "source": "T08n0244_002:0791b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲摧折一切山林乃至天祠者，當現忿怒明王而顧視之；若欲令復如故者，當依金剛忿怒明王法。",
        "translation": "\"If you want to break down all the mountains and forests or even the heavenly shrines, you must present the wrathful bright king and look at him, and if you want to make him return to his old self, you must rely on the Vajra wrathful bright king's teaching.",
        "source": "T08n0244_002:0791b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲壞滅諸魔者，當依金剛忿怒明王拳法。",
        "translation": "\"If you want to destroy Māra, you must rely on the Vajra-raging Radiant King's fists.",
        "source": "T08n0244_002:0791b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令生諸怖畏者，當依金剛忿怒明王法現大惡相。",
        "translation": "\"If you want to cause fears to arise, you must rely on the Vajra-raging Radiant King's method of showing great evil appearances.",
        "source": "T08n0244_002:0791b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲壞滅他軍者，當依金剛忿怒藥剎法。",
        "translation": "\"If you want to destroy the armies of others, you must rely on the Vajra-raging Yakṣa Method.",
        "source": "T08n0244_002:0791c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破散他軍者，當依金剛忿怒囉剎法。",
        "translation": "\"If you want to disperse another army, you must rely on the Vajra-raging Rāṣṭrapāla teachings.",
        "source": "T08n0244_002:0791c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破壞諸天者，當用釘諸天像；若成就天主者，亦依此法。",
        "translation": "\"If you want to destroy the gods, you must nail their images, and if you accomplish the lords of the gods, you must also rely on this teaching.",
        "source": "T08n0244_002:0791c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令三界驚怖者，當用金剛鉢囉羅印。",
        "translation": "\"If you want to terrify the three realms, you'll use the vajra-prāgbhāra seal.",
        "source": "T08n0244_002:0791c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲三界中勝者，當依金剛忿怒明王法。",
        "translation": "\"If you want to be victorious in the three realms, you'll rely on the Vajra wrathful luminous king teaching.",
        "source": "T08n0244_002:0791c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令三界作入寤、禁縛、敬愛者，當用金剛忿怒明王印。",
        "translation": "\"If you want to cause the three realms to be awakened, fettered, and adored, you must use the sign of the wrathful, luminous king of the vajras.",
        "source": "T08n0244_002:0791c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令三界作鉤召、敬愛成就者，當依大樂金剛忿怒明王法。」",
        "translation": "\"If you want to cause the three realms to become seduced, fettered, and adored, you must rely on the Dharma of the vajra wrathful luminous king of great bliss.\"",
        "source": "T08n0244_002:0791c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨諸煩惱三昧大儀軌分第四",
        "translation": "The Fourth Part of the Great Ritual Procedure for the Samādhi of Cleansing the Afflictions",
        "source": "T08n0244_002:0791c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊釋迦牟尼佛，復說一切法平等觀自在智印般若波羅蜜多法門。",
        "translation": "It was then that the Bhagavān, the Śākyamuni Buddha, again explained the prajñāpāramitā dharma-gate of the seal of the wisdom of equality in contemplation of all dharmas.",
        "source": "T08n0244_002:0791c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：「煩惱清淨故，諸垢亦清淨；一切垢清淨故，一切罪亦清淨；諸法清淨故，一切眾生亦清淨；一切智清淨故，般若波羅蜜多亦清淨。",
        "translation": "It said, \"Because the afflictions are purified, the defilements are also purified; because all defilements are purified, all sins are also purified; because the dharmas are purified, all sentient beings are also purified; and because all cognitions are purified, the perfection of wisdom is also purified.",
        "source": "T08n0244_002:0791c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人於此清淨法門，受持讀誦記念思惟，是人雖常處貪欲法中，離諸煩惱，譬如清淨蓮花不染諸垢，當速得證阿耨多羅三藐三菩提。」",
        "translation": "If someone retains, recites, memorizes, and contemplates this pure teaching, that person's constant presence in the midst of desireable things will be free of afflictions like a pure lotus flower that isn't stained by defilements, and they'll quickly realize unsurpassed, correct, and complete enlightenment.\"",
        "source": "T08n0244_002:0791c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時觀自在菩薩，聞釋迦牟尼佛說此真實理清淨法門已，即現微笑，說此觀照諸法無染一切清淨法門眾色蓮花心明，曰：「紇哩(二合、引)」說此心明時，出現一切如來，皆如觀自在相手持蓮花，咸依觀自在菩薩本曼拏羅儀安住。",
        "translation": "After hearing the Śākyamuni Buddha teach this pure dharma-gate of true principles, the Bodhisattva Avalokitêśvara then smiled and explained this pure dharma-gate of observing the undefiled nature of all things and the many colors of the lotus flower, saying, \"Udderī,\" and when he explained this mental clarity, all the tathāgatas appeared, all holding lotus flowers in their hands like Avalokitêśvara's form, and they all stood according to the Avalokitêśvara Bodhisattva's original maṇḍala ritual.",
        "source": "T08n0244_002:0791c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時觀自在菩薩，即入觀照諸法智自在印三摩地。",
        "translation": "The Avalokitêśvara Bodhisattva then entered the samādhi of the seal of mastery over the wisdom of observing and illuminating all dharmas.",
        "source": "T08n0244_002:0791c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，說此調伏一切世間曼拏羅法：「若人作此大曼拏羅成就法者，當於外曼拏羅中畫內曼拏羅，四方四隅列八尊位，依法具足。",
        "translation": "After emerging from that concentration, he explained this maṇḍala method for disciplining all the world: \"If someone creates this great maṇḍala accomplishment, they should draw an inner maṇḍala inside the outer maṇḍala, with eight honored stages arranged in the four directions and four corners, complete according to the rules.",
        "source": "T08n0244_002:0791c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其中間畫紅色蓮花，其花八葉，於其花上畫觀自在菩薩。",
        "translation": "In between, he would draw a red lotus flower with eight petals, and on top of that flower he would draw the Bodhisattva Avalokitêśvara.",
        "source": "T08n0244_002:0792a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於菩薩前畫大蓮色天，如天魔相，其色紅赤，手持蓮花、俱穌摩花并持弓箭。",
        "translation": "In front of the bodhisattva is painted a large lotus-colored celestial with the appearance of a celestial demon, red in color, holding a lotus flower, a kusuma flower, and a bow and arrow.",
        "source": "T08n0244_002:0792a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右側畫大蓮忿怒自在天，色相如大自在天。",
        "translation": "On the right side, there's a large lotus-flowered wrathful Avalokitêśvara god with the form and shape of a large Avalokitêśvara god.",
        "source": "T08n0244_002:0792a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其後面畫大蓮黑天，如那羅延天色相。",
        "translation": "Behind it is painted the large lotus Kālôdayin, with the color and shape of the Nārāyaṇa Heaven.",
        "source": "T08n0244_002:0792a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於左側畫大蓮娑婆主，如梵天王色相。",
        "translation": "On the left side, he's painted with the large lotus Sāvajit, whose form is like that of the Brahmakāyika gods.",
        "source": "T08n0244_002:0792a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東南隅畫大蓮持世天，如持世天色相。",
        "translation": "In the southeast corner, he's painted with the color and shape of the Mahā-Lotus Śrī Siṃdhvaja Heaven, resembling the color and shape of the Śrī Siṃdhvaja Heaven.",
        "source": "T08n0244_002:0792a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西南隅畫大蓮水天，如大海龍王色相。",
        "translation": "In the southwest corner, he's depicted with the color and shape of the ocean dragon king, the Mahā-Lotus Water God.",
        "source": "T08n0244_002:0792a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西北隅畫大蓮日天，如大日天色相。",
        "translation": "The northwest corner depicts the Mahā-Lotus Sun God, resembling the color and shape of the Mahāvairocana god.",
        "source": "T08n0244_002:0792a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東北隅畫大蓮風天，如風天色相。",
        "translation": "The northeast corner depicts the Mahā-Lotus Wind God, like the color and shape of the Wind God.",
        "source": "T08n0244_002:0792a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復外曼拏羅四隅，畫四天像，謂：紇哩(二合)、室哩(二合)、儗(引)、提(引)。",
        "translation": "Also, on the outer corners of the maṇḍala, there are four images of the gods Uruma, śrī, Śrī, Śubha, and Ti.",
        "source": "T08n0244_002:0792a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸天，皆以左手持蓮花，右手持本幖幟，於其四門各安幖幟。",
        "translation": "Each of these gods carries a lotus flower in his left hand and his own flag in his right hand, and they each place a flag at their four gates.",
        "source": "T08n0244_002:0792a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、悉帝哩尾屹囉賀，二者、薩哩嚩尾屹囉賀，三者、穌葛囉尾屹囉賀。",
        "translation": "1. Siddhârtha-vimala, 2. Sarivartha-vimala, and 3. Sugara-vimala.",
        "source": "T08n0244_002:0792a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、鉢訥摩尾屹囉賀。",
        "translation": "The fourth is the pāṇḍuma-vaiḍūrya.",
        "source": "T08n0244_002:0792a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是畫曼拏羅已，阿闍梨當令弟子著白衣，以淨帛覆面，即持妙花而結蓮花印，引入於曼拏羅中，令其弟子當至心鄭重以花散擲，花所墮處即是本尊。",
        "translation": "After thus drawing the maṇḍala, the ācārya should have his disciple put on white robes, cover his face with a pure silk, hold a wonderful flower, make the lotus-flower sign, introduce it into the maṇḍala, and have his disciple solemnly scatter the flower with all his heart, for where it falls is the original honored one.",
        "source": "T08n0244_002:0792a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得本尊已，依蓮花部灌頂之法，當作灌頂。",
        "translation": "After he obtains the original image, he then consecrates it according to the lotus-flower consecration method.",
        "source": "T08n0244_002:0792a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後誡其弟子曰：『汝觀諸法當如蓮花，諸染煩惱清淨如此。』」",
        "translation": "Then he instructs his disciple, 'Observe the things that are like lotus flowers, so that the defiled afflictions are purified.'\"",
        "source": "T08n0244_002:0792a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說伽陀曰：「譬如妙色蓮，　　處泥常清淨，　貪瞋癡本性，　　無染亦如是。",
        "translation": "He then said to the Gadhārā, \"It's like the lotus of marvelous color, which is always pure in the mud, and the nature of greed, anger, and delusion is undefiled and thus.",
        "source": "T08n0244_002:0792a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有一切法，　　應如是觀察，　諸法本清淨，　　當滅諸煩惱。",
        "translation": "All things that exist should be thus observed, and the intrinsic purity of those things will cease the afflictions.",
        "source": "T08n0244_002:0792a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常在諸三昧，　　成佛一切智，　證如是法已，　　是名觀自在。」",
        "translation": "He'll always be in the samādhis, become a buddha with omniscience, and realize that this is called observing sovereignty after realizing this teaching.\"",
        "source": "T08n0244_002:0792a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是伽陀已，又復告言：「從是已後汝身清淨，所求成就皆隨意願，乃至成佛。」",
        "translation": "After speaking thus, Gautama also told him, \"After this, your body will be purified, and whatever you seek to achieve will be done according to your wishes, up to the point of becoming a buddha.\"",
        "source": "T08n0244_002:0792a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是弟子欲成就智曼拏羅者，亦依[巾*((ㄇ@人)/登)]像法皆得成就。",
        "translation": "Thus, a disciple who wants to achieve the maṇḍala of wisdom will also achieve it based on the [towel*((śrāvaka@person)/dhāraṇī)] image method.",
        "source": "T08n0244_002:0792b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說：「未精熟求成就法者，若欲令悅樂一切人者，當加持蓮花八千遍。",
        "translation": "Again, he said, \"Those who have yet to perfect the accomplishment of the teaching should consecrate the lotus flower 8,000 times if they want to please all people.",
        "source": "T08n0244_002:0792b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲滅散諸惡者，當用大忿怒王蓮花印。",
        "translation": "\"If he wants to dissipate evil, he should use the lotus-flower seal of the great wrathful king.",
        "source": "T08n0244_002:0792b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令魔魅迷亂者，當用大蓮花嚩囉賀印。",
        "translation": "\"If you want to cause demons and evil spirits to be confused, you'll use the sign of the great lotus flower Varuha.",
        "source": "T08n0244_002:0792b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲淨諸煩惱者，當用大蓮花觀想印。",
        "translation": "\"If you want to purify the afflictions, you should use the mudrā of the great lotus flower meditation.",
        "source": "T08n0244_002:0792b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲降雨者，當畫龍形，行人坐其龍上，持誦一洛叉數。",
        "translation": "\"If you want to send rain, you'll draw a dragon shape, sit a practitioner on top of it, and recite the number of one lakṣa.",
        "source": "T08n0244_002:0792b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲去除冥暗者，當用大蓮花日光印。",
        "translation": "\"If you want to remove darkness, you'll use the great lotus sign of heliotrope.",
        "source": "T08n0244_002:0792b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲起風及止息者，當用蓮花摩嚕多印。」",
        "translation": "\"If you want to generate a breeze and still the wind, you'll use the lotus-flower marula tantra seal.\"",
        "source": "T08n0244_002:0792b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切寶灌頂大三昧儀軌分第五",
        "translation": "Yiqie baozhong dazanmei yigui fenbie",
        "source": "T08n0244_002:0792b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊釋迦牟尼佛，復說一切如來灌頂出生智藏般若波羅蜜多教：「若施灌頂者，獲證三界法王位；若施珍財者，獲滿一切願；若施妙法者，得諸法平等；若施飲膳者，得一切身口意快樂。」",
        "translation": "It was then that the Bhagavān, the Śākyamuni Buddha, again taught the prajñāpāramitā of the wisdom store that arises from the consecration of all tathāgatas, \"If you give a consecration, you'll realize the position of Dharma king of the three realms; if you give valuable possessions, you'll fulfill all your vows; if you give the wonderful Dharma, you'll attain the equality of all dharmas; and if you give a meal, you'll attain the happiness of all body, speech, and thought.\"",
        "source": "T08n0244_002:0792b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時虛空藏菩薩，聞佛說此真理法門已，現大笑容，於自頂上結寶金剛灌頂鬘印。",
        "translation": "After hearing the Buddha teach this true teaching, the Ākāśagarbha Bodhisattva then smiled broadly and placed the sign of the jeweled vajra consecration garland on his head.",
        "source": "T08n0244_002:0792b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結是印已，說此一切灌頂三昧寶心明，曰：「怛囕(二合、引)」說此心明時，出現一切灌頂義句等相。",
        "translation": "After he had made this seal, he spoke this precious mental clarification of the consecration of all things, saying, \"Taha (bina),\" and when he spoke this mental clarification, all the meanings of the consecration and other characteristics appeared.",
        "source": "T08n0244_002:0792b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是出已，依寶部曼拏羅儀，現於菩薩像各處本位。",
        "translation": "After thus speaking, they appeared in their respective positions in the bodhisattva's image according to the precious maṇḍala ritual.",
        "source": "T08n0244_002:0792b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時虛空藏菩薩，入一切灌頂寶金剛三摩地。",
        "translation": "At that point, the Ākāśagarbha Bodhisattva entered the adamantine absorption of the jewel of all consecrations.",
        "source": "T08n0244_002:0792b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，說圓滿一切願大摩尼寶三昧大曼拏羅：「若人成就此曼拏羅者，當依外曼拏羅法畫內曼拏羅，於其中間畫八角寶柱，如八曼拏羅相，寶鬘為嚴飾，寶金剛作圍，置種種莊嚴幢幡傘蓋等。",
        "translation": "After emerging from that concentration, he explained the great maṇi-jeweled samādhi maṇḍala that fulfills all vows, \"If someone has accomplished this maṇḍala, they must draw an inner maṇḍala according to the outer maṇḍala method, and within it they'll draw an eight-pronged jeweled pillar like the shape of an eight-pronged maṇḍala, adorned with jeweled garlands, surrounded by a jeweled vajra, and placed with various ornamental banners, streamers, umbrellas, and so forth.",
        "source": "T08n0244_002:0792b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後於曼拏羅中畫虛空藏菩薩，乘車駕馬，現大笑容，身深紅色，二手結灌頂印。",
        "translation": "Then, in the middle of the maṇḍala, he depicts the Ākāśagarbha Bodhisattva riding a chariot and riding a horse, smiling broadly, his body deep red, and his hands tied with the sign of consecration.",
        "source": "T08n0244_002:0792c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於菩薩前安諸如來及寶灌頂菩薩，頂戴寶冠；右側安持諸寶藏菩薩；於後面復安持法寶藏菩薩；左側安持諸飲膳菩薩；於其四隅安供養菩薩，寶蓋幢幡種種妙樂等。",
        "translation": "In front of the bodhisattva, he places the Tathāgata and the Jeweled Consecration Bodhisattva, wearing a jeweled crown on his head; to his right, he places the Jeweled Store Bodhisattva; to his rear, he places the Dharma Jeweled Store Bodhisattva; to his left, he places the Meals Serving Bodhisattva; and at the four corners of the maṇḍala, he places the Offerings Bodhisattva, with his jeweled canopy, banners, and flags of various kinds of marvelous joy.",
        "source": "T08n0244_002:0792c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於外曼拏羅四門四隅，依法安置閼伽瓶及灌頂幖幟供養等。",
        "translation": "At the four entrances and four corners of the outer maṇḍala, he placed Guṇabharman vases and consecration flags to make offerings in accordance with the Dharma.",
        "source": "T08n0244_002:0792c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是畫曼拏羅已，阿闍梨當結寶印，依法引弟子入曼拏羅，以寶灌頂法，授與灌頂及印相幖幟等。",
        "translation": "After thus drawing the maṇḍala, the ācārya then sets a precious seal, guides the disciple into the maṇḍala according to the rules, and gives him the consecration and the seal logo and board with the method of consecration with treasures.",
        "source": "T08n0244_002:0792c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是已後，所求成就皆得圓滿。",
        "translation": "From then on, all the things he seeks to achieve will be accomplished.",
        "source": "T08n0244_002:0792c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如上所說引弟子入曼拏羅法儀，其寶金剛部中所作成就法亦應如是。",
        "translation": "According to the above-explained ritual for guiding a disciple into a maṇḍala, this should also be the case for the accomplishment of the Jeweled Vajra School.",
        "source": "T08n0244_002:0792c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若未精熟法，欲受諸灌頂者，當授寶金剛灌頂印。",
        "translation": "\"If someone who has yet to perfect the Dharma wants to receive various consecrations, they'll be given the precious vajra consecration seal.",
        "source": "T08n0244_002:0792c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲圓滿意願者，當於日出時持誦。",
        "translation": "\"If you want to fulfill the vows of satisfaction, you must recite them at sunrise.",
        "source": "T08n0244_002:0792c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲了諸法義智者，當觀諸法清淨皆如虛空而持誦之。",
        "translation": "\"If you want to understand the meanings of things, you should observe that the things that are pure are like space and recite them.",
        "source": "T08n0244_002:0792c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求種種上味者，當想本身如虛空，日誦千遍。",
        "translation": "\"If you want to pursue various superior flavors, you should contemplate yourself as space and recite it a thousand times a day.",
        "source": "T08n0244_002:0792c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲圓滿大願者，當執寶蓋持誦百千遍。",
        "translation": "\"If you want to fulfill the great vow, you'll hold onto the jeweled canopy and recite it a hundred thousand times.",
        "source": "T08n0244_002:0792c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求最勝者，當用寶幢金剛印。",
        "translation": "\"If you want to pursue the most excellent, you'll use the adamantine seal of the jeweled banner.",
        "source": "T08n0244_002:0792c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求大名稱者，日常持誦。」",
        "translation": "\"If you want to seek the great name, recite it every day.\"",
        "source": "T08n0244_002:0792c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切拳印三昧大儀軌分第六",
        "translation": "The Sixth Part of the Great Ritual Procedure for the Samādhi of the Seal of the Fists",
        "source": "T08n0244_002:0792c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼佛，得諸佛智印，持諸佛智拳，是諸佛究竟者，復說一切如來智印安想金剛般若波羅蜜多教。",
        "translation": "At the time, Śākyamuni Buddha attained the seal of wisdom of the buddhas and held the fist of wisdom of the buddhas, which is the ultimate Buddha, and then he taught the adamantine wisdom perfection of conceptualization because of the seal of wisdom of all tathāgatas.",
        "source": "T08n0244_002:0792c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：「攝一切如來身印故，即是一切如來身；攝一切如來語印故，即得一切法自在；攝一切如來心印故，即得一切三摩地；攝一切如來金剛印故，即得金剛三業最上成就。",
        "translation": "It says, \"It's because he collects the sign of the body of all the tathāgatas that he is the body of all the tathāgatas, because he collects the sign of the speech of all the tathāgatas that he attains mastery over all things, because he collects the sign of the mind of all the tathāgatas that he attains all samādhis, and because he collects the sign of the vajra of all the tathāgatas that he attains the supreme accomplishment of the three adamantine activities.",
        "source": "T08n0244_002:0792c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人於此法門，聽聞受持記念思惟，及為他宣說者，是人得成就一切法，通達一切智，圓滿一切事，乃至金剛三業得最上成就，速證阿耨多羅三藐三菩提。」",
        "translation": "\"If someone hears, retains, memorizes, contemplates, and teaches this teaching for others, that person will attain accomplishment of all things, penetrate all cognitions, and fulfill all tasks, up to the supreme accomplishment of the three adamantine activities, and quickly realize unsurpassed, correct, and complete enlightenment.\"",
        "source": "T08n0244_002:0793a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛拳菩薩，聞佛說此攝大三昧金剛印真實法已，即現歡喜相，即說一切堅固金剛印成就三昧心明，曰：「惡」說此心明時，一切如來及諸眾會，化如金剛薩埵，皆結金剛薩埵印，以諸佛如來最上成就印印之，依金剛拳菩薩金剛三業及大印三昧等，依此曼拏羅安住。",
        "translation": "After hearing the Buddha teach this true teaching of the vajra seal of the great samādhi, the Vajra-fist Bodhisattva appeared joyous and explained the accomplishment of the vajra seal of all things, saying, \"Awesome!\" When he explained this mental clarification, all the tathāgatas and congregations that were transformed into vajrasattvas all formed the vajra-sattva seal, sealed it with the sign of the supreme accomplishment of the buddha-tathāgatas, and relied on the Vajra-fist Bodhisattva's vajra three actions and great seal of samādhi to abide in this maṇḍala.",
        "source": "T08n0244_002:0793a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛拳菩薩入一切如來智印三摩地。",
        "translation": "At that point, the Vajragarbha Bodhisattva entered the samādhi of the seal of wisdom of all tathāgatas.",
        "source": "T08n0244_002:0793a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，說此一切印金剛三昧大曼拏羅法：「若人建此曼拏羅者，依前曼拏羅儀法，畫外曼拏羅，於此中間畫八輻輪。",
        "translation": "After emerging from that concentration, he explained the teaching of this great maṇḍala of the vajra samādhi with all seals, \"Suppose someone builds this maṇḍala and draws an outer maṇḍala according to the previous maṇḍala's ritual, and then they draw an eight-spoked wheel in the middle of it.",
        "source": "T08n0244_002:0793a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其輪中分列八位，於中位安金剛拳菩薩，現歡喜相，結三昧拳印。",
        "translation": "In the middle of the eight-spoked wheel, he places the Vajraghaṇṭā bodhisattva in the middle position, shows his joyful face, and makes the seal of the samādhi fist.",
        "source": "T08n0244_002:0793a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此菩薩前，安最上金剛身菩薩，手持金剛杵；於金剛拳菩薩右，安金剛舌菩薩；於金剛拳菩薩後面，安金剛定菩薩，手持金剛杵；於金剛拳菩薩左，安最上金剛菩薩，持金剛杵。",
        "translation": "In front of this bodhisattva, he placed the Supreme Vajrapāṇi Bodhisattva holding a vajra; to the right of the Vajrapāṇi Bodhisattva, he placed the Vajra Tongue Bodhisattva; behind the Vajrapāṇi Bodhisattva, he placed the Vajra Meditation Bodhisattva holding a vajra; and to the left of the Vajrapāṇi Bodhisattva, he placed the Supreme Vajra Bodhisattva holding a vajra.",
        "source": "T08n0244_002:0793a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於曼拏羅東南隅安印拳菩薩；西南隅安義拳菩薩；西北隅安智拳菩薩；東北隅安羯磨拳菩薩。",
        "translation": "At the southeast corner of the maṇḍala, he placed the Fist of Seal bodhisattva; at the southwest corner, he placed the Fist of Meaning bodhisattva; at the northwest corner, he placed the Fist of Wisdom bodhisattva; and at the northeast corner, he placed the Fist of Karma bodhisattva.",
        "source": "T08n0244_002:0793a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩皆結本印及持自幖幟。",
        "translation": "Each of these bodhisattvas sets his original seal and carries his own flag.",
        "source": "T08n0244_002:0793a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於四門安金剛香等四菩薩。",
        "translation": "At the four entrances, they also placed the four bodhisattvas, including the Vajraśekhara.",
        "source": "T08n0244_002:0793a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是畫曼拏羅已，設復有人未成就此法者，入此中已得具一切印成就阿闍梨。",
        "translation": "After thus drawing the maṇḍala, suppose someone who hasn't yet accomplished this teaching enters it and attains an accomplished preceptor with all seals.",
        "source": "T08n0244_002:0793a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是已後，決定得一切法成就，速證阿耨多羅三藐三菩提。",
        "translation": "From there, he'll surely attain the accomplishment of all things and quickly realize unsurpassed, correct enlightenment.",
        "source": "T08n0244_002:0793a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若阿闍梨當傳授弟子者，即結金剛拳印，引弟子入曼拏羅中，以金剛灌頂法當授灌頂，授灌頂已，為說伽陀曰：「『金剛身口意，　　當觀如影像，　　諸印亦如是，　　此名三昧誓。』」",
        "translation": "If the ācārya should teach the disciple, he would then make the vajra fist seal, lead the disciple into the maṇḍala, bestow a consecration using the vajra consecration method, and after bestowing the consecration, he would say for the gāthā, \"Vajra's body, speech, and mind should be observed as images, and so should the seals be; this is called the samādhi vow.\"",
        "source": "T08n0244_002:0793a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如上所說弟子入曼拏羅儀，所有此部印相及成就曼拏羅法，皆亦如是。",
        "translation": "As explained above, the disciple's rituals for entering the maṇḍala, all the signs of this school, and the accomplishment of the maṇḍala were likewise.",
        "source": "T08n0244_002:0793b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復為未精熟者說成就法：「若欲成就諸印相者，當結金剛拳安心持誦。",
        "translation": "Again, he explained the accomplishment method for those who hadn't yet perfected it, \"Those who want to accomplish the signs should wrap their vajra fists around it and recite it without worrying.",
        "source": "T08n0244_002:0793b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復欲成一切印者，當結大金剛拳印。",
        "translation": "\"Also, someone who wants to achieve all signs should make the great vajra fist sign.",
        "source": "T08n0244_002:0793b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲得一切眾生愛敬者，當結金剛大樂拳印。",
        "translation": "\"If you want to win the respect of all sentient beings, you must make the mudrā of the great adamantine fist.",
        "source": "T08n0244_002:0793b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲降諸眾生者，當結金剛大拳印。",
        "translation": "\"If you want to subdue all sentient beings, you'll make the great adamantine fist seal.",
        "source": "T08n0244_002:0793b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就一切三昧者，當結金剛吒枳印。",
        "translation": "\"If you want to achieve all samādhis, you'll make the adamantine fist-mudrā.",
        "source": "T08n0244_002:0793b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲禁縛諸惡者，當結金剛縛印。",
        "translation": "\"If you want to bind all evil, you'll make the sign of the vajra fetter.",
        "source": "T08n0244_002:0793b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲禁縛一切者，當結金剛索印。",
        "translation": "\"If you want to bind them all, you'll wrap the sign of the vajra noose.",
        "source": "T08n0244_002:0793b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令昝婆那者，當結金剛隸波拳印。",
        "translation": "\"If you want to bind Zambana, you'll wrap the sign of the vajra lappa fist.",
        "source": "T08n0244_002:0793b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令卑拏那者，當結金剛縛拳印。",
        "translation": "\"If you want to cause Peṇḍana, you'll make the sign of the vajra fist.",
        "source": "T08n0244_002:0793b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲滅壞諸惡者，當結金剛忿怒拳印。",
        "translation": "\"If you want to destroy the evils, you'll make the fist seal of the vajra wrath.",
        "source": "T08n0244_002:0793b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲跋叉那者，當結金剛藥剎拳印。",
        "translation": "\"If you want to vakṣaṇa, you'll make the fist seal of the vajra yakṣa.",
        "source": "T08n0244_002:0793b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破壞諸魔者，當結金剛[寧*吉]卑拏那拳印。",
        "translation": "\"If you want to destroy the demons, you'll make the fist seal of the vajra [ning*ji] peña.",
        "source": "T08n0244_002:0793b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲開通一切者，當用金剛鏁拳印。",
        "translation": "\"If you want to open up all things, you'll use the fist seal of the vajra healing fist.",
        "source": "T08n0244_002:0793b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令一切入寤者，當結金剛阿吠舍拳印。",
        "translation": "\"If you want to awaken all [sentient beings], you'll make the fist seal of the Vajra-avaiśa.",
        "source": "T08n0244_002:0793b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令作[寧*吉]哩爹者，當結金剛[寧*吉]哩爹拳印。",
        "translation": "\"If you want to make [ningyi]riddhi, you'll make the fist seal of the vajra [ningyi]riddhi.",
        "source": "T08n0244_002:0793b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令一切語言者，當結金剛語拳印。",
        "translation": "\"If you want to cause all languages to be spoken, you'll make the fist seal of the vajra tongue.",
        "source": "T08n0244_002:0793b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲禁伏一切者，當結金剛定拳印。",
        "translation": "\"If you want to restrain all [sentient beings], you'll make the fist seal of vajra concentration.",
        "source": "T08n0244_002:0793b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令他軍母枳羯囉那者，當結大金剛語拳印。",
        "translation": "\"If you want to cause another army's mother to khikarṇa, you'll make the fist seal of the great adamantine speech.",
        "source": "T08n0244_002:0793b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲解諸邪印者，當結金剛解脫拳印。",
        "translation": "\"If you want to release the signs of wrongdoing, you'll make the fist seal of vajra liberation.",
        "source": "T08n0244_002:0793b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲解諸拏吉儞印者，當結降三界金剛拳印。",
        "translation": "\"If you want to release the signs of the nakṣatra, you'll make the fist seal of the vajra that subdues the three realms.",
        "source": "T08n0244_002:0793b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破諸惡印者，亦結降三界金剛拳印。",
        "translation": "\"If you want to break the signs of evil, you'll also make the adamantine fist-mudra of subduing the three realms.",
        "source": "T08n0244_002:0793c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲禁制諸印者，當結金剛散提拳印。",
        "translation": "\"If you want to restrain the signs, you'll make the adamantine fist seal.",
        "source": "T08n0244_002:0793c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令一切印堅固如金剛者，當結金剛拳印。",
        "translation": "\"If you want to make all the signs as strong as adamant, you'll make the adamantine fist seal.",
        "source": "T08n0244_002:0793c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令印一切者，當結金剛摩怛哩拳印。",
        "translation": "\"If you want to make all signs strong, you should make the fist seal of the vajra maṇḍala.",
        "source": "T08n0244_002:0793c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲摧破諸魔者，當結妙金剛拳印。",
        "translation": "\"If you want to destroy Māra, you'll make the subtle adamantine fist seal.",
        "source": "T08n0244_002:0793c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破諸惡者，當結大惡忿怒金剛拳印。",
        "translation": "\"If you want to destroy evil, you'll make the vajra fist seal of great wrath.",
        "source": "T08n0244_002:0793c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲入水行住者，當結金剛禁拳印。",
        "translation": "\"If you want to stand in the water, you'll make the fist seal of the vajra noose.",
        "source": "T08n0244_002:0793c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲現種種色像者，當結眾羯磨金剛拳印。",
        "translation": "\"If he wants to show various forms, he'll make the vajra fist seal of numerous karmas.",
        "source": "T08n0244_002:0793c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求隱身法者，當結不可見金剛拳印。",
        "translation": "\"If he wants to pursue the teaching of invisibility, he'll make the adamantine fist-mudra seal of invisibility.",
        "source": "T08n0244_002:0793c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成一切行住所作事者，當結虛空金剛拳印。",
        "translation": "\"If he wants to perform all the tasks of a practitioner, he'll make the adamantine fist seal of space.",
        "source": "T08n0244_002:0793c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲騰空自在者，當結金剛縛拳印。",
        "translation": "\"If he wants to rise into the sky with unimpeded freedom, he'll make the fist seal of the vajra fist.",
        "source": "T08n0244_002:0793c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就持明天者，當結金剛劍拳印。",
        "translation": "\"If you want to accomplish the task of holding the sky, you must make the fist seal of the vajra sword.",
        "source": "T08n0244_002:0793c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就諸如來供養者，當結金剛羯磨拳印。",
        "translation": "\"If he wants to make offerings to the tathāgatas, he'll make the fist seal of the vajra karma.",
        "source": "T08n0244_002:0793c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲通達一切智者，當結金剛智拳印。",
        "translation": "\"If you want to penetrate omniscience, you'll make the fist seal of the adamantine fist of wisdom.",
        "source": "T08n0244_002:0793c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成一切義者，當結金剛義拳印。",
        "translation": "\"If you want to achieve omniscience, you'll make the fist seal of the adamantine doctrine.",
        "source": "T08n0244_002:0793c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求成一切印主者，當結金剛拳印。",
        "translation": "\"If you want to become the master of all signs, you'll wield the fist seal of vajra.",
        "source": "T08n0244_002:0793c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就一切事者，當結諸金剛拳印。",
        "translation": "\"If you want to accomplish all tasks, you must make the fist seal of the vajras.",
        "source": "T08n0244_002:0793c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就一切曼拏羅者，當結金剛手拳印。",
        "translation": "\"If you want to accomplish all maṇḍalas, you must make the fist seal of the vajra hand.",
        "source": "T08n0244_002:0793c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲令說三世事者，當結金剛舌拳印。",
        "translation": "\"If you want to cause someone to teach the deeds of the three times, you must make the fist seal of the vajra tongue.",
        "source": "T08n0244_002:0793c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就金剛手者，當結金剛高舉印。",
        "translation": "\"If you want to achieve the vajra hand, you must make the sign of the vajra exaltation.",
        "source": "T08n0244_002:0793c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲求成就佛者，當結諸佛金剛拳印。」",
        "translation": "\"If you want to achieve Buddhahood, you must make the fist seal of the vajra of the buddhas.\"",
        "source": "T08n0244_002:0793c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛字輪三昧大儀軌分第七",
        "translation": "The Seventh Part of the Great Ritual Procedure for the Vajra Wheel of Samādhi",
        "source": "T08n0244_002:0793c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼佛，復說諸法無性轉字輪般若波羅蜜多教。",
        "translation": "It was then that Śākyamuni Buddha again taught the prajñāpāramitā teaching that states, \"It's because all things are empty of self-nature that they have form, and it's because of their formlessness that all things arise.",
        "source": "T08n0244_002:0793c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：「諸法空無自性故，諸法無相；以無相故，生一切法。",
        "translation": "It was called, \"It's because all things are empty and lack self-nature that they lack characteristics, and it's because they lack characteristics that all things arise.",
        "source": "T08n0244_002:0793c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法無願故，從無願生一切法。",
        "translation": "It's because the dharmas lack desire that all dharmas arise from the lack of desire.",
        "source": "T08n0244_002:0793c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法自性清淨故，般若波羅蜜多清淨。」",
        "translation": "Because the own-natures of dharmas are purified, the perfection of wisdom is purified.\"",
        "source": "T08n0244_002:0794a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙吉祥菩薩，聞佛說此真理法門已，即現笑容，以智慧劍表示諸佛，說此最上般若波羅蜜多心明，曰：「阿」說此心明時，一切如來皆悉雲集，依前曼拏羅儀安住。",
        "translation": "It was then that the Marvelous Auspicious Bodhisattva, after hearing the Buddha teach this true teaching, immediately smiled, indicated the buddhas with his sword of wisdom, and spoke this supreme mental clarity of prajñāpāramitā, saying, \"Ah!\" When he spoke this mental clarity, all the tathāgatas gathered in clouds and stayed in their former mannalas according to their rituals.",
        "source": "T08n0244_002:0794a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙吉祥菩薩，入一切法自性無性劍三摩地。",
        "translation": "At that point, the Marvelous Auspicious Triumph Bodhisattva entered the samādhi of the sword of the self-nature and non-nature of all dharmas.",
        "source": "T08n0244_002:0794a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，說轉字輪三昧曼拏羅法：「若建此曼拏羅者，當於外曼拏羅中，依法畫八輻輪，於此輪圍中，次第書心明。",
        "translation": "After emerging from that concentration, he explained the teaching of the turning-syllable samādhi maṇḍala, \"If you were to build this maṇḍala, you would draw an eight-spoked wheel on the outside of the maṇḍala according to the rules, and within the circumference of that wheel, you would write the mental luminosity in order.",
        "source": "T08n0244_002:0794a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後四方四隅分列八位，於其中位安妙吉祥菩薩，如童子相，身色瑩淨猶如虛空，有其四臂，以智慧劍作表示法，光明普照。",
        "translation": "At the back, there are eight positions in the four directions and four corners, and in one of those positions he places the Marvelous Auspiciousness Bodhisattva, who looks like a child, has a body as pure as space, has four arms, and uses the sword of wisdom to express the Dharma and shines brightly.",
        "source": "T08n0244_002:0794a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於菩薩外安諸佛如來，四隅依法安四般若波羅蜜多經，四門安四幖幟，謂劍、爍吉帝寶、鉢、經。",
        "translation": "Outside the bodhisattva are placed the buddha-tathāgatas, at the four corners are placed the four prajñāpāramitā sūtras according to the rules, and at the four entrances are placed the four corrugated boards, which are the sword, the Śakra-devānāminindra, the bowl, and the sūtra.",
        "source": "T08n0244_002:0794a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後阿闍梨結劍印或經印，依法引弟子入曼拏羅中，授與智劍而作灌頂，作灌頂已，為說法誓頌曰：「『汝當受智劍，　　等般若真理，　　觀佛如虛空，　　所表示速成。",
        "translation": "The ācārya then makes the sign for the sword or the sign for the sūtra, leads the disciple into the maṇḍala according to the rules, gives him the sword of wisdom, and makes a consecration. After making the consecration, he preaches a verse of the Dharma vow, saying, 'You will accept the sword of wisdom, equal in prajñā truth, observe that the Buddha is like space, and that what's expressed will quickly come true.",
        "source": "T08n0244_002:0794a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　護持於佛法，　　廣度諸眾生，　　以劍斷業障，　　令永盡無餘。』」",
        "translation": "Maintain the Buddha's teaching, extensively save sentient beings, and use the sword to end the karmic hindrances so that they are permanently extinguished without remainder.'\"",
        "source": "T08n0244_002:0794a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「說此頌已，又復告言：『由是妙法，令汝成就般若波羅蜜多，速證阿耨多羅三藐三菩提。』",
        "translation": "\"After speaking this verse, he also told them, 'This wonderful teaching will enable you to achieve the perfection of wisdom and quickly realize unsurpassed, correct enlightenment.'",
        "source": "T08n0244_002:0794a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲成就法曼拏羅者，亦如前儀。」",
        "translation": "\"If you want to achieve the maṇḍala of the teaching, follow the preceding instructions.\"",
        "source": "T08n0244_002:0794a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說成就法：「若欲證空三摩地者，當觀諸法如虛空故。",
        "translation": "It also explains the accomplishment method, \"If you want to realize the samādhi of emptiness, you should observe that all dharmas are like space.",
        "source": "T08n0244_002:0794a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲證無相三摩地者，當觀諸法皆無相故。",
        "translation": "\"If you want to realize the signless samādhi, you should observe that all things are signless.",
        "source": "T08n0244_002:0794a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲證無願三摩地者，當觀諸法皆無願故。",
        "translation": "\"If you want to realize the concentration of wishlessness samādhi, you should observe that all things are wishless.",
        "source": "T08n0244_002:0794b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲證自性清淨智法者，當觀想般若波羅蜜多理趣故。",
        "translation": "\"If someone wants to realize the cognition of the self-nature of purity, they should contemplate the principle and objective of the perfection of wisdom.",
        "source": "T08n0244_002:0794b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲斷一切煩惱者，當觀想正法故。",
        "translation": "\"If you want to end all afflictions, you should contemplate the right teaching.",
        "source": "T08n0244_002:0794b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲得一切文字真實智者，當觀想無性法故。",
        "translation": "\"If you want to attain the true knowledge of all words, you should contemplate the natureless dharma.",
        "source": "T08n0244_002:0794b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲於一切處不著文字觀法身者，當依摩字等自性，觀想於空故。",
        "translation": "\"If you want to contemplate the Dharma body in all places without attaching to words, you should contemplate it in emptiness based on the own-nature of such words as mo.",
        "source": "T08n0244_002:0794b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲證諸佛菩提者，當結金剛劍印。」",
        "translation": "\"If you want to realize the buddhas' enlightenment, you must make the vajra-sword seal.\"",
        "source": "T08n0244_002:0794b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切曼拏羅金剛輪三昧大儀軌分第八爾時釋迦牟尼佛，復說攝一切如來輪入大輪中般若波羅蜜多教。",
        "translation": "The Eighth Portion of the Great Ritual Procedure for the Vajra Wheel Samadhi of All Mantras Then, Śākyamuni Buddha again taught the prajñāpāramitā teaching of gathering all the tathāgatas' wheels into the great wheel.",
        "source": "T08n0244_002:0794b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：「入金剛平等故，是即入一切如來輪；入義平等故，是即入大菩薩輪；入法平等故，是即入妙法輪；入一切平等故，是即入一切輪。」",
        "translation": "It was called, \"Entering the vajra wheel equally means entering the wheel of all tathāgatas; entering the meaning equally means entering the wheel of great bodhisattvas; entering the teaching equally means entering the wheel of the wonderful Dharma; entering all equally means entering the wheel of all things.\"",
        "source": "T08n0244_002:0794b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時同心生轉法輪菩薩摩訶薩，聞佛說此真理法門已，即現笑容，而說轉金剛輪入一切金剛三昧心明，曰：「吽(引)」說此心明時，所有一切如來，及三界一切有情，皆悉雲集曼拏羅中。",
        "translation": "After hearing the Buddha teach this method of truth, the concentric birth turning bodhisattva Mahāsattva then smiled and spoke the mental clarification of turning the vajra wheel into the vajra samādhi of all things, saying, \"Un (citation needed),\" and when he spoke this mental clarification, all the tathāgatas and all sentient beings in the three realms gathered in clouds in the maṇḍala.",
        "source": "T08n0244_002:0794b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復從菩薩心，出生一切曼拏羅三昧。",
        "translation": "Also, from the bodhisattvas' minds, all maṇḍala samādhis arise.",
        "source": "T08n0244_002:0794b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸佛菩薩依法安住。",
        "translation": "The buddhas and bodhisattvas then abide in accordance with the Dharma.",
        "source": "T08n0244_002:0794b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時同心生轉法輪菩薩，入一切輪印三摩地。",
        "translation": "At that point, the concentric births of the bodhisattvas who turn the wheel of the Dharma enter the samādhi of the sign of the wheel of all things.",
        "source": "T08n0244_002:0794b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，說此入一切三昧輪大曼拏羅法：「建是曼拏羅者，當於外曼拏羅中畫金剛輪，於其輪中畫同心生轉法輪菩薩，所有諸佛如來及金剛手等諸菩薩眾，亦依前曼拏羅儀畫。",
        "translation": "After emerging from that concentration, he explained the teaching of this great maṇḍala of entering the wheel of all concentrations, \"Suppose you build this maṇḍala and draw a vajra wheel on the inside of the outer maṇḍala, and within that wheel you draw the bodhisattva turning the Dharma wheel with one accord, and all the buddha-tathāgatas and vajrapāṇi and other bodhisattvas are also drawn according to the rituals of the previous maṇḍala.",
        "source": "T08n0244_002:0794b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其曼拏羅四隅，畫金剛部四大菩薩，謂：金剛薩埵菩薩、金剛忿怒明王菩薩、觀自在菩薩、虛空藏菩薩。",
        "translation": "On the four corners of the maṇḍala, there are four major bodhisattvas of the Vajra group painted on them, namely, Vajrasattva Bodhisattva, Vajra-raging Radiant King Bodhisattva, Avalokitêśvara Bodhisattva, and Ākāśagarbha Bodhisattva.",
        "source": "T08n0244_002:0794b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於四門畫四幖幟。",
        "translation": "On the four sides of the maṇḍala, he paints four corrugated boards.",
        "source": "T08n0244_002:0794c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是畫曼拏羅已，然後阿闍梨依法結金剛輪印，引弟子入曼拏羅，授以金剛輪令受灌頂，傳與四種曼拏羅及本部所有三昧等法。",
        "translation": "After thus drawing the maṇḍala, the preceptor then seals the maṇḍala with the vajra wheel seal according to the rules, leads the disciple into the maṇḍala, gives him the vajra wheel, makes him receive the consecration, and transmits the four kinds of maṇḍalas and all the samādhis and other teachings of this school.",
        "source": "T08n0244_002:0794c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子儀法既爾，金剛輪曼拏羅所作成就亦應如是。」",
        "translation": "Once the disciple has performed the rituals, the accomplishment of the vajra-wheel maṇḍala should be likewise.\"",
        "source": "T08n0244_002:0794c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說成就法：「欲入一切曼拏羅者，當結金剛輪印安於面門。",
        "translation": "He also explained the accomplishment teaching: \"Those who want to enter all maṇḍalas should place the vajra-wheel mudrā at the entrance of their faces.",
        "source": "T08n0244_002:0794c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲入大曼拏羅者，當結大輪印。",
        "translation": "\"If you want to enter a great maṇḍala, you must make the sign of the great wheel.",
        "source": "T08n0244_002:0794c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲入諸印曼拏羅者，當結一切如來金剛印。",
        "translation": "\"If you want to enter one of the seal maṇḍalas, you must make the vajra mudrā of all the tathāgatas.",
        "source": "T08n0244_002:0794c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲入三昧曼拏羅者，當結大三昧輪印。",
        "translation": "\"If you want to enter the samādhi maṇḍala, you must make the sign of the great samādhi wheel.",
        "source": "T08n0244_002:0794c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲入羯磨曼拏羅者，當結諸金剛輪印。",
        "translation": "\"If you want to enter the karma maṇḍala, you'll make the sign of the vajra wheels.",
        "source": "T08n0244_002:0794c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復作敬愛法，降伏法，印法，破壞法，入一切處法，供養法，調伏諸惡法等，皆結八大菩薩印，或結輪印。」",
        "translation": "\"Furthermore, they'll make eight major bodhisattva signs or wheel signs for the methods of veneration, subjugation, sealing, destruction, entry into all places, making offerings, and disciplining bad states.\"",
        "source": "T08n0244_002:0794c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾金剛三昧大儀軌分第九",
        "translation": "The Great Ritual Procedure for the Vajrasamādhi of the Crowds (Part IX)",
        "source": "T08n0244_002:0794c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼佛，復說最上供養般若波羅蜜多教。",
        "translation": "At the time, Śākyamuni Buddha again explained the teaching of the supreme perfection of offerings.",
        "source": "T08n0244_002:0794c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：「發生菩提心故，是即一切如來廣大供養；救度一切眾生界故，是即一切如來廣大供養；攝一切法故，是即一切如來廣大供養。",
        "translation": "It was called, \"This is a vast offering to all tathāgatas because the mind of enlightenment arises, this is a vast offering to all tathāgatas because it saves all sentient beings and realms, and this is a vast offering to all tathāgatas because it collects all dharmas.",
        "source": "T08n0244_002:0794c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人於般若波羅蜜多教，書持讀誦記念思惟者，是即一切如來廣大供養。」",
        "translation": "If someone writes, retains, recites, memorizes, and contemplates the teachings of the perfection of wisdom, this is a vast offering to all the tathāgatas.\"",
        "source": "T08n0244_002:0794c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時誐誐那巘惹菩薩，聞佛說此真實法門已，即現微笑，說此一切羯磨不空三昧心明，曰：「唵(引)」說此心明時，所有一切供養遍滿虛空界，復從空中化菩薩相，還於誐誐那巘惹菩薩前，依曼拏羅而住。",
        "translation": "After hearing the Buddha teach this true dharma-gate, the bodhisattva Gaṇḍanāmajāta then smiled and spoke this mental clarification of the nonempty samādhi of all karmas, saying, \"Om,\" and when he spoke this mental clarification, all the offerings that were made to him pervaded the realm of space and again transformed into the bodhisattva's form from the sky, returned to Gaṇḍanāmajāta, and stood based on a maṇḍala.",
        "source": "T08n0244_002:0794c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時誐誐那巘惹菩薩，入一切供養安想三摩地。",
        "translation": "At that point, the bodhisattva Gaṇḍanāmajāta entered the samādhi of all offerings and peaceful thoughts.",
        "source": "T08n0244_002:0795a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，即說最上羯磨金剛不空三昧曼拏羅：「作是法者，當於外曼拏羅中間畫八角寶柱，於此中間畫誐誐那巘惹菩薩，身如月色，現微笑容，手持器仗。",
        "translation": "After emerging from that concentration, he then explained the supreme karma-vajra nonempty samādhi maṇḍala, \"According to this teaching, you must draw an eight-pronged jeweled pillar in the middle of the outer maṇḍala, and in the middle of that, you must draw the bodhisattva Gaṅgārajāta, whose body is the color of the moon, who has a smiling face, and who is holding a weapon.",
        "source": "T08n0244_002:0795a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復依法畫諸菩薩，謂：金剛手菩薩、觀自在菩薩等八大菩薩，各具本相，印法具足。",
        "translation": "\"Again, according to the teaching, you should paint the bodhisattvas, namely, the Vajrapāṇi Bodhisattva, the Bodhisattva of Avalokitêśvara, and eight other great bodhisattvas, each with their own characteristics and complete with the seal of the Dharma.",
        "source": "T08n0244_002:0795a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於四隅畫四供養菩薩，四門畫四幖幟及種種寶具。",
        "translation": "On the four sides, he also drew the four bodhisattvas making offerings, and on the four entrances, he drew the four corbels and various jewelry implements.",
        "source": "T08n0244_002:0795a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是畫已，阿闍梨當結羯磨金剛印，依法引弟子入曼拏羅中，以眾羯磨金剛灌頂法，當授灌頂。",
        "translation": "After such a drawing, the preceptor then puts on the vajra seal of karma, leads the disciple into the maṇḍala according to the rules, and gives him the consecration using the vajra consecration method of karma.",
        "source": "T08n0244_002:0795a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "授灌頂已，作四種供養：一者、身業禮拜；二者、語業稱讚真實妙理；三者、意業觀想法界之內皆成供養；四者、手結金剛印。",
        "translation": "After conferring the consecration, he makes four kinds of offerings: 1) physical action of veneration; 2) verbal action of praising the true and marvelous principle; 3) mental action of observing the inner realm of ideas as an offering; and 4) hand-tied vajra mudrā.",
        "source": "T08n0244_002:0795a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名弟子入羯磨曼拏羅儀軌。」",
        "translation": "This is called the disciple's ritual for entering the karma maṇḍala.\"",
        "source": "T08n0244_002:0795a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說成就法：「若欲以菩提心供養者，當觀想心金剛故。",
        "translation": "He also explains the accomplishment of the teaching, \"If you want to make offerings with the mind of enlightenment, you must contemplate the mind as adamantine.",
        "source": "T08n0244_002:0795a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲以三摩地供養者，當觀想諸法清淨故。",
        "translation": "If you want to make offerings with samādhi, you must contemplate the purity of all dharmas.\"",
        "source": "T08n0244_002:0795a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲以灌頂供養者，當觀想眾羯磨金剛故。",
        "translation": "\"If you want to make offerings with the consecration of a corona, you must contemplate the vajra of all the karmas.",
        "source": "T08n0244_002:0795a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲以印供養者，當觀想眾金剛故。",
        "translation": "\"If you want to make offerings with a seal, you must contemplate the vajras.",
        "source": "T08n0244_002:0795a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲以虛空供養者，當以阿字觀想故。",
        "translation": "\"If you want to make offerings of space, you must contemplate the letter a.",
        "source": "T08n0244_002:0795a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲供養一切曼拏羅者，當以眾金剛輪觀想故。",
        "translation": "\"If you want to make offerings to all maṇḍalas, you must contemplate them in terms of the many vajra wheels.",
        "source": "T08n0244_002:0795a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲以一切具供養者，當以眾金剛觀想故。",
        "translation": "\"If you want to make offerings of everything, you must contemplate them in terms of the many vajras.",
        "source": "T08n0244_002:0795a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲調伏諸惡成供養者，當現忿怒相加持，以花擲之。」",
        "translation": "\"If you want to make offerings to subdue evil, you should present the wrathful aspect of the blessing and toss a flower at it.\"",
        "source": "T08n0244_002:0795a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛忿怒三昧大儀軌分第十",
        "translation": "The Tenth Part of the Great Ritual Procedure for the Vajra-rage Samadhi",
        "source": "T08n0244_002:0795a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼佛能調難調者，作大智拳印，復說調伏一切有情藏般若波羅蜜多教。",
        "translation": "At the time, Śākyamuni Buddha was able to tame those who were difficult to tame, make the seal of the great fist of wisdom, and then teach the prajñāpāramitā of the sphere of the regulation of all sentient beings.",
        "source": "T08n0244_002:0795a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：「一切有情平等故，是即忿怒平等；一切有情調伏故，是即忿怒調伏；一切有情依法故，是即忿怒依法；一切有情自性堅固故，是即忿怒自性堅固。",
        "translation": "It was called, \"It's because all sentient beings are equal that anger is equal, because all sentient beings are disciplined that anger is disciplined, because all sentient beings follow the law that anger follows the law, and because the self-nature of all sentient beings is resolute that anger's self-nature is resolute.",
        "source": "T08n0244_002:0795a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0244_002:0795b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切調伏，是即菩提故。」",
        "translation": "Thus, all things are subdued, which is the reason for enlightenment.\"",
        "source": "T08n0244_002:0795b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時降諸魔金剛藥剎菩薩，聞佛說此調伏法門已，即現笑容。",
        "translation": "It was then that the Vajrayakṣa Bodhisattva, who had subdued Māra, smiled when he heard the Buddha teach this approach to bringing under submission.",
        "source": "T08n0244_002:0795b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復現金剛藥剎相，結金剛利牙印，即說金剛忿怒大歡喜心明，曰：「郝」說此心明時，所有諸惡皆悉調伏，一切有情從菩薩心出，依曼拏羅儀住。",
        "translation": "He then took the Vajra-yakṣa form, made the sign of the vajra's sharp teeth, and declared, \"Hao,\" that when he declared this mental clarity, all evils were completely subdued, and all sentient beings emerged from the bodhisattva's mind and abode according to the maṇḍala's rituals.",
        "source": "T08n0244_002:0795b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛藥剎菩薩，入一切方便調伏忿怒金剛三摩地。",
        "translation": "At the time, the Vajra-Yakṣa Bodhisattva entered the vajra samādhi of disciplining wrath with all skillful means.",
        "source": "T08n0244_002:0795b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從定出已，說此調伏諸惡安想金剛藥剎曼拏羅法：「若成就此法者，當依前外曼拏羅儀畫曼拏羅，於其中間以五色畫四方曼拏羅。",
        "translation": "After emerging from that concentration, he explained this method for disciplining negative conceptions of the vajra-yakṣa maṇḍala: \"If someone has accomplished this method, they should draw a maṇḍala according to the previous external maṇḍala ritual, and within it, they should draw a four-sided maṇḍala with five colors.",
        "source": "T08n0244_002:0795b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四門四隅畫八寶柱，光焰熾盛。",
        "translation": "On the four sides of the maṇḍala, eight jeweled pillars are drawn, with their light blazing brightly.",
        "source": "T08n0244_002:0795b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於曼拏羅中，依法畫金剛藥剎菩薩，身大青色，作大怖畏，復大笑相，利牙外出，光明照耀。",
        "translation": "In the middle of the maṇḍala, paint the Vajragarbha Bodhisattva according to the rules, with a large blue body that's made of great fear and a big smile, with sharp teeth coming out and shining brightly.",
        "source": "T08n0244_002:0795b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於菩薩周匝畫金剛藥剎眾，亦現大惡相，及畫金剛部眾幖幟。",
        "translation": "Around the bodhisattva, he paints the Vajrayakṣa community, which also has a large, evil appearance, and he paints the flags of the Vajra group.",
        "source": "T08n0244_002:0795b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於外曼拏羅隅，畫金剛利牙印，於其四門各畫金剛幖幟。",
        "translation": "Again, he painted the corners of the outer maṇḍala with the sign of the vajra's sharp teeth, and he drew a vajra corona on each of the four entrances.",
        "source": "T08n0244_002:0795b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是畫已，阿闍梨結金剛利牙印或大笑印，依法引弟子入曼拏羅，當以金剛利牙灌頂法授其灌頂。",
        "translation": "After such a drawing, the preceptor then makes the vajra-teeth sign or the great smile sign, guides the disciple into the maṇḍala according to the rules, and then consecrates him with the vajra-teeth consecration method.",
        "source": "T08n0244_002:0795b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "授灌頂已，阿闍梨即作金剛藥剎勢，以金剛杵打之，即時金剛藥剎畫像作大笑聲。",
        "translation": "After conferring the consecration, the preceptor then makes the Vajragarbha gesture and strikes it with a vajra pounder, and immediately the Vajragarbha image makes a big laughing sound.",
        "source": "T08n0244_002:0795b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見此瑞相時，阿闍梨定知得成金剛手菩薩大藥剎主。",
        "translation": "If someone sees this auspicious sign, the ācārya certainly knows that they've become the Vajrapāṇi Bodhisattva, the great Medicine Buddha.",
        "source": "T08n0244_002:0795b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿闍梨即作成就法，依法結印持誦，獻種種供養，及讀誦般若波羅蜜多教。",
        "translation": "The ācārya then creates a ritual for accomplishing this, seals and recites it according to the rules, makes various offerings, and recites the teachings of Prajñāpāramitā.",
        "source": "T08n0244_002:0795b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是依法作供養已，出於曼拏羅。」",
        "translation": "After making these offerings according to the rules, he left the maṇḍala.\"",
        "source": "T08n0244_002:0795b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說成就法：「如金剛手菩薩曼拏羅儀，所作成就法亦應如是。",
        "translation": "He also explained the accomplishment method, \"Suppose the Vajrapāṇi Bodhisattva's maṇḍala ritual is similarly accomplished.",
        "source": "T08n0244_002:0795b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲調伏諸惡者，當結金剛利牙印。",
        "translation": "\"If you want to subdue evil, you must make the vajra-teeth seal.",
        "source": "T08n0244_002:0795c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲調伏一切有情者，當作忿怒勢，現大笑聲，持誦心明。",
        "translation": "\"If you want to subdue all sentient beings, you will assume an angry posture, make a loud laugh, and recite the mental luminosity.",
        "source": "T08n0244_002:0795c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲印於一切者，當結金剛拳印。",
        "translation": "\"If you want to seal them all, you'll make the mudrā of the vajra fist.",
        "source": "T08n0244_002:0795c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破壞諸惡者，當作彼形加持已，即能破壞。",
        "translation": "\"If you want to destroy evils, take their form and apply it, and you'll be able to destroy them.",
        "source": "T08n0244_002:0795c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲破諸邪壇者，當手持金剛杵入其壇中。",
        "translation": "\"If you want to destroy the altars of evil, you'll carry a vajra pounder into their altars.",
        "source": "T08n0244_002:0795c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲壞彼供養者，當現忿怒勢持誦。",
        "translation": "\"If you want to destroy their offerings, you'll recite it with an angry gesture.",
        "source": "T08n0244_002:0795c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲驚怖諸惡者，當以陪囉嚩目顧視之。」",
        "translation": "\"If you want to frighten the evil ones, you'll look at them with the eyes of a companion.\"",
        "source": "T08n0244_002:0795c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說最上根本大樂金剛不空三昧大教王經卷第二",
        "translation": "Foshuo zuishang fundament dalai jingang bukong sanmei dajiaowang jing, vol. 2",
        "source": "T08n0244_002:0795c10_0",
        "is_bad_quality": false
    }
]