[
    {
        "source_sentence": "大薩遮尼乾子所說經卷第二",
        "translation": "Mahāsatya-nirgrantha-putra-sūtra, Volume II",
        "source": "T09n0272_002:0322b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏天竺三藏菩提留支譯",
        "translation": "Yuan Wei Tianzang Tripiṭaka Bodhiruci Translation",
        "source": "T09n0272_002:0322b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一乘品第三之二",
        "translation": "Third and Second in the Chapter of the One Vehicle",
        "source": "T09n0272_002:0322b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0272_002:0322b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十二種發勇猛心，修行毘梨耶波羅蜜得大利益，菩薩應行精進波羅蜜。",
        "translation": "\"Again, there are 12 ways a bodhisattva arouses courageous thoughts and cultivates the perfection of vīrya to obtain great benefit, and bodhisattvas should practice the perfection of effort.",
        "source": "T09n0272_002:0322b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are the twelve?",
        "source": "T09n0272_002:0322b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、精進能速覺知諸佛法海故，菩薩應發大勇猛心修行精進波羅蜜；二者、精進能速往詣諸佛所故，菩薩應發大勇猛心修行精進波羅蜜；三者、精進能遍十方供養恭敬一切佛故，菩薩應發大勇猛心修行精進波羅蜜；四者、精進所作之業能稱一切諸佛意故，菩薩應發大勇猛心修行精進波羅蜜；五者、精進能勤化度一切眾生不生厭足故，菩薩應發大勇猛心修行精進波羅蜜；六者、精進能置眾生諸佛法中趣解脫門故，菩薩應發大勇猛心修行精進波羅蜜；七者、精進速能令諸一切眾生離諸愚癡故，菩薩應發大勇猛心修行精進波羅蜜；八者、精進速能悉與一切眾生諸佛智慧故，菩薩應發大勇猛心修行精進波羅蜜；九者、精進速能清淨諸佛國土故，菩薩應發大勇猛心修行精進波羅蜜；十者、精進行能建立盡未來際一切劫數，為諸眾生行菩薩行不生疲惓心故，菩薩應發大勇猛心修行精進波羅蜜；十一者、精進行能於一念中遍諸佛國種諸善根故，菩薩應發大勇猛心修行精進波羅蜜；十二者、精進行能遍詣一切諸佛國土成無上道、轉大法輪故，菩薩應發大勇猛心修行精進波羅蜜。",
        "translation": "一者、精進能速覺知諸佛法海故，菩薩應發大勇猛心修行精進波羅蜜；二者、精進能速往詣諸佛所故，菩薩應發大勇猛心修行精進波羅蜜；三者、精進能遍十方供養恭敬一切佛故，菩薩應發大勇猛心修行精進波羅蜜；四者、精進所作之業能稱一切諸佛意故，菩薩應發大勇猛心修行精進波羅蜜；五者、精進能勤化度一切眾生不生厭足故，菩薩應發大勇猛心修行精進波羅蜜；六者、精進能置眾生諸佛法中趣解脫門故，菩薩應發大勇猛心修行精進波羅蜜；七者、精進速能令諸一切眾生離諸愚癡故，菩薩應發大勇猛心修行精進波羅蜜；八者、精進速能悉與一切眾生諸佛智慧故，菩薩應發大勇猛心修行精進波羅蜜；九者、精進速能清淨諸佛國土故，菩薩應發大勇猛心修行精進波羅蜜；十者、精進行能建立盡未來際一切劫數，為諸眾生行菩薩行不生疲惓心故，菩薩應發大勇猛心修行精進波羅蜜；十一者、精進行能於一念中遍諸佛國種諸善根故，菩薩應發大勇猛心修行精進波羅蜜；十二者、精進行能遍詣一切諸佛國土成無上道、轉大法輪故，菩薩應發大勇猛心修行精進波羅蜜。",
        "source": "T09n0272_002:0322b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0272_002:0322c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩十二種發勇猛心，修行毘梨耶波羅蜜得大利益，迴向阿耨多羅三藐三菩提。」",
        "translation": "These are called the twelve kinds of courageous aspiration of bodhisattvas, which cultivate the perfection of vīrya and obtain great benefit as they dedicate themselves to unsurpassed, correct enlightenment.\"",
        "source": "T09n0272_002:0322c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即以偈頌讚歎精進波羅蜜，重說偈言：「若欲為眾生，　　修行菩薩行，　速成無上道，　　精進最第一。",
        "translation": "It was then that the Bhagavān praised the perfection of effort with a verse and repeated the verse, saying, \"If you want to cultivate the bodhisattva practice for the sake of sentient beings and quickly achieve the unsurpassed path, the highest level of effort is required.",
        "source": "T09n0272_002:0322c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來無量劫，　　所行諸苦行，　一切皆能忍，　　不生怯弱故。",
        "translation": "Thus, for measureless eons, the Tathāgatas have practiced many kinds of painful actions, but they're all tolerated, so they don't become fainthearted.",
        "source": "T09n0272_002:0322c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故諸佛子，　　欲速成佛道，　常當勤修行，　　精進波羅蜜。",
        "translation": "Therefore, all Buddhist disciples who want to quickly achieve the buddha path should always diligently cultivate the perfection of effort.",
        "source": "T09n0272_002:0322c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩行精進，　　能速到勝處，　過諸百千國，　　供養觀諸佛。",
        "translation": "With diligence, a bodhisattva can quickly reach a place of victory, surpass a hundred thousand countries, and make offerings to and contemplate the buddhas.",
        "source": "T09n0272_002:0322c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩求大樂，　　為拔眾生苦，　修行菩薩道，　　堅固不轉退，　能為諸眾生，　　無量百千劫，　受苦無懈怠，　　皆由精進故。",
        "translation": "Seeking great happiness, the bodhisattva cultivates the bodhisattva path to remove the suffering of sentient beings, cultivates it resolutely without turning back, and is able to work for sentient beings for measureless hundreds of thousands of eons, suffering without laziness, all because of his effort.",
        "source": "T09n0272_002:0323a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願我常精進，　　清淨佛國土，　次願能覺知，　　一切諸佛法，　能遍諸佛國，　　轉大妙法輪。",
        "translation": "May I always exert myself to purify Buddha-lands, and may I next come to know all the Buddha's teachings, pervade all Buddha-lands, and turn the great wonderful Dharma wheel.",
        "source": "T09n0272_002:0323a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願諸眾生類，　　一切皆覺知，　悉入大乘中，　　離餘乘魔界，　滿足諸大願，　　速到無畏地，　菩薩精進故，　　能於一念時，　覺大菩提法，　　開示涅槃門，　化作無量身，　　遍滿十方國。",
        "translation": "May all sentient beings know them all, enter the great vehicle, leave the demonic realm of the other vehicles, fulfill the great vows, and quickly reach the ground of fearlessness, so that with a single moment of thought, a bodhisattva's effort can awaken to the great awakening dharma, reveal the gate to nirvāṇa, and create something limitless that pervades the lands of the ten directions.",
        "source": "T09n0272_002:0323a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為利益眾生，　　示如是勝事。",
        "translation": "For the benefit of sentient beings, he demonstrates such remarkable things.",
        "source": "T09n0272_002:0323a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0272_002:0323a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十二種觀，行禪波羅蜜得大利益，菩薩應修禪波羅蜜。",
        "translation": "\"Again, there are 12 ways a bodhisattva observes the great benefits that come from practicing the perfection of meditation, and bodhisattvas should cultivate the perfection of meditation.",
        "source": "T09n0272_002:0323a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are the twelve?",
        "source": "T09n0272_002:0323a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、禪定能滅一切諸煩惱染，菩薩應修禪波羅蜜，常無分別心故；二者、禪定心住寂靜，念不散亂，菩薩應修禪波羅蜜，不取諸境界故；三者、禪定心無所著能滿諸行，菩薩應修禪波羅蜜，能過三界故；四者、禪定能出世間不著諸有，菩薩應修禪波羅蜜，過世間故；五者、禪定能觀勝法心無疲惓，菩薩應修禪波羅蜜，不以為足故；六者、禪定柔軟自在，不隨禪生，菩薩應修禪波羅蜜，自在轉諸禪故；七者、禪定得無相心不見諸物，菩薩應修禪波羅蜜，以離諸相故；八者、禪定心淨能照無量境界，菩薩應修禪波羅蜜，以過有量諸三昧等呵責過故；九者、禪定能滅觀心、不見能觀，菩薩應修禪波羅蜜，以得寂靜心故；十者、禪定證柔軟心、滅諸覺觀，菩薩應修禪波羅蜜，以得調伏心故；十一者、禪定心能寂滅一觀諸根不動，菩薩應修禪波羅蜜，以得降伏不善根故；十二者、禪定心能於諸法中有大方便，菩薩應修禪波羅蜜，以能不捨大菩提心故。",
        "translation": "一者、禪定能滅一切諸煩惱染，菩薩應修禪波羅蜜，常無分別心故；二者、禪定心住寂靜，念不散亂，菩薩應修禪波羅蜜，不取諸境界故；三者、禪定心無所著能滿諸行，菩薩應修禪波羅蜜，能過三界故；四者、禪定能出世間不著諸有，菩薩應修禪波羅蜜，過世間故；五者、禪定能觀勝法心無疲惓，菩薩應修禪波羅蜜，不以為足故；六者、禪定柔軟自在，不隨禪生，菩薩應修禪波羅蜜，自在轉諸禪故；七者、禪定得無相心不見諸物，菩薩應修禪波羅蜜，以離諸相故；八者、禪定心淨能照無量境界，菩薩應修禪波羅蜜，以過有量諸三昧等呵責過故；九者、禪定能滅觀心、不見能觀，菩薩應修禪波羅蜜，以得寂靜心故；十者、禪定證柔軟心、滅諸覺觀，菩薩應修禪波羅蜜，以得調伏心故；十一者、禪定心能寂滅一觀諸根不動，菩薩應修禪波羅蜜，以得降伏不善根故；十二者、禪定心能於諸法中有大方便，菩薩應修禪波羅蜜，以能不捨大菩提心故。",
        "source": "T09n0272_002:0323a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0323b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸菩薩住禪波羅蜜故，不起憍慢心；住禪波羅蜜故，不起邪見心；住禪波羅蜜故，不起憎愛心。",
        "translation": "It's because bodhisattvas abide in the perfection of meditation and don't become proud, abide in the perfection of meditation and don't become mistaken in their views, and abide in the perfection of meditation and don't become hateful.",
        "source": "T09n0272_002:0323b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故諸菩薩能降一切學諸禪定聲聞、辟支佛、外道、梵行入禪三昧者。",
        "translation": "Because of this, bodhisattvas are able to subdue all those who train in the concentration of meditation, such as śrāvakas, pratyekbuddhas, non-Buddhists, and religious practitioners, and enter the samādhi of meditation.",
        "source": "T09n0272_002:0323b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0272_002:0323b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩十二種修行禪波羅蜜得大利益，迴向阿耨多羅三藐三菩提。」",
        "translation": "These are called the twelve ways in which a bodhisattva's practice of the perfection of meditation obtains great benefit and leads back to unsurpassed, correct enlightenment.\"",
        "source": "T09n0272_002:0323b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即以偈頌讚歎禪波羅蜜，而說偈言：「欲修無漏智，　　出離欲淤泥，　滅除諸業障，　　禪定最第一。",
        "translation": "It was then that the Bhagavān praised the perfection of meditation in verse, saying, \"When you want to cultivate uncontaminated cognition, escape the mire of desire, and eliminate the hindrances of karma, meditation is the highest.",
        "source": "T09n0272_002:0323b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　禪定難思議，　　是諸佛境界，　二乘諸凡夫，　　三昧不能知。",
        "translation": "Meditation is inconceivable, which is the realm of the buddhas and can't be known by worldlings in the second vehicle who are in samādhi.",
        "source": "T09n0272_002:0323b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大地諸山海，　　劫火能燒除，　若心住禪定，　　安隱無損害。",
        "translation": "The mountains and seas of the earth can be burned away in an eon of fire, but if the mind abides in meditation, it's peaceful and unharmed.",
        "source": "T09n0272_002:0323b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來智慧日，　　無漏摩尼珠，　不從餘處生，　　禪定海中出，　是故諸佛子，　　求佛大智寶，　當除散亂心，　　念禪波羅蜜。",
        "translation": "The Tathāgata's sun of wisdom, the untainted maṇi pearl, arises from no other place than the ocean of meditation; therefore, all Buddhist disciples seeking the Buddha's great treasure of wisdom should remove their distracted minds and remember the perfection of meditation.",
        "source": "T09n0272_002:0323b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸菩薩禪定，　　寂滅諸煩惱，　是故智者說，　　勝修餘禪者。",
        "translation": "Bodhisattva meditation quells the afflictions; therefore, the wise man says it's superior to those who practice other meditations.",
        "source": "T09n0272_002:0323b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　深心常寂滅，　　不樂諸境界，　能攝諸亂心，　　住勝涅槃處。",
        "translation": "Their profound mind is always quiescent, they don't delight in objects, they can control distracted states of mind, and they abide in a superior state of nirvāṇa.",
        "source": "T09n0272_002:0323b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩修禪定，　　三界無所住，　是故不依止，　　彼非依止處。",
        "translation": "When a bodhisattva cultivates meditation, the three realms have no place to abide, so he doesn't rely on them, for they aren't a place of reliance.",
        "source": "T09n0272_002:0323b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩禪能過，　　世間出世間，　是故三昧勝，　　勝世間二乘。",
        "translation": "Bodhisattva meditation transcends the mundane and transmundane; therefore, samādhi is superior, surpassing the two vehicles of the world.",
        "source": "T09n0272_002:0323c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩禪柔軟，　　隨意無罣礙，　是故能迴轉，　　生於欲界中。",
        "translation": "The bodhisattva's meditation is flexible, has no obstruction at will, and therefore can turn around and be born in the desire realm.",
        "source": "T09n0272_002:0323c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩所修禪，　　勝餘一切觀，　諸禪非究竟，　　故佛說勝者。",
        "translation": "The bodhisattva's meditation is superior to all other contemplations, and meditations are not perfect, which is why the Buddha says it's superior.",
        "source": "T09n0272_002:0323c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩禪無量，　　從於勝境生，　離諸眾生相，　　及離諸垢法，　是故諸菩薩，　　所修禪定勝，　降修餘禪者，　　及諸少分禪。",
        "translation": "Bodhisattva meditation is immeasurable, arises from a superior object, is free of the characteristics of sentient beings, and is free of defiled dharmas; therefore, the meditative concentration cultivated by bodhisattvas is superior, and it subdues those who cultivate other meditations and those who practice a lesser amount of meditation.",
        "source": "T09n0272_002:0323c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩一向觀，　　清淨諸境界，　如是所修禪，　　從慧方便生，　正智為根本，　　不起邪見心，　是故菩薩禪，　　無有可譏嫌。",
        "translation": "Thus, the bodhisattva's meditation, which has always been observed to purify all objects, arises from the skillful means of wisdom, has right knowledge as its root, and doesn't give rise to a mind with wrong views; therefore, there's nothing to criticize about the bodhisattva's meditation.",
        "source": "T09n0272_002:0323c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩入禪定，　　不住有無中，　以觀實境故，　　能離有無相，　如是勝智禪，　　不同餘境界，　羅漢辟支佛，　　智慧悉迷悶。",
        "translation": "When a bodhisattva enters meditation, he doesn't abide in existence or nonexistence; because he observes real objects, he's able to part with existence and nonexistence as characteristics; thus, his meditation with superior wisdom is unlike any other object, and the wisdom of the arhats and pratyekabuddhas is completely bewildered.",
        "source": "T09n0272_002:0323c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0272_002:0323c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十二種觀，修行般若波羅蜜得大利益，菩薩應修慧波羅蜜。",
        "translation": "\"Again, there are 12 ways a bodhisattva observes that cultivating the perfection of wisdom will greatly benefit him, and bodhisattvas should cultivate the perfection of wisdom.",
        "source": "T09n0272_002:0323c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are the twelve?",
        "source": "T09n0272_002:0323c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、般若遠離諸垢能發光明，菩薩應修慧波羅蜜，以能離諸黑闇法故；二者、般若悉能覺了諸闇障礙，菩薩應修慧波羅蜜，以能照除煩惱稠林故；三者、般若能放一切智慧光明，菩薩應修慧波羅蜜，以離一切諸無智故；四者、般若如犁耕地除諸草穢，菩薩應修慧波羅蜜，以能拔諸無明根本故；五者、般若如利鐵鉤隨意琢斫，菩薩應修慧波羅蜜，以能鉤斷諸愛網故；六者、般若如金剛杵不為一切諸物所壞，菩薩應修慧波羅蜜，以能破碎煩惱山故；七者、般若如大日輪離諸雲翳，菩薩應修慧波羅蜜，以能乾竭一切煩惱諸淤泥故；八者、般若如大火聚燒諸穢草，菩薩應修慧波羅蜜，以能焚燒業煩惱樹故；九者、般若如摩尼珠能照一切，菩薩應修慧波羅蜜，以無闇心不迷諸法故；十者、般若能住寂滅究竟實際，菩薩應修慧波羅蜜，以無所有故；十一者、般若能滅有相心無分別，菩薩應修慧波羅蜜，以無相故；十二者、般若能成無願心無求樂，菩薩應修慧波羅蜜，以過三界故。",
        "translation": "一者、般若遠離諸垢能發光明，菩薩應修慧波羅蜜，以能離諸黑闇法故；二者、般若悉能覺了諸闇障礙，菩薩應修慧波羅蜜，以能照除煩惱稠林故；三者、般若能放一切智慧光明，菩薩應修慧波羅蜜，以離一切諸無智故；四者、般若如犁耕地除諸草穢，菩薩應修慧波羅蜜，以能拔諸無明根本故；五者、般若如利鐵鉤隨意琢斫，菩薩應修慧波羅蜜，以能鉤斷諸愛網故；六者、般若如金剛杵不為一切諸物所壞，菩薩應修慧波羅蜜，以能破碎煩惱山故；七者、般若如大日輪離諸雲翳，菩薩應修慧波羅蜜，以能乾竭一切煩惱諸淤泥故；八者、般若如大火聚燒諸穢草，菩薩應修慧波羅蜜，以能焚燒業煩惱樹故；九者、般若如摩尼珠能照一切，菩薩應修慧波羅蜜，以無闇心不迷諸法故；十者、般若能住寂滅究竟實際，菩薩應修慧波羅蜜，以無所有故；十一者、般若能滅有相心無分別，菩薩應修慧波羅蜜，以無相故；十二者、般若能成無願心無求樂，菩薩應修慧波羅蜜，以過三界故。",
        "source": "T09n0272_002:0323c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0272_002:0324a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩十二種修行般若波羅蜜得大利益。」",
        "translation": "These are the twelve ways in which a bodhisattva's practice of the perfection of wisdom obtains great benefit.\"",
        "source": "T09n0272_002:0324a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即以偈頌讚歎般若波羅蜜，而說偈言：「究竟斷有種，　　安隱入涅槃，　諸波羅蜜中，　　智慧最第一。",
        "translation": "It was then that the Bhagavān praised the perfection of wisdom in verse, saying, \"To end the seeds of existence and enter nirvāṇa peacefully, is the wisdom that's highest among the perfections.",
        "source": "T09n0272_002:0324a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如世間燈，　　能破一切闇，　亦如高幢火，　　世間最勝觀。",
        "translation": "Like a lamp in the world that destroys all darkness, it's like the fire of a high banner, the most surpassing in the world to contemplate.",
        "source": "T09n0272_002:0324a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸如來，　　出離諸有流，　降伏四魔眾，　　智慧為猛將。",
        "translation": "All tathāgatas emancipate from all streams of existence, subdue the four Māras, and make wisdom their fierce general.",
        "source": "T09n0272_002:0324a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛子若欲，　　自利利眾生，　常當勤修行，　　般若波羅蜜。",
        "translation": "If Buddhist disciples want to improve themselves and bring benefit to sentient beings, they must always diligently cultivate the perfection of wisdom.",
        "source": "T09n0272_002:0324a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如犁耕地，　　能除諸荒穢，　智滅疑愛草，　　如犁耕淨地。",
        "translation": "Like a plow plowing the earth, it removes waste and defilement, and wisdom ceases the weeds of doubt and desire, like a plow plowing the pure ground.",
        "source": "T09n0272_002:0324a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　帝釋金剛杵，　　滅惡阿修羅，　智碎煩惱山，　　能壞亦如是。",
        "translation": "Indra's vajra extinguishes bad asuras, and wisdom shatters mountains of affliction, capable of destroying them like this.",
        "source": "T09n0272_002:0324a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸如來，　　說於智慧力，　猶如夏中日，　　亦如世間燈，　能竭煩惱海，　　照除無明闇，　以體出世間，　　無漏火明故。",
        "translation": "All tathāgatas explain that the power of wisdom is like the mid-summer sun and a lamp of the world that dries up the ocean of affliction and shines out the darkness of ignorance because its essence is untainted, uncontaminated fire and brightness that transcends the world.",
        "source": "T09n0272_002:0324a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智慧能割截，　　無明癡闇樹，　猶如快利刀，　　剪除諸細草。",
        "translation": "Wisdom cuts through the tree of nescience and delusion like a sharp sword that cuts through fine grass.",
        "source": "T09n0272_002:0324b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智如摩尼珠，　　平等照世間，　如空無分別，　　不住有涅槃。",
        "translation": "Like the maṇi pearl, wisdom illuminates the world equally, like space without discrimination, and doesn't abide in existential nirvāṇa.",
        "source": "T09n0272_002:0324b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智慧心自在，　　決定於一切，　能斷諸疑悔，　　及斷所有問，　說世間惡報，　　及顯涅槃果，　普示諸眾生，　　如闇示明燈。",
        "translation": "With a mind free of wisdom, he determines them all, stops doubt and remorse, ends all questions, explains the bad consequences of the world and reveals the fruit of nirvāṇa, and shows them to all sentient beings like a bright lamp in the dark.",
        "source": "T09n0272_002:0324b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛明月眼，　　現見諸法相，　諸菩薩同彼，　　無垢智修行。",
        "translation": "The bright moon-eye of the buddhas reveals the characteristics of all dharmas, and the bodhisattvas share their cultivation of undefiled cognition.",
        "source": "T09n0272_002:0324b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人夜執燈，　　去處皆明了，　生死黑闇中，　　慧明能度彼。",
        "translation": "Like a person holding a lamp at night, they see clearly where they're going, and in the darkness of birth-and-death, their wisdom is able to save them.",
        "source": "T09n0272_002:0324b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0272_002:0324b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十二種境界，修方便行得大利益，是故菩薩應修方便波羅蜜。",
        "translation": "There are twelve other ways in which a bodhisattva cultivates skillful actions to obtain great benefit; therefore, bodhisattvas should cultivate the perfection of skillful means.",
        "source": "T09n0272_002:0324b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are the twelve?",
        "source": "T09n0272_002:0324b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、方便不離涅槃清淨境界，而現世間垢濁境界故，菩薩應修方便波羅蜜；二者、方便不離一處寂靜境界，而現世間憒閙境界故，菩薩應修方便波羅蜜；三者、方便不離禪定甚深境界，而現世間王宮境界故，菩薩應修方便波羅蜜；四者、方便不離清淨無功用境界，而現世間功用境界故，菩薩應修方便波羅蜜；五者、方便不離無生真實境界，而現世間生此退彼、退此生彼諸境界故，菩薩應修方便波羅蜜；六者、方便能過一切四魔境界，而現世間降魔境界故，菩薩應修方便波羅蜜；七者、方便不離一切聖人境界，而現世間凡夫境界故，菩薩應修方便波羅蜜；八者、方便不離能出世間境界，而住世間諸有境界故，菩薩應修方便波羅蜜；九者、方便不離一切智慧境界，而現世間無智境界故，菩薩應修方便波羅蜜；十者、方便不離菩薩實際境界，而現聲聞、緣覺境界故，菩薩應修方便波羅蜜；十一者、方便力能善知一切諸法無相，而能示現三十二相、八十種好，教化眾生故，菩薩應修方便波羅蜜；十二者、方便力能入諸一切平等境界，而能示現諸魔境界故，菩薩應住方便波羅蜜。",
        "translation": "一者、方便不離涅槃清淨境界，而現世間垢濁境界故，菩薩應修方便波羅蜜；二者、方便不離一處寂靜境界，而現世間憒閙境界故，菩薩應修方便波羅蜜；三者、方便不離禪定甚深境界，而現世間王宮境界故，菩薩應修方便波羅蜜；四者、方便不離清淨無功用境界，而現世間功用境界故，菩薩應修方便波羅蜜；五者、方便不離無生真實境界，而現世間生此退彼、退此生彼諸境界故，菩薩應修方便波羅蜜；六者、方便能過一切四魔境界，而現世間降魔境界故，菩薩應修方便波羅蜜；七者、方便不離一切聖人境界，而現世間凡夫境界故，菩薩應修方便波羅蜜；八者、方便不離能出世間境界，而住世間諸有境界故，菩薩應修方便波羅蜜；九者、方便不離一切智慧境界，而現世間無智境界故，菩薩應修方便波羅蜜；十者、方便不離菩薩實際境界，而現聲聞、緣覺境界故，菩薩應修方便波羅蜜；十一者、方便力能善知一切諸法無相，而能示現三十二相、八十種好，教化眾生故，菩薩應修方便波羅蜜；十二者、方便力能入諸一切平等境界，而能示現諸魔境界故，菩薩應住方便波羅蜜。",
        "source": "T09n0272_002:0324b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0272_002:0324c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩十二種住方便波羅蜜得大利益。」",
        "translation": "These are called the twelve ways a bodhisattva abides in the perfection of skillful means to attain great benefit.\"",
        "source": "T09n0272_002:0324c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即以偈頌讚歎方便波羅蜜，而說偈言：「一切諸菩薩，　　行諸波羅蜜，　若無方便者，　　不能到彼岸。",
        "translation": "It was then that the Bhagavān praised the perfection of skillful means with a verse, saying, \"All bodhisattvas who practice the perfections wouldn't reach the other shore if they didn't have skillful means.",
        "source": "T09n0272_002:0324c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自利亦利他，　　住世間涅槃，　如是無淨染，　　皆由方便故。",
        "translation": "They benefit themselves and others, abide in mundane nirvāṇa, and thus lack purity and defilement, all because of skillful means.",
        "source": "T09n0272_002:0324c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸如來，　　所行諸境界，　二乘不思議，　　斯由方便力。",
        "translation": "All tathāgatas practice realms that the two vehicles don't contemplate, and this is because of the power of skillful means.",
        "source": "T09n0272_002:0324c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故諸佛子，　　欲行如來事，　常當勤修行，　　方便波羅蜜。",
        "translation": "Therefore, all Buddhist disciples who want to practice the Tathāgata's works should always diligently cultivate the perfection of skillful means.",
        "source": "T09n0272_002:0324c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩常清淨，　　方便利眾生，　實無諸欲垢，　　示現行染行。",
        "translation": "Always pure, the bodhisattva's methods benefit sentient beings, are really unsullied by desire, and reveal defiled behavior.",
        "source": "T09n0272_002:0324c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　涅槃池中浴，　　方便現諸有，　是名諸菩薩，　　不住於二邊。",
        "translation": "Bathing in the pool of nirvāṇa, skillfully manifesting all existents, these are called bodhisattvas who don't abide in either extreme.",
        "source": "T09n0272_002:0324c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身口意常住，　　第一義寂靜，　為利益眾生，　　方便同世間。",
        "translation": "Their bodies, speech, and mind are always abiding, and the ultimate quiescence is applied for the benefit of sentient beings, which is the same as the world.",
        "source": "T09n0272_002:0324c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如蜂入華林，　　不專採一華，　菩薩方便行，　　一切諸境界。",
        "translation": "Like a bee entering a flower grove and not focusing on just one flower, a bodhisattva's skillful actions reach all realms.",
        "source": "T09n0272_002:0324c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或現種種相，　　殊妙莊嚴身，　遍諸宮女中，　　行於放逸行。",
        "translation": "Sometimes he shows various forms, has a marvelously ornate body, travels among palace maids, and engages in careless behavior.",
        "source": "T09n0272_002:0324c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或現在地獄，　　救諸苦眾生，　雖現如是相，　　常不捨禪定。",
        "translation": "He might appear in hell, saving all the suffering sentient beings, and even though he shows such forms, he never abandons meditation.",
        "source": "T09n0272_002:0325a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不捨諸三昧，　　而現散亂中，　示現行損害，　　是名方便力。",
        "translation": "Not abandoning the samādhis, he shows up in distraction and conducts himself in a harmful way, which is called the power of skillful means.",
        "source": "T09n0272_002:0325a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩已能離，　　一切有為行，　於諸有無中，　　亦無分別心，　雖現行諸染，　　不生妄欲火，　方便中示現，　　分別有為相。",
        "translation": "The bodhisattva has parted with all conditioned existences, has no discriminating mind among existences and nonexistences, doesn't give rise to the fire of false desire despite the manifestation of defilements, and demonstrates in skillful means the discriminating characteristics of existences.",
        "source": "T09n0272_002:0325a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩於諸有，　　不生亦無退，　示現生退事，　　方便智力故。",
        "translation": "In all existence, the bodhisattva doesn't give rise to or retrogress from anything, and he shows what gives rise to retrogression because of his skillful knowledge.",
        "source": "T09n0272_002:0325a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　棄捨魔業處，　　住佛境界中，　智慧不怯弱，　　示現諸魔事。",
        "translation": "Abandoning the place of demonic activity, he abides in the Buddha's realm, doesn't falter in wisdom, and demonstrates the works of demons.",
        "source": "T09n0272_002:0325a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩大悲力，　　奮迅方便智，　住聖無上處，　　而現凡夫事。",
        "translation": "With the power of great compassion and the wisdom of swift methods, the bodhisattva abides in the noble and peerless place and shows the works of ordinary people.",
        "source": "T09n0272_002:0325a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以入諸法相，　　知諸法體空，　常處於涅槃，　　而不捨世間。",
        "translation": "They enter the characteristics of dharmas, know that the essence of dharmas is empty, remain in nirvāṇa, and don't abandon the world.",
        "source": "T09n0272_002:0325a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法自體空，　　寂靜及無相，　為利益眾生，　　相好莊嚴身。",
        "translation": "The intrinsic nature of all dharmas is empty, quiescent, and markless, and they adorn their bodies with beautiful features for the benefit of sentient beings.",
        "source": "T09n0272_002:0325a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無癡現無智，　　無瞋現無慈，　而能益眾生，　　是名為方便。",
        "translation": "Being able to benefit sentient beings without delusion showing cognition and without anger showing kindness is called skillful means.",
        "source": "T09n0272_002:0325a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩摩訶薩，　　住彼如是處，　是名示聖人，　　種種諸方便。",
        "translation": "For a bodhisattva, Mahāsattva, to abide in such a place is to show a sage the various kinds of skillful means.",
        "source": "T09n0272_002:0325a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，諸善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T09n0272_002:0325a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正遍知更有方便，汝等應知。",
        "translation": "The Tathāgata, the Worthy One, and the Perfectly Omniscient One also have another method that you should know.",
        "source": "T09n0272_002:0325a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0325a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "Good sons!",
        "source": "T09n0272_002:0325a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、如來有十二種勝妙功德，猶如醍醐，於諸味中最為勝上、清淨、第一，能淨一切諸佛國土，如來於中成阿耨多羅三藐三菩提。",
        "translation": "The buddhas and tathāgatas have 12 excellent and wonderful qualities, like ghee, which is the most excellent, pure, and first among flavors and purifies all the buddha lands, and in which the Tathāgata achieves supreme, perfect, and complete enlightenment.",
        "source": "T09n0272_002:0325a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are the twelve?",
        "source": "T09n0272_002:0325a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、示現劫濁；二者、示現時濁；三者、示現眾生濁；四者、示現煩惱濁；五者、示現命濁；六者、示現三乘差別濁；七者、示現不淨佛國土濁；八者、示現難化眾生濁；九者、示現說種種煩惱濁；十者、示現外道亂濁；十一者、示現魔濁；十二者、示現魔業濁。",
        "translation": "1) to show the turbidity of the eon; 2) to show the turbidity of the time; 3) to show the turbidity of sentient beings; 4) to show the turbidity of afflictions; 5) to show the turbidity of life; 6) to show the turbidity of distinctions among the three vehicles; 7) to show the turbidity of an impure Buddha-land; 8) to show the turbidity of difficult-to-transform sentient beings; 9) to show the turbidity of speaking of various afflictions; 10) to show the turbidity of non-Buddhists; 11) to show the turbidity of Māra; and 12) to show the turbidity of Māra's karma.",
        "source": "T09n0272_002:0325a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0272_002:0325b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸佛所有國土皆是出世功德莊嚴具足清淨，無有諸濁。",
        "translation": "All the buddhas' lands are replete with adornments of supramundane merit and are pure, with no turbidity.",
        "source": "T09n0272_002:0325b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此過者，皆是諸佛方便力現，為利眾生，汝等應知。」",
        "translation": "Such an excess is the result of the buddhas' skillful means for the benefit of sentient beings, so you should know.\"",
        "source": "T09n0272_002:0325b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時聖者文殊師利法王子菩薩白佛言：「世尊！",
        "translation": "It was then that the noble Mañjuśrī, Prince of the Dharma, said to the Buddha, \"Bhagavān!",
        "source": "T09n0272_002:0325b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正遍知說此十二最上功德清淨佛國，如來當於何等國土成阿耨多羅三藐三菩提？」",
        "translation": "The Tathāgata, the Worthy and the Perfectly Omniscient One teaches about these twelve most excellent merits of the pure Buddha-lands, and in what lands will the Tathāgata accomplish supreme perfect enlightenment?\"",
        "source": "T09n0272_002:0325b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告文殊師利：「一者、彼佛國土眾生畢竟能成勝清淨劫，離諸劫濁具足功德，如是淨土，如來於中成阿耨多羅三藐三菩提；二者、彼佛國土眾生畢竟能成最勝妙時，諸佛法行不失時節，如是淨土，如來於中成阿耨多羅三藐三菩提；三者、彼佛國土眾生畢竟能成最勝法器、受佛正法，如是淨土，如來於中成阿耨多羅三藐三菩提；四者、彼佛國土眾生畢竟能成淨妙智海，清淨一切諸煩惱垢，如是淨土，如來於中成阿耨多羅三藐三菩提；五者、彼佛國土眾生畢竟能成柔軟之心，其中常有調伏眾生，如是淨土，如來於中成阿耨多羅三藐三菩提；六者、彼佛國土眾生畢竟能成最勝妙乘，能以一乘究竟取於無上涅槃，如是淨土，如來於中成阿耨多羅三藐三菩提；七者、彼佛國土眾生畢竟能成勝器世間，無有餘相，如是淨土，如來於中成阿耨多羅三藐三菩提；八者、彼佛國土眾生畢竟能成如來正教，無諸一切外道邪法，如是淨土，如來於中成阿耨多羅三藐三菩提；九者、彼佛國土眾生畢竟能成直心、正心，無有諂曲，如是淨土，如來於中成阿耨多羅三藐三菩提；十者、彼佛國土眾生畢竟能成無垢功德，成就一切清淨白法，如是淨土，如來於中成阿耨多羅三藐三菩提；十一者、彼佛國土所有眾生畢竟能成諸聖人法，其中常有勝福田眾，如是淨土，如來於中成阿耨多羅三藐三菩提；十二者、彼佛國土所有眾生，畢竟能成勝妙道場，過去諸佛於中成道，如是淨土，如來於中成阿耨多羅三藐三菩提。",
        "translation": "The Buddha addressed Mañjuśrī, \"1. After all, the sentient beings of that Buddha's land can become excellent and pure for eons, free from the defilements of eons and replete with virtue.",
        "source": "T09n0272_002:0325b10_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0325c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名十二種最勝功德能淨佛土。",
        "translation": "These are called the twelve most excellent qualities that purify the Buddha's land.",
        "source": "T09n0272_002:0325c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是淨土，如來於中成阿耨多羅三藐三菩提。」",
        "translation": "Such is the pure land in which the Tathāgata achieves supreme perfect enlightenment.\"",
        "source": "T09n0272_002:0325c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0325c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我佛國土無有聲聞、辟支佛等差別之說。",
        "translation": "In our Buddha-lands, there's no such thing as a distinction between śrāvakas and pratyekabuddhas.",
        "source": "T09n0272_002:0325c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0325c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、如來離於種種取相過故。",
        "translation": "\"It's because the buddhas and tathāgatas are free of the faults of various forms of attachment.",
        "source": "T09n0272_002:0325c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0325c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來若為一種眾生說於大乘，一種眾生說緣覺乘，一種眾生說聲聞乘，如是說者，是如來成不清淨心；是如來成不平等心；是如來成鬪諍過心；是如來成無有平等慈悲之心；是如來成諸相過心；是如來成於諸法中生慳悋心。",
        "translation": "\"If the Tathāgata teaches the great vehicle for one type of sentient being, the pratyekabuddha vehicle for one type of sentient being, or the śrāvaka vehicle for one type of sentient being, and they teach it that way, the Tathāgata becomes an impure mind, the Tathāgata becomes an unequal mind, the Tathāgata becomes a fractious mind that fights, the Tathāgata becomes a mind lacking equal compassion, the Tathāgata becomes a mind with faulty appearances, and the Tathāgata becomes a mind stingy with stinginess in regard to all dharmas.",
        "source": "T09n0272_002:0325c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0325c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為眾生說於何等何等之法，彼一切法隨順菩提、隨順大乘，取一切智，畢竟究竟能到一處，謂能到於一切智處。",
        "translation": "What kinds of things do I teach sentient beings that accord with bodhi, accord with the great vehicle, and grasp to all cognition and ultimately reach one place, which is to say that they can reach the place of all cognition?",
        "source": "T09n0272_002:0325c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0325c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我土無乘差別。」",
        "translation": "Therefore, there's no distinction between vehicles in our land.\"",
        "source": "T09n0272_002:0325c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時聖者文殊師利法王子菩薩白佛言：「世尊！",
        "translation": "It was then that the holy Mañjuśrī, Prince of the Dharma, said to the Buddha, \"Bhagavān!",
        "source": "T09n0272_002:0325c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無三乘差別性者，何故如來為諸眾生說三乘法，而言此是聲聞學乘，而言此是緣覺學乘，而言此是菩薩學乘？」",
        "translation": "If there were no distinction between the three vehicles, why would the Tathāgata teach the three vehicles for sentient beings and say that this is the vehicle of training for the śrāvakas, that this is the vehicle of training for the pratyekabuddhas, and that this is the vehicle of training for the bodhisattvas?\"",
        "source": "T09n0272_002:0325c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告文殊師利：「諸佛如來說三乘者，示地差別，非乘差別；諸佛如來說三乘者，說法相差別，非乘差別；諸佛如來說三乘者，說人差別，非乘差別；諸佛如來說三乘者，示少功德，知多功德，而佛法中無乘差別。",
        "translation": "The Buddha told Mañjuśrī, \"Tathāgatas who teach the three vehicles show distinctions in ground and not distinctions in vehicle; Tathāgatas who teach the three vehicles show distinctions in the characteristics of the teachings and not distinctions in vehicle; Tathāgatas who teach the three vehicles show distinctions in people and not distinctions in vehicle; Tathāgatas who teach the three vehicles show little merit and know much merit, but there are no distinctions in the Buddha's teachings in terms of vehicle.",
        "source": "T09n0272_002:0325c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0326a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以法界性無差別故。",
        "translation": "It's because the nature of the Dharma realm has no distinctions.",
        "source": "T09n0272_002:0326a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、如來說三乘者，令諸眾生悉入如來諸佛法門，令諸眾生漸入如來大乘法門，如學諸伎，次第修習。",
        "translation": "\"The buddhas and tathāgatas teach the three vehicles so that sentient beings will all enter the Tathāgata's teaching of the buddhas and so that sentient beings will gradually enter the Tathāgata's great vehicle teaching as they train in the various techniques and cultivate them in sequence.",
        "source": "T09n0272_002:0326a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如射師於射智中，究竟到射第一彼岸，能以種種無量方便教諸弟子，如己知見一切究竟。",
        "translation": "\"It's like an archery master who, in the knowledge of archery, has completely reached the other side of the first shot and can teach his disciples to see everything thoroughly as he knows it with measureless methods.",
        "source": "T09n0272_002:0326a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來射師亦復如是，於諸法中，皆悉究竟到於彼岸，即以如來一切智智分別而說，示諸眾生三乘差別，如世射師教諸弟子。",
        "translation": "\"The Tathāgata's archer is likewise, for he completely reaches the other shore in all things, that is, he discerns and explains it with the Tathāgata's omniscience, showing sentient beings the distinctions among the three vehicles, just as the world's archer teaches his disciples.",
        "source": "T09n0272_002:0326a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如少火所有災炎，漸漸增長能遍世界，乃至成於劫燒大火。",
        "translation": "It's like a small fire that gradually increases in calamity and spreads throughout the world until it becomes a great conflagration that burns eons.",
        "source": "T09n0272_002:0326a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來智火亦復如是，即彼一智光明之性，次第增長成就如來一切知見大智光明，能燒一切諸染煩惱。",
        "translation": "\"So it is with the fire of the Tathāgata's wisdom, which is the brightness of the nature of that single wisdom and the sequential growth of the Tathāgata's great wisdom light of knowing and seeing everything that burns all the defiled afflictions.",
        "source": "T09n0272_002:0326a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如諸大須彌山王無分別心，眾生到者皆同一色，所謂金色。",
        "translation": "\"It's like the great Sumeru mountain king who has no discriminating mind and whose sentient beings are all the same color when they arrive, which is called gold.",
        "source": "T09n0272_002:0326a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、世尊無上大智須彌山王亦復如是，於諸眾生無有分別。",
        "translation": "\"So is the Tathāgata, Bhagavān, and Sumeru the king of mountains of unsurpassed great wisdom, who makes no discrimination among sentient beings.",
        "source": "T09n0272_002:0326a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生入佛法者，彼諸眾生皆成一色，所謂一切種智妙色。",
        "translation": "If there are sentient beings who enter the Buddha's teaching, they all become one color, which is called the marvelous color of omniscience.",
        "source": "T09n0272_002:0326a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如因陀羅淨妙清色摩尼寶珠，置在一切器世間中，彼摩尼寶所有境界，彼境界中一切諸色種種諸相，摩尼珠力皆同一色，所謂青色。",
        "translation": "\"Suppose Indra's pure, wonderful, clear-colored maṇi-jewel is placed in the container world, and there's a realm of that maṇi-jewel that has all the colors and various forms in that realm, and the power of the maṇi-jewel is the same color, which is called blue.",
        "source": "T09n0272_002:0326a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、世尊無上青色摩尼寶珠亦復如是，智慧光明照眾生者皆同一色，所謂一切種智之色。",
        "translation": "\"So it is with the Tathāgata and the Bhagavān's unsurpassed blue maṇi-jewel, whose wisdom light shining brightly on sentient beings is the same color, which is called the color of all kinds of wisdom.",
        "source": "T09n0272_002:0326a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海無量百千河澗水入，入已一切皆同一味，所謂鹽味，以常住故。",
        "translation": "It's like the ocean with measureless hundreds of thousands of rivers and streams of water entering it, and after they enter, they all taste the same, which is called the taste of salt because it's always abiding.",
        "source": "T09n0272_002:0326a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海水者，名為如來一切智慧；種種河澗水皆入者，名為聲聞、緣覺、菩薩；入已一切同鹽味者，名為一乘；常住者，名無分別一切種智。",
        "translation": "\"The great ocean water is called the Tathāgata's omniscience; the one who enters all the various rivers and streams is called a śrāvaka, pratyekabuddha, or bodhisattva; the one who tastes like salt after entering them all is called the One Vehicle; and the one who is eternally abiding is called nondiscriminating omniscience.",
        "source": "T09n0272_002:0326a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此義故，汝應當知無乘差別。",
        "translation": "For this reason, you should know that there's no distinction between vehicles.",
        "source": "T09n0272_002:0326b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故佛說地差別者，示諸眾生三乘作業漸次令入；說法相差別者，示現眾生如來種智漸次令入；說少功德、知多功德者，示諸眾生三人差別，示現如來奮迅方便無礙辯才。",
        "translation": "Therefore, the Buddha teaches distinctions in ground level to show sentient beings the work of the three vehicles and gradually cause them to enter; he teaches distinctions in teaching characteristics to show sentient beings the Tathāgata's knowledge of seeds and gradually cause them to enter; he teaches a little merit and knows a lot of merit to show sentient beings the distinctions among the three persons and to show the Tathāgata's unhindered eloquence with swift methods.",
        "source": "T09n0272_002:0326b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、如來說三乘者，依世諦說。",
        "translation": "\"The buddhas and tathāgatas who teach the three vehicles teach them based on the conventional truth.",
        "source": "T09n0272_002:0326b09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、如來說一乘者，依第一義說。",
        "translation": "\"When buddhas and tathāgatas teach the One Vehicle, they teach it based on the ultimate truth.",
        "source": "T09n0272_002:0326b10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一義者，唯是一乘，更無第二故。",
        "translation": "The ultimate truth is that it's the One Vehicle alone, and there's no second.",
        "source": "T09n0272_002:0326b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326b11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我佛國土所有外道——僧佉、毘世師、遮梨迦尼乾子等，皆是諸佛、如來方便，皆是如來神力住持，世間能見。",
        "translation": "All the non-Buddhists in our Buddha land - Saṃkhya, Vaiśeṣika, Śāriputra, and Nirgrantha - are all Buddhas, Tathāgatas, and their skillful means, which are maintained by the Tathāgata's supernormal power and can be seen in the world.",
        "source": "T09n0272_002:0326b11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0326b14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸如來善除一切諸惡對故。",
        "translation": "\"It's because the tathāgatas skillfully remove all harmful oppositions.",
        "source": "T09n0272_002:0326b14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、如來名為善逝，有怨對者無有是處。",
        "translation": "\"The buddhas and tathāgatas are called 'well gone,' and there's no place for someone who holds a grudge against them.",
        "source": "T09n0272_002:0326b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間轉輪聖王成就少分善根功德，斷絕善根非究竟法，具足一切貪、瞋、癡等諸結煩惱，不離三有，不離一切諸使煩惱，不離一切垢染煩惱。",
        "translation": "\"Suppose a worldly wheel-turning sage king achieves a modicum of virtue from good roots, stops good roots that aren't the ultimate dharma, is fully fettered with all the afflictions of greed, anger, and delusion, doesn't part with the three existences, doesn't part with all the afflictions of tendencies, and doesn't part with all the afflictions of defilement.",
        "source": "T09n0272_002:0326b16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼轉輪王畢竟無有一切怨對，畢竟無有一切敵對。",
        "translation": "After all, that wheel-turning king has no enemies whatsoever, and after all, he has no enemies whatsoever.",
        "source": "T09n0272_002:0326b19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0326b21_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以轉輪王無怨刺故。",
        "translation": "\"It's because the wheel-turning king has no grudge.",
        "source": "T09n0272_002:0326b21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b21_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況如來成就一切功德智慧，得不斷絕大慈悲心，行於無漏虛空法界，滿足七覺諸善功德，畢竟成就不忘失法，能轉無上大妙法輪，畢竟成就無上菩提，而有棘刺諸魔、怨刺外道敵對，無有是處。",
        "translation": "How much more so when the Tathāgata has attained all meritorious wisdom, attained the mind of unceasing great compassion, practices in the untainted space reality realm, fulfills the good qualities of the seven factors of awakening, ultimately accomplishes the Dharma of not forgetting, turns the unsurpassed great marvelous dharma wheel, and ultimately achieves unsurpassed enlightenment, there's no place for thorns, demons, or non-Buddhist opponents.",
        "source": "T09n0272_002:0326b22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我佛國土所有僧佉、毘世師、遮梨迦尼乾子等，皆是如來住持力故，方便示現。",
        "translation": "我佛國土所有僧佉、毘世師、遮梨迦尼乾子等，皆是如來住持力故，方便示現。",
        "source": "T09n0272_002:0326b26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326b28_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸外道善男子等，雖行種種諸異學相，皆同佛法，一橋梁度，更無餘濟故。",
        "translation": "Although these non-Buddhists and good sons practice various forms of training, they are all the same as the Buddha's teaching, and they are saved by a single bridge, leaving nothing else to help.",
        "source": "T09n0272_002:0326b28_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326c01_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切禽獸無有能於師子王前立出聲者。",
        "translation": "\"There's no animal that can make a sound in front of the lion king.",
        "source": "T09n0272_002:0326c01_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326c02_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來師子大丈夫王具足十力、四無所畏，一切外道尼乾子等，無一敢於如來境中與佛、世尊諍法是非，作師子吼者，無有是處，除諸如來方便力者。",
        "translation": "The Tathāgata lion king of great men is so fully endowed with the ten powers and four forms of fearlessness that no outsider like Nirgrantha would dare to argue with the Buddha or the Bhagavān about what's right or wrong in the Tathāgata's realm, or to make a lion's roar, except for those who are endowed with the power of the Tathāgata's skillful means.",
        "source": "T09n0272_002:0326c03_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326c06_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日輪出能放大光明羅網，一切諸虫螢火光明皆悉休息，一切摩尼諸火光明亦不能現。",
        "translation": "Like a sun wheel that emits a bright net of light, all the fireflies and insects that glow are at rest, and all the maṇi fires and lights can't be seen.",
        "source": "T09n0272_002:0326c06_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326c08_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來出世，放大智慧日輪光明，一切外道尼乾子虫螢火智慧諸光明等皆悉閉塞不能顯現。",
        "translation": "When the Tathāgata appears in the world, he magnifies the sun-wheel light of wisdom, and all the non-Buddhist fireflies and other lights of wisdom from the nyagyas and worms are shut off and can't be seen.",
        "source": "T09n0272_002:0326c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鐵王名阿塞件陀，彼所在處，一切凡鐵皆不敢住。",
        "translation": "\"Suppose the iron king is named Assaji Sundarī, and where he is, all ordinary iron doesn't dare to stand.",
        "source": "T09n0272_002:0326c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0326c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以獨相故，不共凡鐵同在一處。",
        "translation": "Because of their unique characteristics, they don't share the same place as ordinary iron.",
        "source": "T09n0272_002:0326c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來鐵王亦復如是，隨何國土出世之處，一切凡鐵諸外道等，皆不得生。",
        "translation": "\"So it is with the Tathāgata Iron King, too, that wherever a land arises in the world, all ordinary people, iron, non-Buddhists, and so forth won't be allowed to be born.",
        "source": "T09n0272_002:0326c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0326c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以佛如來獨相出世故。",
        "translation": "\"It's because the Tathāgata Buddha appears in the world alone.",
        "source": "T09n0272_002:0326c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如何等何等處所有如意寶摩尼王出，彼處不生偽琉璃珠。",
        "translation": "\"It's like where and how many wish-granting maṇi kings emerge that don't produce pseudo-lapis lazuli beads.",
        "source": "T09n0272_002:0326c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來如意大智寶王，隨何國土出現於世，彼處一切諸外道等，皆不得生。",
        "translation": "\"Whatever land the Tathāgata Tathāgata's wish, the great jeweled king of wisdom appears in the world, all the non-Buddhists there will not be allowed to be born.",
        "source": "T09n0272_002:0326c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_002:0326c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如何等寶性中出閻浮檀金，彼處不出諸銅鐵等。",
        "translation": "\"It's like the gold of jambu trees that comes from the nature of what kind of treasure, and the bronze and iron that don't come from that place.",
        "source": "T09n0272_002:0326c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來寶性亦復如是，隨何國土出現於世，彼處不生諸外道等。",
        "translation": "\"The Tathāgata's precious nature is likewise such that, in whatever land it appears in the world, non-Buddhists and so forth won't arise there.",
        "source": "T09n0272_002:0326c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此義故，汝應當知，隨何國土如來出世，彼處不生諸外道等。",
        "translation": "For this reason, you should know that in whatever land the Tathāgata appears in the world, there won't be non-Buddhists or the like born there.",
        "source": "T09n0272_002:0326c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0326c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_002:0326c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我佛國土有諸外道尼乾子等，皆是如來住持力故，為欲示現不可思議方便境界。",
        "translation": "\"In our Buddha-lands, there are non-Buddhists like Nirgrantha and others who want to show the unfathomable realm of skillful means because of the Tathāgata's abiding power.",
        "source": "T09n0272_002:0326c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0326c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸一切諸外道等，皆是住於不可思議解脫門故，皆是大智究竟般若波羅蜜門故，一切皆得大方便力奮迅自在故，一切皆得不捨佛法僧等念故，一切皆到第一彼岸，以大神力教化眾生故，一切皆得如來加力教化眾生故。」",
        "translation": "All of these non-Buddhists abide at the gate of inconceivable liberation, all are at the gate of the ultimate wisdom and prajñāpāramit, all attain the great power of skillful means and swiftness, all attain mindfulness of not abandoning the Buddha, Dharma, and Saṃgha, all reach the first shore, teach sentient beings with great supernormal powers, and all attain the Tathāgata's empowering power to teach sentient beings.\"",
        "source": "T09n0272_002:0326c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此一乘門時，八千天子依聲聞行，聞一乘已，發阿耨多羅三藐三菩提心；五百比丘得住一乘平等大智燈明三昧；千二百萬菩薩得無生忍。",
        "translation": "When this teaching of the One Vehicle was given, 8,000 gods practicing as direct disciples heard of the One Vehicle and then aroused the mind of unsurpassed, correct, and complete enlightenment, 500 monks attained the samādhi of the great lamp of wisdom that is the equality of the One Vehicle, and 12 million bodhisattvas attained the patient acceptance of nonarising.",
        "source": "T09n0272_002:0327a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三千大千世界六種震動，諸天在於虛空界中，悉皆雨天優鉢羅華、鉢頭摩華、拘牟頭華、分陀利華，雨天栴檀諸末香等，一切盈滿如來足下。",
        "translation": "As these three thousand great one-thousand worlds shake in six ways, the gods in the realm of space all rain down celestial upalas, padma flowers, kumuda flowers, and puṇḍarīka flowers, as well as celestial sandalwood and other fragrances, all filling the Tathāgata's feet.",
        "source": "T09n0272_002:0327a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量百千諸天子等，住虛空中，作諸百千種種伎樂，俱出妙聲供養如來，雨天衣雨，擊諸天鼓，而作是言：「我於世間未曾聞此希有上妙最勝法門。」",
        "translation": "An immeasurable number of hundreds of thousands of celestials and sons of gods standing in the sky created a hundred thousand kinds of music and music, all making marvelous sounds in support of the Tathāgata, raining down heavenly garments, beating celestial drums, and saying, \"Never before in the world have I heard this rare, wonderful, and most excellent teaching.\"",
        "source": "T09n0272_002:0327a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白佛言：「世尊！",
        "translation": "Again, he said to the Buddha, \"Bhagavān!",
        "source": "T09n0272_002:0327a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願此法門究竟住於閻浮提中，作大饒益一切眾生。」",
        "translation": "May this teaching ultimately abide in Jambudvīpa and work to greatly benefit all sentient beings.\"",
        "source": "T09n0272_002:0327a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八千比丘尼各各脫身所著上衣奉獻如來。",
        "translation": "Each of the 8,000 nuns and bhikṣus took off the upper robe they were wearing and presented it to the Tathāgata.",
        "source": "T09n0272_002:0327a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「文殊汝當知，　　諸佛勝方便，　我出有法時，　　方便示時濁。",
        "translation": "It was then that the Bhagavān spoke in verse, \"Mañjuśrī, you should know that the buddhas are excellent in their skillful means, and when I produced the existent Dharma, my skillful means revealed its temporal impurity.",
        "source": "T09n0272_002:0327a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切時有法，　　畢竟常清淨，　隨眾生受法，　　故現眾生濁。",
        "translation": "All the teachings that exist at the time are ultimately eternally pure, and as sentient beings receive the teachings, they are therefore manifested as the turbidity of sentient beings.",
        "source": "T09n0272_002:0327a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛勝智人，　　出於妙劫中，　國土常清淨，　　是故說無濁。",
        "translation": "All buddhas of superior wisdom emerge from a marvelous eon, and their lands are always pure; therefore, they say there's no turbidity.",
        "source": "T09n0272_002:0327a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於無量劫，　　具足修苦行，　清淨諸業障，　　得勝智功德，　能於無量劫，　　壽命常無盡，　除佛方便力，　　是故無命濁。",
        "translation": "Throughout measureless eons, I've fully cultivated ascetic practices, purified karmic hindrances, and attained the merit of superior knowledge, which enables me to live for measureless eons with an eternally inexhaustible lifespan, except for the power of the Buddha's skillful means, which makes my life unsullied.",
        "source": "T09n0272_002:0327a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生起常想，　　故我示無常，　以無數劫命，　　示行短壽相。",
        "translation": "Because sentient beings give rise to the notion of permanence, I will show them impermanence and use their incalculably long lives to demonstrate the short-lived nature of their conditioned activities.",
        "source": "T09n0272_002:0327a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來勝功德，　　無量劫所修，　薄福怯眾生，　　聞生驚怖心，　為此眾生故，　　分別差別說，　究竟皆成佛，　　更無有餘乘。",
        "translation": "The Tathāgata's excellent qualities have been cultivated for measureless eons, but fortunately shallow and timid sentient beings become frightened when they hear them. For the sake of these sentient beings, I discriminate and teach them separately, so that they all eventually become buddhas and there's no more vehicle.",
        "source": "T09n0272_002:0327a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我為化眾生，　　分別說餘道，　漸化令入一，　　故無三差別。",
        "translation": "For the sake of transforming sentient beings, I discriminate other paths and gradually teach them to enter the one, so there are no three distinctions.",
        "source": "T09n0272_002:0327b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如善射師，　　快能知刀箭，　為教諸弟子，　　一藝種種說。",
        "translation": "Like a good marksman who quickly knows swords and arrows, he teaches his disciples the various ways to practice one art.",
        "source": "T09n0272_002:0327b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來亦如是，　　為成就眾生，　而於一法中，　　種種差別說。",
        "translation": "The Tathāgata is likewise, teaching various kinds of distinctions in a single teaching for the sake of accomplishing sentient beings.",
        "source": "T09n0272_002:0327b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於諸眾生，　　無有差別心，　以器不同故，　　所說有分別。",
        "translation": "I have no discriminating mind among sentient beings because the vessels are different and there's discrimination in what's taught.",
        "source": "T09n0272_002:0327b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若無平等心，　　人說我慳嫉，　自取最上乘，　　與眾生下法。",
        "translation": "If I didn't have an equal mind, people would say I'm stingy and jealous, and I would claim the highest vehicle and give sentient beings the lowest dharma.",
        "source": "T09n0272_002:0327b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　上因陀羅寶，　　隨處青光色，　普照物皆同，　　而寶無分別。",
        "translation": "The Indra treasure is a blue-hued light that shines everywhere, illuminating everything equally, but there's no discrimination among the treasures.",
        "source": "T09n0272_002:0327b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛無上智寶，　　光明照世間，　同一菩提色，　　離諸分別心。",
        "translation": "The Buddha's unsurpassed jewel of wisdom shines brightly in the world, is the same color of enlightenment, and is free of discriminated thoughts.",
        "source": "T09n0272_002:0327b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如微少火，　　增長成大明，　諸羅漢少智，　　增長成佛慧。",
        "translation": "It's like a tiny amount of fire that grows into a great light, and the little wisdom of arhats grows into the wisdom of buddhas.",
        "source": "T09n0272_002:0327b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸眾生，　　往詣須彌處，　依須彌光力，　　一切同一色。",
        "translation": "All sentient beings go to Sumeru, and depending on the power of Sumeru's light, they're all the same color.",
        "source": "T09n0272_002:0327b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是諸眾生，　　住佛須彌法，　如來法力故，　　同一佛色身。",
        "translation": "Thus, all sentient beings abide in the Buddha's Sumeru teaching, and because of the power of the Tathāgata's teaching, they are one Buddha's form body.",
        "source": "T09n0272_002:0327b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如蜜蜂[口*(隹/乃)]，　　集諸種種物，　置在一器中，　　和合成一味。",
        "translation": "It's like a bee [mouth*(short-tailed/nai)] that gathers various ingredients, puts them in a single container, and combines them into a single flavor.",
        "source": "T09n0272_002:0327b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛說三亦爾，　　為熟眾生根，　說諸種種法，　　成佛菩提味。",
        "translation": "Similarly, the Buddha teaches three things, teaching various things to ripen the faculties of sentient beings and creating the taste of the Buddha's enlightenment.",
        "source": "T09n0272_002:0327b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如轉輪王，　　出無怨敵對，　我法王出時，　　亦無外道刺。",
        "translation": "Like the wheel-turning king who emerges without opposition, when our Dharma king emerges, there are no non-Buddhists to pierce it.",
        "source": "T09n0272_002:0327b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如日輪出，　　餘光皆閉塞，　佛日輪出已，　　外道自除滅。",
        "translation": "Like the sun wheel emerging, the other lights are shut off, and after the Buddha's sun wheel emerges, the non-Buddhists themselves are removed.",
        "source": "T09n0272_002:0327b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨生鐵王處，　　不生餘凡鐵，　隨佛所生處，　　不生諸外道，　隨生妙金處，　　不生餘銅鐵，　隨佛成道處，　　自然無外道。",
        "translation": "Where the iron king is born, no other ordinary iron is born, where the Buddha is born, no non-Buddhists are born, where fine gold is born, no other copper or iron is born, and where the Buddha attains enlightenment, there are naturally no non-Buddhists.",
        "source": "T09n0272_002:0327c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如摩尼寶，　　不共穢雜住，　是故出生處，　　無偽琉璃珠。",
        "translation": "Like the maṇi jewel that doesn't live in common with defilements, it's born where there are no counterfeit lapis lazuli beads.",
        "source": "T09n0272_002:0327c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來摩尼珠，　　出處亦如是，　不雜諸外道，　　同時一國土。",
        "translation": "The Tathāgata's maṇi jewel comes forth from a place like this, unadulterated by non-Buddhists and at the same time a single land.",
        "source": "T09n0272_002:0327c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　外道大神通，　　皆自在菩薩，　汝當知方便，　　示現如是相。",
        "translation": "The great supernormal powers of non-Buddhists are all self-perfecting bodhisattvas, so you should know how to skillfully display such appearances.",
        "source": "T09n0272_002:0327c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸菩薩，　　聞諸外道等，　具足方便力，　　皆發歡喜心，　各各生尊重，　　奉獻恭敬意，　散華供養佛，　　種種妙香薰。",
        "translation": "When all the bodhisattvas hear that these non-Buddhists possess the power of skillful means, they all rejoice, each gives rise to respect, offer respect, scatter flowers in homage to the Buddha, and perfume him with various wonderful fragrances.",
        "source": "T09n0272_002:0327c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼說法時，　　大地六種動，　虛空出聲言，　　希有未曾聞，　無量諸天子，　　空中合掌讚，　同聲言善哉，　　善哉修伽陀。」",
        "translation": "When he taught the Dharma, six kinds of earthly movement occurred, and a voice arose from the sky saying, \"That's rare and unheard, and measureless sons of gods joined their palms in praise from the air, saying with one voice, 'Good, good Shugata.'\"",
        "source": "T09n0272_002:0327c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎大薩遮尼乾子所說經詣嚴熾王品第四爾時南方國大薩遮尼乾子與八十八千萬尼乾子俱，遊行諸國教化眾生，次第到於欝闍延城。",
        "translation": "It was then that the great satya-nirgrantha of the southern kingdom, together with eighty-eight million nirgranthas, traveled through the countries teaching sentient beings and arrived in the city of Ujjayan in order.",
        "source": "T09n0272_002:0327c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量百千諸眾，或歌或舞，吹脣唱嘯，作百千萬種種伎樂，前後侍從大薩遮尼乾子詣欝闍延城。",
        "translation": "An uncountable hundred thousand multitudes of people, some singing and dancing, blowing their voices, singing and whistling, and creating a million different kinds of music, accompanied and followed the great Satya-nirgrantha to the city of Ujjayan.",
        "source": "T09n0272_002:0327c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國主嚴熾大王聞大薩遮尼乾子眾，從南大國與無量眾詣欝闍延。",
        "translation": "It was then that the king, Yama, heard that a multitude of Mahāsatya-nirgrantha had arrived in Ujjayan with an incalculable number of people from the southern kingdoms.",
        "source": "T09n0272_002:0327c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是已，即生尊重大薩遮尼乾子心。",
        "translation": "After hearing this, he became respectful to Vairocana Nirgrantha.",
        "source": "T09n0272_002:0327c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生尊重心已，為欲迎大薩遮尼乾子，以大王力、王神通力、王奮迅力與諸大臣及諸王子、受學師長、合家眷屬、國大長者、諸小城邑聚落土主、象、馬、車、步四部大眾前後導從，恭敬圍遶，椎鍾鳴鼓，作百千種無量伎樂，打百千種諸妙聲鼓，吹百千種諸妙聲蠡，建百千萬種種雜色繒蓋幢幡，散百千萬種種妙華：優波羅華、鉢頭摩華、拘牟頭華、分陀利華、阿輸迦華、薄拘羅華、鞞羅迦華、阿提目多伽華，遍布道路，金瓶、銀瓶盛百千種諸雜妙花，以百千種諸寶香爐燒無價香，置前而行，詣薩遮尼乾子處。",
        "translation": "生尊重心已，為欲迎大薩遮尼乾子，以大王力、王神通力、王奮迅力與諸大臣及諸王子、受學師長、合家眷屬、國大長者、諸小城邑聚落土主、象、馬、車、步四部大眾前後導從，恭敬圍遶，椎鍾鳴鼓，作百千種無量伎樂，打百千種諸妙聲鼓，吹百千種諸妙聲蠡，建百千萬種種雜色繒蓋幢幡，散百千萬種種妙華：優波羅華、鉢頭摩華、拘牟頭華、分陀利華、阿輸迦華、薄拘羅華、鞞羅迦華、阿提目多伽華，遍布道路，金瓶、銀瓶盛百千種諸雜妙花，以百千種諸寶香爐燒無價香，置前而行，詣薩遮尼乾子處。",
        "source": "T09n0272_002:0327c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大薩遮尼乾子遙見嚴熾王與大眾來，薩遮尼乾子見已下道，在一樹下敷座而坐。",
        "translation": "When the great Satya-nirgrantha saw King Yama and the crowd coming from a distance, Satya-nirgrantha saw them and got off the road, spread out his seat under a tree, and sat down.",
        "source": "T09n0272_002:0328a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時嚴熾王遙見薩遮在樹下坐，即下象輿，步詣薩遮尼乾子所，坐摩尼寶百千巧妙無價莊嚴如意寶床。",
        "translation": "Seeing Satsanian sitting under the tree from a distance, King Yanzhi then dismounted from his elephant mooch and walked over to Satsanianzi, where he sat on a jeweled, priceless, high-quality, wish-granting bed of maṇi-jewel.",
        "source": "T09n0272_002:0328a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大薩遮尼乾子問訊於王，作如是言：「善來，大王！",
        "translation": "The great Satya-nirgrantha then greeted the king and said, \"Good, great king!",
        "source": "T09n0272_002:0328a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王今善種無上最勝希有功德，福多不少。",
        "translation": "\"Now, the king has the unsurpassed, most rare, and excellent qualities of good seeds, which are abundant in merit.",
        "source": "T09n0272_002:0328a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0328a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以王能降天尊、貴重、自在之心，屈意卑下來詣沙門問訊起居。",
        "translation": "Because the king was able to subdue the gods' honored, noble, and sovereign minds, he stooped to come to the ascetic to inquire about his upbringing and abode.",
        "source": "T09n0272_002:0328a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝所治國內無諸盜賊、亡命群黨亂人民不？",
        "translation": "Are there no thieves, bandits, or outlaws in your country who would disrupt the people?",
        "source": "T09n0272_002:0328a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有諸官殘暴侵食諸人民不？",
        "translation": "Are there no officials who brutally prey on the people?",
        "source": "T09n0272_002:0328a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諸異業奸偽憍詐、欺誑世間諸人民不？",
        "translation": "Are there any non-traditional activities that are fraudulent and deceitful and that deceive the people of the world?",
        "source": "T09n0272_002:0328a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諸反叛嬈亂國土諸人民不？",
        "translation": "Are the people of the land free from rebellion and disorder?",
        "source": "T09n0272_002:0328a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諸偷劫相竊盜不？",
        "translation": "Are there no such things as thefts?",
        "source": "T09n0272_002:0328a22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所在邊國諸官禁司無欺大王、不行王命不？",
        "translation": "Do the officials and guardians of the border lands not deceive the king and disobey his commands?",
        "source": "T09n0272_002:0328a22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T09n0272_002:0328a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝所治化國內所有沙門、修淨行人安樂住不？",
        "translation": "Do all the ascetics and practitioners of purification in the country that you're teaching live in comfort?",
        "source": "T09n0272_002:0328a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣服、飲食、房舍、臥具、疾病、湯藥資生所須一切之物不乏不少不？",
        "translation": "Are there not too many things needed for clothing, food, shelter, bedding, sickness, and medicine to support life?",
        "source": "T09n0272_002:0328a24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝國人民皆得善心，尊重、供養諸沙門、眾淨行人不？",
        "translation": "Have all the people of your country become well-intentioned, respectful, and supportive of the ascetics and pure practitioners?",
        "source": "T09n0272_002:0328a26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T09n0272_002:0328a27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今所治國內無諸屠獵、羅網河嶽、焚燒山澤、放鷹走狗、鉤刺魚鼈、彈射禽獸、作諸坑陷、毒箭機撥行殺害不？",
        "translation": "Is there no butchering or hunting, no netting of rivers and peaks, no burning of mountains and swamps, no hawks and dogs, no hooking or stabbing of fish or turtle, no shooting of birds or animals, no sinking or poisoning of arrows, and no killing by machines in the country you now rule?",
        "source": "T09n0272_002:0328a27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T09n0272_002:0328b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今一國之主制命自在，教令善惡，無敢違者。",
        "translation": "Now, you're the ruler of a kingdom who has the authority to make orders, teaching what's good and what's bad, and no one dares to disobey.",
        "source": "T09n0272_002:0328b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝登王位所設教令無不善不？",
        "translation": "Is there a teaching or order that you set when you ascended to the throne that isn't good?",
        "source": "T09n0272_002:0328b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國內人民所行善惡汝悉知不？",
        "translation": "Do you know all the good and evil deeds of the people of the land?",
        "source": "T09n0272_002:0328b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能行善者汝勸進不？",
        "translation": "Do you encourage those who can do good deeds?",
        "source": "T09n0272_002:0328b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行不善者汝勸捨不？",
        "translation": "Do you encourage those who do unwholesome things to abandon them?",
        "source": "T09n0272_002:0328b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T09n0272_002:0328b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝身不起惡念加害一切二足、四足、多足、無足諸眾生不？",
        "translation": "Do you not harbor bad thoughts in your body that harm all beings who are two-legged, four-legged, many-legged, or no-legged?",
        "source": "T09n0272_002:0328b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0328b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T09n0272_002:0328b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知一切眾生有識之類，寶重身命，無不畏死，至於業對百年壽終，莫問老少無一引分言應去者。",
        "translation": "You should know that all sentient beings of consciousness value body and life, and none of them fear death, so when their karma ends in a hundred years, no one, young or old, is cited as saying they should go.",
        "source": "T09n0272_002:0328b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0328b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛命重故，何況加害而不生惱，命終之後更相怨嫉，與怨相報無有窮已。",
        "translation": "How could they love life so much that they don't become angry when they inflict harm on it, and then become embittered after their lives end, with no limit to the amount of retribution they'll receive from each other?",
        "source": "T09n0272_002:0328b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故大王！",
        "translation": "Therefore, Great King!",
        "source": "T09n0272_002:0328b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當遠離殺生之罪，捨離刀杖，無起害心。",
        "translation": "You must avoid the sin of killing, abandon the sword and bludgeon, and not become harmful.",
        "source": "T09n0272_002:0328b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離偷盜之罪，捨自資生，當生知足，於他資生無起欲心。",
        "translation": "Now, you must part with the sin of stealing, abandon self-made birth, and become contented, so you don't give rise to desires for the necessities of other births.",
        "source": "T09n0272_002:0328b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離邪婬之罪，自妻知足，他妻無求，無起邪心。",
        "translation": "Now, you should avoid the sin of sexual misconduct, be satisfied with your own wife, have no desire for another wife, and don't give rise to wrong thoughts.",
        "source": "T09n0272_002:0328b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離妄語之罪，常作實語，出言成法，無發虛言。",
        "translation": "Now, you should avoid the sin of false speech and always speak truly, producing words that become the Dharma and not speaking falsehoods.",
        "source": "T09n0272_002:0328b14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離兩舌之罪，無破壞語，於已破者當念和合，無起壞心。",
        "translation": "Now, you should avoid the sin of duplicity, refrain from speaking destructively, and be mindful of the harmony of those who have already broken it, so you don't become destructive.",
        "source": "T09n0272_002:0328b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離惡口之罪，常作愛語、柔軟妙語，無起麁語。",
        "translation": "Now, you should avoid the sin of harsh speech and always speak lovingly and softly, and don't give rise to harsh speech.",
        "source": "T09n0272_002:0328b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離綺語之罪，常決定語、憶念語，無不正語。",
        "translation": "Now, you should avoid the sin of fancy speech and always speak with certainty, remembering speech, and no incorrect speech.",
        "source": "T09n0272_002:0328b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離貪欲之罪，於他受用無希望心，於他所護無生奪心，生歡喜心。",
        "translation": "Now, you should part with the sin of desire, have no hope for the enjoyment of others, have no desire to plunder what's protected by others, and become joyous.",
        "source": "T09n0272_002:0328b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T09n0272_002:0328b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離瞋恚之罪，常生慈心，清淨心業，無起恨心。」",
        "translation": "Now, you must part with the sin of anger, always be kind, purify your mental activities, and not become hateful.\"",
        "source": "T09n0272_002:0328b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大王！",
        "translation": "\"Great king!",
        "source": "T09n0272_002:0328b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應當遠離邪見之罪，見自業果，隨順聖人而生正見，無起異見。",
        "translation": "Now, you should avoid the sin of wrong views, see the results of your own actions, and follow sages to produce right views without giving rise to different views.",
        "source": "T09n0272_002:0328b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_002:0328b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生之罪能令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、短命；二者、多病。",
        "translation": "The sin of killing causes sentient beings to fall into hell, animals, and hungry ghosts, and if they are born among humans, they'll obtain two kinds of results: one, short life; two, lots of illness.",
        "source": "T09n0272_002:0328b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偷盜之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、貧窮；二者、共財，不得自在。",
        "translation": "The sin of stealing also causes sentient beings to fall into hell, animals, and hungry ghosts, and if they are born among humans, they'll attain two kinds of results: one, poverty; two, shared possessions and not being able to be free.",
        "source": "T09n0272_002:0328b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邪婬之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、婦不受語；二者、自妻為他侵奪。",
        "translation": "The sin of sexual misconduct also causes sentient beings to fall into hell, the animal kingdom, and the hungry ghosts, and if a person is born among humans, it brings two kinds of results: first, a woman who doesn't receive words; and second, a wife who's plundered by others.",
        "source": "T09n0272_002:0328b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄語之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、常為他人所謗；二者、常為他人所誑。",
        "translation": "The sin of lying also causes sentient beings to fall into hell, the animal kingdom, and the hungry ghosts, and if they are born among humans, they'll attain two kinds of results: one, they'll always be disparaged by others; two, they'll always be deceived by others.",
        "source": "T09n0272_002:0328c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩舌之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、得破壞眷屬；二者、得弊惡眷屬。",
        "translation": "The sin of duplicity also causes sentient beings to fall into hell, the animal kingdom, and the hungry ghosts, and if they are born among humans, they'll attain two kinds of results: one, they'll attain a destructive retinue; the other, they'll attain a bad retinue.",
        "source": "T09n0272_002:0328c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡口之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、不聞善名；二者、常起鬪諍。",
        "translation": "The sin of harsh speech also causes sentient beings to fall into hell, the animal kingdom, or the hungry ghosts, and if they are born among humans, they'll attain two kinds of results: 1) Not hearing a good reputation; and 2) Always starting a fight.",
        "source": "T09n0272_002:0328c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "綺語之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、得不敬重語；二者、言無定實，不為他樂。",
        "translation": "The sin of fancy speech also causes sentient beings to fall into hell, the animal kingdom, and the hungry ghosts, and if they are born among humans, they'll attain two kinds of results: 1) They'll attain irreverent speech; 2) They'll speak indefinitely and not for the pleasure of others.",
        "source": "T09n0272_002:0328c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪欲之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、不知足；二者、常生貪心。",
        "translation": "The sin of desire also causes sentient beings to fall into hell, the animals, and hungry ghosts, and if they are born among humans, they'll attain two kinds of rewards: one, not knowing enough; and two, always having craving.",
        "source": "T09n0272_002:0328c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋恚之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、無安隱心；二者、常念損害無有慈心。",
        "translation": "The sin of anger also causes sentient beings to fall into hell, animals, and hungry ghosts, and if they are born among humans, they'll attain two kinds of results: one, a lack of peace of mind; and two, constant mindfulness of harm and lack of kindness.",
        "source": "T09n0272_002:0328c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邪見之罪亦令眾生墮於地獄、畜生、餓鬼，若生人中得二種果報：一者、常生邪見家；二者、心常諂曲。",
        "translation": "The sin of wrong views also causes sentient beings to fall into hell, the animal kingdom, and the hungry ghosts, and if they are born among humans, they'll attain two kinds of results: one, always being born in a wrong home; and two, always being flattered in mind.",
        "source": "T09n0272_002:0328c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "\"You should know, Great King!",
        "source": "T09n0272_002:0328c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量無邊苦聚，皆由十不善業集因緣故。",
        "translation": "Such an immeasurable and limitless mass of suffering is caused by the accumulation of ten unskillful actions.",
        "source": "T09n0272_002:0328c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故大王！",
        "translation": "Therefore, Great King!",
        "source": "T09n0272_002:0328c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝莫放逸輕作惡業，當觀諸法有為無常，一切世間無可保者，人命無常住少時間，勿生常想。",
        "translation": "Don't be careless and lightly create bad karma; observe that all things are artificial and impermanent, that there's no one in the world to protect, and that human life is impermanent for a short time; don't give rise to the idea of permanence.",
        "source": "T09n0272_002:0328c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王當觀！",
        "translation": "Observe that, Your Majesty!",
        "source": "T09n0272_002:0328c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劫初已來天尊王位、土地人民皆就無常，無一在者，當知此身甚為危脆，如焰、如響、如影、如電、如水中月、如鏡中像、如水聚沫、如水上泡、如芭蕉實、如琢石火、如夢所見、如山谷中瀑水卒起遍滿溝澗，須臾過盡還就枯竭。",
        "translation": "Since the beginning of the eon, the positions of the gods, kings, and people of the land have all become impermanent, and there's no one left who's there. You should know that this body is very fragile, like a flame, like a sound, like a shadow, like lightning, like the moon in water, like an image in a mirror, like foam in water, like bubbles on water, like the substance of a plantain, like a cut stone on fire, like what's seen in a dream, like a waterfall in a valley that suddenly rises and fills a gully, and then dries up again after a short time.",
        "source": "T09n0272_002:0328c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王當知！",
        "translation": "You should know this, Your Majesty!",
        "source": "T09n0272_002:0328c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身命非實，無常亦爾，俄爾零落，就未來世不可免脫。",
        "translation": "\"My body and life are not real, and neither is impermanence, so I'll suddenly fall apart, and I won't be able to escape in the future.",
        "source": "T09n0272_002:0328c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故大王！",
        "translation": "Therefore, Great King!",
        "source": "T09n0272_002:0328c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫恃現在，當畏未來。",
        "translation": "Don't rely on the present; be afraid of the future.",
        "source": "T09n0272_002:0328c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王當知！",
        "translation": "You should know this, Your Majesty!",
        "source": "T09n0272_002:0329a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡果報共相追逐，如聲發響、如影隨形，無能免者，亦如連鎖不可斷絕，莫輕作業自招重苦。」",
        "translation": "The results of good and evil are pursued together like a sound that arises and a shadow that follows its shape; there's no escape from them, and they're like a chain that can't be cut off; don't act lightly and bring heavy suffering on your own.\"",
        "source": "T09n0272_002:0329a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大薩遮尼乾子重說偈言：「大王汝今當，　　莫作放逸行，　若不捨諸惡，　　死必入地獄。",
        "translation": "It was then that the Mahāsatya-nirgrantha repeated the verse, \"Now, Great King, don't engage in careless behavior; if you don't abandon evil, you'll surely go to hell when you die.",
        "source": "T09n0272_002:0329a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以作惡行者，　　定入泥犁故，　攝心不放逸，　　生天帝釋處。",
        "translation": "Because those who do bad deeds will surely enter the nirvāṇa, they'll be born in Indra's place if they control their thoughts and don't act carelessly.",
        "source": "T09n0272_002:0329a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸眾生，　　無不愛壽命，　王若求長生，　　不應行殺害。",
        "translation": "All sentient beings are desirous of longevity, so if the king seeks long life, he shouldn't kill or injure them.",
        "source": "T09n0272_002:0329a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大王知世人，　　辛苦集財寶，　常憂不活命，　　不應起侵奪。",
        "translation": "The king knows that people who laboriously gather wealth and treasure are always worried that they won't live, so he shouldn't plunder them.",
        "source": "T09n0272_002:0329a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以不侵奪故，　　生處常富足，　若故侵損他，　　常生貧窮家。",
        "translation": "Because they don't plunder, they'll always be born in a place of plenty, but if they thus plunder others, they'll always be born in a poor family.",
        "source": "T09n0272_002:0329a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　節己莫婬他，　　自妻生足心，　是故妻愛己，　　不為他人侵。",
        "translation": "They should temper themselves and not lust after others, and their own wives will become satisfied; therefore, their wives will love them, and they won't be attacked by others.",
        "source": "T09n0272_002:0329a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　莫說虛妄言，　　常念依實語，　實語生帝釋，　　妄語生餓鬼。",
        "translation": "Don't speak false words; always remember to rely on true speech, for true speech gives rise to Tissa and false speech gives rise to hungry ghosts.",
        "source": "T09n0272_002:0329a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常念離兩舌，　　和合破壞人，　眷屬常雍穆，　　退此生梵天。",
        "translation": "Always mindful that he's free of duplicity, his harmony destroys people, and his retinue is always peaceful, so he's born in the Brahma Heaven.",
        "source": "T09n0272_002:0329a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　出言莫麁獷，　　說令他樂聞，　善語生天上，　　常聞美妙音。",
        "translation": "Speaking not harshly, but speaking so others will enjoy hearing it, good words are born in the heavens, and they always hear beautiful sounds.",
        "source": "T09n0272_002:0329a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　念離諸綺語，　　善思美妙言，　報生天帝釋，　　諸天欽受教。",
        "translation": "Mindful that they'll part with fancy speech and well-considered beautiful words, they'll be rewarded with birth in Indra's heaven and the gods will respectfully accept their teaching.",
        "source": "T09n0272_002:0329a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲自利益，　　莫令侵惱他，　生貪來世報，　　錢財資五家。",
        "translation": "If you want to benefit yourself, don't allow others to be offended, become greedy for the rewards of the future, and accumulate money and possessions for your five families.",
        "source": "T09n0272_002:0329a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若不修慈悲，　　能行瞋害心，　雖行諸善行，　　死入於泥犁。",
        "translation": "If someone doesn't cultivate compassion, they'll act out their anger and become harmful, and even though they perform good actions, they'll be sentenced to death in the mire.",
        "source": "T09n0272_002:0329a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大王汝今當，　　應捨瞋恚癡，　常慈念眾生，　　莫行諸怒害。",
        "translation": "Now, great king, you must abandon anger, ill-will, and delusion, always have compassion for sentient beings, and don't act out anger that harms them.",
        "source": "T09n0272_002:0329a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　王當捨邪見，　　堅固正見心，　常持清淨法，　　天中受樂身。",
        "translation": "The king should abandon wrong views, firmly establish the mind of right views, and always maintain pure dharmas, so that you'll enjoy a pleasant body in the heavens.",
        "source": "T09n0272_002:0329b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　比丘修梵行，　　汝當常供養，　是故捨惡道，　　受樂於天上。」",
        "translation": "Monks who cultivate the religious practice should always make offerings to you; therefore, abandoning the bad path, you'll be blessed in heaven.\"",
        "source": "T09n0272_002:0329b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大薩遮尼乾子問訊王已，為嚴熾王說不放逸十善業道相應法已，默然而住。",
        "translation": "After the Mahāsatya-nirgrantha replied to the king, he explained the teaching associated with the path of the ten non-careless wholesome activities to King Yanzhi and quietly stayed there.",
        "source": "T09n0272_002:0329b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大薩遮尼乾子所說經卷第二",
        "translation": "*Mahāsatya-nirgrantha-putra-vyākaraṇa-sūtra, Volume 2",
        "source": "T09n0272_002:0329b07_1",
        "is_bad_quality": false
    }
]