[
    {
        "source_sentence": "佛說廣博嚴淨不退轉輪經卷",
        "translation": "Foshuo guangbo yanjing buzhuanlun jing roll",
        "source": "T09n0268_001:0254b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一",
        "translation": "first",
        "source": "T09n0268_001:0254b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋涼州沙門智嚴譯",
        "translation": "Song Dynasty Liangzhou Śrīgupta Zhigyan Translation",
        "source": "T09n0268_001:0254b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇陀林中給孤獨園精舍，與大比丘眾千二百五十人俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's monastery in the Jeta's Grove of Śrāvastī with a large assembly of twelve hundred and fifty monks.",
        "source": "T09n0268_001:0254b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊於夜後分入無垢光三昧，文殊師利法王子於夜後分入遍照三昧，彌勒菩薩摩訶薩於夜後分入遍炬三昧。",
        "translation": "At the time, the Bhagavān entered the vimala-nirbhāsa samādhi after nightfall, Mañjuśrī the Dharma Prince entered the pervasive illumination samādhi after nightfall, and Maitreya the Bodhisattva Mahāsattva entered the pervasive torch samādhi after nightfall.",
        "source": "T09n0268_001:0254b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者舍利弗，於夜後分明相出時，佛神力故從自房出詣文殊師利房。",
        "translation": "When Venerable Śāriputra was emerging from his room with his vision after midnight, the Buddha's spiritual power caused him to emerge from his room and go to Mañjuśrī's room.",
        "source": "T09n0268_001:0254b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者舍利弗，欲入文殊師利房時，遙見佛精舍邊有十千蓮花迴旋圍繞，聞大音樂歌頌之聲，彼諸蓮花出大光明，遍照祇洹及舍衛國，乃至三千大千世界。",
        "translation": "At the time, Venerable Śāriputra was about to enter Mañjuśrī's room when he saw 10,000 lotus flowers circling the edge of the Buddha's abode and heard the sound of great music and singing, and those lotus flowers emitted a great radiance that radiated throughout the country of Gaṇḍa and Śrāvastī and up to the 3,000 great one-thousand worlds.",
        "source": "T09n0268_001:0254b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者舍利弗，便不復見文殊師利房，而自見身在文殊師利前立，見文殊師利結加趺坐而入三昧；即便彈指不能令寤，高聲謦咳亦不能寤。",
        "translation": "Venerable Śāriputra then no longer saw Mañjuśrī's abode but saw himself standing in front of Mañjuśrī, sitting cross-legged and entering samādhi; even when he flicked his fingers, he couldn't wake up, and even when he coughed aloud, he couldn't wake up.",
        "source": "T09n0268_001:0254c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者舍利弗，見文殊師利如此神力，自見其身處大海水，欲從其所，以神足力，乘虛還詣本所住房，而不能去。",
        "translation": "Venerable Śāriputra then, seeing Mañjuśrī's extraordinary powers, saw himself standing in the vast ocean water, wanted to leave his place, and with supernormal powers, he rode back into the sky to his original dwelling, but couldn't leave.",
        "source": "T09n0268_001:0254c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者舍利弗，即於文殊師利前結加趺坐，一心瞻仰目不暫眴。",
        "translation": "Venerable Śāriputra then sat cross-legged in front of Mañjuśrī, gazing up at him with a concentrated mind and eyes that didn't dazzle for a moment.",
        "source": "T09n0268_001:0254c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時文殊師利與舍利弗東行，過一恒河沙世界到一佛土，其世界名說不退轉音聲，佛號華光開敷遍身如來，即見彼佛身諸毛孔皆出蓮花，其花遍滿一萬由旬，皆出光明遍照三千大千世界，其華開敷有百千葉，金剛為根，光網為莖，阿牟茶馬瑙為鬚，閻浮那提寶為臺；其花臺上有菩薩坐，已於阿耨多羅三藐三菩提不退轉，得陀羅尼具五神通逮得諸忍，以三十二相而自嚴身，身真金色。",
        "translation": "Mañjuśrī and Śāriputra then traveled eastward, passing through a world of Ganges sands to a buddha land whose name was the Tathāgata who spoke the irreversible sound of the Buddha's name, Flower Light Blossoming and Pervading Body, and they saw lotus flowers emerging from every pore of the Buddha's body, which filled 10,000 leagues and shone brightly throughout 3,000 great thousand worlds.",
        "source": "T09n0268_001:0254c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時華光開敷遍身如來，臍中出一蓮花，光色嚴淨有百千葉，金剛為根，青琉璃為莖，因陀羅網寶為鬚，優勒迦娑羅栴檀寶王為臺，其花明淨塵垢不污，空無坐者。",
        "translation": "It was then that the Tathāgata Prabhūtaratna was enveloped in a brilliant radiance, and from his navel there emerged a lotus flower with a hundred thousand brilliant and pure leaves, a vajra root, a blue-glazed stem, a jeweled Indra's net for its beard, and a jeweled platform made of the Uḍakhāsara sandalwood king, whose bright and pure flowers are unsullied by dirt and are empty of sitting people.",
        "source": "T09n0268_001:0254c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利，往蓮花臺上結加趺坐，即與花俱上昇虛空乃至有頂，還至佛所右遶三匝頭頂禮敬，還坐花上一心合掌瞻仰世尊。",
        "translation": "At the time, Mañjuśrī went to sit cross-legged on the lotus-flower dais, rose with the flower into the sky up to the top of existence, returned to the Buddha, circled him three times to his right, bowed his head, and venerated him, returned to sit on the flower, and with one heart folded his palms looked up to the Bhagavān.",
        "source": "T09n0268_001:0254c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時花光開敷遍身如來，知而故問文殊師利：「從何所來？」",
        "translation": "Knowing this, the flower-bright, pervasive-body Tathāgata asked Mañjuśrī, \"Where did this come from?\"",
        "source": "T09n0268_001:0254c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利白花光開敷遍身如來言：「我從娑婆世界來。」",
        "translation": "Mañjuśrī's white-flowered radiance spread all over the Tathāgata's body as he said, \"I've come from the sahāgata world.\"",
        "source": "T09n0268_001:0254c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼佛有二侍菩薩摩訶薩，一名美音，二名妙音，已於阿耨多羅三藐三菩提不退轉，從蓮華臺下整衣服右膝著地，一心合掌白佛言：「娑婆世界去此近遠？」",
        "translation": "At the time, the Buddha had two attendants, a bodhisattva Mahāsattva, one called Maitreya and the other called Sumeru, who had attained the unsurpassed, correct enlightenment and had not turned back, come down from the lotus dais, put on their robes, kneel on the ground, put their palms together with one heart, and said to the Buddha, \"How near is the Śāvaka world?\"",
        "source": "T09n0268_001:0254c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時花光開敷遍身如來告二菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Flower Light Blossoming Pervasive Body Tathāgata addressed the two bodhisattvas Mahāsattvas, saying, \"Good sons!",
        "source": "T09n0268_001:0255a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑婆世界今在西方，過恒河沙佛土，文殊師利從彼土來。」",
        "translation": "The sahā world is now in the west, beyond the sands of the Ganges Buddha land, and Mañjuśrī has come from that land.\"",
        "source": "T09n0268_001:0255a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩復白佛言：「娑婆世界現在說法佛名何等？」",
        "translation": "The two bodhisattvas then again said to the Buddha, \"What's the name of the Buddha who's teaching the Dharma in the Saha world right now?\"",
        "source": "T09n0268_001:0255a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「彼佛名釋迦牟尼，今現在說法。」",
        "translation": "The Buddha said, \"That Buddha's name is Śākyamuni, and he's now teaching the Dharma.\"",
        "source": "T09n0268_001:0255a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白佛言：「彼佛世尊為說何法？」",
        "translation": "Again, he said to the Buddha, \"What teaching did that Bhagavān give?\"",
        "source": "T09n0268_001:0255a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「釋迦牟尼佛說三乘法。」",
        "translation": "The Buddha said, \"Śākyamuni Buddha taught the Dharma of the three vehicles.\"",
        "source": "T09n0268_001:0255a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白佛言：「云何名三乘？」",
        "translation": "Again, he said to the Buddha, \"What do we call the three vehicles?\"",
        "source": "T09n0268_001:0255a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「三乘者所謂：聲聞乘、辟支佛乘、佛乘。」",
        "translation": "The Buddha said, \"The three vehicles are called the śrāvaka vehicle, the pratyekabuddha vehicle, and the Buddha vehicle.\"",
        "source": "T09n0268_001:0255a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「諸佛說法皆不等耶？」",
        "translation": "The two bodhisattvas then said to the Buddha, \"Are all the teachings of the buddhas not equal?\"",
        "source": "T09n0268_001:0255a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸佛說法皆悉平等。」",
        "translation": "The Buddha said, \"All buddhas are equal when they teach the Dharma.\"",
        "source": "T09n0268_001:0255a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「云何平等？」",
        "translation": "The two bodhisattvas then said to the Buddha, \"How are they equal?\"",
        "source": "T09n0268_001:0255a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「一切諸佛皆說廣博嚴淨不退轉輪法，是故平等。」",
        "translation": "The Buddha said, \"All buddhas teach the vast, ornate, and pure nonretrogressing wheel dharma; therefore, they are equal.\"",
        "source": "T09n0268_001:0255a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「何故釋迦文佛說三乘法？」",
        "translation": "The two bodhisattvas then said to the Buddha, \"Why did Śākyamuni Buddha teach the Dharma of the three vehicles?\"",
        "source": "T09n0268_001:0255a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「娑婆世界眾生，心樂小法不堪大乘，諸佛如來以方便力說三乘法；釋迦文佛出五濁世，彼諸眾生不能堪受大乘之法，以方便故分別說三。」",
        "translation": "The Buddha said, \"Since the minds of sentient beings in the Saṃbha world are attracted to lesser things and are unable to accept the great vehicle, the Tathāgatas explain the three vehicles by the power of skillful means; the Śākyamuni Buddha emerged from the five turbid realms, and those sentient beings were unable to accept the great vehicle teaching, so he explained the three with skillful means.\"",
        "source": "T09n0268_001:0255a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「釋迦文佛於娑婆世界說法甚難。」",
        "translation": "The two bodhisattvas then said to the Buddha, \"It's very difficult for Śākyamuni Buddha to preach in the Saṃbha world.\"",
        "source": "T09n0268_001:0255a18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, \"So it is!",
        "source": "T09n0268_001:0255a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T09n0268_001:0255a20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛說法實為甚難。」",
        "translation": "It's really very difficult for that Buddha to preach.\"",
        "source": "T09n0268_001:0255a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「我等今者獲大善利不生彼國。」",
        "translation": "The two bodhisattvas then said to the Buddha, \"Now, we won't be born in that country because of the great good benefits we've received.\"",
        "source": "T09n0268_001:0255a20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T09n0268_001:0255a22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫作是言，應速悔過。」",
        "translation": "Don't say that; you should quickly repent of your faults.\"",
        "source": "T09n0268_001:0255a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「世尊！",
        "translation": "The two bodhisattvas then said to the Buddha, \"Bhagavān!",
        "source": "T09n0268_001:0255a22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞彼國說法甚難，乃無一念樂生彼國。",
        "translation": "I heard how difficult it was to teach in that country, but I didn't have a single thought about wanting to be born there.",
        "source": "T09n0268_001:0255a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故悔過？」",
        "translation": "Why do you repent?\"",
        "source": "T09n0268_001:0255a24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「速捨此語，應當悔過。",
        "translation": "The Buddha said, \"Quickly abandon this talk, and you should repent.",
        "source": "T09n0268_001:0255a24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0268_001:0255a25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於此土二十億百千那由他劫種諸善根，不如彼佛世界，以一食頃說諸波羅蜜，教一眾生，受三自歸，奉持五戒，遠離聲聞心，如是菩薩所行甚難；何況以出家正法發菩提心而作饒益，如是菩薩倍為甚難功德無量。",
        "translation": "If planting good roots in this land for two billion billion billion billion nayutas isn't like that Buddha's world, where he teaches one sentient being the three refuges, observes the five precepts, and parts with the mind of the śrāvakas during one meal, such a bodhisattva's actions are extremely difficult, not to mention the benefits he'll receive from renunciant practitioners who arouse the mind of enlightenment with the right teaching, which is twice as difficult and has incalculable merit.",
        "source": "T09n0268_001:0255a25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0268_001:0255b01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑婆世界多穢惡故。」",
        "translation": "It's because the sahā world is full of defilements and evils.\"",
        "source": "T09n0268_001:0255b01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「娑婆世界有何穢惡？」",
        "translation": "The two bodhisattvas then said to the Buddha, \"What are the defilements and evils of the sahā world?\"",
        "source": "T09n0268_001:0255b02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告美音、妙音：「娑婆世界穢惡之事，以我神口盡汝壽量說不可盡。",
        "translation": "The Buddha told Maitreya and Miaowon, \"The defiling things of the sahā world are inexhaustible because my divine mouth has exhausted your lifespan in speaking about them.",
        "source": "T09n0268_001:0255b02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0268_001:0255b04_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼土眾生煩惱厚重，多行貪欲、瞋恚、愚癡，無量無邊諸不善法，我以佛智乃能具知。」",
        "translation": "The sentient beings of that land are so heavily afflicted that they often engage in desire, anger, and folly, and there are measureless and limitless unwholesome things that I can fully understand with Buddha's wisdom.\"",
        "source": "T09n0268_001:0255b04_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩，即三讚歎：「善哉，善哉！",
        "translation": "The two bodhisattvas then praised them three times, \"Good, good!",
        "source": "T09n0268_001:0255b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦牟尼！",
        "translation": "Śākyamuni!",
        "source": "T09n0268_001:0255b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉，善哉！",
        "translation": "Bravo, bravo!",
        "source": "T09n0268_001:0255b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦師子！",
        "translation": "Śākyamuni!",
        "source": "T09n0268_001:0255b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉，善哉！",
        "translation": "Bravo, bravo!",
        "source": "T09n0268_001:0255b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦仙王！」",
        "translation": "Sage King Śākyamuni!\"",
        "source": "T09n0268_001:0255b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是歎已，一心合掌懺悔：「先來諸不善心，若離貪欲、瞋恚、愚癡，無量無邊諸不善法；若曾發心求聲聞、辟支佛，今悉懺悔。」",
        "translation": "After praising him, he joined his palms together with one heart and repented, \"If I had parted with desire, anger, and folly, which are countless and limitless, and if I had ever set my mind to seek the śrāvakas and pratyekabuddhas, I would now have repented.\"",
        "source": "T09n0268_001:0255b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦欲明淨求佛智心順解脫心，為得佛智故，為一切眾生故，以無著善根相應心，持七寶花，其花皆出百千光色，有百千葉，金剛為根，因陀羅寶網為鬚，優勒迦娑羅栴檀寶王為臺，以一切諸寶王為莖，其花明淨塵垢不污，可以眼識識，不可以手觸，猶如幻化果報，從三昧正觀生，於虛空中遙散釋迦文佛上；所散之花，於虛空中變成花鬘、華雲、華蓋、寶鬘、寶雲、寶蓋、繒鬘、繒雲、繒蓋，供養釋迦牟尼佛。",
        "translation": "Also wanting to clarify and purify the mind of seeking Buddha-wisdom and accord with the mind of liberation, in order to attain Buddha-wisdom and for the sake of all sentient beings, he holds, with a mind concomitant with the good root of nonattachment, a flower of seven treasures that produces a hundred thousand brilliant colors and has a hundred thousand leaves, with vajra as its root, Indra's precious net as its beard, Ulukasaara's sandalwood king as its platform, and all the king's treasures as its stalk.",
        "source": "T09n0268_001:0255b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以百千種色花鬘、末香、塗香、細末、栴檀，遙散釋迦牟尼佛上而以供養。",
        "translation": "They also scattered a hundred thousand different kinds of flower garlands, powdered incense, coated incense, fine powder, and sandalwood far and wide to offer their support to Śākyamuni Buddha.",
        "source": "T09n0268_001:0255b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於彼處五體投地，頂禮釋迦牟尼佛足，作如是言：「南無釋迦牟尼佛及娑婆世界諸菩薩摩訶薩，發大莊嚴成就大精進力諸先舊者，能持正法有大威力，能利益一切眾生而作照明，正求一乘，能守護三世佛法城塹，不斷佛種住娑婆世界者。」",
        "translation": "Throwing his five bodies to the ground, he bowed his head at the feet of Śākyamuni Buddha and said, \"Namaste to Śākyamuni Buddha and the bodhisattvas and mahāsattvas of the Saha world who have arisen great adornment, accomplished great zeal, and have generations of ancestors, who are capable of upholding the right teaching with great authority, who illuminate for the benefit of all sentient beings, who correctly pursue the One Vehicle, who guard the moat of the Dharma city of the three times, and who don't stop living in the Saha world as the seed of the Buddha.\"",
        "source": "T09n0268_001:0255b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是言：「我今應往彼土見釋迦牟尼佛，并諸菩薩摩訶薩及餘眾生。」",
        "translation": "He said, \"Now, I should go to that land to see Śākyamuni Buddha, the bodhisattvas, the great beings, and the rest of the world.\"",
        "source": "T09n0268_001:0255b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時花光開敷遍身如來，聞二菩薩作如是言，又籌量觀察深心所行，復以佛法誡勅安慰告言：「善男子！",
        "translation": "After hearing these two bodhisattvas say this, the Blossom Light Blossoming Pervasive Body Tathāgata measured and observed what they were doing in their profound minds, and then he instructed, reassured, and comforted them with the Buddha's teaching, saying, \"Good sons!",
        "source": "T09n0268_001:0255c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今欲往娑婆世界，見釋迦牟尼佛，并諸菩薩及餘眾生者，當生尊重心、憐愍心、饒益心。",
        "translation": "\"Now, if you want to go to the Saha world and see Śākyamuni Buddha, the bodhisattvas, and the other sentient beings, you must give rise to feelings of respect, kindness, and benefit.",
        "source": "T09n0268_001:0255c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0268_001:0255c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩，於甚深法不生怖畏，亦不誹謗，能奉三世諸佛教戒，以無著心種諸善根，不為果報勤行諸波羅蜜。",
        "translation": "Those bodhisattvas don't become frightened of the profound Dharma, don't denigrate it, adhere to the precepts of the Buddhas of the three times, plant good roots with a mind free of attachment, and diligently practice the perfections without expecting rewards.",
        "source": "T09n0268_001:0255c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩摩訶薩等，以本願故生彼佛土，為守護諸佛法城塹故，亦欲遍學一切佛法故。",
        "translation": "These bodhisattvas, mahāsattvas, and others were born in that Buddha land because of their original vows, in order to guard the moats of the buddha-fascicle, and because they want to thoroughly study all the buddha-teachings.",
        "source": "T09n0268_001:0255c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今欲往彼見耶？」",
        "translation": "Do you want to go there now and see them?\"",
        "source": "T09n0268_001:0255c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩白佛言：「世尊！",
        "translation": "The two bodhisattvas then said to the Buddha, \"Bhagavān!",
        "source": "T09n0268_001:0255c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若承佛神力及三世諸佛威勢護助，願欲往見。」",
        "translation": "If I were to accept the Buddha's spiritual power and the authoritative support of the buddhas of the three times, I'd want to go there to see him.\"",
        "source": "T09n0268_001:0255c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時華光開敷遍身如來告，美音、妙音菩薩摩訶薩：「今欲往者，當與文殊師利法王子俱往。",
        "translation": "It was then that the Tathāgata Kōkai Omnipresent addressed the Bodhisattvas Maheṣṭhila and Maitreya Maitreya, \"Now, if you want to go there, you must go with Mañjuśrī, the Dharma Prince.",
        "source": "T09n0268_001:0255c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子當共汝往。」",
        "translation": "Good sons, you will go with him.\"",
        "source": "T09n0268_001:0255c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時美音、妙音菩薩摩訶薩，語文殊師利法王子言：「我今因仁者力，欲往娑婆世界，見釋迦如來并諸菩薩及餘眾生。」",
        "translation": "It was then that Mañjuśrī and Maitreya-svara Bodhisattva Mahāsattva said to Mañjuśrī, the Dharma Prince, \"Now, by the power of a kind man, I want to go to the Śākya Tathāgata, the bodhisattvas, and the other sentient beings in the Śiva World.\"",
        "source": "T09n0268_001:0255c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言：「善男子！",
        "translation": "Mañjuśrī said, \"Good man!",
        "source": "T09n0268_001:0255c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲往十方世界，多供養恭敬尊重讚歎禮拜諸佛，為令一切眾生入佛菩提得佛智故。」",
        "translation": "Now, I want to go to the worlds of the ten directions and make many offerings to, honor, respect, praise, and venerate the buddhas in order to cause all sentient beings to enter buddhahood and attain buddha-wisdom.\"",
        "source": "T09n0268_001:0255c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二菩薩語文殊師利言：「我今亦共仁者至十方世界，多供養恭敬尊重讚歎禮拜諸佛。",
        "translation": "Those two bodhisattvas then said to Mañjuśrī, \"Now, I would like to go with you, Sir, to the worlds of the ten directions to make many offerings to, honor, respect, praise, and venerate the buddhas.",
        "source": "T09n0268_001:0255c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如仁者為一切眾生入佛菩提得佛智故，我亦隨學。」",
        "translation": "Just as you, sir, have made it possible for all sentient beings to enter into the Buddha's enlightenment and attain the Buddha's wisdom, so have I followed suit.\"",
        "source": "T09n0268_001:0255c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利，頂禮花光開敷遍身如來，右遶三匝尊重恭敬，與彼菩薩并尊者舍利弗，受佛教已一心瞻仰漸漸却退，以如幻花而用散佛，以眾花鬘聚、塗香末香聚、諸幢幡蓋聚，皆是先佛威神之力，能生歡喜踊躍欣樂，以供養佛，以供養法，為令眾生得解脫故。",
        "translation": "It was then that Mañjuśrī paid homage to the Tathāgata Prabhūtaratna, circled him three times to his right, respected and venerated him, and together with that bodhisattva and Venerable Śāriputra, they single-mindedly venerated the Buddha after accepting his teaching and gradually withdrew to scatter him with illusory flowers, gather flowers and garlands, scatter incense and fragrances, and gather banners and flags, all of which were made by the power of the Buddha's authority and soul and could produce joy, happiness, and joyfulness, for the sake of nurturing the Buddha and nurturing the Dharma so that sentient beings might attain liberation.",
        "source": "T09n0268_001:0255c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養佛已，猶如壯士屈伸臂頃，於彼佛前忽然不現，在東方恒河沙佛前自然而現，皆悉如上說廣博嚴淨不退轉輪法。",
        "translation": "After making offerings to the Buddha, he's like a strong man who suddenly disappears in front of the Buddha while flexing and extending his arm and then naturally appears in the east in front of the Ganges River Sands Buddha, all as described above, explaining the vast, ornate, and pure nonretrogressing Wheel Dharma.",
        "source": "T09n0268_001:0255c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛世界無有女人，亦無聲聞、辟支佛乘，世界莊嚴皆如蓮華開敷遍身如來佛土，菩薩莊嚴充滿其國亦復如是。",
        "translation": "There are no women in that Buddha's world, nor are there any vehicles of śrāvakas or pratyekbuddhas, and the world's adornment is like a lotus blossoming out all over the body of the Tathāgata Buddha's land, and so is the adornment of the bodhisattvas that fills his land.",
        "source": "T09n0268_001:0256a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國諸佛臍中皆出一大蓮花，文殊師利而坐其上，恭敬供養現諸神變皆亦如上。",
        "translation": "From the navels of the buddhas in that country emerges a large lotus flower, on which Mañjuśrī sits and venerates and makes offerings, and the manifestations of his miracles are likewise.",
        "source": "T09n0268_001:0256a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南、西、北方、四維、上、下亦復如是，一一方面恒河沙諸佛如來，文殊師利而現其前，彼諸世尊，皆說廣博嚴淨不退轉輪法。",
        "translation": "So it was with the Tathāgatas of the south, west, north, four counterpoints, upper, and lower, and with a single Ganges River Sands Buddha Tathāgata in front of which Mañjuśrī appeared, those world-honored ones taught the extensive, adorned, and pure nonretrogressing Wheel Dharma.",
        "source": "T09n0268_001:0256a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦遣侍者菩薩摩訶薩，此諸菩薩下蓮花臺，一心念佛合掌恭敬諮問彼佛：「云何名三乘？」",
        "translation": "They also sent an attendant, the bodhisattva Mahāsattva, who descended from the lotus-flower dais, mindfully recollected the Buddha with his palms together, respectfully questioned him, \"What do we call the three vehicles?\"",
        "source": "T09n0268_001:0256a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦欲因文殊師利威神力往娑婆世界見釋迦牟尼佛聽受法教。",
        "translation": "They also wanted to go to the Śākya Mūṇi Buddha in the Śāmbara world because of Mañjuśrī's authoritative power to hear the teaching of the Dharma.",
        "source": "T09n0268_001:0256a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利皆悉安慰，十方世界諸菩薩摩訶薩：「我當共汝至娑婆世界，見釋迦牟尼佛。」",
        "translation": "Mañjuśrī reassured all the bodhisattvas and mahāsattvas of the world in the ten directions, \"I will go with you to the Śākya World to see Śākyamuni Buddha.\"",
        "source": "T09n0268_001:0256a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是時間於此娑婆世界閻浮提中夜猶未曉。",
        "translation": "It was still late at night in Jambudvīpa in the Saṃbha world.",
        "source": "T09n0268_001:0256a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者阿難從房門孔有光來入，即從床起出自房時，見有光明照祇陀林日猶未出，見祇陀林大水盈滿，其水澄清無諸擾濁，房舍園林悉皆不現便作是念：「今日必說未曾有法，故現斯瑞。」",
        "translation": "Venerable Ānanda then entered through the doorway of his room with a light, and when he rose from his bed and got out of his room, he saw a light shining in the Jetavana Grove before the sun had risen, saw the Jetavana Grove filled to overflowing with water, and its water was clear and undisturbed; the house and garden were all unappearing.",
        "source": "T09n0268_001:0256a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者阿難，舉足入水不沒不濕，心生歡喜詣佛精舍，見一萬蓮花迴旋圍遶世尊精舍，聞大音樂歌頌之聲，彼諸蓮花出大光明，照祇陀林及舍衛國，乃至三千大千世界。",
        "translation": "Venerable Ānanda then lifted his feet into the water, didn't get drenched or wet, and was overcome with joy as he visited the Buddha's retreat and saw 10,000 lotus flowers circling the Bhagavān's retreat and heard the sound of great music and singing, and those lotus flowers emitted a great radiance that shone forth from the Jetavana Grove and Śrāvastī and throughout the 3,000 great one-thousand worlds.",
        "source": "T09n0268_001:0256a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛威神故乃令阿難，心生歡喜，右膝著地一心合掌頂禮世尊，如是時間天已明了。",
        "translation": "Because of the Buddha's authority, Ānanda's heart rejoiced, and he bowed his head to the Bhagavān with his right knee on the ground and his palms together with one heart.",
        "source": "T09n0268_001:0256a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛精舍邊迴旋蓮華中有一蓮華，忽然而來至祇陀林處中而住。",
        "translation": "It was then that a lotus among the revolving lotus flowers at the edge of the Buddha's abode suddenly came and stayed at Jeta's Grove.",
        "source": "T09n0268_001:0256a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者阿難見是事已便作此念：「我今應往為佛世尊敷置法座。",
        "translation": "After Venerable Ānanda saw this, he had this thought, \"Now, I should go prepare the Dharma seat for the Bhagavān.",
        "source": "T09n0268_001:0256a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0268_001:0256b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今有此瑞必說大法。」",
        "translation": "Now, with this auspicious sign, he must explain the great teaching.\"",
        "source": "T09n0268_001:0256b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難為佛世尊敷置法座，當爾之時，大地六變震動，乃至十方恒沙世界皆亦震動——動、遍動、等遍動，起、遍起、等遍起，震、遍震、等遍震，搖、遍搖、等遍搖，踊、遍踊、等遍踊，吼、遍吼、等遍吼。",
        "translation": "At the time, Ānanda was preparing the Dharma seat for the Bhagavān, and at that point, the earth shook in six ways, even as the world of sands in the ten directions also shook-moving, omnipresent, and completely moving; arising, omnipresent, and completely arising; shaking, omnipresent, and completely shaking; shaking, omnipresent, and completely shaking; roaring, omnipresent, and completely roaring.",
        "source": "T09n0268_001:0256b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時天雨優鉢羅華、波頭摩花、拘物頭華、分陀利花，如是等花遍滿三千大千世界，華果諸樹自然而現。",
        "translation": "It then rained down blue lotus flowers, padma flowers, kovidāra flowers, and puṇḍarī flowers, and such flowers filled the 3,000 great thousand worlds, and the flowers and fruit trees naturally appeared.",
        "source": "T09n0268_001:0256b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時比丘僧欲出祇陀園門而不能出，見祇陀林大水盈滿，其水澄清無諸擾濁，房舍園林悉皆不現，唯見大光遍照祇洹，集在房門而作是言：「今現此瑞必說大法。」",
        "translation": "When the monks who wanted to leave the entrance of Jeta's Park but couldn't, they saw the Jeta's Grove filled to overflowing with water, its water was clear and undisturbed, and none of the buildings or the grove appeared, except for a great light that shone everywhere in Jeta's Park, and they gathered at the entrance of their rooms and said, \"This auspicious sign must be the teaching of the great Dharma.\"",
        "source": "T09n0268_001:0256b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從三昧安祥而起，出自精舍，昇所敷座。",
        "translation": "The Bhagavān then rose peacefully from his samādhi, emerged from the monastery, and ascended to lay out his seat.",
        "source": "T09n0268_001:0256b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當爾之時，釋迦牟尼佛及十方佛放大光網，其光皆有百千種色照明正法，令諸眾生生歡喜故。",
        "translation": "At the time, Śākyamuni Buddha and the buddhas of the ten directions magnified their webs of light, each of which had a hundred thousand different colors illuminating the true teaching and causing sentient beings to rejoice.",
        "source": "T09n0268_001:0256b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利，遊諸佛土皆與二菩薩俱，所經佛土皆悉禮拜供養諸佛尊重讚歎，為眾生故，為得佛智故，為攝眾生受教化故，現不可思議神變之事，隨其所樂而為說法。",
        "translation": "At the time, Mañjuśrī traveled to all the buddha lands and joined the two bodhisattvas, venerating and making offerings to them wherever they passed, honoring and praising them, performing unfathomable miraculous acts for the sake of sentient beings, for the sake of attaining Buddha's wisdom, and for the sake of bringing sentient beings into the fold for instruction, and teaching them at their own will.",
        "source": "T09n0268_001:0256b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時文殊師利法王子，知釋迦牟尼佛已昇法座，與諸菩薩摩訶薩，從地踊出住於佛前，與無量阿僧祇百千萬億那由他菩薩摩訶薩，遶釋迦牟尼佛滿百千匝，持百千萬種種色花。",
        "translation": "When Mañjuśrī, the Dharma Prince, knew that Śākyamuni had risen to the Dharma throne, he and the other bodhisattvas, mahāsattvas, rose from the ground and stayed in front of the Buddha with an incalculably large number of bodhisattvas, a hundred thousand million nayutas, mahāsattvas, and surrounded Śākyamuni a hundred thousand turns, carrying a hundred thousand million flowers of various colors.",
        "source": "T09n0268_001:0256b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其花有不可思議百千萬葉，皆生歡喜踊躍欣樂以散佛上，所散諸花遍滿三千大千世界。",
        "translation": "Those flowers had unfathomably millions of leaves, and they all rejoiced and jumped for joy as they scattered them on top of the Buddha, filling the 3,000,000 worlds with the flowers they scattered.",
        "source": "T09n0268_001:0256b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以優迦娑羅細末栴檀而散佛上，復以種種花香，其香亦有百千種色，常出戒香、忍香、精進香、禪香、慧香、智方便香、神通香、六波羅蜜香、無所著香、具諸道品方便之香，其栴檀香，能生歡喜踊躍欣樂，其香光明，皆是十方諸佛神力之所守護，為供養釋迦牟尼佛故，發大精進、勇猛精進、超勝精進、堅固精進、無等等精進，供養釋迦牟尼佛。",
        "translation": "Again, he scattered Ucchuṣma's finely ground sandalwood on top of the Buddha, and then he scattered various flowers with fragrances that were also a hundred thousand different colors, always producing the fragrance of precepts, forbearance, effort, meditation, wisdom, wisdom and skillful means, superknowledge, the six perfections, the fragrance of no attachments, and the fragrance of the skillful means that fulfill the qualities of the path, which produces the fragrance of sandalwood, rejoices, rises, and exhilarates, and the brightness of its fragrance is guarded by the spiritual powers of the buddhas in the ten directions, so that they can make offerings to Śākyamuni Buddha by generating great effort, vigorous effort, superior effort, resolute effort, and unequalled effort.",
        "source": "T09n0268_001:0256b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利與諸菩薩摩訶薩，便莊嚴此土，化作八楞摩尼寶樹八觚分明；亦有種種寶樹莊嚴，寶蓋幢幡以摩尼寶網，及諸鈴網而嚴飾之；變此大地成摩尼寶，於其地上造諸堂閣，窓牖都欄妙寶牆壁；大小諸河，泉源花池，優鉢羅花、波頭摩花、芬陀利花、摩尼寶花，充滿其中；以甘露水，其水八味流注池中；有種種鳥遊集其上；作是變現為令眾生心歡喜故，為得佛智故，發大堪忍故，發菩薩心故，現如是等無量神變。",
        "translation": "It was then that Mañjuśrī and the bodhisattvas and mahāsattvas adorned this land, creating an eight-lengthened maṇi-jewel tree with eight goblets; various jeweled trees adorned with jeweled canopies, banners, maṇi-jewel nets, and nets of bells; the transformation of this earth into maṇi-jewel; the creation of halls and shrines on the ground, the windows and windows, the walls of marvelous treasures; rivers large and small, springs and flower pools, which were filled with upādhara, padma, puṇḍarī, and maṇi-jewel flowers; the filling of the pools with nectar water with eight flavors; the various birds that roamed on them; and such measureless miraculous powers to cause sentient beings to rejoice, attain Buddha knowledge, become greatly tolerant, and arouse the bodhisattva aspiration.",
        "source": "T09n0268_001:0256c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸佛力，亦是文殊師利法王子力，亦是釋迦牟尼佛本願之力。",
        "translation": "This is the power of the buddhas, the power of Mañjuśrī the Dharma King's son, and the power of Śākyamuni Buddha's original vows.",
        "source": "T09n0268_001:0256c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利及諸菩薩摩訶薩，作是神變已住於佛前。",
        "translation": "It was then that Mañjuśrī and the other bodhisattvas and mahāsattvas performed these miraculous powers and stayed in front of the Buddha.",
        "source": "T09n0268_001:0256c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊放從法生光，遍照文殊師利及諸菩薩摩訶薩身。",
        "translation": "The Bhagavān then radiated a light that arose from the Dharma and shone all over Mañjuśrī and the bodhisattvas' and mahāsattvas' bodies.",
        "source": "T09n0268_001:0256c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令坐故，佛便微笑身出蓮華，其花有百千種色出，無量百千不可思議光，金剛為根，因陀羅寶為鬚，優勒迦娑羅栴檀寶王為臺，在虛空中。",
        "translation": "To make them sit, the Buddha then smiled and a lotus flower with a hundred thousand different kinds of flowers and an unfathomable light of measureless hundreds of thousands of colors emerged from his body, with vajra as its root, Indra's jewel as its beard, and the jeweled king of the Ulūkaśaila sandalwoods as its platform, which was placed in the sky.",
        "source": "T09n0268_001:0256c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩，於其華上結加趺坐。",
        "translation": "The bodhisattvas, the great mahāsattvas, sit cross-legged on top of the flowers.",
        "source": "T09n0268_001:0256c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦牟尼佛，於自臍中放一光明，其光名曰照諸眾生最勝金剛王，即此光中有億那由他蓮花，其花亦出若干種色，其色寂靜無量無邊過於日光，清淨香潔遍照十方。",
        "translation": "In his navel, Śakyamuni Buddha radiates a light called the most excellent vajra king that illuminates all sentient beings, and in that light there are a hundred million nayutas of lotus flowers that also produce various colors, whose colors are quiescent, immeasurable, and limitless, surpassing that of sunlight, and whose pure fragrance pervades the ten directions.",
        "source": "T09n0268_001:0256c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其蓮花中自然變成微妙花帳，而是花帳諸佛所護，從法性生安隱寂靜，順解脫門空、無相、無作，不生不滅相應，踰過三世平等眼所見。",
        "translation": "From within those lotus flowers, they naturally transform into a subtle flower canopy, which is guarded by the buddhas, produces peace and tranquility from the Dharma nature, follows the gate of liberation, and is associated with emptiness, signlessness, and nonarising and nonperishing, surpassing what the equal eye sees in the three worlds.",
        "source": "T09n0268_001:0256c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利安坐花帳身相顯現，一心合掌正念觀佛，所謂佛能通達一切諸法，能生金剛三昧，於一切法無所得三昧。",
        "translation": "Sitting stably in the flower tent, Mañjuśrī's body shape appeared, and he joined his palms with one mind and correctly observed the Buddha, which is described as a Buddha who can penetrate all dharmas, who can give rise to the vajra concentration, and who has the concentration of obtaining nothing from all dharmas.",
        "source": "T09n0268_001:0257a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，知文殊師利及十方諸佛所使菩薩摩訶薩，樂求法者專向一乘，已於先佛種諸善根，為文殊師利之所守護無怯弱心，勤修精進求佛菩提，如是等眾安隱坐已。",
        "translation": "At the time, the Bhagavān knew that Mañjuśrī and the buddhas in the ten directions had made bodhisattvas, mahāsattvas, and those who gladly sought the Dharma were dedicated to the One Vehicle, had planted good roots in previous buddhas, were guarded by Mañjuśrī without faltering, and had diligently cultivated and striven for the Buddha's enlightenment after such a multitude had sat down peacefully.",
        "source": "T09n0268_001:0257a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告阿難：「汝往遍告祇陀林中諸比丘、比丘尼、優婆塞、優婆夷，使集聽法。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"Go and tell all the monks, nuns, laymen, and laywomen in Jeta's Grove to gather to hear the teaching.\"",
        "source": "T09n0268_001:0257a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時尊者阿難詣諸比丘房而告之言：「諸大德！",
        "translation": "Venerable Ānanda then went to the monks' quarters and told them, \"Great men!",
        "source": "T09n0268_001:0257a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊今勅汝等來集聽法。」",
        "translation": "The Bhagavān has now commanded you all to come gather to hear the teaching.\"",
        "source": "T09n0268_001:0257a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「大德阿難！",
        "translation": "The monks said, \"Venerable Ānanda!",
        "source": "T09n0268_001:0257a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等先見此瑞，不能得往。」",
        "translation": "We saw this auspicious sign before, but we couldn't go.\"",
        "source": "T09n0268_001:0257a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「以何事故而不能往？」",
        "translation": "Ānanda said, \"What are the reasons why we can't go?\"",
        "source": "T09n0268_001:0257a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「我等見祇陀林中大水盈滿，其水澄清無諸擾濁，大光遍照，房舍園林悉不復現，以是事故不能得往。」",
        "translation": "The monks said, \"We saw the Jetavana Grove filled to overflowing with water, its water was clear and undisturbed, and a great light was shining everywhere, and none of the buildings or the forest reappeared; for this reason, we couldn't go there.\"",
        "source": "T09n0268_001:0257a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時尊者阿難，還至佛所白佛言：「彼諸比丘不能得來。",
        "translation": "Venerable Ānanda then returned to the Buddha and said, \"Those monks couldn't make it.",
        "source": "T09n0268_001:0257a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0268_001:0257a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作是言：『我等見是祇陀林中大水盈滿，其水澄清無諸擾濁，大光遍照，房舍園林悉不復現，以是事故不能得來。』」",
        "translation": "They said, 'We saw this Jetavana filled to overflowing with water, and its water was clear and undisturbed, and a great light was shining everywhere, so that none of the buildings or the forest reappeared, and this was the reason we couldn't come here.'\"",
        "source": "T09n0268_001:0257a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「彼諸比丘，於非水中而作水想，不但於非水中而作水想，亦於非色中而作色想，非受、想、行、識中作受、想、行、識想，非堅信作堅信想，非堅法作堅法想，非八人作八人想，非須陀洹果作須陀洹果想，非斯陀含果作斯陀含果想，非阿那含果作阿那含果想，非阿羅漢果作阿羅漢果想，非聲聞乘作聲聞乘想，非辟支佛乘作辟支佛乘想。",
        "translation": "The Buddha told Ānanda, \"Those monks not only conceived of water when it wasn't water, but also conceived of form when it wasn't form, conceived of feeling, perception, volition, and consciousness when it wasn't feeling, perception, volition, and consciousness, conceived of firm faith when it wasn't firm faith, conceived of firm dharmas when it wasn't firm dharmas, conceived of the fruit of stream entry when it wasn't stream entry, conceived of the fruit of stream entry when it wasn't the fruit of non-returning, conceived of the fruit of non-returning when it wasn't non-arhat, conceived of the fruit of arhatship when it wasn't the vehicle of the śrāvakas, and conceived of the vehicle of the pratyekabuddhas when it wasn't the vehicle of the pratyekabuddhas.",
        "source": "T09n0268_001:0257a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T09n0268_001:0257a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝往重告諸比丘、比丘尼、優婆塞、優婆夷來集聽法，此法皆是汝等昔所未聞。」",
        "translation": "Go and tell the monks, nuns, laymen, and laywomen again to come gather to hear the teaching, for it's like nothing you've ever heard before.\"",
        "source": "T09n0268_001:0257a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時尊者阿難，復往諸比丘所而告之言：「諸大德！",
        "translation": "Venerable Ānanda then went back to those monks and told them, \"Great men!",
        "source": "T09n0268_001:0257a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告勅汝等來集聽法。」",
        "translation": "The Bhagavān told me to tell you all to come gather to hear the teaching.\"",
        "source": "T09n0268_001:0257b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是音聲遍舍衛國，諸比丘、比丘尼、優婆塞、優婆夷普聞此聲。",
        "translation": "Such was the sound that was heard throughout the country of Śrāvastī by the monks, nuns, laymen, and laywomen.",
        "source": "T09n0268_001:0257b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時尊者阿難，知四部眾聞此語已，還至佛所而白佛言：「我以遍告四眾來集聽法。」",
        "translation": "Venerable Ānanda then knew that the four groups of people who heard this had returned to the Buddha and said, \"I've told the four groups of people throughout the land to come gather to hear the teaching.\"",
        "source": "T09n0268_001:0257b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告大目揵連：「汝速往詣三千大千世界，遍告諸菩薩摩訶薩發大莊嚴者，及諸比丘、比丘尼、優婆塞、優婆夷，天、龍、夜叉、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人與非人，敬信佛法僧久種善根者，集祇陀林聽受正法；此法汝等昔所未聞，天人、阿修羅及餘世間所不能轉，唯於先佛所久種善根，樂求大乘、最勝乘、第一乘、無上乘、無等等乘菩薩摩訶薩，發大莊嚴勤行此法者能受能轉。」",
        "translation": "爾時世尊告大目揵連：「汝速往詣三千大千世界，遍告諸菩薩摩訶薩發大莊嚴者，及諸比丘、比丘尼、優婆塞、優婆夷，天、龍、夜叉、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人與非人，敬信佛法僧久種善根者，集祇陀林聽受正法；此法汝等昔所未聞，天人、阿修羅及餘世間所不能轉，唯於先佛所久種善根，樂求大乘、最勝乘、第一乘、無上乘、無等等乘菩薩摩訶薩，發大莊嚴勤行此法者能受能轉。」",
        "source": "T09n0268_001:0257b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時尊者大目揵連受佛教已，即於佛前忽然不現，猶如壯士屈伸臂頃，遍至三千大千世界，菩薩摩訶薩，比丘、比丘尼、優婆塞、優婆夷，天、龍、夜叉、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人與非人，敬佛、法、僧久種善根者，而告之言：「世尊告勅！",
        "translation": "After Venerable Mahāmaudgalyāyana had accepted the Buddha's teaching, he suddenly disappeared from the Buddha's presence like a strong man stretching out his arm and traveled throughout the 3,000 great one-thousand worlds to find bodhisattvas, mahāsattvas, monks, nuns, laymen, laywomen, gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and nonhumans who had long planted good roots in honor of the Buddha, Dharma, and Saṃgha, and told them, \"Bhagavān, tell me!",
        "source": "T09n0268_001:0257b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等來集聽法。」",
        "translation": "You've all come to gather and listen to the teaching.\"",
        "source": "T09n0268_001:0257b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目揵連，承佛威力及己神足，還至佛所白佛言：「諸聽法眾皆悉已集。」",
        "translation": "At the time, Mahāmaudgalyāyana, acknowledging the Buddha's authority and his own spiritual abilities, returned to the Buddha and said, \"The multitude of people who have heard the teaching has all gathered.\"",
        "source": "T09n0268_001:0257b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時四眾普來集會，縱廣一千由旬；在上諸天及餘眾生，住虛空中者，縱廣五千由旬。",
        "translation": "It was then that four multitudes of people came together, measuring 1,000 leagues in length, and the gods and other sentient beings living up in space, measuring 5,000 leagues in length.",
        "source": "T09n0268_001:0257b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利法王子白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī, the Dharma prince, said to the Buddha, \"Bhagavān!",
        "source": "T09n0268_001:0257b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此四眾諸來集者，一心合掌頂禮如來，供養恭敬，世尊威德未敢就坐，唯願世尊，垂哀聽坐。」",
        "translation": "The four assembled people here bowed their heads with folded hands in unity of heart in homage to the Tathāgata, offered their support and respect, and asked the Bhagavān's dignified presence to grant them pity and listen to them.\"",
        "source": "T09n0268_001:0257b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，熙怡微笑，是時有無量閻浮那提金色蓮花，從地踊出，各百千葉，尸利迦寶為根，因陀羅尼寶為鬚，赤真珠為臺，七寶為莖，大如車輪；諸來會者，在於佛前皆坐其上。",
        "translation": "At the time, the Bhagavān smiled joyfully as measureless golden lotus flowers of Jambūnadī sprouted from the ground, each with a hundred thousand petals, Śrīgarbha jewels for their roots, Indranī jewels for their beards, red real pearls for their platforms, and seven jewels for their stems, each as large as a chariot wheel; all of those who had come to the assembly were sitting on them before the Buddha.",
        "source": "T09n0268_001:0257b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與文殊師利諸來菩薩摩訶薩，三十二相而自莊嚴身真金色，入於三昧身出光明。",
        "translation": "They were accompanied by Mañjuśrī, the bodhisattva-mahāsattva of the coming, who had thirty-two marks and adorned himself with a body of genuine gold and entered samādhi with his body radiating brightly.",
        "source": "T09n0268_001:0257c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利，及諸菩薩摩訶薩，諸來四眾，蓮花臺上曲躬恭敬，一心合掌瞻仰世尊。",
        "translation": "At the time, Mañjuśrī, the bodhisattvas, the mahāsattvas, and the four congregations from the land bent their heads in respect on the lotus-flower dais, united their palms together, and looked up to the Bhagavān.",
        "source": "T09n0268_001:0257c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時文殊師利白佛言：「世尊！",
        "translation": "Mañjuśrī then said to the Buddha, \"Bhagavān!",
        "source": "T09n0268_001:0257c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此四眾虛空諸天皆已坐定，唯願如來等正覺，說廣博嚴淨不退轉輪法，今此會眾比丘、比丘尼、優婆塞、優婆夷、百千諸天，皆生須陀洹果想、斯陀含果想、阿那含果想、阿羅漢果想、聲聞乘想、辟支佛乘想。",
        "translation": "Now that these four heavenly bodies have sat down, may the Tathāgata, the Completely Enlightened One, explain the extensive, ornate, and pure nonretrogressing Wheel of Dharma, and may this congregation of monks, nuns, laymen, laywomen, and a hundred thousand gods give rise to the conceptions of the fruit of stream entry, the fruit of once-returning, the fruit of non-returning, the fruit of arhatship, the vehicle of the śrāvaka, and the vehicle of the pratyekabuddha.",
        "source": "T09n0268_001:0257c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，為除此眾如是諸想，以何因緣，世尊說須陀洹果、斯陀含果、阿那含果、阿羅漢果、聲聞乘、辟支佛乘？」",
        "translation": "May it please the Bhagavān, in order to remove these various perceptions, what are the causes and conditions for the Bhagavān to teach about the fruit of stream entry, the fruit of once-returning, the fruit of non-returning, the fruit of the arhat, the śrāvaka vehicle, and the pratyekabuddha vehicle?\"",
        "source": "T09n0268_001:0257c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊默然。",
        "translation": "The Bhagavān was silent.",
        "source": "T09n0268_001:0257c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時尊者舍利弗白佛言：「世尊！",
        "translation": "Venerable Śāriputra then said to the Buddha, \"Bhagavān!",
        "source": "T09n0268_001:0257c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我夜後分明相出時，從自房出詣文殊師利房，欲入房時遙見佛精舍邊，有十千蓮花迴旋圍遶，聞大音樂歌頌之聲，彼諸蓮花出大光明，照祇陀林及舍衛國，乃至三千大千世界，如是之相是何先瑞？」",
        "translation": "When I was leaving my room after midnight, I went out of my room and visited Mañjuśrī's room. As I was about to enter my room, I saw 10,000 lotus flowers circling around the Buddha's abode, and I heard the sound of great music and singing, and those lotus flowers emitted a great radiance that shone forth from the Jetavana and Śrāvastī kingdoms and even the 3,000 great thousand worlds.",
        "source": "T09n0268_001:0257c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗：「此是文殊師利所請法瑞。」",
        "translation": "The Buddha told Śāriputra, \"This is the dharma-ruin requested by Mañjuśrī.\"",
        "source": "T09n0268_001:0257c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難白佛言：「世尊！",
        "translation": "It was then that Ānanda said to the Buddha, \"Bhagavān!",
        "source": "T09n0268_001:0257c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我夜後分房門孔中有光來入，即從床起出自房時，見有光明照祇陀林猶如日出，見祇陀林大水盈滿，其水澄清無諸擾濁，房舍園林悉皆不現，如是之相是何先瑞？」",
        "translation": "When I got up from my bed and got out of my room, I saw a light shining in the Jeta's Grove like the rising of the sun, and I saw the Jeta's Grove filled to overflowing with water that was perfectly clear and undisturbed, and the entirety of the monastery and its grounds were uncovered.",
        "source": "T09n0268_001:0257c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告阿難言：「此是文殊師利所請廣博嚴淨不退轉輪法瑞。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"This is the rite of the nonretrogressing wheel of the Dharma that Mañjuśrī has requested to be made vast and ornately pure.\"",
        "source": "T09n0268_001:0257c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即為阿難，而說偈言：「佛乘無有上，　　清淨無濁穢；　文殊無畏者，　　今問如此事。",
        "translation": "It was then that the Bhagavān spoke a verse for Ānanda, saying, \"The Buddha vehicle is unsurpassed, pure, and undefiled; Mañjuśrī the Fearless asks about this now.",
        "source": "T09n0268_001:0257c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是乘無分別，　　無漏無戲論；　文殊無畏者，　　今問如此事。",
        "translation": "This vehicle is nondiscriminating, uncontaminated, and without conceptual elaborations; Mañjuśrī the Fearless has asked about this.",
        "source": "T09n0268_001:0258a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此乘無所有，　　畢竟無所生；　是處不可著，　　文殊今已問。",
        "translation": "'This vehicle has nothing, is ultimately unarisen, and this place cannot be attached to,' Manjushri has asked now.",
        "source": "T09n0268_001:0258a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是中終不說，　　出生於諸果；　諸佛導世者，　　說此微密語。",
        "translation": "It's never explained here, and it's born from all the fruits; the buddhas who guide the world speak these subtle, esoteric words.",
        "source": "T09n0268_001:0258a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩提無音聲，　　亦無來去相；　文殊無畏者，　　今問如此事。",
        "translation": "\"Bodhi has no sounds, and there's no coming or going; this is what Mañjuśrī the fearless one asks about.",
        "source": "T09n0268_001:0258a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖說諸音聲，　　其性不可得；　文殊所問法，　　無音聲文字。",
        "translation": "Even though he speaks of sounds, their nature is unknowable; the teaching that Mañjuśrī asks about has no sounds or words.",
        "source": "T09n0268_001:0258a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　音聲猶如風，　　無性無住處；　文殊所問法，　　遠離諸音聲。",
        "translation": "Sound is like the wind, which has no nature and no abode; the teaching that Mañjuśrī asks about is free of sounds.",
        "source": "T09n0268_001:0258a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難今善聽，　　文殊所問法；　諸佛微密語，　　宣說菩提空。",
        "translation": "Ānanda now well heeds the teaching Wenshu asks; the subtle and mysterious words of the buddhas proclaim the emptiness of enlightenment.",
        "source": "T09n0268_001:0258a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛菩提法，　　皆悉空寂相；　無有諸方所，　　亦無有住處。",
        "translation": "The buddhas' principles of enlightenment are all empty and tranquil in their characteristics, have no location, and have no abiding place.",
        "source": "T09n0268_001:0258a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩提如虛空，　　無生亦無滅；　亦無來去相，　　唯佛能顯示。",
        "translation": "Bodhi is like space, neither arising nor ceasing, and there's no coming or going aspect that only the Buddha can reveal.",
        "source": "T09n0268_001:0258a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如虛空中，　　無有諸相貌；　文殊今問此，　　妙淨菩提法。",
        "translation": "Just like space, without any marks or features, Mañjuśrī now asks this question, \"What's the marvelously pure bodhi teaching?",
        "source": "T09n0268_001:0258a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　去來今諸佛，　　等說此菩提；　非是可見法，　　亦無能見者。",
        "translation": "The buddhas of the past and present have all spoken of this enlightenment; it's not a visible teaching, nor is there anyone who can see it.",
        "source": "T09n0268_001:0258a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如此法性相，　　以音聲顯現；　法界與菩提，　　二俱不相見。",
        "translation": "Such a character of Dharma nature is revealed by sound, and neither the Dharma realm nor enlightenment is seen in conjunction with the other.",
        "source": "T09n0268_001:0258a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨檀波羅蜜，　　尸羅亦復然；　能淨忍辱者，　　顯現佛菩提。",
        "translation": "The perfection of forbearance is purified, and the buddha's enlightenment is revealed by someone who can purify it.",
        "source": "T09n0268_001:0258a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能淨於精進，　　禪定亦復然；　淨慧淨智者，　　能顯見菩提。",
        "translation": "He who purifies effort, and so does meditation, and he who purifies wisdom and purifies knowledge, reveals enlightenment.",
        "source": "T09n0268_001:0258a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能淨於方便，　　到神通彼岸；　無依無猗者，　　以聲說菩提。",
        "translation": "He who purifies skillful means and reaches the other shore of supernormal powers, and he who has no support or interruption uses sound to explain enlightenment.",
        "source": "T09n0268_001:0258a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我說三乘法，　　諸果差別名；　隨其所樂聞，　　分別而為說。",
        "translation": "I've explained the teachings of the three vehicles, which have different names for their fruits, and I've discriminated them according to what they like to hear.",
        "source": "T09n0268_001:0258b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五濁世眾生，　　其心多怯弱；　畏佛智慧故，　　不趣佛菩提。",
        "translation": "Many of the five turbid worldly beings are timid in their minds, and because they fear the Buddha's wisdom, they don't pursue his enlightenment.",
        "source": "T09n0268_001:0258b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　成就第四果，　　名曰阿羅漢；　從聲得悟者，　　是名為聲聞。",
        "translation": "They achieve the fourth realization, which is called an arhat, and those who attain enlightenment from sound are called direct disciples.",
        "source": "T09n0268_001:0258b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我說縛解相，　　因緣各差別，　曉了此諸緣，　　能現見諸法；　便名阿羅漢，　　亦號辟支佛，　通達無生法，　　是名為菩薩。",
        "translation": "I've described the characteristic of fettering and liberation as having different causes and conditions, and when they understand these conditions, they're able to see all dharmas in detail; they're called arhats, or pratyekabuddhas, and they comprehend the principle of nonarising, which is called bodhisattvas.",
        "source": "T09n0268_001:0258b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　空三昧無作，　　無相無所有；　從此解脫門，　　能入於涅槃。",
        "translation": "This samādhi of emptiness is unconstructed, signless, and unarisen; through this gate of liberation, he can enter nirvāṇa.",
        "source": "T09n0268_001:0258b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於前中後際，　　終不生染著；　已離於方所，　　是故名無為。",
        "translation": "At the beginning, middle, and end, no defiled attachment arises; having parted with the direction, it's called nonproductivity.",
        "source": "T09n0268_001:0258b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難汝當知，　　文殊問甚深；　能解微密語，　　不分別諸果。",
        "translation": "Ānanda, you should know that Mañjuśrī's question is profound; it's able to understand subtle speech and doesn't discriminate among the fruits.",
        "source": "T09n0268_001:0258b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　文殊住一乘，　　不分別諸法；　以是故問佛，　　諸果相所以？",
        "translation": "Mañjuśrī abides in the One Vehicle and doesn't discriminate qualities; therefore, he asks the Buddha, \"What is the reason for the characteristics of the fruits?",
        "source": "T09n0268_001:0258b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世皆平等，　　空寂無性相；　遠離語音聲，　　不分別菩提。",
        "translation": "\"The three worlds are all equal, empty and tranquil without nature or marks, free of speech, sound, and nondiscriminating bodhi.",
        "source": "T09n0268_001:0258b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　文殊所教化，　　諸來大菩薩；　二十恒河沙，　　其數不減少。",
        "translation": "The great bodhisattvas of the past, taught by Mañjuśrī, are twenty sands in the Ganges, and their number isn't diminished.",
        "source": "T09n0268_001:0258b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今來詣我所，　　欲聞菩薩行；　亦欲聽三乘，　　種種差別相。",
        "translation": "They've come to us to hear about the bodhisattva's practice and to hear about the various ways the three vehicles are differentiated.",
        "source": "T09n0268_001:0258b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　文殊無畏者，　　為除彼疑心；　是故今問我，　　果相及乘相。",
        "translation": "That fearless Mañjuśrī wants to remove their doubts; therefore, he's asked me about the characteristics of the fruit and the characteristics of the vehicle.",
        "source": "T09n0268_001:0258b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此是佛威神，　　亦是本願力；　為拔苦眾生，　　分別說三乘。",
        "translation": "This is the Buddha's authoritative power and the power of his original vow to rescue suffering sentient beings and discern the three vehicles.",
        "source": "T09n0268_001:0258b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　文殊無畏者，　　慇懃勸請我；　唯願大法王，　　說菩薩所行。",
        "translation": "Wenshu the fearless one, who earnestly encourages me, may the great king of the Dharma teach what bodhisattvas do.",
        "source": "T09n0268_001:0258c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　百千億諸天，　　供養佛世尊；　皆著諸果相，　　願除此疑心。",
        "translation": "A hundred billion gods make offerings to the Bhagavān, all attaching themselves to the marks of realization, and wishing to remove this doubt.",
        "source": "T09n0268_001:0258c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今此四部眾，　　比丘等來集；　著諸果音聲，　　不解微密語。",
        "translation": "Here are four groups of monks and nuns who have gathered here, clinging to the sounds of fruits and not understanding their subtle speech.",
        "source": "T09n0268_001:0258c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為除彼疑故，　　文殊今問我；　以是眾因緣，　　諸菩薩來集。」",
        "translation": "To remove their doubts, Mañjuśrī now asks me; for these many reasons, the bodhisattvas have come to assemble.\"",
        "source": "T09n0268_001:0258c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎廣博嚴淨經卷第一",
        "translation": "Śūraṃgama-sūtra, Vol. 1",
        "source": "T09n0268_001:0258c08_1",
        "is_bad_quality": false
    }
]