[
    {
        "source_sentence": "大方廣佛華嚴經卷第八",
        "translation": "Dafangguang fo huayan jing roll 8",
        "source": "T09n0278_008:0443b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東晉天竺三藏佛馱跋陀羅譯",
        "translation": "A Translation of the Tripiṭaka of the Eastern Jin Dynasty (India) by Buddhabhadra",
        "source": "T09n0278_008:0443b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩雲集妙勝殿上說偈品第十之二",
        "translation": "Tenth and Second in the Chapter of Verses Spoken at the Place of Marvelous Triumph, a Gathering of Bodhisattvas",
        "source": "T09n0278_008:0443b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎爾時，善慧菩薩承佛神力，普觀十方，以偈頌曰：「妙哉佛世尊，　　無量諸如來，　離害心解脫，　　自度能度彼。",
        "translation": "At the time, the Bodhisattva of Fine Wisdom, endowed with the Buddha's spiritual power, universally observed the ten directions and spoke in verse, \"Wonderful, Bhagavān, countless are the tathāgatas, liberated from harmful thoughts, able to save themselves and save others.",
        "source": "T09n0278_008:0443b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正見世間燈，　　如實不顛倒，　無量無數劫，　　積德故見佛。",
        "translation": "He correctly sees the lamp of the world as it really is, isn't mistaken, and has accumulated virtue over measureless, incalculable eons to see the Buddha.",
        "source": "T09n0278_008:0443b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸行空無實，　　凡夫謂真諦，　一切無自性，　　皆悉等虛空。",
        "translation": "Practices are empty and insubstantial, which ordinary people call the true truth, and all things lack self-nature and are all equal in space.",
        "source": "T09n0278_008:0443b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無盡智所說，　　說者無所說，　了知有悉無，　　故得難思議。",
        "translation": "What's explained by inexhaustible knowledge and what's explained by a speaker are incomprehensible because they know existence and are completely absent.",
        "source": "T09n0278_008:0443b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無盡說無盡，　　眾生空寂故，　知彼真實性，　　則見大名稱。",
        "translation": "Because it's inexhaustible and explained as inexhaustible, sentient beings are empty and tranquil, and when their true nature is known, then they see the great name.",
        "source": "T09n0278_008:0443b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無見說是見，　　無我說眾生，　說見及眾生，　　是二悉非有。",
        "translation": "They say this is view when there's no view, they say sentient beings when there's no self, and they say that views and sentient beings are both not existent.",
        "source": "T09n0278_008:0443b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見者無所見，　　是見不壞相，　是名真實法，　　一切佛所說。",
        "translation": "That which is seen has no view, and this view has indestructible characteristics, which are called the true and real Dharma and are taught by all buddhas.",
        "source": "T09n0278_008:0443b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能知真實佛，　　及佛之所說，　普見一切世，　　如佛盧舍那。",
        "translation": "They know the true Buddha and what he teaches, and they universally see the whole world like the Buddha Ṛṣana.",
        "source": "T09n0278_008:0443b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來等正覺，　　善說明淨道，　精進慧菩薩，　　演說無量法。",
        "translation": "The Tathāgata, the perfectly enlightened one, skillfully explains the clear and pure path, and the bodhisattva of diligence and wisdom explains measureless dharmas.",
        "source": "T09n0278_008:0443c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有無諸法相，　　一相平等修，　如是能見佛，　　安住真實際。」",
        "translation": "They equally cultivate the characteristics of all dharmas, whether existent or nonexistent, and thus see the Buddha and abide in true reality.\"",
        "source": "T09n0278_008:0443c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，智慧菩薩承佛神力，普觀十方，以偈頌曰：「我聞最勝教，　　即生淨慧光，　普照十方世，　　悉見一切佛。",
        "translation": "At the time, the Wisdom Bodhisattva, endowed with the Buddha's spiritual power, universally observed the ten directions and spoke in verse, \"I heard the most excellent teaching, and I immediately gave rise to a pure light of wisdom that universally illuminates the world in the ten directions and sees all the buddhas.",
        "source": "T09n0278_008:0443c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若計有眾生，　　是為最難處，　法本無真主，　　但有假言說。",
        "translation": "This is the most difficult place to imagine that there are sentient beings for whom the Dharma originally has no true character but is spoken falsely.",
        "source": "T09n0278_008:0443c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚惑莫能知，　　自身真實性，　如來非取相，　　是故不見佛。",
        "translation": "Foolish and deluded people can't know their true nature, and the Tathāgata doesn't grasp characteristics; therefore, they don't see the Buddha.",
        "source": "T09n0278_008:0443c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　塵垢障慧眼，　　不見等正覺，　無量無數劫，　　流轉生死海。",
        "translation": "Dust hinders the eye of wisdom, so it doesn't see the perfectly enlightened One, who transmigrates through the ocean of birth-and-death for measureless, incalculable eons.",
        "source": "T09n0278_008:0443c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　流轉則生死，　　非轉是涅槃，　生死及涅槃，　　二皆不可得。",
        "translation": "What's in flux is birth-and-death, what's not in flux is nirvāṇa, and neither birth-and-death nor nirvāṇa are obtainable.",
        "source": "T09n0278_008:0443c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　虛誑妄說者，　　生死涅槃異，　迷惑賢聖法，　　不識無上道。",
        "translation": "Those who falsely and deludedly claim that birth-and-death and nirvāṇa are different are deluded about good and noble principles and don't recognize the unsurpassed path.",
        "source": "T09n0278_008:0443c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是取相者，　　言有佛等覺，　顛倒無正念，　　是故不見佛。",
        "translation": "Someone who thus grasps characteristics and says there's a Buddha and virtual enlightenment is mistaken and lacks right mindfulness, which is why they don't see the Buddha.",
        "source": "T09n0278_008:0443c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能知此實法，　　寂滅真如相，　則見最正覺，　　超出語言道。",
        "translation": "If they know this real thing, the true mark of cessation, then they'll see the supreme perfect awakening and transcend the path of language.",
        "source": "T09n0278_008:0443c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　虛妄說諸法，　　法實無所有，　一切諸世尊，　　諦求不可得。",
        "translation": "Falsely speaking of all dharmas, they really don't exist, and all the world-honored ones are unobtainable when truly sought.",
        "source": "T09n0278_008:0443c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　明了過去世，　　未來及現在，　究竟永寂滅，　　故說為如來。」",
        "translation": "They understand past lives, the future, and the present, and they are ultimately and permanently extinguished; therefore, they're called tathāgatas.\"",
        "source": "T09n0278_008:0443c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，真慧菩薩承佛神力，普觀十方，以偈頌曰：「寧受無量苦，　　得聞佛音聲，　不受一切樂，　　而不聞佛名。",
        "translation": "At the time, the Bodhisattva of True Wisdom, endowed with the Buddha's spiritual power, universally observed the ten directions and spoke in verse, \"It's better to experience measureless suffering than to hear the Buddha's voice and not experience all the pleasures without hearing the Buddha's name.",
        "source": "T09n0278_008:0443c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所以無量劫，　　受此眾苦惱，　流轉生死中，　　不聞佛名故。",
        "translation": "Therefore, for measureless eons, I've suffered these many sufferings and transmigration through birth and death because I didn't hear the Buddha's name.",
        "source": "T09n0278_008:0444a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　實以無實法，　　正覺等真偽，　以無和合相，　　是名為菩提。",
        "translation": "It's really because there are no real things, true awakenings and so forth, that are real and false, and because there's no characteristic of conjunction that this is called enlightenment.",
        "source": "T09n0278_008:0444a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現佛非緣合，　　去來亦復然，　一切法無相，　　是則佛真性。",
        "translation": "The present buddha is not a conjunction of conditions, nor is past and future similar, and all things are without marks, which is the true nature of the buddha.",
        "source": "T09n0278_008:0444a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能如是觀，　　諸法甚深義，　則見無量佛，　　法身真實相。",
        "translation": "If he can thus observe the profundity of dharmas, then he'll see measureless buddhas and the true characteristics of the Dharma body.",
        "source": "T09n0278_008:0444a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於實知真實，　　非實知非實，　善解真實際，　　故號為正覺。",
        "translation": "Knowing what's real and knowing what's not real and well understanding what's real, they're called right awakening.",
        "source": "T09n0278_008:0444a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　覺者無所覺，　　是佛真妙法，　諸佛如是修，　　非一亦非二。",
        "translation": "The awakened one realizes nothing, which is the true and wonderful Dharma of the Buddha, and the buddhas thus cultivate it, which is neither one nor two.",
        "source": "T09n0278_008:0444a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知一法為眾，　　知眾法為一，　法無所依處，　　云何而緣合。",
        "translation": "Knowing that one dharma is many and knowing that many dharmas are one, how are they conditioned together when there's no basis for the dharma?",
        "source": "T09n0278_008:0444a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作者及所作，　　二俱無所有，　若能如是解，　　求之不可得。",
        "translation": "The author and the activity are both nonexistent, and if one can thus understand them, it's impossible to find them.",
        "source": "T09n0278_008:0444a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是處不可得，　　諸佛所依止，　法無有所依，　　覺者無所著。」",
        "translation": "This place is unobtainable, the buddhas are supported, the dharmas have no basis, and the awakened one has no attachment.\"",
        "source": "T09n0278_008:0444a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，無上慧菩薩承佛神力，普觀十方，以偈頌曰：「無上摩訶薩，　　遠離眾生相，　上相無所有，　　故號為無上。",
        "translation": "At the time, the bodhisattva of unsurpassed wisdom, endowed with the Buddha's spiritual power, universally observed the ten directions and spoke in verse, \"The unsurpassed great bodhisattva is free from the characteristics of sentient beings, and the superior characteristic is nonexistent; therefore, it's called unsurpassed.",
        "source": "T09n0278_008:0444a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　微妙無所有，　　麁者亦復無，　諸佛之所得，　　非望亦非作。",
        "translation": "Subtle and unsurpassed, crude and also unsurpassed, they're not desired or created by the buddhas.",
        "source": "T09n0278_008:0444a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是法不可數，　　諸佛之境界，　亦離於無數，　　是名佛真法。",
        "translation": "These things are incalculable, and the realms of the buddhas are free from numberlessness, which is called the true teaching of the Buddha.",
        "source": "T09n0278_008:0444a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慧日照十方，　　滅除眾闇冥，　亦非有所照，　　亦復非無照。",
        "translation": "The sun of wisdom shines in ten directions and extinguishes darkness, not with illumination but also not without illumination.",
        "source": "T09n0278_008:0444a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常樂寂靜法，　　永離有所依，　解脫無依處，　　不染一切法。",
        "translation": "He always enjoys the quiescent Dharma, is forever free of any support, is liberated from a lack of support, and doesn't stain all dharmas.",
        "source": "T09n0278_008:0444b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善見大智者，　　真實所依住，　若無有二法，　　當知一亦無。",
        "translation": "Those who well see great wisdom, which truly stands on, should know that if there are no two things, then they should be one and none.",
        "source": "T09n0278_008:0444b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無一亦無二，　　一切皆寂滅，　三種世間空，　　是則諸佛見。",
        "translation": "There's neither one nor two, all are tranquil, and the three kinds of worldly emptiness are seen by the buddhas.",
        "source": "T09n0278_008:0444b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛教眾生，　　安住正法中，　解達無所住，　　當見真實身。",
        "translation": "All Buddhist beings abide stably in the right teaching, comprehending that there's no place to abide, and they'll see the true and real body.",
        "source": "T09n0278_008:0444b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非身即是身，　　不轉不可見，　無轉亦無見，　　是名無上身。",
        "translation": "What's not body is body, which doesn't change and can't be seen and has neither change nor view, which is called the unsurpassed body.",
        "source": "T09n0278_008:0444b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　真慧所演說，　　無量諸佛法，　若聞此法者，　　常得清淨眼。」",
        "translation": "This is called the unsurpassed body. True wisdom teaches measureless Buddha-teachings, and if someone hears this teaching, they'll always attain pure eyes.\"",
        "source": "T09n0278_008:0444b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，堅固慧菩薩承佛神力，普觀十方，以偈頌曰：「眾生不知恩，　　如來發慈慧，　出現於世間，　　普照除眾冥。",
        "translation": "At the time, the Bodhisattva of Sturdy Wisdom, endowed with the Buddha's spiritual power, universally observed the ten directions and spoke in verse, \"Sentient beings don't know kindness, so the Tathāgata arouses compassionate wisdom, appears in the world, and universally illuminates and removes the darkness of the multitude.",
        "source": "T09n0278_008:0444b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　起大慈悲心，　　普觀諸群生，　具受無量苦，　　永縛在三有。",
        "translation": "Arising from a mind of great compassion, he observed that all sentient beings are subject to measureless suffering and are permanently bound to the three existences.",
        "source": "T09n0278_008:0444b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯除等正覺，　　最勝尊導師，　一切天人中，　　無可歸依者。",
        "translation": "Except for the perfectly enlightened, most honored guide, there's no one among gods and humans to whom they can turn.",
        "source": "T09n0278_008:0444b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世界若無佛，　　及眾賢聖人，　彼諸群生類，　　無有一切樂。",
        "translation": "If the world didn't have buddhas and noble people of great worth, those sentient beings wouldn't have all kinds of happiness.",
        "source": "T09n0278_008:0444b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來眾賢聖，　　出現於世間，　為開淨慧眼，　　令得永安樂。",
        "translation": "The Tathāgatas, who are full of goodness and saints, appear in the world to open the eyes of pure wisdom and bring lasting happiness.",
        "source": "T09n0278_008:0444b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若見如來者，　　為得最大利，　聞佛名歡喜，　　則是世間塔。",
        "translation": "If someone who sees the Tathāgata attains the greatest benefit and rejoices when they hear the Buddha's name, then they'll be a stūpa in the world.",
        "source": "T09n0278_008:0444b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等獲善利，　　現前覲如來，　聞斯微妙法，　　悉當成佛道。",
        "translation": "We reap the good benefits of meeting the Tathāgata, hearing this subtle teaching, and all will achieve the Buddha Way.",
        "source": "T09n0278_008:0444b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世明解脫，　　甚深諸境界，　一切眾菩薩，　　清淨開慧眼。",
        "translation": "Their understanding of the three worlds and their liberation are profound, and all the bodhisattvas have their eyes of wisdom opened purely.",
        "source": "T09n0278_008:0444b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等重歡喜，　　見佛盧舍那，　無量無邊智，　　演說不可盡。",
        "translation": "We're all overjoyed to see the Buddha Ṛṣana, whose immeasurable and limitless wisdom is explained in inexhaustibly.",
        "source": "T09n0278_008:0444c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無上慧堅固，　　及諸佛子等，　無數億劫中，　　說佛德無盡。」",
        "translation": "Unsurpassed wisdom is resolute, and the Buddha's disciples have taught the Buddha's virtue without limit for countless millions of eons.\"",
        "source": "T09n0278_008:0444c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎大方廣佛華嚴經菩薩十住品第十一爾時，法慧菩薩承佛神力，入菩薩無量方便三昧正受。",
        "translation": "It was then that the bodhisattva Dharma wisdom, endowed with the Buddha's spiritual power, entered the bodhisattva's immeasurable skillful concentration and correctly received it.",
        "source": "T09n0278_008:0444c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入三昧已，十方千佛世界塵數佛土之外，各見千佛世界塵數諸佛，是諸如來悉號法慧。",
        "translation": "After entering the samādhi, outside of the dusty buddha-lands of a thousand buddha-worlds in ten directions, he saw dusty buddhas of a thousand buddha-worlds each, tathāgatas who were called Dharma wisdom.",
        "source": "T09n0278_008:0444c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼諸佛告法慧菩薩言：「善哉！",
        "translation": "Those buddhas then addressed the bodhisattva Dharma wisdom, saying, \"Good!",
        "source": "T09n0278_008:0444c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T09n0278_008:0444c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_008:0444c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃能入是菩薩無量方便三昧正受。",
        "translation": "It's then that the bodhisattva's immeasurable skillful samādhi can be entered and correctly experienced.",
        "source": "T09n0278_008:0444c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_008:0444c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方各千佛剎塵數諸佛加汝神力，故能入是三昧正受；又盧舍那佛本願力故，威神力故，及汝善根力故，又欲令汝廣說法故，長養佛慧故，開解法界故，分別眾生界故，除滅障故，入無礙境界故，無等等方便入一切智陀羅尼故，覺一切法故，善知諸根故，說法持故，所謂菩薩十住。",
        "translation": "Because of the miraculous power of the buddhas of a thousand buddha bases in each of the ten directions, you're able to enter this samādhi and experience it correctly; because of the power of Rocana Buddha's original vows, his authority, and your good roots, and because he wants you to explain the teaching in detail, nurture Buddha's wisdom, understand the Dharma realm, discern the realm of sentient beings, remove the hindrances, enter the realm of no-hindrance, enter the dhāraṇī of omniscience with peerless skillful means, awaken to all dharmas, know the faculties well, and maintain the teaching, which are called the ten abodes of a bodhisattva.",
        "source": "T09n0278_008:0444c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_008:0444c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當承佛神力，說微妙法。」",
        "translation": "I will inherit the Buddha's spiritual power and explain the subtle Dharma.\"",
        "source": "T09n0278_008:0444c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，一切如來即與法慧菩薩無礙智、無住智、無斷智、無癡智、無壞智、無惡智、無量智、無勝智、無懈怠智、無退智。",
        "translation": "At that point, the Tathāgatas then gave the bodhisattva Dharma wisdom unhindered knowledge, unabiding knowledge, uninterrupted knowledge, unconfused knowledge, indolent knowledge, indestructible knowledge, uncorrupted knowledge, unvitiated knowledge, immeasurable knowledge, unsurpassed knowledge, lazy knowledge, and irreversible knowledge.",
        "source": "T09n0278_008:0444c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0444c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼三昧力法如是故。",
        "translation": "\"The samādhi power Dharma is thus.",
        "source": "T09n0278_008:0444c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸佛各伸右手，摩法慧菩薩頂。",
        "translation": "At that point, the buddhas each extended their right hand and rubbed the top of the Bodhisattva Dharma Wisdom's head.",
        "source": "T09n0278_008:0444c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩其頂已，即從定起，告眾菩薩言：「諸佛子！",
        "translation": "After they had rubbed their heads, they rose from their meditation and addressed the bodhisattvas, saying, \"Children of the Buddha!",
        "source": "T09n0278_008:0444c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩種性甚深廣大與法界虛空等，一切菩薩從三世諸佛種性中生。",
        "translation": "The bodhisattva's seed nature is so deep and vast that it's equal to the space of the Dharma realm, and all bodhisattvas arise from the seed natures of the buddhas of the three times.",
        "source": "T09n0278_008:0444c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Fellow buddhas!",
        "source": "T09n0278_008:0444c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩十住行，去、來、現在諸佛所說。",
        "translation": "The ten abiding practices of the bodhisattvas, Mahāsattvas, were taught by the past, future, and present buddhas.",
        "source": "T09n0278_008:0444c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0444c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一名初發心，二名治地，三名修行，四名生貴，五名方便具足，六名正心，七名不退，八名童真，九名法王子，十名灌頂。",
        "translation": "There's one who first arouses the mind, two who govern the stages, three who practice, four who produce virtues, five whose skillful means are complete, six who are rightly minded, seven who don't regress, eight who are youthful and true, nine who are princes of the Dharma, and ten who are consecrated.",
        "source": "T09n0278_008:0444c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0445a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩十住，去、來、現在諸佛所說。",
        "translation": "These are called the ten bodhisattva abodes, which were, came, and are being taught by the buddhas.",
        "source": "T09n0278_008:0445a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0445a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩初發心住？",
        "translation": "What is the bodhisattva-mahāsattva's first abode of arousal of mind?",
        "source": "T09n0278_008:0445a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩見佛三十二相、八十種好，妙色具足，尊重難遇；或覩神變、或聞說法、或聽教誡、或見眾生受無量苦、或聞如來廣說佛法，發菩提心，求一切智，一向不迴。",
        "translation": "When this bodhisattva sees the Buddha's thirty-two characteristics and eighty kinds of beauty, his marvelous appearance is complete, and he's difficult to encounter; sometimes he sees a miraculous transformation, he hears a teaching, he hears an instruction, he sees sentient beings undergoing measureless suffering, or he hears the Tathāgata explain the Buddha's teaching in detail, arouses the mind of enlightenment, seeks omniscience, and never turns back.",
        "source": "T09n0278_008:0445a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩因初發心得十力分。",
        "translation": "These are the ten powers of a bodhisattva's mind when he first arouses it.",
        "source": "T09n0278_008:0445a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：是處非處智、業報垢淨智、諸根智、欲樂智、性智、一切至處道智、一切禪定解脫三昧正受垢淨起智、宿命無礙智、天眼無礙智、三世漏盡智，是為十。",
        "translation": "These are the following ten: knowledge of right and wrong places, knowledge of the defilement and purity of karmic retribution, knowledge of the faculties, knowledge of desires and pleasures, knowledge of the nature, knowledge of the path to all arrivals, knowledge of the defilement and pure initiation of right feeling in the samādhi of liberation in all meditation, knowledge of past lives without obstruction, knowledge of the unobstructed divine eye, and knowledge of the end of the contaminants in the three times.",
        "source": "T09n0278_008:0445a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0445a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0445a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學恭敬供養諸佛，讚歎諸菩薩護眾生心，親近賢明，讚不退法，修佛功德，稱揚歎美，生諸佛前，方便修習寂靜三昧，讚歎遠離生死輪迴，為苦眾生作歸依處。",
        "translation": "That is, they train in respectful offerings to the buddhas, praise the mind of the bodhisattvas that protects sentient beings, become close to wise teachers, praise the irreversibility of the teaching, cultivate the merits of the buddhas, praise and glorify them, birth in the presence of the buddhas, skillfully cultivate the tranquil concentration, praise their freedom from the cycle of birth-and-death, and make a place of refuge for suffering sentient beings.",
        "source": "T09n0278_008:0445a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0445a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲令菩提心轉勝堅固，成無上道，有所聞法，即自開解，不由他悟。",
        "translation": "They want their enlightenment to become more resolute, to achieve the unsurpassed path, and to hear the teaching and understand it on their own, without relying on others for awakening.",
        "source": "T09n0278_008:0445a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0445a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩治地住？",
        "translation": "What is the bodhisattva-mahāsattva's abode of governing the grounds?",
        "source": "T09n0278_008:0445a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩於一切眾生發十種心。",
        "translation": "\"This bodhisattva arouses ten kinds of aspiration for all sentient beings.",
        "source": "T09n0278_008:0445a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：大慈心、大悲心、樂心、安住心、歡喜心、度眾生心、守護眾生心、我所心、師心、如來心，是為十。",
        "translation": "These are the ten: mind of great kindness, mind of great compassion, mind of joy, mind of stability, mind of joy, mind of saving sentient beings, mind of guarding sentient beings, mind of what belongs to self, mind of the teacher, and mind of the Tathāgata.",
        "source": "T09n0278_008:0445a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0445a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0445a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：先當勤學專求多聞，修離欲定，近善知識不違其教，善知時語，學無所畏，明解深義，了達正法，知堅法行，捨離癡冥，安住不動。",
        "translation": "It means that they should first diligently study, concentrate on learning much, cultivate concentration free of desire, approach a good teacher who doesn't disregard their teaching, speak well and know the time, train without fear, understand the profound meaning, comprehend the right teaching, know the practice of the resolute teaching, abandon delusion, and abide unmoving.",
        "source": "T09n0278_008:0445a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0445a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲於一切眾生增長大慈悲故；有所聞法，即自開解，不由他悟。",
        "translation": "They want to develop great compassion for all sentient beings, so that when they hear the teaching, they will understand it for themselves and not by others.",
        "source": "T09n0278_008:0445a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0445a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩修行住？",
        "translation": "What are the bodhisattva-mahāsattva's abodes of practice?",
        "source": "T09n0278_008:0445a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩十種觀一切法。",
        "translation": "\"These are the ten ways a bodhisattva observes all dharmas.",
        "source": "T09n0278_008:0445a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：觀一切法無常、苦、空、無我、不自在，一切法不可樂，一切法無集散，一切法無堅固，一切法虛妄，一切法無精勤和合堅固，是為十。",
        "translation": "These are the ten observations that all things are impermanent, painful, empty, selfless, and not self-perpetuating, that all things are unpleasing, that all things are not collected and dispersed, that all things are not solid, that all things are false, and that all things are not diligently combined and solid.",
        "source": "T09n0278_008:0445b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0445b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0445b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學分別知一切眾生界，分別知一切法界，分別知一切世界，分別知地、水、火、風界，分別知欲、色、無色界。",
        "translation": "It's called training to know all the realms of sentient beings separately, all the realms of reality separately, all the worlds separately, the realms of earth, water, fire, and wind separately, and the realms of desire, form, and formlessness separately.",
        "source": "T09n0278_008:0445b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0445b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲於一切法增長明淨智慧故；有所聞法，即自開解，不由他悟。",
        "translation": "They want to develop clear and pure wisdom about all things, so that when they hear a teaching, they immediately understand it for themselves and don't let others understand it.",
        "source": "T09n0278_008:0445b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0445b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩生貴住？",
        "translation": "\"What is the noble abode of the bodhisattva-mahāsattva's birth?",
        "source": "T09n0278_008:0445b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩從一切聖法正教中生，修十種法。",
        "translation": "This bodhisattva arises from the correct teaching of all holy things and cultivates ten kinds of dharmas.",
        "source": "T09n0278_008:0445b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：信佛不壞，究竟於法，寂然定意，分別眾生，分別佛剎，分別世界，分別諸業，分別果報，分別生死，分別涅槃，是為十。",
        "translation": "These are the ten that are called believing in the Buddha's indestructibility, ultimately abiding in the Dharma, quiescent in concentration, discriminating sentient beings, discriminating buddha bases, discriminating worlds, discriminating actions, discriminating results, discriminating birth-and-death, and discriminating nirvāṇa.",
        "source": "T09n0278_008:0445b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0445b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0445b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學分別去、來、今佛法，修行去、來、今佛法；具足去、來、今佛法，平等觀察一切諸佛。",
        "translation": "It means training to discern past, future, and present Buddha qualities, cultivating past, future, and present Buddha qualities, and fully possessing past, future, and present Buddha qualities to equally observe all buddhas.",
        "source": "T09n0278_008:0445b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0445b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲使明達二世等觀，有所聞法，即自開解，不由他悟。",
        "translation": "They want to make sure that they understand and comprehend both worlds equally, and that when they hear the teaching, it's their own enlightenment, not someone else's.",
        "source": "T09n0278_008:0445b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0445b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩具足方便住？",
        "translation": "\"What is the bodhisattva-mahāsattva's fully equipped stage of skillful means?",
        "source": "T09n0278_008:0445b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩聞十種法應當修行。",
        "translation": "These bodhisattvas hear about ten kinds of things that should be cultivated.",
        "source": "T09n0278_008:0445b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所行善根悉為：救護一切眾生，饒益一切眾生，安樂一切眾生，哀愍一切眾生，成就一切眾生，令一切眾生捨離諸難，拔出一切眾生生死苦惱，令一切眾生歡喜快樂，令一切眾生調伏，令一切眾生悉得涅槃，是為具足方便住。",
        "translation": "The good roots of what's practiced are all: to rescue all sentient beings, benefit all sentient beings, bring comfort to all sentient beings, pity for all sentient beings, accomplish all sentient beings, cause all sentient beings to abandon difficulties, remove the suffering and distress of birth-and-death from all sentient beings, make all sentient beings happy and joyous, bring all sentient beings under submission, and cause all sentient beings to attain nirvāṇa, which is the abode of complete skillful means.",
        "source": "T09n0278_008:0445b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0445b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0445b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學知眾生無有邊，知眾生不可數，知眾生不思議，知眾生種種色，知眾生不可量，知眾生空，知眾生不自在，知眾生非真實，知眾生無所有。",
        "translation": "It means training to know that sentient beings are limitless, that sentient beings are uncountable, that sentient beings are inconceivable, that sentient beings are of various kinds, that sentient beings are immeasurable, that sentient beings are empty, that sentient beings are not self-contained, that sentient beings are not real, and that sentient beings lack existence.",
        "source": "T09n0278_008:0445b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0445c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲令其心無所染著；有所聞法，即自開解，不由他悟。",
        "translation": "They want their minds to be free of defiled attachment and to hear the teaching and immediately understand it for themselves, without relying on others for enlightenment.",
        "source": "T09n0278_008:0445c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0445c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩正心住？",
        "translation": "What is the bodhisattva-mahāsattva's correct mental abode?",
        "source": "T09n0278_008:0445c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩聞十種法，得決定心。",
        "translation": "This bodhisattva hears ten kinds of teaching and attains a mind of resolute concentration.",
        "source": "T09n0278_008:0445c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：聞讚佛、毀佛、於佛法中心定不動；聞讚法、毀法、於佛法中心定不動；聞讚、毀菩薩於佛法中心定不動；聞讚、毀菩薩所行法，於佛法中心定不動；聞眾生有量、無量，於佛法中心定不動；聞眾生有垢、無垢，於佛法中心定不動；聞眾生易度、難度，於佛法中心定不動；聞法界有量、無量，於佛法中心定不動；聞法界若成、若壞，於佛法中心定不動；聞法界若有、若無，於佛法中心定不動；是為十。",
        "translation": "所謂：聞讚佛、毀佛、於佛法中心定不動；聞讚法、毀法、於佛法中心定不動；聞讚、毀菩薩於佛法中心定不動；聞讚、毀菩薩所行法，於佛法中心定不動；聞眾生有量、無量，於佛法中心定不動；聞眾生有垢、無垢，於佛法中心定不動；聞眾生易度、難度，於佛法中心定不動；聞法界有量、無量，於佛法中心定不動；聞法界若成、若壞，於佛法中心定不動；聞法界若有、若無，於佛法中心定不動；是為十。",
        "source": "T09n0278_008:0445c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "These are the ten.",
        "source": "T09n0278_008:0445c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0445c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學一切法無相，一切法無性，一切法不可修，一切法無所有，一切法無真實，一切法如虛空，一切法無自性，一切法如幻，一切法如夢，一切法如響。",
        "translation": "What's meant by this is: \"Train in the fact that all things lack characteristics, all things lack nature, all things can't be cultivated, all things lack existence, all things lack reality, all things are like space, all things lack self-nature, all things are illusory, all things are like dreams, and all things are like sounds.",
        "source": "T09n0278_008:0445c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0445c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲令得不退轉無生法忍故，有所聞法，即自開解，不由他悟。",
        "translation": "\"In order to attain the nonretrogressing patience of the nonarising of the Dharma, someone who hears the teaching will immediately understand it for themselves, not by others.",
        "source": "T09n0278_008:0445c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Children of the Buddha!",
        "source": "T09n0278_008:0445c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩不退轉住？",
        "translation": "What is the nonretrogressing abode of a bodhisattva-mahāsattva?",
        "source": "T09n0278_008:0445c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩聞十種法，其心堅固而不動轉。",
        "translation": "When this bodhisattva hears ten kinds of teaching, his mind remains resolute and unshaken.",
        "source": "T09n0278_008:0445c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0445c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：聞有佛、無佛，於佛法中不退轉，有法、無法，於佛法中不退轉，有菩薩、無菩薩，於佛法中不退轉，有菩薩行、無菩薩行，於佛法中不退轉，菩薩行出生死、不出生死，於佛法中不退轉，有過去佛、無過去佛，於佛法中不退轉，有未來佛、無未來佛，於佛法中不退轉，有現在佛、無現在佛，於佛法中不退轉，佛智有盡、無盡，於佛法中不退轉，三世法一相、非一相，於佛法中不退轉，是為十。",
        "translation": "所謂：聞有佛、無佛，於佛法中不退轉，有法、無法，於佛法中不退轉，有菩薩、無菩薩，於佛法中不退轉，有菩薩行、無菩薩行，於佛法中不退轉，菩薩行出生死、不出生死，於佛法中不退轉，有過去佛、無過去佛，於佛法中不退轉，有未來佛、無未來佛，於佛法中不退轉，有現在佛、無現在佛，於佛法中不退轉，佛智有盡、無盡，於佛法中不退轉，三世法一相、非一相，於佛法中不退轉，是為十。",
        "source": "T09n0278_008:0445c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0446a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0446a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0446a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：知一即是多，多即是一，隨味知義，隨義知味，知非有是有，知有是非有，知非相是相，知相是非相，知非性是性，知性是非性。",
        "translation": "It's called knowing that the one is many and the many are one, knowing the meaning according to taste and the taste according to meaning, knowing that what's not existent is existent and knowing that what is and isn't existent, knowing that what's not characteristics is characteristics and knowing that characteristics are not characteristics, knowing that what's not nature is nature, and knowing that nature is not nature.",
        "source": "T09n0278_008:0446a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0446a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲於一切法方便具足故，有所聞法，即自開解，不由他悟。",
        "translation": "They want to be fully equipped with the skillful means for all things, so that when they hear a teaching, they immediately understand it for themselves and don't let others understand it.",
        "source": "T09n0278_008:0446a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0446a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩童真住？",
        "translation": "What is the true abode of the bodhisattva-mahāsattva child?",
        "source": "T09n0278_008:0446a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩於十種法心得安立。",
        "translation": "\"These bodhisattvas have attained stability of mind in ten kinds of dharmas.",
        "source": "T09n0278_008:0446a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0446a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：身行清淨，口行清淨，意行清淨，隨意受生，知眾生心，知眾生種種欲樂，知眾生種種性，知眾生種種業，知世界成壞，神通自在無有障礙，是為十。",
        "translation": "These are the ten that are described as having pure physical conduct, pure verbal conduct, pure mental conduct, taking birth at will, knowing the minds of sentient beings, knowing the various desires and pleasures of sentient beings, knowing the various natures of sentient beings, knowing the various actions of sentient beings, knowing the formation and decay of the world, and having the power to do so freely and without obstruction.",
        "source": "T09n0278_008:0446a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0446a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0446a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0446a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學知一切佛剎，震動一切佛剎，持一切佛剎，觀一切佛剎，詣一切佛剎，遍至一切世界，善問難無量妙法神通變化無量身，善解無量諸音聲，於一念中恭敬供養無量諸佛。",
        "translation": "It's called training to know all the buddha-blocs, shake all the buddha-blocs, maintain all the buddha-blocs, observe all the buddha-blocs, visit all the buddha-blocs, travel to all the worlds, skillfully question and refute measureless wondrous things, have miraculous powers that change without measure, skillfully understand measureless sounds, and respect and make offerings to measureless buddhas in a single moment of thought.",
        "source": "T09n0278_008:0446a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0446a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲於一切法中出巧方便，具足成就，有所聞法，即自開解，不由他悟。",
        "translation": "They want to produce skillful means and perfect accomplishment in all things, so that when they hear a teaching, they will understand it for themselves and won't let others understand it.",
        "source": "T09n0278_008:0446a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0446a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩法王子住？",
        "translation": "What is the abode of the bodhisattva-mahāsattva prince of the Dharma?",
        "source": "T09n0278_008:0446a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩善解十種法。",
        "translation": "This bodhisattva well understands ten kinds of dharmas.",
        "source": "T09n0278_008:0446a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0446a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：善解眾生趣，善解諸煩惱，善解諸習氣，善解方便智，善解分別無量法，善解諸威儀，善解分別諸世界，善解去、來、今，善解說世諦，善解說第一義諦，是為十。",
        "translation": "These are the ten: good understanding of the destinies of sentient beings, good understanding of the afflictions, good understanding of the karmic impressions, good understanding of the knowledge of skillful means, good understanding of the discrimination of measureless things, good understanding of the manner in which they are conducted, good understanding of the discrimination of worlds, good understanding of past, future, and present, good understanding of the explanation of the conventional truth, and good understanding of the explanation of the ultimate truth.",
        "source": "T09n0278_008:0446a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0446a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十法。",
        "translation": "\"There are ten things that bodhisattvas should study.",
        "source": "T09n0278_008:0446a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0446a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學善知法王所住處，善知法王所行威儀，善知安立法王處，善知巧入法王處，善知分別法王處，善知法王甘露灌頂，善知受持法王法，善知法王無畏法，善知法王無著法，善知讚歎法王法。",
        "translation": "It means that students well know where the king of the Dharma lives, well know the manner in which the king of the Dharma conducts himself, well know where to place the king of the Dharma, well know how to enter the king of the Dharma, well know where to discern the king of the Dharma, well know the consecration of the king of the Dharma's ambrosia, well know how to uphold the king of the Dharma's teaching, well know the king of the Dharma's fearless teaching, well know the king of the Dharma's unattached teaching, and well know how to praise the king of the Dharma's teaching.",
        "source": "T09n0278_008:0446a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0446b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲於一切法得無障礙智，有所聞法，即自開解，不由他悟。",
        "translation": "They want to attain unobstructed knowledge of all things and to hear the teaching and immediately understand it for themselves, without relying on others for awakening.",
        "source": "T09n0278_008:0446b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0446b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是菩薩摩訶薩灌頂住？",
        "translation": "What is the abode of consecration of a bodhisattva-mahāsattva?",
        "source": "T09n0278_008:0446b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩成就十種智住。",
        "translation": "This bodhisattva has accomplished ten abodes of cognition.",
        "source": "T09n0278_008:0446b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0446b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：悉能震動無量世界，悉能照明無量世界，悉能住持無量世界，悉能遍遊無量世界，悉能嚴淨無量世界，悉知無量眾生心行，悉知眾生隨心所行，悉知無量眾生諸根，悉能方便度無量眾生，悉能調伏無量眾生，是為十。",
        "translation": "These are the ten that are able to quake measureless worlds, illuminate measureless worlds, abide in measureless worlds, travel throughout measureless worlds, purify measureless worlds, know the thoughts and actions of measureless sentient beings, know the actions of sentient beings according to their minds, know the faculties of measureless sentient beings, skillfully save measureless sentient beings, and tame measureless sentient beings.",
        "source": "T09n0278_008:0446b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T09n0278_008:0446b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩身不可知；身業神足、神足自在；過去智、未來智、現在智、淨諸佛剎智、心境界、智境界不可知；一切眾生，乃至法王子菩薩悉不能知。",
        "translation": "That bodhisattva's body can't be known; his bodily actions are miraculous, and his miraculous abilities are unimpeded; his past knowledge, future knowledge, present knowledge, knowledge of the pure buddhas, mental realm, and cognitive realm can't be known; and all sentient beings, even the bodhisattva, the Dharma prince, can't know them.",
        "source": "T09n0278_008:0446b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "\"Fellow buddhas!",
        "source": "T09n0278_008:0446b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩應學十種智。",
        "translation": "\"There are ten kinds of cognition that bodhisattvas should train.",
        "source": "T09n0278_008:0446b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0446b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：學三世智，一切佛法智，法界無障礙智，法界無量無邊智，充滿一切世界智，普照一切世界智，能持一切世界智，分別一切眾生智，一切種智智，佛無量無邊智。",
        "translation": "It's called the knowledge of training in the three worlds, the knowledge of all buddha-dharmas, the knowledge of the Dharma realm without obstruction, the knowledge of the Dharma realm without measure or limit, the knowledge of filling all worlds, the knowledge of universally illuminating all worlds, the knowledge of being able to sustain all worlds, the knowledge of discriminating all sentient beings, the knowledge of all kinds of cognition, and the Buddha's immeasurable and limitless cognition.",
        "source": "T09n0278_008:0446b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0278_008:0446b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲令具足一切種智，有所聞法，即自開解，不由他悟。」",
        "translation": "I want them to be fully endowed with all kinds of cognition and to hear the teaching and immediately understand it for themselves, not by others.\"",
        "source": "T09n0278_008:0446b22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛神力故，十方各萬佛世界塵數佛國，六種十八相震動，雨天寶華、天末香、天寶鬘、天雜香、天寶衣、天寶雲、天莊嚴具，天妙音樂，不鼓自鳴，又自演出無畏之音。",
        "translation": "At the time, the Buddha's miraculous powers caused the dusty buddha lands of ten thousand buddha-worlds in ten directions to be shaken by six kinds of eighteen images, which rained down heavenly precious flowers, heavenly fragrance, heavenly precious garlands, heavenly mixed fragrances, heavenly precious clothing, heavenly precious clouds, heavenly adornments, and heavenly marvelous music that sounded without a drum and performed fearless sounds on its own.",
        "source": "T09n0278_008:0446b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此四天下須彌山頂妙勝殿上，威神變化，說十住法，一切十方世界，亦復如是。",
        "translation": "On the summit of Mount Sumeru on these four continents, his authority and spirit changed as he spoke the ten abodes teaching, and so did all the worlds in the ten directions.",
        "source": "T09n0278_008:0446b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛神力故，十方各過萬佛世界塵數剎外，有十佛剎微塵數等諸大菩薩充滿十方，來詣此土，說如是言：「善哉！",
        "translation": "At the time, as a result of the Buddha's miraculous power, ten great bodhisattvas, a tiny number of buddha bases in each of the ten directions, filled the ten directions and came to this land, saying, \"Good!",
        "source": "T09n0278_008:0446b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T09n0278_008:0446c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子善說是法，我等諸人，同名法慧；所從來國，同名法雲；彼諸如來，同號妙法；我等佛所，亦說十住。",
        "translation": "\"We people are all called the same Dharma wisdom, the countries we come from are all called the same Dharma cloud, the tathāgatas are all called the same wonderful Dharma, and we buddhas also say the same thing about the ten abodes.",
        "source": "T09n0278_008:0446c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大眾眷屬名味句身，等無有異。",
        "translation": "There's no difference between the names, tastes, and phrases of the bodies of the great multitude of people who are members of the Buddha's family.",
        "source": "T09n0278_008:0446c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，佛子！",
        "translation": "Therefore, Son of the Buddha!",
        "source": "T09n0278_008:0446c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等承佛神力，來詣此土，為汝作證。」",
        "translation": "By the Buddha's spiritual power, we've come to this land to testify for you.\"",
        "source": "T09n0278_008:0446c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此四天下須彌山頂妙勝殿上說十住法，十佛世界微塵數等諸大菩薩來此作證，一切十方亦復如是。",
        "translation": "Thus, on the summit of Mount Sumeru on the four continents, the Dharma of the ten abodes was taught in the Hall of Marvelous Victory, and great bodhisattvas of the ten buddha-worlds, numbering a tiny number, came here to testify, as did all the ten directions.",
        "source": "T09n0278_008:0446c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，法慧菩薩承佛神力，普觀十方及諸法界，以偈頌曰：「見大智尊微妙身，　　相好端嚴悉具足，　最勝尊重甚難遇，　　勇猛大士初發心。",
        "translation": "At the time, the Bodhisattva Dharma Wisdom, endowed with the Buddha's spiritual powers, universally observed the ten directions and the Dharma realm with a verse that read, \"Seeing the subtle body of the great honored one of wisdom, fully endowed with beautiful features and adornment, the most excellent respect is very difficult to encounter, and the brave great man has just begun to arouse his mind.",
        "source": "T09n0278_008:0446c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見無等等大神變，　　聞說妙法及教誡，　觀察五道無量苦，　　無畏大士初發心。",
        "translation": "Seeing the peerless great miracle, hearing the explanation of the wondrous Dharma and instructions, observing the measureless suffering of the five destinies, the fearless great man first arouses his aspiration.",
        "source": "T09n0278_008:0446c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞諸如來普智尊，　　無量功德悉具足，　解佛心相如虛空，　　菩薩因此初發心。",
        "translation": "He hears about the Tathāgatas, the honored ones of universal wisdom, the immeasurable qualities they possess, and understands the Buddha's mind to be like space, which is why the bodhisattva first arouses his aspiration.",
        "source": "T09n0278_008:0446c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能知是處及非處，　　若我非我如是等，　欲解平等真實義，　　菩薩因此初發心。",
        "translation": "He can know right from wrong, whether it's self or not, and so forth, and wants to understand the true meaning of equality, which is why the bodhisattva first arouses his aspiration.",
        "source": "T09n0278_008:0446c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去未來現在世，　　一切善惡諸業報，　欲善觀察悉平等，　　菩薩因此初發心。",
        "translation": "Wanting to well observe the results of all good and bad actions in the past, future, and present worlds, and wanting to well perceive equality, the bodhisattva thus first arouses his mind.",
        "source": "T09n0278_008:0446c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸禪三昧及解脫，　　隨順正受無所著，　欲善分別垢淨起，　　菩薩因此初發心。",
        "translation": "He wants to skillfully discern the arising of impurity and purity, which is the bodhisattva's first arousal, in accordance with the meditative absorption and liberation that are correctly experienced and to which he's not attached.",
        "source": "T09n0278_008:0446c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨諸眾生根利鈍，　　種種勤修精進力，　悉欲了達分別知，　　菩薩因此初發心。",
        "translation": "According to the sharpness and dullness of the faculties of sentient beings, various kinds of diligence and effort are cultivated, and the desire to fully comprehend and discern them arises, thus the bodhisattva's first arousal of mind.",
        "source": "T09n0278_008:0446c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切眾生種種欲，　　心好樂著諸希望，　悉欲了達分別知，　　菩薩因此初發心。",
        "translation": "All sentient beings have various desires, their minds are attached to desires that are pleasing, and they all want to understand and discern them, which is why the bodhisattva first arouses the aspiration.",
        "source": "T09n0278_008:0446c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切眾生種種性，　　無量無邊不可數，　悉欲了達分別知，　　菩薩因此初發心。",
        "translation": "The various natures of all sentient beings are countless and limitless, and they all want to comprehend and discern them, which is why the bodhisattva first arouses the aspiration.",
        "source": "T09n0278_008:0446c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸道所至處，　　八正聖路向無為，　悉欲了達知其實，　　菩薩因此初發心。",
        "translation": "He wants to comprehend all the places that the path reaches, the eightfold noble path that leads to nothingness, and he wants to know it for certain, which is why the bodhisattva first arouses his mind.",
        "source": "T09n0278_008:0447a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切世界眾生類，　　流轉五道生死海，　欲得天眼悉明達，　　菩薩因此初發心。",
        "translation": "All the world's sentient beings are of a type that transmigrates through the sea of birth-and-death in the five paths, and they want to attain full comprehension with the divine eye, which is why the bodhisattva first arouses the aspiration.",
        "source": "T09n0278_008:0447a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於過去世一切事，　　如其體性所有相，　悉欲隨順達宿命，　　菩薩因此初發心。",
        "translation": "Regarding all the things of the past, just as their essence and characteristics are, he wants to conform to them all and reach their past lives, which is why the bodhisattva first arouses his mind.",
        "source": "T09n0278_008:0447a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間一切諸煩惱，　　所有結縛餘習氣，　悉欲覺知究竟盡，　　菩薩因此初發心。",
        "translation": "He wants to fully perceive all the world's afflictions and all the remaining karmic impressions that are fetters, and he wants to completely end them, which is why the bodhisattva first arouses his mind.",
        "source": "T09n0278_008:0447a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間所有世諦法，　　名字談論語言道，　悉欲明達世諦義，　　菩薩因此初發心。",
        "translation": "All the world's worldly truths, names, discourses, and paths of language, the desire to understand the meaning of the worldly truths, and the bodhisattva's initial arousal of mind as a result.",
        "source": "T09n0278_008:0447a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸法語言斷，　　無有自性如虛空，　悉欲明達真諦義，　　菩薩因此初發心。",
        "translation": "All things that are ended by language have no essence like space, and the bodhisattva wants to fully understand their true meaning, which is why he first arouses his mind.",
        "source": "T09n0278_008:0447a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　震動一切佛世界，　　傾覆鼓蕩諸大海，　悉欲明達佛神力，　　菩薩因此初發心。",
        "translation": "They shake all the buddha-worlds and overwhelm the great seas, all wanting to understand the Buddha's spiritual power, and thus the bodhisattva first arouses his aspiration.",
        "source": "T09n0278_008:0447a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一毛放演無量光，　　普照十方一切剎，　欲於一光一切覺，　　菩薩因此初發心。",
        "translation": "A single hair radiates an infinite amount of light that universally illuminates all the buddhas in the ten directions, wanting one light to awaken all, thus the bodhisattva's first arousal of mind.",
        "source": "T09n0278_008:0447a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量佛剎難思議，　　皆悉能置一掌中，　欲解一切如幻化，　　菩薩因此初發心。",
        "translation": "Measureless buddha-blades are unfathomable, but they can all be placed in the palm of one hand, wanting to understand them all as illusory transformations, thus the bodhisattva's first arousal of mind.",
        "source": "T09n0278_008:0447a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量佛剎諸眾生，　　皆悉安置一毛端，　悉欲了達皆寂滅，　　菩薩因此初發心。",
        "translation": "Measureless buddha-blocks and sentient beings are all placed at the tip of a single hair, and they all want to understand that they are all tranquil, which is why the bodhisattva first arouses his mind.",
        "source": "T09n0278_008:0447a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切十方大海水，　　渧以一毛盡無餘，　悉欲分別知渧數，　　菩薩因此初發心。",
        "translation": "All the great waters of the ten directions contain a single hair of water, and there's no remainder, so the bodhisattva wants to discern the number of drops and know the initial arousal of his mind.",
        "source": "T09n0278_008:0447a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不可思議諸佛剎，　　皆碎為末如微塵，　悉欲分別知其數，　　菩薩因此初發心。",
        "translation": "Inconceivable buddha bases are all reduced to dust like motes, and the desire to discern their number is the reason the bodhisattvas first aroused the intention to know their number.",
        "source": "T09n0278_008:0447a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去未來無量劫，　　一切世界成敗相，　悉欲究竟達其際，　　菩薩因此初發心。",
        "translation": "In the past and future, there will be countless eons in which all worlds will be in a state of formation and decay, and I want to fully reach their limits, thus the bodhisattva's first arousal of mind.",
        "source": "T09n0278_008:0447a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世一切等正覺，　　諸辟支佛及聲聞，　悉欲分別三乘道，　　菩薩因此初發心。",
        "translation": "All the perfectly enlightened ones in the three worlds, the pratyekabuddhas, and direct disciples all want to discern the path of the three vehicles, which is why the bodhisattva first arouses his intention.",
        "source": "T09n0278_008:0447a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量無邊諸世界，　　能以一毛悉稱舉，　欲知有無真實相，　　菩薩因此初發心。",
        "translation": "Countless and limitless are the worlds that can be enumerated with a single hair, and the desire to know the true and real nature of existence and nonexistence was the cause for the bodhisattva's initial arousal of mind.",
        "source": "T09n0278_008:0447a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金剛圍山數無量，　　盡能安置一毛端，　欲知至大有小相，　　菩薩因此初發心。",
        "translation": "There are countless adamantine mountains that can be placed by the tip of a single hair, and the desire to know the difference between large and small first aroused the bodhisattva's initial resolve.",
        "source": "T09n0278_008:0447b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方一切諸世界，　　能以一音遍充滿，　悉欲解了淨妙聲，　　菩薩因此初發心。",
        "translation": "All the worlds in the ten directions can be filled with a single sound, and they all want to understand the pure and marvelous sound, which is why the bodhisattva first aroused his aspiration.",
        "source": "T09n0278_008:0447b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切眾生語言法，　　一言演說盡無餘，　悉欲解了淨密音，　　菩薩因此初發心。",
        "translation": "The Dharma of all sentient beings' speech is explained in a single word without remainder, and the desire to understand the pure and mysterious sound is fully expressed, which is why the bodhisattva first arouses his mind.",
        "source": "T09n0278_008:0447b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來清淨微妙音，　　充滿十方諸世界，　欲得具足舌根相，　　菩薩因此初發心。",
        "translation": "The Tathāgata's pure and subtle voice fills the worlds in the ten directions, and he wants to fully possess the characteristics of the tongue root, which is why the bodhisattva first arouses his mind.",
        "source": "T09n0278_008:0447b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切十方諸世界，　　有成壞者皆悉見，　欲得解了悉虛妄，　　菩薩因此初發心。",
        "translation": "\"In all the worlds of the ten directions, those who are formed and disintegrated are all seen, and it's because of this that the bodhisattva first arouses his mind to understand that they are all false.",
        "source": "T09n0278_008:0447b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切十方諸佛剎，　　其中無量諸如來，　悉欲了達佛正法，　　菩薩因此初發心。",
        "translation": "All the buddha-temples in the ten directions contain measureless tathāgatas who want to understand the Buddha's true teaching, which is why the bodhisattva first arouses his intention.",
        "source": "T09n0278_008:0447b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　普能應現無量身，　　一切世界微塵等，　悉欲了達如幻化，　　菩薩因此初發心。",
        "translation": "There's no limit to the number of buddhas and tathāgatas in the world that can be responded to, and they all want to comprehend them as illusory, which is why the bodhisattva first aroused his intention.",
        "source": "T09n0278_008:0447b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去未來現在世，　　無量無邊諸如來，　欲於一念悉了知，　　菩薩因此初發心。",
        "translation": "There are measureless and limitless tathāgatas in the past and future present, and they want to be fully known in a single thought, which is why the bodhisattva first arouses the aspiration.",
        "source": "T09n0278_008:0447b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲具演說一句法，　　阿僧祇劫無窮盡，　欲使辯才不斷絕，　　菩薩因此初發心。",
        "translation": "Wanting to fully expound a single phrase of the Dharma that would last for incalculably long eons, and wanting to make his eloquence not end, the bodhisattva thus first arouses his intention.",
        "source": "T09n0278_008:0447b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方一切諸群生，　　隨其遷變生滅相，　欲於一念悉了達，　　菩薩因此初發心。",
        "translation": "For all the masses of people in the ten directions who change according to the phases of birth and death, the bodhisattva wants to fully comprehend that in a single thought, and thus the buddha first arouses his mind.",
        "source": "T09n0278_008:0447b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨妙身口及意行，　　遊步十方無障礙，　欲了三世悉空寂，　　菩薩因此初發心。",
        "translation": "Their pure and marvelous bodily, verbal, and mental actions wander unobstructed in ten directions, wanting to fully comprehend the emptiness and quiescence of the three worlds, the bodhisattva thus first arouses the aspiration.",
        "source": "T09n0278_008:0447b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩如是發心已，　　於十方界諸佛所，　應學盡敬供養佛，　　如是說者不退教。",
        "translation": "After thus arousing the bodhisattva's intention, he should train in all respects and make offerings to the buddhas in the ten directions, teaching thus that he won't retrogress.",
        "source": "T09n0278_008:0447b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩捨離種種樂，　　不厭生死求菩提，　以此勸進歡喜歎，　　如是說者不退教。",
        "translation": "The bodhisattva parts with various pleasures, doesn't tire of birth and death, and seeks enlightenment, and is encouraged to rejoice and praise, thus teaching that he doesn't retrogress.",
        "source": "T09n0278_008:0447b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方一切諸世界，　　其中所有眾賢聖，　菩薩常應讚歎彼，　　如是說者不退教。",
        "translation": "Of all the worlds in the ten directions, there are so many good and noble people in them that a bodhisattva should always praise them, thus teaching that they don't retrogress.",
        "source": "T09n0278_008:0447b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最勝最上無有比，　　甚深微妙清淨法，　菩薩以此化眾生，　　如是說者不退教。",
        "translation": "\"The most excellent and greatest has no equal, the deep, subtle, and pure Dharma by which a bodhisattva transforms sentient beings, thus teaching, and he doesn't retrogress.",
        "source": "T09n0278_008:0447c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無上清淨妙善法，　　一切眾魔不能壞，　菩薩尊重常稱歎，　　如是說者不退教。",
        "translation": "The unsurpassed pure and wonderfully good Dharma that all Māra cannot destroy, which is always praised by bodhisattvas as respectful, is not retrogressed from the teaching when it's taught this way.",
        "source": "T09n0278_008:0447c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切所有妙功德，　　天人之尊悉成就，　以此安立諸菩薩，　　如是說者人中王。",
        "translation": "All the marvelous attributes of gods and humans are fully achieved by their honored ones, and in this way they're posited as bodhisattvas, thus speaking, they're kings among men.",
        "source": "T09n0278_008:0447c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　方便教化見諸佛，　　無量無數難思議，　若能以此方便化，　　如是說者不退教。",
        "translation": "Teaching and transforming buddhas in a skillful way is unfathomable and countless, and if this skillful transformation can be done, he won't retrogress from the teaching when it's explained this way.",
        "source": "T09n0278_008:0447c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切甚深諸三昧，　　悉教眾生無有餘，　菩薩分別具開導，　　如是說者不退教。",
        "translation": "All the profound samādhis teach sentient beings without remainder, and bodhisattvas are individually guided by them, so he explains it as a nonretrogressing teaching.",
        "source": "T09n0278_008:0447c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉能摧滅生死輪，　　具轉聖道妙法輪，　一切世間無所著，　　諸佛所記是菩薩。",
        "translation": "They can all annihilate the wheel of birth-and-death, completely turn the noble path's marvelous wheel of Dharma, attach to nothing in the world, and are recorded by the buddhas as bodhisattvas.",
        "source": "T09n0278_008:0447c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩若見無量眾，　　輪轉生死受諸苦，　為作救護歸依者，　　諸佛所記是菩薩。",
        "translation": "If a bodhisattva sees measureless multitudes who suffer from transmigration through birth and death and makes refuge for them, these are the buddhas that are recorded by the buddhas.",
        "source": "T09n0278_008:0447c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是說菩薩發心住，　　一向志求無上道，　如我所說微妙法，　　一切諸佛亦如是。",
        "translation": "This is called the bodhisattva's abode of arousal of mind, single-minded pursuit of the unsurpassed way, subtle teaching as I have taught it, and so are all the buddhas.",
        "source": "T09n0278_008:0447c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第二治地真佛子，　　先應發心作是念，　願令一切群生類，　　隨順修行諸佛教。",
        "translation": "The second true buddha-son of the stage of healing should first arouse the mind to think this, wishing to cause all sentient beings to conform to the cultivation of Buddhism.",
        "source": "T09n0278_008:0447c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　饒益安樂眾生心，　　歡喜不捨眾生心，　大悲救護我所心，　　起大師心如來心。",
        "translation": "With the mind to benefit and comfort sentient beings, the mind to rejoice in sentient beings and not abandon them, the mind to aid self with great compassion, and the mind to give rise to the mind of the great teacher and the tathāgata.",
        "source": "T09n0278_008:0447c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　發如是等勝妙心，　　精勤學問求多聞，　寂然定意正思惟，　　心常親近善知識。",
        "translation": "They arouse such an excellent and marvelous mind, diligently study and pursue learning, calmly concentrate their minds and correctly contemplate, and always draw near to a good teacher.",
        "source": "T09n0278_008:0447c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨順奉行修其教，　　柔軟善語不放逸，　善能了知一切時，　　達深法義無所畏。",
        "translation": "They conform, practice, and cultivate their teaching, speak softly and well, aren't careless, and are able to skillfully comprehend all times and reach the profound meaning of the Dharma without fear.",
        "source": "T09n0278_008:0447c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　明解深義了正法，　　則離一切諸癡冥，　已離愚癡心安住，　　是則名為真佛子。",
        "translation": "Understanding the profound meaning and comprehending the right teaching, he's free of all delusion and dullness, and once he's free of delusion and has his mind at ease, then he's called a true son of the Buddha.",
        "source": "T09n0278_008:0447c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦名治地摩訶薩，　　一向堅固求菩提，　如是善學諸佛教，　　是則名為真佛子。",
        "translation": "Also known as a ground-ruling Mahāsattva who steadfastly pursues enlightenment and thus well trains in the teachings, this is called the true son of the Buddha.",
        "source": "T09n0278_008:0447c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第三修行真佛子，　　應當如是觀諸法，　無常苦空無堅固，　　無我無主不自在。",
        "translation": "The third true buddha-son who cultivates thus should thus observe all dharmas as impermanent, painful, empty, and insubstantial, without self or ownership, and not self-possessed.",
        "source": "T09n0278_008:0447c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸法不可樂，　　無作虛誑不真實，　無有積集亦無散，　　如是觀者是菩薩。",
        "translation": "All dharmas are unpleasant, uncreated, false, and unreal, with nothing to accumulate and nothing to disperse, and this is a bodhisattva who observes them in this way.",
        "source": "T09n0278_008:0448a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　分別觀察眾生界，　　亦當解了諸法界，　善能分別方便觀，　　無量無邊諸世界。",
        "translation": "He discriminates and observes the realms of sentient beings, and he should also comprehend the realms of reality, skillfully discerning and skillfully observing the measureless and limitless worlds.",
        "source": "T09n0278_008:0448a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切十方國土中，　　地水火風四大界，　欲界色界無色界，　　悉能觀察分別知。",
        "translation": "In all the ten directions of lands, he can observe and discern the four elements of earth, water, fire, wind, and the desire element, form element, and formless element.",
        "source": "T09n0278_008:0448a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善能明達一切界，　　真實究竟無有餘，　如是真諦正法教，　　隨順學者是菩薩。",
        "translation": "Well able to understand all realms, which are true and complete without remainder, they are the true teaching of the true truth, and this is the bodhisattva who follows the student's example.",
        "source": "T09n0278_008:0448a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第四生貴真佛子，　　從諸賢聖正法生，　有無諸法無所著，　　捨離生死出三界。",
        "translation": "The fourth person to be born is the truly noble son of the Buddha, born from the right principles of the good and noble, who has no attachment to existent or nonexistent dharmas and escapes the three realms by abandoning birth and death.",
        "source": "T09n0278_008:0448a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　信佛堅固不可壞，　　究竟淨心不退轉，　明了觀察甚深法，　　一切眾生無真實。",
        "translation": "His faith in the Buddha is resolute and indestructible, his ultimately pure mind doesn't falter, and he clearly observes the profound Dharma that's untrue of all sentient beings.",
        "source": "T09n0278_008:0448a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行業世界諸佛剎，　　生死果報及涅槃，　佛子若能如是觀，　　是名如來法化生。",
        "translation": "Of all the buddha-blocs in the world, the results of birth-and-death and nirvāṇa are called the Tathāgata's transformation birth if the Buddha's son can thus observe them.",
        "source": "T09n0278_008:0448a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去未來現在世，　　諸佛如來及正法，　無量方便求究竟，　　成就一切大聖法。",
        "translation": "In the past, future, and present, the buddha-tathāgatas and right dharmas sought their ultimate fulfillment with measureless methods, accomplishing all great noble things.",
        "source": "T09n0278_008:0448a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切三世諸如來，　　平等觀察無異相，　分別差別不可得，　　如是觀者達三世。",
        "translation": "All tathāgatas of the three times are observed equally without distinction, and their distinctions are unknowable; someone who thus observes them will reach the three times.",
        "source": "T09n0278_008:0448a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如我所說讚歎者，　　是名四住摩訶薩，　若能如是修學者，　　速成無上佛菩提。",
        "translation": "Thus praised by me, this is called the four abiding great bodhisattva, and if he can thus cultivate it, he'll quickly achieve unsurpassed Buddhahood and enlightenment.",
        "source": "T09n0278_008:0448a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第五菩薩真佛子，　　微妙具足方便住，　深入清淨巧方便，　　究竟一切功德業。",
        "translation": "The fifth bodhisattva is truly the son of the Buddha, abiding in skillful means that are subtle and complete, deeply and purely, and which accomplish all meritorious actions.",
        "source": "T09n0278_008:0448a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所修無量諸功德，　　悉為一切作歸依，　饒益安樂大慈悲，　　哀愍度脫諸群生。",
        "translation": "The measureless virtues that he cultivates are all for all to rely on, benefiting, comforting, and greatly compassionate, compassionately liberating sentient beings.",
        "source": "T09n0278_008:0448a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為一切世除眾難，　　永拔生死令歡喜，　調伏一切諸群生，　　具足功德趣涅槃。",
        "translation": "They remove all worldly difficulties, permanently remove birth and death, make people happy, tame all living beings, and fully attain nirvāṇa with virtue.",
        "source": "T09n0278_008:0448a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　普為一切諸群生，　　分別演說清淨法，　是名第五摩訶薩，　　成就方便度眾生，　具足一切功德者，　　演說五住淨妙法。",
        "translation": "He explains the pure Dharma in detail for all sentient beings. This is called the fifth great buddha who accomplishes the method of liberating sentient beings, fully endowed with all merits, and explains the pure and wonderful Dharma of the five abodes.",
        "source": "T09n0278_008:0448a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第六正心真佛子，　　解真實法離愚癡，　於一切世天人中，　　正念思惟滅虛妄。",
        "translation": "The sixth right-minded true buddha-son understands the true teaching and escapes delusion, and among all the gods and humans of the world, he correctly contemplates and ceases falsity.",
        "source": "T09n0278_008:0448b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞讚毀佛及佛法，　　一切菩薩所行道，　眾生有量若無量，　　於佛法中心不動。",
        "translation": "He hears and praises the Buddha and the Buddha-dharma, all the paths practiced by bodhisattvas, and whether sentient beings are numbered or numberless, his mind doesn't budge from the Buddha-dharma.",
        "source": "T09n0278_008:0448b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生有垢若無垢，　　或有易度或難度，　法界有量若無量，　　世界有成或有敗。",
        "translation": "Whether sentient beings are defiled or undefiled, whether it's easy or difficult to cross over, whether the Dharma realm is measured or immeasurable, or whether the world is formed or defeated.",
        "source": "T09n0278_008:0448b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或聞法界若有無，　　過去未來今現在，　菩薩於此一切法，　　寂然觀察心不動。",
        "translation": "Whether they hear about the existence or nonexistence of the Dharma realm, the past, future, or present, the bodhisattva's mind doesn't move as he calmly observes all these things.",
        "source": "T09n0278_008:0448b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀一切法無性相，　　其義真實如虛空，　猶若幻化夢所見，　　是人於法為真解。",
        "translation": "Observing that all things lack nature and characteristics and that their meanings are true as space, just as if they were illusory or seen in a dream, this person truly understands the Dharma.",
        "source": "T09n0278_008:0448b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第七不退真佛子，　　聞有諸佛菩薩法，　聞無諸佛菩薩法，　　若出非出不退轉。",
        "translation": "The seventh true Buddhist who doesn't regress hears the existence of the buddha-bodhisattva teaching and hears the absence of the buddha-bodhisattva teaching, whether it's emanation or non-emergence, and doesn't turn back.",
        "source": "T09n0278_008:0448b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去未來及現在，　　一切諸佛有以無，　若法起滅不起滅，　　若有一相若異相。",
        "translation": "Whether all buddhas existed or didn't exist in the past, future, or present, if things arise and cease, or if there's uniformity, similarity, and dissimilarity, then he doesn't retrogress.",
        "source": "T09n0278_008:0448b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若一即多多即一，　　義味寂滅悉平等，　遠離一異顛倒相，　　是名菩薩不退住。",
        "translation": "If one is many and many are one, the meanings, tastes, and cessations are all equal, and they're free from the mistaken marks of sameness and difference, this is called a bodhisattva's nonretrogressive abode.",
        "source": "T09n0278_008:0448b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有法相及無相，　　若有法性及無性，　二俱無實等虛空，　　如是知者必究竟。",
        "translation": "If there's a dharmakāya and a dharmakāya, if there's a dharmakāya and a dharmakāya, and if both are truly empty, then he'll surely reach the end when he knows them this way.",
        "source": "T09n0278_008:0448b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第八童真真佛子，　　身口意行悉具足，　微妙清淨無染污，　　隨意所欲自在生。",
        "translation": "The eighth child is truly the true son of the Buddha, complete in bodily, verbal, and mental conduct, exquisitely pure and undefiled, and freely arisen according to his will.",
        "source": "T09n0278_008:0448b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉知一切眾生心，　　善能觀察諸欲性，　了眾生法無差別，　　十方世界成敗相。",
        "translation": "He fully knows the minds of all sentient beings, skillfully observes their desires, understands that there's no difference between sentient beings and dharmas, and the worlds in the ten directions are marked by formation and decay.",
        "source": "T09n0278_008:0448b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　速逮一切妙神通，　　往詣十方諸佛剎，　隨意自在無障礙，　　聞說妙法悉受持。",
        "translation": "Quickly acquiring all marvelous supernormal powers, he travels to the buddha bases of the ten directions, freely does as he pleases without obstruction, and he hears and explains the wondrous Dharma and fully accepts it.",
        "source": "T09n0278_008:0448b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　六種震動一切國，　　皆悉能持諸世界，　梵音遍滿十方剎，　　度脫無量群生類。",
        "translation": "Six kinds of earthquakes shake all lands, and they're all capable of sustaining the worlds, filling the buddhas of the ten directions with the voice of Brahmā, and liberating measureless varieties of sentient beings.",
        "source": "T09n0278_008:0448b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諮問佛義不可數，　　變化其身無有量，　隨受化者演法言，　　如佛所說無有異。",
        "translation": "He consults the Buddha about incalculable things, transforms his body without limit, and speaks the Dharma according to those he transforms, teaching nothing differently than what the Buddha teaches.",
        "source": "T09n0278_008:0448b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第九王子摩訶薩，　　悉能分別諸群生，　善知輕重煩惱行，　　隨其所應方便度。",
        "translation": "The ninth prince, Mahāsattva, fully discerns the multitude of sentient beings, well knows the behavior of minor and major afflictions, and skillfully liberates them according to their needs.",
        "source": "T09n0278_008:0448c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善分別知諸法相，　　明達世界先後際，　善解俗諦第一義，　　具足方便無有餘。",
        "translation": "He well discerns the characteristics of dharmas, comprehends the precedence and subsequent periods of the world, well understands the ultimate truth of the conventional truth, and fully employs skillful means without remainder.",
        "source": "T09n0278_008:0448c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善能了達法王處，　　隨順法王威儀法，　善知安入法王位，　　善知分別法王界。",
        "translation": "He well understands the Dharma king's position, conforms to the Dharma king's rules of conduct, well knows how to enter the Dharma king's position, and well discerns the Dharma king's realm.",
        "source": "T09n0278_008:0448c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第十灌頂真佛子，　　方便善持一切法，　如法隨順入深義，　　悉能究竟分別說。",
        "translation": "The tenth consecration is truly the Buddha child, a skillful maintainer of all things, a conformable entrant into the profound meaning of the Dharma according to that Dharma, and fully able to discern its complete teaching.",
        "source": "T09n0278_008:0448c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉度眾生無有餘，　　而於眾生不取相，　寂然不動學正念，　　悉在十方諸佛前。",
        "translation": "He completely saves sentient beings without remainder, doesn't grasp at the characteristics of sentient beings, remains still and unmoving, trains with right mindfulness, and is fully present before the buddhas in the ten directions.",
        "source": "T09n0278_008:0448c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　灌頂菩薩真佛子，　　悉能究竟諸勝法，　十方無量諸世界，　　悉能震動光普照。",
        "translation": "The consecrated bodhisattva is truly a son of the Buddha, fully capable of accomplishing all excellent things, and he can shake the innumerable worlds in the ten directions with his light shining universally.",
        "source": "T09n0278_008:0448c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能持十方諸世界，　　嚴淨一切眾生心，　悉知一切眾生根，　　演梵音聲滿十方。",
        "translation": "He can sustain the worlds in the ten directions, gloriously purify the minds of all sentient beings, fully understand the faculties of all sentient beings, and sound the voice of Brahmā to fill the ten directions.",
        "source": "T09n0278_008:0448c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　調伏化度諸群生，　　悉令修習菩提心，　普入十方諸佛國，　　觀察法界無有餘。",
        "translation": "He disciplines, converts, and liberates all sentient beings, causes them to cultivate the mind of enlightenment, universally enters the buddha lands of the ten directions, and observes the Dharma realm without remainder.",
        "source": "T09n0278_008:0448c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　灌頂色身及身業，　　神足自在不思議，　觀察三世佛國智，　　乃至王子所不測。",
        "translation": "They are endowed with the physical body and bodily actions, have miraculous abilities, and don't think twice about it, and contemplate the wisdom of the buddha lands of the three times, even beyond the reach of princes.",
        "source": "T09n0278_008:0448c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世諸佛及佛法，　　分別了知無障礙，　法界無量無有邊，　　諸佛聲聞悉充滿。",
        "translation": "He discerns the buddhas and buddha-teachings of the three times without obstruction, and he fills the Dharma realm with measureless and limitless śrāvakas.",
        "source": "T09n0278_008:0448c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盡於一切諸世界，　　皆悉能持光普照，　盡於一切群生類，　　為說究竟正覺智。",
        "translation": "Throughout all the worlds, they're all capable of holding a light that shines universally, and throughout all sentient beings, they explain their ultimate knowledge of right awakening.",
        "source": "T09n0278_008:0448c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是十住諸菩薩，　　悉從如來法化生，　隨其方便及境界，　　一切天人莫能知。",
        "translation": "Thus, the bodhisattvas in the ten abodes are all born from the Tathāgata's teaching, according to their skillful means and objects, which are unknown to all gods and humans.",
        "source": "T09n0278_008:0448c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初發無上菩提心，　　充滿十方悉無餘，　了達三世諸法相，　　具足成就一切智。",
        "translation": "They first give rise to the unsurpassed mind of enlightenment, filling all the ten directions without remainder, fully comprehending the characteristics of the three worlds' dharmas, and fully accomplishing omniscience.",
        "source": "T09n0278_008:0448c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無邊佛剎及世間，　　無量無數眾生類，　煩惱業報菩提心，　　如是一切無所著。",
        "translation": "There are limitless buddha bases and worlds, measureless and countless types of sentient beings, afflictions, karmic retribution, and the mind of enlightenment, so there's nothing to attach to.",
        "source": "T09n0278_008:0448c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初求佛道發一念，　　世間眾生及二乘，　斯等一切莫能知，　　何況菩薩餘功德？",
        "translation": "When he first seeks the Buddha Way and arouses a single thought, none of these things can be known by sentient beings or adherents of the two vehicles, much less by the rest of the bodhisattva's attributes.",
        "source": "T09n0278_008:0448c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方一切諸世界，　　能以一毛悉稱舉，　彼知菩薩具足行，　　疾得如來一切智。",
        "translation": "\"Of all the worlds in the ten directions, he can praise them all with a single hair, knowing that the bodhisattva is fully practicing and quickly attains the tathāgata's omniscience.",
        "source": "T09n0278_008:0449a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方一切大海水，　　能以一毛渧令盡，　於一念中悉知數，　　如是行者真佛子。",
        "translation": "He can use a single drop of water from all the vast waters in the ten directions to make it all disappear, and he knows the number in a single thought, so this practitioner is truly the son of the Buddha.",
        "source": "T09n0278_008:0449a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切世界末為塵，　　悉能分別知其數，　菩薩所行等微塵，　　是則名為真佛子。",
        "translation": "He can discern the number of all the worlds that are reduced to dust, and he knows the number of such tiny particles as what the bodhisattva does, then he's called a true son of the Buddha.",
        "source": "T09n0278_008:0449a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去未來現在佛，　　一切緣覺及聲聞，　分別解說不能盡，　　發心菩薩諸功德。",
        "translation": "Past, future, and present buddhas, all pratyekbuddhas and direct disciples, and those who discern and explain them cannot exhaust the bodhisattva's virtues when they first arouse the aspiration for enlightenment.",
        "source": "T09n0278_008:0449a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩初發菩提心，　　廣大無量無有邊，　大慈大悲覆一切，　　何況菩薩餘功德。」",
        "translation": "The bodhisattva's initial aspiration for enlightenment is vast and limitless, and great kindness and compassion cover them all, not to mention the bodhisattva's other virtues.\"",
        "source": "T09n0278_008:0449a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎大方廣佛華嚴經梵行品第十二爾時，正念天子白法慧菩薩言：「佛子！",
        "translation": "It was then that the goddess of right mindfulness said to the bodhisattva Dharma wisdom, \"Son of the Buddha!",
        "source": "T09n0278_008:0449a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世界中，諸菩薩摩訶薩信家、非家、出家學道，捨離俗飾，被服法衣，彼諸菩薩云何方便修習梵行，具足菩薩十住道地，速成無上平等菩提？」",
        "translation": "What are the ways in which bodhisattvas, mahāsattvas, believers, non-family members, and renunciant practitioners in all the worlds who abandon worldly adornment and are clothed in the Dharma robe cultivate the religious practice, perfect the bodhisattva's ten abodes of the path, and quickly achieve unsurpassed, equal enlightenment?\"",
        "source": "T09n0278_008:0449a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，法慧菩薩答正念天子言：「正士！",
        "translation": "At that point, the Bodhisattva Dharma Wisdom replied to the Astronomer Correctly Mindful, \"Correct man!",
        "source": "T09n0278_008:0449a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩摩訶薩一向專求無上菩提，先當分別十種之法。",
        "translation": "This bodhisattva-mahāsattva has always focused on unsurpassed enlightenment, so he should first discern ten kinds of things.",
        "source": "T09n0278_008:0449a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0449a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：身、身業、口、口業、意、意業、佛、法、僧、戒，應如是觀：為身是梵行耶？",
        "translation": "What is meant by this is: \"What is the body, body actions, mouth, mouth actions, mind, mind actions, buddhas, dharmas, saṃgha, and precepts that should be observed like this: Is the body a religious practice?",
        "source": "T09n0278_008:0449a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至戒是梵行耶？",
        "translation": "Is it even the case that the precepts are the religious practice?",
        "source": "T09n0278_008:0449a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身是梵行者，當知梵行則不清淨；當知梵行則為非法；當知梵行則為渾濁；當知梵行則為臭惡；當知梵行則為穢污；當知梵行則為塵垢；當知梵行則為諂曲；當知梵行則為八萬戶蟲。",
        "translation": "\"If his body is the religious practice, he should know that the religious practice is impure, that the religious practice is unlawful, that the religious practice is turbid, that the religious practice is foul, that the religious practice is defiled, that the religious practice is dusty, that the religious practice is flattering, and that the religious practice is the result of 80,000 worms.",
        "source": "T09n0278_008:0449a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身業是梵行者，當知身四威儀則為梵行；左右顧眄舉足下足則為梵行。",
        "translation": "If physical conduct is the religious practice, you should know that the four bodily mannerisms are the religious practice, and that looking from side to side, lifting your feet, and lowering your feet are the religious practice.",
        "source": "T09n0278_008:0449a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若口是梵行者，當知音聲則為梵行；當知語言則為梵行；當知心觸則為梵行；當知舌動則為梵行；當知脣齒和合則為梵行。",
        "translation": "If his mouth is the practice of Brahma, he should know the sounds of music to be the practice of Brahma, know speech to be the practice of Brahma, know the touch of his mind to be the practice of Brahma, know the movement of his tongue to be the practice of Brahma, and know the joining of his lips and teeth to be the practice of Brahma.",
        "source": "T09n0278_008:0449a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若口業是梵行者，當知語言則為梵行；當知所說作、無作、稱譏、毀譽，則為梵行。",
        "translation": "If verbal action is the religious practice, it's the religious practice to know speech, and it's the religious practice to know what's said to be done, what's not done, and what's praised and disparaged.",
        "source": "T09n0278_008:0449b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若意是梵行者，當知覺、觀、憶念、不忘、思惟、幻、夢等悉為梵行。",
        "translation": "If mind is the religious practice, then you should know that perception, contemplation, recollection, nonforgetfulness, contemplation, illusions, and dreams are all the religious practices.",
        "source": "T09n0278_008:0449b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若意業是梵行者，當知想是梵行；施設是梵行；寒、熱、飢、渴、苦、樂、憂、喜等悉是梵行。",
        "translation": "If mental activity is the practice of Brahma, you should know that conception is the practice of Brahma, that making provision is the practice of Brahma, and that cold, heat, hunger, thirst, pain, pleasure, sorrow, joy, and so forth are all the practices of Brahma.",
        "source": "T09n0278_008:0449b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛是梵行者，為色是佛耶？",
        "translation": "If the Buddha is a religious practice, then is form the Buddha?",
        "source": "T09n0278_008:0449b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為受、想、行、識是佛耶？",
        "translation": "Are feeling, perception, volition, and consciousness buddhas?",
        "source": "T09n0278_008:0449b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為三十二相、八十種好是佛耶？",
        "translation": "Are the thirty-two marks and eighty features the buddhas?",
        "source": "T09n0278_008:0449b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為一切神通、業報是佛耶？",
        "translation": "Are all supernormal powers and karmic retribution buddhas?",
        "source": "T09n0278_008:0449b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法是梵行者，為正教是法耶？",
        "translation": "If the teaching is the practice of Brahmā, is the correct teaching the teaching?",
        "source": "T09n0278_008:0449b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為寂滅、離涅槃是法耶？",
        "translation": "Is this dharma that is tranquil and free from nirvāṇa?",
        "source": "T09n0278_008:0449b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為生、非生是法耶？",
        "translation": "Is it a dharma that is produced or not produced?",
        "source": "T09n0278_008:0449b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為實、非實是法耶？",
        "translation": "Is this a real or unreal dharma?",
        "source": "T09n0278_008:0449b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為虛妄是法耶？",
        "translation": "Is this a false dharma?",
        "source": "T09n0278_008:0449b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為合、散是法耶？",
        "translation": "Is it a dharma to combine and disperse?",
        "source": "T09n0278_008:0449b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧是梵行者，為向須陀洹果是僧耶？",
        "translation": "If a monk is a priest, is he a monk who is headed toward the fruit of stream entry?",
        "source": "T09n0278_008:0449b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為得須陀洹果是僧耶？",
        "translation": "Is it a monk who has attained the fruit of stream entry?",
        "source": "T09n0278_008:0449b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為向斯陀含阿那含阿羅漢果是僧耶？",
        "translation": "Is the fruit of the arhat who goes to the once-returner a monk?",
        "source": "T09n0278_008:0449b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為得斯陀含阿那含阿羅漢果是僧耶？",
        "translation": "Is the fruit of the arhat who attains the stage of sakṛd-ānāga a monk?",
        "source": "T09n0278_008:0449b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為三明、六通是僧耶？",
        "translation": "Are the three luminous and six supernormal powers saṃgha?",
        "source": "T09n0278_008:0449b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為時解脫是僧耶？",
        "translation": "Is this the saṃgha who is liberated at that time?",
        "source": "T09n0278_008:0449b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為非時解脫是僧耶？",
        "translation": "Why is liberation not timely, is it, saṃgha?",
        "source": "T09n0278_008:0449b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若戒是梵行者，為戒場是戒耶？",
        "translation": "If the precepts are the practice of celibacy, is the site of the precepts the precepts?",
        "source": "T09n0278_008:0449b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為十眾是戒耶？",
        "translation": "Are the ten groups of people precepts?",
        "source": "T09n0278_008:0449b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為問清淨、不清淨是戒耶？",
        "translation": "Why do you ask whether purity or impurity is a precept?",
        "source": "T09n0278_008:0449b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為戒師是戒耶？",
        "translation": "Is the preceptor a preceptor?",
        "source": "T09n0278_008:0449b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為三羯磨和尚是戒耶？",
        "translation": "Is the monk who administers the three karmic precepts a monk?",
        "source": "T09n0278_008:0449b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為鬀髮、法服、乞食是戒耶？",
        "translation": "Is it a precept to beg for food with one's hair shaved, dressed in robes of the Dharma?",
        "source": "T09n0278_008:0449b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩當如是觀察十種法。",
        "translation": "Thus, the bodhisattvas, mahāsattvas, should examine the ten kinds of dharmas.",
        "source": "T09n0278_008:0449b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，知過去無所至，未來無所有，現在無作者、無知者、無受報者，此世不至彼世，彼世不至此世。",
        "translation": "\"Furthermore, they know that there was nothing in the past that will reach them, nothing in the future, no author, no knower, and no one who will receive the reward in the present, that this life won't reach the other life, and that the other life won't reach this life.",
        "source": "T09n0278_008:0449b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為何等法是梵行？",
        "translation": "What's the religious practice?",
        "source": "T09n0278_008:0449b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵行法為在何處？",
        "translation": "Where does the Dharma of the religious life lie?",
        "source": "T09n0278_008:0449b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰有是梵行法？",
        "translation": "Who has the dharma of the practice of celibacy?",
        "source": "T09n0278_008:0449b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此梵行法為是有耶？",
        "translation": "Does this brahma-practice dharma exist?",
        "source": "T09n0278_008:0449b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是無耶？",
        "translation": "Why is it nonexistent?",
        "source": "T09n0278_008:0449b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是色法耶？",
        "translation": "Why is it a form dharma?",
        "source": "T09n0278_008:0449b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為非色法耶？",
        "translation": "Is it not a form dharma?",
        "source": "T09n0278_008:0449b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是受、想、行、識法耶？",
        "translation": "Why are these feelings, perceptions, volitions, and consciousnesses?",
        "source": "T09n0278_008:0449b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為非受、想、行、識法耶？",
        "translation": "Is it not feeling, perception, volition, and consciousness?",
        "source": "T09n0278_008:0449b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩正念無障礙，觀察、分別三世諸法平等，猶如虛空，無有二相。",
        "translation": "With right mindfulness unobstructed, the bodhisattva-mahāsattva observes and discerns the equality of the three worldly dharmas as if they were empty space, with no two characteristics.",
        "source": "T09n0278_008:0449b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀者，智慧、方便無所罣礙。",
        "translation": "When they thus observe them, their wisdom and skillful means are unimpeded.",
        "source": "T09n0278_008:0449b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法而不取相，一切諸法無自性故；於一切佛及諸佛法平等觀察，猶如虛空；是名菩薩摩訶薩方便修習清淨梵行。",
        "translation": "Not grasping the characteristics of all things, because all things lack self-nature, and observing all buddhas and their teachings equally as if they were empty space, this is called the bodhisattva-mahāsattva skillfully cultivating the pure religious practice.",
        "source": "T09n0278_008:0449c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復修習增上十法。",
        "translation": "\"Furthermore, they cultivate ten superior qualities.",
        "source": "T09n0278_008:0449c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T09n0278_008:0449c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：是處非處智，去、來、現在諸業報智，一切諸禪三昧正受解脫垢淨起智，眾生諸根智，隨諸欲樂智，種種性智，至一切處道智，無障礙宿命智，無障礙天眼智，斷習氣智，是為十。",
        "translation": "They are: knowledge of right and wrong places, knowledge of the results of past, future, and present actions, knowledge of the pure arising of all meditative samādhis and correctly received liberation, knowledge of the faculties of sentient beings, knowledge of following desires and pleasures, knowledge of various natures, knowledge of the path to all places, knowledge of unobstructed past lives, knowledge of the unobstructed divine eye, and knowledge of the elimination of karmic impressions, which are the ten.",
        "source": "T09n0278_008:0449c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀察如來十力甚深無量，具足長養大慈悲心，悉分別眾生而不捨眾生，亦不捨寂滅；行無上業，不求果報；觀一切法如幻、如夢、如電、如響、如化。",
        "translation": "Thus observing the profundity and limitlessness of the Tathāgata's ten powers, they fully cultivate the mind of great compassion, discerning all sentient beings without abandoning them or abandoning extinction, performing unsurpassed actions without seeking the results, and observing all things as illusory, dreamlike, lightning, resonant, and transformative.",
        "source": "T09n0278_008:0449c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是觀者，以少方便，疾得一切諸佛功德。",
        "translation": "Thus observing them, the bodhisattva Mahāsattva quickly attains all the merits of the buddhas with few skillful means.",
        "source": "T09n0278_008:0449c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常樂觀察無二法相，斯有是處。",
        "translation": "There's a place for always delighting in observing the characteristics of nondual dharmas.",
        "source": "T09n0278_008:0449c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初發心時，便成正覺，知一切法真實之性，具足慧身，不由他悟。」",
        "translation": "When he first arouses his mind, he then becomes perfectly enlightened, knows the true nature of all things, and is fully endowed with the body of wisdom that doesn't let others understand.\"",
        "source": "T09n0278_008:0449c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大方廣佛華嚴經卷第八",
        "translation": "◎ Dafangguang fo huayan jing roll eight",
        "source": "T09n0278_008:0449c15_8",
        "is_bad_quality": false
    }
]