[
    {
        "source_sentence": "正法華經卷第三",
        "translation": "Sutra of the True Dharma Flower, Volume 3",
        "source": "T09n0263_003:0080a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, Tripiṭaka of the Yuezhi State, Western Jin Dynasty",
        "source": "T09n0263_003:0080a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信樂品第四",
        "translation": "The Fourth Chapter of Faith and Bliss",
        "source": "T09n0263_003:0080a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是賢者須菩提、迦旃延、大迦葉、大目揵連等，聽演大法，得未曾有，本所未聞；而見世尊授舍利弗決，當得無上正真之道，驚喜踊躍咸從坐起，進詣佛前偏袒右肩，禮畢叉手瞻順尊顏，內自思省心體熙怡，支節和懌悲喜竝集，白世尊曰：「唯大聖通，我等朽邁年在老耄，於眾耆長僉老羸劣，歸命眾祐冀得滅度，志存無上正真之道，進力尠少無所堪任，如來所講我等靖聽，次第坐定諸來大眾，不敢危疲無所患厭。",
        "translation": "於是賢者須菩提、迦旃延、大迦葉、大目揵連等，聽演大法，得未曾有，本所未聞；而見世尊授舍利弗決，當得無上正真之道，驚喜踊躍咸從坐起，進詣佛前偏袒右肩，禮畢叉手瞻順尊顏，內自思省心體熙怡，支節和懌悲喜竝集，白世尊曰：「唯大聖通，我等朽邁年在老耄，於眾耆長僉老羸劣，歸命眾祐冀得滅度，志存無上正真之道，進力尠少無所堪任，如來所講我等靖聽，次第坐定諸來大眾，不敢危疲無所患厭。",
        "source": "T09n0263_003:0080a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前者如來為鄙說法，已得於空、無相、無願，至于佛典國土所有，於一切法無所造作，其諸菩薩所可娛樂，如來勸發多所率化。",
        "translation": "The Tathāgata who taught this Dharma for me had attained emptiness, signlessness, and wishlessness, reached the Buddha's canonical possessions in his land, created nothing from all phenomena, and was an amusement to bodhisattvas who were encouraged by the Tathāgata to lead many of them into the path.",
        "source": "T09n0263_003:0080a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄙於三界而見催逐，常自惟忖謂獲滅度，今至疲憊，爾乃誨我以奇特誼，樂於等一，則發大意於無上正真道。",
        "translation": "Being despised by the three realms and seeing themselves hustled, they always ponder for themselves that they've been saved, and now that they've reached exhaustion, they've instructed me to take a special meaning, to enjoy equal unity, and then to give great intent to the unsurpassed true path.",
        "source": "T09n0263_003:0080a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而今大聖授聲聞決當成正覺，心用愕然怪未曾有，余得大利各當奉事，乃獲逮聞如是品經。",
        "translation": "Now, the great sage has granted the śrāvakas the assurance that they will become fully awakened, and their minds are startled and surprised like never before, so they each will serve the remaining great benefits and then they'll be able to hear such a scripture.",
        "source": "T09n0263_003:0080a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從過去佛常聞斯法，故初值遇，則我祿厚喻獲妙寶，無央數妙意所至願，現在於色而無所畏，珍琦鼓樂自然為鳴，而燃大燈炤耀彌廣，栴檀叢林芬蘊而香。",
        "translation": "Since the Buddha had often heard this teaching in the past, when I first encountered it, I was rich in rewards and metaphors, had access to marvelous treasures, had incalculably wonderful intentions, wished for, and was now fearless in form, blessed with rare and precious music that naturally sounds, lit a great lamp that shines brightly and widely, and perfumed by the fragrance of a sandalwood grove.",
        "source": "T09n0263_003:0080a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然世尊，我豈堪任而說之乎？」",
        "translation": "Bhagavān, how could I possibly explain this?\"",
        "source": "T09n0263_003:0080a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告曰：「可也。」",
        "translation": "He said, \"Yes, it's OK.\"",
        "source": "T09n0263_003:0080a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸聲聞共白佛言：「昔有一士離父流宕，僑亭他土二三十年，馳騁四至求救衣食，恒守貧窮困無產業。",
        "translation": "The śrāvakas all said to the Buddha, \"Once, there was a man who left his father and went into exile, lived in a foreign land for 20 or 30 years, traveled from place to place, sought food and clothing, and remained poor and destitute without possessions.",
        "source": "T09n0263_003:0080a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父詣異城，獲無央數金銀珍寶、水精琉璃、車璩馬碯、珊瑚虎魄，帑藏盈滿，侍使僮僕、象馬車乘不可稱計，眷屬無數七寶豐溢，出內錢財耕種賈作。",
        "translation": "When his father went to a different city, he obtained an incalculable amount of gold, silver, jewelry, lapis lazuli, chariots, horses, agates, coral, and tiger spirits, and his coffers were filled to overflowing with servants, elephants, horses, and chariots, and his entourage was overflowing with countless seven treasures, and he had money and property inside to cultivate.",
        "source": "T09n0263_003:0080b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子厄求食，周行國邑城營村落。",
        "translation": "Seeking food, their sons travel around the country's towns, cities, and villages.",
        "source": "T09n0263_003:0080b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造富長者適值秋節，入處城內循行帑藏，與子別久忽然思見，不知所在。",
        "translation": "It was the autumn festival when the wealthy elder went into the city to look around for the treasury, and after a long separation from his son, he suddenly missed seeing him and didn't know where he was.",
        "source": "T09n0263_003:0080b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自念：『一夫，財富無量橫濟遠近，竊惟我老朽耄垂至，假使終沒室藏騷散，願得見子恣所服食，則獲無為不復憂慼。』",
        "translation": "He thought to himself, 'That man has an incalculable fortune that reaches far and near, but I'm old and decrepit and will soon die.",
        "source": "T09n0263_003:0080b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子僥會至長者家，遙見門前，梵志君子大眾聚會眷屬圍遶，金銀雜廁為師子座，交露珠瓔為大寶帳，父坐其中分部言教，諸解脫華遍布其地，億百千金以為飲食。",
        "translation": "When the son arrived at the elder's house by chance, he saw at the door a large gathering of priests, gentlemen, and their retinues surrounding him, a lion's seat made of gold and silver, a large jeweled canopy made of beads and jewels, a father sitting inside, discourses, flowers of liberation all over the ground, and hundreds of thousands of pieces of gold for food.",
        "source": "T09n0263_003:0080b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子覲長者色像威嚴，怖不自寧，謂是帝王若大君主，進退猶豫不敢自前，孚便馳走。",
        "translation": "When the son sees the elder's imposing appearance, he's terrified and unnerved, thinking he's an emperor or a great ruler, and he hesitates to advance or retreat.",
        "source": "T09n0263_003:0080b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父遙見子心用歡喜，遣傍侍者追呼令還。",
        "translation": "Seeing his son from a distance, his father's heart rejoiced and he sent an attendant to chase after him and order him to return.",
        "source": "T09n0263_003:0080b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遑懅躄地，謂追者曰：『我不相犯，何為見捉？』",
        "translation": "He was terrified and said to his pursuer, 'Why did I see and arrest you when I'm not at odds with you?'",
        "source": "T09n0263_003:0080b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者執之俱詣長者。",
        "translation": "The attendants took them and presented them to the elder.",
        "source": "T09n0263_003:0080b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者告曰：『勿恐勿懼，吾為子勤廣修產業帑藏充實，與子別久數思相見，年高力弊父子情重。』",
        "translation": "The elder told them, 'Don't be afraid, don't be frightened. I've worked hard for my son to cultivate an industry and have a well-stocked treasury, and I've longed to see him after a long separation.",
        "source": "T09n0263_003:0080b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將入家內，在於眾輩不與共語。",
        "translation": "When he was about to enter his home, he didn't speak with the others.",
        "source": "T09n0263_003:0080b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_003:0080b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父知窮子志存下劣不識福父，久久意悟色和知名，又見琦珍。",
        "translation": "My father knew that his poor son had a lowly aspiration and didn't know his father's merit, but after a long time he realized that he was well-known for his color and harmony, and then he saw Qizhen.",
        "source": "T09n0263_003:0080b23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者言曰：『是吾子也。",
        "translation": "The elder said, 'This is my son.'",
        "source": "T09n0263_003:0080b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以權告子。",
        "translation": "I'll tell him with authority.",
        "source": "T09n0263_003:0080b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今且恣汝隨意所奉。』",
        "translation": "Now, I'll let you do as you like with what you're given.'",
        "source": "T09n0263_003:0080b25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "窮子怪之得未曾有，則從坐起行詣貧里求衣索食，父知子緣，方便與語：『汝便自去與小眾俱。』",
        "translation": "The poor son wondered about this unprecedented achievement, so he got up from his seat and went to a poor neighborhood to ask for clothing and food. The father knew his son's reason and conveniently told him, 'Go away and join the small crowd.'",
        "source": "T09n0263_003:0080b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子來至此而再致印，曰：『至此宅有所調飾。』",
        "translation": "The son came to this place, gave his seal again, and said, 'I've had some work done at this house.'",
        "source": "T09n0263_003:0080b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父付象馬即令粗習，假有問者答亦如之，當調車馬嚴治寶物恣意賜與，父求窮子所可賑給，具足如斯。",
        "translation": "The father then gave him an elephant and a horse to roughly train, and if he were to ask a question, he would answer it likewise.",
        "source": "T09n0263_003:0080b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時子於廐調習車馬繕治珍寶，轉復教化家內小大。",
        "translation": "The son then trained the chariots and horses in the stable, dressed the treasures, and went on to teach the younger and older members of the household.",
        "source": "T09n0263_003:0080c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父於窓牖遙見其子所為超絕，脫故所著沐浴其身，右手洗之，以寶瓔珞香華被服，光曜其體皆令清淨，而告之曰：『爾從本來何所興立？",
        "translation": "The father sees his son from a distance through a window, transcends what he's done, takes off the clothes he's worn, washes his right hand, puts on a jeweled necklace, dresses him in flowers and fragrances, and makes his body shine so that it's pure.",
        "source": "T09n0263_003:0080c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何所繫屬？",
        "translation": "What is the bondage?",
        "source": "T09n0263_003:0080c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨吾他行，勤苦饑寒。",
        "translation": "He abandoned me to other practices, suffering hardship and hunger.",
        "source": "T09n0263_003:0080c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾以耄矣，以情相告，便時納娶，嬉遊飲食以康祚胤。",
        "translation": "When I was old, I told them with my heart that I would marry at an appropriate time, and I would enjoy eating and drinking to bring prosperity to my grandchildren.",
        "source": "T09n0263_003:0080c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾所造業不可訾計，眾寶具足子知之乎！",
        "translation": "I've created an incalculable amount of activity, and you know that I have an abundance of treasures!",
        "source": "T09n0263_003:0080c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求汝積年而戀惡友，今乃來歸宜除瑕垢，吾有妙寶夜光明珠琦珍璝異，皆為汝施，僮僕侍使男女大小，恣意所欲，一以相付。",
        "translation": "'Please, you've been longing for a bad friend, and now you've come back to me to remove the blemish; I have wonderful treasures, luminous pearls, rare and precious things, to give to you, and I'll give you servants, attendants, men and women, large and small, whatever you want.",
        "source": "T09n0263_003:0080c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾愛念汝，猶如國王幸其太子。』」",
        "translation": "I love and think of you as a king who pleases his prince.'\"",
        "source": "T09n0263_003:0080c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸尊聲聞共白佛言：「彼時窮子，播盪流離二三十年，至長者家乃得申敘，追惟前後遊觀所更心悉念之。",
        "translation": "The venerable śrāvakas all said to the Buddha, \"That poor boy who had been roaming and wandering for twenty or thirty years finally found himself in the elder's home, where he was able to recount his experiences and look back at what he'd seen before and after, and then he was fully mindful of it.",
        "source": "T09n0263_003:0080c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大長者寢疾于床知壽欲終，自命其子而告之曰：『吾今困劣宜承洪軌，居業寶藏若悉受之，周濟窮乏從意所施，輒備奉教喜不自勝，所行至誠不失本誓。』",
        "translation": "When the great elder fell ill on his bed and knew he was about to reach the end of his life, he ordered his son to tell him, 'Now that I'm poor and disadvantaged, I should accept the great guideline, accept the treasures of my life's work, and accept whatever I wish to give to the poor and needy, and then I'll readily submit to the teaching and rejoice uncontrollably, acting sincerely and not losing my original vow.'",
        "source": "T09n0263_003:0080c15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父知子志身行謹勅，先貧後富益加欣慶，宗敬親屬禮拜耆長，父於國王君主大臣眾會前曰：『各且明聽，斯是吾子則吾所生，名字為某，捨我流迸二三十年，今乃相得。",
        "translation": "The father knew his son's intentions and personal conduct, and he was encouraged by the fact that he had first become poor and then rich. When the patriarch paid respect to his relatives and venerated the elders, the father told the king, ruler, and ministers in front of the congregation, 'Listen closely, my son was born to me by a certain name, and he abandoned me for twenty or thirty years before we were able to meet now.",
        "source": "T09n0263_003:0080c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯則吾子吾則是父，所有財寶皆屬我子。』",
        "translation": "Then I am the father of this son of mine, and all his wealth and treasure belong to my son.'",
        "source": "T09n0263_003:0080c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子聞宣令大眾之音，心益欣然而自念言：『余何宿福得領室藏？』」",
        "translation": "When the son heard the voice of the crowd, he rejoiced and said to himself, 'What past fortune has brought me to the storehouse?'\"",
        "source": "T09n0263_003:0080c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聲聞等又白佛言：「大富長者則譬如來，諸學士者則謂佛子，勉濟吾等三界勤苦，如富長者還執其子度脫生死。",
        "translation": "The śrāvakas also said to the Buddha, \"The wealthy elder is like the tathāgata, and the first disciples are called sons of the Buddha who strive to help us with the suffering of the three realms, just as the wealthy elder still clings to his son to liberate him from birth and death.",
        "source": "T09n0263_003:0080c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊，有無央數聖眾之寶，以五神通除五陰蓋，常修精進在彼道教，志于滅度謂為妙印。",
        "translation": "Thus, Bhagavān, there are measureless treasures of the noble ones who use the five supernormal powers to remove the hindrances of the five aggregates, always cultivate their energies, and teach the path with the intention of ending suffering, which is called the marvelous seal.",
        "source": "T09n0263_003:0080c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慇懃慕求初不休懈，欲得無為意中默然，熟自思惟所獲無量，於如來所承順法行，遵修禪定而常信樂。",
        "translation": "They pursue their endeavors without relenting at first, are silent in their minds as they seek to attain nothing, mature in their own reflection about the immeasurable rewards they'll attain, practice in accord with the Tathāgata's teachings, and abide in faith as they cultivate meditation.",
        "source": "T09n0263_003:0081a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂觀我等懈廢下劣，而不分別不能志願，此如來法珍寶之藏，於今世尊以權方便，觀于本際慧寶帑藏，蠲除饑[飢-几+內]授大妙印。",
        "translation": "That is, observing our laziness and inferiority and not discriminating our inability to aspire, the Bhagavān now observes the treasury of the Tathāgata's Dharma treasure by means of expedient devices, observes the treasury of the original wisdom treasure, and clears hunger [hunger - a few + internal] by bestowing a great and wonderful seal.",
        "source": "T09n0263_003:0081a03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然大聖於今耆年，斯大迦葉從如來所朝旦印印，當至無為。",
        "translation": "Granting that the great sage is now elderly, this Mahākāśyapa will attain nothingness after he receives the Tathāgata's morning mudrā and seal.",
        "source": "T09n0263_003:0081a06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又世尊為我等示現菩薩大士慧誼，余黨奉行為眾說法，當顯如來聖明大德，咸使暢入隨時之誼。",
        "translation": "The Bhagavān also showed us the wisdom of the bodhisattva mahāsattvas, and the rest of the group approved of their teaching, which will show that the Tathāgata's noble and insightful qualities will all lead to their entering into the friendship of the people at all times.",
        "source": "T09n0263_003:0081a08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_003:0081a10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世雄大通善權方便，知我志操不解深法，為現聲聞，畏三界法及生老死，色聲香味細滑之事，趣欲自濟不救一切，離大慈悲智慧善權，禪定三昧乃知人心，不覩一切眾生根原。",
        "translation": "\"The hero of the world, who has great supernormal power and good authority, knows that my aspirations and conduct don't understand the profound Dharma, that he's a direct disciple, that he's afraid of the three realms and dharmas, birth, age, and death, and the fine and smooth things of form and sound and smell, that he wants to help himself and doesn't save all people, that he's free of great compassion and wisdom, that he knows people's minds through meditation and concentration, and that he doesn't see the origin of all sentient beings.",
        "source": "T09n0263_003:0081a10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如窮士求衣索食，而父須待欲使安樂，子不覺察。",
        "translation": "He's like a poor man seeking clothing and food, whose father expects and wants to make him comfortable, but his son doesn't perceive it.",
        "source": "T09n0263_003:0081a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以方便隨時示現，我等不悟。",
        "translation": "The Buddha shows us this at any time with skillful means, but we don't understand it.",
        "source": "T09n0263_003:0081a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今乃自知成佛真子，無上孫息為佛所矜，施以大慧。",
        "translation": "Now, we know that we've become true sons of the Buddha, and our unsurpassed grandchildren's respiration is honored by the Buddha, who gives us great wisdom.",
        "source": "T09n0263_003:0081a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_003:0081a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖為佛子下賤怯弱，假使如來，覩心信樂喜菩薩乘，然後乃說方等大法。",
        "translation": "Even though he's a humble and weak son of the Buddha, suppose the Tathāgata were to meet with faith and happiness in his mind and rejoice in the bodhisattva vehicle, and then he would explain the great Dharma in its various aspects.",
        "source": "T09n0263_003:0081a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又世尊興為二事，為諸菩薩現甘露法，為諸下劣志願小者，轉復勸進入微妙誼。",
        "translation": "\"The Bhagavān also does two things, showing bodhisattvas the nectar Dharma and encouraging those of lowly aspirations to enter the subtle fellowship again.",
        "source": "T09n0263_003:0081a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如彼子與父別久，行道遙見，不識何人呼而怖懼；後稍稍示威儀法則乃知是父。",
        "translation": "It's like a son who's been separated from his father for a long time and sees him walking along the road from a distance, doesn't recognize who he's calling, and becomes frightened; then, after a little demonstration of manners and methods, he knows it's his father.",
        "source": "T09n0263_003:0081a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦如是，吾等不解菩薩大士，雖從法生為如來子，但求滅度，不志道場坐於樹下降魔官屬度脫一切。",
        "translation": "So it is with the Buddha. We don't understand that even though a bodhisattva or a great person is born from the Dharma and becomes a son of the Tathāgata, they only seek to be liberated and don't aspire to sit in the place of enlightenment or descend from a tree into the ranks of Māra to liberate them all.",
        "source": "T09n0263_003:0081a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我輩自謂已得解脫，以是之故，今日覩聞未為成就，不為出家不成沙門。",
        "translation": "We think we've already attained liberation, and because of that, what we've seen and heard today has yet to be accomplished, and we don't leave home to become ascetics.",
        "source": "T09n0263_003:0081a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今如來尊現諸通慧，我等以獲大聖珍寶，佛則為父我則為子，父子同體焉得差別。",
        "translation": "Now, the Tathāgata honored us with the manifestation of his supernormal wisdom, and we've been given the treasures of a great sage, with the Buddha as father and I as son; how could there be any difference when father and son are the same in essence?",
        "source": "T09n0263_003:0081a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如長者臨壽終時於大眾前，宣令帝王梵志長者君子，今諸所有庫藏珍寶用賜其子，子聞歡喜得未曾有。",
        "translation": "It's like an elder who, near the end of his life, announces to an emperor, a priest, or an elderly gentleman, that he'll bestow all the treasures of his son, and the son will rejoice when he hears them.",
        "source": "T09n0263_003:0081b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦如是，先現小乘一時悅我，然今最後，普令四輩比丘、比丘尼、清信士、清信女，天上世間一切人民，顯示本宜。",
        "translation": "In the same way, the Buddha first showed that the lesser vehicle pleased me for a while, but now, finally, he causes the four groups of monks, bhikṣuṇīs, pure believers, and pure believing women, as well as all the peoples of the heavens and the world, to reveal their original appropriateness.",
        "source": "T09n0263_003:0081b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛權方便說三乘耳，尚無有二豈當有三？",
        "translation": "The Buddha expediently explained the three vehicles; how could there be three when there are not yet two?",
        "source": "T09n0263_003:0081b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸聲聞皆當成佛，我等悅豫不能自勝。」",
        "translation": "These śrāvakas will all become buddhas, and we're overcome with joy.\"",
        "source": "T09n0263_003:0081b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大迦葉則說頌曰：「我等今日，　　逮聞斯音，　　怪之愕然，　得未曾有，　　由是之故，　　心用悲喜。",
        "translation": "Mahākāśyapa then spoke a verse, \"Today, we were surprised to hear that sound, and we were surprised to hear it at a level never experienced before; as a result, our hearts were filled with sadness and joy.",
        "source": "T09n0263_003:0081b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又省導師，　　柔軟音聲，　　尊妙珍寶，　為大積聚，　　一處合集，　　以賜我等。",
        "translation": "We also reflect on our guide, whose gentle voice and sublime treasures were gathered in one place for us as a great heap.",
        "source": "T09n0263_003:0081b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　未曾思念，　　亦不有求，　　還聞弘教，　心懷踊躍。",
        "translation": "Without ever thinking about it or expecting it, we hear the great teaching and rejoice with joy.",
        "source": "T09n0263_003:0081b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　譬如長者，　　而有一子，　興起如愚，　　亦不闇冥，　　自捨其父，　行詣他國，　　志于殊域，　　仁賢百千。",
        "translation": "Suppose there's an elder, and there's a son who arises like a fool and isn't dark, leaves his father, travels to another country, and sets out for a different land with a hundred thousand good men.",
        "source": "T09n0263_003:0081b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於時長者，　　愁憂念之，　　然後而聞，　即自迸走，　　遊于十方，　　意常悒慼。",
        "translation": "The elder then becomes sad and mindful of him, and when he hears about it, he bursts away and wanders in the ten directions, his thoughts always troubled.",
        "source": "T09n0263_003:0081b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父子隔別，　　二三十年，　　與人戀訟，　欲得其子，　　便詣異土，　　入于大城。",
        "translation": "After being separated from his father and son for 20 or 30 years, he becomes embroiled in a dispute with someone who wants to win his son, so he travels to a different land and enters a large city.",
        "source": "T09n0263_003:0081b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　則於彼止，　　立於屋宅，　　具足嚴辦，　五樂之欲，　　無數紫金，　　及諸珍寶，　奇異財業，　　明珠碧玉，　　象馬車乘，　甚為眾多。",
        "translation": "There, he stands in a house fully furnished with the five pleasures, countless purple metals, and treasures, exotic possessions, bright pearls, emeralds, elephants, horses, and chariots, and many more.",
        "source": "T09n0263_003:0081b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　牛畜[月*者]彘，　　鷄鶩羠羊，　出內產息，　　賈作耕種，　　奴僕僮使，　不可計數。",
        "translation": "Cattle, animals, [moon*s] swine, cattle, goats, dogs, peasants, farming animals, and slaves and servants are incalculable.",
        "source": "T09n0263_003:0081b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　嚴辦眾事，　　億千百類，　又得王意，　　威若國主，　　一城民庶，　委敬自歸，　　諸郡種人，　　遠皆戴仰。",
        "translation": "He conducts his affairs with care, producing hundreds of thousands of different kinds of people, and he obtains the king's will and authority like a national lord, so that the people of a city will entrust themselves with respect and the seeds of other counties will look up to him from afar.",
        "source": "T09n0263_003:0081b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若干種業，　　因從求索，　　興造既多，　不可計限，　　勢富如是。",
        "translation": "As a result of seeking certain kinds of actions, they've created so many that they can't be counted, and they're so powerful and wealthy.",
        "source": "T09n0263_003:0081b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　啼哭淚出，　吾既朽老，　　志力衰變，　　心誨思想，　欲得見子。",
        "translation": "I cried out in tears, for I was old and my resolve had weakened, but I mentally taught myself to want to see my son.",
        "source": "T09n0263_003:0081c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　夙夜追念，　　情不去懷，　聞子之問，　　意增煩惋。",
        "translation": "I've been longing for him day and night, and my thoughts don't go to my heart. Hearing his question adds to my frustration.",
        "source": "T09n0263_003:0081c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　捨我別來，　二三十年，　　吾之所有，　　財業廣大，　假當壽終，　　無所委付。",
        "translation": "It's been twenty or thirty years since I left you, and I have so much wealth and property that I won't be able to entrust it to you when my life ends.",
        "source": "T09n0263_003:0081c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　計彼長者，　其子愚濁，　　貧窮困厄，　　常求衣食，　遊諸郡縣，　　恒多思想，　　周旋汲汲，　慕係嗇口，　　征營馳邁，　　栽自供活，　或時有獲，　　或無所得。",
        "translation": "Considering that old man, his son is ignorant, poor and destitute, always seeking food and clothing, wandering from county to county, always thinking, wandering and drawing, longing for a meager living, hustling and chasing, planting himself to provide for his living, sometimes getting something, sometimes not.",
        "source": "T09n0263_003:0081c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　纏滯他鄉，　亦懷悒傶，　　志性褊促，　　荊棘[(牙*ㄉ)/里]身，　展轉周旋，　　行不休息，　　漸漸自致，　到父所居。",
        "translation": "Stuck in another village, he's also troubled, narrow-minded, thorny, [(tooth*portion)/li] and bent over, wandering about, walking without rest, gradually making his own way to his father's house.",
        "source": "T09n0263_003:0081c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　槃桓入出，　　復求衣食，　稍稍得進，　　至于家君。",
        "translation": "He goes in and out, seeks food and clothing again, and gets ahead a little, reaching the head of the household.",
        "source": "T09n0263_003:0081c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　遙見勢富，　極大長者，　　在於門前，　　坐師子床，　無數侍衛，　　眷屬圍繞，　　出入財產，　及所施與。",
        "translation": "From a distance, he sees a powerful, wealthy, and very large man sitting at the front door, sitting on a lion's seat, surrounded by numerous guards and retinues, going in and out of possessions and giving them away.",
        "source": "T09n0263_003:0081c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若干人眾，　　營從立侍，　或有計校，　　金銀珍寶，　　或合簿書，　部別分莂，　　紀別入出，　　料量多少。",
        "translation": "A number of people are standing by to attend on him, sometimes with assessments, gold and silver, treasures, or combined books, divisions and categories, keeping track of what's coming in and going out, and gauging how much.",
        "source": "T09n0263_003:0081c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　于時窮子，　　見之如此，　　倚住路側，　觀所云為，　　自惟我身，　　何為至此，　斯將帝王，　　若王太子，　　得無為之，　所牽逼迫，　　不如捨去，　　修己所務。",
        "translation": "Seeing this, the poor man leans over to the side of the road and observes what it is, thinking to himself, \"How did I get here?\" Would this be an emperor or a prince of a king who could do nothing about it and be constrained by it? Why don't they just leave it and cultivate their own work?",
        "source": "T09n0263_003:0081c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　思慮是已，　　尋欲迸逝，　　世無敬貧，　喜窮士者。",
        "translation": "After thinking about this, he looks for a way to burst away, for there's no respect for the poor, and he likes poor people.",
        "source": "T09n0263_003:0081c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是時長者，　　處師子座，　遙見其子，　　心密踊躍，　　尋遣侍者，　追而止之，　　呼彼窮子，　　使還相見。",
        "translation": "The elder was sitting in the lion's seat, and when he saw his son from a distance, his heart leapt, and he sent an attendant after him to stop him, calling out to the poor man and telling him to return to him.",
        "source": "T09n0263_003:0081c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　侍者受教，　　追及宣告，　　錄召令還。",
        "translation": "The attendant accepted the teaching, pursued him, summoned him, and ordered him to return.",
        "source": "T09n0263_003:0081c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即怖僻地，　　心竊自惟，　　得無被害，　曷為見執，　　何所求索。",
        "translation": "He then became frightened and withdrew, thinking to himself, \"Have you ever been harmed? Why do you hold to that view? What do you seek?",
        "source": "T09n0263_003:0081c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大富長者，　見之起強，　　憐傷斯子，　　為下劣極，　亦不覩信，　　彼是我父，　　又復懷疑，　不審財寶。",
        "translation": "A wealthy man who saw him became angry and pitied his son, who was inferior and didn't see and believe that he was my father, and who doubted and didn't examine his wealth.",
        "source": "T09n0263_003:0082a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其人慰喻，　　具解語之，　有紫磨金，　　積聚於此，　　當以供仁，　為飲食具，　　典攝眾計，　　役業侍使，　吾有眾寶，　　蘊積腐敗，　　委在糞壤，　不見飾用。",
        "translation": "That man comforts him and tells him with understanding that there's purple polished gold that's been amassed here, which should be offered to people, used as food and drink, used for collecting various plans, and used as a servant, but I have all these treasures that have accumulated and rotted, which are lying in the dirt and soil, and which I don't see decorated.",
        "source": "T09n0263_003:0082a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　子便多取，　　以為質本，　蓄財殷廣，　　無散用者。",
        "translation": "The son then takes much of it and uses it as a base, accumulating a vast store of wealth that's not scattered for use.",
        "source": "T09n0263_003:0082a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其人聞告，　如是教勅，　　則尋往詣，　　奉宣施行，　受長者教，　　不敢違命，　　即入家中，　止頓正領。",
        "translation": "When that person hears this, they go to the house, receive a teaching, carry it out, accept the elder's teaching, dare not disobey it, and go home to stop and properly lead.",
        "source": "T09n0263_003:0082a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　爾時長者，　　遙從天窓，　詳觀察之，　　知何所為。",
        "translation": "The elder then looked closely at him from a distance through a heavenly window and knew what he was doing.",
        "source": "T09n0263_003:0082a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雖是吾子，　下劣底極，　　唯曉計算，　　調御車耳。",
        "translation": "Even though he was my son, he was inferior to the least, and he only knew how to calculate and tame a chariot.",
        "source": "T09n0263_003:0082a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即從樓觀，　　來下到地，　　便還去衣，　垢污之服，　　則便往詣，　　到其子所。",
        "translation": "He then looked up, descended to the ground, returned to his robe and soiled clothes, and went to his son's place.",
        "source": "T09n0263_003:0082a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勅之促起，　　修所當為，　　則當與卿，　劇難得者，　　以德施人，　　案摩手腳，　醎醲滋美，　　以食相給，　　及床臥具，　騎乘所乏。",
        "translation": "I'll tell him to get up quickly, cultivate what he should do, and then he'll give you something rare and virtuous to give to others, touch their hands and feet, make it delicious and salty, give them food, and provide them with a bed and bedding, which their riders lack.",
        "source": "T09n0263_003:0082a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於時復為，　　娉索妻婦，　敖黠長者，　　以此漸教，　　子汝當應，　分部之業，　　吾愛子故，　　心無所疑。",
        "translation": "Then, he'll also give this gradual teaching to a pretty wife or a wise elder, saying, \"Son, you must agree to this part of the work, for I love my son, so I have no doubts in my mind.",
        "source": "T09n0263_003:0082a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　漸漸稍令，　　入在家中，　　賈作治生，　所入難計，　　所空缺處，　　皆使盈溢，　步步所行，　　鞭杖加人，　　珍琦異寶，　明珠流離，　　都皆收檢，　　內于帑藏，　一切所有，　　能悉計校，　　普悉思惟，　財產利誼。",
        "translation": "Gradually, he will allow them to enter his home, rob him of his wealth, make him work hard to calculate, fill his vacant place, prod people with whips and sticks as he walks, collect rare and precious things, and stray pearls, assemble them all, store them in his treasury, calculate everything, and consider them thoroughly for the benefit of his wealth and friendship.",
        "source": "T09n0263_003:0082a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為愚騃子，　　別作小庫，　與父不同，　　在於外處。",
        "translation": "For a foolish son, he made a separate small treasury, different from his father's, and placed it in an external place.",
        "source": "T09n0263_003:0082a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　于時窮士，　心自念言，　　人無有此，　　如我庫者。",
        "translation": "The poor man then thought to himself, \"There's no one like this, like my treasury.",
        "source": "T09n0263_003:0082a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時父即知，　　志性所念，　　其人自謂，　得無極勢，　　即便召之，　　而親視之。",
        "translation": "His father then knew what he was thinking in his mind and that person said, \"I've attained limitless power,\" so he summoned him and looked at him personally.",
        "source": "T09n0263_003:0082b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲得許付，　　所有財賄，　　而告之曰，　今我一切，　　無數財寶，　　生活資貨，　聚會大眾，　　在國王前，　　長者梵志，　君子等類，　　使人告令，　　遠近大小。",
        "translation": "He wanted to give him permission to possess property and bribes, and he told him, \"Now, I have all this, countless treasures, necessities of life, a gathering of people, a king's presence, elders, priests, gentlemen, and so forth, and people telling him to order them to come near and large.",
        "source": "T09n0263_003:0082b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今是我子，　　捨我迸走，　　在於他國，　梁昌求食，　　窮厄困極，　　今乃來歸，　與之別離，　　二三十年。",
        "translation": "Now, my son abandoned me and left, going to another country, seeking food in Liangchang, and in extreme distress, and now he's come home, having been separated from him for 20 or 30 years.",
        "source": "T09n0263_003:0082b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今至此國，　乃得相見，　　在於某城。",
        "translation": "Now, I've arrived in this country, and I've been able to meet him in a certain city.",
        "source": "T09n0263_003:0082b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　而亡失之，　於此求索，　　自然來至，　　我之財物，　無所乏少，　　今悉現在，　　於斯完具，　一切皆以，　　持用相與，　　卿當執御，　父之基業。",
        "translation": "I lost them, but I was looking for them here, and they came naturally. I have nothing lacking in possessions, and now I have them all, and I'll give them to you for your use.",
        "source": "T09n0263_003:0082b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其人尋歡，　　得未曾有。",
        "translation": "That person's search for joy is unprecedented.",
        "source": "T09n0263_003:0082b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我本貧窮，　　所在不詣，　　父時知余，　為下劣極，　　得諸帑藏，　　今日乃安。",
        "translation": "I was poor and never went there, but my father knew I was inferior, and I've now found peace with the treasury.",
        "source": "T09n0263_003:0082b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大雄導師，　　教化我等，　　覩見下劣，　樂喜小乘，　　度脫我輩，　　使得安隱，　便復授決，　　當成佛道。",
        "translation": "The great heroic guide instructed us, showed us how inferior we were, liked the lesser vehicle, freed us, made us comfortable, and then gave us the decision that we would achieve the Buddha Way.",
        "source": "T09n0263_003:0082b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於今安住，　多所遣行。",
        "translation": "Here we are, standing still, with many rejects and practices.",
        "source": "T09n0263_003:0082b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無數菩薩，　　慧力無量，　分別示現，　　無上大道，　　攀緣稱讚，　億姟譬喻，　　余等得聞。",
        "translation": "Countless bodhisattvas of measureless wisdom power discern and reveal the unsurpassed way, seek praise, and give hundreds of millions of metaphors that the rest of us can hear.",
        "source": "T09n0263_003:0082b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　最勝諸子，　則便奉行，　　尊上大道，　　所當起立，　視眾眼目，　　當於世間，　　得成佛道，　而為聖尊，　　造業如斯。",
        "translation": "The most excellent sons then consecrate themselves to the practice of the supreme path, which should arise, look into the eyes of all, and attain the Buddhahood of the world, becoming noble and venerable, creating activities like this.",
        "source": "T09n0263_003:0082b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　將養擁護，　於此佛法，　　講說分別，　　最勝慧誼。",
        "translation": "They will nourish and protect him, teaching and discerning this Buddha's teaching, and the most excellent friendship of wisdom.",
        "source": "T09n0263_003:0082b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　則為感動，　　一切眾生，　　我等志願，　貧心思念。",
        "translation": "That will move all sentient beings, our aspirations, and the thoughts of poor minds.",
        "source": "T09n0263_003:0082b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　假使得聞，　　于斯佛誨，　不肯發起，　　如來之慧。",
        "translation": "Suppose we were to hear these Buddha's teachings and were unwilling to arouse the Tathāgata's wisdom.",
        "source": "T09n0263_003:0082b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　覩見最勝，　宣暢道誼，　　意中自想，　　盡得滅度，　不願志求，　　如此比慧。",
        "translation": "Seeing the most excellent, proclaiming the friendship of the Way, and thinking to oneself in one's mind that one will be completely liberated, one doesn't wish to pursue such comparative wisdom.",
        "source": "T09n0263_003:0082c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又聞大聖，　諸佛國土，　　未曾有意，　　發歡喜者，　寂然在法，　　一切無漏，　　棄捐所興，　滅度之事。",
        "translation": "I've also heard of great sages and buddha lands that never intend to rejoice, are tranquil in their teachings, are uncontaminated, and abandon what's produced to bring about their extinction.",
        "source": "T09n0263_003:0082c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　由此思想，　　不成佛道，　常當修行，　　晝夜除慢。",
        "translation": "This is the thought that doesn't lead to the Buddha Way, which should always be cultivated, day and night, without conceit.",
        "source": "T09n0263_003:0082c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸佛道誼，　最無有上，　　未曾勸助，　　志存于彼。",
        "translation": "The friendship of the buddha-way is unsurpassed, and I've never been encouraged or helped to focus my resolve there.",
        "source": "T09n0263_003:0082c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今乃究竟，　　具足最勝，　　得無為限，　當捨陰蓋，　　長夜精進，　　修理空誼，　解脫三界，　　勤苦之惱。",
        "translation": "Now that they've reached the ultimate, fully attained the most excellent, and attained the limit of nothingness, they must abandon the hindrances of the aggregates, exert themselves long into the night, cultivate the friendship of emptiness, and liberate themselves from the three realms and the torment of suffering.",
        "source": "T09n0263_003:0082c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛興教戒，　則以具嚴，　　如是計之，　　無所乏少。",
        "translation": "The Buddha gives rise to the teaching and precepts, which are then replete with such splendor that there's nothing lacking.",
        "source": "T09n0263_003:0082c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最勝所演，　　經身之慧，　　假使有人，　願等佛道，　　為是等故，　　加賜法事，　由緣致斯，　　余徒欽樂。",
        "translation": "The most excellent thing he teaches is the wisdom of the scriptures themselves, and if someone wishes to equal the Buddha's path, he bestows Dharma services for such a reason, and the rest of his people admire him for it.",
        "source": "T09n0263_003:0082c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　有大導師，　周旋世間，　　普悉觀察，　　如此輩相。",
        "translation": "There's a great guide who travels around the world and fully observes this group's appearance.",
        "source": "T09n0263_003:0082c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸恐懼者，　　令得利誼，　　求索勸助，　令我信樂。",
        "translation": "He causes those who are fearful to gain friendship, asks for advice, and makes me believe in him.",
        "source": "T09n0263_003:0082c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　善權方便，　　猶若如父，　譬如長者，　　遭時大富。",
        "translation": "His skillful methods are like those of a father, like an elder who becomes very wealthy when he's overcome.",
        "source": "T09n0263_003:0082c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其子而復，　窮劣下極，　　則以財寶，　　而施與之。",
        "translation": "When his son is again poor and downtrodden, he gives him possessions and treasure.",
        "source": "T09n0263_003:0082c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大聖導師，　　所興希有，　　分別宣暢，　善權方便。",
        "translation": "The great sage guide is rare in what he produces, discerns and disseminates it, and does so with skillful expedients.",
        "source": "T09n0263_003:0082c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸子之黨，　　志樂下劣，　修行調定，　　而以法施。",
        "translation": "His party of sons, whose aspirations are low, cultivates training and concentration, and gives alms with the Dharma.",
        "source": "T09n0263_003:0082c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我等今日，　致得百千，　　未曾有法，　　如貧得財。",
        "translation": "Today, we've attained a hundred thousand things that have never been taught before, like a poor person who has gained possessions.",
        "source": "T09n0263_003:0082c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於佛教化，　　獲道得寶，　　第一清淨，　無復諸漏。",
        "translation": "We were taught by the Buddha, attained the treasures of the path, and were the first to be pure, with no more contaminants.",
        "source": "T09n0263_003:0082c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　長夜所習，　　戒禁定意，　執誼將護，　　世雄唱導。",
        "translation": "Long nights of practice, precepts, prohibitions, concentration, and mindfulness are held in high regard, and the heroes of the world sing and guide them.",
        "source": "T09n0263_003:0082c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今日有獲，　佛之大道，　　眷屬圍繞，　　修行無闕。",
        "translation": "Today, I've attained the Buddha's path, surrounded by my retinue, and my practice is without fail.",
        "source": "T09n0263_003:0082c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有長夜，　　清淨梵行，　　依倚法王，　深遠之慧，　　而為具足，　　此尊德果，　日成微妙，　　無有諸漏。",
        "translation": "For a long time, their pure religious practice depended on the king of the Dharma, and their profound wisdom was fully attained, the fruit of this honored one's virtues becoming increasingly subtle and uncontaminated.",
        "source": "T09n0263_003:0082c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我等今日，　乃為聲聞，　　還得聽省，　　上尊佛道，　當復見揚，　　聖覺音聲，　　以故獲聽，　超度恐懼。",
        "translation": "Today, we are now śrāvakas who have been able to hear and reflect on the ways of the most venerable Buddha and will again see and proclaim the voice of the noble enlightenment, so that we can hear it and transcend our fears.",
        "source": "T09n0263_003:0083a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今日乃為，　　致無所著，　以無著誼，　　為諸天說，　　世人魔王，　及與梵天，　　為親一切，　　眾生之類。",
        "translation": "Today, we have become unattached, and with the friendship of being unattached, we've taught the gods, worldlings, Māra kings, and Brahmā gods to be kind to all sentient beings.",
        "source": "T09n0263_003:0083a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何所名色，　　造立寂然，　　蠲除眾生，　無億數劫，　　於是所造，　　甚難得值，　計於世間，　　希有及者。",
        "translation": "What is it that's called form, that's created in quiescence, that's cleansed of sentient beings for billions of eons, that's created, that's difficult to attain, and that's considered rare in the world.",
        "source": "T09n0263_003:0083a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今日無著，　燒罪度岸，　　修行為業，　　踊躍歡喜。",
        "translation": "Today, without attachment, he burns his sins and crosses the river, cultivating his practice as an action, and rises up and rejoices.",
        "source": "T09n0263_003:0083a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　吾等歸聖，　　以頂受之，　　所願具足，　如江河沙。",
        "translation": "We take refuge in the sages, accepting them on our heads, and fulfilling our vows like the sands of a river.",
        "source": "T09n0263_003:0083a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　飲食衣服，　　若干巨億，　諸床臥具，　　離垢無穢，　　用栴檀香，　以為屋室，　　柔軟坐具，　　以敷其上。",
        "translation": "Their food and clothing are numbered among the hundreds of millions, their beds and bedding are spotless and undefiled, their rooms are made of sandalwood, and they are covered with supple sitting cloth.",
        "source": "T09n0263_003:0083a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若疾病者，　　無所藥療，　　今日供養，　安住廣度，　　所施劫數，　　如江河沙，　所造立者，　　無能奪還。",
        "translation": "If someone is ill, there's no medicine for it, so today's offerings are made, they're stably spread out, and the number of eons they bestow is like the sands of a river, and there's nothing they can take back from those they've created.",
        "source": "T09n0263_003:0083a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　高遠之法，　無量無限，　　其大神足，　　建立法力。",
        "translation": "Their lofty teaching is immeasurable and limitless, and their great spiritual abilities establish the power of the Dharma.",
        "source": "T09n0263_003:0083a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛為大王，　　無漏最勝，　　堪任堅強，　常修牢固，　　安慰勸進，　　恒以時節，　未曾修設，　　望想福行。",
        "translation": "The Buddha is a great king, untainted and paramount, capable and resolute, always cultivating and strengthening, comforting and encouraging, always in season and out of season, never before cultivating and hoping for meritorious conduct.",
        "source": "T09n0263_003:0083a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於一切世，　諸法中尊，　　皆為大神，　　最勝如來。",
        "translation": "In all the worlds, he's the most honored of all dharmas, a great deity, and the most excellent tathāgata.",
        "source": "T09n0263_003:0083a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　然大燈明，　　示無央眾，　　知諸黎庶，　筋力所在，　　若干種種，　　所憙樂願，　因緣百千，　　而順開化。",
        "translation": "Still, he is a great lamp that shows measureless multitudes, knows where the tendons of the people are, has various kinds, is fond of vows, and has a hundred thousand causes and conditions to guide and transform them.",
        "source": "T09n0263_003:0083a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如來皆覩，　眾人性行，　　他人心念。",
        "translation": "The Tathāgata sees them all, the humanity of multitudes in action, and the thoughts of others.",
        "source": "T09n0263_003:0083a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切群萌，　以若干法，　　而致墮落。",
        "translation": "All the masses of people are led to fall by certain things.",
        "source": "T09n0263_003:0083a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以法示現，　此尊佛道。」",
        "translation": "By manifesting the Dharma, this honored one attains the Buddha Way.\"",
        "source": "T09n0263_003:0083a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法華經藥草品第五",
        "translation": "Saddharmapuṇḍarīka-sūtra, Medicine and Herbs Chapter 5",
        "source": "T09n0263_003:0083b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告大迦葉及諸耆年聲聞：「善哉！",
        "translation": "It was then that the Bhagavān addressed Mahākāśyapa and the elder śrāvakas, \"Good!",
        "source": "T09n0263_003:0083b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所歎如實。",
        "translation": "\"What's praised is true.",
        "source": "T09n0263_003:0083b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "審如所言，如來之德如向所喻，復倍無數不可思誼，無能計量劫之姟底，一一計數大聖所應，如來之慧無能限者，不有法想道地處所，莫能盡原。",
        "translation": "As it was explained, the Tathāgata's virtues are as they've been described, moreover, they are incalculable and unfathomable, there's no limit to the number of eons that can be measured, no limit to the number of responses from great sages, and the Tathāgata's wisdom has no limit that can't be exhausted without conceptualizing the stages and locations of the path.",
        "source": "T09n0263_003:0083b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊普入一切諸誼，察于世間見眾庶心，所度無極一切分別，皆使決了權慧之事，勸立一切度於彼岸，皆現普智入諸通慧。",
        "translation": "The Bhagavān universally enters all sentient beings, observes the world and sees the hearts of all people, makes all distinctions without limit, makes definitive statements of expedient wisdom, encourages all to cross over to the other shore, and demonstrates universal knowledge and access to the penetrating wisdom of all.",
        "source": "T09n0263_003:0083b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如三千大千世界，其中所有諸藥草木，竹蘆叢林諸樹小大，根本莖節枝葉華實，其色若干種類各異，悉生于地。",
        "translation": "It's like the 3,000 great one-thousand worlds in which all the medicinal plants and trees, the small and large trees of the bamboo and reeds grove, and the roots, stems, joints, branches, leaves, flowers, and fruit of various kinds of color and variety are born on the ground.",
        "source": "T09n0263_003:0083b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在高山巖石之間，丘陵堆阜嵠谷坑坎。",
        "translation": "If they're high on a mountain or between a rock or a hill, there's a pile of hills, a valley, or a pond.",
        "source": "T09n0263_003:0083b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大澍雨潤澤普洽，隨其種類各各茂盛，叵我低仰莫不得所，雨水一品周遍佛土，各各生長地等無二。",
        "translation": "When there's a great rain that moistens and spreads, each type flourishes according to its own, and nothing low or high can reach its place, the rainwater in one category spreads throughout the Buddha's land, and each grows on the same ground without distinction.",
        "source": "T09n0263_003:0083b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來正覺講說深法，猶如大雨。",
        "translation": "The Tathāgata, the right enlightened one, teaches the profound Dharma just like a great rain.",
        "source": "T09n0263_003:0083b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖出現興在世者，則為一切諸天、人民、阿須倫、鬼神、龍，顯示威曜咸尋來至，皆現在前，為暢大音分別慧誼，大師子吼班宣景模：『吾為如來使，天上天下諸天世人，未度者度，未脫者脫，未安者安，未滅度者令得滅度。",
        "translation": "When great sages appear and arise in the world, they are all the gods, people, asuras, ghosts, spirits, and dragons who appear before them in order to convey the great voice, discernment, and wisdom, and the great teacher Sons roar and proclaim, \"I am the Tathāgata's messenger to all the gods and humans in heaven and on earth, and I will save those who have yet to be saved, liberate those who have yet to be freed, pacify those who have yet to be made secure, and cause those who have yet to be saved to be saved.",
        "source": "T09n0263_003:0083b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世及後世所知而審，為諸通慧皆能普見，度諸度，脫諸脫，安諸安，未滅度者皆令滅度，悉來詣我。』",
        "translation": "In this world and the generations to come, I will examine what's known and make it possible for all penetrating wisdom to see it universally, save those who have been saved, liberate those who have been freed, make those who are at peace, and cause those who have yet to be saved to be saved, and all come to me.'",
        "source": "T09n0263_003:0083b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時諸天、人民、阿須倫、揵沓和、迦留羅、真陀羅、摩睺勒一切雲集，吾於講法現其道誼，佛為道父分別道慧。」",
        "translation": "At the time, gods, people, asuras, gandharvas, garuḍas, maṇḍalas, and mahoras all gathered in great numbers, and I was teaching the Dharma and showing their friendship on the path, and the Buddha was the father of the path, discerning the wisdom of the path.\"",
        "source": "T09n0263_003:0083b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語迦葉：「于時黎庶無數億姟，皆來聽經，如來通見一切根本，大精進力如應說法，分別散告無量言教，不失本心咸令歡喜，安隱無患或得度世，終生善處恣其所好，各自然生。",
        "translation": "The Buddha said to Kāśyapa, \"At the time, countless millions of the masses of people came to listen to the sūtras, and the Tathāgata, who sees all the fundamentals with great energy, delivered the Dharma as it should be taught, discerned and disseminated measureless words and teachings, didn't lose their original minds, and made them all rejoice, be secure and without danger, or attain deliverance from the world, and end up in a good place where they can enjoy their own preferences and be born naturally.",
        "source": "T09n0263_003:0083b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或習愛欲便為說經，或聽受法離諸貪惑，轉稍以漸遵諸通慧，因從本力如其能量，堅固成就平等法身，猶如大雨，普佛世界滋育養生，等無差特。",
        "translation": "Sometimes they cultivate craving and then explain the sūtras for them, or they hear and accept the teaching, become free of the craving and confusion, gradually comply with the penetrating wisdom, and because of their original power and according to their energy, they firmly achieve an equal Dharma body like a great rain that nourishes sentient beings throughout the Buddha's world without distinction.",
        "source": "T09n0263_003:0083c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來演法一品如是，至解脫味離欲寂滅，入諸通慧，若聽受持諷誦奉者，不自識省無所觀念。",
        "translation": "Thus, when the Tathāgata teaches a single chapter of the Dharma, up to the taste of liberation, he parts with desire and tranquility and enters into the penetrating wisdom.",
        "source": "T09n0263_003:0083c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_003:0083c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群生根本形所像類，如所想念，已念當念所可施行，以行當行所當行者，諸所因緣，所當獲致所當說者，唯如來目悉知見之。",
        "translation": "\"Regarding the fundamental forms and forms of living beings, the Tathāgata's eyes alone fully know and see them as they are conceived, as they are mindful of what can be done when they're mindful, as they're practiced and as they're practiced, and as their causes and conditions are obtained and as they're explained.",
        "source": "T09n0263_003:0083c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在所現處住于其地，如雨等潤藥草叢林、白黑青赤上中下樹，世尊如之見一味已，入解脫味志于滅度，度諸未度究竟滅度，令至一土一同法味，到無恐懼使得解脫。",
        "translation": "Abiding in a forest of medicinal plants like rain and soap, a grove of white, black, blue, and red trees, the Bhagavān thus sees a taste, enters into the taste of liberation, aims for complete extinction, liberates those who haven't yet been liberated, and brings them to a land with the same taste of the Dharma, arriving without fear and making them liberated.",
        "source": "T09n0263_003:0083c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化於眾生使得信樂，苞育將護悉令普至於諸通慧，讚詠分別逮賢聖法，亦如向者迦葉所說。」",
        "translation": "He teaches sentient beings to be faithful, nurtures and protects them all to the fullest extent of their penetrating wisdom, and praises the noble teaching that discriminates and acquires the goodness of the noble ones, just as he had taught Kāśyapa before.\"",
        "source": "T09n0263_003:0083c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊欲重解誼所趣，以偈頌曰：「吾興於世間，　　仁和為法王，　為眾生說法，　　隨其所信樂。",
        "translation": "Desiring to reintroduce the meaning of understanding, the Bhagavān spoke in verse, \"I rose in the world, benevolently became the king of the Dharma, taught sentient beings according to their faith.",
        "source": "T09n0263_003:0083c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　意勇建大業，　　久立分別說，　群萌多受持，　　蒸庶無所言。",
        "translation": "With courageous intent, I've built a great business, established a long-standing discourse, and many sentient beings have accepted it, so there's nothing that people say.",
        "source": "T09n0263_003:0083c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法王慧難解，　　闇冥設聞者，　眾入懷狐疑，　　則棄所住處。",
        "translation": "The wisdom of the king of the Dharma is difficult to understand, and those who hear it in the darkness enter with misgivings, then abandon their dwelling place.",
        "source": "T09n0263_003:0083c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨其境界說，　　如本力所任，　又示餘利誼，　　則為現正法。",
        "translation": "Teaching according to their objective realm, just as their original power allows, and showing them other benefits, then he's presenting the right teaching.",
        "source": "T09n0263_003:0083c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如純黑雲，　　踊出升虛空，　普雨佛世界，　　遍覆於土地，　又放大電[火*僉]，　　周匝有水氣，　而復震雷聲，　　人民皆歡喜。",
        "translation": "It's like a pure black cloud that rises up into the sky, raining down on the Buddha's world and covering the land, magnifying bolts of lightning [fire*cupboard], surrounding bodies of water, and shaking thunderbolts, making the people rejoice.",
        "source": "T09n0263_003:0083c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　陰蔽於日月，　　除熱令陰涼，　欲放雨水故，　　時布現在上。",
        "translation": "The shadows cover the sun and moon, remove heat, and make the shadows cool, so they want to release rainwater, which is then spread above them.",
        "source": "T09n0263_003:0083c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼時普等雨，　　水下無偏黨，　滂流於佛土，　　澤洽眾塸域。",
        "translation": "It then rains universally, with no partiality below the surface, pouring down on the Buddha's land and swamping many of his regions.",
        "source": "T09n0263_003:0084a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應時而降雨，　　激灌一切地，　旱涸枯谿澗，　　一切得浸漬。",
        "translation": "In response to the occasion, the rain falls, agitating all lands, and dried-up valleys and streams are all wet and drenched.",
        "source": "T09n0263_003:0084a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惠澤無不到，　　眾源皆涌溢，　深谷諸廣野，　　林麓槒幽藪，　萌葉用青倉，　　藥草無數生，　樛木諸叢林，　　滋長大小樹，　眾藥咸茂殖，　　莖幹華實繁，　隨其本境界，　　皆令得蒙恩。",
        "translation": "Without fail, the blessings overflow from numerous sources, from the deep valleys and vast fields to the wooded and remote valleys, where leaves sprout from a verdant barn and medicinal plants grow without number, from the woods and groves that sag, where large and small trees grow, from which all medicines flourish and stems multiply in flower and substance, all are made to receive blessings according to their original realms.",
        "source": "T09n0263_003:0084a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天樹木，　　結根坑坎，　　陜隘迮處，　而生其中。",
        "translation": "The trees of the gods have their roots in pits and hills, and they grow up in places that are narrow and confined.",
        "source": "T09n0263_003:0084a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如諸邪道，　　一切愚癡，　長益繫縛，　　如象著絆，　　草刺棘樹，　蘆葦[禾*曷][禾*曷]，　　莖節枝葉，　　及諸華實。",
        "translation": "Like wrongdoers and all foolish people, they are bound for ever like an elephant caught in a stumbling block, a thorny grass tree, a reed [grain*hope] [grain*hope], stems, knots, branches, leaves, and flowers and fruits.",
        "source": "T09n0263_003:0084a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　華實茂盛，　　多所饒益，　　蒙之恩雨，　藥草滋長，　　從其種類，　　因本境界，　各各得服，　　饑渴飽滿。",
        "translation": "The flowers and fruits flourish and are often beneficial, and thanks to the blessing of rain, herbs and medicines grow from their types and from their original realms, each is fed, and hunger and thirst are satisfied.",
        "source": "T09n0263_003:0084a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如其所種，　各得其類，　　然其天雨，　　皆為一味。",
        "translation": "Each type is obtained just as it is planted, yet the rain from heaven is of the same flavor.",
        "source": "T09n0263_003:0084a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　告迦葉曰，　　佛亦如是，　　出興於世，　譬如天雨。",
        "translation": "He told Kāśyapa, \"So it is with the Buddha, who appears in the world like rain from the gods.",
        "source": "T09n0263_003:0084a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　這現天下，　　為眾說法，　以是誠行，　　示於眾生。",
        "translation": "He appeared under the heavens, taught the Dharma for all, and showed it to sentient beings with this sincere practice.",
        "source": "T09n0263_003:0084a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大仙以斯，　使人聞經，　　皆於諸天，　　人民前現。",
        "translation": "Thus, the great sage causes people to hear the sūtras, and they all appear before the gods and the people.",
        "source": "T09n0263_003:0084a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛為如來，　　聖中之尊，　　善權方便，　猶如天雨，　　吾當飽滿，　　一切群萌，　愚騃之黨，　　身形枯燥，　　除諸苦患，　得立大安，　　燒盡愛欲，　　獲至滅度。",
        "translation": "The Buddha is the Tathāgata, the most noble of sages, who skillfully administers skillful means like rain from the sky that will fill up all the sentient beings, foolish bands, and dull bodies, remove suffering and distress, establish great peace, burn up cravings, and bring about complete cessation.",
        "source": "T09n0263_003:0084a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天人民，　　皆聽我言，　　普悉當來，　詣佛大聖。",
        "translation": "All the gods and people will listen to my words, and they'll all come to the Buddha, the great sage, in the future.",
        "source": "T09n0263_003:0084a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　吾為如來，　　世尊無倫，　有所導御，　　故出於世，　　為一切人，　分別說經，　　化無數千，　　眾生之類。",
        "translation": "I am the Tathāgata, the unparalleled world-honored one who has a guide and therefore comes into the world, discerns sūtras for all people, and transforms measureless thousands of sentient beings into various types of beings.",
        "source": "T09n0263_003:0084a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復示現，　　若干種誼，　　於彼若此，　常行平等，　　得至解脫，　　滅度無為。",
        "translation": "We also show that there are various kinds of meanings, both here and there, that are always practiced equally, that lead to liberation, and that lead to cessation and non-action.",
        "source": "T09n0263_003:0084b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或在門前，　　而說經典，　　則為造立，　道德之藏，　　諸等不等，　　皆令平等，　無有所憎，　　愛欲永除。",
        "translation": "When he teaches a scripture at the entrance, it creates a store of virtue, equal and unequal, and makes them all equal, so that there's nothing to hate and desires are permanently removed.",
        "source": "T09n0263_003:0084b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　未曾講說，　無益之語，　　未常增惟，　　諸放逸緣。",
        "translation": "Words that haven't been taught before are useless, and they don't always reinforce the causes of dissipation.",
        "source": "T09n0263_003:0084b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以一切法，　　為眾生說，　　假使眾庶，　多不可計，　　為講大典，　　不詭因緣，　行步所由，　　若復住立，　　在於座上，　而續三昧。",
        "translation": "He explains all things to sentient beings, assuming there are an incalculable number of people, preaches a great scripture, doesn't deceive about causes and conditions, walks around by means of it, remains standing, remains on his seat, and continues in samādhi.",
        "source": "T09n0263_003:0084b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　譬如大龍，　　雨多所潤，　普浸潤斯，　　一切世間。",
        "translation": "It's like a great dragon that's nourished by much rain and thoroughly saturates the whole world.",
        "source": "T09n0263_003:0084b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　尋興慧雲，　而降法雨，　　暢發微妙，　　應病與藥。",
        "translation": "He rises a cloud of wisdom and sends down a rain of the Dharma, universally generating subtleties that respond to illness and medicine.",
        "source": "T09n0263_003:0084b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常為眾生，　　說賢聖誼，　　皆令奉戒，　如天陰涼。",
        "translation": "He always explains the meaning of goodness and holiness to sentient beings and causes them to observe precepts, just like the cool shade of the sky.",
        "source": "T09n0263_003:0084b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾人失言，　　及違諸行，　欲使近法，　　轉漸調柔。",
        "translation": "When people miss their words and disregard their actions, they want to be brought closer to the Dharma and gradually pacify it.",
        "source": "T09n0263_003:0084b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　使住疑者，　捨諸邪見，　　勸化導利，　　令淨所覩。",
        "translation": "They cause those who abide in doubt to abandon wrong views, and they encourage, guide, and benefit them, making them pure in their views.",
        "source": "T09n0263_003:0084b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨置下劣，　　遠眾懈廢，　　隨其所趣，　而令入法。",
        "translation": "Setting aside the inferior, they distance themselves from the lazy, follow their destinies, and cause them to enter the Dharma.",
        "source": "T09n0263_003:0084b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　應時為說，　　如其心本，　令皆棄捐，　　順師子行。",
        "translation": "He teaches them at the appropriate time, according to the origin of their minds, causing them all to abandon and conform to the practices of the teacher.",
        "source": "T09n0263_003:0084b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世尊等演，　經法之雨，　　悉使得至，　　大尊佛道，　任其力耐，　　而令聽受，　　若干道慧，　而化立之。",
        "translation": "The Bhagavān and others make it rain down sūtras and teachings, bringing them all to the great honored Buddha Way, allowing their strength and patience to be heard and accepted, and certain paths and wisdom to be established.",
        "source": "T09n0263_003:0084b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　從諸天人，　　志性所樂，　天帝釋梵，　　轉輪聖王，　　猶如於此，　諸小世間，　　諸藥品類，　　各各異種，　碎小段段，　　諸所良藥。",
        "translation": "From gods and humans, whose aspirations are based on their nature, gods, Indra, Brahmā, and the wheel-turning sage king are like these small worlds, where there are different kinds of medicines, small pieces, and good medicines.",
        "source": "T09n0263_003:0084b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　迦葉且聽，　吾悉當說，　　以能識慧，　　無漏之法，　便得無為，　　所在遊行，　　神通三達，　亦復如是。",
        "translation": "Listen, Kāśyapa, I will explain it all, for it's the wisdom of being able to know, the untainted Dharma that attains nothingness, where one travels, and the three supernormal powers that are attained, are likewise.",
        "source": "T09n0263_003:0084b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　斯雨定意，　　三昧諸藥，　或有遊詣，　　在於山巖，　　其人便得，　緣一覺乘，　　於彼修禪，　　清淨之行，　是則名曰，　　為中品藥。",
        "translation": "When someone wanders up a mountain or a cliff, they attain, depending on the vehicle of the One Awakening, the cultivation of meditation there, and pure practice, which is called the middle grade medicine.",
        "source": "T09n0263_003:0084c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　假使志願，　上士美德，　　我當於世，　　逮成導師，　常精進行，　　志依一心，　　是則名曰，　為上尊藥。",
        "translation": "Suppose someone aspires to the virtues of a great man, and I were to become a guide in the world, always exerting myself and focusing my attention on single-mindedness, then this would be called the supreme medicine.",
        "source": "T09n0263_003:0084c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　設使欲為，　　安住之子，　恃怙慈心，　　而行寂然，　　疾得成道，　為人中尊，　　所謂樹者，　　則喻於斯。",
        "translation": "Suppose someone wants to be a well-established son who relies on kindness and conducts himself with tranquility, quickly achieves the path, and becomes honored among men; this is what's called a tree.",
        "source": "T09n0263_003:0084c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是等能轉，　　不退轉輪，　　建立神足，　根力之行，　　緣是長養，　　醫藥除病，　英雄度脫，　　無數億人，　　隨時示現，　於斯佛道，　　是則名曰，　　為大林樹。",
        "translation": "Such a person turns the irreversible wheel, establishes miraculous abilities, practices with faculties, nurtures, heals, removes illnesses, liberates, and heroes countless millions of people, and shows up at appropriate times, and in this way the Buddha path is called a great forest tree.",
        "source": "T09n0263_003:0084c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　吾之所順，　　善權方便，　　一切大聖，　亦復如是。",
        "translation": "That's what I follow, skillfully authorizing skillful means, and so are all the great sages.",
        "source": "T09n0263_003:0084c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　最勝講法，　　則為平等，　猶如慶雲，　　普一放雨。",
        "translation": "When the most excellent teaching is given, it's equal, like a joyful cloud that universally releases rain.",
        "source": "T09n0263_003:0084c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　神通無礙，　如此比像，　　若如眾藥，　　在於地上。",
        "translation": "His supernormal powers are unimpeded, and such a similitude is like the many medicines that are on the ground.",
        "source": "T09n0263_003:0084c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以見如是，　　微妙之誼，　　如來所建，　善權方便。",
        "translation": "To see such a subtle friendship, the Tathāgata establishes it with skillful authority and skillful means.",
        "source": "T09n0263_003:0084c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　假使分別，　　一善法事，　亦如天雨，　　至若干形。",
        "translation": "Suppose he discerns a single good deed of the Dharma, which is like rain from the sky, up to several forms.",
        "source": "T09n0263_003:0084c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛以法雨，　多所安隱，　　普潤天下，　　有所成就。",
        "translation": "With that rain of the Dharma, the Buddha makes it abundantly stable, pervading the whole world with its accomplishments.",
        "source": "T09n0263_003:0084c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀察其人，　　堪任所趣，　　佛之法誨，　景則一等。",
        "translation": "When you examine a person's ability to meet their destiny, the Buddha's teaching of the Dharma is an excellent view.",
        "source": "T09n0263_003:0084c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　譬如放雨，　　墮草山巖，　及至中間，　　無有不遍，　　灌諸樹木，　若大叢林，　　密雲四集，　　天下豐羨。",
        "translation": "It's like releasing rain that falls on grassy mountains and cliffs, reaches the middle, is not impermeable, and irrigates trees like a great grove, where dense clouds gather in four places and the whole world envies them.",
        "source": "T09n0263_003:0084c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設使世間，　　行慈愍法，　　常以經典，　飽滿天下。",
        "translation": "Suppose the world practices the teaching of compassion and always fills the world with sūtras.",
        "source": "T09n0263_003:0084c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以現世間，　　令普安隱，　天雨藥草，　　華實茂盛，　　其藥樹木，　稍漸長大，　　是為羅漢，　　諸漏盡者。",
        "translation": "By manifesting in the world and making it universally peaceful, the gods rain down medicinal plants that are abundant in flowers and fruits, and their medicinal trees gradually grow large, which are arhats and those whose contaminants have ended.",
        "source": "T09n0263_003:0084c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸緣覺品，　　處于林藪，　　我所說法，　無有塵垢。",
        "translation": "The classes of pratyekabuddhas live in a forested area, and my teaching is spotless.",
        "source": "T09n0263_003:0085a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無數菩薩，　　志開總智，　周旋三界，　　一切普行，　　於眾會中，　演此大道，　　猶如樹木，　　日日滋長。",
        "translation": "Countless bodhisattvas, whose aspirations open up their general knowledge, circulate throughout the three realms, and conduct all activities universally, performing this path in numerous assemblies like a tree that grows day by day.",
        "source": "T09n0263_003:0085a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修進神足，　　專達四禪，　　若聞空慧，　心則解達。",
        "translation": "They cultivate their spiritual abilities, specialize in the four meditation [heavens], and if they hear the wisdom of emptiness, their mind then comprehends it.",
        "source": "T09n0263_003:0085a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　放出光明，　　無數億千，　是為大樹，　　而復滋茂。",
        "translation": "Emitting hundreds of millions of rays of light, this is a great tree that prospers day by day.",
        "source": "T09n0263_003:0085a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若諸聲聞，　不至滅度，　　斯為世尊，　　第一最說。",
        "translation": "If śrāvakas don't reach extinction, this is the Bhagavān's greatest and most eloquent teaching.",
        "source": "T09n0263_003:0085a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若此分別，　　乃為講法，　　猶如興雲，　而澍甘雨，　　漸漸長育，　　眾藥草木，　人民之華，　　不可稱量。",
        "translation": "If this discernment is made, then this is the teaching that's like a cloud that arises and rains sweet rain that gradually grows and nurtures medicine, plants, and flowers for people that are incalculable.",
        "source": "T09n0263_003:0085a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一時之間，　說因緣法，　　而為眾人，　　現於佛道。",
        "translation": "In a moment's time, he explains the law of causes and conditions, and for all people, he presents them with the Buddha Way.",
        "source": "T09n0263_003:0085a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善權方便，　　佛謂言教，　　一切導師，　亦復如是。",
        "translation": "Skillful in expedient devices, these are called the words and teachings of the Buddha, and so are all instructors.",
        "source": "T09n0263_003:0085a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　斯諸說法，　　為最究暢，　諸聲聞等，　　皆當承是。",
        "translation": "These teachings are the most thorough, and they should be followed by śrāvakas and so forth.",
        "source": "T09n0263_003:0085a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　緣斯之行，　當得佛行，　　此諸羅漢，　　如是無異。",
        "translation": "Based on this practice, they'll attain the Buddha's practice, and these arhats are no different than this.",
        "source": "T09n0263_003:0085a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊演誼，　　盡極於斯，　　化諸小乘，　皆得佛道。」",
        "translation": "The Bhagavān's explanation of his meaning is so thorough that it will teach the lesser vehicle and lead them all to the Buddha Way.\"",
        "source": "T09n0263_003:0085a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告大迦葉：「如來所教等化無偏，譬如日明廣照天下，光無所擇照與不照，高下深淺好惡香臭，等無差特。",
        "translation": "Again, the Buddha told Mahākāśyapa, \"The Tathāgata's teaching is equal and unbiased, like the brightness of the sun shining broadly under the heavens, with no discriminating light that shines or doesn't shine, and no distinctions between high and low, depth and shallow, good and bad smells, and so forth.",
        "source": "T09n0263_003:0085a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦如是，以智慧光普照一切，五道生死、菩薩、緣覺、聲聞，慧無增減，隨心所解各得其所，本無三乘緣行致之。」",
        "translation": "Thus, the Buddha also universally illuminates all with the light of wisdom, so that the five destinies of birth and death, bodhisattvas, pratyekbuddhas, and śrāvakas have no increase or decrease in wisdom, and each attains his or her own understanding according to his or her mind; there are originally no three vehicles to which conditioned practices lead.\"",
        "source": "T09n0263_003:0085a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛：「設無三乘，何故得有菩薩、緣覺、聲聞？」",
        "translation": "Kāśyapa said to the Buddha, \"If there are no three vehicles, then how could there be bodhisattvas, pratyekbuddhas, and śrāvakas?\"",
        "source": "T09n0263_003:0085a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「譬如陶家埏埴作器，或盛甘露蜜，或盛酪蘇麻油，或盛醲飲食，泥本一等，作器別異所受不同。",
        "translation": "The Buddha said, \"Suppose a potter makes a vessel with clay, which may contain nectar, butter, sesame oil, or concentrated food and drink, and the clay is originally one of a kind, but the vessels are made differently and the reception is different.",
        "source": "T09n0263_003:0085a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本際亦爾，一等無異，各隨所行成上中下。」",
        "translation": "So it is in the past, first-class and not different, and each follows what it does to become superior, middling, and inferior.\"",
        "source": "T09n0263_003:0085a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉又問：「縱使別異，究竟合不？」",
        "translation": "Kāśyapa also asked, \"Even though they may be different, are they really compatible?\"",
        "source": "T09n0263_003:0085a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告曰：「當合明者解之，譬若有人從生而盲，不見日月、五色、十方，則謂天下無日月、五色、八方上下。",
        "translation": "He told them, \"You should explain it together with a learned person. It's like a person who's blind from birth and doesn't see the sun and moon, the five colors, or the ten directions, and then they say the world has no sun and moon, five colors, or eight directions up and down.",
        "source": "T09n0263_003:0085a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有對說者，其人不信。",
        "translation": "Anyone who says otherwise won't believe it.",
        "source": "T09n0263_003:0085b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有良醫觀人本病，何故無目？",
        "translation": "If there's a good doctor who observes a person's original illness, why doesn't he have eyes?",
        "source": "T09n0263_003:0085b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本罪所種，離明眼冥體癭重病。",
        "translation": "As a result of this sin, he's seriously ill when he parts with the clear eye and the dark body.",
        "source": "T09n0263_003:0085b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂重病？",
        "translation": "What's meant by a serious illness?",
        "source": "T09n0263_003:0085b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風寒熱癖是則四病。",
        "translation": "These are the four illnesses of wind, cold, heat, and addiction.",
        "source": "T09n0263_003:0085b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便心念言：『斯人之疾，凡藥療之終不能愈。",
        "translation": "He then mentally said, 'These are people whose illnesses can't be cured by ordinary medicine.",
        "source": "T09n0263_003:0085b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雪山有藥能療四病：一曰顯，二曰良，三曰明，四曰安，是藥四名。』",
        "translation": "There are medicines on Mount Snow that can treat four illnesses: one is manifest, two are good, three are clear, and four are peaceful; these are the four names of medicine.'",
        "source": "T09n0263_003:0085b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時良醫愍傷病人，為設方便即入雪山，採四品藥[口*父]咀搗合，以療其盲，目便見明。",
        "translation": "The good doctor then took pity on the patient and went into the Himâlayas to pound together four kinds of medicine for his blindness, and his eyes were then enlightened.",
        "source": "T09n0263_003:0085b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又加針灸消息補寫，斯人目睛內外通徹，覩日月光、五色、十方，爾乃取信。",
        "translation": "With the addition of acupuncture and moxibustion, he was able to penetrate his eyes inside and out and see the sun, moon, five colors, and ten directions, and then he gained faith.",
        "source": "T09n0263_003:0085b09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋自剋責：『我之盲冥，無所見聞，自以為達。",
        "translation": "He then took it upon himself to criticize him, saying, \"I was blind and in the dark, and I didn't see or hear anything, but I thought I'd gotten it.",
        "source": "T09n0263_003:0085b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今眼得視，乃自知本愚蔽之甚也。",
        "translation": "Now that my eyes can see, I realize how deeply I've been hindered.",
        "source": "T09n0263_003:0085b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今覩遠近高下，無喻我者。』",
        "translation": "Now, I see nothing near or far, high or low, that refers to me.'",
        "source": "T09n0263_003:0085b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有五通閑居仙人，洞視徹聽身能飛行，心能知人所念，自知所從來生死本末，而具語曰：『卿莫矜高自以為達，仁在屋裏自閉不出，不知外事。",
        "translation": "Then there was a sage of the five supernormal powers who lived in seclusion, saw and heard deeply, could fly with his body, knew what people were thinking with his mind, and knew the beginning and end of birth-and-death since then, and he said, 'Don't be so proud of yourself that you think you've attained it, for you're inside your house, shut up, and don't know outside things.",
        "source": "T09n0263_003:0085b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人念卿善惡尚不能見；十里五里語言之音、或二十里擊鼓之音聲，猶不能聞；近一二里，自不躇步亦不能至；自觀未生胚胎所憶，亦不能識。",
        "translation": "You can't even see the thoughts of people about your goodness or evil; you still can't hear the sounds of words spoken 10 miles or 5 miles away, or the sound of a drum beating 20 miles away; you can't even reach them without taking a step closer than 1 or 2 miles; and you can't even recognize what you remember when you look at an embryo that hasn't yet been born.",
        "source": "T09n0263_003:0085b17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何通達稱無不見乎？",
        "translation": "What kind of penetration is there that claims there's nothing to see?",
        "source": "T09n0263_003:0085b20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今吾察卿身，冥中為明，明中為冥。』",
        "translation": "Now, I've examined your body, and I've found that light is in the darkness and darkness is in the light.'",
        "source": "T09n0263_003:0085b20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人問曰：『作何方術得斯聖通？",
        "translation": "The man asked, 'What technique did you use to attain this noble ability?'",
        "source": "T09n0263_003:0085b21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂慧誨。』",
        "translation": "May I ask for your wise guidance.'",
        "source": "T09n0263_003:0085b22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人答曰：『當入深山閑居獨處，除諸情欲爾乃有獲。』",
        "translation": "The recluse replied, 'You should go deep into the mountains and live alone, ridding yourself of all passions and desires, and then you'll attain them.'",
        "source": "T09n0263_003:0085b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即遵所訓捨家巖燕，一心專精無所慕樂，則得神通。",
        "translation": "He then complied with the instruction, left his home in a cave, and focused his mind without any longing, and then he attained supernormal powers.",
        "source": "T09n0263_003:0085b23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾乃自覺，察本所見不足言名，今得五通無所罣礙，甫自知本所見蔽闇。」",
        "translation": "Then he realized for himself that examining what he had originally seen was beyond words, and now that he has attained the five powers and has nothing to obstruct him, he now knows for himself the darkness of what he had originally seen.\"",
        "source": "T09n0263_003:0085b25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是當解此喻，人在生死五道陰蓋，不了本無則名曰癡。",
        "translation": "The Buddha said, \"Thus, you should understand this metaphor: 'When a person is in the five aggregates of birth-and-death and doesn't understand that they're originally nonexistent, it's called delusion.",
        "source": "T09n0263_003:0085b26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從癡致行，從行致識，從識致名色，從名色致六入，從六入致更，從更致痛，從痛致愛，從愛致受，從受致有，從有致生，從生致老病死憂惱苦患，罪應集會故謂盲冥。",
        "translation": "From delusion comes action, from action comes consciousness, from consciousness comes name-and-form, from name-and-form comes the six sense-fields, from the six sense-fields comes more, from more comes pain, from pain comes love, from love comes feeling, from feeling comes existence, from existence comes birth, and from birth comes the grief, pain, and suffering of old age, illness, and death, which are the result of the confluence of sins and are therefore called blindness and ignorance.",
        "source": "T09n0263_003:0085b28_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是以世尊愍傷其人，升降三界輪轉無際，不能自拔。",
        "translation": "The Bhagavān therefore pities these people, who rise and fall through the three realms of transmigration without limit and can't extricate themselves.",
        "source": "T09n0263_003:0085c02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀於眾生心之根原，病有輕重，垢有厚薄，解有難易，覩見遠近，便見三乘，發菩薩心，至不退轉，無所從生徑得至佛，猶如有目得為神仙。",
        "translation": "He observes the origin of sentient beings' minds, the severity of their illnesses, the thickness of their defilements, the difficulty of their understanding, the distance between their vision and that of the three vehicles, arouses the bodhisattva aspiration, reaches irreversibility, and attains Buddhahood without taking birth, just as if they had eyes and could become sages.",
        "source": "T09n0263_003:0085c04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其良醫者，謂如來也。",
        "translation": "That good doctor is the Tathāgata.",
        "source": "T09n0263_003:0085c07_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不發大意，謂生盲也。",
        "translation": "Someone who doesn't give rise to the great intention is said to be blinded by birth.",
        "source": "T09n0263_003:0085c07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪、婬、瞋恚、愚癡六十二見，謂四病也。",
        "translation": "The sixty-two views of greed, lust, anger, and folly are called the four illnesses.",
        "source": "T09n0263_003:0085c08_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無想、無願、向泥洹門，謂四藥也。",
        "translation": "Emptiness, absence of perception, absence of wish, and going through the gate of nirvāṇa are called the four medicines.",
        "source": "T09n0263_003:0085c09_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥行病愈則無有癡，名色六入所更痛愛，受有生老病死憂惱苦患，皆悉除矣。",
        "translation": "When the practice of these medicines heals the disease, there's no delusion, the six sense-fields of name-and-form that are more painful and appealing, and the grief, worry, distress, and suffering of birth, age, sickness, and death that are experienced are all removed.",
        "source": "T09n0263_003:0085c09_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "志不作善亦不在惡，如生盲者還得兩目，謂聲聞、緣覺生死已斷，度於三界省練五道，自以通暢莫能喻者。",
        "translation": "When he sets his mind to neither doing good nor evil, he's like a blind man who has regained his two eyes, which means that the births and deaths of śrāvakas and pratyekbuddhas have been stopped, and he's crossed over to the three realms, trained in the five paths, and made himself comfortable with what can't be described.",
        "source": "T09n0263_003:0085c11_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨欲滅度佛在前住，誨以要法發菩薩意，不在生死不住滅度，解三界空，十方一切如化如幻，如夢、野馬、深山之響，悉無所有無所希望，無取無捨無冥無明，爾乃深覩，無所不達見無所見，見知一切黎庶萌兆。」",
        "translation": "When the Buddha abides before them just before they want to achieve extinction, he teaches them the essentials to arouse the bodhisattva's aspiration, not to abide in birth-and-death but to achieve extinction, to understand the emptiness of the three realms, to understand everything in the ten directions as it transforms and is illusory, like a dream, a wild horse, or the sound of a deep mountain, all without possession or hope, without grasping or equanimity, without obscurity or ignorance, and then to deeply perceive it, to see nothing that isn't reached and nothing that is seen, and to see the signs that are sprouting in all the people.\"",
        "source": "T09n0263_003:0085c14_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是頌曰：「譬如日光曜，　　遍照於天下，　其明無增減，　　亦不擇好醜。",
        "translation": "He then spoke this verse, \"It's like a ray of sunlight that shines everywhere, whose light neither increases nor decreases, and which doesn't discriminate between good and evil.",
        "source": "T09n0263_003:0085c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來猶若茲，　　慧等殊日月，　普化於十方，　　亦不有增減。",
        "translation": "The Tathāgata is like this, a sun and moon of equal wisdom that universally transforms the ten directions without increase or decrease.",
        "source": "T09n0263_003:0085c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若如彼陶家，　　埏埴作瓦器，　或盛甘露蜜，　　或受蘇油食，　計泥本一等，　　為器各別異，　所受又不同，　　因盛而立名。",
        "translation": "Suppose there's a potter who mixes clay to make a tile vessel, either to contain nectar or to accept oil as food. Suppose the clay itself is first-rate, and the vessels are made separately, the acceptances are different, and the names are established because of their strength.",
        "source": "T09n0263_003:0085c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人本亦如是，　　無三界五道，　隨行而隨生，　　展轉不自覺。",
        "translation": "Originally, humans are likewise, lacking the three realms and five paths, they are born following their actions and develop without realizing it for themselves.",
        "source": "T09n0263_003:0085c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　解空號菩薩，　　中住則緣覺，　倚空不解慧，　　則名為聲聞。",
        "translation": "He's called a bodhisattva who understands emptiness, a pratyekabuddha who abides in the middle, and a śrāvaka who relies on emptiness but doesn't understand wisdom.",
        "source": "T09n0263_003:0086a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如人生盲，　　不見日月光，　五色及十方，　　謂天下無此。",
        "translation": "It's like a person who's blind and doesn't see the light of the sun and moon, or who doesn't see the five colors and ten directions, which are said to be absent from the world.",
        "source": "T09n0263_003:0086a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　良醫探本端，　　見四病陰蓋，　慈哀憐愍之，　　入山為求藥。",
        "translation": "A good doctor probes his source, sees the four hindrances of illness, has compassion for them, and goes into the mountains to search for medicine.",
        "source": "T09n0263_003:0086a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所採藥奇妙，　　名顯良明安，　[口*父]咀而搗合，　　以療生盲者，　消息加針灸，　　病愈目覩明，　見日月五色，　　乃知本淳愚。",
        "translation": "The medicine he gathered was wonderful, named Liangming'an, [mouth*father] chewed it and pounded it together to treat those who were blind, teaching them how to apply acupuncture, and when their illnesses healed, their eyes saw light, and they saw the five colors of the sun and moon, then they realized they were simple fools.",
        "source": "T09n0263_003:0086a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人不了無本，　　坐墮生死徑，　十二緣所縛，　　不解終始病，　世尊現於世，　　觀察三界原，　因疾而隨本，　　各各開化之。",
        "translation": "When a person doesn't know the root, they sit there and fall into the path of birth and death, are bound by twelve conditions, and don't understand the disease of the beginning, The Bhagavān appears in the world, observes the origin of the three realms, follows the root of illness, and enlightens each one.",
        "source": "T09n0263_003:0086a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　了空則菩薩，　　意劣為緣覺，　畏厭生死苦，　　故墜于聲聞。",
        "translation": "The bodhisattva who has understood emptiness then has a poor mind as a pratyekabuddha, is afraid of the suffering of birth-and-death, and therefore falls into the category of śrāvaka.",
        "source": "T09n0263_003:0086a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自謂道德高，　　無能有踰者，　所覩極究練，　　無所憂弊礙。",
        "translation": "He considers himself to have a high moral compass that can't be surpassed, and what he sees is extremely detailed, so he has no worries or problems that hinder him.",
        "source": "T09n0263_003:0086a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如五通者，　　號名曰仙人，　愍而告之曰，　　卿故有蔽礙，　不能弘深奧，　　於愚則為明，　在內不見外，　　雖明故為愚。",
        "translation": "He's like a man of the five supernormal powers who's called an immortal and kindly tells him, \"You're therefore hindered by obscuration and unable to communicate profundity; in the case of foolishness, you're insight; inwardly, you don't see outwardly; even though you're insightful, you're foolish.",
        "source": "T09n0263_003:0086a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　數十里有聲，　　耳則不得聞，　若人欲危害，　　不知彼所念。",
        "translation": "There's sound for dozens of miles, but the ear can't hear it, and if someone wants to harm them, they don't know what they're thinking.",
        "source": "T09n0263_003:0086a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲至外數里，　　不躇步不到，　若生長大時，　　不識胎中事。",
        "translation": "When they want to go out for miles, they don't hesitate to step inside, and when they're growing large, they don't realize what's in their womb.",
        "source": "T09n0263_003:0086a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五事表裏徹，　　爾乃為悉達，　何以忍貢高，　　自謂無等倫？",
        "translation": "After penetrating five things both on the surface and inside, then they're fully comprehended; why does he hold himself in high regard and claim to be unequalled?",
        "source": "T09n0263_003:0086a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲得五通者，　　當處於閑居，　精思專念道，　　爾能曉了此。",
        "translation": "Those who want to attain the five powers should live in a quiet place, concentrate their thoughts on the path, and then they'll be able to understand it.",
        "source": "T09n0263_003:0086a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即尋奉所誨，　　捨家入深山，　一心無穢慮，　　便得成神仙。",
        "translation": "He then seeks out what's taught to him, leaves home and enters a deep mountain, and with one mind and undefiled thoughts, he'll become a sage.",
        "source": "T09n0263_003:0086b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若得至聲聞，　　及獲緣覺乘，　自謂慧具足，　　與佛等泥洹，　臨欲滅度時，　　佛即住其前，　為現菩薩法，　　三達無罣礙，　智慧度無極，　　進善權方便，　度空無想願，　　菩薩由是生。",
        "translation": "If someone has attained the vehicle of the direct disciples and the vehicle of the solitary realizers, they consider themselves to have perfected wisdom, equal in nirvāṇa to the buddhas, and just before they want to cease, the Buddha will stay there and show them the bodhisattva's teaching, which is unobstructed in its three attainments, limitless in its perfection of wisdom, skillful in its expedient methods, empty of conceptions and vows, and thus the bodhisattva is born.",
        "source": "T09n0263_003:0086b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　四等心四恩，　　用開化黎庶，　解一切如化，　　幻夢野馬影，　深山響芭蕉，　　三界無所有，　不執亦不捨，　　無愚亦無明，　不生死泥洹，　　悉等如虛空，　無見無不見，　　乃覩一切本。",
        "translation": "With four equal thoughts and four graces, he uses them to enlighten the common people, understands them all as they are transformed, illusory dreams, the shadows of wild horses, the sound of plantains in deep mountains, the absence of the three realms, neither attachment nor detachment, neither folly nor ignorance, the nirvāṇa of nonarising and death, all are equally like space, without seeing or not seeing, and then he sees the origin of all things.",
        "source": "T09n0263_003:0086b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當爾時所見，　　不造三界觀，　一切普平等，　　所濟無有量。」",
        "translation": "At that point, what he sees is a contemplation that doesn't create the three realms, that all are universal and equal, and that which is helped is beyond measure.\"",
        "source": "T09n0263_003:0086b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法華經授聲聞決品第六",
        "translation": "Sixth Chapter of the Sutra of the True Dharma Flower Bestowed on śrāvakas",
        "source": "T09n0263_003:0086b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊說斯頌時，一切普告諸比丘眾：「吾盡宣告，此聲聞比丘大迦葉者，曾已供養三千億佛，方當供養如此前數，奉敬承順諸佛世尊，稟受正法奉持宣行，竟斯數已當得作佛，世界曰還明，劫名弘大，佛號時大光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，為佛、眾祐，壽十二中劫。",
        "translation": "When the Bhagavān spoke this verse, he addressed the monks in general, \"I declare at length that this śrāvaka monk Dākāśyapa, who has made offerings to 300 billion buddhas, will now make offerings to this number of previous ones, honor and obey the buddhas, retain and proclaim the right teaching, and after he has done so, he will become a buddha, and the world will be called even brighter, the eon will be called greater, and the buddha's name will be Mahābrāhmaṇḍa, the supreme truth, the perfect awakening, the accomplishment of knowledge and conduct, the well-excluded, the worldly understanding, the unsurpassed man, the trainer of the way, and the teacher of gods and humans, who will be a buddha and a blessing for 12 medium-length eons.",
        "source": "T09n0263_003:0086b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛滅度後，正法住二十劫，其像法者亦二十劫。",
        "translation": "After the Buddha's death, the true teaching remains for 20 eons, and those who resemble the teaching also last 20 eons.",
        "source": "T09n0263_003:0086b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛國土甚為清淨，無有礫石荊蕀穢濁之瑕、山陵谿澗，普大快樂，紺琉璃地眾寶為樹，黃金為繩連綿諸樹，有八交道，諸寶樹木常有華實，悉皆茂盛。",
        "translation": "That Buddha's land is so pure that there are no pebbles, thorns, or impurities, hills, or streams, and it's perfectly happy, with a deep, beryl ground, many jewels for trees, gold for cords, and a chain of trees with eight intersections, and the flowers and fruits of the jeweled trees that always flourish.",
        "source": "T09n0263_003:0086b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其土菩薩無央數億百千姟，諸聲聞等亦不可量億百千姟。",
        "translation": "In that land, there are measureless billions of hundreds of thousands of bodhisattvas and incalculable billions of hundreds of thousands of śrāvakas.",
        "source": "T09n0263_003:0086c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其土無有魔事及諸官屬，諸魔營從皆護佛法，常行精進無所違失。」",
        "translation": "There are no demonic forces or officials in that land, and the demons who camp there protect the Buddha's teaching and always conduct themselves with energy and without fail.\"",
        "source": "T09n0263_003:0086c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，欲重解誼，即說頌曰：「我覩比丘，　　以佛明目，　　迦葉住此，　當成為佛。",
        "translation": "It was then that the Bhagavān, wanting to renew his friendship, spoke a verse, \"I've seen a monk with the bright eyes of the Buddha, and Kāśyapa, while staying here, will become a buddha.",
        "source": "T09n0263_003:0086c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於將來世，　　無央數劫，　供養諸佛，　　聖中之尊，　　具足悉滿，　三千億佛。",
        "translation": "In a future age, there will be countless eons when offerings will be made to the buddhas, the most noble of the noble ones, fully replete with 300,000,000,000 buddhas.",
        "source": "T09n0263_003:0086c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　斯大迦葉，　　諸漏得盡，　便當越度，　　三品之行，　　當得佛道，　親近法施，　　供養諸佛，　　天人之尊，　合集得至，　　無上大道。",
        "translation": "Thus, Kāśyapa, once his contaminants have ended, he'll transcend the three classes of practice and attain the Buddha Way, become intimate with Dharma generosity, make offerings to the buddhas, and gather the highest of gods and humans to attain the unsurpassed great path.",
        "source": "T09n0263_003:0086c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　最於來世，　尊無上倫，　　為大聖道，　　無極神仙。",
        "translation": "Most of all, in the next world, they'll be revered as unsurpassed, become great sages and paths, and become supreme sage-recluses.",
        "source": "T09n0263_003:0086c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其佛國土，　　最勝第一，　　清淨離垢，　若干顯明，　　隨意所欲，　　常可至心。",
        "translation": "Their buddha land is the most excellent, pure, spotless, and revealing, and it's always accessible to the mind according to one's desire.",
        "source": "T09n0263_003:0086c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　紫磨金色，　　珍寶莊嚴，　　復以珍寶，　成為樹木，　　有諸道徑，　　嚴八交路，　天人放香，　　自然流馨，　　彼時國土，　所有如是。",
        "translation": "It's adorned with purple and gold, treasures, and jewels, and it's made of trees, has pathways and eight narrow intersections, and gods and humans emit fragrances that naturally flow, so that their land then is like this.",
        "source": "T09n0263_003:0086c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若干種華，　　而為挍飾，　一切諸華，　　紫磨金色，　　出光音聲，　以為法則，　　普常微妙，　　莫不見者。",
        "translation": "Decorated with various kinds of flowers, all of them are purple and gold in color, and they produce a radiant sound that serves as a Dharma rule, so subtle and universal that no one can fail to see it.",
        "source": "T09n0263_003:0086c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸菩薩眾，　　億千之數，　　志性調定，　逮大神通。",
        "translation": "The multitude of bodhisattvas, numbering in the hundreds of thousands, are attuned to their aspirations and acquire great supernormal powers.",
        "source": "T09n0263_003:0086c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸聖哲等，　　奉方等經，　不可計數，　　億百千姟，　　無有諸漏，　奉持志強。",
        "translation": "The sages and philosophers present an incalculable number of hundreds of thousands of arhats, without contaminants, who are dedicated and strong in their resolve.",
        "source": "T09n0263_003:0086c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所有聲聞，　　彼佛法勝，　假使天眼，　　欲計劫限，　　弟子之數，　不可稱算。",
        "translation": "For all those śrāvakas, that Buddha's teaching is so superior that if the divine eye wished to calculate the number of eons, the number of his disciples couldn't be counted.",
        "source": "T09n0263_003:0086c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其佛當壽，　　十二中劫，　正法當住，　　二十中劫，　　像法亦立，　二十中劫。",
        "translation": "That Buddha will live for twelve medium-length eons, the true teaching will abide for twenty medium-length eons, and the conventional teaching will be established for twenty medium-length eons.",
        "source": "T09n0263_003:0086c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大光明佛，　　德當如是。」",
        "translation": "Thus will be the attributes of the great luminous buddhas.\"",
        "source": "T09n0263_003:0086c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是賢者大目揵連、賢者須菩提、賢者摩訶迦旃延，等同心側立頂戴，瞻順光顏目未曾眴，稽首足下戰戰兢兢，應時各各說斯之頌，而諮嗟曰：「大雄無所著，　　釋王無極人，　乃愍傷我等，　　讚揚宣佛音。",
        "translation": "Thereupon, the good Mahāmaudgalyāyana, the good Supporti, and the good Mahākātyāyana stood side-by-side with one accord, propped themselves up, looked at the face of Shunyata with eyes that had never dazzled, bowed their heads at their feet, and trembled as they responded, each spoke this verse, and asked in contempt, \"Mahāsaṃbhava, the king of the Śākyas, and the peerless person of the Śākyas, have taken pity on us and praised and proclaimed the Buddha's voice.",
        "source": "T09n0263_003:0087a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今以知余等，　　愍授我疇莂，　以甘露見灌，　　沐浴眾祐決。",
        "translation": "Now, knowing the rest of us, he has kindly granted us the privilege of renunciation, bestowed a drink of nectar from his vision, and bathed them all in blessing.",
        "source": "T09n0263_003:0087a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如饑饉時，　　丈夫得美饍，　虛乏叫喚求，　　有人手授食。",
        "translation": "It's like a man who's given a delicious meal when he's starving, or someone gives him a hand to eat when he's desperate and wails for help.",
        "source": "T09n0263_003:0087a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　吾等咸歡喜，　　本為下劣乘，　違時捨眾人，　　虛乏不得決，　設至平等覺，　　大聖不拜授，　於今處世倫，　　則不復飲食。",
        "translation": "We all rejoice, for we were originally from an inferior vehicle, abandoned the crowd at a bad time, and were left destitute and unable to resolve our problems, even if we had attained equal awakening and a great sage hadn't paid homage to us, and now we're in a worldly family, then we won't eat or drink again.",
        "source": "T09n0263_003:0087a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊見勸勵，　　聞尊上音聲，　唯垂見授決，　　爾能獲大安。",
        "translation": "The Bhagavān sees and encourages them, hears the voice of the venerable, and only grants them the assurance of seeing, so they can attain great peace.",
        "source": "T09n0263_003:0087a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大哀願散疑，　　愍傷多所矜，　撫恤貧匱意，　　甘露誘示子。」",
        "translation": "He has great compassion for those who doubt, pity for those who are sorrowful, sympathize with the poor, and offer sweet nectar to guide his children.\"",
        "source": "T09n0263_003:0087a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊，見諸耆舊心志所念，即復重告諸比丘眾：「比丘當知，此大聲聞耆年須菩提，當復奉侍供養八千三十億百千姟佛，在諸佛所常修梵行，積累功德具足究竟，竟後世時當得作佛，號稱歎如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，為佛、眾祐，世界名寶成，劫曰寶音。",
        "translation": "Then the Bhagavān, seeing the thoughts of the minds of the elders, again addressed the monks, \"Monks, you should know that this śrāvakas and seniors, the Subhūti, will again serve and support the 803 billion, 10,000 thousand, and numerous buddhas, will always cultivate the religious practice in the buddhas' places, accumulate merit and perfection, and will attain Buddhahood in the final age when they are called praising the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, the Teacher of Gods and People, the Buddha, and the Blessed Ones, whose world is called Jeweled, and whose eon is called Jeweled Sound.",
        "source": "T09n0263_003:0087a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普佛之土周匝悉遍，有諸寶樹自然莊嚴，無沙礫石山陵谿澗，其樹音聲哀和柔雅，眾庶產業不可稱數，人所居跱館宇若干，重閣交露。",
        "translation": "The land of the universal Buddha is completely surrounded by jeweled trees that are naturally adorned, with no sand or gravel in the hills or valleys, whose sounds are gentle and refined, and whose products of the common people are incalculable, and where people live in a number of mansions and heavy shrines.",
        "source": "T09n0263_003:0087a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有無央數聲聞之眾，欲計算者無能限量，悉識宿命。",
        "translation": "There are an incalculable number of śrāvakas, and there's no limit to the number of those who want to calculate them and know their past lives.",
        "source": "T09n0263_003:0087a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼土菩薩亦不可計億那術百千。",
        "translation": "There are also incalculable millions of bodhisattvas in that land, and there are hundreds of thousands of them.",
        "source": "T09n0263_003:0087b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛當壽十二中劫，滅度之後，正法當住二十中劫，像法亦立二十中劫，則坐虛空，為一切人講說經法，開化無數百千菩薩。」",
        "translation": "That Buddha will live for 12 medium-length eons, and after he passes away, he'll abide for 20 medium-length eons in the true teaching and 20 medium-length eons in the imitation teaching, then he'll sit in space, preach the sūtras and teach the Dharma for all people, and enlighten measureless hundreds of thousands of bodhisattvas.\"",
        "source": "T09n0263_003:0087b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說頌曰：「今吾普告，　　諸比丘眾，　　悉且明聽，　佛所班宣。",
        "translation": "It was then that the Bhagavān spoke a verse, \"Now, I would like to address all of you monks, so listen closely as the Buddha preaches.",
        "source": "T09n0263_003:0087b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　尊須菩提，　　是吾弟子，　當來之世，　　得成為佛。",
        "translation": "Venerable Subhūti, this is my disciple who will attain Buddhahood in a future life.",
        "source": "T09n0263_003:0087b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大聖所見，　至誠無虛，　　具足三十，　　那術姟千，　當於世間，　　遵修道行，　　常志求斯，　佛之要道。",
        "translation": "He's seen by great sages, is perfectly sincere without falsity, has the full 30, and has a thousand techniques, will follow the path of cultivation in the world, and will always aspire to follow the Buddha's essential path.",
        "source": "T09n0263_003:0087b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於彼來世，　　究竟行已，　顏色殊妙，　　相三十二，　　威曜巍巍，　紫磨金容，　　處世清淨，　　多所愍哀。",
        "translation": "In a future life, once he has fully practiced, he'll be marvelous in color, have thirty-two bodily forms, be resplendent and majestic, have a purple-marbled gold face, behave in a pure and compassionate way in the world, and be much loved.",
        "source": "T09n0263_003:0087b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　國土快樂，　　所在顯現，　　無數人見，　踊躍可意，　　悉當遊行，　　詣諸世尊，　度脫群生，　　億百千姟。",
        "translation": "The land's happiness is displayed, and countless people see and rally to their feet in delight as they all march to the world-honored one, liberating hundreds of thousands of sentient beings.",
        "source": "T09n0263_003:0087b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸菩薩眾，　不可計量，　　而常廣說，　　不退轉輪，　在最勝教，　　諸根通利，　　皆當恭順。",
        "translation": "Their multitude of bodhisattvas is incalculable, they always explain it in detail, they don't turn back the wheel, they are in the most excellent teaching, and they are all obeyed by those with sharp faculties.",
        "source": "T09n0263_003:0087b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼佛國土，　　諸聲聞事，　　不可計量，　欲有限算，　　無能盡極。",
        "translation": "The affairs of the śrāvakas in that Buddha's land are incalculable, and there's no limit to how many desires can be counted.",
        "source": "T09n0263_003:0087b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　六通三達，　獲大神足，　　脫門無礙，　　而處安隱，　計神足力，　　不可思議。",
        "translation": "They have the six supernormal powers and three comprehensions, attain great supernormal abilities, have no obstructions to liberation, and are in a peaceful place, and their imagined supernormal powers are unfathomable.",
        "source": "T09n0263_003:0087b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我假使說，　諸佛尊道，　　諸天人民，　　如江河沙，　常當叉手，　　自歸聖尊。",
        "translation": "Suppose I were to say that the path of the buddhas is honored, and the gods and people, like rivers and sands, always fold their arms and take refuge in the noble one.",
        "source": "T09n0263_003:0087b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其佛當壽，　十二中劫，　　正法當住，　　二十中劫，　像法亦立，　　二十中劫，　　世雄導師，　劫數如是。」",
        "translation": "Those buddhas will live for twelve medium-length eons, the true teaching will abide for twenty medium-length eons, the conventional teaching will be established for twenty medium-length eons, and the hero of the world will guide them for eons like this.\"",
        "source": "T09n0263_003:0087b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊重復宣告諸比丘眾：「比丘欲知堅固取要分別平等，是我聲聞大迦旃延。",
        "translation": "It was then that the Bhagavān again announced to the monks, \"Monks who want to know the equality of discriminating essentials for resolute grasping are I, the śrāvakas and Mahākātyāyana.",
        "source": "T09n0263_003:0087b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後當供養奉侍八千億佛，佛滅度後各起塔廟，高四萬里，廣長各二萬里，皆七寶成，金銀、琉璃水精、車璩馬碯、珊瑚碧玉，香華、雜香搗香、繒綵幢幡供廟。",
        "translation": "Later, they will make offerings to and serve 800 billion buddhas, and after the buddhas' death each will erect a stūpa 40,000 miles high and 20,000 miles long and wide, each made of seven treasures, gold and silver, beryl and water essences, chariots and horses, coral and jasper, incense and flowers, mixed incense and pounded incense, and silken banners and streamers for the temple.",
        "source": "T09n0263_003:0087b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是過斯數已，當復供養二十億佛，然後來世當得作佛，號曰還已紫磨金色如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，為佛、眾祐。",
        "translation": "After this number of offerings, they'll make offerings to another 2 billion buddhas, and then they'll become buddhas in the next life, to be called violet-marbled golden tathāgata, supreme true, perfectly enlightened, accomplished in knowledge and conduct, well gone, worldly savvy, unsurpassed man, trainer of the way, teacher of gods and humans, and a buddha and a blessing to all.",
        "source": "T09n0263_003:0087c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國土嚴淨平等無邪，名聞顯現，琉璃為地，若干種樹眾寶校飾，紫磨黃金為繩連綿，諸樹華實茂盛華遍。",
        "translation": "The land's splendor and purity are equal and without error, fame and learning are evident, emerald glass is the ground, various trees are decorated with treasures, purple and polished gold is used for cords and wool, and the trees are lush and flamboyant with flowers and realms.",
        "source": "T09n0263_003:0087c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛土無有地獄餓鬼畜生，但有諸天人民眾多具足充滿。",
        "translation": "In the Buddha land, there are no hells, hungry ghosts, or animals, but instead there are gods and people abundantly filled with plenty.",
        "source": "T09n0263_003:0087c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸聲聞無數百千那術之眾，諸菩薩等無數百千，莊嚴國土。",
        "translation": "There are also śrāvakas, countless hundreds of thousands of navas, and bodhisattvas, countless hundreds of thousands of them, adorning the land.",
        "source": "T09n0263_003:0087c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛當壽十小劫，滅度之後，正法當住二十中劫，像法亦住二十中劫。」",
        "translation": "That Buddha will live for ten little eons, and after his extinction, the right teaching will last for 20 medium eons, and so will the conventional teaching.\"",
        "source": "T09n0263_003:0087c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊，即說頌曰：「諸比丘眾，　　皆聽吾教。",
        "translation": "The Bhagavān then spoke a verse, \"All the monks listen to my teaching.",
        "source": "T09n0263_003:0087c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其佛音聲，　當美柔軟，　　尊迦旃延，　　為佛弟子。",
        "translation": "The Buddha's voice will be beautiful and gentle, and Venerable Kātyāyana will be his disciple.",
        "source": "T09n0263_003:0087c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當供養佛，　　若干導師，　　奉敬承順，　恭恪無量，　　無數世人，　　不能稱計。",
        "translation": "They must make offerings to the Buddha, have several mentors, revere and obey them, and be so respectful and scrupulous that there are countless people who can't be counted.",
        "source": "T09n0263_003:0087c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若滅度後，　　當起廟寺，　　當以華香，　而供養之。",
        "translation": "After he passes away, he'll build a temple, and he'll offer flowers and incense to support him.",
        "source": "T09n0263_003:0087c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　然於後世，　　便得作佛，　國土清淨，　　無有瑕穢。",
        "translation": "In a later life, they'll then become buddhas, and their land will be pure and undefiled.",
        "source": "T09n0263_003:0087c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　講說發起，　億千眾生，　　具足開導，　　一切人民。",
        "translation": "He'll inspire hundreds of thousands of sentient beings with lectures and guide all the people with complete success.",
        "source": "T09n0263_003:0087c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世界莊嚴，　　光照十方，　　當得作佛，　多所超喻。",
        "translation": "The world is adorned, its light shines in ten directions, and he'll become a buddha, which is often surpassed by metaphors.",
        "source": "T09n0263_003:0087c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　號紫金色，　　其德巍巍，　究竟群黎，　　億百千姟。",
        "translation": "His name is purple-gold, his virtue is majestic, and he thoroughly guides hundreds of thousands of people.",
        "source": "T09n0263_003:0087c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無數菩薩，　及諸聲聞，　　滿其佛國，　　無量難計。",
        "translation": "Countless bodhisattvas and śrāvakas fill their buddha land, which is incalculable and difficult to fathom.",
        "source": "T09n0263_003:0087c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常行精進，　　於佛法教，　　除斷諸難，　滅終始患。」",
        "translation": "They always conduct themselves with energy, apply themselves to the Buddha's teaching, remove difficulties, and extinguish initial afflictions.\"",
        "source": "T09n0263_003:0087c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊，復告四部眾會曰：「今佛大聖宣告爾等，是我聲聞尊大目揵連，當悉供養奉侍於八千佛，承順世尊一切無量。",
        "translation": "The Bhagavān then again addressed the fourfold congregation, \"Now, the Buddha, the great sage, declares that you, the śrāvaka honored one, the great Maudgalyāyana, should all make offerings to and serve the 8,000 buddhas and obey the Bhagavān in all of his innumerable ways.",
        "source": "T09n0263_003:0088a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛滅度當起塔廟，七寶校成，金銀、琉璃水精、車璩馬碯、珊瑚真珠，高四萬里廣長二萬里，若干殊好眾寶之物，供養塔廟，及與香華、雜香搗香、繒綵華蓋、幢幡伎樂之娛。",
        "translation": "When the buddhas pass away, they'll erect stūpas and temples made of seven jewels, gold and silver, lapis lazuli and aqua, chariots and horses, coral beads, 40,000 miles high and 20,000 miles long, and a variety of beautiful and precious things to offer to the stūpas and temples, as well as flowers, mixed incense, pounded incense, silken ornaments, banners, streamers, music, and entertainment.",
        "source": "T09n0263_003:0088a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過是數已，當復奉敬二百萬億佛，供養承順。",
        "translation": "After these amounts, they'll then worship two million million buddhas and offer support and obedience to them.",
        "source": "T09n0263_003:0088a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最後世時當得作佛，號還已金華栴檀香如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，為佛、眾祐，國土名意樂，劫曰樂滿。",
        "translation": "In the final age, they'll become buddhas and be called gold-flowered, sandalwood-scented tathāgatas, supreme true ones, perfectly enlightened ones, accomplished in knowledge and conduct, well gone, worldly savers, unsurpassed ones, guides of the way, and teachers of gods and humans, and they'll be buddhas and guardians of the people, whose lands are called Aspirations, and whose eons are called Pleasant Perfection.",
        "source": "T09n0263_003:0088a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛世界，快樂安隱清淨鮮潔，紺色琉璃以為其地，諸樹華實七寶合成，普以真珠眾華莊校，平等端嚴眾寶具足。",
        "translation": "In that Buddha's world, it's happy, peaceful, pure, and clean, with a violet-colored beryl ground, trees with flowers and realms made of seven treasures, decorated with true pearls and flowers, and replete with equally endowed treasures.",
        "source": "T09n0263_003:0088a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大仙聖有億百千，寂然而坐所謂無量。",
        "translation": "There are hundreds of millions of great sages and sages who sit silently and are called numberless.",
        "source": "T09n0263_003:0088a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆諸菩薩廣說經法。",
        "translation": "They are all bodhisattvas who explain the sūtras and teachings in detail.",
        "source": "T09n0263_003:0088a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛當壽二十中劫，滅度之後，正法當住四十中劫，并計像法。」",
        "translation": "That Buddha will live for 20 medium-length eons, and after he passes away, the true teaching will reside for 40 medium-length eons, counting also the semblance teaching.\"",
        "source": "T09n0263_003:0088a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊則說頌曰：「大目揵連，　　是吾弟子，　　棄捐仁行，　猶得自在。",
        "translation": "It was then that the Bhagavān spoke a verse, \"Mahāmaudgalyāyana, this is my disciple who abandoned his benevolent ways and still attained mastery.",
        "source": "T09n0263_003:0088a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　二百萬億，　　諸劫之數，　悉當供養，　　此諸佛教。",
        "translation": "Two hundred thousand million million, the number of eons, should all be offered up to this Buddhism.",
        "source": "T09n0263_003:0088a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　普於諸佛，　常修梵行，　　而當志願，　　斯諸佛道。",
        "translation": "These buddhas everywhere always cultivate the religious practice, and they will vow that this is the path of the buddhas.",
        "source": "T09n0263_003:0088a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉當奉侍，　　諸佛世尊，　　具以承事。",
        "translation": "They will all serve the buddhas, the world-honored ones, and fully undertake to serve them.",
        "source": "T09n0263_003:0088a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　導師之眾，　　皆當廣普，　　執持聖教，　若干億劫，　　百千之數，　　慇懃承順，　不違大命，　　諸安住等。",
        "translation": "Their guiding hosts will all be extensive, upholding the noble teaching for hundreds of millions of eons and thousands of years, diligently obeying it, not disobeying the great commands, and abiding in peace and so forth.",
        "source": "T09n0263_003:0088a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　滅度之後，　以眾七寶，　　興立塔廟，　　為諸最勝，　建修上業。",
        "translation": "After they pass away, they'll erect stūpas and temples with these seven treasures, making them the most distinguished and cultivating the highest karma.",
        "source": "T09n0263_003:0088a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　用栴檀香，　　以為柱梁，　眾香伎樂，　　而供養之。",
        "translation": "They use fragrant sandalwood as pillars and beams, and they are decorated with incense and music.",
        "source": "T09n0263_003:0088a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　然於後世，　事究竟已，　　言談斐粲，　　人所宗仰，　多所愍哀，　　所為如此，　　當得作佛，　號金栴檀。",
        "translation": "Still, in a later life, once his deeds are accomplished, his words are eloquent, he's revered by people, much sympathized with, and he does so, he'll become a buddha, and he'll be called Gold Sandal.",
        "source": "T09n0263_003:0088a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其佛當壽，　　二十中劫，　安住所更，　　行德如是。",
        "translation": "That Buddha will live for 20 medium-length eons, will be reborn in a stable dwelling, and will conduct himself in this way.",
        "source": "T09n0263_003:0088b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當為菩薩，　講說經法，　　於是劫數，　　分別雅誼。",
        "translation": "He'll teach sūtras and teach Dharma for bodhisattvas, discerning their friendship during these eons.",
        "source": "T09n0263_003:0088b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最勝聲聞，　　有無數千，　　億百千數，　如江河沙。",
        "translation": "The most distinguished śrāvakas are numberless and numerous, a hundred thousand thousand in number like the sands of a river.",
        "source": "T09n0263_003:0088b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　六通三達，　　得大神足，　於安住世，　　獲致妙通。",
        "translation": "They have the six supernormal powers and three comprehensions, attain great spiritual abilities, and attain marvelous supernormal abilities in the stable world.",
        "source": "T09n0263_003:0088b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無數菩薩，　悉不退轉，　　精進勇猛，　　有志智慧。",
        "translation": "Countless bodhisattvas are all nonretrogressing, vigorous in their effort and determined in their wisdom.",
        "source": "T09n0263_003:0088b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修行如應，　　順斯佛教，　　不可計量，　若干千數。",
        "translation": "They cultivate their practice as they should, following this Buddhism, which is incalculable and counted in thousands.",
        "source": "T09n0263_003:0088b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛滅度後，　　弟子多學，　正法當住，　　流布十方。",
        "translation": "After the Buddha's death, his disciples often train, and the right teaching will abide and spread in ten directions.",
        "source": "T09n0263_003:0088b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　正法像法，　四十中劫，　　正法沒盡，　　像法乃出。",
        "translation": "The right Dharma and the image Dharma will last for forty medium-length eons, and the right Dharma will end before the image Dharma emerges.",
        "source": "T09n0263_003:0088b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是佛聲聞，　　得大神足，　　佛皆勸立，　在大尊道。",
        "translation": "These buddhas and śrāvakas attain great spiritual abilities, and they are all encouraged by the buddhas to establish themselves on the path of the great sages.",
        "source": "T09n0263_003:0088b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　依倚大聖，　　不違真法，　於當來世，　　成佛自在。」",
        "translation": "Relying on great sages and not contradicting the true teaching, they'll become buddhas freely in the future.\"",
        "source": "T09n0263_003:0088b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法華經卷第三",
        "translation": "Sutra of the True Dharma Flower, Volume 3",
        "source": "T09n0263_003:0088b16_0",
        "is_bad_quality": false
    }
]