[
    {
        "source_sentence": "大方廣佛華嚴經卷第四十七",
        "translation": "Dafangguangfo huayan jing roll 47",
        "source": "T09n0278_047:0695b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東晉天竺三藏佛馱跋陀羅譯",
        "translation": "A Translation of the Tripiṭaka of the Eastern Jin Dynasty (India) by Buddhabhadra",
        "source": "T09n0278_047:0695b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入法界品第三十四之四",
        "translation": "Dharma-realm Entry Chapter 34-4",
        "source": "T09n0278_047:0695b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎爾時，善財童子正念思惟解脫長者教，念不可思議菩薩法門，思惟不可思議菩薩慧光，隨順深入不可思議甚深法界，攝取菩薩不可思議淨妙功德，顯現如來不可思議自在神力，解了不可思議莊嚴佛剎，分別知佛不可思議住持莊嚴安住境界，思惟不可思議菩薩境界三昧莊嚴，分別不可思議世界究竟無礙，向不可思議菩薩堅固淨業，深心受持不可思議淨業諸願。",
        "translation": "◎爾時，善財童子正念思惟解脫長者教，念不可思議菩薩法門，思惟不可思議菩薩慧光，隨順深入不可思議甚深法界，攝取菩薩不可思議淨妙功德，顯現如來不可思議自在神力，解了不可思議莊嚴佛剎，分別知佛不可思議住持莊嚴安住境界，思惟不可思議菩薩境界三昧莊嚴，分別不可思議世界究竟無礙，向不可思議菩薩堅固淨業，深心受持不可思議淨業諸願。",
        "source": "T09n0278_047:0695b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸趣南方，至莊嚴閻浮提頂國，周遍推求海幢比丘；見在靜處，結跏趺坐，三昧正受，滅出入息，身安不動，寂然無覺。",
        "translation": "He gradually headed south to the adorned country of Jambudvīpa and searched everywhere for the monk Sāgarabhū, who was seen sitting cross-legged in a quiet place, correctly feeling samādhi, cessation and calmness, his body at ease, motionless, and nonconscious.",
        "source": "T09n0278_047:0695b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其足下，出阿僧祇長者、阿僧祇婆羅門，皆悉頂冠眾寶天冠，各齎妙寶上味飲食，一切寶衣、香華、寶鬘、末香、塗香資生之具，攝諸貧窮，安慰撫接，雨眾寶物；令一切眾生皆大歡喜，充滿十方。",
        "translation": "From beneath his feet, there emerges a monk and a monk's celestial crown crowned with many treasures, each carrying a meal of the finest foods, all the precious clothing, flowers, jewelry, garments, incense, and smeared implements for livelihood, collecting the poor, comforting and guiding them, and raining down treasures, causing all sentient beings to rejoice greatly and filling the ten directions.",
        "source": "T09n0278_047:0695b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其兩膝，出剎利婆羅門，皆悉聰慧；形色威儀，服飾莊嚴，皆悉不同；以微妙音，訓導眾生，離惡修善，住真實義，說四攝法，令眾生歡喜，充滿十方。",
        "translation": "From his two knees, there emerges a bodhisattva of wisdom, intelligence, appearance, manner, and adornment, all of which are different, who instructs sentient beings with subtle sounds to part with evil and cultivate goodness, abide in true awareness, and speak the four collected teachings, causing sentient beings to rejoice and fill the ten directions.",
        "source": "T09n0278_047:0695b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從腰兩邊，出一切眾生數等，五通仙人；或服草衣，或樹皮衣，皆執澡瓶，持三奇杖，威儀庠序，無有變異；遊行虛空，讚歎三寶，為眾生說清淨梵行，調伏諸根，演真實義，攝取世間，令諸眾生入智慧海，又復演說世間諸論，令次第住一切善根，充滿十方。",
        "translation": "From either side of his waist, there emerges a multitude of sentient beings, including five sages with supernormal powers, some clad in straw robes or bark robes, all holding bathing vases and carrying three wonderful staffs, whose manner is peaceful and unchanging; they parade through the sky, praise the Three Treasures, teach sentient beings the pure religious practice, tame their faculties, expound the true meaning, gather the world, cause sentient beings to enter the ocean of wisdom, and expound worldly treatises that sequentially abide in all good roots and fill the ten directions.",
        "source": "T09n0278_047:0695c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其兩脇，出不可思議龍、不可思議龍女，顯現不可思議諸龍自在，攝取眾生；雨不可思議香莊嚴雲、華莊嚴雲、鬘莊嚴雲、寶蓋莊嚴雲、寶幡莊嚴雲、眾寶莊嚴雲、無價摩尼寶莊嚴雲、寶瓔珞莊嚴雲、寶座莊嚴雲、寶宮殿莊嚴雲、寶蓮華莊嚴雲、寶冠莊嚴雲、天形像莊嚴雲、天女莊嚴雲；雨如是等雲，各不可思議，普照十方一切世界，而以供養一切如來，普令眾生皆大歡喜，充滿法界。",
        "translation": "From their sides, unfathomable dragons and unfathomable nymphs emerge, manifesting the unfathomable mastery of the dragons and gathering in sentient beings; it rains down unfathomable clouds of fragrant adornment, flower adornment, garland adornment, jeweled canopy adornment, jeweled banners adornment, multitudinous jewel adornment, priceless maṇi jewel adornment, jeweled jewelry adornment, jeweled throne adornment, jeweled palace adornment, jeweled lotus adornment, jeweled crown adornment, celestial form adornment, and celestial woman adornment; each of these unfathomable clouds illuminates all the worlds in the ten directions and serves all the Tathāgatas, causing sentient beings to rejoice greatly and filling the Dharma realm.",
        "source": "T09n0278_047:0695c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從胸德字，出無量阿僧祇阿脩羅王，示現阿脩羅王不可思議自在神力，震動一切諸大海水，及百千世界；令諸山王皆相衝擊，震動一切諸天宮殿，映蔽一切諸魔光明，悉如聚墨；降伏一切諸魔軍眾，除滅眾生，放逸高慢；離怒害心，滅不善法，壞煩惱山，棄捨戰諍；又以神力覺悟眾生，厭離諸惡，永絕生死，不著諸趣；普令眾生常樂寂滅，住菩提心，淨菩薩行，住諸波羅蜜，究竟菩薩地，照一切法，普照諸佛方便之法，充滿法界。",
        "translation": "從胸德字，出無量阿僧祇阿脩羅王，示現阿脩羅王不可思議自在神力，震動一切諸大海水，及百千世界；令諸山王皆相衝擊，震動一切諸天宮殿，映蔽一切諸魔光明，悉如聚墨；降伏一切諸魔軍眾，除滅眾生，放逸高慢；離怒害心，滅不善法，壞煩惱山，棄捨戰諍；又以神力覺悟眾生，厭離諸惡，永絕生死，不著諸趣；普令眾生常樂寂滅，住菩提心，淨菩薩行，住諸波羅蜜，究竟菩薩地，照一切法，普照諸佛方便之法，充滿法界。",
        "source": "T09n0278_047:0695c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其背，出阿僧祇聲聞、緣覺，應以二乘化眾生故；著我見者，教不淨觀；貪欲多者，教慈心觀；瞋恚多者，教緣起觀；愚癡多者，教方便智，觀察諸法；為等分者，說無著法；著境界者，說妙願境界；樂寂滅者，教入諸趣；饒益眾生，充滿法界。",
        "translation": "From their backs, Aśāṅgata śrāvakas and pratyekbuddhas emerge, teaching those who should transform sentient beings using the two vehicles; those who are attached to views of self to contemplate impurity; those who have many desires to contemplate kindness; those who have many angers to contemplate conditional arising; those who are foolish to contemplate many things to teach expedient wisdom that observes all dharmas; those who are equal in number to teach the unattached Dharma; those who are attached to the objective realm to teach the objective realm of the marvelous vows; those who are happy with cessation to teach entry into all destinies; and those who benefit sentient beings to fill the Dharma realm.",
        "source": "T09n0278_047:0695c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其兩肩，出阿僧祇諸夜叉王、諸羅剎王，種種惡身，長短形色，乘種種乘，各與其眾而自圍遶；其有眾生能行善者，及眾賢聖諸菩薩等，若向正道，若得果證，皆悉防衛而守護之，或作金剛力士，守護諸佛，及佛住處；若有眾生，遭諸恐怖，亦防護之，悉令無畏；諸疾病者，令得除愈；諸在難者，悉令解脫；除滅橫死，離諸熱惱，教化眾生，令得實利；壞生死輪，讚歎法輪，摧外道輪，充滿法界。",
        "translation": "From their shoulders, there arise incalculably large numbers of nightshade kings and rāṣasas with various evil bodies, long and short forms, and various vehicles, each surrounded by its own multitude; those sentient beings who are capable of good conduct, the noble ones and the bodhisattvas who are headed for the right path and those who have attained its realization are all guarded and protected, or they may become vajra-warriors to guard the buddhas and their abodes; if sentient beings are struck by fear, they are also protected and made fearless; those who are sick are healed; those who are in trouble are freed; those who are free from irregular death and those who are afflicted are taught and taught to bring true benefit to sentient beings; the wheel of birth-and-death is destroyed, the wheel of the praise of the Dharma is praised, and the wheel of non-Buddhists is destroyed, which fills the Dharma realm.",
        "source": "T09n0278_047:0696a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其腹，出百千阿僧祇緊那羅王，各與百千阿僧祇阿僧祇緊那羅女，眷屬圍遶；出百千阿僧祇乾闥婆王，各與百千阿僧祇阿僧祇乾闥婆女，眷屬圍遶；出百千阿僧祇天娛樂音，說實相法，讚歎諸佛，稱美菩提及菩薩行，歎菩提門，入法輪門，好樂一切自在法門、演說一切般涅槃門、攝持一切諸佛教門、歡喜一切眾生之門、嚴淨一切諸佛剎門、講說一切諸法界門、除滅一切諸障礙門、宣明一切諸善根門，充滿法界。",
        "translation": "從其腹，出百千阿僧祇緊那羅王，各與百千阿僧祇阿僧祇緊那羅女，眷屬圍遶；出百千阿僧祇乾闥婆王，各與百千阿僧祇阿僧祇乾闥婆女，眷屬圍遶；出百千阿僧祇天娛樂音，說實相法，讚歎諸佛，稱美菩提及菩薩行，歎菩提門，入法輪門，好樂一切自在法門、演說一切般涅槃門、攝持一切諸佛教門、歡喜一切眾生之門、嚴淨一切諸佛剎門、講說一切諸法界門、除滅一切諸障礙門、宣明一切諸善根門，充滿法界。",
        "source": "T09n0278_047:0696a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其口，出百千阿僧祇轉輪聖王，七寶具足，四兵圍遶，放無慳光，雨摩尼寶，諸貧苦者，悉令富樂；無財施者，令得惠施；為諸群生，歎離殺盜邪婬之法，修習慈心，常說愛語，饒益眾生；除滅妄語，遠離惡口；攝取眾生，遠離兩舌；說和合語，離無義語；說甚深法，悉令眾生遠離口過；讚歎大悲，令眾生歡喜，離瞋恚心；分別世間一切正法，觀察因緣，照明真諦；拔諸群生邪見毒刺，除滅疑惑，離一切障，明法實義，充滿法界。",
        "translation": "從其口，出百千阿僧祇轉輪聖王，七寶具足，四兵圍遶，放無慳光，雨摩尼寶，諸貧苦者，悉令富樂；無財施者，令得惠施；為諸群生，歎離殺盜邪婬之法，修習慈心，常說愛語，饒益眾生；除滅妄語，遠離惡口；攝取眾生，遠離兩舌；說和合語，離無義語；說甚深法，悉令眾生遠離口過；讚歎大悲，令眾生歡喜，離瞋恚心；分別世間一切正法，觀察因緣，照明真諦；拔諸群生邪見毒刺，除滅疑惑，離一切障，明法實義，充滿法界。",
        "source": "T09n0278_047:0696a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其兩目，出百千阿僧祇日，普照十方，滅一切闇；悉令眾生除滅垢曀，遠離一切惡道苦毒；令寒者得溫，於垢濁佛剎，放明淨光，廣說乃至普照金銀瑠璃等一切世界，及眾生類；除滅眾生心之重闇，悉令歡喜；能辨眾生無量事業，莊嚴一切世界妙法境界，充滿法界。",
        "translation": "From their two eyes, a hundred thousand incalculable suns arise, shining universally in ten directions and ceasing all darkness; they all cause sentient beings to be freed from pollution and obscuration, free from the pain of all bad destinies; they warm those who are cold; they radiate a bright, pure light from a polluted buddha-stage that explains in detail and illuminates universally all worlds including gold, silver, and lapis lazuli and all types of sentient beings; they remove the heavy darkness from the minds of sentient beings and make them all rejoice; they discern the measureless works of sentient beings, adorn the realm of the wonderful Dharma in all the world, and fill the Dharma realm.",
        "source": "T09n0278_047:0696b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其眉間，出百千阿僧祇天王帝釋，無量雜寶以為莊嚴；持釋王法，普照一切諸天宮殿，震動一切須彌山王；悉令諸天於天境界，生厭離心，歎功德力，明智慧力，起直心力，長深心力，嚴淨念力，堅固菩提心，遠離欲樂，讚歎樂見一切諸佛，不歎樂境界樂；歎聞法樂，離世間樂，觀察諸法智慧之樂；離阿脩羅戰鬪恐怖，滅煩惱軍，遠離死畏，願降眾魔；興妙法山，說須彌山等廣大法句，能辨眾生無量事業，充滿法界。",
        "translation": "從其眉間，出百千阿僧祇天王帝釋，無量雜寶以為莊嚴；持釋王法，普照一切諸天宮殿，震動一切須彌山王；悉令諸天於天境界，生厭離心，歎功德力，明智慧力，起直心力，長深心力，嚴淨念力，堅固菩提心，遠離欲樂，讚歎樂見一切諸佛，不歎樂境界樂；歎聞法樂，離世間樂，觀察諸法智慧之樂；離阿脩羅戰鬪恐怖，滅煩惱軍，遠離死畏，願降眾魔；興妙法山，說須彌山等廣大法句，能辨眾生無量事業，充滿法界。",
        "source": "T09n0278_047:0696b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其額上，出無量梵天，妙色端嚴，世界無倫；威儀庠序，演出妙音，讚歎諸佛，勸請說法；令眾生歡喜，乃至能辨眾生無量事業，充滿法界。",
        "translation": "From his forehead, measureless brahma gods emerge, their beautiful appearance so dignified that the world is without equal, their manner so peaceful that they give a wonderful performance, praise the buddhas, and invite them to preach, making sentient beings rejoice, even to the point where they can discern the measureless works of sentient beings that fill the Dharma realm.",
        "source": "T09n0278_047:0696b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其頭上，出阿僧祇諸菩薩眾，種種形色，相好嚴身；放無量光網，現檀波羅蜜，讚歎布施，遠離慳吝，無所貪著；莊嚴一切世界，稱揚淨戒，遠離惡戒，安立眾生菩薩律儀，歎大乘戒，出生大悲功德之藏，說一切有皆悉如夢，說五欲樂無有滋味，安立眾生離煩惱法，稱揚讚歎金色身業；讚歎慈心，遠離殺害，滅畜生趣；歎多聞力，安立眾生於忍辱力；歎普照自在，遠離放逸，安立眾生於不放逸；歎禪波羅蜜，心得自在，拔邪見刺；讚歎正見般若波羅蜜，樂智自在，歎隨世間，遠離生死，而於諸趣自在受生；歎願力滿足，出諸通明自在壽命；讚歎一切陀羅尼力，出生願力，淨三昧力，現自在生；讚歎智慧，普照一切眾生諸根，分別演說諸心心行，照十力智；讚歎自在薩婆若，充滿法界。",
        "translation": "從其頭上，出阿僧祇諸菩薩眾，種種形色，相好嚴身；放無量光網，現檀波羅蜜，讚歎布施，遠離慳吝，無所貪著；莊嚴一切世界，稱揚淨戒，遠離惡戒，安立眾生菩薩律儀，歎大乘戒，出生大悲功德之藏，說一切有皆悉如夢，說五欲樂無有滋味，安立眾生離煩惱法，稱揚讚歎金色身業；讚歎慈心，遠離殺害，滅畜生趣；歎多聞力，安立眾生於忍辱力；歎普照自在，遠離放逸，安立眾生於不放逸；歎禪波羅蜜，心得自在，拔邪見刺；讚歎正見般若波羅蜜，樂智自在，歎隨世間，遠離生死，而於諸趣自在受生；歎願力滿足，出諸通明自在壽命；讚歎一切陀羅尼力，出生願力，淨三昧力，現自在生；讚歎智慧，普照一切眾生諸根，分別演說諸心心行，照十力智；讚歎自在薩婆若，充滿法界。",
        "source": "T09n0278_047:0696b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其頂上，出百千阿僧祇佛，身分具足，相好莊嚴，猶如金山，普照一切；出妙音聲，充滿法界。",
        "translation": "From the top of his head, a hundred thousand incalculable buddhas emerge, complete in stature and adorned in appearance like golden mountains that illuminate everything, and they produce a marvelous sound that fills the Dharma realm.",
        "source": "T09n0278_047:0696c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯現無量無邊神力自在，普雨一切甘露法雲：為坐道場菩薩，雨平等法雲；為灌頂菩薩，雨普門法雲；為深忍菩薩，雨普莊嚴法雲；為童真菩薩，雨堅固山法雲；為不退菩薩，雨海藏法雲；為成就直心菩薩，雨普境界法雲；為方便道菩薩，雨自性地音聲法雲；為生貴菩薩，雨隨順世間法雲；為修行菩薩，雨厭離法雲；為治地菩薩，雨長養法藏法雲；為初發心菩薩，雨精進法雲；為信行者，雨無盡門法雲；為色界眾生，雨無盡平等法雲；為大梵天，雨普藏法雲；為大自在天，雨生力法雲；為魔天王，雨心幢法雲；為化樂天，雨淨念法雲；為兜率天，雨淨意法雲；為夜摩天，雨歡喜法雲；為帝釋天，雨莊嚴虛空法雲；為夜叉王，雨歡喜法雲；為乾闥婆王，雨自在圓滿法雲；為阿脩羅王，雨大境界法雲；為迦樓羅王，雨無量世界法雲；為緊那羅王，雨饒益眾生勝智法雲；為諸人王，雨不可樂法雲；為諸龍王，雨歡喜幢法雲；為摩睺羅伽王，雨寂靜法雲；為地獄眾生，雨不亂念莊嚴法雲；為諸畜生，雨智慧法雲；為閻羅王處，雨無畏法雲；為餓鬼處，雨正希望法雲；悉令眾生向賢聖門，充滿法界。",
        "translation": "顯現無量無邊神力自在，普雨一切甘露法雲：為坐道場菩薩，雨平等法雲；為灌頂菩薩，雨普門法雲；為深忍菩薩，雨普莊嚴法雲；為童真菩薩，雨堅固山法雲；為不退菩薩，雨海藏法雲；為成就直心菩薩，雨普境界法雲；為方便道菩薩，雨自性地音聲法雲；為生貴菩薩，雨隨順世間法雲；為修行菩薩，雨厭離法雲；為治地菩薩，雨長養法藏法雲；為初發心菩薩，雨精進法雲；為信行者，雨無盡門法雲；為色界眾生，雨無盡平等法雲；為大梵天，雨普藏法雲；為大自在天，雨生力法雲；為魔天王，雨心幢法雲；為化樂天，雨淨念法雲；為兜率天，雨淨意法雲；為夜摩天，雨歡喜法雲；為帝釋天，雨莊嚴虛空法雲；為夜叉王，雨歡喜法雲；為乾闥婆王，雨自在圓滿法雲；為阿脩羅王，雨大境界法雲；為迦樓羅王，雨無量世界法雲；為緊那羅王，雨饒益眾生勝智法雲；為諸人王，雨不可樂法雲；為諸龍王，雨歡喜幢法雲；為摩睺羅伽王，雨寂靜法雲；為地獄眾生，雨不亂念莊嚴法雲；為諸畜生，雨智慧法雲；為閻羅王處，雨無畏法雲；為餓鬼處，雨正希望法雲；悉令眾生向賢聖門，充滿法界。",
        "source": "T09n0278_047:0696c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸如來一一毛孔，各放阿僧祇淨光明網、阿僧祇妙色、阿僧祇莊嚴、阿僧祇境界，辨阿僧祇事，充滿十方。",
        "translation": "Each of those tathāgatas' pores released a net of incalculably pure light, incalculably beautiful color, incalculably adorned, incalculably realm, and incalculably discerned phenomena that filled the ten directions.",
        "source": "T09n0278_047:0697a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎爾時，善財一心觀察海幢比丘，念彼三昧法門；思惟不可思議菩薩境界；思惟無量無作現在莊嚴普門法門；觀察法界莊嚴智慧；依佛智住，出菩薩力，建菩薩願力，增廣菩薩諸行。",
        "translation": "At the time, Shan Cai was single-mindedly observing the monk HaiChang, mindful of his samādhi approach, contemplating the unfathomable bodhisattva realm, contemplating the immeasurable, unconstructed, and presently adorned universal approach, observing the adorned wisdom of the Dharma realm, abiding based on the Buddha's wisdom, exerting bodhisattva powers, building bodhisattva vow powers, and increasing and expanding bodhisattva practices.",
        "source": "T09n0278_047:0697a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是正立觀察，一日一夜，乃至七日七夜；半月一月，乃至六月六日；過此以後，海幢比丘從三昧起。",
        "translation": "After correctly establishing and observing this for a day and a night, up to seven days and nights, and for half a month and a month, up to six months and six days, the monk Sāgaradhvaja rose from samādhi.",
        "source": "T09n0278_047:0697a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財歎未曾有，合掌白言：「甚奇。",
        "translation": "At that point, Shanzai marveled at the unprecedented, put his palms together, and said, \"How marvelous!",
        "source": "T09n0278_047:0697a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖！",
        "translation": "Great sage!",
        "source": "T09n0278_047:0697a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此三昧，最為甚深；如此三昧，最為廣大；如此三昧，境界無量；如此三昧，不可思議神力自在；如此三昧，不可稱量；如此三昧，慧光明淨；如此三昧，阿僧祇莊嚴以為莊嚴；如此三昧，境界不可壞；如此三昧，無有退轉；如此三昧，普照十方一切世界；如此三昧，具有無量義趣方便。",
        "translation": "Such samādhi is most profound; such samādhi is most vast; such samādhi has a limitless realm; such samādhi has unfathomable mastery; such samādhi is immeasurable; such samādhi is purified by the radiance of wisdom; such samādhi is adorned by incalculable adornment; such samādhi has an indestructible realm; such samādhi has no turning back; such samādhi illuminates all the worlds in the ten directions; and such samādhi has measureless methods of purposefulness.",
        "source": "T09n0278_047:0697a16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖！",
        "translation": "Great sage!",
        "source": "T09n0278_047:0697a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有菩薩入此三昧，能為一切除滅眾苦，永絕地獄、餓鬼、畜生，一切楚毒，遠離諸難；令天人趣悉得寂靜；令眾生歡喜，常樂甚深禪定境界，厭離有為，超出三界；發菩提心，長養智慧功德因緣，長養彌廣無上大悲；生大願力，照菩薩道；智慧莊嚴大波羅蜜，究竟出生大乘境界；智慧遍照普賢所行，得菩薩諸地智慧光明；具一切菩薩清淨願行，證一切智境。",
        "translation": "其有菩薩入此三昧，能為一切除滅眾苦，永絕地獄、餓鬼、畜生，一切楚毒，遠離諸難；令天人趣悉得寂靜；令眾生歡喜，常樂甚深禪定境界，厭離有為，超出三界；發菩提心，長養智慧功德因緣，長養彌廣無上大悲；生大願力，照菩薩道；智慧莊嚴大波羅蜜，究竟出生大乘境界；智慧遍照普賢所行，得菩薩諸地智慧光明；具一切菩薩清淨願行，證一切智境。",
        "source": "T09n0278_047:0697a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖！",
        "translation": "Great sage!",
        "source": "T09n0278_047:0697b02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三昧者，名為何等？」",
        "translation": "What is the name of this samādhi?\"",
        "source": "T09n0278_047:0697b02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0278_047:0697b03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三昧名普眼捨得，又名清淨光明般若波羅蜜境界，又名清淨莊嚴普門。",
        "translation": "This samādhi is called the universal eye equanimity, which is also known as the purely radiant prajñāpāramit realm and the purely adorned universal gate.",
        "source": "T09n0278_047:0697b03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0697b05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修習般若波羅蜜故，得此三昧；得此三昧時，即得百萬阿僧祇三昧。」",
        "translation": "It's because of cultivating the perfection of wisdom that you'll attain this concentration, and when you attain this concentration, you'll attain a million incalculable samādhis.\"",
        "source": "T09n0278_047:0697b05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大聖！",
        "translation": "\"Great sage!",
        "source": "T09n0278_047:0697b07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三昧，唯有此功德境界，復有餘耶？」",
        "translation": "Is this samādhi the only thing that exists in this realm of merit, and what else is there?\"",
        "source": "T09n0278_047:0697b07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0278_047:0697b08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三昧者，分別一切世界，無所障礙；究竟一切世界，無所障礙；遊行一切世界，無所障礙；莊嚴一切世界，無所障礙；修治一切世界，無所障礙；嚴淨一切世界，無所障礙；見一切佛，無所障礙；觀一切佛功德，無所障礙，知一切佛自在神力，無所障礙；究竟一切佛力，無所障礙；度一切佛功德大海，無所障礙；雨一切佛淨妙法雲，無所障礙；度一切佛法，無所障礙；得一切佛轉法輪智，不可破壞，無所障礙；得一切佛清淨大眾海之源底，無所障礙；隨順普入十方世界，無所障礙；隨順觀察十方佛法，無所障礙；大悲攝取十方眾生，無所障礙；大慈充滿十方世界，無所障礙；見十方佛，心無厭足，無所障礙；隨順遍入眾生大海，無所障礙；了知眾生一切根海，無所障礙；分別一切諸眾生海，無所障礙。",
        "translation": "此三昧者，分別一切世界，無所障礙；究竟一切世界，無所障礙；遊行一切世界，無所障礙；莊嚴一切世界，無所障礙；修治一切世界，無所障礙；嚴淨一切世界，無所障礙；見一切佛，無所障礙；觀一切佛功德，無所障礙，知一切佛自在神力，無所障礙；究竟一切佛力，無所障礙；度一切佛功德大海，無所障礙；雨一切佛淨妙法雲，無所障礙；度一切佛法，無所障礙；得一切佛轉法輪智，不可破壞，無所障礙；得一切佛清淨大眾海之源底，無所障礙；隨順普入十方世界，無所障礙；隨順觀察十方佛法，無所障礙；大悲攝取十方眾生，無所障礙；大慈充滿十方世界，無所障礙；見十方佛，心無厭足，無所障礙；隨順遍入眾生大海，無所障礙；了知眾生一切根海，無所障礙；分別一切諸眾生海，無所障礙。",
        "source": "T09n0278_047:0697b08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0697b25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此清淨光明般若波羅蜜三昧法門，云何能說諸大菩薩究竟之行？",
        "translation": "\"I only know this dharma-gate of the pure radiant perfection of wisdom, so how can I explain the ultimate practice of the great bodhisattvas?",
        "source": "T09n0278_047:0697b25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大菩薩，皆悉深入智慧大海，善能分別清淨法界；智慧究竟一切法趣，慧光無量，充滿一切；得大陀羅尼自在光明，一切三昧圓滿清淨，出生一切自在通明，深入一切無盡辯海，雷震一切諸地音聲，悉能救護一切眾生。",
        "translation": "\"All great bodhisattvas plunge into the ocean of wisdom, are well able to discern the pure Dharma realm; their wisdom reaches all Dharma destinies, and the limitless light of their wisdom fills them all; they attain great unimpeded dhāraṇī radiance, perfect and purify all samādhis, produce all unimpeded supernormal abilities, penetrate all inexhaustible seas of eloquence, thunder all the sounds of the earth, and are able to rescue all sentient beings.",
        "source": "T09n0278_047:0697b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我尚不能說彼所行，況其功德？",
        "translation": "I'm still unable to explain what they do, so why wouldn't I explain their virtues?",
        "source": "T09n0278_047:0697c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯其境界、說其境界、照其法門、明其積聚諸功德藏、說其正道諸三昧流平等智慧？",
        "translation": "What is the wisdom that reveals his realm, explains his realm, illuminates his teaching, clarifies the store of merit he has accumulated, and explains the equal wisdom of his right path's streams of samādhi?",
        "source": "T09n0278_047:0697c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0697c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方，有一住處，名曰海潮；彼有園林，名普莊嚴；有優婆夷，名曰休捨。",
        "translation": "South of here, there's a dwelling place called Haichang, and there's a grove there named Puṇyatāra and an upāsikā called Hosea.",
        "source": "T09n0278_047:0697c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問云何菩薩修菩薩道、淨菩薩道。」",
        "translation": "Go there and ask what bodhisattvas cultivate the bodhisattva path and purify the bodhisattva path.\"",
        "source": "T09n0278_047:0697c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子歡喜無量，於海幢比丘所，不堅固中而得堅固；於不實中而得真實；究竟功德妙藏境界，得明淨智，普照一切；逮得甚深三昧光明，到淨解脫；方便觀察一切世界，淨諸法門；明淨智慧，普照十方。",
        "translation": "Rejoicing immeasurably, the boy of good fortune then rejoiced as he went to the monk at Sāgarabhū and became resolute in what was not resolute; he became real in what was not real; he attained the realm of the marvelous store of ultimate merit, attained clear and pure wisdom that illuminated them all; he seized profound samādhi light that led to pure liberation; he skillfully observed all worlds and purified all dharmas; and his clear and pure wisdom illuminated them all in the ten directions.",
        "source": "T09n0278_047:0697c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頭面禮足，遶無數匝，眷仰觀察，辭退南行。",
        "translation": "He bowed his head with his feet, circled around measurelessly, paid respect to and observed them, and withdrew to go south.",
        "source": "T09n0278_047:0697c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎爾時，善財童子正念思惟海幢比丘，心未曾捨，樂見無厭，顧戀聖音，目想慈顏；正念思惟其心境界、三昧境界、願行境界；正念思惟明淨智慧，敬善知識，向善知識，念善知識教；於善知識起愛恭敬。",
        "translation": "At the time, the boy of good fortune correctly contemplated the monk Sāgaradhvaja, whose mind had never been indifferent, whose pleasure in seeing was unweakening, whose longing for the holy voice, and whose eyes contemplated a kind face; correctly contemplated the sphere of his mind, the sphere of samādhi, and the sphere of his vows; correctly contemplated clear and pure wisdom; honored the good friend, looked up to the good friend, remembered the good friend's teaching; and arouse affection and respect for the good friend.",
        "source": "T09n0278_047:0697c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又作是念：「因善知識，得見諸佛。",
        "translation": "They also think, \"It's because of good teachers that they've been able to see the buddhas.",
        "source": "T09n0278_047:0697c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者，開示顯現一切佛法；善知識者，是奇特法，令人得見諸佛法故；善知識者，為明淨眼，令人見佛如虛空故；善知識者，為善津濟，令人於佛華池，得源底故。」",
        "translation": "A good teacher is someone who reveals and shows all the Buddha's teachings; a good teacher is a marvelous teaching that makes it possible to see the Buddha's teachings; a good teacher is the clear and pure eye that makes it possible to see the Buddha as space; and a good teacher is a good aid that makes it possible to reach the bottom of the Buddha's flower pool.\"",
        "source": "T09n0278_047:0697c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸漸南行，至海潮處，見普莊嚴園林；七寶垣牆，周匝圍遶；諸妙寶樹，行列莊嚴；一切華樹，雨華如雲，布散其地；香樹芬馨，普熏十方；鬘樹垂鬘，寶樹雨寶，遍布莊嚴；眾寶衣樹，彌覆一切；諸音樂樹，出微妙音；以如是等諸珍玩具，而以莊嚴。",
        "translation": "He gradually traveled south to the ocean tide and saw a park filled with ornamented groves surrounded by a wall of seven treasures, adorned by a procession of marvelously jeweled trees, scattered like clouds of flowers from all the flowering trees, fragrant incense trees that perfume the whole world, garland trees that drape their garlands and jeweled trees that rain down their treasures, covered by a multitude of precious garments, and music trees that emit marvelous sounds and adorned with such treasures as these.",
        "source": "T09n0278_047:0697c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此園林中，有一萬講堂，眾寶合成；一萬樓閣，閻浮檀金以覆其上；一萬宮殿，毘樓遮那寶藏莊嚴。",
        "translation": "In this grove are 10,000 lecture halls made of various treasures, 10,000 mansions covered with gold from the river running through them, and 10,000 palaces adorned with a treasure house from Virūḍhaka.",
        "source": "T09n0278_047:0697c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一萬浴池，眾寶合成；七寶欄楯，周匝圍遶；八功德水，湛然盈滿；閻浮檀金沙，淨水寶珠，遍布池底；四面寶階，端嚴齊正；寶多羅樹，周匝行列；鳧、雁、鴛鴦、孔雀、哀鸞，異類眾鳥，遊戲其中；出和雅音，覆以金網；風自然起，出微妙聲；設眾寶帳，寶樹周遍。",
        "translation": "There are 10,000 bathing pools made of many treasures, surrounded by a fence of seven jewels, overflowing with the water of eight excellent qualities, filled with gold sand and the precious pearl of pure water, spread out over the bottom of the pools, surrounded by a flight of jewels on all sides, and surrounded by a row of jeweled tārā trees, in which ducks, geese, mandarin ducks, peacocks, mourning luan, and birds of various kinds play, making harmonious sounds and covered with a golden net, producing a subtle sound when the wind arises naturally, and setting up many jeweled tents and surrounding them with jeweled trees.",
        "source": "T09n0278_047:0698a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "建阿僧祇殊勝寶幢，放大光明，照百由旬百萬池沼；黑栴檀泥凝積池底；生寶蓮華，充滿其中；從彼蓮華，出大光明，普照一切。",
        "translation": "They build a banner of incalculable, extraordinary treasures that shines brightly, illuminating a million ponds in a hundred leagues; black sandalwood clay coagulates at the bottom of the pond; a jeweled lotus arises and fills it; from that lotus comes a great radiance that shines everywhere.",
        "source": "T09n0278_047:0698a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼園林中，有大宮殿，名莊嚴幢；海藏妙寶，以為其地；瑠璃寶柱，莊嚴殊妙，巍巍高大，猶若金山；眾生見者，無不喜樂。",
        "translation": "In that grove there's a great palace called the Ornament Banner, an ocean of marvelous treasures that serves as its ground, and jeweled pillars of beryl that are ornamented and marvelous, so lofty and large they look like gold mountains; when sentient beings see them, they are delighted.",
        "source": "T09n0278_047:0698a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有阿僧祇淨摩尼寶，普照一切；出自然香，謂：明相香、香王香、覺悟香等，敷眾寶座，謂：蓮華藏座、照諸方藏座、明淨藏座、眾生悅樂藏座、師子藏座、離垢寶藏座、不思議藏座、普門摩尼妙寶藏座、光嚴藏座、大海藏座、金剛師子藏座；無量窓牖，妙寶莊飾。",
        "translation": "There are incalculably pure maṇi treasures that shine universally, natural fragrances that emanate from them, such as the fragrance of illumination, the fragrance of the king of fragrances, and the fragrance of enlightenment, and the spread out of jeweled seats, such as the lotus treasury seat, the treasury seat that illuminates all directions, the bright and pure treasury seat, the treasury seat that pleases sentient beings, the lion's seat, the jeweled seat that's free from pollution, the inconceivable treasury seat, the marvelous jeweled treasury seat of the universal maṇi, the luminous and adorned treasury seat, the great ocean treasury seat, and the vajra lion's treasury seat, as well as measureless windows adorned with marvelous treasures.",
        "source": "T09n0278_047:0698a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又張一萬眾妙寶帳，謂：寶衣帳、妙寶華帳、寶樹枝帳、摩尼寶帳、金帳、莊嚴帳、香帳、娛樂帳、自在龍王帳、馬王帳、釋天莊嚴寶帳；一萬寶網，絞絡其上，謂：金鈴網、珍寶蓋網、眾寶像網、海藏珠網、青瑠璃摩尼寶網、師子吼網、月摩尼網、香像網、眾寶山網、寶王網；一萬光明，普照世界，謂：夜光摩尼光明、日藏摩尼淨寶光明、月幢摩尼妙寶光明、香焰光明、妙藏摩尼寶光明、鉢曇摩光明、夜光摩尼淨寶光明、大燈摩尼淨寶光明、普照諸方摩尼光明。",
        "translation": "又張一萬眾妙寶帳，謂：寶衣帳、妙寶華帳、寶樹枝帳、摩尼寶帳、金帳、莊嚴帳、香帳、娛樂帳、自在龍王帳、馬王帳、釋天莊嚴寶帳；一萬寶網，絞絡其上，謂：金鈴網、珍寶蓋網、眾寶像網、海藏珠網、青瑠璃摩尼寶網、師子吼網、月摩尼網、香像網、眾寶山網、寶王網；一萬光明，普照世界，謂：夜光摩尼光明、日藏摩尼淨寶光明、月幢摩尼妙寶光明、香焰光明、妙藏摩尼寶光明、鉢曇摩光明、夜光摩尼淨寶光明、大燈摩尼淨寶光明、普照諸方摩尼光明。",
        "source": "T09n0278_047:0698a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又出十種大香電光，雨十種雲，出過諸天；謂：十種黑栴檀雲、十種曼陀羅華雲、十種莊嚴雲、十種鬘雲、十種雜色衣雲、十種寶雲、十種天子雲、十種天女雲、十種菩薩雲；常樂聞法。",
        "translation": "Ten kinds of great incense and lightning rays also emanate, and ten kinds of clouds rain down that transcend the heavens, namely, ten kinds of black sandalwood clouds, ten kinds of mandarin flower clouds, ten kinds of adornment clouds, ten kinds of garland clouds, ten kinds of variegated clothing clouds, ten kinds of treasure clouds, ten kinds of celestial child clouds, ten kinds of celestial woman clouds, and ten kinds of bodhisattva clouds; they're always happy to hear the Dharma.",
        "source": "T09n0278_047:0698b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，休捨優婆夷處金色藏座，海藏寶莊嚴網羅覆其身；吉由羅莊嚴，出過諸天；大摩尼網，莊嚴其首；師子珠寶，無量如意，淨摩尼寶，嚴飾其身；無量億眾，恭敬圍遶，合掌而住。",
        "translation": "At the time, Upāsikā Āśāsaka was sitting on a golden treasury throne, covered by an ornate net of ocean treasures; adorned by a jeweled kiyūra that rose above the gods; adorned with a large mani net at its head; adorned with a body adorned with lion's beads and jewelry, measureless wishes, and pure mani treasures; and surrounded by measureless millions of people who held their palms together in respect.",
        "source": "T09n0278_047:0698b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方無量眾生，諸梵天王，梵身大梵，梵輔他化，自在天王，乃至人及非人，一切諸王，來詣其所；南、西、北方，四維，上、下，亦復如是。",
        "translation": "Measureless sentient beings in the east, Brahmā gods, Brahmakāyika gods, Brahmakāyika gods, Paranirmita-vaśavartin gods, even humans and non-humans, all kings, come to visit him, as do the south, west, north, the four counterpoints, and the upper and lower [realms].",
        "source": "T09n0278_047:0698b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得見此優婆夷者，一切眾病皆悉除愈；心淨離垢，拔邪見刺，除滅障礙，淨無礙地。",
        "translation": "Anyone who meets this Upāsikā will be cured of all their ills, their mind purified and freed from defilement, the thorns of wrong views removed, and the obstacles removed, purifying the unobstructed ground.",
        "source": "T09n0278_047:0698b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼地中，長養善根，成就諸根，方便攝一切智，一切陀羅尼門、一切三昧門，皆現在前，發一切願門，究竟一切行門，出生一切淨門；其心廣大，出生一切，通得無礙身，靡所不至。",
        "translation": "In that state, he nurtures good roots, accomplishes them, skillfully collects all cognition, makes known all the dhāraṇī entries and all the samādhi entries, arouses all vows, accomplishes all practices, produces all pure entries, and has a mind so vast that it produces them all and has access to an unobstructed body that nothing is left untouched.",
        "source": "T09n0278_047:0698b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子入普莊嚴園林，周遍觀察，見休捨優婆夷，處金色座；往詣其所，頭面禮足，遶無數匝，白言：「大聖！",
        "translation": "At the time, the Boy of Wealth entered the Ornament Grove and looked around, and he saw Upāsikā Āśāsī sitting on his golden seat.",
        "source": "T09n0278_047:0698b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行、修菩薩道，唯願為我具足演說。」",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path, so please explain it in detail for me.\"",
        "source": "T09n0278_047:0698b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "He replied, \"Good sons!",
        "source": "T09n0278_047:0698b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯成就一法門，若見聞、念知、親近我者，皆悉不虛。",
        "translation": "I've accomplished only one teaching, and if you see and hear it, mindfully know it, or come close to me, it's all true.",
        "source": "T09n0278_047:0698b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0698b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生不種善根，不親近善知識，不為諸佛所護念者，彼諸眾生不能見我。",
        "translation": "\"If there are sentient beings who don't plant good roots, don't get close to good teachers, and don't guard the mind of the buddhas, those sentient beings won't be able to see me.",
        "source": "T09n0278_047:0698b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0698b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生能見我者，則於阿耨多羅三藐三菩提，得不退轉。",
        "translation": "\"If there are sentient beings who see me, then they will attain unsurpassed, correct enlightenment and not turn back.",
        "source": "T09n0278_047:0698b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方諸佛常來我所，處寶師子座，為我說法；南、西、北方，四維，上、下，一切諸佛悉來我所，處寶師子座，為我說法。",
        "translation": "The buddhas of the east always come to me, sit on my jeweled lion's seat, and teach for me, and all the buddhas of the south, west, north, four counterpoints, upper, and lower come to me, sit on my jeweled lion's seat, and teach for me.",
        "source": "T09n0278_047:0698b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0698c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常見諸佛菩薩，未曾遠離。",
        "translation": "I've often seen buddhas and bodhisattvas, and I've never been far from them.",
        "source": "T09n0278_047:0698c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0698c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此大眾，有八萬四千億菩薩，皆我同行，於阿耨多羅三藐三菩提得不退轉；此普莊嚴園林一切眾會，亦於阿耨多羅三藐三菩提得不退轉。」",
        "translation": "Here in this great assembly, there are eighty-four hundred billion bodhisattvas who are my companions and have attained irreversibility in the unsurpassed, correct, and complete enlightenment, and all the assembled people in this universally adorned forest have also attained irreversibility in the unsurpassed, correct, and complete enlightenment.\"",
        "source": "T09n0278_047:0698c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「大聖！",
        "translation": "Sunetra said, \"Great sage!",
        "source": "T09n0278_047:0698c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發菩提心來，為久如耶？」",
        "translation": "Is it for a long time that you have aroused the intention to achieve enlightenment?\"",
        "source": "T09n0278_047:0698c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "They replied, \"Good sons!",
        "source": "T09n0278_047:0698c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念過去於錠光佛所，出家求道，淨修梵行，恭敬供養，聞法受持；次於離垢佛所，出家求道，淨修梵行，恭敬供養，聞法受持；次於妙幢佛、妙德佛、功德藏佛、毘樓遮那佛、普眼佛、梵壽佛、自在佛、善天佛。",
        "translation": "I remember that in the past, I went to the Dīpaṃkara Buddha, left home, sought the path, cultivated a pure religious practice, made offerings with respect, and heard and upheld the teaching; next, I went to the Vimalakīrti Buddha, left home, sought the path, cultivated a pure religious practice, made offerings with respect, and heard and upheld the teaching; and next, I went to the Dharma-banner Buddha, Dharma-virtue Buddha, Merit-Store Buddha, Virūḍhaka Buddha, Vairocana Buddha, Universal Vision Buddha, Brahmā Life Buddha, Śubhavyūha Buddha, and Śubhavyūhavyūha Buddha.",
        "source": "T09n0278_047:0698c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0698c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於如是等三十六恒河沙佛所，出家求道，淨修梵行，恭敬供養，聞法受持，了知一切諸佛智慧。",
        "translation": "At these thirty-six buddhas of the Ganges, I left home to pursue the path, purify my religious practice, venerate and make offerings, hear and retain the teaching, and understand the wisdom of all the buddhas.",
        "source": "T09n0278_047:0698c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初發菩薩心，充滿法界，無量大悲攝取眾生；發諸菩薩無量大願，究竟十方法界，無量大悲普覆眾生。",
        "translation": "When I first aroused the bodhisattva mind, it filled the Dharma realm with measureless great compassion as it collected sentient beings; when I aroused the bodhisattvas' measureless great vow, it reached the ten Dharma realms with measureless great compassion and covered all sentient beings.",
        "source": "T09n0278_047:0698c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切剎、一切劫中，修習菩薩無量諸行、無量三昧力，不捨不轉菩薩正道；菩薩無量陀羅尼力，善能護持一切眾生；菩薩無量淨智慧力，方便正念，普照三世；菩薩無量諸通明力，遍遊一切諸世界網；菩薩無量諸辯才力，能以一言悅一切眾。",
        "translation": "In all buddhas and all eons, they cultivate the bodhisattva's measureless practices and measureless samādhi powers, never abandoning or changing the bodhisattva's right path; the bodhisattva's measureless dhāraṇī powers, which skillfully safeguard all sentient beings; the bodhisattva's measureless pure wisdom powers, which skillfully and correctly recall and universally illuminate the three worlds; the bodhisattva's measureless powers of insight, which traverse the entire web of worlds; and the bodhisattva's measureless eloquence, which can please all sentient beings with a single word.",
        "source": "T09n0278_047:0698c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0698c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我有菩薩無量自在神力，能以一身滿一切剎。」",
        "translation": "I have the measureless, unimpeded spiritual powers of a bodhisattva who can fill all the buddhas with a single body.\"",
        "source": "T09n0278_047:0698c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「大聖！",
        "translation": "Shanzai said, \"Great sage!",
        "source": "T09n0278_047:0698c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久如當成阿耨多羅三藐三菩提？」",
        "translation": "Is it possible that you will attain supreme perfect enlightenment in the future?\"",
        "source": "T09n0278_047:0698c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0278_047:0698c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩不為教化一眾生故，發菩提心；不為教化百眾生，乃至不為教化不可說不可說轉眾生故，發菩提心；廣說如阿僧祇品，不為教化一世界眾生故，發菩提心；乃至不為教化不可說不可說世界眾生故，發菩提心；不為教化閻浮提微塵等眾生故，不為教化三千大千世界微塵等眾生故，乃至不為教化不可說不可說三千大千世界微塵等眾生故，發菩提心；菩薩不為恭敬供養一如來故，發菩提心；乃至不為恭敬供養不可說不可說諸如來故，發菩提心；菩薩不為淨一剎故，發菩提心；乃至不為淨不可說不可說剎故，發菩提心；菩薩不為淨閻浮提微塵等剎故，發菩提心；乃至不為淨不可說不可說三千大千世界微塵等剎故，發菩提心；菩薩不為護持一佛法故，發菩提心；廣說如上，菩薩不為滿一願故，發菩提心；不為莊嚴一剎故、不為知一佛眷屬故、不為受持一佛法故、不為知一眾生心海故、不為度一眾生根海故、不為知一世界諸劫次第成敗故、不為知一眾生煩惱習氣故、不為斷一眾生煩惱故、不為滿一眾生行故，發菩提心；欲教化一切眾生故，發菩提心；欲恭敬供養一切諸佛、欲嚴淨一切佛剎、欲守護受持一切佛法、欲滿足一切大願、欲知一切佛眷屬、欲知一切眾生心海、欲知一切眾生心心所行、欲知一切眾生諸根輪、欲知一切世界一切劫數次第成敗、欲知一切眾生煩惱習氣、欲斷一切眾生煩惱、欲滿一切眾生行故，發菩提心。",
        "translation": "菩薩不為教化一眾生故，發菩提心；不為教化百眾生，乃至不為教化不可說不可說轉眾生故，發菩提心；廣說如阿僧祇品，不為教化一世界眾生故，發菩提心；乃至不為教化不可說不可說世界眾生故，發菩提心；不為教化閻浮提微塵等眾生故，不為教化三千大千世界微塵等眾生故，乃至不為教化不可說不可說三千大千世界微塵等眾生故，發菩提心；菩薩不為恭敬供養一如來故，發菩提心；乃至不為恭敬供養不可說不可說諸如來故，發菩提心；菩薩不為淨一剎故，發菩提心；乃至不為淨不可說不可說剎故，發菩提心；菩薩不為淨閻浮提微塵等剎故，發菩提心；乃至不為淨不可說不可說三千大千世界微塵等剎故，發菩提心；菩薩不為護持一佛法故，發菩提心；廣說如上，菩薩不為滿一願故，發菩提心；不為莊嚴一剎故、不為知一佛眷屬故、不為受持一佛法故、不為知一眾生心海故、不為度一眾生根海故、不為知一世界諸劫次第成敗故、不為知一眾生煩惱習氣故、不為斷一眾生煩惱故、不為滿一眾生行故，發菩提心；欲教化一切眾生故，發菩提心；欲恭敬供養一切諸佛、欲嚴淨一切佛剎、欲守護受持一切佛法、欲滿足一切大願、欲知一切佛眷屬、欲知一切眾生心海、欲知一切眾生心心所行、欲知一切眾生諸根輪、欲知一切世界一切劫數次第成敗、欲知一切眾生煩惱習氣、欲斷一切眾生煩惱、欲滿一切眾生行故，發菩提心。",
        "source": "T09n0278_047:0698c25_12",
        "is_bad_quality": true
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0699a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略說菩薩有如是等百萬阿僧祇方便法門，菩薩悉應究竟了知，隨順智慧；究竟修習菩薩等行，淨一切佛剎，心無倒惑。",
        "translation": "It's briefly explained that bodhisattvas have these millions of incalculable methods and teachings that bodhisattvas should thoroughly know, follow with wisdom, and thoroughly cultivate bodhisattva practices such as these to purify all buddha bases and prevent mental disturbances.",
        "source": "T09n0278_047:0699a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0699b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，我發此願，淨一切剎，我願乃滿；斷一切眾生煩惱習氣，我願乃滿。」",
        "translation": "Therefore, I have made this vow, and it will be the fulfillment of my vow to purify all the buddhas and to end the afflictive karmic impressions of all sentient beings.\"",
        "source": "T09n0278_047:0699b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大聖！",
        "translation": "\"Great sage!",
        "source": "T09n0278_047:0699b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法門者，名為何等？」",
        "translation": "What is the name of this dharma-gate?\"",
        "source": "T09n0278_047:0699b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0278_047:0699b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法門名離憂安隱幢。",
        "translation": "\"This dharma-gate is called the banner of freedom from sorrow and tranquility.",
        "source": "T09n0278_047:0699b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此法門，諸大菩薩其心如海，悉能容受一切佛法，我當云何能知其行？",
        "translation": "I only know this dharma-gate, and how can I know the practice of great bodhisattvas whose minds are like oceans and who are fully capable of accepting all the Buddha's teachings?",
        "source": "T09n0278_047:0699b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩心堅固正直，如須彌山；諸大菩薩，則為見藥，若有見者，除滅煩惱；諸大菩薩，則為淨日，除滅一切眾生癡闇；諸大菩薩，則為大地，悉能載持一切眾生；諸大菩薩，則為智風，長養一切眾生實義；諸大菩薩，則為自在，以淨智光普照一切；諸大菩薩，則為慶雲，隨其所應，雨甘露法；諸大菩薩，則為淨月，放諸功德光明之網；諸大菩薩，則為帝釋，悉能守護一切眾生。",
        "translation": "諸菩薩心堅固正直，如須彌山；諸大菩薩，則為見藥，若有見者，除滅煩惱；諸大菩薩，則為淨日，除滅一切眾生癡闇；諸大菩薩，則為大地，悉能載持一切眾生；諸大菩薩，則為智風，長養一切眾生實義；諸大菩薩，則為自在，以淨智光普照一切；諸大菩薩，則為慶雲，隨其所應，雨甘露法；諸大菩薩，則為淨月，放諸功德光明之網；諸大菩薩，則為帝釋，悉能守護一切眾生。",
        "source": "T09n0278_047:0699b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當云何能知其行？",
        "translation": "How will I be able to know what they're doing?",
        "source": "T09n0278_047:0699b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0699b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方，有一國土，名曰海潮；彼有仙人，名毘目多羅，善能解說菩薩諸行，汝詣彼問。」",
        "translation": "South of here there's a land called Kālacakra, and there's an immortal there named Vimuktaghosa who's good at explaining the bodhisattva's practices; go there and ask about them.\"",
        "source": "T09n0278_047:0699b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頭面禮足，遶無數匝，觀察無厭，悲泣流淚，正念思惟：「得菩提難、遇善知識難、得與上人共同止難、得菩薩諸根難、滿足菩薩正直心難、值遇同意善知識難、觀真實難、如法正教難、出生妙心難、念一切智難、長養法明難。」",
        "translation": "The boy of good fortune then bowed his head to his feet, circled him for countless turns, observed without tire, wept with pity, and correctly reflected, \"It's difficult to attain enlightenment, difficult to meet a good teacher, difficult to work with a superior person, difficult to attain the bodhisattva's faculties, difficult to fulfill the bodhisattva's right mind, difficult to meet a good teacher who agrees, difficult to examine the truth, difficult to follow the correct teaching of the Dharma, difficult to give rise to a marvelous mind, difficult to remember omniscience, and difficult to nurture the Dharma's insight.\"",
        "source": "T09n0278_047:0699b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，辭退南行。",
        "translation": "After he had this thought, he withdrew and went south.",
        "source": "T09n0278_047:0699b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子思惟隨順菩薩正教，淨菩薩行，心能長養菩薩德力；心見諸佛；心欲菩提；心能發起長養大願；心照十方一切諸法；心見法實；心覆一切，無有散亂；心淨智慧，觀諸法界，除滅癡闇；心淨正直，除滅障礙；心能降伏一切眾魔。",
        "translation": "At the time, the boy of good fortune contemplated that by following the bodhisattva's correct teaching and purifying bodhisattva practices, his mind could nurture the bodhisattva's virtue and strength; his mind saw the buddhas; his mind desired to achieve enlightenment; his mind could generate the great vow to nurture; his mind illuminated all the dharmas in the ten directions; his mind saw the reality of dharmas; his mind covered them all without distraction; his mind was pure and wise, observed the Dharma realm, and removed delusion and darkness; his mind was pure and upright, and removed obstacles; and his mind could subdue all the Māras.",
        "source": "T09n0278_047:0699b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸漸遊行，至海潮國，周遍推求仙人毘目多羅。",
        "translation": "He gradually marched to the land of Tidal Wave and searched everywhere for the sage Vimuktaghosa.",
        "source": "T09n0278_047:0699b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人在大林中；阿僧祇樹莊嚴此林，寶葉普覆；諸華果樹，常以嚴飾；寶樹雨寶，遍散其地；大栴檀樹，周匝行列；諸沈水樹，常出妙香；尼拘律樹、閻浮檀樹，雨甘香果；優鉢羅、鉢曇摩、分陀利華，以為莊嚴。",
        "translation": "That sage was in a large forest decorated by incalculable trees that were covered with precious leaves, flowering fruit trees that were always adorned, jeweled trees that rained down treasure and scattered it everywhere, large sandalwood trees that were surrounded by rows, submerged water trees that always produced a wonderful fragrance, nyagrodha and jambū trees that rained down sweet-smelling fruit, and upādhara, padma, and puṇḍarī flowers that adorned him.",
        "source": "T09n0278_047:0699c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財見彼仙人在此林中，服樹皮衣，縈髮草坐；一萬仙人以為眷屬，如栴檀林，栴檀圍遶。",
        "translation": "It was then that Shan Cai saw this sage in this forest, dressed in bark robes, sitting with his hair tangled in grass, and 10,000 sages as his retinue, surrounded by sandalwood like a forest of sandalwood.",
        "source": "T09n0278_047:0699c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往詣其所，五體敬禮：「念善知識，能開導我薩婆若門；念善知識，現真實道；念善知識，能安置我一切智地；念善知識，然智寶燈，明淨慧光，長養十力智慧光明；善知識道，即一切智無盡之藏。",
        "translation": "He went to them and paid homage with five bodies, \"Remembering the good teacher who guides me through the gate of sarvajña, remembering the good teacher who shows me the true path, remembering the good teacher who places me in the ground of omniscience, remembering the good teacher who is a lamp of wisdom treasures, a bright and pure light of wisdom that nourishes the brightness of the ten powers of wisdom, and remembering the good teacher whose path is the inexhaustible store of omniscience.",
        "source": "T09n0278_047:0699c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識為燈，照一切智境界故；善知識為橋，度生死故；善知識為蓋，生大慈力，覆一切故；善知識為不虛，照一切法真實相故；善知識為海潮，滿足大悲故。」",
        "translation": "A good teacher is a lamp that illuminates all the realms of cognition, a good teacher is a bridge that liberates from birth and death, a good teacher is a lid that produces the power of great kindness to cover them all, a good teacher is not false that illuminates the true characteristics of all dharmas, and a good teacher is a tidal wave that fulfills great compassion.\"",
        "source": "T09n0278_047:0699c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，遶無數匝，合掌而立，白言：「大聖！",
        "translation": "After he had this thought, he circled around measureless times, put his palms together, and stood up, saying, \"Great sage!",
        "source": "T09n0278_047:0699c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行、修菩薩道。」",
        "translation": "I had first aroused the mind of unsurpassed, correct enlightenment, but I didn't know how a bodhisattva trains in the bodhisattva practices and cultivates the bodhisattva path.\"",
        "source": "T09n0278_047:0699c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人觀察大眾，而作是言：「汝等當知此童子者，已發阿耨多羅三藐三菩提心，請一切眾生，普施無畏，饒益一切眾生；向深智海，欲飲一切諸佛法雨；欲盡一切法海源底；欲成世間智慧大海；欲興大悲重雲；欲雨甘露法雨；欲出世間明淨智月；欲滅世間諸煩惱闇；欲長養一切眾生善根。」",
        "translation": "The recluse then observed the crowd and said, \"You should know that this boy has aroused the mind of unsurpassed, correct enlightenment, invited all sentient beings, universally bestowed fearlessness, benefited all sentient beings, gone deep into the ocean of wisdom, and wants to drink the rain of all the buddhas' teachings; wants to exhaust the source of the ocean of all teachings; wants to form a great ocean of worldly wisdom; wants to create a heavy cloud of great compassion; wants to rain the Dharma rain of sweet dew; wants to emit the moon of worldly clarity and wisdom; wants to extinguish the darkness of worldly afflictions; and wants to nurture the good roots of all sentient beings.\"",
        "source": "T09n0278_047:0699c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大眾各持種種金色妙華，香可悅樂，散童子上；頭面禮足，曲躬敬遶，作如是言：「此童子者，悉能救護一切眾生，滅三惡道，離閻羅趣一切諸難；消竭欲海，除滅苦陰，捨愚癡闇，斷貪愛縛；能昇功德金剛圍山，建立世間智慧須彌，於世間出明淨智日，顯曜一切善根諸法、示導世間明識善惡。」",
        "translation": "At that point, the whole crowd carried a variety of golden flowers with pleasant fragrances and scattered them on top of the boy, bowed their heads and feet, bent their backs in respect, and said, \"This boy is able to rescue all sentient beings, cease the three bad destinies, escape all the difficulties of the jhāna destiny, dry up the ocean of desire, cease the aggregate of suffering, abandon the darkness of ignorance, cut the bonds of craving, ascend the mountain of the adamantine circle of merit, establish the Sumeru of worldly wisdom, produce the sun of clear and pure wisdom in the world, reveal all the Dharma of good roots, and instruct the world in the good and bad aspects of consciousness.\"",
        "source": "T09n0278_047:0699c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人告大眾言：「若有能發阿耨多羅三藐三菩提心者，得一切智，淨一切佛功德之地。」",
        "translation": "Then, that sage addressed the crowd, \"If someone can arouse the mind of unsurpassed, correct enlightenment, they'll attain omniscience and purify the grounds of all the Buddha's attributes.\"",
        "source": "T09n0278_047:0700a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人告善財言：「善男子！",
        "translation": "Then, that sage addressed Shanzai, saying, \"Good sons!",
        "source": "T09n0278_047:0700a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已成就菩薩無壞幢智慧法門。」",
        "translation": "I've accomplished the bodhisattva's wisdom teaching of the indestructible banner.\"",
        "source": "T09n0278_047:0700a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「大聖！",
        "translation": "Sunetra said, \"Great sage!",
        "source": "T09n0278_047:0700a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼法門者，境界云何？」",
        "translation": "What is the objective realm of that dharma-gate?\"",
        "source": "T09n0278_047:0700a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人即申右手，摩善財頂；摩已，執善財手。",
        "translation": "That sage then put his right hand on Shan Cai's head and, after rubbing it, took Shan Cai's hand.",
        "source": "T09n0278_047:0700a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時，善財自見其身，在於十方十佛世界微塵等佛所，見彼諸佛，相好莊嚴，以阿僧祇寶珍玩之具，莊嚴其剎。",
        "translation": "Immediately, Shan Cai saw himself in the company of ten dusty buddhas of the ten buddha-worlds in ten directions and saw those buddhas, resplendent in appearance, adorning their bases with treasures and playthings that were incalculable.",
        "source": "T09n0278_047:0700a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見彼佛眷屬大海，所從聞法，悉能受持，乃至不失一句一味，分別受持正法梵輪，受諸法雲，入佛大願，淨修諸力，清淨願行，究竟諸功德藏。",
        "translation": "They also see a vast ocean of their retinues, all of whom are able to retain the teachings they've heard, even down to the point where they don't lose a single word or taste, discern and uphold the brahma wheel of the true teaching, receive clouds of teachings, enter the Buddha's great vows, purify their powers, purify their vows and conduct themselves, and ultimately store up all their merits.",
        "source": "T09n0278_047:0700a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見彼諸佛，隨應化度一切眾生，見一切佛，清淨圓滿大光明網。",
        "translation": "Seeing those buddhas, they follow their transformation to save all sentient beings and see all buddhas as pure, complete, and great nets of light.",
        "source": "T09n0278_047:0700a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已，隨順無礙智慧光明，究竟佛力；或自見身於一佛所，一日一夜；或復自見於餘佛所，七日七夜。",
        "translation": "After seeing them, he follows the unobstructed light of wisdom and the ultimate Buddha power, either seeing himself in one Buddha's place for a day or a night or seeing himself in another Buddha's place for seven days or nights.",
        "source": "T09n0278_047:0700a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是次第於餘佛所，或有半月、一月，一歲、百歲、千歲；或百千歲、百千億歲；或百億那由他歲；或半劫、一劫、百劫、千劫、百千劫；或百億那由他劫，乃至不可說不可說那由他劫；或閻浮提微塵等劫，乃至不可說不可說世界微塵等劫。",
        "translation": "In this order, there might be another half-moon or month, a year, a hundred years, or a thousand years, or a hundred thousand years or a hundred billion years, or ten billion nayutas, or half an eon, an eon, a hundred eons, a thousand eons, or ten thousand thousand eons, or ten billion nayutas, or even an inexplicable and ineffable nayutas, or an eon as minute as that of Jambudvīpa, or an eon as minute as that of the ineffable and ineffable world.",
        "source": "T09n0278_047:0700a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財為無壞幢智慧法門照故，得明淨藏三昧；無盡法門三昧照故，得遊一切方陀羅尼光明；金剛圓滿光明法門照故，得分別智意樓閣三昧，住平地莊嚴法藏；般若波羅蜜精進照故，得佛虛空藏三昧光明；一切諸佛法輪三昧光明相照故，得三世圓滿智無盡光明。",
        "translation": "At the time, Sun Cai attained the samādhi of the bright and pure store because the Dharma gate of the wisdom of the indestructible banner shone through; the dhāraṇī of the inexhaustible Dharma gate shone through, and he attained the dhāraṇī of the tour of all directions; the samādhi of the tower of distinct wisdom and the Dharma store of the adorned flat earth because the Dharma gate of the perfect light of the vajras shone through; the samādhi of the Ābhāsvara store shone through because of the exertion of the perfection of wisdom; and the inexhaustible light of the wisdom of the three times because the samādhi of the Dharma wheels of all the buddhas shone through.",
        "source": "T09n0278_047:0700a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人放善財手；爾時，善財即自見身還在本處。",
        "translation": "When that sage released Sun Cai's hand, Sun Cai then saw himself returning to his original spot.",
        "source": "T09n0278_047:0700b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人問善財言：「汝憶念耶？」",
        "translation": "The sage then asked Shan Cai, \"Do you remember that?\"",
        "source": "T09n0278_047:0700b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「唯然。",
        "translation": "They replied, \"Only so.",
        "source": "T09n0278_047:0700b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖善知識力故。」",
        "translation": "It's because of the power of a great noble and good teacher.\"",
        "source": "T09n0278_047:0700b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T09n0278_047:0700b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此菩薩無壞幢智慧法門，我豈能知大菩薩行？",
        "translation": "I only know this bodhisattva's wisdom teaching of the indestructible banner, but how could I know the practices of a great bodhisattva?",
        "source": "T09n0278_047:0700b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大菩薩，皆得一切眾生自在三昧，於一切時輪而得自在；出生諸佛無盡智慧，證一切佛，嚴淨慧燈；於一念中，了三世事；於一切世間，現淨慧身，充滿法界，隨眾生所應，悉現其前；了知一切眾生所行，圓滿清淨，悉可愛樂。",
        "translation": "\"Great bodhisattvas attain the samādhi of mastery over all sentient beings, attain mastery over all time turns, give rise to the endless wisdom of the buddhas, realize all buddhas, and adorn the lamp of pure wisdom; in a single thought, they comprehend the affairs of the three worlds; in all worlds, they present a body of pure wisdom that fills the Dharma realm and appears before sentient beings as they should; and they understand the practices of all sentient beings, which are perfectly pure and thoroughly enjoyable.",
        "source": "T09n0278_047:0700b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我豈能知大菩薩行，妙功德願，嚴淨佛剎，善察論機，智慧境界；甚深三昧，神力自在，解脫境界；遊戲神通，法身音聲，究竟智慧？",
        "translation": "How could I know the great bodhisattva practices, marvelously meritorious vows, adorned and purified buddha bases, well discerned opportunities for discourse, and the realm of wisdom; the profound samādhi, unimpeded supernormal powers, and the realm of liberation; and the marvelous powers of play, the voice of the Dharma body, and ultimate wisdom?",
        "source": "T09n0278_047:0700b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等事，非我境界。",
        "translation": "Such things are not my objective realm.",
        "source": "T09n0278_047:0700b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0700b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方，有一國土，名曰進求；有婆羅門，名方便命。",
        "translation": "South of here, there's a land called Sugatacetanā, and there's a brāhmaṇa called expedient livelihood.",
        "source": "T09n0278_047:0700b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問云何菩薩向菩薩道，修菩薩道。」",
        "translation": "Go there and ask how the bodhisattvas are headed toward the bodhisattva path and cultivate it.\"",
        "source": "T09n0278_047:0700b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子歡喜無量，恭敬禮已，遶無數匝，瞻仰觀察，辭退南行。",
        "translation": "The boy of skillful livelihood then rejoiced immeasurably, paid homage with respect, circled him for countless turns, looked up, and observed him as he withdrew to the south.",
        "source": "T09n0278_047:0700b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎爾時，善財童子為無壞幢智慧法門所照，決了諸佛不可思議自在神力，善知菩薩不可思議法門。",
        "translation": "At the time, the boy of good fortune was illuminated by the Dharma gate of the wisdom of the indestructible banner, and he was certain of the inconceivable sovereignty of the buddhas and well knew the inconceivable Dharma gate of the bodhisattvas.",
        "source": "T09n0278_047:0700b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又不可思議菩薩三昧智慧，以照其心，得一切時三昧光明，得一切相三昧境界光明，得明淨智。",
        "translation": "He also had the inconceivable bodhisattvaâ€™s samādhi wisdom to illuminate his mind, attain samādhi light at all times, attain samādhi-realm light at all marks, and attain clear and pure wisdom.",
        "source": "T09n0278_047:0700b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令一切眾生，得勝妙處；得一切至處道法門；隨順世間行，心無有二；以明淨智普照境界，得一切聲聞明淨忍藏；得無生忍，知法實相；常行菩薩行，不捨菩薩心，增長薩婆若心；得十力明，普照一切；樂妙法音，心無厭足；如說修行，住薩婆若，究竟一切智境界，出生無量菩薩莊嚴心，滿足菩薩清淨大願。",
        "translation": "It causes all sentient beings to attain a place of excellence, attain the Dharma entry for all the paths to reach, conform to worldly practices, and have no duality of mind; universally illuminate the objective realm with clear and pure wisdom, attain the store of clear and pure tolerance for all śrāvakas, attain the patient acceptance of nonarising, and know the true characteristics of dharmas; always practice bodhisattva practices, don't abandon the bodhisattva mind, and grow the mind of sarvajña; attain the ten powers and insight that universally illuminate all; delight in the marvelous Dharma sound, and have an unsatisfied mind; practice as described, abide in sarvajña, ultimately reach the realm of omniscience, give rise to measureless bodhisattva adornments, and fulfill the bodhisattva's pure great vow.",
        "source": "T09n0278_047:0700b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一念頃，遍至一切諸佛剎網，教化成熟無量眾生海，心無懈倦；悉見菩薩無量行境界，悉分別見一切世間，見諸佛剎種種莊嚴，於微細境界，悉能安置無量世界。",
        "translation": "In a single moment of thought, he travels to all the buddha bases' networks, teaching and maturing an endless ocean of sentient beings without laziness, fully seeing the bodhisattva's measureless realm of conduct, fully discerning all worlds, seeing the various adornments of the buddha bases, and fully being able to place measureless worlds in their subtle realms.",
        "source": "T09n0278_047:0700c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又能見彼種種莊嚴，悉能分別無量世界，諸語言法。",
        "translation": "He also sees their various adornments and is able to discern measureless worlds and languages and teachings.",
        "source": "T09n0278_047:0700c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知無量眾生欲樂，知諸眾生無量所行，以無量方便，教化眾生，善知殊方，隨其所應，化度眾生，念善知識。",
        "translation": "He also knows the desires and wishes of measureless sentient beings, knows the measureless ways in which sentient beings conduct themselves, teaches and educates sentient beings with measureless methods, well knows different directions, follows their responses, transforms and liberates sentient beings, and remembers the good teacher.",
        "source": "T09n0278_047:0700c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸漸遊行，至進求國，周遍推求彼婆羅門。",
        "translation": "He gradually travels to the country of advancement and investigation, and he investigates that Brāhmaṇa from all around.",
        "source": "T09n0278_047:0700c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門修諸苦行，求一切智，四面火聚，猶如大山；中有刀山，高峻無極；從彼山上，自投火聚。",
        "translation": "That brāhmaṇa, who was cultivating ascetic practices and seeking omniscience, had a cluster of fires on four sides like a great mountain; there was a mountain of swords that was tall and limitless, and from that mountain, he threw himself into the cluster of fires.",
        "source": "T09n0278_047:0700c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財詣婆羅門，頭面禮足，合掌而立，白言：「大聖！",
        "translation": "At the time, Shanzai went to the Brāhmaṇa, bowed his head and feet, put his palms together, and stood up, saying, \"Great sage!",
        "source": "T09n0278_047:0700c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行、修菩薩道，願為我說。」",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices and cultivates the bodhisattva path, so please explain this for me.\"",
        "source": "T09n0278_047:0700c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "He replied, \"Good man!",
        "source": "T09n0278_047:0700c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今若能登此刀山，投火聚者，菩薩諸行皆悉清淨。」",
        "translation": "Now, if you can climb this mountain of swords and throw yourself into the fiery mass, the bodhisattva's practices will all be purified.\"",
        "source": "T09n0278_047:0700c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財作如是念：「得人身難、離諸難難、得無難難、得淨法難、值佛世難、具諸根難、聞佛法難、遇善知識難、得與同止難、得聞正教難、得正命難、順趣正法難。",
        "translation": "At the time, Shanzai had this thought, \"It's difficult to obtain a human life, difficult to part with difficulties, difficult to obtain no difficulties, difficult to obtain the pure Dharma, difficult to meet the Buddha in the world, difficult to possess the faculties, difficult to hear the Buddha's teaching, difficult to meet a good teacher, difficult to be brought under the same roof, difficult to hear the right teaching, difficult to obtain right livelihood, and difficult to follow the right teaching.",
        "source": "T09n0278_047:0700c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此將非魔魔所使耶？",
        "translation": "Wouldn't these be the work of Māra and Māra?",
        "source": "T09n0278_047:0700c21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非善知識而現善知識相，將非惡菩薩耶？",
        "translation": "Is it not a bad bodhisattva who shows the characteristics of a good teacher when he's not a good teacher?",
        "source": "T09n0278_047:0700c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而今為我作壽命難、作善根難、薩婆若難，此非正教險惡道耳。",
        "translation": "Now, making life difficult for me, making good roots difficult, and making sarvajñas difficult is not the dangerous and evil path of the right teaching.",
        "source": "T09n0278_047:0700c22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離法門，薩婆若等一切佛法。」",
        "translation": "Keep away from the teaching and all the Buddha's teachings, such as sarvajña.\"",
        "source": "T09n0278_047:0700c24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念時，十萬梵天在虛空中，作如是言：「善男子！",
        "translation": "When they thought this, 100,000 Brahmā gods looked up in the sky and said, \"Good sons!",
        "source": "T09n0278_047:0700c24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫作是念。",
        "translation": "Don't think this thought.",
        "source": "T09n0278_047:0700c26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫作是念。",
        "translation": "Don't think this thought.",
        "source": "T09n0278_047:0700c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是大聖，具足金剛智慧光明，精進不退，悉已究竟一切境界。",
        "translation": "This is a great sage, fully endowed with the radiance of adamantine wisdom, who makes effort and doesn't retreat, and who has fully accomplished all realms.",
        "source": "T09n0278_047:0700c26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲竭一切眾生貪愛大海；欲裂一切諸邪見網；欲燒一切眾生煩惱，除滅愚闇，普照一切；令一切眾生離生死險難，除滅三世愚癡闇冥，放淨光明普照一切。」",
        "translation": "He wants to dry up the ocean of desire in all sentient beings, split open the web of all mistaken views, burn up the afflictions of all sentient beings, remove ignorance and darkness, and illuminate them all; he causes all sentient beings to escape the perils of birth and death, removes the darkness of delusion in the three worlds, and radiates pure light to illuminate them all.\"",
        "source": "T09n0278_047:0700c28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸梵天及自在天，眾生主天等，諸邪見天，作如是言：「我造眾生、我為一切世間最勝、我為最上、我為第一。」",
        "translation": "At the time, the Brahmakāyika gods, the Śubhakara gods, the lords of sentient beings, and other gods with mistaken views said, \"I create sentient beings, I'm the most excellent, I'm the highest, and I'm the best in the world.\"",
        "source": "T09n0278_047:0701a02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸天等，見婆羅門修大苦行，五熱炙身；見如是已，各於諸禪不得滋味，來詣其所。",
        "translation": "Those gods saw the Brahmin cultivating great ascetic practices and the five heats scorching their bodies, and after seeing that, they each couldn't taste anything in their meditation and came to him.",
        "source": "T09n0278_047:0701a05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門以自在力而為說法，令滅邪見，捨離我心；發大慈悲，普覆眾生；長養菩提正直之心；開四種道，求佛法身；隨所應化，悉能示現佛微妙音，一切悉聞，無有障礙。",
        "translation": "Then, with his sovereign power, the Brāhmaṇa preached, causing them to cease wrong views and abandon self-mind, arousing great compassion to cover all sentient beings, nurturing the mind of enlightenment and integrity, opening up four paths, seeking the Buddha's Dharma body, and according to their transformation, they were all able to produce the Buddha's subtle voice, which was heard without obstruction.",
        "source": "T09n0278_047:0701a07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬魔在虛空中，以種種摩尼寶華散婆羅門，告善財言：「善男子！",
        "translation": "Again, there were 10,000 Māra's in the sky, scattering Brāhmaṇas with various maṇi-jeweled flowers, and they addressed Shanzai, saying, \"Good sons!",
        "source": "T09n0278_047:0701a11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，苦行力故，放大光明，令我宮殿諸莊嚴具，悉如聚墨。",
        "translation": "Because of his asceticism, this Brāhmaṇa radiates his light, making the ornaments in my palace look like a mass of ink.",
        "source": "T09n0278_047:0701a13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不復樂，即與無量諸天天女，眷屬圍遶，來詣其所；為我說法，悉於阿耨多羅三藐三菩提，得不退轉。」",
        "translation": "Not rejoicing, I then gathered a myriad of gods and goddesses, surrounded by their retinues, and visited them to preach for me, so that they would all attain irreversibility in the unsurpassed, correct enlightenment.\"",
        "source": "T09n0278_047:0701a14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬他化自在天在虛空中，各持天華恭敬供養，作如是言：「善男子！",
        "translation": "Again, there were 10,000 Paranirmita-vaśavartin gods in the sky, each holding a celestial flower in respect and offering it as an offering, saying, \"Good sons!",
        "source": "T09n0278_047:0701a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，苦行力故，放大光明，令我宮殿諸莊嚴具，悉如聚墨；我不復樂，即與眷屬，來詣其所，為我說法，令我於心而得自在、於煩惱中而得自在、於受生中而得自在、除滅障礙而得自在、於一切三昧而得自在、於莊嚴具而得自在、於壽命中而得自在、乃至令我於一切佛法而得自在。」",
        "translation": "That brāhmaṇa, because of his asceticism, magnifies his light so brightly that the ornaments in my palace are like so much ink; I'm no longer happy about it, but I came to him with my retinue and taught me the Dharma, making me at ease in my mind, at ease in my afflictions, at ease in taking birth, at ease in removing obstacles, at ease in all samādhis, at ease in the ornaments, at ease in my life, and even making me at ease in all the Buddha's teachings.\"",
        "source": "T09n0278_047:0701a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬化自在天在虛空中，以天妓樂恭敬供養，作如是言：「善男子！",
        "translation": "Again, there were one of the myriad transformation gods in the sky, making offerings of respect and honor to the gods' musicians, saying, \"Good sons!",
        "source": "T09n0278_047:0701a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身，放大光明，照我宮殿及莊嚴具。",
        "translation": "This brāhmaṇa, whose body is scorched by the five hots, radiates a bright light that illuminates my palace and its adornments.",
        "source": "T09n0278_047:0701a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "照已，悉令我等，不樂五欲，不求欲樂，身心柔軟，與眷屬俱，來詣其所；為我說法，淨心、明淨心、善奇特心、柔軟心、歡喜心；乃至逮得清淨十力，長養離生，出生無量清淨之身；乃至得佛清淨法身；得清淨口，微妙音聲，遍至一切，無所障礙；乃至得一切智。」",
        "translation": "After shining that light, they all cause us to abstain from the five desires and pursue no pleasures, become flexible in body and mind, come with our retinue, and visit their place; they teach me with a pure mind, a clear and pure mind, a good and unusual mind, a gentle mind, and a joyous mind; up to the point where we acquire the ten powers of purity, nurture and free ourselves from birth, and produce measureless pure bodies; up to the point where we attain the Buddha's pure Dharma body; attain pure speech and subtle sounds that reach everywhere without obstruction; and up to the point where we attain omniscience.\"",
        "source": "T09n0278_047:0701a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬兜率陀天與其眷屬，在虛空中，雨一切末香雲，恭敬供養，作如是言：「善男子！",
        "translation": "Again, there were 10,000 Tuṣita gods and their retinues, raining clouds of all the endless fragrances in the sky, venerating and making offerings, and they said, \"Good sons!",
        "source": "T09n0278_047:0701b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，我自於宮殿，不樂須臾，來詣其所；為我解說無著之法，少欲知足，長養善根，發菩提心，乃至究竟一切佛法。」",
        "translation": "When this Brāhmaṇa's body was scorched by the five hottest things, I myself visited him in his palace without taking a moment's notice to explain the teaching on nonattachment, live with few desires and fulfillment, cultivate good roots, and arouse the mind of enlightenment, even to the point of perfecting all the Buddha's teachings.\"",
        "source": "T09n0278_047:0701b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬諸天，三十三天及阿脩羅，與眷屬俱，在虛空中，雨曼陀羅華雲、摩訶曼陀羅華雲，恭敬供養，作如是言：「善男子！",
        "translation": "Again, there were 10,000 gods, the Trāyastriṃśa gods and Āsura, accompanied by their retinues, raining clouds of flowers of mandaras and mahāmandāra flowers in the sky, venerating and making offerings, and they said, \"Good sons!",
        "source": "T09n0278_047:0701b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，我於天樂，不須臾樂著，來詣其所。",
        "translation": "When this brāhmaṇa's body was scorched by the five hottest things, I didn't need to be attached to the pleasures of heaven to come to him.",
        "source": "T09n0278_047:0701b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我說法，遠離欲樂；乃至為我說無常法，變易不住，斷除一切放逸高慢，長養發起菩提之心。",
        "translation": "He teaches me the Dharma, secludes himself from desire, and teaches me the Dharma of impermanence, which is unchanging and unabated, stops all carelessness and arrogance, and nurtures the mind of enlightenment.",
        "source": "T09n0278_047:0701b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T09n0278_047:0701b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見此婆羅門時，須彌山頂六種震動；我於爾時，心大恐怖，專求一切智。」",
        "translation": "When I saw this brāhmaṇa, six things shook the top of Mount Sumeru; at the time, my mind was greatly frightened, and I focused on seeking omniscience.\"",
        "source": "T09n0278_047:0701b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬大龍王，伊那槃那，難陀跋難陀等，興黑栴檀香雲；諸龍王女出妙樂音，雨天華雲、天香水雲，恭敬供養，作如是言：「善男子！",
        "translation": "There were 10,000 great dragon kings, including Inapanna and Nandopananda, who produced clouds of black sandalwood incense, and the dragon kings' women produced marvelous sounds, rained clouds of heavenly flowers and clouds of heavenly perfume, paid homage and made offerings, and said, \"Good sons!",
        "source": "T09n0278_047:0701b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，放大光明，普照一切龍王宮殿；令諸龍王，離熱沙苦，金翅鳥怖，滅瞋恚熱，身體清涼，發歡喜心。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, he radiates a bright light that shines universally in the palaces of all the dragon kings, causing them to part with the suffering of the hot sands, fear the gold-winged bird, cease the fever of anger, cool their bodies, and become joyous.",
        "source": "T09n0278_047:0701b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發喜心已，而為說法，厭惡龍趣，至誠悔過，除滅業障，發阿耨多羅三藐三菩提心，乃至住一切智。」",
        "translation": "After they rejoice, they then preach for them, becoming disillusioned with the destinies of the dragons, sincerely repenting their faults, removing the karmic hindrances, and arousing the mind of unsurpassed, corrected, and fully abiding in omniscience.\"",
        "source": "T09n0278_047:0701b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬夜叉王，種種供養此婆羅門及以善財，作如是言：「善男子！",
        "translation": "Again, there were 10,000 yakṣa kings who made various offerings to this brāhmaṇa and to his good fortune, saying, \"Good sons!",
        "source": "T09n0278_047:0701b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，我及羅剎、鳩槃荼等，悉於眾生發大慈心，無所嬈害，慈心力故；不樂宮殿，與眷屬俱，來詣其所；彼婆羅門，以大慈心蔭覆我等，令我歡喜，身心柔軟，安隱快樂；為我說法，乃至令無量夜叉、羅剎、鳩槃荼等，發阿耨多羅三藐三菩提心。」",
        "translation": "When this brāhmaṇa was scorching his body with the five hots, I, the rāhasas, kumbhāṇḍas, and so forth all showed great compassion for sentient beings, did not harm them, and, because of the power of that compassionate mind, came to the palace of Unhappiness with my retinue; that brāhmaṇa overshadowed us with great kindness, made me happy, tender in body and mind, and peaceful and joyous; he spoke for me, even causing measureless yakṣas, rāhas, kumbhāṇḍas, and so forth to give rise to the mind of unsurpassed, correct, and complete enlightenment.\"",
        "source": "T09n0278_047:0701b28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬乾闥婆王在虛空中，作如是言：「善男子！",
        "translation": "Again, there were 10,000 gandharva kings in the sky who said, \"Good sons!",
        "source": "T09n0278_047:0701c05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，放大光明，照我宮殿，悉令我等得不思議樂；來詣其所，為我說法，乃至令發阿耨多羅三藐三菩提心，得不退轉。」",
        "translation": "When this brāhmaṇa burns his body with the five hots, he radiates a bright light that shines in my palace and fully causes us to attain inconceivable happiness; he comes to me, preaches for me, and causes me to arouse the mind of unsurpassed, corrected bodhi and attain irreversibility.\"",
        "source": "T09n0278_047:0701c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬阿脩羅王在虛空中，右膝[跍*月]跪，一心合掌，恭敬供養，作如是言：「善男子！",
        "translation": "Again, there were 10,000 Ashura kings in the sky, kneeling on their right knee [kaṭhaka*moon], putting their palms together with one heart, respectfully making offerings, and saying, \"Good sons!",
        "source": "T09n0278_047:0701c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，一切阿脩羅宮殿，大地大海，皆悉震動；我等爾時，除滅高心，來詣其所；為我說法，遠離一切諂曲幻心，得深法忍，安住不動，具足十力。」",
        "translation": "When this brāhmaṇa's body is scorched by the five hottest things, all the palaces of Āsura and the great earth and sea are shaken; at that point, we remove our lofty desires and come to him to preach for me, seclude ourselves from all flattery and illusion, attain profound tolerance of the Dharma, abide unmoving, and fully possess the ten powers.\"",
        "source": "T09n0278_047:0701c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬迦樓羅王，勇力持等，化為外道童子，在虛空中，作如是言：「乃至為我說法，安立大慈，讚歎大悲，度生死海；沒於五欲泥者，歎淨直心門，生慧方便翅，隨其所應，皆悉化度。」",
        "translation": "Then there was another 10,000 Kālôdayin kings, such as Brahmapurohita, who transformed into a boy from another religion and spoke thus in the sky, \"Even as he preaches for me, he establishes great kindness, praises great compassion, and saves the ocean of birth-and-death; those who are caught in the mire of the five desires praise the gate of a pure and straight mind, and those who produce the wings of wisdom and skillful means, and they all are delivered according to their capacity.\"",
        "source": "T09n0278_047:0701c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬緊那羅王在虛空中，作如是言：「善男子！",
        "translation": "Again, there were 10,000 kiṃnara kings in the sky, saying, \"Good sons!",
        "source": "T09n0278_047:0701c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，於我寶多羅樹中、金鈴網中、寶瓔珞中、諸寶樹中、種種樂器中，自然演出微妙音聲、佛聲、法聲、比丘僧聲、不退轉諸菩薩聲、菩提心聲。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, it naturally produces the subtle sounds of the Buddha, the Dharma, the monks and bhikṣus, the nonretrogressing bodhisattvas, and the mind of enlightenment in my jeweled tārā, in my golden bell net, in my precious jewelry, in my jeweled trees, and in my various musical instruments.",
        "source": "T09n0278_047:0701c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某方某國，有某菩薩，發菩提心，修行苦行，修大布施，莊嚴道場，往詣道場，成正覺聲。",
        "translation": "In a certain country in a certain direction, there's a certain bodhisattva who arouses the aspiration for enlightenment, cultivates ascetic practices, cultivates great generosity, adorns the site of enlightenment, goes to the site of enlightenment, and becomes perfectly enlightened.",
        "source": "T09n0278_047:0701c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0701c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞是聲，即大歡喜，來詣其所；為我說法，令無量眾生於阿耨多羅三藐三菩提，得不退轉。」",
        "translation": "When I heard that sound, I rejoiced greatly and came to visit him to preach for me, causing measureless sentient beings to attain unswerving perfect enlightenment.\"",
        "source": "T09n0278_047:0701c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量欲界諸天在虛空中，供養恭敬，作如是言：「善男子！",
        "translation": "Again, measureless gods of the desire realm were present in the sky, offering their support and respect, saying, \"Good sons!",
        "source": "T09n0278_047:0701c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，五熱炙身時，放大光明，乃至普照阿鼻地獄，除滅苦痛；若有眾生見斯光者，命終生天，知報恩故。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, it radiates a bright light that shines universally from the avīci hells and removes suffering and pain; if sentient beings see that light, they'll be born in heaven at the end of their lives and will know how to repay kindness.",
        "source": "T09n0278_047:0702a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨五欲樂，來詣其所，樂觀無厭；為我說法，乃至令無量眾生發菩提心。」",
        "translation": "They abandon the five desires and pleasures, come to him, are optimistic, and don't tire of teaching for me, even to the point of causing measureless sentient beings to arouse the aspiration for enlightenment.\"",
        "source": "T09n0278_047:0702a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子聞奇特法，心大歡喜，於婆羅門所，發起真實善知識心；頭面禮足，如是白言：「向疑聖教，違知識教；唯願大聖，受我悔過。」",
        "translation": "At the time, the boy Sun Cai heard the extraordinary teaching, rejoiced greatly, arouse in him the attitude of a truly good teacher, and bowing his head and feet, he said, \"I've always doubted the teachings of sages and disagreed with their teachings; may the great sage accept my repentance.\"",
        "source": "T09n0278_047:0702a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門為善財童子，而說偈言：「欲求菩提者，　　當順知識教，　除滅諸疑惑，　　一心常恭敬。",
        "translation": "On that occasion, the Brāhmaṇa spoke a verse for the Boy of Good Fortune, saying, \"Those who want to pursue enlightenment should follow the teachings of a teacher, remove doubts and confusions, and always venerate with one heart.",
        "source": "T09n0278_047:0702a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修習於正道，　　知法真實相，　安住於道場，　　成就佛菩提。」",
        "translation": "Cultivate the right path, know the true characteristics of dharmas, abide stably on the site of enlightenment, and achieve buddha-bodhi.\"",
        "source": "T09n0278_047:0702a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子即登刀山，自投火聚，未至中間，即得菩薩安住三昧；既至火焰，復得菩薩寂靜安樂照明三昧。",
        "translation": "It was then that the boy of good fortune climbed the mountain of swords and threw himself into the fire. Before reaching the middle, he attained the concentration of the bodhisattva's calm abiding, and after reaching the fire, he again attained the concentration of the bodhisattva's calm, peaceful illumination.",
        "source": "T09n0278_047:0702a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得三昧已，白言：「甚奇。",
        "translation": "After attaining that concentration, he said, \"How marvelous!",
        "source": "T09n0278_047:0702a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖！",
        "translation": "Great sage!",
        "source": "T09n0278_047:0702a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是刀山及大火聚，我身觸時，安隱快樂。」",
        "translation": "When I touch such a mountain of swords or a great ball of fire, I'm comfortable and happy.\"",
        "source": "T09n0278_047:0702a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門告善財言：「善男子！",
        "translation": "The brāhmaṇa then addressed Śubhaji, saying, \"Good man!",
        "source": "T09n0278_047:0702a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯成此菩薩無盡法門。",
        "translation": "\"I have only accomplished this inexhaustible bodhisattva approach.",
        "source": "T09n0278_047:0702a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明淨法王諸菩薩行，滿足諸願；悉滅眾生煩惱邪見，得不退轉不可盡心，離懈怠心，一切無畏；得金剛那羅延藏，究竟大境界，無有疲倦；遠離諸垢，不動如風輪，精進不退，以大莊嚴而自莊嚴，饒益眾生。",
        "translation": "It clarifies the bodhisattva practices of the Dharma king, fulfills all vows, completely ceases the afflictions and mistaken views of sentient beings, attains a mind that's nonretrogressing and inexhaustible, parts with a mind of laziness, and is fearless in all ways, attains the vajra-narayan store, reaches the ultimate great state, has no weariness, is free of all defilements, remains motionless like a wind-wheel, makes effort and doesn't retreat, adorns itself with great adornment, and benefits sentient beings.",
        "source": "T09n0278_047:0702a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是法門，我當云何能知能說？",
        "translation": "How can I know and explain such a teaching?",
        "source": "T09n0278_047:0702a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0278_047:0702a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方，有城名師子奮迅；有一童女，名彌多羅尼。",
        "translation": "South of here, there's a city named Shizi Fenxun, and there's a young woman named Maitreya.",
        "source": "T09n0278_047:0702a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問云何菩薩學菩薩行、修菩薩道。」",
        "translation": "Go there and ask what bodhisattvas are training in the bodhisattva practices and cultivating the bodhisattva path.\"",
        "source": "T09n0278_047:0702a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頭面禮足，遶無數匝，觀察無厭，辭退南行。",
        "translation": "The boy of good fortune then bowed his head and face to his feet, circled him for countless turns, observed him without tire, and withdrew to the south.",
        "source": "T09n0278_047:0702a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大方廣佛華嚴經卷第四十七",
        "translation": "Dafangguang fo huayan jing roll 47",
        "source": "T09n0278_047:0702a28_4",
        "is_bad_quality": false
    }
]