[
    {
        "source_sentence": "妙法蓮華經卷第六",
        "translation": "Miaofa lianhua jing, vol. 6",
        "source": "T09n0262_006:0046b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦龜茲國三藏法師",
        "translation": "Tripiṭaka Master of Kucha in the Later Qin Dynasty",
        "source": "T09n0262_006:0046b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鳩摩羅什奉　詔譯",
        "translation": "Kumārajīva translation by imperial order",
        "source": "T09n0262_006:0046b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎隨喜功德品第十八",
        "translation": "Śrīlabdha-prātimokṣa-sūtra XVIII",
        "source": "T09n0262_006:0046b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, \"Bhagavān!",
        "source": "T09n0262_006:0046b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子、善女人，聞是法華經隨喜者，得幾所福？」",
        "translation": "If good men and good women hear this Lotus Sutra and rejoice in it, how much merit will they attain?\"",
        "source": "T09n0262_006:0046b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「世尊滅度後，　　其有聞是經，　若能隨喜者，　　為得幾所福？」",
        "translation": "He spoke a verse, saying, \"After the Bhagavān's death, if someone hears this sūtra and can follow it, how much merit will they attain?\"",
        "source": "T09n0262_006:0046b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告彌勒菩薩摩訶薩：「阿逸多！",
        "translation": "It was then that the Buddha addressed Maitreya, the Bodhisattva Mahāsattva, \"Āyatol!",
        "source": "T09n0262_006:0046b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來滅後，若比丘、比丘尼、優婆塞、優婆夷，及餘智者若長若幼，聞是經隨喜已，從法會出，至於餘處，若在僧坊，若空閑地，若城邑、巷陌、聚落、田里，如其所聞，為父母、宗親、善友、知識，隨力演說。",
        "translation": "\"After the Tathāgata's death, if monks, nuns, laymen, laywomen, or other wise people, whether old or young, hear this sūtra and rejoice, they leave the Dharma assembly and go to another place, whether it's in a monastery, a vacant lot, a town, a street, a village, or a field, and teach it to their parents, clansmen, good friends, and friends according to their ability after hearing it.",
        "source": "T09n0262_006:0046b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸人等，聞已隨喜，復行轉教；餘人聞已，亦隨喜轉教。",
        "translation": "Those people who heard it rejoiced and then continued to teach it, and the others who heard it rejoiced and taught it.",
        "source": "T09n0262_006:0046c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是展轉，至第五十。",
        "translation": "They continued in this way until the fiftieth.",
        "source": "T09n0262_006:0046c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿逸多！",
        "translation": "\"Āyatol!",
        "source": "T09n0262_006:0046c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第五十善男子、善女人，隨喜功德，我今說之，汝當善聽。",
        "translation": "The fiftieth of these good men and good women, the merit of rejoicing in them, is something I'll now explain, so you must listen well.",
        "source": "T09n0262_006:0046c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四百萬億阿僧祇世界，六趣四生眾生——卵生、胎生、濕生、化生，若有形、無形，有想、無想，非有想、非無想，無足、二足、四足、多足，如是等在眾生數者——有人求福，隨其所欲娛樂之具，皆給與之。",
        "translation": "If there are four hundred million million incalculable worlds and four beings in the six destinies-eggborn, wombborn, wet-born, and transformation-born, whether with or without form, with or without perception, not with or without perception, legless, two-legged, four-legged, or many-such-and-such in the number of sentient beings-when someone seeks merit, they'll be given whatever amusement apparatus they desire.",
        "source": "T09n0262_006:0046c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一眾生，與滿閻浮提金、銀、琉璃、車璩馬腦、珊瑚、虎珀，諸妙珍寶，及象、馬車乘，七寶所成宮殿樓閣等。",
        "translation": "Each sentient being is given gold, silver, beryl, chariots, horses' brains, coral, tiger pearls, and other wonderful treasures, elephants, horse-drawn chariots, and palaces and mansions made of the seven treasures that fill Yambudvīpa.",
        "source": "T09n0262_006:0046c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大施主，如是布施滿八十年已，而作是念：『我已施眾生娛樂之具，隨意所欲，然此眾生，皆已衰老年過八十，髮白面皺，將死不久，我當以佛法而訓導之。』",
        "translation": "After he had given thus for 80 years, this great donor thought, 'I've given sentient beings the necessities for their amusement as I wish, but these sentient beings are all old and past 80 years old, their hair is white and wrinkled, and they're going to die soon.",
        "source": "T09n0262_006:0046c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即集此眾生，宣布法化，示教利喜，一時皆得須陀洹道、斯陀含道、阿那含道、阿羅漢道，盡諸有漏，於深禪定皆得自在，具八解脫。",
        "translation": "He then gathers these sentient beings, announces the teaching, shows them the benefits and joys of the teaching, and all at once they attain the stream entry path, the once-returner path, the non-returner path, and the arhat path, end all the contaminants, attain freedom in deep meditation, and complete the eight liberations.",
        "source": "T09n0262_006:0046c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何，是大施主所得功德寧為多不？」",
        "translation": "What do you think, would this great donor attain much merit?\"",
        "source": "T09n0262_006:0046c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒白佛言：「世尊！",
        "translation": "Maitreya said to the Buddha, \"Bhagavān!",
        "source": "T09n0262_006:0046c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人功德甚多，無量無邊。",
        "translation": "This person's merits are so great that they are incalculable and limitless.",
        "source": "T09n0262_006:0046c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是施主，但施眾生一切樂具，功德無量；何況令得阿羅漢果。」",
        "translation": "If this is a donor who simply gives sentient beings all the things that make them happy, the merit is incalculable, let alone causing them to attain the fruit of the arhat.\"",
        "source": "T09n0262_006:0046c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彌勒：「我今分明語汝，是人以一切樂具，施於四百萬億阿僧祇世界六趣眾生，又令得阿羅漢果，所得功德，不如是第五十人，聞法華經一偈隨喜功德，百分、千分、百千萬億分、不及其一，乃至算數譬喻所不能知。",
        "translation": "The Buddha told Maitreya, \"Now, I've told you clearly that this person's gift of all the necessities of comfort to sentient beings in the four hundred thousand million incalculable worlds and their attainment of the fruit of the arhat doesn't have the same merit as the fiftieth person who hears one verse of the Lotus Sutra and rejoices in its merit, which is a hundred percent, a thousand parts, a hundred thousand million million parts, or not even one, and which cannot be understood even by counting or simulating.",
        "source": "T09n0262_006:0046c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿逸多！",
        "translation": "\"Āyatol!",
        "source": "T09n0262_006:0046c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第五十人展轉聞法華經隨喜功德，尚無量無邊阿僧祇，何況最初於會中聞而隨喜者，其福復勝，無量無邊阿僧祇，不可得比。",
        "translation": "Thus, the merits of the fiftieth person who rejoices in hearing the Lotus Sutra in succession are incalculable and limitless, let alone the merits of someone who first hears and rejoices in it at the assembly, which are even greater than incalculable and limitless and cannot be compared.",
        "source": "T09n0262_006:0046c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，阿逸多！",
        "translation": "\"Furthermore, Ajita!",
        "source": "T09n0262_006:0047a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人為是經故，往詣僧坊，若坐、若立須臾聽受，緣是功德，轉身所生，得好上妙象、馬車乘、珍寶輦輿，及乘天宮。",
        "translation": "If a person goes to the temple for the sake of this sūtra and listens to it for a moment while sitting or standing, based on that merit, they'll be reborn in a new body and attain a fine, wonderful elephant, a carriage, a precious palanquin, or a ride in a heavenly palace.",
        "source": "T09n0262_006:0047a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人於講法處坐，更有人來，勸令坐聽，若分座令坐，是人功德，轉身得帝釋坐處，若梵王坐處，若轉輪聖王所坐之處。",
        "translation": "If another person is sitting in the place where the teaching is given and another person comes and encourages them to sit and listen, or if they are made to sit in a separate seat, that person's merits will transform their body into one where Indra sits, where Brahmā sits, or where the wheel-turning sage king sits.",
        "source": "T09n0262_006:0047a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿逸多！",
        "translation": "\"Āyatol!",
        "source": "T09n0262_006:0047a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，語餘人言：『有經，名法華，可共往聽。』",
        "translation": "Suppose another person says to another person, 'There's a scripture called the Lotus that we can go together to hear.'",
        "source": "T09n0262_006:0047a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即受其教，乃至須臾間聞，是人功德，轉身得與陀羅尼菩薩共生一處，利根智慧，百千萬世終不瘖瘂，口氣不臭，舌常無病，口亦無病，齒不垢黑、不黃、不踈，亦不缺落，不差、不曲，脣不下垂亦不褰縮、不麁澁、不瘡胗，亦不缺壞，亦不喎斜，不厚、不大，亦不黧黑，無諸可惡。",
        "translation": "That person then accepts its teaching and listens to it even for a moment, and that person's merit is that they'll be reborn in the same place as the Dhāraṇī Bodhisattva, have sharp faculties and wisdom, never become dumb for a hundred million lifetimes, their breath doesn't smell, their tongue is always without illness, their mouth is also without illness, their teeth aren't stained black, aren't yellow, aren't crooked, aren't missing, aren't crooked, their lips don't droop or shrink, aren't crude, don't have sores and gizzards, aren't damaged, aren't slanted, aren't thick or large, aren't sallow, and aren't repulsive.",
        "source": "T09n0262_006:0047a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻不匾[匚@虒]，亦不曲戾，面色不黑，亦不狹長，亦不窊曲，無有一切不可喜相。",
        "translation": "His nose isn't flat [amphibious] or crooked, and his face isn't dark, narrow, or twisted, and doesn't have any unpleasant features.",
        "source": "T09n0262_006:0047a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脣舌牙齒悉皆嚴好，鼻修高直，面貌圓滿，眉高而長，額廣平正，人相具足，世世所生，見佛聞法、信受教誨。",
        "translation": "Their lips, tongue, and teeth are all finely proportioned, their noses are cultivated and straight, their faces are rounded, their eyebrows are high and long, and their foreheads are broad and square, and their human features are complete, so they're born in all the world, see the Buddha, hear the Dharma, and believe in the teachings.",
        "source": "T09n0262_006:0047a18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿逸多！",
        "translation": "\"Āyatol!",
        "source": "T09n0262_006:0047a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝且觀是，勸於一人令往聽法，功德如此，何況一心聽說、讀誦，而於大眾為人分別、如說修行？」",
        "translation": "How much more meritorious is it for you to observe this and encourage one person to go and listen to the teaching, much less to single-mindedly listen to it, recite it, discern it for others, and practice it as it's taught?\"",
        "source": "T09n0262_006:0047a20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「若人於法會，　　得聞是經典，　乃至於一偈，　　隨喜為他說，　如是展轉教，　　至于第五十，　最後人獲福，　　今當分別之。",
        "translation": "It was then that the Bhagavān wanted to recapitulate this meaning and spoke in verse, saying, \"If someone at a Dharma assembly hears this sūtra, even in a single verse, and they delight in teaching it to others, they'll continue teaching it this way until the fiftieth, and eventually they'll attain merit, which will now be discerned.",
        "source": "T09n0262_006:0047a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如有大施主，　　供給無量眾，　具滿八十歲，　　隨意之所欲。",
        "translation": "Suppose there's a great donor who provides for measureless multitudes, reaching the age of 80 years, as he wishes.",
        "source": "T09n0262_006:0047a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見彼衰老相，　　髮白而面皺，　齒踈形枯竭，　　念其死不久，　我今應當教，　　令得於道果。",
        "translation": "Seeing their appearance of old age, their hair whitened, their face wrinkled, and their teeth withered, he thinks, \"He won't die long.",
        "source": "T09n0262_006:0047b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即為方便說，　　涅槃真實法，　世皆不牢固，　　如水沫泡焰，　汝等咸應當，　　疾生厭離心。",
        "translation": "I will then explain this teaching as a method, saying that the true teaching of nirvāṇa is insubstantial in the world and like foam, bubbles, and flames, so you all should quickly become disillusioned with it.",
        "source": "T09n0262_006:0047b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸人聞是法，　　皆得阿羅漢，　具足六神通，　　三明八解脫。",
        "translation": "Everyone who hears this teaching will become an arhat, fully possessing the six supernormal powers and the three insights and eight liberations.",
        "source": "T09n0262_006:0047b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最後第五十，　　聞一偈隨喜，　是人福勝彼，　　不可為譬喻。",
        "translation": "The last fiftieth, who hears a single verse and rejoices in it, is a person whose fortune is superior to theirs and cannot be likened to theirs.",
        "source": "T09n0262_006:0047b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是展轉聞，　　其福尚無量，　何況於法會，　　初聞隨喜者。",
        "translation": "Their merit is still immeasurable when they hear it repeatedly like this, so why wouldn't they rejoice when they first hear it at a Dharma assembly?",
        "source": "T09n0262_006:0047b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有勸一人，　　將引聽法華，　言此經深妙，　　千萬劫難遇，　即受教往聽，　　乃至須臾聞，　斯人之福報，　　今當分別說。",
        "translation": "If someone is encouraged to listen to the Lotus and is led to say that this sūtra is so profound and marvelous that it's difficult to encounter for a thousand thousand eons, then they'll be taught to listen to it, even if they hear it in a moment.",
        "source": "T09n0262_006:0047b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世世無口患，　　齒不踈黃黑，　脣不厚褰缺，　　無有可惡相，　舌不乾黑短，　　鼻高修且直，　額廣而平正，　　面目悉端嚴，　為人所喜見，　　口氣無臭穢，　優鉢華之香、　　常從其口出。",
        "translation": "From generation to generation, he'll have no mouth troubles, his teeth won't be yellow and black, his lips won't be thick and flat, there's nothing to hate, his tongue won't be dry and black and short, his nose will be high and straight, his forehead will be broad and straight, his face will be completely dignified, he'll be pleasing to people, his breath won't smell bad, and the fragrance of the utpala flower will always come from his mouth.",
        "source": "T09n0262_006:0047b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若故詣僧坊，　　欲聽法華經，　須臾聞歡喜，　　今當說其福。",
        "translation": "If he had visited the saṃgha's office to hear the Lotus Sutra, he would have rejoiced at the prospect of hearing it, and now he would explain its merits.",
        "source": "T09n0262_006:0047b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　後生天人中，　　得妙象馬車，　珍寶之輦輿，　　及乘天宮殿。",
        "translation": "Later, they'll be born among gods and humans, attain a wonderful elephant and horse chariot, a palanquin of precious treasures, and ride in a heavenly palace.",
        "source": "T09n0262_006:0047b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於講法處，　　勸人坐聽經，　是福因緣得，　　釋梵轉輪座。",
        "translation": "If he were to encourage people to sit and listen to the sūtras at the Dharma lecture site, this would be a fortunate cause and condition for attaining the turning-wheel throne of the Śakra Heaven.",
        "source": "T09n0262_006:0047b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何況一心聽，　　解說其義趣，　如說而修行，　　其福不可量。」",
        "translation": "How much more so when they whole-heartedly listen, explain its meaning and objectives, and practice it as it's taught, their merit is incalculable.\"",
        "source": "T09n0262_006:0047b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經法師功德品第十九",
        "translation": "Miaofa lianhua jing fashi gongde pin di xix",
        "source": "T09n0262_006:0047c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告常精進菩薩摩訶薩：「若善男子、善女人，受持是法華經，若讀、若誦、若解說、若書寫，是人當得八百眼功德、千二百耳功德、八百鼻功德、千二百舌功德、八百身功德、千二百意功德，以是功德、莊嚴六根，皆令清淨。",
        "translation": "It was then that the Buddha addressed the Bodhisattva of Constant Exertion, \"If good sons and good women accept this Lotus Sutra and read, recite, explain, and write it, they will attain 800 eye attributes, 1,200 ear attributes, 800 nose attributes, 1,200 tongue attributes, 800 body attributes, and 1,200 mind attributes, and with these attributes they will adorn their six faculties and make them all pure.",
        "source": "T09n0262_006:0047c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，父母所生清淨肉眼，見於三千大千世界內外所有山林河海，下至阿鼻地獄，上至有頂，亦見其中一切眾生，及業因緣、果報生處，悉見悉知。」",
        "translation": "Good sons and good women, these pure physical eyes born from a father and mother see all the mountains, forests, rivers, and seas inside and outside the 3,000 great thousand worlds, down to the avīci hell, up to the highest part of existence, and see all the sentient beings therein, as well as the causes and conditions of karma and the places where the results are produced, and they see and know them all.\"",
        "source": "T09n0262_006:0047c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「若於大眾中，　　以無所畏心、　說是法華經，　　汝聽其功德。",
        "translation": "It was then that the Bhagavān wanted to reiterate this teaching and spoke the verse, \"If you were to recite this Lotus Sutra in the midst of a large crowd with a fearless mind, you'd listen to its merits.",
        "source": "T09n0262_006:0047c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人得八百、　　功德殊勝眼，　以是莊嚴故，　　其目甚清淨。",
        "translation": "That person has attained the 800 excellent eyes of merit, and because of this adornment, their eyes are very pure.",
        "source": "T09n0262_006:0047c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母所生眼，　　悉見三千界，　內外彌樓山，　　須彌及鐵圍，　并諸餘山林、　　大海江河水，　下至阿鼻獄，　　上至有頂處，　其中諸眾生，　　一切皆悉見。",
        "translation": "With the eyes produced by his parents, he sees all 3,000 realms, internal and external Mount Miliṇḍa, Sumeru and the Iron Heights, other mountains and forests, the ocean, rivers, and waters, down to the hell of Abhijit, up to the highest place, and all the sentient beings in them.",
        "source": "T09n0262_006:0047c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖未得天眼，　　肉眼力如是。",
        "translation": "Even though they haven't yet attained the divine eye, the power of the physical eye is thus.",
        "source": "T09n0262_006:0047c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，常精進！",
        "translation": "\"Furthermore, always exert yourself!",
        "source": "T09n0262_006:0047c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人，受持此經，若讀、若誦、若解說、若書寫，得千二百耳功德。",
        "translation": "\"If good sons and good women memorize this sūtra and read, recite, explain, or write it, they'll attain the merit of twelve hundred ears.",
        "source": "T09n0262_006:0047c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是清淨耳，聞三千大千世界，下至阿鼻地獄，上至有頂，其中內外種種語言音聲——象聲、馬聲、牛聲、車聲，啼哭聲、愁歎聲，螺聲、鼓聲、鍾聲、鈴聲，笑聲、語聲，男聲、女聲、童子聲、童女聲，法聲、非法聲，苦聲、樂聲，凡夫聲、聖人聲，喜聲、不喜聲，天聲、龍聲、夜叉聲、乾闥婆聲、阿修羅聲、迦樓羅聲、緊那羅聲、摩睺羅伽聲，火聲、水聲、風聲，地獄聲、畜生聲、餓鬼聲，比丘聲、比丘尼聲，聲聞聲、辟支佛聲，菩薩聲、佛聲——以要言之，三千大千世界中一切內外所有諸聲，雖未得天耳，以父母所生清淨常耳，皆悉聞知，如是分別種種音聲而不壞耳根。」",
        "translation": "以是清淨耳，聞三千大千世界，下至阿鼻地獄，上至有頂，其中內外種種語言音聲——象聲、馬聲、牛聲、車聲，啼哭聲、愁歎聲，螺聲、鼓聲、鍾聲、鈴聲，笑聲、語聲，男聲、女聲、童子聲、童女聲，法聲、非法聲，苦聲、樂聲，凡夫聲、聖人聲，喜聲、不喜聲，天聲、龍聲、夜叉聲、乾闥婆聲、阿修羅聲、迦樓羅聲、緊那羅聲、摩睺羅伽聲，火聲、水聲、風聲，地獄聲、畜生聲、餓鬼聲，比丘聲、比丘尼聲，聲聞聲、辟支佛聲，菩薩聲、佛聲——以要言之，三千大千世界中一切內外所有諸聲，雖未得天耳，以父母所生清淨常耳，皆悉聞知，如是分別種種音聲而不壞耳根。」",
        "source": "T09n0262_006:0047c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「父母所生耳，　　清淨無濁穢，　以此常耳聞，　　三千世界聲。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke in verse, \"The ear born from a father and mother is pure and unsullied, and with this constant ear it hears the sounds of the 3,000 worlds.",
        "source": "T09n0262_006:0048a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　象馬車牛聲，　　鍾鈴螺鼓聲，　琴瑟箜篌聲，　　簫笛之音聲，　清淨好歌聲，　　聽之而不著，　無數種人聲，　　聞悉能解了。",
        "translation": "The sounds of elephants, horses, chariots, oxen, bells, conchs, drums, lutes, harps, flutes, and pure, beautiful songs are heard without attachment, and countless human sounds are heard and fully comprehended.",
        "source": "T09n0262_006:0048a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又聞諸天聲，　　微妙之歌音，　及聞男女聲，　　童子童女聲。",
        "translation": "They also hear the sounds of the gods, the sounds of their subtle songs, and the sounds of men and women, boys and girls.",
        "source": "T09n0262_006:0048a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　山川嶮谷中，　　迦陵頻伽聲，　命命等諸鳥，　　悉聞其音聲。",
        "translation": "In the mountains and rivers, in the valleys, they hear the sounds of the kalaviṅka, and they hear the sounds of birds such as the living creatures.",
        "source": "T09n0262_006:0048a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　地獄眾苦痛，　　種種楚毒聲，　餓鬼飢渴逼，　　求索飲食聲，　諸阿修羅等，　　居在大海邊，　自共語言時，　　出于大音聲。",
        "translation": "The pain and suffering of hell, the various painful and poisonous sounds, the hunger and thirst of hungry ghosts, and the sounds of people seeking food and drink are all heard, and there are asuras and others living at the edge of the ocean who produce a great voice when they speak together.",
        "source": "T09n0262_006:0048a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是說法者，　　安住於此間，　遙聞是眾聲，　　而不壞耳根。",
        "translation": "Thus, when a Dharma speaker abides here, he hears these sounds from a distance and doesn't damage his ear faculties.",
        "source": "T09n0262_006:0048a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方世界中，　　禽獸鳴相呼，　其說法之人，　　於此悉聞之。",
        "translation": "In the worlds of the ten directions, animals and birds cry out together, and their Dharma preacher hears them all here.",
        "source": "T09n0262_006:0048a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其諸梵天上，　　光音及遍淨，　乃至有頂天，　　言語之音聲，　法師住於此，　　悉皆得聞之。",
        "translation": "Up in the brahma heavens, the radiant and pervasive sounds of the gods, even the highest heaven, are the sounds of speech, and the Dharma teacher abiding here can hear them all.",
        "source": "T09n0262_006:0048a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切比丘眾，　　及諸比丘尼，　若讀誦經典，　　若為他人說，　法師住於此，　　悉皆得聞之。",
        "translation": "If all the monks and nuns recite the sutras or speak them for others, the Dharma teacher abiding here will hear them all.",
        "source": "T09n0262_006:0048b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有諸菩薩，　　讀誦於經法，　若為他人說，　　撰集解其義，　如是諸音聲，　　悉皆得聞之。",
        "translation": "\"Furthermore, if there are bodhisattvas who recite the sūtras and teach them for others and compile and understand their meanings, such are the sounds that can be heard by all of them.",
        "source": "T09n0262_006:0048b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛大聖尊，　　教化眾生者，　於諸大會中，　　演說微妙法，　持此法華者，　　悉皆得聞之。",
        "translation": "The great and noble buddhas who teach sentient beings and preach the subtle Dharma in great assemblies can all be heard by those who hold this dharma-flower.",
        "source": "T09n0262_006:0048b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三千大千界，　　內外諸音聲，　下至阿鼻獄，　　上至有頂天，　皆聞其音聲，　　而不壞耳根，　其耳聰利故，　　悉能分別知。",
        "translation": "The sounds of the three thousand great one-thousand worlds, both internal and external, are heard from as low as the hell of Abhidharma and as high as the highest heaven, but they don't damage their auditory faculties; their ears are so acute that they can discern them all.",
        "source": "T09n0262_006:0048b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持是法花者，　　雖未得天耳，　但用所生耳，　　功德已如是。",
        "translation": "Even though he hasn't attained the divine ear, he uses the ear that's produced, and his merits have been thus.",
        "source": "T09n0262_006:0048b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，常精進！",
        "translation": "\"Furthermore, always exert yourself!",
        "source": "T09n0262_006:0048b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人，受持是經，若讀、若誦、若解說、若書寫，成就八百鼻功德。",
        "translation": "\"If good sons and good women memorize this sūtra and read, recite, explain, and write it, they'll achieve the merit of 800 noses.",
        "source": "T09n0262_006:0048b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是清淨鼻根，聞於三千大千世界上下內外種種諸香——須曼那華香、闍提華香、末利華香、瞻蔔華香、波羅羅華香，赤蓮華香、青蓮華香、白蓮華香，華樹香、菓樹香，栴檀香、沈水香、多摩羅跋香、多伽羅香，及千萬種和香，若末、若丸、若塗香——持是經者，於此間住，悉能分別。",
        "translation": "With this purified olfactory faculty, he or she can hear the various fragrances up and down and inside and outside the 3,000 great one-thousand worlds-sumāna flower fragrance, jāti flower fragrance, mallikā flower fragrance, campaka flower fragrance, pārāla flower fragrance, red lotus flower fragrance, blue lotus flower fragrance, white lotus flower fragrance, flowering tree fragrance, fruit tree fragrance, sandalwood fragrance, sinking water fragrance, tamālapatra fragrance, tagara fragrance, and a thousand other kinds of blended fragrances, whether powdered, pellet, or daubed-which he or she can discern while abiding here, if they maintain this sūtra.",
        "source": "T09n0262_006:0048b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復別知眾生之香——象香、馬香、牛羊等香，男香、女香、童子香、童女香，及草木叢林香——若近、若遠、所有諸香，悉皆得聞，分別不錯。",
        "translation": "He also knows the distinctive scents of sentient beings-an elephant's scent, a horse's scent, a cow's or sheep's scent, a man's scent, a woman's scent, a boy's or girl's scent, and a woodland scent-if they're near or far, all of them can be heard and discerned quite well.",
        "source": "T09n0262_006:0048b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持是經者，雖住於此，亦聞天上諸天之香——波利質多羅、拘鞞陀羅樹香，及曼陀羅華香、摩訶曼陀羅華香、曼殊沙華香、摩訶曼殊沙華香、栴檀、沈水、種種末香，諸雜華香——如是等天香和合所出之香，無不聞知。",
        "translation": "Even though he holds this sūtra, he'll still hear the heavenly gods' fragrances-the fragrance of the pārijātaka and kovidāra trees, the fragrance of the mandāra flower, the mahāmandāra flower, the fragrance of the mañjūṣaka, the fragrance of the mahāmandāsaka, the fragrance of sandalwood, sunken water, various powdered fragrances, and various other flowers-that are produced by combining such heavenly fragrances, and he'll hear them all.",
        "source": "T09n0262_006:0048b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又聞諸天身香——釋提桓因在勝殿上，五欲娛樂嬉戲時香；若在妙法堂上，為忉利諸天說法時香；若於諸園遊戲時香；及餘天等男女身香，皆悉遙聞。",
        "translation": "They also hear the fragrance of the bodies of the gods - the fragrance of Śakrodevānām when he's playing in the five desires in the Vaiśravaṇa Hall, the fragrance of the Dharma hall when he's teaching the Dharma to the Heaven of the Thirty-three, the fragrance of the parks when he's playing, and the fragrance of the bodies of the other gods and goddesses - they're all distantly heard.",
        "source": "T09n0262_006:0048c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是展轉乃至梵世，上至有頂諸天身香，亦皆聞之，并聞諸天所燒之香。",
        "translation": "They also hear the fragrance of the bodies of the gods up to the highest level of existence, and they hear the fragrance burned by the gods.",
        "source": "T09n0262_006:0048c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及聲聞香、辟支佛香、菩薩香、諸佛身香，亦皆遙聞，知其所在。",
        "translation": "They also hear distantly the fragrance of śrāvakas, the fragrance of solitary buddhas, the fragrance of bodhisattvas, and the fragrance of the bodies of buddhas, and they all know where they are.",
        "source": "T09n0262_006:0048c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖聞此香，然於鼻根不壞不錯，若欲分別為他人說，憶念不謬。」",
        "translation": "Even though they hear this fragrance, it's not bad for their nostrils to perceive it, and if they want to discern it for others, their memory won't be mistaken.\"",
        "source": "T09n0262_006:0048c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「是人鼻清淨，　　於此世界中，　若香若臭物，　　種種悉聞知。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke the verse, \"That person's nose is pure, and in this world they hear all kinds of things, whether fragrant or smelly, that are perceived.",
        "source": "T09n0262_006:0048c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　須曼那闍提、　　多摩羅栴檀、　沈水及桂香，　　種種華菓香，　及知眾生香，　　男子女人香，　說法者遠住，　　聞香知所在。",
        "translation": "The fragrance of sumati, tamālapatra, sinking water, and cinnamon, the fragrance of various flowers and fruits, and the knowledge of the fragrance of sentient beings and the fragrance of men and women are all present in the world, and the Dharma preacher lives far away and knows where that fragrance is when he hears it.",
        "source": "T09n0262_006:0048c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大勢轉輪王，　　小轉輪及子，　群臣諸宮人，　　聞香知所在。",
        "translation": "The wheel-turning king of great power, the young wheel-turners and their sons, and a multitude of ministers and court officials hear the fragrance and know where it is.",
        "source": "T09n0262_006:0048c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身所著珍寶，　　及地中寶藏，　轉輪王寶女，　　聞香知所在。",
        "translation": "They wear treasures in their bodies and store treasures in the earth, and they know where the wheel-turning king's precious women are when they hear their fragrance.",
        "source": "T09n0262_006:0048c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸人嚴身具，　　衣服及瓔珞，　種種所塗香，　　聞香知其身。",
        "translation": "They are adorned with personal adornments, clothing, and jewelry, and variously-coated fragrances, and they know where they are when they hear their fragrance.",
        "source": "T09n0262_006:0048c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天若行坐，　　遊戲及神變，　持是法華者，　　聞香悉能知。",
        "translation": "Even gods who walk and sit, play, and perform miracles can all be known by hearing the fragrance of this dharma-flower.",
        "source": "T09n0262_006:0048c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸樹華菓實，　　及酥油香氣，　持經者住此，　　悉知其所在。",
        "translation": "The fragrance of flowers, trees, fruits, and fruits, as well as butter, are all known to the bearer of the sūtras when he lives here.",
        "source": "T09n0262_006:0048c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸山深嶮處，　　栴檀樹花敷，　眾生在中者，　　聞香皆能知。",
        "translation": "The mountains are deep and precipitous, and the sandalwood trees are covered with flowers, so sentient beings who are in them can hear their fragrance and know it.",
        "source": "T09n0262_006:0048c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鐵圍山大海，　　地中諸眾生，　持經者聞香，　　悉知其所在。",
        "translation": "The great ocean of Mount Telegraph and the sentient beings in its midst are all known to the bearer of the sūtra when he hears its fragrance.",
        "source": "T09n0262_006:0049a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿修羅男女，　　及其諸眷屬，　鬪諍遊戲時，　　聞香皆能知。",
        "translation": "When asuras, boys, girls, and their retinues fight and play, they all know it when they hear the scent.",
        "source": "T09n0262_006:0049a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　曠野險隘處，　　師子象虎狼，　野牛水牛等，　　聞香知所在。",
        "translation": "In the wilderness and in difficult places, a lion, an elephant, a tiger, a wolf, or a wild ox or buffalo hears the scent and knows where it is.",
        "source": "T09n0262_006:0049a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有懷妊者，　　未辯其男女，　無根及非人，　　聞香悉能知。",
        "translation": "If someone is pregnant, doesn't know their male from their female, and has no faculties or is a non-human, they'll be able to know it when they hear the scent.",
        "source": "T09n0262_006:0049a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以聞香力故，　　知其初懷妊，　成就不成就，　　安樂產福子。",
        "translation": "Because of the power of smelling incense, they'll know when they're first expecting, whether they've achieved success or failure, and whether they've produced a happy, blessed child.",
        "source": "T09n0262_006:0049a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以聞香力故，　　知男女所念，　染欲癡恚心，　　亦知修善者。",
        "translation": "Because of the power of smelling incense, he knows what men and women think, what's defiled by desire and delusion, and what's cultivated in goodness.",
        "source": "T09n0262_006:0049a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　地中眾伏藏，　　金銀諸珍寶，　銅器之所盛，　　聞香悉能知。",
        "translation": "The many hidden treasures in the earth, the treasures of gold and silver, and the bronze vessels that contain them can all be known by hearing fragrance.",
        "source": "T09n0262_006:0049a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種諸瓔珞，　　無能識其價，　聞香知貴賤，　　出處及所在。",
        "translation": "There are various kinds of jewelry, the value of which cannot be known, and the scent of which tells of their value and price, as well as their place of origin and location.",
        "source": "T09n0262_006:0049a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天上諸華等，　　曼陀曼殊沙、　波利質多樹，　　聞香悉能知。",
        "translation": "The flowers in the heavens, such as the mandarin tree and the pārijāta tree, are all knowable by the smell of their fragrance.",
        "source": "T09n0262_006:0049a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天上諸宮殿，　　上中下差別，　眾寶花莊嚴，　　聞香悉能知。",
        "translation": "The palaces in the heavens are distinguished between upper and middle, and they're adorned with flowers of many treasures, which can be readily known by the smell of their fragrance.",
        "source": "T09n0262_006:0049a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天園林勝殿，　　諸觀妙法堂，　在中而娛樂，　　聞香悉能知。",
        "translation": "In the forested halls of the heavenly realm, there are wonderful dharma-halls of contemplation, in which they entertain themselves and whose fragrance is well known when they hear it.",
        "source": "T09n0262_006:0049a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天若聽法，　　或受五欲時，　來往行坐臥，　　聞香悉能知。",
        "translation": "When the gods listen to the teaching or experience the five desires, they move, sit, and lay down, and the smell of fragrance is well known.",
        "source": "T09n0262_006:0049a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天女所著衣，　　好華香莊嚴，　周旋遊戲時，　　聞香悉能知。",
        "translation": "When the goddesses are dressed in robes that are adorned with the scent of flowers, they can hear the scent and know it when they're playing around.",
        "source": "T09n0262_006:0049a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是展轉上，　　乃至於梵世，　入禪出禪者，　　聞香悉能知。",
        "translation": "As they move up in this way, up to the Brahma world, those who enter and leave meditation are able to hear the fragrance and know it.",
        "source": "T09n0262_006:0049a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　光音遍淨天，　　乃至于有頂，　初生及退沒，　　聞香悉能知。",
        "translation": "The sound of light pervades the pure heavens ... up to the highest level of existence, where the fragrance is well known when it's heard by those who are first born and those who have vanished.",
        "source": "T09n0262_006:0049b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸比丘眾等，　　於法常精進，　若坐若經行，　　及讀誦經法，　或在林樹下，　　專精而坐禪，　持經者聞香，　　悉知其所在。",
        "translation": "If you sit or practice sūtras or read and recite their teachings, or if you sit under a tree in a forest and concentrate on meditation, the bearer of the sūtra who hears the fragrance will know exactly where it is.",
        "source": "T09n0262_006:0049b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩志堅固，　　坐禪若讀誦，　或為人說法，　　聞香悉能知。",
        "translation": "A bodhisattva with a resolute mind can read and recite sūtras while sitting in meditation, or he might preach for others, and he's fully aware of their location when he hears their fragrance.",
        "source": "T09n0262_006:0049b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　在在方世尊，　　一切所恭敬，　愍眾而說法，　　聞香悉能知。",
        "translation": "The Bhagavān is respected by everyone everywhere, and he's compassionate and teaches the Dharma, and he's well known by the smell of incense.",
        "source": "T09n0262_006:0049b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生在佛前，　　聞經皆歡喜，　如法而修行，　　聞香悉能知。",
        "translation": "When sentient beings come before the Buddha, they rejoice when they hear the sūtras, and they practice according to the teachings, which are well known when they hear the fragrance.",
        "source": "T09n0262_006:0049b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖未得菩薩，　　無漏法生鼻，　而是持經者，　　先得此鼻相。」",
        "translation": "Even though they haven't yet attained bodhisattvahood, the untainted Dharma produces a nose, but those who maintain the sūtras first attain this nose characteristic.\"",
        "source": "T09n0262_006:0049b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，常精進！",
        "translation": "\"Furthermore, always exert yourself!",
        "source": "T09n0262_006:0049b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人，受持是經，若讀、若誦、若解說、若書寫，得千二百舌功德。",
        "translation": "\"If good men and good women memorize this sūtra and read, recite, explain, or write it, they'll attain the merit of 1,200 tongues.",
        "source": "T09n0262_006:0049b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若好、若醜，若美、不美，及諸苦澁物，在其舌根，皆變成上味，如天甘露，無不美者。",
        "translation": "Whatever is beautiful, whatever is ugly, whatever is beautiful, whatever is not beautiful, and whatever is painful and base, whatever is present in their tongue faculty becomes superior in taste, like the sweet dew of the gods, and there's nothing that isn't beautiful.",
        "source": "T09n0262_006:0049b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以舌根於大眾中有所演說，出深妙聲，能入其心，皆令歡喜快樂。",
        "translation": "If he uses his tongue to address the crowd and produce a profound and subtle sound that enters their minds, it makes them rejoice and be happy.",
        "source": "T09n0262_006:0049b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸天子、天女，釋梵諸天，聞是深妙音聲，有所演說言論次第，皆悉來聽。",
        "translation": "Also, the gods, goddesses, and Śakra gods all come to hear this profound and wonderful sound and the sequence of discourses that it teaches.",
        "source": "T09n0262_006:0049b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及諸龍、龍女，夜叉、夜叉女，乾闥婆、乾闥婆女，阿修羅、阿修羅女，迦樓羅、迦樓羅女，緊那羅、緊那羅女，摩睺羅伽、摩睺羅伽女，為聽法故，皆來親近恭敬供養。",
        "translation": "The dragons and nymphs, yakṣas and yakṣa women, gandharvas and gandharva women, asuras and asura women, garuḍas and garuḍa women, kiṃnara and kiṃnara women, and mahoraga and mahoraga women all came to listen to the teaching and to pay their respects and offer support.",
        "source": "T09n0262_006:0049b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及比丘、比丘尼，優婆塞、優婆夷，國王、王子、群臣、眷屬，小轉輪王、大轉輪王、七寶千子內外眷屬，乘其宮殿，俱來聽法，以是菩薩善說法故。",
        "translation": "Monks, nuns, laymen, laywomen, rulers, princes, ministers, retinues, junior wheel-turning kings, great wheel-turning kings, and the inner and outer retinues of the thousand sons of the seven jewels rode in their palaces and came to listen to the teaching because the bodhisattva was good at teaching the Dharma.",
        "source": "T09n0262_006:0049b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門、居士、國內人民、盡其形壽，隨侍供養。",
        "translation": "Brāhmaṇas, householders, and people inside the country spent their whole lives following and making offerings.",
        "source": "T09n0262_006:0049b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸聲聞、辟支佛、菩薩、諸佛，常樂見之。",
        "translation": "The śrāvakas, pratyekbuddhas, bodhisattvas, and buddhas are always happy to see them.",
        "source": "T09n0262_006:0049c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人所在方面，諸佛皆向其處說法，悉能受持一切佛法，又能出於深妙法音。」",
        "translation": "Where that person is, the buddhas will always address him, and he'll be able to accept all the Buddha's teachings and produce a profound and subtle Dharma voice.\"",
        "source": "T09n0262_006:0049c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「是人舌根淨，　　終不受惡味，　其有所食噉，　　悉皆成甘露。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke the verse, \"That person's tongue is so pure that it never tastes bad, and whatever they eat and gnaw on becomes nectar.",
        "source": "T09n0262_006:0049c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以深淨妙聲，　　於大眾說法，　以諸因緣喻，　　引導眾生心，　聞者皆歡喜，　　設諸上供養。",
        "translation": "With a deep, pure, and marvelous voice, he preaches to the masses, guiding the minds of sentient beings with parables of causes and conditions, making hearers rejoice, and offering them great sacrifices.",
        "source": "T09n0262_006:0049c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天龍夜叉，　　及阿修羅等，　皆以恭敬心，　　而共來聽法，　是說法之人，　　若欲以妙音，　遍滿三千界，　　隨意即能至。",
        "translation": "Gods, dragons, nightjars, asuras, and others all come together to listen to the teaching with respect, and this Dharma preacher wants to use his marvelous voice to reach 3,000 realms at will.",
        "source": "T09n0262_006:0049c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大小轉輪王，　　及千子眷屬，　合掌恭敬心，　　常來聽受法。",
        "translation": "Wheel-turning kings large and small, along with a thousand of their sons and retinues, join their palms in respect and always come to hear and accept the teaching.",
        "source": "T09n0262_006:0049c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天龍夜叉、　　羅剎毘舍闍，　亦以歡喜心，　　常樂來供養。",
        "translation": "The gods, dragons, yakṣas, and Rāṣṭrapāla also rejoice and come to make offerings with joy.",
        "source": "T09n0262_006:0049c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵天王魔王，　　自在大自在，　如是諸天眾，　　常來至其所。",
        "translation": "Brahmā, the king of gods and Māra, has great sovereignty, and so do a multitude of gods who always come to him.",
        "source": "T09n0262_006:0049c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛及弟子，　　聞其說法音，　常念而守護，　　或時為現身。",
        "translation": "The buddhas and their disciples hear the sound of their teaching, are always mindful and guard it, and sometimes it appears in their bodies.",
        "source": "T09n0262_006:0049c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，常精進！",
        "translation": "\"Furthermore, they'll always exert themselves!",
        "source": "T09n0262_006:0049c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人，受持是經，若讀、若誦，若解說、若書寫，得八百身功德。",
        "translation": "\"If good men and good women memorize this sūtra and read, recite, explain, and write it, they'll attain the merit of eight hundred bodies.",
        "source": "T09n0262_006:0049c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得清淨身、如淨琉璃，眾生憙見。",
        "translation": "They'll attain a pure body like pure emerald, which sentient beings see with joy.",
        "source": "T09n0262_006:0049c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其身淨故，三千大千世界眾生，生時、死時，上下、好醜，生善處、惡處，悉於中現。",
        "translation": "Because their body is purified, it's fully visible to sentient beings in the 3,000 great one-thousand worlds when they're born and when they die, up and down, beautiful and ugly, and born in good and bad places.",
        "source": "T09n0262_006:0049c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及鐵圍山、大鐵圍山、彌樓山、摩訶彌樓山等諸山，及其中眾生，悉於中現。",
        "translation": "Mount Telegraph, Mount Great Telegraph, Mount Miliṇḍa, Mount Mahāmiliṇḍa, and other mountains and the sentient beings within them are all present in them.",
        "source": "T09n0262_006:0049c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下至阿鼻地獄，上至有頂，所有及眾生，悉於中現。",
        "translation": "Down to the avīci hell and up to the top of existence, all of them and all sentient beings are present in them.",
        "source": "T09n0262_006:0049c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聲聞、辟支佛、菩薩、諸佛、說法，皆於身中現其色像。」",
        "translation": "If śrāvakas, pratyekabuddhas, bodhisattvas, and Dharma teachers were to present their images in their bodies, then the Bhagavān wanted to repeat what he had said.\"",
        "source": "T09n0262_006:0049c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「若持法花者，　　其身甚清淨，　如彼淨琉璃，　　眾生皆憙見。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke the verse, \"If someone holds the dharma-flower, their body is so pure that sentient beings are delighted to see it like that pure emerald.",
        "source": "T09n0262_006:0050a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又如淨明鏡，　　悉見諸色像，　菩薩於淨身，　　皆見世所有，　唯獨自明了，　　餘人所不見。",
        "translation": "Like a clear mirror that sees all forms and images, a bodhisattva's pure body is seen by all in the world, except for his own insight, which is invisible to the rest of the world.",
        "source": "T09n0262_006:0050a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三千世界中，　　一切諸群萌，　天人阿修羅、　　地獄鬼畜生，　如是諸色像，　　皆於身中現。",
        "translation": "In the 3,000 worlds, all the various sentient beings, gods, humans, asuras, hells, ghosts, and animals, such various forms and images are all present in their bodies.",
        "source": "T09n0262_006:0050a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天等宮殿，　　乃至於有頂，　鐵圍及彌樓、　　摩訶彌樓山，　諸大海水等，　　皆於身中現。",
        "translation": "The palaces of gods and so forth, up to the top of existence, the iron ring, Miliṇḍa, Mount Mahāmiliṇḍa, and the vast waters of the ocean are all present in the body.",
        "source": "T09n0262_006:0050a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛及聲聞，　　佛子菩薩等，　若獨若在眾，　　說法悉皆現。",
        "translation": "The buddhas, śrāvakas, sons of the Buddha, and bodhisattvas, whether alone or in community, all explain the Dharma in their presence.",
        "source": "T09n0262_006:0050a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖未得無漏，　　法性之妙身，　以清淨常體，　　一切於中現。",
        "translation": "Even though they haven't yet attained the untainted, the Dharma-nature's marvelous body has a pure and permanent body, and everything is present in it.",
        "source": "T09n0262_006:0050a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，常精進！",
        "translation": "\"Furthermore, always exert yourself!",
        "source": "T09n0262_006:0050a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人，如來滅後、受持是經，若讀、若誦、若解說、若書寫，得千二百意功德。",
        "translation": "\"If good sons and good women accept this sūtra after the Tathāgata's death and if they read, recite, explain, or write it, they'll attain the merit of 1,200 intentions.",
        "source": "T09n0262_006:0050a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是清淨意根，乃至聞一偈一句，通達無量無邊之義，解是義已，能演說一句一偈至於一月、四月乃至一歲，諸所說法，隨其義趣，皆與實相不相違背。",
        "translation": "Because of this purified mental faculty, even hearing a single verse, they'll be able to comprehend measureless and limitless meanings, and after understanding their meanings, they'll be able to expound a single verse for a month, four months, or even a year, teaching various things according to their meanings that are not at odds with their true characteristics.",
        "source": "T09n0262_006:0050a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說俗間經書、治世語言、資生業等，皆順正法。",
        "translation": "If he teaches secular scriptures, worldly language, and birth-containing activities, they all conform to the true teaching.",
        "source": "T09n0262_006:0050a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界六趣眾生，心之所行、心所動作、心所戲論，皆悉知之。",
        "translation": "They all fully know the actions of the mind, the movements of the mind, and the conspiracies of the mind of sentient beings in the six destinies of the 3,000 great one-thousand worlds.",
        "source": "T09n0262_006:0050a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖未得無漏智慧，而其意根、清淨如此。",
        "translation": "Although they haven't yet attained untainted wisdom, their mind faculty is so pure.",
        "source": "T09n0262_006:0050a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人有所思惟、籌量、言說，皆是佛法，無不真實，亦是先佛經中所說。」",
        "translation": "Whatever this person contemplates, gauges, or speaks, it's all the Buddha's teaching, nothing less than the truth, and it's also what was explained in previous Buddha sutras.\"",
        "source": "T09n0262_006:0050a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「是人意清淨，　　明利無穢濁，　以此妙意根，　　知上中下法，　乃至聞一偈，　　通達無量義，　次第如法說，　　月四月至歲。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke in verse, saying, \"That person's mind is pure, clear, and unsullied, and with this wonderful mental faculty they know the higher, middle, and lower dharmas ... up to the point where they hear a single verse and comprehend measureless meanings, which are explained in order according to the teaching, from month to month and from month to year.",
        "source": "T09n0262_006:0050a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是世界內外，　　一切諸眾生，　若天龍及人、　　夜叉鬼神等，　其在六趣中，　　所念若干種，　持法花之報，　　一時皆悉知。",
        "translation": "All sentient beings in and outside this world, whether gods, dragons, humans, yakṣas, ghosts, or spirits, are in the six destinies, and the various ways they think about the rewards of holding the Dharma flower are all known at once.",
        "source": "T09n0262_006:0050b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方無數佛，　　百福莊嚴相，　為眾生說法，　　悉聞能受持。",
        "translation": "Countless buddhas in the ten directions, adorned with a hundred blessings, speak Dharma for sentient beings and are heard and upheld by all of them.",
        "source": "T09n0262_006:0050b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　思惟無量義，　　說法亦無量，　終始不忘錯，　　以持法華故。",
        "translation": "They contemplate measureless meanings, expound measureless teachings, and never forget mistakes in the end because they hold the dharma-flower.",
        "source": "T09n0262_006:0050b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉知諸法相，　　隨義識次第，　達名字語言，　　如所知演說。",
        "translation": "He fully knows the characteristics of all dharmas, follows their meanings and consciousnesses in order, and comprehends names and words as he knows how to explain them.",
        "source": "T09n0262_006:0050b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此人有所說，　　皆是先佛法，　以演此法故，　　於眾無所畏。",
        "translation": "Whatever this person teaches, it's all the prior Buddha's teaching, and because he teaches this teaching, he has no fear of the crowd.",
        "source": "T09n0262_006:0050b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持法花經者，　　意根淨若斯，　雖未得無漏，　　先有如是相。",
        "translation": "That person who holds the Lotus Sutra has such pure mental faculties that, even though they haven't yet attained the uncontaminated, they first had this kind of appearance.",
        "source": "T09n0262_006:0050b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人持此經，　　安住希有地，　為一切眾生，　　歡喜而愛敬。",
        "translation": "That person holds this sūtra, abides in a rare state, and rejoices and adores it for all sentient beings.",
        "source": "T09n0262_006:0050b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能以千萬種，　　善巧之語言，　分別而說法，　　持法花經故。」",
        "translation": "He can discern and teach with a thousand kinds of skillful words because he holds the Lotus Sutra.\"",
        "source": "T09n0262_006:0050b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經常不輕菩薩品第二十",
        "translation": "Sutra of the Lotus of the Wonderful Dharma, Chapter 20 of the Never Despising Bodhisattva",
        "source": "T09n0262_006:0050b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告得大勢菩薩摩訶薩：「汝今當知！",
        "translation": "It was then that the Buddha addressed the Bodhisattva Mahāsattva who had attained great power, \"Now you should know!",
        "source": "T09n0262_006:0050b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘、比丘尼、優婆塞、優婆夷持法花經者，若有惡口、罵詈、誹謗，獲大罪報，如前所說；其所得功德，如向所說，眼、耳、鼻、舌、身、意清淨。",
        "translation": "If monks, nuns, laymen, or laywomen uphold the Lotus Sutra, their harsh words, insults, and slanders will result in the great misdeeds described above and the merits they will attain, as explained above, of purifying their eyes, ears, nose, tongue, body, and mind.",
        "source": "T09n0262_006:0050b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得大勢！",
        "translation": "\"They'll attain great power!",
        "source": "T09n0262_006:0050b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古昔，過無量無邊不可思議阿僧祇劫，有佛名威音王如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "Once upon a time, throughout an incalculably long and unfathomably long eon, there was a Buddha named Meghasvararāja Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfectly Virtuous, Well Gone, Understander of the World, Unsurpassed Person, Tamer of Beings, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T09n0262_006:0050b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劫名離衰，國名大成。",
        "translation": "The eon is called Licchavi, and the country is called Dacheng.",
        "source": "T09n0262_006:0050c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其威音王佛，於彼世中，為天、人、阿修羅說法，為求聲聞者，說應四諦法，度生老病死，究竟涅槃；為求辟支佛者，說應十二因緣法；為諸菩薩，因阿耨多羅三藐三菩提，說應六波羅蜜法，究竟佛慧。",
        "translation": "In that world, the Buddha, the King of Meghasvara, teaches the Dharma for gods, humans, and asuras, teaching those who seek śrāvakas the teachings that are appropriate to the four truths, which liberate birth, old age, illness, and death and lead to final nirvāṇa; those who seek the solitary buddhas the teachings that are appropriate to the twelve causes and conditions; and the bodhisattvas the teachings that are appropriate to the six perfections as a result of the unsurpassed, correct enlightenment, which leads to final Buddha wisdom.",
        "source": "T09n0262_006:0050c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得大勢！",
        "translation": "\"Attain great power!",
        "source": "T09n0262_006:0050c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是威音王佛，壽四十萬億那由他恒河沙劫；正法住世劫數，如一閻浮提微塵；像法住世劫數，如四天下微塵。",
        "translation": "是威音王佛，壽四十萬億那由他恒河沙劫；正法住世劫數，如一閻浮提微塵；像法住世劫數，如四天下微塵。",
        "source": "T09n0262_006:0050c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛饒益眾生已，然後滅度。",
        "translation": "After that Buddha benefits sentient beings, then he goes into extinction.",
        "source": "T09n0262_006:0050c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法、像法滅盡之後，於此國土復有佛出，亦號威音王如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "After the right Dharma and the conventional Dharma cease, another Buddha appears in this land, also called Meghasvararāja Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Tamer of Beings, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T09n0262_006:0050c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是次第有二萬億佛，皆同一號。",
        "translation": "Thus, there are two thousand million buddhas in this order, all with the same name.",
        "source": "T09n0262_006:0050c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「最初威音王如來既已滅度，正法滅後，於像法中，增上慢比丘有大勢力。",
        "translation": "\"After the first Tathāgata Meghasvara had ceased to exist and the true teaching had ceased, the monk with superior conceit had great power among the images and teachings.",
        "source": "T09n0262_006:0050c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有一菩薩比丘名常不輕。",
        "translation": "At the time, there was a bodhisattva monk named Everlastingly Undaunted.",
        "source": "T09n0262_006:0050c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得大勢！",
        "translation": "He attained great power!",
        "source": "T09n0262_006:0050c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣名常不輕？",
        "translation": "By what cause is it called eternal and not despised?",
        "source": "T09n0262_006:0050c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘，凡有所見——若比丘、比丘尼、優婆塞、優婆夷——皆悉禮拜讚歎而作是言：『我深敬汝等，不敢輕慢。",
        "translation": "\"Suppose a monk who sees something - a monk, a nun, an upāsaka, or an upāsik - venerates and praises them, saying, 'I deeply respect you, and I dare not despise you.'",
        "source": "T09n0262_006:0050c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0262_006:0050c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等皆行菩薩道，當得作佛。』",
        "translation": "All of you who practice the bodhisattva path will become buddhas.'",
        "source": "T09n0262_006:0050c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而是比丘，不專讀誦經典，但行禮拜，乃至遠見四眾，亦復故往禮拜讚歎而作是言：『我不敢輕於汝等，汝等皆當作佛。』",
        "translation": "Rather, it's a monk who doesn't concentrate on reciting the sūtras but instead venerates them, even going so far as to look at the four groups of people, venerating and praising them, and saying, 'I dare not despise you, for you will all become buddhas.'",
        "source": "T09n0262_006:0050c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四眾之中，有生瞋恚、心不淨者，惡口罵詈言：『是無智比丘從何所來？",
        "translation": "Among the four groups, there's someone who becomes angry and has an impure mind and badmouths him, saying, 'Where did that ignorant monk come from?'",
        "source": "T09n0262_006:0050c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自言：「我不輕汝。」",
        "translation": "He said, \"I don't despise you.\"",
        "source": "T09n0262_006:0050c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而與我等授記，當得作佛。",
        "translation": "Give us a prediction that we'll become buddhas.",
        "source": "T09n0262_006:0050c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等不用如是虛妄授記。』",
        "translation": "We won't need such a false prediction.'",
        "source": "T09n0262_006:0050c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此經歷多年，常被罵詈，不生瞋恚，常作是言：『汝當作佛。』",
        "translation": "After years of going through this, he's always being ridiculed, but he doesn't become angry and always says, 'You will become a buddha.'",
        "source": "T09n0262_006:0050c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，眾人或以杖木瓦石而打擲之，避走遠住，猶高聲唱言：『我不敢輕於汝等，汝等皆當作佛。』",
        "translation": "When he said that, the people would throw sticks, wood, tiles, and stones at him or run away, but they would still shout, saying, 'I dare not despise you, for you will all become buddhas.'",
        "source": "T09n0262_006:0050c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以其常作是語故，增上慢比丘、比丘尼、優婆塞、優婆夷，號之為常不輕。",
        "translation": "Because he always says that, the conceited monk, nun, layman, and laywoman are called always not despising.",
        "source": "T09n0262_006:0051a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘臨欲終時，於虛空中，具聞威音王佛先所說法華經二十千萬億偈，悉能受持，即得如上眼根清淨、耳鼻舌身意根清淨。",
        "translation": "When that monk was about to die, he had heard in the sky the 20,000,000,000,000 verses of the Lotus Sutra taught by the King of Vairocana before, and he was able to memorize them all, so that he could attain the purification of the eye faculty as described above, and the purification of the ear, nose, tongue, body, and mind faculties.",
        "source": "T09n0262_006:0051a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得是六根清淨已，更增壽命二百萬億那由他歲，廣為人說是法華經。",
        "translation": "After attaining the purity of these six faculties, he increased his life expectancy by 200,000,000,000,000,000,000,000,000,000,000,000,000,000 years and spoke extensively about this Lotus Sutra for people.",
        "source": "T09n0262_006:0051a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時增上慢四眾——比丘、比丘尼、優婆塞、優婆夷——輕賤是人，為作不輕名者，見其得大神通力、樂說辯力、大善寂力，聞其所說，皆信伏隨從。",
        "translation": "When the four groups of arrogant monks, nuns, laymen, and barbarians who despise this person and who make a name for themselves, see that they have attained great supernormal powers, the power of eloquence, and the power of great tranquility, they all believe, submit, and follow what they hear him teach.",
        "source": "T09n0262_006:0051a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩復化千萬億眾，令住阿耨多羅三藐三菩提。",
        "translation": "That bodhisattva then again transforms a thousand trillion multitudes into the abode of unsurpassed, correct enlightenment.",
        "source": "T09n0262_006:0051a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命終之後，得值二千億佛，皆號日月燈明，於其法中，說是法華經。",
        "translation": "After his life ended, he attained the presence of 200 billion buddhas, all called the Candra of the Sun and Moon, who taught this Lotus Sutra among their teachings.",
        "source": "T09n0262_006:0051a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，復值二千億佛，同號雲自在燈王，於此諸佛法中，受持讀誦，為諸四眾說此經典故，得是常眼清淨，耳、鼻、舌、身、意諸根清淨，於四眾中說法，心無所畏。",
        "translation": "Because of this, he again attained the appointment of 200 billion buddhas, all called the Lamp King of the Autarchy of the Clouds, who would receive, retain, and recite the sūtras in the teachings of these buddhas and teach them to the four congregations, thereby attaining the purity of the ordinary eye and the purity of the ear, nose, tongue, body, and mental faculties, and he would preach among the four congregations without fear.",
        "source": "T09n0262_006:0051a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得大勢！",
        "translation": "\"They'll attain great power!",
        "source": "T09n0262_006:0051a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是常不輕菩薩摩訶薩，供養如是若干諸佛，恭敬、尊重、讚歎、種諸善根，於後復值千萬億佛，亦於諸佛法中說是經典，功德成就，當得作佛。",
        "translation": "Thus, the eternal, undaunted bodhisattva Mahāsattva makes offerings to such-and-such a number of buddhas, honors, respects, praises, and plants good roots, and then he meets a thousand million million buddhas and teaches these sūtras among the buddha-teachings, accomplishing their merits and then attains Buddhahood.",
        "source": "T09n0262_006:0051a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得大勢！",
        "translation": "\"Attain great power!",
        "source": "T09n0262_006:0051a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T09n0262_006:0051a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時常不輕菩薩豈異人乎？",
        "translation": "At that point, is the bodhisattva Never Despising different from others?",
        "source": "T09n0262_006:0051a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則我身是。",
        "translation": "\"Then I am this person.",
        "source": "T09n0262_006:0051a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我於宿世不受持讀誦此經、為他人說者，不能疾得阿耨多羅三藐三菩提。",
        "translation": "If I hadn't accepted, read, and recited this sūtra for others in prior lifetimes, I wouldn't have quickly attained unsurpassed, correct, and complete enlightenment.",
        "source": "T09n0262_006:0051a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於先佛所，受持讀誦此經、為人說故，疾得阿耨多羅三藐三菩提。",
        "translation": "Because I had previously accepted, read, and recited this sūtra for others, I quickly attained unsurpassed, correct, and complete enlightenment.",
        "source": "T09n0262_006:0051a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得大勢！",
        "translation": "\"Attain great power!",
        "source": "T09n0262_006:0051a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時四眾——比丘、比丘尼、優婆塞、優婆夷——以瞋恚意輕賤我故，二百億劫常不值佛、不聞法、不見僧，千劫於阿鼻地獄受大苦惱。",
        "translation": "Because they despised me with anger, those four people-bhikṣus, bhikṣus and nuns, upāsaka and upāsike-for 20 billion eons never met the Buddha, never heard the Dharma, and never saw the saṃgha, and for 1,000 eons they were subjected to great suffering in the avīci hell.",
        "source": "T09n0262_006:0051a26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畢是罪已，復遇常不輕菩薩，教化阿耨多羅三藐三菩提。",
        "translation": "After completing this misdeed, he then met the Never Despising Bodhisattva, who taught him to perfect perfect enlightenment.",
        "source": "T09n0262_006:0051a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得大勢，於汝意云何？",
        "translation": "\"Having attained great power, what do you think?",
        "source": "T09n0262_006:0051b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時四眾常輕是菩薩者，豈異人乎？",
        "translation": "At the time, the four groups of people always despised this bodhisattva, don't they?",
        "source": "T09n0262_006:0051b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此會中跋陀婆羅等五百菩薩、師子月等五百比丘、尼思佛等五百優婆塞，皆於阿耨多羅三藐三菩提不退轉者是。",
        "translation": "Now, in this assembly, there are 500 bodhisattvas like Bhadrapāla, 500 monks like Shizi Yue, and 500 laymen like Nisibuddha, all of whom have not turned back from the unsurpassed, correct enlightenment.",
        "source": "T09n0262_006:0051b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得大勢！",
        "translation": "\"They've attained great power!",
        "source": "T09n0262_006:0051b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是法華經，大饒益諸菩薩摩訶薩，能令至於阿耨多羅三藐三菩提。",
        "translation": "You should know that this is the Lotus Sutra that greatly benefits bodhisattvas, mahāsattvas, and can cause them to reach unsurpassed, correct, and complete enlightenment.",
        "source": "T09n0262_006:0051b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故諸菩薩摩訶薩，於如來滅後，常應受持、讀誦、解說、書寫是經。」",
        "translation": "Therefore, all bodhisattvas, mahāsattvas, should always accept, recite, explain, and write this sūtra after the Tathāgata's death.\"",
        "source": "T09n0262_006:0051b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「過去有佛，　　號威音王，　　神智無量，　將導一切，　　天人龍神，　　所共供養。",
        "translation": "It was then that the Bhagavān wanted to recapitulate this meaning and spoke in verse, saying, \"There once was a Buddha named Meghasvararāja, whose spiritual wisdom was immeasurable and who guided all beings and was worshipped by gods, humans, dragons, and spirits.",
        "source": "T09n0262_006:0051b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是佛滅後，　　法欲盡時，　　有一菩薩，　名常不輕。",
        "translation": "After that Buddha died and when the Dharma was about to end, there was a bodhisattva whose name was always Never Despising.",
        "source": "T09n0262_006:0051b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　時諸四眾，　　計著於法。",
        "translation": "The four groups of people at the time were focused on the Dharma.",
        "source": "T09n0262_006:0051b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不輕菩薩，　　往到其所，　　而語之言：『我不輕汝，　　汝等行道，　　皆當作佛。』",
        "translation": "The Bodhisattva Never Despising went to them and said, 'I don't despise you, and all of you who practice the path will become buddhas.'",
        "source": "T09n0262_006:0051b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸人聞已，　　輕毀罵詈；　　不輕菩薩，　能忍受之。",
        "translation": "When those people hear this, they ridicule and insult him, but the Bhagavān can tolerate it.",
        "source": "T09n0262_006:0051b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其罪畢已，　　臨命終時，　得聞此經，　　六根清淨。",
        "translation": "After their crimes are completed, when they reach the end of their lives, they hear this sūtra, and their six faculties are purified.",
        "source": "T09n0262_006:0051b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　神通力故，　增益壽命，　　復為諸人，　　廣說是經。",
        "translation": "Because of their psychic powers, they'll have an increased life expectancy, and they'll explain this sūtra extensively to others.",
        "source": "T09n0262_006:0051b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸著法眾，　　皆蒙菩薩，　　教化成就，　令住佛道。",
        "translation": "All those attached to the Dharma are made to stay in the Buddha Way by the bodhisattvas who teach and guide them to completion.",
        "source": "T09n0262_006:0051b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不輕命終，　　值無數佛，　說是經故，　　得無量福，　　漸具功德，　疾成佛道。",
        "translation": "They don't despise the countless buddhas they meet at the end of their lives, and as a result of teaching this sūtra, they attain measureless merit, gradually build up their virtue, and quickly achieve the Buddha Way.",
        "source": "T09n0262_006:0051b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼時不輕，　　則我身是。",
        "translation": "At the time, that person wasn't despised, but I was.",
        "source": "T09n0262_006:0051b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時四部眾，　　著法之者，　　聞不輕言：『汝當作佛。』",
        "translation": "Those of the four groups of people who were attached to the Dharma then heard what Bhallika said, 'You will become a buddha.'",
        "source": "T09n0262_006:0051b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以是因緣，　　值無數佛。",
        "translation": "Because of these causes and conditions, I've met countless buddhas.",
        "source": "T09n0262_006:0051b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此會菩薩，　　五百之眾，　　并及四部，　清信士女，　　今於我前，　　聽法者是。",
        "translation": "This assembly of bodhisattvas, five hundred members of the congregation, four orders, and faithful men and women are here before me, listening to the teaching.",
        "source": "T09n0262_006:0051b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於前世，　　勸是諸人，　　聽受斯經，　第一之法。",
        "translation": "In a previous life, I encouraged these people to listen to and accept this sūtra, the first teaching.",
        "source": "T09n0262_006:0051b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　開示教人，　　令住涅槃，　世世受持，　　如是經典。",
        "translation": "I instructed them to abide in nirvāṇa and to maintain this sūtra from generation to generation.",
        "source": "T09n0262_006:0051c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　億億萬劫，　至不可議，　　時乃得聞，　　是法華經。",
        "translation": "For a billion million eons, it would have been inconceivable that we would have heard this Lotus Sutra at that time.",
        "source": "T09n0262_006:0051c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　億億萬劫，　　至不可議，　　諸佛世尊、　時說是經。",
        "translation": "For a billion million eons, it would have been inconceivable for the buddhas and world-honored ones to have taught this sūtra at that time.",
        "source": "T09n0262_006:0051c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是故行者，　　於佛滅後，　聞如是經，　　勿生疑惑。",
        "translation": "Therefore, practitioners who hear this sūtra after the Buddha's death shouldn't have any doubts.",
        "source": "T09n0262_006:0051c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　應當一心、　廣說此經，　　世世值佛，　　疾成佛道。」",
        "translation": "They should single-mindedly and extensively explain this sūtra, so that they'll meet the buddhas from generation to generation and quickly achieve the Buddha Way.\"",
        "source": "T09n0262_006:0051c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經如來神力品第二十一",
        "translation": "Saddharmapuṇḍarīka-sūtra Tathāgata's Powers Chapter 21",
        "source": "T09n0262_006:0051c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，千世界微塵等菩薩摩訶薩，從地踊出者，皆於佛前一心合掌，瞻仰尊顏，而白佛言：「世尊！",
        "translation": "At the time, a thousand dusty bodhisattvas and mahāsattvas from all over the world sprang up from the ground, joined their palms with one heart, looked up at the venerable's face, and said to the Buddha, \"Bhagavān!",
        "source": "T09n0262_006:0051c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等於佛滅後，世尊分身所在國土滅度之處，當廣說此經。",
        "translation": "We will explain this sūtra in detail after the Buddha's death and at the place where the Bhagavān's partial body will cease to exist.",
        "source": "T09n0262_006:0051c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0262_006:0051c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等亦自欲得是真淨大法，受持、讀誦、解說、書寫，而供養之。」",
        "translation": "We ourselves also want to attain this truly pure great teaching, memorize it, recite it, expound it, write it down, and make offerings to it.\"",
        "source": "T09n0262_006:0051c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，於文殊師利等無量百千萬億舊住娑婆世界菩薩摩訶薩，及諸比丘、比丘尼、優婆塞、優婆夷，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，一切眾前，現大神力，出廣長舌上至梵世，一切毛孔放於無量無數色光，皆悉遍照十方世界。",
        "translation": "It was then that the Bhagavān, in front of Mañjuśrī and a myriad of hundreds of thousands of millions of other bodhisattvas, mahāsattvas, monks, nuns, laymen, laywomen, gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, mahoragas, humans and nonhumans who used to live in the Śākya World, demonstrated great supernormal powers and emitted a long, broad tongue that reached up to the Brahma World, and his every pore radiated a light of measureless and incalculable color that completely illuminated the world in the ten directions.",
        "source": "T09n0262_006:0051c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾寶樹下、師子座上諸佛，亦復如是，出廣長舌，放無量光。",
        "translation": "The buddhas beneath the jeweled trees and on the lion's throne likewise emitted long, broad tongues that radiated measureless light.",
        "source": "T09n0262_006:0051c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦牟尼佛及寶樹下諸佛現神力時，滿百千歲，然後還攝舌相。",
        "translation": "When Śākyamuni Buddha and the buddhas under the jeweled trees showed their spiritual powers, they completed a hundred thousand years and then reassembled their tongues.",
        "source": "T09n0262_006:0051c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一時謦欬、俱共彈指，是二音聲，遍至十方諸佛世界，地皆六種震動。",
        "translation": "At one point, these two sounds, guttural and mutual, snap their fingers, and reach all the buddha-worlds in the ten directions, causing the ground to shake in six ways.",
        "source": "T09n0262_006:0051c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中眾生，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，以佛神力故，皆見此娑婆世界，無量無邊百千萬億眾寶樹下、師子座上諸佛；及見釋迦牟尼佛共多寶如來，在寶塔中、坐師子座；又見無量無邊百千萬億菩薩摩訶薩及諸四眾，恭敬圍繞釋迦牟尼佛。",
        "translation": "All the sentient beings therein, gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, mahoragas, humans and non-humans, by virtue of the Buddha's supernormal powers, see the buddhas beneath the numberless and limitless hundreds of thousands of millions of precious trees and on lion seats in this sahā world; they also see Śākyamuni Buddha and the Tathāgata Abundant Treasures sitting in a jeweled stūpa on a lion seat; and they see the numberless and limitless hundreds of thousands of millions of bodhisattvas, mahāsattvas, and the four groups of people respectfully surrounding Śākyamuni Buddha.",
        "source": "T09n0262_006:0051c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既見是已，皆大歡喜，得未曾有。",
        "translation": "After seeing them, they were all greatly elated, attaining unprecedented levels of joy.",
        "source": "T09n0262_006:0052a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時諸天、於虛空中、高聲唱言：「過此無量無邊百千萬億阿僧祇世界，有國名娑婆，是中有佛名釋迦牟尼，今為諸菩薩摩訶薩說大乘經，名妙法蓮華，教菩薩法，佛所護念。",
        "translation": "Immediately, the gods raised their voices in the sky and called out, \"Beyond this measureless, limitless, hundred thousand million million incalculable world, there's a country called Sāva, and within it there's a Buddha named Śākyamuni who now teaches the bodhisattvas, the great vehicle sūtra called the Lotus of the Wonderful Dharma, which teaches the bodhisattvas the Dharma and is guarded by the Buddha.",
        "source": "T09n0262_006:0052a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當深心隨喜，亦當禮拜供養釋迦牟尼佛。」",
        "translation": "You must all profoundly rejoice and venerate and make offerings to Śākyamuni Buddha.\"",
        "source": "T09n0262_006:0052a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生，聞虛空中聲已，合掌向娑婆世界作如是言：「南無釋迦牟尼佛！",
        "translation": "After they heard the sound in the sky, those sentient beings joined their palms and said to the Saṃbha world, \"Homage to Śākyamuni Buddha!",
        "source": "T09n0262_006:0052a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南無釋迦牟尼佛！」",
        "translation": "Homage to Śākyamuni Buddha!\"",
        "source": "T09n0262_006:0052a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以種種華、香、瓔珞、幡蓋，及諸嚴身之具、珍寶妙物，皆共遙散娑婆世界。",
        "translation": "With a variety of flowers, incense, jewelry, banners, flags, ornaments, and other ornamental implements and precious and marvelous things, they are all scattered far and wide throughout the Saṃbha world.",
        "source": "T09n0262_006:0052a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所散諸物，從十方來，譬如雲集，變成寶帳，遍覆此間諸佛之上。",
        "translation": "The things that were scattered came from ten directions like clouds that had gathered and turned into a jeweled canopy that covered the buddhas here.",
        "source": "T09n0262_006:0052a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時十方世界，通達無礙，如一佛土。",
        "translation": "At the time, the worlds in the ten directions were accessible and unobstructed, like one Buddha land.",
        "source": "T09n0262_006:0052a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告上行等菩薩大眾：「諸佛神力如是，無量無邊、不可思議，若我以是神力，於無量無邊百千萬億阿僧祇劫，為囑累故，說此經功德，猶不能盡。",
        "translation": "It was then that the Buddha addressed a large group of bodhisattvas, including Shangxing, \"The Buddha's powers are thus incalculable, limitless, and unfathomable, and if I were to explain the merits of this sūtra with such powers for the sake of burdening them during an incalculable, limitless, one hundred thousand million incalculable eons, it still wouldn't be possible to exhaust them.",
        "source": "T09n0262_006:0052a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以要言之，如來一切所有之法、如來一切自在神力、如來一切祕要之藏、如來一切甚深之事，皆於此經宣示顯說。",
        "translation": "To summarize, all of the Tathāgata's teachings, all of the Tathāgata's unimpeded spiritual powers, all of the Tathāgata's secret stores, and all of the Tathāgata's most profound matters are all explained and revealed in this sūtra.",
        "source": "T09n0262_006:0052a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等於如來滅後，應一心受持、讀誦、解說、書寫、如說修行。",
        "translation": "Therefore, after the Tathāgata's cessation, you should wholeheartedly memorize, recite, expound, write, and practice it as it's taught.",
        "source": "T09n0262_006:0052a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所在國土，若有受持、讀誦、解說、書寫、如說修行，若經卷所住之處，若於園中、若於林中、若於樹下、若於僧坊、若白衣舍、若在殿堂、若山谷曠野，是中皆應起塔供養。",
        "translation": "If there's a land where you memorize, recite, expound, write, and practice as explained, and if there's a place where a sūtra scroll lives, whether in a garden, in a forest, under a tree, in a monastery, in a white-robed hut, in a hall, or in a valley or wilderness, you should erect a stūpa and make offerings to it.",
        "source": "T09n0262_006:0052a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0262_006:0052a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是處、即是道場，諸佛於此得阿耨多羅三藐三菩提，諸佛於此轉于法輪，諸佛於此而般涅槃。」",
        "translation": "You should know that this is the site of enlightenment, where buddhas attain supreme perfect enlightenment, where buddhas turn the wheel of the Dharma, and where buddhas attain parinirvāṇa.\"",
        "source": "T09n0262_006:0052a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「諸佛救世者，　　住於大神通，　為悅眾生故，　　現無量神力，　舌相至梵天，　　身放無數光，　為求佛道者，　　現此希有事。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke the verse, \"Those buddhas who save the world abide in great supernormal powers, display measureless supernormal abilities for the sake of pleasing sentient beings, reach the Brahma heavens with their tongues, emit incalculable light from their bodies, and present themselves in this rare way for those who seek the Buddha's path.",
        "source": "T09n0262_006:0052a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛謦欬聲，　　及彈指之聲，　周聞十方國，　　地皆六種動。",
        "translation": "The sound of the buddhas' gurgling and finger-snapping is heard throughout ten lands, and the ground moves in six ways.",
        "source": "T09n0262_006:0052b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以佛滅度後，　　能持是經故，　諸佛皆歡喜，　　現無量神力。",
        "translation": "Because they were able to uphold this sūtra after the Buddha's death, the buddhas rejoiced and displayed measureless powers.",
        "source": "T09n0262_006:0052b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　囑累是經故，　　讚美受持者，　於無量劫中，　　猶故不能盡。",
        "translation": "Because they entrusted him with this sūtra, they praised its adherents for an immeasurable number of eons, but it still couldn't be exhausted.",
        "source": "T09n0262_006:0052b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人之功德，　　無邊無有窮，　如十方虛空，　　不可得邊際。",
        "translation": "This person's merits are limitless and unfathomable, like space in the ten directions, which cannot be fathomed.",
        "source": "T09n0262_006:0052b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能持是經者，　　則為已見我，　亦見多寶佛，　　及諸分身者，　又見我今日，　　教化諸菩薩。",
        "translation": "Someone who can uphold this sūtra will have seen me, the Prabhūtaratna Buddha and those who share his body, and will see me today teaching the bodhisattvas.",
        "source": "T09n0262_006:0052b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能持是經者，　　令我及分身，　滅度多寶佛，　　一切皆歡喜。",
        "translation": "Someone who can hold this sūtra will cause me and my partial bodies to cease to be the Tathāgata Buddha, and all will rejoice.",
        "source": "T09n0262_006:0052b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方現在佛，　　并過去未來，　亦見亦供養，　　亦令得歡喜。",
        "translation": "The buddhas of the present and past and future in the ten directions also see and make offerings to each other, and they are made to rejoice.",
        "source": "T09n0262_006:0052b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛坐道場，　　所得祕要法，　能持是經者，　　不久亦當得。",
        "translation": "The buddhas sitting in the meeting place of the Way have obtained the secret essentials, and those who can uphold this sūtra will soon obtain them, too.",
        "source": "T09n0262_006:0052b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能持是經者，　　於諸法之義，　名字及言辭，　　樂說無窮盡，　如風於空中，　　一切無障礙。",
        "translation": "Those who can uphold this sūtra will delight in teaching the meanings of things, names, and words that know no limit, like the wind in the air that's unobstructed by anything.",
        "source": "T09n0262_006:0052b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於如來滅後，　　知佛所說經，　因緣及次第，　　隨義如實說，　如日月光明，　　能除諸幽冥。",
        "translation": "After the Tathāgata's death, he knows the sūtras that the Buddha teaches, their causes and conditions and their order, according to their true meaning, like the brightness of the sun and moon, which removes darkness.",
        "source": "T09n0262_006:0052b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斯人行世間，　　能滅眾生闇，　教無量菩薩，　　畢竟住一乘。",
        "translation": "Such a person practices in the world, extinguishes the darkness of sentient beings, and teaches measureless bodhisattvas to abide in the One Vehicle after all.",
        "source": "T09n0262_006:0052b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故有智者，　　聞此功德利，　於我滅度後，　　應受持斯經，　是人於佛道，　　決定無有疑。」",
        "translation": "Therefore, anyone with wisdom who hears of this merit and benefits should accept and uphold this sūtra after I pass away, for this person is certain there's no doubt about the Buddha Way.\"",
        "source": "T09n0262_006:0052b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經囑累品第二十二",
        "translation": "Saddharmapuṇḍarīka-sūtra, Exhortation to Accumulate, Chapter Twenty-two",
        "source": "T09n0262_006:0052c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，釋迦牟尼佛從法座起，現大神力，以右手摩無量菩薩摩訶薩頂，而作是言：「我於無量百千萬億阿僧祇劫，修習是難得阿耨多羅三藐三菩提法，今以付囑汝等。",
        "translation": "At the time, Śākyamuni Buddha rose from his Dharma seat, demonstrated great supernormal powers, put his right hand on the top of measureless bodhisattvas and mahāsattvas, and said, \"During measureless hundreds of thousands of millions of incalculable eons, I've cultivated this difficult-to-obtain teaching of unsurpassed, correct enlightenment, and now I'm entrusting it to you.",
        "source": "T09n0262_006:0052c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應當一心流布此法，廣令增益。」",
        "translation": "You should single-mindedly disseminate this teaching and make it widely available.\"",
        "source": "T09n0262_006:0052c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三摩諸菩薩摩訶薩頂，而作是言：「我於無量百千萬億阿僧祇劫，修習是難得阿耨多羅三藐三菩提法，今以付囑汝等。",
        "translation": "Thus samādhi of the bodhisattvas and mahāsattvas said, \"I have cultivated this difficult-to-obtain unsurpassed, correct, and complete enlightenment teaching for measureless hundreds of thousands of millions of incalculable eons, and now I'm entrusting it to you.",
        "source": "T09n0262_006:0052c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當受持、讀誦、廣宣此法，令一切眾生普得聞知。",
        "translation": "All of you must accept, recite, and proclaim this teaching so that all sentient beings will hear and know it.",
        "source": "T09n0262_006:0052c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0262_006:0052c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來有大慈悲，無諸慳悋，亦無所畏，能與眾生，佛之智慧、如來智慧、自然智慧，如來是一切眾生之大施主。",
        "translation": "The Tathāgata has great compassion, is free of stinginess, has no fear, and can give sentient beings the Buddha's wisdom, the Tathāgata's wisdom, and natural wisdom, making the Tathāgata a great donor to all sentient beings.",
        "source": "T09n0262_006:0052c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等亦應隨學如來之法，勿生慳悋。",
        "translation": "You, too, should follow the Tathāgata's teaching and not become stingy.",
        "source": "T09n0262_006:0052c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世，若有善男子、善女人，信如來智慧者，當為演說此法華經，使得聞知，為令其人得佛慧故。",
        "translation": "In future generations, if there are good men and good women who believe in the Tathāgata's wisdom, they will explain this Lotus Sutra for them and make them hear it, so that they can attain Buddha's wisdom.",
        "source": "T09n0262_006:0052c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生不信受者，當於如來餘深法中，示教利喜。",
        "translation": "If there are sentient beings who don't believe and accept it, they'll be shown the rest of the Tathāgata's profound teaching for their benefit and joy.",
        "source": "T09n0262_006:0052c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等若能如是，則為已報諸佛之恩。」",
        "translation": "If you can do this, you've already repaid the buddhas for their kindness.\"",
        "source": "T09n0262_006:0052c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸菩薩摩訶薩，聞佛作是說已，皆大歡喜遍滿其身，益加恭敬，曲躬、低頭，合掌向佛，俱發聲言：「如世尊勅，當具奉行。",
        "translation": "After hearing what the Buddha said, the bodhisattvas and mahāsattvas were overjoyed and filled their bodies with joy, increased their respect, bent their bows, bowed their heads, put their palms together, and bowed their heads to the Buddha, and all of them said, \"As the Bhagavān has commanded, we will fully approve of it.",
        "source": "T09n0262_006:0052c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然，世尊！",
        "translation": "Yes, Bhagavān!",
        "source": "T09n0262_006:0052c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願不有慮。」",
        "translation": "May there be no misgivings.\"",
        "source": "T09n0262_006:0052c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩眾，如是三反，俱發聲言：「如世尊勅，當具奉行。",
        "translation": "Thus, the bodhisattvas, mahāsattvas, and their followers all spoke up three times and said, \"As the Bhagavān has commanded, I will fully approve of it.",
        "source": "T09n0262_006:0052c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然，世尊！",
        "translation": "Yes, Bhagavān!",
        "source": "T09n0262_006:0052c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願不有慮。」",
        "translation": "May there be no misgivings.\"",
        "source": "T09n0262_006:0052c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼佛令十方來諸分身佛各還本土，而作是言：「諸佛各隨所安，多寶佛塔還可如故。」",
        "translation": "It was then that Śākyamuni Buddha caused the fragmentary buddhas from the ten directions to return to their homelands and said, \"Each of the buddhas will return to his or her original place, and the pagoda of Prabhūtaratna will be returned as before.\"",
        "source": "T09n0262_006:0052c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，十方無量分身諸佛——坐寶樹下師子座上者，及多寶佛，并上行等無邊阿僧祇菩薩大眾，舍利弗等聲聞四眾，及一切世間天、人、阿修羅等，聞佛所說，皆大歡喜。",
        "translation": "When he spoke these words, the measureless number of partial-body buddhas in the ten directions - those sitting on the lion's seat under the jeweled tree, the Prabhūtaratna Buddhas, the boundless incalculably large assembly of bodhisattvas who ascended and traveled upwards, the four śrāvaka groups like Śāriputra, and all the gods, humans, and asuras of the world - all rejoiced when they heard what the Buddha taught.",
        "source": "T09n0262_006:0052c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經藥王菩薩本事品第二十三爾時宿王華菩薩白佛言：「世尊！",
        "translation": "Miaofa lianhua jing yakwang pusa shou pin xxiii It was then that the Sukhāvatī bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T09n0262_006:0053a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王菩薩云何遊於娑婆世界？",
        "translation": "How did the Bhaiṣajyaguru Bodhisattva travel to the sahā world?",
        "source": "T09n0262_006:0053a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T09n0262_006:0053a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是藥王菩薩有若干百千萬億那由他難行苦行？",
        "translation": "How many hundreds of thousands of thousands of millions of nayutas of difficult ascetic practices does this Medicine King Bodhisattva engage in?",
        "source": "T09n0262_006:0053a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉，世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T09n0262_006:0053a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願少解說。」",
        "translation": "Please explain it in small measure.\"",
        "source": "T09n0262_006:0053a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天、龍、神、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，又他國土諸來菩薩，及此聲聞眾，聞皆歡喜。",
        "translation": "The gods, dragons, gods, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans and nonhumans, visiting bodhisattvas from other lands, and this assembly of śrāvakas all rejoiced when they heard that.",
        "source": "T09n0262_006:0053a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告宿王華菩薩：「乃往過去無量恒河沙劫，有佛號日月淨明德如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "It was then that the Buddha addressed the Constellation King Flower Bodhisattva, \"There was a Buddha from an incalculably long eon in the past who was called the Tathāgata of Immeasurable Pure and Virtuous Sun and Moon, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge, Trained in Clear Conduct, Well Gone, Understander of the World, Unsurpassed Person, Trainer of Men, Teacher of Gods and Humans, Buddha, and World Honored One.",
        "source": "T09n0262_006:0053a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛有八十億大菩薩摩訶薩，七十二恒河沙大聲聞眾，佛壽四萬二千劫，菩薩壽命亦等。",
        "translation": "That Buddha has eight billion great bodhisattvas, seventy-two great śrāvakas, a Buddha's life span of 42,000 eons, and a bodhisattva's life span of the same length.",
        "source": "T09n0262_006:0053a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國無有女人、地獄、餓鬼、畜生、阿修羅等，及以諸難；地平如掌，琉璃所成，寶樹莊嚴，寶帳覆上，垂寶華幡，寶瓶香爐周遍國界，七寶為臺，一樹一臺，其樹去臺盡一箭道。",
        "translation": "In that country there are no women, hells, hungry ghosts, animals, asuras, or other difficulties; the ground is flat as the palm of your hand, made of beryl, adorned by jeweled trees, covered by jeweled canopies, draped with jeweled-flower banners, surrounded by jeweled vases and incense burners, the country's border, and made of seven jewels, each tree a dais, and its tree is an arrow's flight from the dais.",
        "source": "T09n0262_006:0053a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸寶樹，皆有菩薩、聲聞而坐其下。",
        "translation": "Each of these jeweled trees has a bodhisattva or śrāvaka sitting underneath it.",
        "source": "T09n0262_006:0053a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸寶臺上，各有百億諸天作天伎樂，歌歎於佛，以為供養。",
        "translation": "On each of these jeweled platforms, 10 billion gods create celestial music, singing and praising the Buddha as an offering.",
        "source": "T09n0262_006:0053a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼佛為一切眾生憙見菩薩，及眾菩薩、諸聲聞眾，說法華經。",
        "translation": "At the time, that Buddha spoke the Lotus Sutra for all the sentient beings who saw the bodhisattva, the bodhisattvas, and the śrāvakas.",
        "source": "T09n0262_006:0053a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是一切眾生憙見菩薩，樂習苦行，於日月淨明德佛法中，精進經行，一心求佛，滿萬二千歲已，得現一切色身三昧。",
        "translation": "\"Thus, all sentient beings who see the bodhisattva with joy and austerity, who diligently practice the sūtras in the pure luminous virtue of the sun and moon, and who single-mindedly pursue the Buddha's teaching, attain the concentration of manifesting all forms of the body after completing 2,000 years.",
        "source": "T09n0262_006:0053a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得此三昧已，心大歡喜，即作念言：『我得現一切色身三昧，皆是得聞法華經力，我今當供養日月淨明德佛及法華經。』",
        "translation": "After attaining this concentration, his heart rejoiced greatly, and he then had the thought, 'I've attained the concentration of manifesting all form bodies because of the power of hearing the Lotus Sutra; now I will make offerings to the Sun, Moon, and Pure Luminous Virtue Buddhas and the Lotus Sutra.'",
        "source": "T09n0262_006:0053a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時入是三昧，於虛空中，雨曼陀羅華、摩訶曼陀羅華、細末堅黑栴檀，滿虛空中，如雲而下，又雨海此岸栴檀之香——此香六銖，價直娑婆世界——以供養佛。",
        "translation": "Immediately upon entering this concentration, a cloud of mandāra flowers, mahāmandāra flowers, and finely ground black sandalwood rained down in the sky, filling the sky like a cloud, and it rained down the fragrance of sandalwood on this side of the ocean - a fragrance worth six baht that's worth the price of the Saṃbha world - to make offerings to the Buddha.",
        "source": "T09n0262_006:0053a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是供養已，從三昧起，而自念言：『我雖以神力供養於佛，不如以身供養。』",
        "translation": "After making this offering, he rose from samādhi and thought to himself, 'Even though I might make offerings to the Buddha with my spiritual powers, I might as well make offerings with my body.'",
        "source": "T09n0262_006:0053b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即服諸香——栴檀、薰陸、兜樓婆、畢力迦、沈水、膠香，又飲瞻蔔諸華香油，滿千二百歲已，香油塗身，於日月淨明德佛前，以天寶衣而自纏身，灌諸香油，以神通力願而自然身，光明遍照八十億恒河沙世界。",
        "translation": "He then took various kinds of incense-candana, aromatic tree, turuṣka, pṛkkā, sinking water, and gum incense-and drank camphor and other flower-scented oils, and when he had completed 1,200 years, he rubbed the oil on his body, wrapped himself in a celestial-jewel robe before the Sun, Moon, and Pure Luminosity buddhas, doused himself in the oil, and vowed with supernormal powers that his body would naturally shine brightly throughout the 8 billion Gaṅgā worlds.",
        "source": "T09n0262_006:0053b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中諸佛同時讚言：『善哉，善哉！",
        "translation": "The buddhas there all praised him at the same time, saying, 'Good, good!",
        "source": "T09n0262_006:0053b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0262_006:0053b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是真精進，是名真法供養如來。",
        "translation": "\"This is true effort, and it's called making true Dharma offerings to the Tathāgata.",
        "source": "T09n0262_006:0053b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以華、香、瓔珞、燒香、末香、塗香、天繒、幡蓋及海此岸栴檀之香，如是等種種諸物供養，所不能及；假使國城、妻子布施，亦所不及。",
        "translation": "If you were to make offerings of flowers, incense, jewelry, burning incense, powdered incense, smeared incense, silken silks, banners, the scent of sandalwood on this side of the ocean, and other such things, they wouldn't reach them, nor would a kingdom or wife be able to reach them if they were given as an offering.",
        "source": "T09n0262_006:0053b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0262_006:0053b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第一之施，於諸施中最尊最上，以法供養諸如來故。』",
        "translation": "This is called the best gift, the most honored and the highest of all gifts, because it's an offering of the Dharma to the tathāgatas.'",
        "source": "T09n0262_006:0053b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已而各默然。",
        "translation": "After saying this, they each remained silent.",
        "source": "T09n0262_006:0053b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其身火燃千二百歲，過是已後，其身乃盡。",
        "translation": "His body burns for 1,200 years, and after that, his body is consumed.",
        "source": "T09n0262_006:0053b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一切眾生憙見菩薩作如是法供養已，命終之後，復生日月淨明德佛國中，於淨德王家結加趺坐，忽然化生。",
        "translation": "\"After making these Dharma offerings, all sentient beings who see the bodhisattva with great joy suddenly are reborn after their lives end when they sit cross-legged in the Jing Yue Jing Mingde Buddha Land at the home of King Jingde.",
        "source": "T09n0262_006:0053b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即為其父而說偈言：「『大王今當知，　　我經行彼處，　　即時得一切，　　現諸身三昧。",
        "translation": "He spoke a verse for his father, saying, \"Now, Great King, you should know that I've traveled to that place and immediately attained all of them, manifesting the samādhi of bodies.",
        "source": "T09n0262_006:0053b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　懃行大精進，　　捨所愛之身，　　供養於世尊，　　為求無上慧。』",
        "translation": "I've made great effort, abandoned the body I love, and offered it to the Bhagavān in search of unsurpassed wisdom.'",
        "source": "T09n0262_006:0053b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「說是偈已，而白父言：『日月淨明德佛，今故現在。",
        "translation": "\"After speaking this verse, he said to his father, 'The Sun and Moon are now present, the Buddha of Pure Luminosity and Virtue.",
        "source": "T09n0262_006:0053b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先供養佛已，得解一切眾生語言陀羅尼，復聞是法華經八百千萬億那由他甄迦羅、頻婆羅、阿閦婆等偈。",
        "translation": "After making offerings to the Buddha, I was able to understand the dhāraṇīs of the languages of all sentient beings and also hear these verses from the Lotus Sutra in eight hundred thousand million nayutas, kalas, pippalas, and śakas.",
        "source": "T09n0262_006:0053b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T09n0262_006:0053b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當還供養此佛。』",
        "translation": "Now, I will return to make offerings to this Buddha.'",
        "source": "T09n0262_006:0053b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白已，即坐七寶之臺，上昇虛空，高七多羅樹，往到佛所，頭面禮足，合十指爪，以偈讚佛：「『容顏甚奇妙，　　光明照十方，　　我適曾供養，　　今復還親覲。』",
        "translation": "After he said this, he sat on a seven-jeweled dais, rose into the sky, and climbed up seven tāla trees. He went to the Buddha, bowed his head at his feet, put his palms together, and praised him in verse, saying, 'His features are marvelous, his radiance shines in ten directions, and I've made offerings before; now, I'll return to pay my respects.'",
        "source": "T09n0262_006:0053c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，一切眾生憙見菩薩說是偈已，而白佛言：『世尊！",
        "translation": "\"At the time, all the sentient beings who saw the bodhisattva speaking this verse said to the Buddha, 'Bhagavān!",
        "source": "T09n0262_006:0053c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊猶故在世。』",
        "translation": "The Bhagavān is still in the world for that reason.'",
        "source": "T09n0262_006:0053c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時日月淨明德佛，告一切眾生憙見菩薩：『善男子！",
        "translation": "It was then that the Sun and Moon Pure Luminous Deity Buddha addressed all sentient beings who saw the bodhisattva Jātaka, 'Good sons!",
        "source": "T09n0262_006:0053c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我涅槃時到、滅盡時至，汝可安施床座，我於今夜當般涅槃。』",
        "translation": "When the time for my nirvāṇa arrives and the time for my cessation arrives, you may offer to sit on a bed, for I will attain parinirvāṇa this very night.'",
        "source": "T09n0262_006:0053c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又勅一切眾生憙見菩薩：『善男子！",
        "translation": "I also command all sentient beings to see the bodhisattva with joy, 'Good sons!",
        "source": "T09n0262_006:0053c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以佛法囑累於汝及諸菩薩大弟子，并阿耨多羅三藐三菩提法，亦以三千大千七寶世界諸寶樹、寶臺及給侍諸天，悉付於汝。",
        "translation": "I entrust to you and the great disciples of the bodhisattvas the Dharma of unsurpassed, perfect enlightenment, and the three thousand great thousand seven-jeweled worlds with their jeweled trees and jeweled platforms and the gods who serve them.",
        "source": "T09n0262_006:0053c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我滅度後，所有舍利亦付囑汝，當令流布，廣設供養，應起若干千塔。』",
        "translation": "After I die, I will also entrust all the relics to you, so that they will be spread and widely offered, and thousands of stūpas will be erected.'",
        "source": "T09n0262_006:0053c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是日月淨明德佛勅一切眾生憙見菩薩已，於夜後分入於涅槃。",
        "translation": "Thus, the sun, moon, and pure luminosity buddhas commanded all sentient beings to see the bodhisattva with fervor and then enter nirvāṇa in the latter part of the night.",
        "source": "T09n0262_006:0053c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，一切眾生憙見菩薩見佛滅度，悲感、懊惱，戀慕於佛，即以海此岸栴檀為[卄/積]，供養佛身，而以燒之。",
        "translation": "\"At the time, all the sentient beings who had seen the bodhisattva die saw the Buddha's death, were overcome with sorrow and vexation, and yearned for the Buddha, so they made offerings of sandalwood [twenty/calories] on this side of the ocean to the Buddha's body and burned them.",
        "source": "T09n0262_006:0053c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "火滅已後，收取舍利，作八萬四千寶瓶，以起八萬四千塔，高三世界，表剎莊嚴，垂諸幡蓋，懸眾寶鈴。",
        "translation": "After the fire went out, he collected the relics, made 84,000 precious vases, erected 84,000 stūpas that were three worlds high, adorned with banners and hanging bells.",
        "source": "T09n0262_006:0053c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時一切眾生憙見菩薩復自念言：『我雖作是供養，心猶未足，我今當更供養舍利。』",
        "translation": "\"At the time, all the sentient beings who saw the bodhisattva with joy repeatedly thought to themselves, 'Even though I made this offering, my heart still isn't full; now I will make another offering to the relics.'",
        "source": "T09n0262_006:0053c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便語諸菩薩大弟子及天、龍、夜叉等一切大眾：『汝等當一心念，我今供養日月淨明德佛舍利。』",
        "translation": "They then said to the great disciples of the bodhisattva and to the gods, dragons, yakṣas, and other great multitudes, 'All of you must be unified in your mind and thoughts, 'Now, I'll make offerings to the relics of the Sun and Moon, the Pure Luminous Virtue Buddha.'",
        "source": "T09n0262_006:0053c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，即於八萬四千塔前，燃百福莊嚴臂七萬二千歲而以供養，令無數求聲聞眾、無量阿僧祇人，發阿耨多羅三藐三菩提心，皆使得住現一切色身三昧。",
        "translation": "After saying this, he placed 84,000 stūpas in front of them, lit a hundred meritorious arms for 72,000 years, and made offerings, causing measureless multitudes of śrāvakas and measureless incalculable people to arouse the mind of unsurpassed, correct, and complete enlightenment and to abide in the samādhi of displaying all forms of body.",
        "source": "T09n0262_006:0053c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，諸菩薩、天、人、阿修羅等，見其無臂，憂惱悲哀而作是言：『此一切眾生憙見菩薩，是我等師，教化我者，而今燒臂，身不具足。』",
        "translation": "\"At the time, when bodhisattvas, gods, humans, asuras, and others saw that they had no arms, they were sad and pitying and said, 'All sentient beings who have the honor of seeing a bodhisattva who is our teacher and who teaches us now have their arms burned and their bodies are not complete.'",
        "source": "T09n0262_006:0054a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時一切眾生憙見菩薩，於大眾中立此誓言：『我捨兩臂，必當得佛金色之身，若實不虛，令我兩臂還復如故。』",
        "translation": "Those sentient beings who then saw the bodhisattva with jealousy made this vow to the assembly, 'If I give up my two arms, I will surely attain the golden body of the Buddha, and if that's true and not false, I will have my two arms returned as before.'",
        "source": "T09n0262_006:0054a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是誓已，自然還復，由斯菩薩福德智慧淳厚所致。",
        "translation": "After making this vow, they naturally returned, thanks to the bodhisattva's virtue and wisdom.",
        "source": "T09n0262_006:0054a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當爾之時，三千大千世界六種震動，天雨寶華，一切人、天得未曾有。」",
        "translation": "At that point, six things in the 3,000 great one-thousand worlds shook, and the heavens rained down jeweled flowers that were unprecedented for all humans and gods.\"",
        "source": "T09n0262_006:0054a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告宿王華菩薩：「於汝意云何？",
        "translation": "The Buddha told Constellation Flower Bodhisattva, \"What do you think?",
        "source": "T09n0262_006:0054a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生憙見菩薩，豈異人乎？",
        "translation": "All sentient beings see the bodhisattva with great fervor, don't you think it's someone else?",
        "source": "T09n0262_006:0054a10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今藥王菩薩是也。",
        "translation": "\"Now, this is the Medicine King Bodhisattva.",
        "source": "T09n0262_006:0054a11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所捨身布施，如是無量百千萬億那由他數。",
        "translation": "His giving up of body is thus measureless and countless hundreds of thousands of trillions of nayutas.",
        "source": "T09n0262_006:0054a11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「宿王華！",
        "translation": "\"King of Constellations flower!",
        "source": "T09n0262_006:0054a12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有發心欲得阿耨多羅三藐三菩提者，能燃手指，乃至足一指，供養佛塔，勝以國城、妻子，及三千大千國土山林河池、諸珍寶物、而供養者，若復有人，以七寶滿三千大千世界，供養於佛，及大菩薩、辟支佛、阿羅漢，是人所得功德，不如受持此法華經，乃至一四句偈，其福最多。",
        "translation": "If someone with the aspiration to attain supreme perfect enlightenment could burn their fingers or even a single finger on their feet to make offerings to a stūpa of a buddha, which would be better than making offerings to a country, wife, or one of the three thousand great lands, mountains, forests, rivers, or ponds, or to precious things, and if that person were to make offerings to the Buddha, great bodhisattvas, pratyekabuddhas, or arhats with seven treasures throughout the three thousand great worlds, that person wouldn't attain as much merit as accepting or upholding this Lotus Sutra, even a single four-line verse, which would bring them the most virtue.",
        "source": "T09n0262_006:0054a12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「宿王華！",
        "translation": "\"King of Constellations flower!",
        "source": "T09n0262_006:0054a19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如一切川流江河，諸水之中海為第一；此法華經亦復如是，於諸如來所說經中，最為深大。",
        "translation": "\"It's like the ocean that's the largest of all the rivers and streams, and so is this Lotus Sutra, which is the deepest and largest of all the sutras taught by the Tathāgata.",
        "source": "T09n0262_006:0054a19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如土山、黑山、小鐵圍山、大鐵圍山及十寶山，眾山之中，須彌山為第一；此法華經亦復如是，於諸經中最為其上。",
        "translation": "Also, like Mount Sumeru, which is the highest of all mountains, such as the earthen mountain, the black mountain, the small iron ring mountain, the large iron ring mountain, and the ten precious mountains, so is this Lotus Sutra, which is the highest of all the sutras.",
        "source": "T09n0262_006:0054a21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如眾星之中，月天子最為第一；此法華經亦復如是，於千萬億種諸經法中最為照明。",
        "translation": "Also, just as the moon-citizen is the greatest among the stars, so is this Lotus Sutra, which is the greatest illumination among a thousand trillion kinds of sūtras and teachings.",
        "source": "T09n0262_006:0054a24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如日天子能除諸闇；此經亦復如是，能破一切不善之闇。",
        "translation": "Also, just as the sun goddess removes darkness, so does this sūtra, which breaks through all unwholesome darkness.",
        "source": "T09n0262_006:0054a26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如諸小王中，轉輪聖王最為第一；此經亦復如是，於眾經中最為其尊。",
        "translation": "Also, just as the wheel-turning sage king is the most venerable of lesser kings, so too is this sūtra the most venerable of all the scriptures.",
        "source": "T09n0262_006:0054a28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如帝釋、於三十三天中王，此經亦復如是，諸經中王。",
        "translation": "Also like Indra, the king of the Trāyastriṃśa Heaven, so is this sūtra, the king of sūtras.",
        "source": "T09n0262_006:0054a29_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如大梵天王，一切眾生之父；此經亦復如是，一切賢聖，學、無學，及發菩薩心者之父。",
        "translation": "Also like the king of the Brahma gods, the father of all sentient beings, so is this sūtra, the father of all the noble ones, those who are trainees and those who are without training, and those who have aroused the bodhisattva aspiration.",
        "source": "T09n0262_006:0054b02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如一切凡夫人中，須陀洹、斯陀含、阿那含、阿羅漢、辟支佛為第一；此經亦復如是，一切如來所說、若菩薩所說、若聲聞所說，諸經法中，最為第一。",
        "translation": "Also, just as stream entry, once again, is the best among all ordinary people, so is this sūtra, the best among all sūtras and teachings of tathāgatas, bodhisattvas, and śrāvakas.",
        "source": "T09n0262_006:0054b04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有能受持是經典者，亦復如是，於一切眾生中、亦為第一。",
        "translation": "So is he who can uphold this sūtra, and he's also the best among all sentient beings.",
        "source": "T09n0262_006:0054b07_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切聲聞、辟支佛中，菩薩為第一；此經亦復如是，於一切諸經法中、最為第一。",
        "translation": "Among all śrāvakas and pratyekbuddhas, the bodhisattva is the best, and so is this sūtra, which is the best among all sūtras and teachings.",
        "source": "T09n0262_006:0054b08_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛為諸法王；此經亦復如是，諸經中王。",
        "translation": "Just as the Buddha is the king of all dharmas, so is this sūtra, the king of all sūtras.",
        "source": "T09n0262_006:0054b10_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「宿王華！",
        "translation": "\"King of the constellations, flower!",
        "source": "T09n0262_006:0054b11_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經能救一切眾生者，此經能令一切眾生離諸苦惱，此經能大饒益一切眾生，充滿其願。",
        "translation": "\"This sūtra saves all sentient beings, this sūtra frees all sentient beings from suffering and distress, and this sūtra greatly benefits all sentient beings and fills their vows.",
        "source": "T09n0262_006:0054b11_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如清涼池！",
        "translation": "It's like the Lake of Coolness!",
        "source": "T09n0262_006:0054b14_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能滿一切諸渴乏者，如寒者得火，如裸者得衣，如商人得主，如子得母，如渡得船，如病得醫，如暗得燈，如貧得寶，如民得王，如賈客得海，如炬除暗；此法華經亦復如是，能令眾生離一切苦、一切病痛，能解一切生死之縛。",
        "translation": "\"It can satisfy all those who lack thirst, like a cold person getting a fire, a naked person getting clothing, a merchant getting a prize, a son getting his mother, a ferry getting a boat, a sick person getting a doctor, a dark person getting a lamp, a poor person getting a treasure, a citizen getting a king, a merchant getting the sea, and a torch removing darkness; likewise, this Lotus Sutra can free sentient beings from all suffering and all illness and can release them from the fetters of all birth-and-death.",
        "source": "T09n0262_006:0054b14_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人得聞此法華經，若自書、若使人書，所得功德，以佛智慧籌量多少，不得其邊。",
        "translation": "If a person hears this Lotus Sutra and writes it himself or has it written, the merit they'll attain won't be measured by the Buddha's wisdom, and it won't reach their limit.",
        "source": "T09n0262_006:0054b19_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若書是經卷，華、香、瓔珞、燒香、末香、塗香，幡蓋、衣服，種種之燈——酥燈、油燈、諸香油燈、瞻蔔油燈、須曼那油燈、波羅羅油燈、婆利師迦油燈、那婆摩利油燈——供養，所得功德，亦復無量。",
        "translation": "If he writes this sūtra scroll, makes offerings of flowers, incense, jewelry, burning incense, powdered incense, smeared incense, banners, shrouds, and various lamps - ghee lamps, oil lamps, incense oil lamps, campaka oil lamps, sumanā oil lamps, paraniras oil lamps, pārijāta oil lamps, and nāpāmalī oil lamps - the merit gained is also incalculable.",
        "source": "T09n0262_006:0054b21_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「宿王華！",
        "translation": "\"King Constellation Flower!",
        "source": "T09n0262_006:0054b26_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人聞是藥王菩薩本事品者，亦得無量無邊功德。",
        "translation": "\"If someone hears this Chapter of the Skills of the Bodhisattva King of Medicine, they'll also attain measureless and limitless merit.",
        "source": "T09n0262_006:0054b26_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有女人聞是藥王菩薩本事品，能受持者，盡是女身，後不復受。",
        "translation": "If a woman hears this chapter of the Bhaiṣajyaguru Bodhisattva's Skills and is able to retain it, she'll end up in a woman's body and won't be able to retain it again.",
        "source": "T09n0262_006:0054b27_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來滅後後五百歲中，若有女人聞是經典，如說修行。",
        "translation": "If, during the next 500 years after the Tathāgata's death, a woman hears this sūtra and cultivates it according to what's said, then she'll go to peace when her life ends.",
        "source": "T09n0262_006:0054b29_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此命終，即往安樂世界，阿彌陀佛、大菩薩眾，圍繞住處，生蓮華中，寶座之上，不復為貪欲所惱，亦復不為瞋恚愚癡所惱，亦復不為憍慢嫉妬諸垢所惱，得菩薩神通、無生法忍。",
        "translation": "At the end of her life, she'll go to the paradise world, surrounded by Amitâbha Buddha and a great multitude of bodhisattvas, and be born among lotus flowers on a jeweled throne, where she'll no longer be tormented by desire, nor tormented by anger and folly, nor tormented by the stains of conceit and jealousy, and will attain the bodhisattva's supernormal powers and the patience of the nonarising Dharma.",
        "source": "T09n0262_006:0054c01_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得是忍已，眼根清淨，以是清淨眼根，見七百萬二千億那由他恒河沙等諸佛如來。",
        "translation": "After attaining this forbearance, their eye faculty is purified, and with this purified eye faculty, they see 7,000,200,000,000,000,000,000,000 tathāgatas and so forth.",
        "source": "T09n0262_006:0054c05_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸佛遙共讚言：『善哉，善哉！",
        "translation": "The buddhas then collectively praised them, saying, 'Good, good!",
        "source": "T09n0262_006:0054c07_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0262_006:0054c08_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能於釋迦牟尼佛法中，受持讀誦思惟是經，為他人說，所得福德無量無邊，火不能燒，水不能漂，汝之功德，千佛共說不能令盡。",
        "translation": "If you can memorize, read, recite, and contemplate this sūtra in the teaching of Śākyamuni Buddha and explain it to others, the merit you'll attain is so immeasurable and limitless that fire can't burn it, water can't float it, and your virtue can't be exhausted by a thousand buddhas speaking together.",
        "source": "T09n0262_006:0054c08_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今已能破諸魔賊，壞生死軍，諸餘怨敵皆悉摧滅。",
        "translation": "Now, you've been able to defeat the demons and thieves, destroy the armies of birth and death, and annihilate all other enemies.",
        "source": "T09n0262_006:0054c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T09n0262_006:0054c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百千諸佛，以神通力共守護汝，於一切世間天、人之中無如汝者，唯除如來，其諸聲聞、辟支佛、乃至菩薩，智慧禪定無有與汝等者。』",
        "translation": "A hundred thousand buddhas guard you with their supernormal powers, and there's no one like you among the gods and humans of the world except the Tathāgata, and there's no śrāvakas, pratyekabuddhas, or even bodhisattvas who are equal to you in wisdom and meditation.'",
        "source": "T09n0262_006:0054c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宿王華！",
        "translation": "Constellation King Flower!",
        "source": "T09n0262_006:0054c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩成就如是功德智慧之力。",
        "translation": "This bodhisattva has accomplished such merit and the power of wisdom.",
        "source": "T09n0262_006:0054c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人聞是藥王菩薩本事品，能隨喜讚善者，是人現世口中常出青蓮華香，身毛孔中常出牛頭栴檀之香，所得功德，如上所說。",
        "translation": "If someone hears this accomplishment of the Bhaiṣajya-garjita Bodhisattva and is able to rejoice and praise it well, that person's mouth will always smell like blue lotus flowers, and the pores of their body will always smell like oxhead sandalwood, which will bring them merit as described above.",
        "source": "T09n0262_006:0054c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，宿王華！",
        "translation": "Therefore, Constellation King Flower!",
        "source": "T09n0262_006:0054c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此藥王菩薩本事品囑累於汝。",
        "translation": "I'm entrusting this Chapter on the Skills of the Medicine King Bodhisattva to you.",
        "source": "T09n0262_006:0054c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我滅度後後五百歲中，廣宣流布於閻浮提，無令斷絕，惡魔、魔民、諸天、龍、夜叉、鳩槃茶等，得其便也。",
        "translation": "During the next 500 years after my extinction, it will be widely proclaimed and spread throughout Jambudvīpa without being cut off, so that evil demons, demon folk, gods, dragons, yakṣas, kumbhāṇas, and so forth can have an advantage over it.",
        "source": "T09n0262_006:0054c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「宿王華！",
        "translation": "\"King Constellation Flower!",
        "source": "T09n0262_006:0054c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當以神通之力守護是經。",
        "translation": "You must guard this sūtra with the power of your supernormal abilities.",
        "source": "T09n0262_006:0054c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0262_006:0054c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經則為閻浮提人，病之良藥。",
        "translation": "\"This sūtra is a good medicine for people in Jambudvīpa who are sick.",
        "source": "T09n0262_006:0054c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人有病，得聞是經，病即消滅，不老不死。",
        "translation": "If someone with an illness hears this sūtra, their illness will subside, and they won't grow old or die.",
        "source": "T09n0262_006:0054c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宿王華！",
        "translation": "Sukhāvatī!",
        "source": "T09n0262_006:0054c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若見有受持是經者，應以青蓮花盛滿末香，供散其上。",
        "translation": "If you see someone who accepts this sūtra, you should scatter an offering to them filled with the scent of the blue lotus flowers.",
        "source": "T09n0262_006:0054c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "散已，作是念言：『此人不久必當取草坐於道場，破諸魔軍，當吹法螺、擊大法鼓，度脫一切眾生老病死海。』",
        "translation": "After scattering them, think, 'Soon this person will surely take grass and sit down on the site of enlightenment, refute the armies of Māra, blow the conch of the Dharma and beat the great Dharma drum, and liberate all sentient beings from the sea of old age, illness, and death.'",
        "source": "T09n0262_006:0054c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故求佛道者、見有受持是經典人，應當如是生恭敬心。」",
        "translation": "Therefore, those who seek the Buddha's path and see someone who accepts this sūtra should thus give rise to respectful thought.\"",
        "source": "T09n0262_006:0055a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是藥王菩薩本事品時，八萬四千菩薩得解一切眾生語言陀羅尼。",
        "translation": "When this was said to be the skillful teaching of the Medicine King Bodhisattva, 84,000 bodhisattvas attained a dhāraṇī that understands the languages of all sentient beings.",
        "source": "T09n0262_006:0055a03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多寶如來於寶塔中讚宿王華菩薩言：「善哉，善哉！",
        "translation": "The Tathāgata Prabhūtaratna praised the Constellation King Flower Bodhisattva in his jeweled stūpa, saying, \"Good, good!",
        "source": "T09n0262_006:0055a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宿王華！",
        "translation": "King Sugatacetana!",
        "source": "T09n0262_006:0055a06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝成就不可思議功德，乃能問釋迦牟尼佛如此之事，利益無量一切眾生。」",
        "translation": "You've achieved unfathomable virtue, so you were able to ask Śākyamuni Buddha about such an event and benefit measureless sentient beings.\"",
        "source": "T09n0262_006:0055a06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經卷第六",
        "translation": "*Saddharmapuṇḍarīka-sūtra, Volume 6",
        "source": "T09n0262_006:0055a09_0",
        "is_bad_quality": false
    }
]