[
    {
        "source_sentence": "大薩遮尼乾子所說經卷第十",
        "translation": "Mahāsatya-nirgrantha-putra-sūtra, Volume 10",
        "source": "T09n0272_010:0361b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏天竺三藏菩提留支譯",
        "translation": "Yuan Wei Tianzang Tripiṭaka Bodhiruci Translation",
        "source": "T09n0272_010:0361b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說法品第十之二",
        "translation": "Tenth, Second, Chapter of the Teaching of the Dharma",
        "source": "T09n0272_010:0361b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時慧命大目揵連白佛言：「世尊！",
        "translation": "It was then that the Great Maudgalyāyana of Wisdom Life said to the Buddha, \"Bhagavān!",
        "source": "T09n0272_010:0361b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此薩遮尼乾子現此外道相，教化幾所眾生發阿耨多羅三藐三菩提心？」",
        "translation": "How many sentient beings did this Sācaṇeganī manifest as this path and teach to give rise to the mind of unsurpassed, correct enlightenment?\"",
        "source": "T09n0272_010:0361b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「目連！",
        "translation": "The Buddha told Maudgalyāyana, \"Maudgalyāyana!",
        "source": "T09n0272_010:0361b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今問我此事，天人聞說，皆悉迷沒，除諸菩薩摩訶薩眾。",
        "translation": "Now, you've asked me about this, and when gods and humans hear it, they're all lost, except for the bodhisattva-mahāsattvas.",
        "source": "T09n0272_010:0361b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連！",
        "translation": "Maudgalyāyana!",
        "source": "T09n0272_010:0361b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今說其少分，令眾生入。",
        "translation": "\"Now, I'll explain a small part of it so that sentient beings will enter.",
        "source": "T09n0272_010:0361b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薩遮善男子以種種形、種種色、種種威儀教化眾生，發阿耨多羅三藐三菩提心。",
        "translation": "By using various forms, various shapes, and various manners, Sāca good sons teach sentient beings to arouse the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T09n0272_010:0361b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連！",
        "translation": "Maudgalyāyana!",
        "source": "T09n0272_010:0361b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如須彌山微塵數等眾生住外道法中，薩遮善男子行外道法，教化令發阿耨多羅三藐三菩提心。",
        "translation": "\"Suppose there are a tiny number of sentient beings on Mount Sumeru who abide in a non-Buddhist path, and a good man named Sāca practices a non-Buddhist path, teaching and transforming them to give rise to the mind of unsurpassed, corrected, and complete enlightenment.",
        "source": "T09n0272_010:0361b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天下微塵數等眾生住遮羅伽外道法中，薩遮善男子行遮羅伽法，教化令發阿耨多羅三藐三菩提心。",
        "translation": "Among the number of tiny sentient beings in the four heavens, the good man Sacha practices the non-Buddhist teachings of the Cārāga, teaching and teaching them to give rise to the mind of unsurpassed, corrected enlightenment.",
        "source": "T09n0272_010:0361b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八萬四千恒河沙等眾生住波利婆闍外道法中，薩遮善男子行波利婆闍外道法，教化令發阿耨多羅三藐三菩提心。",
        "translation": "84,000 sands of the Ganges living among the teachings of the non-Buddhist sect of the Parivar, Sāca good sons practice the non-Buddhist teachings of the Parivar, teaching and transforming them to give rise to the mind of unsurpassed, corrected enlightenment.",
        "source": "T09n0272_010:0361b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十恒河沙等眾生樂聲聞行，薩遮善男子現聲聞行，教化令住聲聞菩提，後發阿耨多羅三藐三菩提心。",
        "translation": "Ten Gaṅgās and other sentient beings delight in the practice of śrāvakas, and the good man Sājñāta demonstrates the practice of śrāvakas, teaches and causes them to abide in the śrāvaka bodhi, and then gives rise to the mind of unsurpassed, corrected, and complete enlightenment.",
        "source": "T09n0272_010:0361b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過是聲聞數等身，現行辟支佛形，教化令發阿耨多羅三藐三菩提心。",
        "translation": "Beyond these śrāvaka figures, he takes on the form of a pratyekabuddha and teaches and causes them to give rise to the mind of unsurpassed, corrected, and complete enlightenment.",
        "source": "T09n0272_010:0361b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無數眾生，薩遮善男子行菩薩道，教化令發阿耨多羅三藐三菩提心。",
        "translation": "Countless sentient beings, good sons of Sāca practicing the bodhisattva path, are taught and instructed to give rise to the unsurpassed, correct, and complete mind of enlightenment.",
        "source": "T09n0272_010:0361b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應見帝釋身而受化者，即現帝釋身教化眾生；應見梵王身而受化者，即現梵王身教化眾生；應見轉輪王身而受化者，即現轉輪王身教化眾生；應見四天王身而受化者，即現四天王身教化眾生；應見緊那羅身而受化者，即現緊那羅身教化眾生；應見阿修羅身而受化者，即現阿修羅身教化眾生；應見迦樓羅身而受化者，即現迦樓羅身教化眾生；應見摩睺羅伽身而受化者，即現摩睺羅伽身教化眾生；應見人身而受化者，即現人身教化眾生；應見女身而受化者，即現女身教化眾生；應見童男、童女身而受化者，即現童男、童女身教化眾生；應見地天身而受化者，即現地天身教化眾生；應見同生天身而受化者，即現同生天身教化眾生；應見聖人身而受化者，即現聖人身教化眾生；應見摩那婆身而受化者，即現摩那婆身教化眾生；應見比丘、比丘尼身而受化者，即現比丘、比丘尼身教化眾生；應見優婆塞、優婆夷身而受化者，即現優婆塞優婆夷身教化眾生。",
        "translation": "應見帝釋身而受化者，即現帝釋身教化眾生；應見梵王身而受化者，即現梵王身教化眾生；應見轉輪王身而受化者，即現轉輪王身教化眾生；應見四天王身而受化者，即現四天王身教化眾生；應見緊那羅身而受化者，即現緊那羅身教化眾生；應見阿修羅身而受化者，即現阿修羅身教化眾生；應見迦樓羅身而受化者，即現迦樓羅身教化眾生；應見摩睺羅伽身而受化者，即現摩睺羅伽身教化眾生；應見人身而受化者，即現人身教化眾生；應見女身而受化者，即現女身教化眾生；應見童男、童女身而受化者，即現童男、童女身教化眾生；應見地天身而受化者，即現地天身教化眾生；應見同生天身而受化者，即現同生天身教化眾生；應見聖人身而受化者，即現聖人身教化眾生；應見摩那婆身而受化者，即現摩那婆身教化眾生；應見比丘、比丘尼身而受化者，即現比丘、比丘尼身教化眾生；應見優婆塞、優婆夷身而受化者，即現優婆塞優婆夷身教化眾生。",
        "source": "T09n0272_010:0361b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連！",
        "translation": "Maudgalyāyana!",
        "source": "T09n0272_010:0361c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薩遮善男子現如是等一切種種無量身相，教化如是無量眾生發阿耨多羅三藐三菩提心。」",
        "translation": "Sācārya good sons present all these various ways of being without measure, teaching and transforming such an infinite number of sentient beings to give rise to the mind of unsurpassed, correct, and complete enlightenment.\"",
        "source": "T09n0272_010:0361c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連白佛言：「世尊！",
        "translation": "Maudgalyāyana said to the Buddha, \"Bhagavān!",
        "source": "T09n0272_010:0361c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薩遮善男子供養幾所諸佛？」",
        "translation": "How many buddhas does Sāca good sons make offerings to?\"",
        "source": "T09n0272_010:0361c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「目連！",
        "translation": "The Buddha told Maudgalyāyana, \"Maudgalyāyana!",
        "source": "T09n0272_010:0361c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界、水界、火界、風界、虛空分界等悉可量數，而薩遮善男子以種種身所供養佛，不可量數。」",
        "translation": "The element of earth, element of water, element of fire, element of wind, element of space, and so forth are all countable, but the various kinds of bodies that Sācārya good sons offer to the Buddha are incalculable.\"",
        "source": "T09n0272_010:0361c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大薩遮尼乾子所說經授記品第十一",
        "translation": "Chapter 11 of the Granting of Indication from the Mahāsatya-nirgrantha-sūtra",
        "source": "T09n0272_010:0361c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大德摩訶迦葉告薩遮善男子言：「善男子！",
        "translation": "It was then that the great virtuous Mahākāśyapa addressed the good man Sāca, saying, \"Good man!",
        "source": "T09n0272_010:0361c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已供養無量諸佛，具足成就無量無邊諸功德聚，何故不成阿耨多羅三藐三菩提？」",
        "translation": "You've made offerings to measureless buddhas and fully achieved measureless and limitless accumulations of merit, why haven't you perfected supreme perfect enlightenment?\"",
        "source": "T09n0272_010:0361c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薩遮答言：「大德迦葉！",
        "translation": "Sāca replied, \"Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若有見，此是菩提、此是證者，我應得阿耨多羅三藐三菩提。」",
        "translation": "If I had seen that this was bodhi and this was its realization, I would have attained unsurpassed, correct enlightenment.\"",
        "source": "T09n0272_010:0362a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉言：「薩遮善男子！",
        "translation": "Kāśyapa said, \"Sāccha, good boy!",
        "source": "T09n0272_010:0362a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無邊菩薩發阿耨多羅三藐三菩提心，可不已成阿耨多羅三藐三菩提，當成阿耨多羅三藐三菩提，現成阿耨多羅三藐三菩提也？」",
        "translation": "無量無邊菩薩發阿耨多羅三藐三菩提心，可不已成阿耨多羅三藐三菩提，當成阿耨多羅三藐三菩提，現成阿耨多羅三藐三菩提也？」",
        "source": "T09n0272_010:0362a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薩遮答言：「大德迦葉！",
        "translation": "Sāca replied, \"Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今所言無量無邊諸眾生等，成阿耨多羅三藐三菩提者，此是憍慢眾生之數。",
        "translation": "\"Now, you're talking about measureless and limitless sentient beings who have achieved unsurpassed, perfect enlightenment, but this is the number of conceited sentient beings.",
        "source": "T09n0272_010:0362a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0362a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於第一義中，菩提不可得，菩薩不可得。",
        "translation": "In the ultimate truth, enlightenment is unobtainable, and bodhisattvas are unobtainable.",
        "source": "T09n0272_010:0362a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0362a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言菩提者，名為無為，菩提者離一切數，菩提者非色法，菩提者不可見，菩提者非青、非黃、非赤、非白、非紅、非黑、非頗梨色，無色、無形、無相、無表，過一切相，無依離一切依，無物離一切物，無相離一切相，不可言，不可說，不可見、不可和合知、不可別異知，非闇、非明，無形、無相、無可觀，非言語、離言語，不可觸、不可知、不可聞，非音聲、非口道，無擁、無礙、無縛、無脫，非瞋、非癡，不可以一切事示現不可說。",
        "translation": "Supposedly, bodhi is called nonproductivity, bodhi is free of all numbers, bodhi is not a form, bodhi is invisible, bodhi is not blue, not yellow, not red, not white, not red, not black, not phallic, formless, formless, markless, and formless, past all marks, without support and free of all supports, without things and free of all things, without marks and free of all marks, inexpressible, ineffable, invisible, incomprehensible, and indistinguishable, not dark and not light, without form or form, without observable, not verbal and free of speech, not tactile, not knowable, and not audible, not voice and not the spoken word, without embracing, without obstruction, without binding, without liberation, not angry and not deluded, and not capable of manifesting the ineffable in all things.",
        "source": "T09n0272_010:0362a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提體如是相，彼不可以身證，不可以心知。",
        "translation": "The essence of bodhi thus appears, and it can't be personally realized or mentally known.",
        "source": "T09n0272_010:0362a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0362a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是身無知，如草木；是身無覺，如石壁；是身無識，如鏡像，是故不可以身得菩提。",
        "translation": "This body is without cognition like grass and trees, this body is without perception like a stone wall, and this body is without consciousness like a mirror, so it's not possible to attain enlightenment in body.",
        "source": "T09n0272_010:0362a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心亦不可見、不可示，是故不以心得菩提。",
        "translation": "\"The mind also can't be seen or shown, so it's not based on the mind's experience of enlightenment.",
        "source": "T09n0272_010:0362a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生不可見，無眾生故，是故不得阿耨多羅三藐三菩提。",
        "translation": "Because sentient beings are invisible and there are no sentient beings, it's not possible to attain supreme perfect enlightenment.",
        "source": "T09n0272_010:0362a25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T09n0272_010:0362a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法若如是者，云何迦葉而作是言：『汝已供養無量諸佛，滿足無量無邊功德，何故不成阿耨多羅三藐三菩提？』」",
        "translation": "If this is true of all dharmas, then why did Kāśyapa say, 'You have made offerings to measureless buddhas and fulfilled measureless and limitless merits, why haven't you achieved supreme perfect enlightenment?'\"",
        "source": "T09n0272_010:0362a26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中諸菩薩摩訶薩、比丘、比丘尼、優婆塞、優婆夷、釋提桓因、四天王、梵天王等一切大眾作如是念：「如來世尊！",
        "translation": "At the time, the bodhisattvas, monks, nuns, laymen, laywomen, Upāsikā, Śakra Devānām-Indra, the four heavenly kings, the Brahma kings, and all the other people thought, \"Thus, Bhagavān!",
        "source": "T09n0272_010:0362a29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應除我等疑惑心故，隨我心信，應與薩遮善男子授阿耨多羅三藐三菩提記。",
        "translation": "Because it should remove our doubts and confusions, and according to our mental faith, I should be granted the assurance of unsurpassed, correct, and complete enlightenment by a good man named Sāca.",
        "source": "T09n0272_010:0362b03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於幾所時，當成阿耨多羅三藐三菩提？",
        "translation": "At what point will he achieve unsurpassed, correct, and complete enlightenment?",
        "source": "T09n0272_010:0362b04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於何等劫、何等世界、何等國、何等姓、何等家、何等眷屬、云何出家、何等樹下成阿耨多羅三藐三菩提？",
        "translation": "In what eon, world, country, family, household, retinue, renunciant, or tree did he attain supreme perfect enlightenment?",
        "source": "T09n0272_010:0362b05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成阿耨多羅三藐三菩提已，佛名何等，幾時住世，幾眾集會？」",
        "translation": "After accomplishing supreme perfect enlightenment, what will be the Buddha's name, when will he live in the world, and how many people will assemble?\"",
        "source": "T09n0272_010:0362b08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知彼眾會諸菩薩摩訶薩、比丘、比丘尼、優婆塞、優婆夷、釋提桓因、四天王、梵天王等心之所念，諸覺觀已，告文殊師利法王子言：「文殊師利！",
        "translation": "It was then that the Bhagavān knew what was on the minds of the bodhisattvas, mahāsattvas, monks, bhikṣus and nuns, laymen, laywomen, Śakra Devānām-Indra, the four heavenly kings, and the brahma kings in that assembly, and after they had perceived and observed it, he addressed Mañjuśrī, the Dharma prince, saying, \"Mañjuśrī!",
        "source": "T09n0272_010:0362b09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此薩遮善男子過此賢劫，復過無量無數劫已，當成阿耨多羅三藐三菩提。",
        "translation": "After this good sage passes this good eon and many more incalculably long eons, this good sage will achieve supreme perfect enlightenment.",
        "source": "T09n0272_010:0362b12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛名實慧幢王，世界名善觀名稱，彼世界中無諸怨敵。",
        "translation": "The Buddha's name is the Banner King of Real Wisdom, and the world's name is Well-Acquired Name, and there are no enemies in that world.",
        "source": "T09n0272_010:0362b14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_010:0362b15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善觀名稱世界，莊嚴希有、殊特、極妙、可樂。",
        "translation": "\"It's a well-contemplated name for a world whose adornment is rare, special, extremely wonderful, and enjoyable.",
        "source": "T09n0272_010:0362b15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地七寶間錯莊嚴，城郭周匝七寶牆障百千萬重，其中復有七百千萬重大香水海，周匝圍遶；七百千萬大毘琉璃摩尼寶珠，以為門闕；十百千萬閻浮檀金，以為羅網遍覆世界；十百千萬摩尼寶，間錯其闕；懸十百千萬師子愛摩尼寶，遍諸宮殿以為嚴飾；十百千萬師子幢摩尼寶，莊嚴街道；十百千萬火幢摩尼寶，日夜常然普照世界；十百千萬七寶和鈴，常出妙聲遍諸世界；竪十百千萬摩尼寶高幢，普遍世界；懸十百千萬金幡，置在高幢。",
        "translation": "It's adorned by a mosaic of seven treasures, a city surrounded by a wall of seven treasures a million times over, another seven million great seas of perfume surrounding it, seven million great beryl maṇi jewels that serve as gateways, ten million jambū gold that serves as a net over the world, ten million maṇi jewels that are interspersed with each other, ten million lion's love maṇi jewels that hang over palaces and halls for adornment, ten million lion's banner maṇi jewels that adorn the streets, ten million fire banners maṇi jewels that constantly and universally illuminate the world day and night, ten million seven-jeweled harmony bells that always produce a marvelous sound that pervades the world, ten million maṇi jeweled high banners that pervade the world, and ten million gold banners that hang on high banners.",
        "source": "T09n0272_010:0362b16_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0362b26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善觀名稱世界，地平如掌，寶樹普覆，諸草柔軟——右旋婉轉，如善巧畫、如孔雀項毛其觸柔軟、如迦陵伽鳥遍覆世界——十百千萬妙莊嚴園，普遍世界，一一園中，十百千萬諸大寶池普遍莊嚴，一一池皆八道側方，八楞摩尼寶以為間錯，閻浮檀金沙遍布其底，一一池中皆各滿足八味香水，七寶鉢頭摩花以覆水上。",
        "translation": "\"That world, which is called the Well-contemplated Name, has a ground as flat as the palm of your hand, is covered with precious trees, has soft grasses that twirl and turn to the right like skillful drawings, has peacock feathers that are soft to the touch, and has a Kaliṅga bird that pervades the world-ten million wonderfully ornamented parks that pervade the world, and in each of those parks, ten million great precious pools that are universally ornamented, each of which is flanked by eight paths, is interspersed with eight lengthened maṇi treasures, has gold sand from the river running through its bottom, has eight flavors of perfume in each pool, and has flowers of seven precious paulownia that cover the water.",
        "source": "T09n0272_010:0362b27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昆崙遮鳥、耆婆耆婆鳥常出妙聲遍諸世界。",
        "translation": "The Kunlun-ccha bird and the Jīvajīva bird always make marvelous sounds throughout the world.",
        "source": "T09n0272_010:0362c05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0362c06_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善觀世界有八千萬城邑聚落，遍滿國土以為莊嚴。",
        "translation": "\"In that well-observed world, there are 80 million cities and towns that fill the land with their adornment.",
        "source": "T09n0272_010:0362c06_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一大城中，有十百千萬小城以為莊嚴，一切城邑皆亦如是。",
        "translation": "Within a large city, there are ten million small cities adorned with decorations, and so are all the cities.",
        "source": "T09n0272_010:0362c07_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一城邑、一一聚落滿百千萬男子、女人、童男、童女。",
        "translation": "Each town and village is filled with a million men, women, boys, and girls.",
        "source": "T09n0272_010:0362c09_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0362c10_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善觀名稱世界中，有一四天下，名曰見者歡喜世界。",
        "translation": "\"Among the worlds that are well known, there's a fourth world that's called the world of the joy of those who see.",
        "source": "T09n0272_010:0362c10_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸四天下，此最勝妙。",
        "translation": "Of the four worlds, this is the most wonderful.",
        "source": "T09n0272_010:0362c11_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人民熾盛安隱快樂，實慧幢王如來、應、正遍知彼世界中出現於世。",
        "translation": "Its people are abundantly peaceful and happy, and the Tathāgata, King of Real Wisdom, deserves to be known as the correct omniscience to appear in that world.",
        "source": "T09n0272_010:0362c12_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0362c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實慧幢王如來生在婆羅門家，母名速行，如我現世母名摩耶；父名梵才，如我現世父名白淨王；兒名名稱，如我現世子羅睺羅；妻名大慧，如我現世釋種瞿夷；乳母名大稱，如我現世摩訶波闍波提瞿曇彌；奉侍人名常隨順，如我現世闡陀迦；馬名大速，如我現世馬王揵陟。",
        "translation": "\"Thus, the Real King of Wisdom was born to a Brahmin family whose mother's name was Speedy Practice, as my mother's name is Māyā in the present life; whose father's name was Brahmacārī, as my father's name is King Baijō in the present life; whose son's name was Rāhula, as my son is in the present life; whose wife's name was Great Wisdom, as my son Śākyamuni is in the present life; whose nursemaid's name was Great Fame, as my mother Mahāprajāpatī Gautamī is in the present life; whose attendant's name was Always Obedient, as my father's name is Jātaka in the present life; and whose horse's name was Great Speed, as my horse King Gandhāra is in the present life.",
        "source": "T09n0272_010:0362c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實慧幢王如來乘彼大速踰城出家，如我現世所乘揵陟馬王出家。",
        "translation": "The Tathāgata King of Real Wisdom rides that great speed across town and leaves home, just as I ride Gandhāra, the king of horses, in the present life.",
        "source": "T09n0272_010:0362c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛道場名曰法尚，實慧幢王如來於彼道場成阿耨多羅三藐三菩提，如我現在寂滅道場。",
        "translation": "That Buddha's site of enlightenment is called Fashang, and the Tathāgata King of Real Wisdom accomplishes supreme perfect enlightenment at that site of enlightenment, just as I am now at the site of the path to cessation.",
        "source": "T09n0272_010:0362c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼道場樹有八十萬百千萬億樹以為眷屬。",
        "translation": "There are 800,000,000,000,000,000 trees at that site of enlightenment that are members of his retinue.",
        "source": "T09n0272_010:0362c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0362c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實慧幢王如來於彼劫中出世之時，無諸魔怨及魔眷屬。",
        "translation": "When the Tathāgata King of Real Wisdom appeared in the world during that eon, there were no enemies of Māra and Māra's followers.",
        "source": "T09n0272_010:0362c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0362c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實慧幢王如來成阿耨多羅三藐三菩提時，彼世界中所有眾生，一切執持種種華香、塗香、末香、散香，作諸種種伎樂歌舞，一時往詣法尚道場；乃至阿迦尼吒天一切天眾作諸種種天妙伎樂，集彼道場；一切夜叉眾作諸伎樂，集彼道場。",
        "translation": "When the Tathāgata King of True Wisdom accomplished supreme perfect enlightenment, all the sentient beings in that world who held various kinds of flowers, perfumes, powdered incense, and scattered incense and who performed various kinds of music and dance went to the Hosshō site at once; even all the celestials of the Akaniṣṭha Heaven produced various kinds of heavenly marvelous music and gathered at that site; and all the yakṣas produced music and gathered at that site.",
        "source": "T09n0272_010:0362c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼世界中所有一切乾闥婆眾、一切阿修羅眾、一切迦樓羅眾、一切緊那羅眾、一切摩睺羅伽眾各作百千萬種伎樂，與其眷屬集會道場。",
        "translation": "In that world, all the gandharvas, all the asuras, all the garuḍas, all the kiṃnaras, and all the mahoragas each create a hundred million kinds of music, and they assemble with their retinues at the site of the ritual.",
        "source": "T09n0272_010:0363a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方、南方、西方、北方、四維上下、無量無邊世界菩薩俱來集會。",
        "translation": "Bodhisattvas from the east, south, west, north, the four counterpoints, up and down, and the numberless and limitless worlds all come together.",
        "source": "T09n0272_010:0363a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0363a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實慧幢王如來初成正覺，為彼時會所集大眾，說此菩薩行方便境界奮迅大法門，有無量百千萬億那由他修多羅以為眷屬。",
        "translation": "When the Tathāgata King of Real Wisdom first became perfectly enlightened, he explained to the great Dharma teaching of the bodhisattva's practice of the skillful means and the realm of effort, and he had measureless hundreds of thousands of thousands of millions of nayutasūtra as his followers.",
        "source": "T09n0272_010:0363a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0363a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實慧幢王如來說此法門時，恒河沙等眾生得不退轉阿耨多羅三藐三菩提。",
        "translation": "When that Tathāgata King of True Wisdom teaches this teaching, sentient beings like the Ganges River sands attain irreversibility and unsurpassed perfect enlightenment.",
        "source": "T09n0272_010:0363a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0363a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實慧幢王如來出世，不說三乘教化之法。",
        "translation": "That truly is the Tathāgata King of Wisdom who appears in the world and doesn't teach the teachings of the three vehicles.",
        "source": "T09n0272_010:0363a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0363a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛國土無諸聲聞、辟支佛人，彼世界中所有眾生皆信一乘，皆信菩薩上妙勝行。",
        "translation": "There are no śrāvakas or pratyekbuddhas in that Buddha's land, and all the sentient beings in that world believe in the One Vehicle, and they all believe in the bodhisattva's superior and marvelous practices.",
        "source": "T09n0272_010:0363a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0363a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實慧幢王如來初集會時，有諸無量恒河沙等不退菩薩而來集會；第二會時，有八十億百千萬那由他一生補處菩薩而來集會；第三會時，有六十頻婆羅菩薩而來集會。",
        "translation": "When the Tathāgata King of True Wisdom first assembled, an infinite number of nonretrogressing bodhisattvas like the Ganges Sands came to assemble; at the second assembly, eight billion, ten million bodhisattvas from the patchwork of a lifetime came to assemble; and at the third assembly, 60 Bimbisāra bodhisattvas came to assemble.",
        "source": "T09n0272_010:0363a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0363a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次於後時，無量無邊眾生得不退轉阿耨多羅三藐三菩提心。",
        "translation": "Next, at some point later, measureless and limitless sentient beings attain the irreversible mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T09n0272_010:0363a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0363a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實慧幢王如來得阿耨多羅三藐三菩提已，六十小劫住世說法，後入涅槃。",
        "translation": "After attaining supreme perfect enlightenment, that Tathāgata King of True Wisdom lived in the world for 60 eons, expounding the Dharma, and then he entered nirvāṇa.",
        "source": "T09n0272_010:0363a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛涅槃後，正法住世，八十萬億百千億那由他劫，正法流行，教化眾生。",
        "translation": "佛涅槃後，正法住世，八十萬億百千億那由他劫，正法流行，教化眾生。",
        "source": "T09n0272_010:0363a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人眾多少、所得利益，如佛在世所度不異。",
        "translation": "The number of people and the benefits they receive are no different from those the Buddha delivered in the world.",
        "source": "T09n0272_010:0363a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0363a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實慧幢王如來臨涅槃時，與大幢王菩薩授記，然後入般涅槃。",
        "translation": "When the Tathāgata King of True Wisdom was about to enter nirvāṇa, he gave the Great King of Banners Bodhisattva a prediction and then entered parinirvāṇa.",
        "source": "T09n0272_010:0363a26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是言：『大幢王菩薩次我後成阿耨多羅三藐三菩提，名大莊嚴如來、應、正遍知。』」",
        "translation": "He said, 'The next bodhisattva, the king of great banners, will then become an unsurpassed, correct, and complete enlightenment known as the Tathāgata, the Worthy, and the Omniscient of Great Adornment.'\"",
        "source": "T09n0272_010:0363a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾欲知眾中何者是彼大幢王菩薩，次彼實慧幢王如來後成阿耨多羅三藐三菩提？",
        "translation": "Did the crowd then want to know which of the many was the Mahādhvaja Banner King Bodhisattva who next became an unsurpassed, correct, and complete enlightenment after the Tathāgata, the King of Real Wisdom Tathāgata?",
        "source": "T09n0272_010:0363b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者名大莊嚴如來、應、正遍知？",
        "translation": "What is called the Tathāgata, Worthy, and Perfectly Omniscient of Great Adornment?",
        "source": "T09n0272_010:0363b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知彼時眾覺觀心念，知心念已，告文殊師利法王子言：「文殊師利！",
        "translation": "The Bhagavān then knew that the multitude of awakened spirits at that time were observing the mind's thoughts, and having known that the mind was mindful, he addressed Mañjuśrī, the Dharma prince, saying, \"Mañjuśrī!",
        "source": "T09n0272_010:0363b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此薩遮善男子坐前坐者，名實喜摩那婆，於一切弟子眾中最為第一。",
        "translation": "This good man from Sāca who sits in front of him is called the truly joyful maṇḍala, the most distinguished of all the disciples.",
        "source": "T09n0272_010:0363b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此摩那婆於彼時中，成大莊嚴如來、應、正遍知。",
        "translation": "At that time, this manabha became a great adornment of tathāgatas, arhats, and omniscient beings.",
        "source": "T09n0272_010:0363b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛世界莊嚴勝妙，如實慧幢王如來世界不異。」",
        "translation": "The adornment of that Buddha's world is so marvelous that it's not different from the world of the Tathāgata, the true king of wisdom banners.\"",
        "source": "T09n0272_010:0363b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中，聞說彼佛國土勝妙功德莊嚴。",
        "translation": "At that point in time, they heard about the surpassing and marvelous adornment of the Buddha's land.",
        "source": "T09n0272_010:0363b09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼六十百千萬億那由他菩薩，願生彼國，作如是言：「此實慧幢王如來成佛之時，願我往生彼佛國土。」",
        "translation": "彼六十百千萬億那由他菩薩，願生彼國，作如是言：「此實慧幢王如來成佛之時，願我往生彼佛國土。」",
        "source": "T09n0272_010:0363b10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即與授記，皆當往生彼佛國土。",
        "translation": "The Bhagavān then gave them a prediction that they would all be reborn in that Buddha's land.",
        "source": "T09n0272_010:0363b12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八十千萬尼乾子眾一時同聲白言：「世尊！",
        "translation": "Eight hundred million Nirgrantha children all said with one voice, \"Bhagavān!",
        "source": "T09n0272_010:0363b13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦願往生彼佛國！」",
        "translation": "I, too, wish to be reborn in that Buddha's land!\"",
        "source": "T09n0272_010:0363b14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊亦即皆與授記：「汝善男子！",
        "translation": "The Bhagavān also then gave them all a prediction, \"You good sons!",
        "source": "T09n0272_010:0363b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切皆當生彼佛國。」",
        "translation": "All of them will be born in that Buddha's kingdom.\"",
        "source": "T09n0272_010:0363b15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八千萬億那由他天子虛空界中作如是言：「世尊！",
        "translation": "Eight hundred thousand million nayutas of gods in the heavens said, \"Bhagavān!",
        "source": "T09n0272_010:0363b16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等亦願實慧幢王如來得菩提時，俱往生彼善觀名稱世界，得見彼佛不可思議功德莊嚴清淨國土。」",
        "translation": "We also hope that when the Tathāgata King of Real Wisdom attains enlightenment, we'll all be born in that world of well-contemplated names and see that Buddha's unfathomably meritorious, adorned, and pure land.\"",
        "source": "T09n0272_010:0363b17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛即告彼諸天子：「諸善男子！",
        "translation": "The Buddha then addressed the celestials, \"Good sons!",
        "source": "T09n0272_010:0363b19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等皆當生彼善觀名稱世界，供養彼佛。",
        "translation": "All of you will be born in that world of well-contemplated names and make offerings to that Buddha.",
        "source": "T09n0272_010:0363b20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子！",
        "translation": "Sons of the gods!",
        "source": "T09n0272_010:0363b21_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等亦當在彼善觀名稱世界，皆成阿耨多羅三藐三菩提，種種名字、壽命住世、劫數多少如彼實慧幢王如來住世不異。」",
        "translation": "You too will become unsurpassed, correct, and worthy of enlightenment in that world of well-contemplated names, whose names, lifespan, and number of eons are not different from those of the Tathāgata, the true king of wisdom, who lives in the world.\"",
        "source": "T09n0272_010:0363b21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時三千大千世界六種振動，大地涌出百千萬億鉢頭摩花，閻浮檀金為葉，大青因陀羅摩尼寶以為其臺，瑪瑙日光寶為鬚，大毘琉璃摩尼寶以為其莖。",
        "translation": "At the time, six things in the 3,000 great one-thousand worlds shook, and a hundred thousand million million padma flowers sprang up from the earth, with gold jambū trees for their leaves, a large blue indra maṇi jewel for their pedestals, agate sunlight jewels for their beards, and a large vairocana maṇi jewel for their stems.",
        "source": "T09n0272_010:0363b24_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸一切鉢頭摩花，一一花上，見有無量百千萬億諸菩薩眾結跏趺坐，三十二相、八十種好莊嚴其身，一切皆共歸命如來。",
        "translation": "On each of those padma flowers, there are measureless hundreds of thousands of millions of bodhisattvas sitting cross-legged, their bodies adorned with thirty-two marks and eighty kinds of beauty, and they all give their assurances to the Tathāgata.",
        "source": "T09n0272_010:0363b27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩各以種種寶雲羅網，奉施如來作如是言：「世尊！",
        "translation": "Each of those bodhisattvas presented the Tathāgata with a web of various precious clouds and said, \"Bhagavān!",
        "source": "T09n0272_010:0363c01_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等種種世界來詣佛所，為聞佛說不可思議示現菩薩功德法門，為見如來，禮拜如來，供養如來，為見薩遮大善男子，為欲見此大會所有諸菩薩眾。」",
        "translation": "We have come from all the worlds to visit the Buddha in order to hear him teach the unfathomable approach of demonstrating the bodhisattvas' virtues, to see the Tathāgata, to venerate the Tathāgata, to make offerings to the Tathāgata, to see Sācārya, a great good man, and to see all the bodhisattvas in this assembly.\"",
        "source": "T09n0272_010:0363c02_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來說此妙法門時，於不可思議佛國土中，無量無邊諸來菩薩皆得不退阿耨多羅三藐三菩提。",
        "translation": "When the Tathāgata explained this wonderful teaching, measureless and limitless bodhisattvas from unfathomable Buddha lands all attained unsurpassed, correct, and complete enlightenment.",
        "source": "T09n0272_010:0363c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言：「一心攝諸根，　　聽我說妙法，　如來無妄語，　　諸佛不虛說。",
        "translation": "It was then that the Bhagavān wanted to recapitulate this meaning and spoke a verse, saying, \"With one mind, gather your faculties and listen to me as I explain the wonderful Dharma; the Tathāgata doesn't speak falsely; the buddhas don't speak falsely.",
        "source": "T09n0272_010:0363c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　薩遮及大眾，　　未來無量世，　過不可數劫，　　無刺淨劫中，　爾乃得成佛，　　號寶慧幢王。",
        "translation": "Satsya and the great assembly will pass through measureless eons and incalculably long eons in the future, and then they'll become buddhas, called the Banner King of Jeweled Wisdom.",
        "source": "T09n0272_010:0363c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時世無垢害，　　故名無刺劫，　時彼佛世界，　　號善觀名稱，　具足諸功德，　　天人皆歎仰。",
        "translation": "That world is so spotless that it's called the thornless eon, and that Buddha's world is called the Well-Acquired Name, which is replete with attributes that gods and humans admire.",
        "source": "T09n0272_010:0363c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　國界諸莊嚴，　　一切皆殊妙，　門闕諸樓閣，　　百千諸寶成，　閻浮金羅網，　　遍覆相映發，　光明常普照，　　晝夜無差別。",
        "translation": "The kingdom's realm is adorned with all its splendor, its gates and palaces are decorated with a hundred thousand treasures, and its gold mesh of jambu trees is covered and illuminated by a constant, universal light, and there's no distinction between day and night.",
        "source": "T09n0272_010:0363c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　懸諸百千寶，　　建立師子幢，　寶鈴出妙聲，　　說於如實法，　無垢寶垣牆，　　過諸天宮殿，　泉流諸池水，　　具足八美味。",
        "translation": "Hanging a hundred thousand treasures, it erects a lion's banner, produces the marvelous sound of jeweled bells, explains the true teaching, passes over the walls of undefiled jewels, passes through the palaces of gods, and flows from springs and pools of water that are replete with the eight delicious flavors.",
        "source": "T09n0272_010:0363c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鉢頭摩諸花，　　拘迦那陀等，　鮮明滿諸池，　　不雜諸塵垢。",
        "translation": "Padma flowers, kokanada, and so forth, fill the pools with their brightness and are unadulterated by defilements.",
        "source": "T09n0272_010:0363c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼世界住處，　　四天下中最，　具足妙莊嚴，　　是故名樂見。",
        "translation": "Their worldly abode is the most beautiful of the four worlds, replete with marvelous adornment, which is why it's called a pleasant vision.",
        "source": "T09n0272_010:0363c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼處如來生，　　婆羅門出家，　母名曰速行，　　父字名梵才，　子名曰妙稱，　　如我羅睺羅，　彼夫人大慧，　　如我今瞿夷，　乳母大名稱，　　如我波闍提，　給侍名隨順，　　亦名闡尼迦，　如我闡尼迦，　　恭敬隨我心，　第一最勝馬，　　字名曰大速，　彼能出如來，　　如我乘揵陟。",
        "translation": "There the Tathāgata is born, leaves home as a Brāhmaṇa, his mother's name is Speedy Action, his father's name is Brahmacārī, and his son's name is Myōshō, as I am Rāhula, his wife's great wisdom, as I am Ghoṣa, his wet nurse's great name, as I am Prajāti, his attendant's name is Obedient, his name is Cāṇḍika, as I am Cāṇḍika, he follows my heart with respect, is the best horse, his name is Great Speed, he produces the Tathāgata, as I ride the gandharva.",
        "source": "T09n0272_010:0364a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼佛菩提樹，　　字名曰法尚，　勝樹為眷屬，　　八十百千萬。",
        "translation": "That buddha-bodhi tree, whose name is Fashō, is a member of a superior tree of eighty million people.",
        "source": "T09n0272_010:0364a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼樹下法王，　　字名實惠佛，　坐彼道樹下，　　成於大菩提。",
        "translation": "Under that tree, the Dharma king whose name is truly the Buddha of Wisdom sits under that tree of enlightenment and achieves great enlightenment.",
        "source": "T09n0272_010:0364a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無諸魔眷屬，　　亦無諸魔業，　彼佛國土中，　　無有諸怨刺。",
        "translation": "Without any of Māra's retinues or Māra's karma, there are no enemies or thorns in that Buddha's land.",
        "source": "T09n0272_010:0364a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量諸天人，　　俱集彼淨土，　各執妙花鬘，　　百千諸伎樂，　各以恭敬心，　　俱詣如來所。",
        "translation": "Measureless gods and humans gather in that pure land, each carrying a garland of exquisite flowers and a hundred thousand musical instruments, each with respectful intentions, and they all go to the Tathāgata.",
        "source": "T09n0272_010:0364a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來知彼心，　　為說諸妙法，　無量修多羅，　　以為諸眷屬。",
        "translation": "Knowing their minds, the Tathāgata explains the wonderful Dharma and countless other sūtra for his followers.",
        "source": "T09n0272_010:0364a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼佛初集時，　　聞此法門者，　過恒沙塵眾，　　不退之菩提。",
        "translation": "When the buddhas first assembled, those who heard this teaching passed through a great multitude of sands, and they didn't retrogress to enlightenment.",
        "source": "T09n0272_010:0364a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼無聲聞乘，　　及無辟支佛，　諸勇猛菩薩，　　充滿彼淨土。",
        "translation": "There are no śrāvaka vehicles, no pratyekabuddhas, and courageous bodhisattvas who fill that pure land.",
        "source": "T09n0272_010:0364a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第二時會中，　　有諸菩薩眾，　八十那由他，　　一生住補處。",
        "translation": "In the second assembly, there are a multitude of bodhisattvas, 80 nayutas, who abide in a single complementary place for one lifetime.",
        "source": "T09n0272_010:0364a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第三會所集，　　諸大勝菩薩，　六十頻婆羅，　　住於如實處。",
        "translation": "At the third assembly, there are great victorious bodhisattvas gathered together, 60 Bimbisāra, who abide in the true place.",
        "source": "T09n0272_010:0364a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼如來住世，　　壽命六十劫，　時佛滅度後，　　法燈住世間。",
        "translation": "That Tathāgata lives in the world for 60 eons, and after the Buddha's death, the lamp of the Dharma lives in the world.",
        "source": "T09n0272_010:0364a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　舍利廣流布，　　八十億萬千，　那由他劫住，　　利益諸眾生。",
        "translation": "The relics are spread far and wide, eight billion million thousand, for an eon, benefiting all sentient beings.",
        "source": "T09n0272_010:0364b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼佛記大幢，　　然後入涅槃，　佛名大莊嚴，　　名稱顯世間。",
        "translation": "That Buddha remembers the great banner and then enters nirvāṇa, where he's called the great adornment, and his name is revealed to the world.",
        "source": "T09n0272_010:0364b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼世界莊嚴，　　不異實慧佛，　於彼國土中，　　成無垢菩提。",
        "translation": "The adornment of that world is not different from the Buddha of True Wisdom, and in that land he achieves unsullied enlightenment.",
        "source": "T09n0272_010:0364b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等當信我，　　智慧如虛空，　無盡性常住，　　遍處無障礙。",
        "translation": "You must believe in me, for my wisdom is like space, inexhaustible and eternal, and I'm unobstructed everywhere.",
        "source": "T09n0272_010:0364b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉能見未來，　　未有當有事，　何況過去劫，　　曾有而不記。",
        "translation": "I can fully see the future, and there's something that's yet to come, let alone past eons when it existed but wasn't recorded.",
        "source": "T09n0272_010:0364b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我住第一義，　　如實智慧中，　出言無虛妄，　　亦不令他說。",
        "translation": "I abide in the supreme truth, in true wisdom, speaking freely without falsehood, and I don't allow others to tell me.",
        "source": "T09n0272_010:0364b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今說真實，　　美妙甘露法，　是故汝大眾，　　聞應諦信受。",
        "translation": "Now, I've described the true, beautiful, and sweet dharma, so you, the people, should hear it and truly believe it.",
        "source": "T09n0272_010:0364b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大眾聞佛說，　　皆生歡喜心，　彼佛成道時，　　咸願生彼國。",
        "translation": "When the great multitude hears what the Buddha teaches, they all become joyous and rejoice, and when that Buddha attains enlightenment, they all wish to be born in that country.",
        "source": "T09n0272_010:0364b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊悉記彼，　　無量諸眾生，　彼佛出於世，　　汝等皆往生。",
        "translation": "The Bhagavān has memorized them all, and there are measureless sentient beings who will go forth from that Buddha's appearance in the world, and all of you will be reborn there.",
        "source": "T09n0272_010:0364b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等彼世界，　　教化諸眾生，　即彼成菩提，　　世界亦不異。",
        "translation": "All of you in that world will teach sentient beings, and the world won't be different when they achieve enlightenment.",
        "source": "T09n0272_010:0364b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說此法門時，　　大地六種動，　蓮花中菩薩，　　合掌向佛言。",
        "translation": "When he taught this teaching, the six elements of the earth moved, and the bodhisattva in the lotus flower joined his palms and said to the Buddha.",
        "source": "T09n0272_010:0364b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善哉佛世尊，　　不可得思議，　為諸無量眾，　　善說此法門。",
        "translation": "\"It's good, Bhagavān, inconceivable, to explain this teaching well for measureless multitudes.",
        "source": "T09n0272_010:0364b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等諸大眾，　　無量世界來，　皆為欲聞此，　　最上妙法輪。」",
        "translation": "We masses of people from measureless worlds have come here because we want to hear about this most excellent, marvelous dharma-wheel.\"",
        "source": "T09n0272_010:0364b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大薩遮尼乾子所說經信功德品第十二爾時會中一切大眾皆大歡喜踊躍，各各脫身所著上衣，奉施如來而作是言：「如來、世尊！",
        "translation": "At the time, all the people in the region rejoiced and jumped for joy as they each took off the upper robe they were wearing, gave it to the Tathāgata, and said, \"Tathāgata, Bhagavān!",
        "source": "T09n0272_010:0364b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今於世間第二轉法輪。",
        "translation": "Now, here in the world, he's turning the Dharma wheel for the second time.",
        "source": "T09n0272_010:0364c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來昔於波羅捺城初轉法輪，今復於此欝闍延城第二轉法輪。」",
        "translation": "The Tathāgata first turned the Dharma wheel in the city of Bārāṇasī, and now he's turning the Dharma wheel for the second time in the city of Ujjayan.\"",
        "source": "T09n0272_010:0364c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是言：「世尊！",
        "translation": "Again, he said, \"Bhagavān!",
        "source": "T09n0272_010:0364c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等願常不離聞此妙寶法門，願常不離薩遮善男子。」",
        "translation": "May we never part from hearing this wonderfully precious teaching, and may we never part from good sons of Satyasiddhi.\"",
        "source": "T09n0272_010:0364c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時虛空中諸天伎樂、妙鼓出聲，天雨憂鉢羅花、鉢頭摩花、拘牟頭花、分陀利花、婆師迦花等滿佛足下。",
        "translation": "At the time, the sky was filled with the sound of heavenly music and marvelous drums, and the heavens rained down udumbara flowers, padma flowers, kumuda flowers, puṇḍarīka flowers, and vāsikā flowers at the Buddha's feet.",
        "source": "T09n0272_010:0364c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天於空中，滿天寶衣如雲而下，而作是言：「若有善男子、善女人有能受持、讀誦、書寫、為人解說此妙法門，彼人決定已得無量無邊功德。」",
        "translation": "In the sky, the gods rained down clouds of precious clothing, saying, \"If there's a good man or woman who can memorize, recite, write, and explain this wonderful teaching to others, that person will surely have attained measureless and limitless merit.\"",
        "source": "T09n0272_010:0364c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利法王子菩薩白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī, Prince of the Dharma, said to the Buddha, \"Bhagavān!",
        "source": "T09n0272_010:0364c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子、善女人有能受持、讀誦、書寫、廣為人說此妙法門，成就幾許功德？」",
        "translation": "Good sons and good women, how much merit has been achieved by someone who can memorize, recite, write, and teach this wonderful teaching to others?\"",
        "source": "T09n0272_010:0364c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告文殊師利法王子言：「文殊師利！",
        "translation": "The Buddha addressed Mañjuśrī, the Dharma Prince, saying, \"Mañjuśrī!",
        "source": "T09n0272_010:0364c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子、善女人數此三千大千世界眾生，若有色、若無色，若有想、若無想，於眾生界中所有眾生，佛智慧知彼諸一切所有眾生，一時俱生得於人身。",
        "translation": "\"If there are good men and good women who count all the sentient beings in these 3,000 great one-thousand worlds, whether with or without form, with or without perception, and all the sentient beings in the sentient being realm, the Buddha's wisdom knows that all of those sentient beings are born together at one time and attain personal status.",
        "source": "T09n0272_010:0364c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得人身已，彼共俱修波羅蜜行，一時俱成阿耨多羅三藐三菩提，彼諸佛等一劫住世。",
        "translation": "After attaining the human body, they all cultivate the practice of perfection together, and they all attain supreme perfect enlightenment at once, and the buddhas and others abide in the world for one eon.",
        "source": "T09n0272_010:0364c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人滿足一劫，供養爾所諸佛、如來，禮拜、恭敬、尊重、讚歎，具足一切諸勝供養，乃至一切花香伎樂。",
        "translation": "For one eon, there are good sons and good women who make offerings to those buddhas and tathāgatas, venerating, respecting, praising, and making all kinds of excellent offerings, right down to all the flowers, fragrances, and music.",
        "source": "T09n0272_010:0364c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_010:0364c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何，彼善男子、善女人得福多不？」",
        "translation": "What do you think, will that good man or woman attain much merit?\"",
        "source": "T09n0272_010:0364c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言：「甚多，婆伽婆！",
        "translation": "Mañjuśrī said, \"Very much, Bhagavān!",
        "source": "T09n0272_010:0364c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚多，修伽陀！",
        "translation": "Very much so, Sugata!",
        "source": "T09n0272_010:0364c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子、善女人所得功德無量無邊，不可量、不可數、不可知、不可說。」",
        "translation": "The merit gained by that good man or good woman is immeasurable and limitless, incalculable, unknowable, and inexpressible.\"",
        "source": "T09n0272_010:0364c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告文殊師利：「若有善男子、善女人，受持、讀誦、書寫、流布、為人廣說此菩薩行方便功德法門，所得功德過彼善男子、善女人供養諸佛功德，無量無邊，不可稱數，不可挍量。」",
        "translation": "The Buddha told Mañjuśrī, \"If there are good men and good women who memorize, recite, write, disseminate, and explain in detail for others this method of the merits of the bodhisattva's practice, the merits they will attain will exceed the merits of that good man or woman's offerings to the buddhas by an immeasurable, limitless, incalculable, and immeasurable amount.\"",
        "source": "T09n0272_010:0364c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利白佛言：「世尊！",
        "translation": "Mañjuśrī said to the Buddha, \"Bhagavān!",
        "source": "T09n0272_010:0364c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有婆伽婆，希有修伽陀！",
        "translation": "There are rare bhagavat, there are rare sugata!",
        "source": "T09n0272_010:0365a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來為欲安樂一切諸眾生故，說此法門。」",
        "translation": "The Tathāgata explains this teaching for the purpose of wishing to bring comfort to all sentient beings.\"",
        "source": "T09n0272_010:0365a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是言：「世尊！",
        "translation": "Again, he said, \"Bhagavān!",
        "source": "T09n0272_010:0365a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此妙法門於閻浮提幾時住世？」",
        "translation": "When will this wonderful dharma-gate abide in Jambudvīpa?\"",
        "source": "T09n0272_010:0365a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告文殊師利：「我涅槃時，有八大國王，為欲流布我舍利故，彼時八國分為八分，置八函中，人取一函，各還本國，立大塔廟尊重供養。",
        "translation": "The Buddha told Mañjuśrī, \"When I was in nirvāṇa, there were eight great kingdoms that wanted to spread my relics, so they divided the eight kingdoms into eight parts and placed them in eight letters, each taking one letter, returning it to his own country, erecting a large stūpa, or temple, and honoring and venerating it.",
        "source": "T09n0272_010:0365a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時阿闍世王於我舍利所得一分，於金疊上書此修多羅，并與舍利一時俱置七寶函中。",
        "translation": "\"At the time, the king of Ajātaśatru took a portion of my relics, wrote this sūtra on a gold pile, and placed it with the relics in a seven-jeweled receptacle at the same time.",
        "source": "T09n0272_010:0365a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於王舍大城外，掘地作坑。",
        "translation": "Outside the great city of Rājagṛha, he dug a hole in the ground and made a pit.",
        "source": "T09n0272_010:0365a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中立塔，莊嚴殊妙。",
        "translation": "He placed a stūpa in it, adorned with splendor.",
        "source": "T09n0272_010:0365a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以舍利函置彼塔中，懸百千萬阿僧祇寶蓋、幢幡，散諸無價一切香花，七寶香甕盛滿香油，然大燈炷，滿一百年住持不滅。",
        "translation": "He placed the relics' receptacle in that stūpa, hung a hundred million incalculable jeweled canopies and banners, scattered priceless flowers, filled seven-jeweled jars with scented oil, and placed a large lamp that would last for a hundred years and not go out.",
        "source": "T09n0272_010:0365a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0365a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我入涅槃一百年後，有阿輸迦王於毛梨家生，出現於世，作轉輪王王閻浮提而得自在，得具足力，善能降伏剛強眾生。",
        "translation": "A hundred years after I entered nirvāṇa, there was King Aśoka, born in the Mauryan family, who appeared in the world as the wheel-turning king Jambudvī and attained mastery, attaining complete power and being able to skillfully subdue resolute sentient beings.",
        "source": "T09n0272_010:0365a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王爾時，必觀察我，能憶念我，護持我法，於我身上得尊重心。",
        "translation": "At the time, that king would surely have observed me, remembered me, defended my teachings, and attained a respectful attitude toward me.",
        "source": "T09n0272_010:0365a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0365a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼阿輸迦王有一比丘，名淨自在，王子中生，出家求道。",
        "translation": "That king of Aśoka had a monk named Jing Zizai, born among princes, who left home and sought the path.",
        "source": "T09n0272_010:0365a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿輸迦王以為門師，有大神通力、有大威德力，護諸佛法、護大方廣。",
        "translation": "The king of Aśoka considered him to be his disciple, a monk with great supernormal powers and great authoritative qualities who protected the Buddha's teachings and guarded them generously and broadly.",
        "source": "T09n0272_010:0365a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿輸迦王深心尊重淨自在比丘故，不令餘處，常在王家身自供養。",
        "translation": "Because he deeply respected that monk Jing Zizai, King Aśoka didn't allow him to go to any other place and always made offerings to the king's household.",
        "source": "T09n0272_010:0365a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0365a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿輸迦王為欲流布我身舍利，饒益一切諸眾生故，欲出地下舍利寶函，與諸無量大臣、王子、長者、居士眷屬圍遶，設大莊嚴顯大王力，執持香花、塗香、末香、散香，作百千種諸妙伎樂，詣王舍大城，設諸一切勝妙供養，無量無邊不可稱數，掘出地中舍利寶函。",
        "translation": "In order to spread the relics of my body for the benefit of all sentient beings, King Aśoka wanted to take out a precious relics repository from beneath the ground, surround it with measureless ministers, princes, elders, and householders, set up a great adornment displaying the power of a great king, hold fragrant flowers, scatter incense, powdered incense, and create a hundred thousand kinds of wonderful music, go to the great city of Rājagṛha, and make all kinds of wonderful offerings that are numberless and limitless and cannot be counted, and dig out a precious relics repository from beneath the ground.",
        "source": "T09n0272_010:0365a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出已七日，以一切香、一切花、一切花鬘、一切散香、一切塗香、一切伎樂供養恭敬。",
        "translation": "For seven days after it emerged, he offered up all kinds of incense, all flowers, all flower garlands, all scattered incense, all smeared incense, and all kinds of music and play to pay his respects.",
        "source": "T09n0272_010:0365a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滿七日已，於閻浮提種種國土，非前後時，於一日、一時、一須臾間遍閻浮提，一時建立八萬四千佛舍利塔。",
        "translation": "After the seven days were up, he built 84,000 stūpas of Buddha's relics in a single day, hour, or moment throughout Jambudvīpa, in a variety of lands in Jambudvīpa, not just at the beginning or end of the day.",
        "source": "T09n0272_010:0365b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時淨自在比丘於彼舍利函中取此法門在於北廂大國土中廣宣流布。",
        "translation": "At the time, the monk Jingzizai took this teaching from that relics repository and spread it far and wide throughout the great northern lands.",
        "source": "T09n0272_010:0365b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0365b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼淨自在比丘雖加流布，而此法門受持者少，多人不知、多人不覺、多人不攝、多人不受，希有人能受持、讀誦此法門者。",
        "translation": "Although that monk Pūrṇa Maitrāyaniputra disseminates it, few people accept this teaching, many don't know it, many don't realize it, many don't take it in, and many don't accept it, and it's rare to find someone who can accept and recite this teaching.",
        "source": "T09n0272_010:0365b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0365b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是勝法，眾生薄福，不應聞故。",
        "translation": "This is a wonderful teaching that sentient beings are too weak in fortune to hear about.",
        "source": "T09n0272_010:0365b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0365b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此妙法門，人多祕掌，置經函中諸庫藏中。",
        "translation": "This wonderful teaching is often kept secret by people and placed in the sūtra repositories.",
        "source": "T09n0272_010:0365b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0365b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無法器不應得種無上善根故。",
        "translation": "It's because the Dharma-less vessel shouldn't be able to plant unsurpassed good roots.",
        "source": "T09n0272_010:0365b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0365b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_010:0365b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此妙法門難信、難行、難量故。",
        "translation": "This wonderful teaching is difficult to believe, difficult to practice, and difficult to measure.",
        "source": "T09n0272_010:0365b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_010:0365b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡所有人宿無善根，曾聞大乘生疑毀謗，是故聞此無上法門，不能生信、不能得入。",
        "translation": "Ordinary people who lack good roots in the past and have heard of the great vehicle become doubtful and disparaging, so when they hear this unsurpassed teaching, they can't become convinced and can't enter it.",
        "source": "T09n0272_010:0365b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_010:0365b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後末世中法欲滅時，聞此法門，能生信者、能推求者、能解入者。",
        "translation": "In the latter part of the world, when the Dharma is about to cease, those who hear this teaching will be able to give rise to faith, those who are able to seek it, and those who are able to understand and enter it.",
        "source": "T09n0272_010:0365b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_010:0365b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝知此人已曾供養過去無量無邊諸佛，善行諸行乃能信入此大乘門。",
        "translation": "Do you know that this person has made offerings to measureless and limitless buddhas in the past and has performed various practices well to enter this great vehicle path with faith?",
        "source": "T09n0272_010:0365b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T09n0272_010:0365b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子、善女人於後末世聞此經名，聞能生信，受持、讀誦、書寫、解說，書已尊重供養經卷。",
        "translation": "\"If there are good men and good women who hear the name of this sūtra in later generations and are able to believe in it when they hear it, accept, recite, write, explain, and respect and make offerings to the sūtra scroll after writing it, then they should remember to know that they've seen measureless buddhas in the past and made offerings to and respected buddhas of measureless duration.",
        "source": "T09n0272_010:0365b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生應自念知，已於過去，曾見無量恒沙諸佛，供養恭敬恒沙諸佛。",
        "translation": "Those sentient beings should remember for themselves that they've seen measureless buddhas of the eternal past and have made offerings to and honored buddhas of the eternal past.",
        "source": "T09n0272_010:0365b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T09n0272_010:0365b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生亦見我身在此園中說此法門，亦見此諸大會之眾。」",
        "translation": "Those sentient beings also saw me in this garden teaching this teaching and saw the large congregation here.\"",
        "source": "T09n0272_010:0365b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告阿難言：「阿難！",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"Ānanda!",
        "source": "T09n0272_010:0365b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當受持、讀誦此妙法門，為諸眾生而廣宣說。",
        "translation": "You must accept, recite, and read this wonderful teaching, and explain it widely for the benefit of sentient beings.",
        "source": "T09n0272_010:0365b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當觀眾生有大乘根堪信受者，乃可為說，不得率爾不觀而說。",
        "translation": "You must examine the capacity of sentient beings to believe in the great vehicle and accept it before you can explain it to them, and you mustn't explain it in a casual manner without examining it.",
        "source": "T09n0272_010:0365b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0365b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薄福眾生聞生不信，得罪無量故。",
        "translation": "Weakly endowed sentient beings who hear about it give rise to disbelief, which results in immeasurable offenses.",
        "source": "T09n0272_010:0365b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T09n0272_010:0365b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法門者，名為如來真實功德、名為如來祕密之藏、名為如來純淨妙藏、名為如來法印之藏、名為如來心所護藏、名為如來現實信藏。",
        "translation": "This is the Dharma teaching that's called the Tathāgata's true merit, the Tathāgata's hidden treasury, the Tathāgata's pure and wonderful treasury, the Tathāgata's Dharma-seal treasury, the treasury protected by the Tathāgata's mind, and the Tathāgata's store of faith in reality.",
        "source": "T09n0272_010:0365b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T09n0272_010:0365c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當祕掌，莫卒宣說，除諸佛子菩薩摩訶薩等。",
        "translation": "Keep your palms shut and don't announce it except to the buddhas, bodhisattvas, mahāsattvas, and so forth.",
        "source": "T09n0272_010:0365c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T09n0272_010:0365c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子於諸佛所深種善根，能護法藏，能利自己，亦能利他，應為彼說。」",
        "translation": "That good man has deeply planted good roots in the buddhas, protects the treasury of the Dharma, and is able to benefit himself as well as others, so you should explain it for him.\"",
        "source": "T09n0272_010:0365c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「世尊！",
        "translation": "Ānanda said, \"Bhagavān!",
        "source": "T09n0272_010:0365c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已受此淨妙法門。",
        "translation": "\"I've accepted this pure and wonderful teaching.",
        "source": "T09n0272_010:0365c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T09n0272_010:0365c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此法門，名為何等？",
        "translation": "Now, what is this teaching called?",
        "source": "T09n0272_010:0365c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you uphold it?\"",
        "source": "T09n0272_010:0365c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「此妙法門名為『菩薩行方便境界奮迅法門』、名為『如來深祕密藏』、名為『如來具足功德』、名為『如來甚深境界』、名為『一乘』、名為『文殊師利所說經』、名為『薩遮尼乾子授記經』、名為『薩遮尼乾子所說經』，汝今應當如是奉持。」",
        "translation": "The Buddha told Ānanda, \"This wonderful dharma-gate is called 'the excitement dharma-gate of the realm of skillful means practiced by the bodhisattvas,' 'the Tathāgata's deep, esoteric store,' 'the Tathāgata's fully-equipped attributes,' 'the Tathāgata's profound realm,' 'the One Vehicle,' 'the scripture taught by Mañjuśrī,' 'the scripture conferred by Sācānī Gandharva,' and 'the scripture taught by Sācānī Gandharva,' and you should now thus uphold it.\"",
        "source": "T09n0272_010:0365c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來說此法門時，三十億那由他眾生發阿耨多羅三藐三菩提心，六十千菩薩得無生忍，無量無邊眾生畢竟不退阿耨多羅三藐三菩提心。",
        "translation": "When the Tathāgata explained this teaching, three billion nayutas of sentient beings aroused the mind of unsurpassed, samyak-saṃbodhi, 60,000 bodhisattvas attained the patient acceptance of nonarising, and measureless and limitless sentient beings did not regress from the mind of unsurpassed, samyak-saṃbodhi after all.",
        "source": "T09n0272_010:0365c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，慧命阿難，文殊師利法王子菩薩，及諸一切菩薩摩訶薩，比丘、比丘尼、優婆塞、優婆夷，釋提桓因、四天王、梵天王，天、人、阿脩羅等，聞佛所說，皆大歡喜，信受奉行。",
        "translation": "After the Buddha taught this sūtra, Wisdom Life Ānanda, Mañjuśrī, Prince of the Dharma, and all the bodhisattvas, monks, nuns, laymen, and laywomen, Śakrodevānī, the four heavenly kings, the Brahma kings, gods, humans, and asuras who heard what he taught rejoiced greatly, believed, and approved.",
        "source": "T09n0272_010:0365c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大薩遮尼乾子經卷第十",
        "translation": "Mahāsatya-nirgrantha-sūtra, Volume 10",
        "source": "T09n0272_010:0365c20_0",
        "is_bad_quality": false
    }
]