[
    {
        "source_sentence": "大方廣佛華嚴經卷第七十三",
        "translation": "Dafangguangfo huayan jing roll 73",
        "source": "T10n0279_073:0396b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "Translated by the Bhikṣuṇī of Khotan, the Tripiṭaka of Khotan",
        "source": "T10n0279_073:0396b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入法界品第三十九之十四",
        "translation": "Chapter 39-14 of the Sutra on Entry into the Realm of Reality",
        "source": "T10n0279_073:0396b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子往大願精進力救護一切眾生夜神所，見彼夜神在大眾中，坐普現一切宮殿摩尼王藏師子之座，普現法界國土摩尼寶網彌覆其上，現日、月、星宿影像身，現隨眾生心普令得見身，現等一切眾生形相身，現無邊廣大色相海身，現普現一切威儀身，現普於十方示現身，現普調一切眾生身，現廣運速疾神通身，現利益眾生不絕身，現常遊虛空利益身，現一切佛所頂禮身，現修習一切善根身，現受持佛法不忘身，現成滿菩薩大願身，現光明充滿十方身，現法燈普滅世暗身，現了法如幻淨智身，現遠離塵暗法性身，現普智照法明了身，現究竟無患無熱身，現不可沮壞堅固身，現無所住佛力身，現無分別離染身，現本清淨法性身。",
        "translation": "爾時，善財童子往大願精進力救護一切眾生夜神所，見彼夜神在大眾中，坐普現一切宮殿摩尼王藏師子之座，普現法界國土摩尼寶網彌覆其上，現日、月、星宿影像身，現隨眾生心普令得見身，現等一切眾生形相身，現無邊廣大色相海身，現普現一切威儀身，現普於十方示現身，現普調一切眾生身，現廣運速疾神通身，現利益眾生不絕身，現常遊虛空利益身，現一切佛所頂禮身，現修習一切善根身，現受持佛法不忘身，現成滿菩薩大願身，現光明充滿十方身，現法燈普滅世暗身，現了法如幻淨智身，現遠離塵暗法性身，現普智照法明了身，現究竟無患無熱身，現不可沮壞堅固身，現無所住佛力身，現無分別離染身，現本清淨法性身。",
        "source": "T10n0279_073:0396b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子見如是等佛剎微塵數差別身，一心頂禮，舉體投地，良久乃起，合掌瞻仰，於善知識生十種心。",
        "translation": "When the boy of good fortune saw these buddhas' minutely differentiated bodies, he bowed his head with one heart, threw his body to the ground, waited a long time before rising, put his palms together to look up, and gave rise to ten kinds of thoughts about the good teacher.",
        "source": "T10n0279_073:0396b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_073:0396c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：「於善知識生同己心，令我精勤辦一切智助道法故；於善知識生清淨自業果心，親近供養生善根故；於善知識生莊嚴菩薩行心，令我速能莊嚴一切菩薩行故；於善知識生成就一切佛法心，誘誨於我令修道故；於善知識生能生心，能生於我無上法故；於善知識生出離心，令我修行普賢菩薩所有行願而出離故；於善知識生具一切福智海心，令我積集諸白法故；於善知識生增長心，令我增長一切智故；於善知識生具一切善根心，令我志願得圓滿故；於善知識生能成辦大利益心，令我自在安住一切菩薩法故，成一切智道故，得一切佛法故。」",
        "translation": "所謂：「於善知識生同己心，令我精勤辦一切智助道法故；於善知識生清淨自業果心，親近供養生善根故；於善知識生莊嚴菩薩行心，令我速能莊嚴一切菩薩行故；於善知識生成就一切佛法心，誘誨於我令修道故；於善知識生能生心，能生於我無上法故；於善知識生出離心，令我修行普賢菩薩所有行願而出離故；於善知識生具一切福智海心，令我積集諸白法故；於善知識生增長心，令我增長一切智故；於善知識生具一切善根心，令我志願得圓滿故；於善知識生能成辦大利益心，令我自在安住一切菩薩法故，成一切智道故，得一切佛法故。」",
        "source": "T10n0279_073:0396c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十。",
        "translation": "These are the ten.",
        "source": "T10n0279_073:0396c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發是心已，得彼夜神與諸菩薩佛剎微塵數同行。",
        "translation": "After giving rise to this mindfulness, they'll attain the company of that night spirit and a tiny number of bodhisattva buddhas.",
        "source": "T10n0279_073:0396c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：同念，心常憶念十方三世一切佛故；同慧，分別決了一切法海差別門故；同趣，能轉一切諸佛如來妙法輪故；同覺，以等空智普入一切三世間故；同根，成就菩薩清淨光明智慧根故；同心，善能修習無礙功德，莊嚴一切菩薩道故；同境，普照諸佛所行境故；同證，得一切智照實相海淨光明故；同義，能以智慧了一切法真實性故；同勇猛，能壞一切障礙山故；同色身，隨眾生心示現身故；同力，求一切智不退轉故；同無畏，其心清淨如虛空故；同精進，於無量劫行菩薩行無懈倦故；同辯才，得法無礙智光明故；同無等，身相清淨超世間故；同愛語，令一切眾生皆歡喜故；同妙音，普演一切法門海故；同滿音，一切眾生隨類解故；同淨德，修習如來淨功德故；同智地，一切佛所受法輪故；同梵行，安住一切佛境界故；同大慈，念念普覆一切國土眾生海故；同大悲，普雨法雨潤澤一切諸眾生故；同身業，以方便行教化一切諸眾生故；同語業，以隨類音演說一切諸法門故；同意業，普攝眾生置一切智境界中故；同莊嚴，嚴淨一切諸佛剎故；同親近，有佛出世皆親近故；同勸請，請一切佛轉法輪故；同供養，常樂供養一切佛故；同教化，調伏一切諸眾生故；同光明，照了一切諸法門故；同三昧，普知一切眾生心故；同充遍，以自在力充滿一切諸佛剎海修諸行故；同住處，住諸菩薩大神通故；同眷屬，一切菩薩共止住故；同入處，普入世界微細處故；同心慮，普知一切諸佛剎故；同往詣，普入一切佛剎海故；同方便，悉現一切諸佛剎故；同超勝，於諸佛剎皆無比故；同不退，普入十方無障礙故；同破闇，得一切佛成菩提智大光明故；同無生忍，入一切佛眾會海故；同遍一切諸佛剎網，恭敬供養不可說剎諸如來故；同智證，了知彼彼法門海故；同修行，順行一切諸法門故；同希求，於清淨法深樂欲故；同清淨，集佛功德而以莊嚴身、口、意故；同妙意，於一切法智明了故；同精進，普集一切諸善根故；同淨行，成滿一切菩薩行故；同無礙，了一切法皆無相故；同善巧，於諸法中智自在故；同隨樂，隨眾生心現境界故；同方便，善習一切所應習故；同護念，得一切佛所護念故；同入地，得入一切菩薩地故；同所住，安住一切菩薩位故；同記別，一切諸佛授其記故；同三昧，一剎那中普入一切三昧門故；同建立，示現種種諸佛事故；同正念，正念一切境界門故；同修行，盡未來劫修行一切菩薩行故；同淨信，於諸如來無量智慧極欣樂故；同捨離，滅除一切諸障礙故；同不退智，與諸如來智慧等故；同受生，應現成熟諸眾生故；同所住，住一切智方便門故；同境界，於法界境得自在故；同無依，永斷一切所依心故；同說法，已入諸法平等智故；同勤修，常蒙諸佛所護念故；同神通，開悟眾生令修一切菩薩行故；同神力，能入十方世界海故；同陀羅尼，普照一切總持海故；同祕密法，了知一切修多羅中妙法門故；同甚深法，解一切法如虛空故；同光明，普照一切諸世界故；同欣樂，隨眾生心而為開示令歡喜故；同震動，為諸眾生現神通力普動十方一切剎故；同不虛，見聞憶念皆悉令其心調伏故；同出離，滿足一切諸大願海，成就如來十力智故。",
        "translation": "所謂：同念，心常憶念十方三世一切佛故；同慧，分別決了一切法海差別門故；同趣，能轉一切諸佛如來妙法輪故；同覺，以等空智普入一切三世間故；同根，成就菩薩清淨光明智慧根故；同心，善能修習無礙功德，莊嚴一切菩薩道故；同境，普照諸佛所行境故；同證，得一切智照實相海淨光明故；同義，能以智慧了一切法真實性故；同勇猛，能壞一切障礙山故；同色身，隨眾生心示現身故；同力，求一切智不退轉故；同無畏，其心清淨如虛空故；同精進，於無量劫行菩薩行無懈倦故；同辯才，得法無礙智光明故；同無等，身相清淨超世間故；同愛語，令一切眾生皆歡喜故；同妙音，普演一切法門海故；同滿音，一切眾生隨類解故；同淨德，修習如來淨功德故；同智地，一切佛所受法輪故；同梵行，安住一切佛境界故；同大慈，念念普覆一切國土眾生海故；同大悲，普雨法雨潤澤一切諸眾生故；同身業，以方便行教化一切諸眾生故；同語業，以隨類音演說一切諸法門故；同意業，普攝眾生置一切智境界中故；同莊嚴，嚴淨一切諸佛剎故；同親近，有佛出世皆親近故；同勸請，請一切佛轉法輪故；同供養，常樂供養一切佛故；同教化，調伏一切諸眾生故；同光明，照了一切諸法門故；同三昧，普知一切眾生心故；同充遍，以自在力充滿一切諸佛剎海修諸行故；同住處，住諸菩薩大神通故；同眷屬，一切菩薩共止住故；同入處，普入世界微細處故；同心慮，普知一切諸佛剎故；同往詣，普入一切佛剎海故；同方便，悉現一切諸佛剎故；同超勝，於諸佛剎皆無比故；同不退，普入十方無障礙故；同破闇，得一切佛成菩提智大光明故；同無生忍，入一切佛眾會海故；同遍一切諸佛剎網，恭敬供養不可說剎諸如來故；同智證，了知彼彼法門海故；同修行，順行一切諸法門故；同希求，於清淨法深樂欲故；同清淨，集佛功德而以莊嚴身、口、意故；同妙意，於一切法智明了故；同精進，普集一切諸善根故；同淨行，成滿一切菩薩行故；同無礙，了一切法皆無相故；同善巧，於諸法中智自在故；同隨樂，隨眾生心現境界故；同方便，善習一切所應習故；同護念，得一切佛所護念故；同入地，得入一切菩薩地故；同所住，安住一切菩薩位故；同記別，一切諸佛授其記故；同三昧，一剎那中普入一切三昧門故；同建立，示現種種諸佛事故；同正念，正念一切境界門故；同修行，盡未來劫修行一切菩薩行故；同淨信，於諸如來無量智慧極欣樂故；同捨離，滅除一切諸障礙故；同不退智，與諸如來智慧等故；同受生，應現成熟諸眾生故；同所住，住一切智方便門故；同境界，於法界境得自在故；同無依，永斷一切所依心故；同說法，已入諸法平等智故；同勤修，常蒙諸佛所護念故；同神通，開悟眾生令修一切菩薩行故；同神力，能入十方世界海故；同陀羅尼，普照一切總持海故；同祕密法，了知一切修多羅中妙法門故；同甚深法，解一切法如虛空故；同光明，普照一切諸世界故；同欣樂，隨眾生心而為開示令歡喜故；同震動，為諸眾生現神通力普動十方一切剎故；同不虛，見聞憶念皆悉令其心調伏故；同出離，滿足一切諸大願海，成就如來十力智故。",
        "source": "T10n0279_073:0396c15_6",
        "is_bad_quality": true
    },
    {
        "source_sentence": "時，善財童子觀察大願精進力救護一切眾生夜神，起十種清淨心，獲如是等佛剎微塵數同菩薩行；既獲此已，心轉清淨，偏袒右肩，頂禮其足，一心合掌，以偈讚曰：「我發堅固意，　　志求無上覺；　今於善知識，　　而起自己心。",
        "translation": "After he attained this, his mind became purified, he bared his right shoulder, bowed his head at his feet, put his palms together with one heart, and praised him in verse, \"I've had a resolute intention to pursue unsurpassed awakening, and now I've given rise to my own mind in a good teacher.",
        "source": "T10n0279_073:0397b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以見善知識，　　集無盡白法，　滅除眾罪垢，　　成就菩提果。",
        "translation": "Because I see a good teacher, he gathers endless white dharmas, removes the stain of many sins, and accomplishes the fruit of enlightenment.",
        "source": "T10n0279_073:0397b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我見善知識，　　功德莊嚴心，　盡未來剎劫，　　勤修所行道。",
        "translation": "I see a good teacher, a mind adorned with merit, and I diligently cultivate the path that he'll follow throughout the coming eons.",
        "source": "T10n0279_073:0397b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我念善知識，　　攝受饒益我，　為我悉示現，　　正教真實法，　關閉諸惡趣，　　顯示人天路，　亦示諸如來，　　成一切智道。",
        "translation": "I'm mindful of that good teacher who takes me in, gives me benefit, and shows me everything, correctly teaching the true Dharma, shutting down the bad destinies, revealing the paths of humans and gods, and showing the tathāgatas the path to all knowledge.",
        "source": "T10n0279_073:0397c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我念善知識，　　是佛功德藏，　念念能出生，　　虛空功德海。",
        "translation": "I remember that this good teacher is a store of the Buddha's merit, and that each moment produces an ocean of empty merit.",
        "source": "T10n0279_073:0397c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　與我波羅蜜，　　增我難思福，　長我淨功德，　　令我冠佛繒。",
        "translation": "He gives me the perfection, increases my unfathomable merit, prolongs my pure virtue, and causes me to crown the Buddha's silks.",
        "source": "T10n0279_073:0397c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我念善知識，　　能滿佛智道；　誓願常依止，　　圓滿白淨法。",
        "translation": "I remember that a good teacher can fulfill the Buddha's path of wisdom, and I vow to always rely on him to completely fulfill the white pure dharma.",
        "source": "T10n0279_073:0397c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我以此等故，　　功德悉具足，　普為諸眾生，　　說一切智道。",
        "translation": "Because of this, I'm fully endowed with the merit to teach all sentient beings the path of wisdom.",
        "source": "T10n0279_073:0397c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聖者為我師，　　與我無上法，　無量無數劫，　　不能報其恩。」",
        "translation": "The noble one is my teacher, and he gives me the unsurpassed Dharma, which cannot be repaid for measureless and incalculable eons.\"",
        "source": "T10n0279_073:0397c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財說此偈已，白言：「大聖！",
        "translation": "It was then that Shanzai said this verse and said, \"Great sage!",
        "source": "T10n0279_073:0397c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為我說，此解脫門名為何等？",
        "translation": "What is the name of this gate of liberation, may you explain it for me?",
        "source": "T10n0279_073:0397c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發心已來為幾時耶？",
        "translation": "How long has it been since you aroused the intention to do so?",
        "source": "T10n0279_073:0397c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久如當得阿耨多羅三藐三菩提？」",
        "translation": "How long will it take to attain supreme perfect enlightenment?\"",
        "source": "T10n0279_073:0397c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜神告言：「善男子！",
        "translation": "The god of the night told him, \"Good sons!",
        "source": "T10n0279_073:0397c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此解脫門，名：教化眾生令生善根。",
        "translation": "\"This aspect of liberation is called teaching sentient beings to produce good roots.",
        "source": "T10n0279_073:0397c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以成就此解脫故，悟一切法自性平等，入於諸法真實之性，證無依法，捨離世間，悉知諸法色相差別，亦能了達青、黃、赤、白，性皆不實，無有差別，而恒示現無量色身。",
        "translation": "Because I've accomplished this liberation, I've realized the self-nature of all things as equal, entered the true nature of all things, realized that there's no law, abandoned the world, fully understood the distinctions in the form and shape of all things, and been able to comprehend that the natures of blue, yellow, red, and white are all unreal and have no distinctions, and yet I'm constantly displaying a body of measureless form.",
        "source": "T10n0279_073:0397c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：種種色身、非一色身、無邊色身、清淨色身、一切莊嚴色身、普見色身、等一切眾生色身、普現一切眾生前色身、光明普照色身、見無厭足色身、相好清淨色身、離眾惡光明色身、示現大勇猛色身、甚難得色身、一切世間無能映蔽色身、一切世間共稱歎無盡色身、念念常觀察色身、示現種種雲色身、種種形顯色色身、現無量自在力色身、妙光明色身、一切淨妙莊嚴色身、隨順成熟一切眾生色身、隨其心樂現前調伏色身、無障礙普光明色身、清淨無濁穢色身、具足莊嚴不可壞色身、不思議法方便光明色身、無能映奪一切色身、無諸闇破一切闇色身、集一切白淨法色身、大勢力功德海色身、從過去恭敬因所生色身、如虛空清淨心所生色身、最勝廣大色身、無斷無盡色身、光明海色身、於一切世間無所依平等色身、遍十方無所礙色身、念念現種種色相海色身、增長一切眾生歡喜心色身、攝取一切眾生海色身、一一毛孔中說一切佛功德海色身、淨一切眾生欲解海色身、決了一切法義色身、無障礙普照耀色身、等虛空淨光明色身、放廣大淨光明色身、照現無垢法色身、無比色身、差別莊嚴色身、普照十方色身、隨時示現應眾生色身、寂靜色身、滅一切煩惱色身、一切眾生福田色身、一切眾生見不虛色身、大智慧勇猛力色身、無障礙普周遍色身、妙身雲普現世間皆蒙益色身、具足大慈海色身、大福德寶山王色身、放光明普照世間一切趣色身、大智慧清淨色身、生眾生正念心色身、一切寶光明色身、普光藏色身、現世間種種清淨相色身、求一切智處色身、現微笑令眾生生淨信色身、一切寶莊嚴光明色身、不取不捨一切眾生色身、無決定無究竟色身、現自在加持力色身、現一切神通變化色身、生如來家色身、遠離眾惡遍法界海色身、普現一切如來道場眾會色身、具種種眾色海色身、從善行所流色身、隨所應化示現色身、一切世間見無厭足色身、種種淨光明色身、現一切三世海色身、放一切光明海色身、現無量差別光明海色身、超諸世間一切香光明色身、現不可說日輪雲色身、現廣大月輪雲色身、放無量須彌山妙華雲色身、出種種鬘雲色身、現一切寶蓮華雲色身、興一切燒香雲遍法界色身、散一切末香藏雲色身、現一切如來大願身色身、現一切語言音聲演法海色身、現普賢菩薩像色身。",
        "translation": "所謂：種種色身、非一色身、無邊色身、清淨色身、一切莊嚴色身、普見色身、等一切眾生色身、普現一切眾生前色身、光明普照色身、見無厭足色身、相好清淨色身、離眾惡光明色身、示現大勇猛色身、甚難得色身、一切世間無能映蔽色身、一切世間共稱歎無盡色身、念念常觀察色身、示現種種雲色身、種種形顯色色身、現無量自在力色身、妙光明色身、一切淨妙莊嚴色身、隨順成熟一切眾生色身、隨其心樂現前調伏色身、無障礙普光明色身、清淨無濁穢色身、具足莊嚴不可壞色身、不思議法方便光明色身、無能映奪一切色身、無諸闇破一切闇色身、集一切白淨法色身、大勢力功德海色身、從過去恭敬因所生色身、如虛空清淨心所生色身、最勝廣大色身、無斷無盡色身、光明海色身、於一切世間無所依平等色身、遍十方無所礙色身、念念現種種色相海色身、增長一切眾生歡喜心色身、攝取一切眾生海色身、一一毛孔中說一切佛功德海色身、淨一切眾生欲解海色身、決了一切法義色身、無障礙普照耀色身、等虛空淨光明色身、放廣大淨光明色身、照現無垢法色身、無比色身、差別莊嚴色身、普照十方色身、隨時示現應眾生色身、寂靜色身、滅一切煩惱色身、一切眾生福田色身、一切眾生見不虛色身、大智慧勇猛力色身、無障礙普周遍色身、妙身雲普現世間皆蒙益色身、具足大慈海色身、大福德寶山王色身、放光明普照世間一切趣色身、大智慧清淨色身、生眾生正念心色身、一切寶光明色身、普光藏色身、現世間種種清淨相色身、求一切智處色身、現微笑令眾生生淨信色身、一切寶莊嚴光明色身、不取不捨一切眾生色身、無決定無究竟色身、現自在加持力色身、現一切神通變化色身、生如來家色身、遠離眾惡遍法界海色身、普現一切如來道場眾會色身、具種種眾色海色身、從善行所流色身、隨所應化示現色身、一切世間見無厭足色身、種種淨光明色身、現一切三世海色身、放一切光明海色身、現無量差別光明海色身、超諸世間一切香光明色身、現不可說日輪雲色身、現廣大月輪雲色身、放無量須彌山妙華雲色身、出種種鬘雲色身、現一切寶蓮華雲色身、興一切燒香雲遍法界色身、散一切末香藏雲色身、現一切如來大願身色身、現一切語言音聲演法海色身、現普賢菩薩像色身。",
        "source": "T10n0279_073:0397c22_7",
        "is_bad_quality": true
    },
    {
        "source_sentence": "「念念中，現如是等色相身充滿十方，令諸眾生或見、或念、或聞說法、或因親近、或得開悟、或見神通、或覩變化，悉隨心樂，應時調伏，捨不善業，住於善行。",
        "translation": "\"In each moment of recollection, the manifestation of these forms and bodies fills the ten directions, causing sentient beings to either see, remember, hear the teaching, become intimate with, attain enlightenment, see supernormal powers, or see transformations, all following their hearts' desires and being disciplined at the appropriate time, to abandon unskillful actions and abide in good behavior.",
        "source": "T10n0279_073:0398b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此由大願力故，一切智力故，菩薩解脫力故，大悲力故，大慈力故，作如是事。",
        "translation": "You should know that this is done because of the power of the great vow, the power of all intellectual abilities, the power of the bodhisattvas' liberation, the power of great compassion, and the power of great kindness.",
        "source": "T10n0279_073:0398b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0398b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我入此解脫，了知法性無有差別，而能示現無量色身，一一身現無量色相海，一一相放無量光明雲，一一光現無量佛國土，一一土現無量佛興世，一一佛現無量神通力，開發眾生宿世善根，未種者令種，已種者令增長，已增長者令成熟；念念中，令無量眾生，於阿耨多羅三藐三菩提得不退轉。",
        "translation": "Entering into this liberation, I've come to understand that there's no distinction in the nature of things, and I can reveal measureless bodies of form, measureless oceans of form in one body, measureless clouds of light from each form, measureless buddha lands in each light, measureless buddha-lands in each land, measureless buddhas in each world, measureless superknowledges in each buddha, develop sentient beings' long-ago good roots, cause those that have yet to be planted to plant, those that have already been planted to grow, and those that have already grown to mature; in each moment of recollection, I cause measureless sentient beings to attain irreversibility in the unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_073:0398b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0398b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所問：『從幾時來，發菩提心，修菩薩行？』",
        "translation": "As you asked, 'Since when do you arouse the aspiration for enlightenment and cultivate the bodhisattva practice?'",
        "source": "T10n0279_073:0398b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之義，承佛神力，當為汝說。",
        "translation": "Such is the meaning of this, which I will explain for you thanks to the Buddha's supernormal power.",
        "source": "T10n0279_073:0398b24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0398b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩智輪遠離一切分別境界，不可以生死中長短、染淨、廣狹、多少，如是諸劫分別顯示。",
        "translation": "The bodhisattva's wisdom wheel is free of all discriminated objects and can't discriminate between the length, defilement, purity, breadth, and number of birth-and-death eons like these.",
        "source": "T10n0279_073:0398b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T10n0279_073:0398b27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩智輪本性清淨，離一切分別網，超一切障礙山，隨所應化而普照故。",
        "translation": "The bodhisattva's wisdom wheel is inherently pure, free of all webs of discrimination, transcends all mountains of obstruction, and universally illuminates whatever it's teaching.",
        "source": "T10n0279_073:0398b27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0398b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日輪，無有晝夜；但出時名：晝，沒時名：夜。",
        "translation": "\"It's like the sun-wheel, which has no day or night but is called day when it emerges and night when it disappears.",
        "source": "T10n0279_073:0398b29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩智輪亦復如是，無有分別，亦無三世；但隨心現，教化眾生，言其止住前劫、後劫。",
        "translation": "So it is with the bodhisattva's wisdom wheel, which has no discrimination and no three periods but simply shows up according to one's mind and teaches sentient beings, saying that it stops short of the previous or subsequent eon.",
        "source": "T10n0279_073:0398c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0398c03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日輪，住閻浮空，其影悉現一切寶物及以河海諸淨水中，一切眾生莫不目見，而彼淨日不來至此。",
        "translation": "It's like the sun-wheel that stands in Jambudvīpa and whose shadow is fully visible in all precious things and in the pure water of rivers and seas, which no sentient being can see without seeing it, but that pure sun doesn't come to it.",
        "source": "T10n0279_073:0398c03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩智輪亦復如是，出諸有海，住佛實法，寂靜空中無有所依，為欲化度諸眾生故，而於諸趣隨類受生；實不生死，無所染著，無長短劫諸想分別。",
        "translation": "Similarly, the bodhisattva's wisdom wheel rises out of the ocean of existence, abides in the Buddha's true teaching, has no basis in tranquility and space, and takes on birth in various types of destinies for the purpose of liberating sentient beings; it's really not subject to birth-and-death, has no defiled attachments, and has no discrimination of conceptions of long or short eons.",
        "source": "T10n0279_073:0398c05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T10n0279_073:0398c09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩究竟離心想，見一切顛倒，得真實見，見法實性，知一切世間如夢、如幻；無有眾生，但以大悲大願力故，現眾生前教化調伏。",
        "translation": "The bodhisattva is completely free of mental images, sees all distortions, attains true views, sees the true nature of things, and knows that all the world is like a dream or an illusion; there are no sentient beings, but by virtue of great compassion and the power of his great vow, he teaches and tames sentient beings in his presence.",
        "source": "T10n0279_073:0398c09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0398c12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如船師，常以大船，於河流中不依此岸、不著彼岸、不住中流，而度眾生無有休息。",
        "translation": "\"It's like a shipmaster who always uses a large boat to cross a river without relying on this shore, without clinging to the other shore, and without stopping midstream, and yet he delivers sentient beings without rest.",
        "source": "T10n0279_073:0398c12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，以波羅蜜船，於生死流中不依此岸、不著彼岸、不住中流，而度眾生無有休息；雖無量劫修菩薩行，未曾分別劫數長短。",
        "translation": "In the same way, the bodhisattva Mahāsattva also uses a boat made of buttercups to go down the current of birth-and-death without relying on this shore, without clinging to the other shore, and without stopping midstream, and to deliver sentient beings without rest; although he cultivates the bodhisattva practice for measureless eons, he never discerns the length of an eon.",
        "source": "T10n0279_073:0398c14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0398c17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大虛空，一切世界於中成壞而無分別，本性清淨，無染無亂，無礙無厭，非長非短，盡未來劫持一切剎。",
        "translation": "Like the great space, all the worlds in it form and decay without discrimination, are inherently pure, undefiled and undisturbed, unobstructed and unwearying, neither long nor short, and endure throughout all future eons.",
        "source": "T10n0279_073:0398c17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，以等虛空界廣大深心，起大願風輪，攝諸眾生，令離惡道，生諸善趣，悉令安住一切智地，滅諸煩惱生死苦縛，而無憂喜、疲厭之心。",
        "translation": "In the same way, the bodhisattva Mahāsattva generates the wind-wheel of the great vow with a mind as vast and deep as the realm of space to gather sentient beings, cause them to leave bad destinies and be born in good destinies, always cause them to abide in the ground of omniscience, and cease the afflictive bonds of birth-and-death without sadness, joy, or weariness.",
        "source": "T10n0279_073:0398c20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0398c23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如幻化人，肢體雖具，而無入息及以出息、寒、熱、飢、渴、憂、喜、生、死十種之事。",
        "translation": "\"Suppose an illusory transformation of a person has limbs and a body, but there are no inhaling or exhaling breath, cold, heat, hunger, thirst, grief, joy, birth, or death, or any of the ten kinds of things that happen.",
        "source": "T10n0279_073:0398c24_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，以如幻智平等法身現眾色相，於諸有趣住無量劫教化眾生，於生死中一切境界，無欣無厭，無愛無恚，無苦無樂，無取無捨，無安無怖。",
        "translation": "In the same way, the bodhisattva Mahāsattva manifests the characteristics of many forms in an equal Dharma body based on illusory wisdom, teaches sentient beings in their interesting abodes for measureless eons, and in all realms of birth-and-death, he experiences neither pleasure nor disgust, neither love nor anger, neither pain nor pleasure, neither appropriation nor disagreement, and neither peace nor fear.",
        "source": "T10n0279_073:0398c25_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0398c29_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩智慧雖復如是甚深難測，我當承佛威神之力為汝解說，令未來世諸菩薩等滿足大願、成就諸力。",
        "translation": "Although bodhisattva's wisdom is still so profound and difficult to fathom, I will explain it for you based on the Buddha's authoritative power, so that bodhisattvas of future generations will fulfill their great vows and achieve their powers.",
        "source": "T10n0279_073:0398c29_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0399a02_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古世，過世界海微塵數劫，有劫名：善光，世界名：寶光。",
        "translation": "Once upon a time in an ancient world, there was an eon named Sunbeam and a world named Jewelbeam.",
        "source": "T10n0279_073:0399a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其劫中，有一萬佛出興于世。",
        "translation": "During that eon, 10,000 buddhas appeared in the world.",
        "source": "T10n0279_073:0399a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其最初佛，號：法輪音虛空燈王如來、應、正等覺，十號圓滿。",
        "translation": "The first of those buddhas was called the Dharma Wheel Sound Space Lamp King Tathāgata, Worthy, and Perfectly Enlightened, and his ten epithets were complete.",
        "source": "T10n0279_073:0399a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼閻浮提，有一王都，名：寶莊嚴；其東不遠，有一大林，名曰：妙光；中有道場，名為：寶華。",
        "translation": "In Jambudvīpa, there's a king's capital named Jeweled Adornment, and not far east of it there's a large forest named Marvelous Light, with a site of enlightenment called Jeweled Flower.",
        "source": "T10n0279_073:0399a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼道場中，有普光明摩尼蓮華藏師子之座。",
        "translation": "In that site of enlightenment there's a lion-seat of the lotus-store of the universal radiance.",
        "source": "T10n0279_073:0399a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼如來於此座上，成阿耨多羅三藐三菩提，滿一百年坐於道場，為諸菩薩、諸天、世人及閻浮提宿植善根已成熟者演說正法。",
        "translation": "From this seat, the Tathāgata attained unsurpassed, perfect enlightenment and sat in the site of enlightenment for a hundred years, expounding the right teaching to bodhisattvas, gods, humans, and those in Jambudvī who had matured their long-established good roots.",
        "source": "T10n0279_073:0399a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時，國王名曰：勝光。",
        "translation": "\"At the time, the king was called 'Vairocana.'",
        "source": "T10n0279_073:0399a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時世人民壽一萬歲，其中多有殺、盜、婬佚、妄語、綺語、兩舌、惡口、貪、瞋、邪見、不孝父母、不敬沙門婆羅門等。",
        "translation": "At the time, the people of the world were 10,000 years old, and many of them were killers, thieves, lustful, false speech, fancy speech, double talkers, bad breathers, greedy, angry, wrong viewers, unfilial parents, and ascetics and priests.",
        "source": "T10n0279_073:0399a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王為欲調伏彼故，造立囹圄，枷鎖禁閉，無量眾生於中受苦。",
        "translation": "For the sake of taming them, the king then creates a prison, chains, and confines them, and measureless sentient beings are subjected to their suffering.",
        "source": "T10n0279_073:0399a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王有太子，名為：善伏，端正殊特，人所喜見，具二十八大人之相。",
        "translation": "\"The king had a crown prince named Sunbeam, who was distinguished for his correctness, pleasing to people, and had the appearance of 28 great men.",
        "source": "T10n0279_073:0399a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在宮殿中，遙聞獄囚楚毒音聲，心懷傷愍。",
        "translation": "While in the palace, he distantly heard the harsh and poisonous sounds of the prisoners and felt compassion for them.",
        "source": "T10n0279_073:0399a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從宮殿出，入牢獄中，見諸罪人杻械、枷鎖遞相連繫，置幽闇處，或以火炙，或以煙熏，或被榜笞，或遭臏割，裸形亂髮，飢渴羸瘦，筋斷骨現，號叫苦劇。",
        "translation": "Emerging from the palace hall, he went into the prison and saw convicts handcuffed and chained together, placed in a dark place, sometimes burned by fire or smoked by smoke, flogged by pillory or cut by thorns, naked and hairless, hungry and thirsty, weak and thin, with their tendons cut and bones visible, screaming and shouting in agony.",
        "source": "T10n0279_073:0399a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子見已，心生悲愍，以無畏聲安慰之言：『汝莫憂惱！",
        "translation": "When the prince saw this, he felt compassion for them and reassured them with a fearless voice, saying, 'Don't be troubled!",
        "source": "T10n0279_073:0399a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝勿愁怖！",
        "translation": "Don't be afraid!",
        "source": "T10n0279_073:0399a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當令汝悉得解脫。』",
        "translation": "I will make sure you're all liberated.'",
        "source": "T10n0279_073:0399a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便詣王所而白王言：『獄中罪人苦毒難處，願垂寬宥，施以無畏。』",
        "translation": "He then went to the king and said, 'I hope you'll forgive the sinners in prison who are in pain and difficulty and show them fearlessness.'",
        "source": "T10n0279_073:0399a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，王即集五百大臣而問之言：『是事云何？』",
        "translation": "\"The king then gathered five hundred ministers and asked them, 'What's the matter?'",
        "source": "T10n0279_073:0399a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣答言：『彼罪人者，私竊官物，謀奪王位，盜入宮闈，罪應刑戮。",
        "translation": "The ministers replied, 'That offender stole an official's property, plotted to seize the king's position, and stole into the palace, and his crime deserves to be punished by death.",
        "source": "T10n0279_073:0399a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有哀救者，罪亦至死。』",
        "translation": "If someone is compassionate enough to save him, his crime will also reach death.'",
        "source": "T10n0279_073:0399a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，彼太子悲心轉切，語大臣言：『如汝所說，但放此人；隨其所應，可以治我。",
        "translation": "\"The prince then became deeply compassionate and said to the ministers, 'As you say, just let this person go; he can treat me as he sees fit.",
        "source": "T10n0279_073:0399a28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為彼故，一切苦事悉皆能受，粉身沒命，無所顧惜，要令罪人皆得免苦。",
        "translation": "For their sake, I'll be able to accept all kinds of suffering and take my life without concern, so that all sinners will be spared suffering.",
        "source": "T10n0279_073:0399b01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T10n0279_073:0399b02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若不救此眾生者，云何能救三界牢獄諸苦眾生？",
        "translation": "If I don't save this sentient being, how can I save the suffering sentient beings in the three realms and prison?",
        "source": "T10n0279_073:0399b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生在三界中，貪愛所縛，愚癡所蔽，貧無功德，墮諸惡趣，身形鄙陋，諸根放逸，其心迷惑，不求出道，失智慧光，樂著三有，斷諸福德，滅諸智慧，種種煩惱濁亂其心，住苦牢獄，入魔罥網，生老病死憂悲惱害，如是諸苦常所逼迫。",
        "translation": "All sentient beings in the three realms are bound by desire, hindered by ignorance, impoverished without merit, trapped in bad destinies, destitute in body, careless in their faculties, deluded in their minds, not seeking to escape the path, deprived of the light of wisdom, happily attached to the three existences, cutting off merit, extinguishing wisdom, and being turbidly afflicted by various kinds of afflictions, abiding in the prison of suffering, entering the web of Māra, and being saddened and distressed by birth, old age, illness, death, and other sufferings, which constantly constrain them.",
        "source": "T10n0279_073:0399b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當云何令彼解脫？",
        "translation": "How will I set them free?",
        "source": "T10n0279_073:0399b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應捨身命而拔濟之！』",
        "translation": "You should sacrifice your life to rescue it!'",
        "source": "T10n0279_073:0399b09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，諸大臣共詣王所，悉舉其手高聲唱言：『大王當知，如太子意，毀壞王法，禍及萬人。",
        "translation": "\"The ministers then all went to the king, raised their hands, and called out, 'You should know, Your Majesty, that just as the prince intended, disrupting the king's laws would bring misfortune to thousands of people.",
        "source": "T10n0279_073:0399b10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若王愛念不責治者，王之寶祚亦不久立。』",
        "translation": "If the king is mindful and doesn't rebuke him, the king's jeweled throne won't be established for a long time.'",
        "source": "T10n0279_073:0399b12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞此言，赫然大怒，令誅太子及諸罪人。",
        "translation": "Hearing these words, the king became furious and ordered the crown prince and his fellow offenders to be executed.",
        "source": "T10n0279_073:0399b13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王后聞之，愁憂號哭，毀形降服，與千采女馳詣王所，舉身投地頂禮王足，俱作是言：『唯願大王，赦太子命！』",
        "translation": "\"When the queen heard this, she was distressed and wept, disfigured and subdued, rushed to the king's office with a thousand women, threw themselves to the ground, bowed their heads at the king's feet, and said, 'Please, Your Majesty, spare the crown prince's life!'",
        "source": "T10n0279_073:0399b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即迴顧，語太子言：『莫救罪人；若救罪人，必當殺汝！』",
        "translation": "The king then looked back and said to the prince, 'Don't save a sinner; if you save a sinner, you will be killed!'",
        "source": "T10n0279_073:0399b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，太子為欲專求一切智故，為欲利益諸眾生故，為以大悲普救攝故，其心堅固無有退怯，復白王言：『願恕彼罪，身當受戮！』",
        "translation": "At the time, the prince, wanting to focus on the pursuit of omniscience, wanting to benefit sentient beings, and wanting to save them all with great compassion, was resolute in mind and undaunted, and he said to the king, 'May their crimes be forgiven, and I will be killed!'",
        "source": "T10n0279_073:0399b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『隨意！』",
        "translation": "The king said, 'As you wish!'",
        "source": "T10n0279_073:0399b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王后白言：『大王！",
        "translation": "It was then that the queen said, 'Great king!",
        "source": "T10n0279_073:0399b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願聽太子，半月行施，恣意修福，然後治罪。』",
        "translation": "May I ask the prince to give alms for half a month, cultivate virtue with abandon, and then punish him for his crimes.'",
        "source": "T10n0279_073:0399b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即聽許。",
        "translation": "The king then complied.",
        "source": "T10n0279_073:0399b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，都城北有一大園，名曰：日光，是昔施場。",
        "translation": "\"At the time, there was a large park to the north of the capital called Nikko, which had once been a site of almsgiving.",
        "source": "T10n0279_073:0399b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子往彼，設大施會；飲食、衣服、華鬘、瓔珞、塗香、末香、幢幡、寶蓋，諸莊嚴具，隨有所求，靡不周給。",
        "translation": "The prince went there and set up a great almsgiving with food, clothing, flowers, jewelry, smeared incense, powdered incense, banners, banners, jeweled shrouds, and other adornments, whatever he asked for.",
        "source": "T10n0279_073:0399b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經半月已，於最後日，國王、大臣、長者、居士、城邑人民及諸外道，悉來集會。",
        "translation": "After half a month had passed, on the last day the king, ministers, elders, householders, the people of the town, and non-Buddhists all came to the gathering.",
        "source": "T10n0279_073:0399b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，法輪音虛空燈王如來，知諸眾生調伏時至，與大眾俱，天王圍遶，龍王供養，夜叉王守護，乾闥婆王讚歎，阿脩羅王曲躬頂禮，迦樓羅王以清淨心散諸寶華，緊那羅王歡喜勸請，摩睺羅伽王一心瞻仰，來入彼會。",
        "translation": "\"Knowing that the time had come for the sentient beings to be brought under submission, the Dharma Wheel Sound of Space Lamp King Tathāgata accompanied the great crowd, was surrounded by the king of the gods, supported by the king of the dragons, guarded by the king of the yakṣas, praised by the king of the gandharvas, bowed in prostration by the king of the asuras, scattered jeweled flowers with a pure heart by the king of the garuḍas, was joyfully invited by the king of the kiṃnaras, and was wholeheartedly venerated by the king of the mahoragas as he entered the assembly.",
        "source": "T10n0279_073:0399b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，太子及諸大眾，遙見佛來，端嚴殊特，諸根寂定如調順象，心無垢濁如清淨池，現大神通，示大自在，顯大威德，種種相好莊嚴其身，放大光明普照世界，一切毛孔出香焰雲，震動十方無量佛剎，隨所至處普雨一切諸莊嚴具；以佛威儀，以佛功德，眾生見者，心淨歡喜，煩惱銷滅。",
        "translation": "\"At the time, the prince and the whole assembly saw the Buddha coming from a distance, resplendent in dignity, his faculties calm and collected like a well-adjusted elephant, his mind unsullied like a pure pond, displaying great supernormal powers, demonstrating great freedom, manifesting great authority, adorning his body with various features, radiating his light to illuminate the world, sending clouds of fragrant flame from every pore, shaking measureless buddha-halas in ten directions, and raining down all kinds of adornments wherever he went; with the Buddha's manner and merits, sentient beings' hearts were purified and rejoiced, and their afflictions vanished when they saw them.",
        "source": "T10n0279_073:0399c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，太子及諸大眾五體投地，頂禮其足，安施床座，合掌白言：『善來世尊！",
        "translation": "\"At that point, the prince and the crowd threw themselves to the ground, bowed their heads at their feet, placed their heads on seats, put their palms together, and said, 'Well done, Bhagavān!",
        "source": "T10n0279_073:0399c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來善逝！",
        "translation": "Well come, well gone!",
        "source": "T10n0279_073:0399c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願哀愍，攝受於我，處于此座！』",
        "translation": "Please have mercy on me and accept me in this seat!\"",
        "source": "T10n0279_073:0399c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以佛神力，淨居諸天即變此座為香摩尼蓮華之座。",
        "translation": "By the Buddha's miraculous power, the Pure Land gods transformed this throne into a lotus seat of fragrant maṇi.",
        "source": "T10n0279_073:0399c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛坐其上，諸菩薩眾亦皆就座周匝圍遶。",
        "translation": "As the Buddha sat on it, the bodhisattvas also took their seats and circled around it.",
        "source": "T10n0279_073:0399c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼會中一切眾生，因見如來，苦滅障除，堪受聖法。",
        "translation": "When they saw the Tathāgata, all the sentient beings in that assembly had their suffering and hindrances removed, and they were able to receive the noble teaching.",
        "source": "T10n0279_073:0399c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，如來知其可化，以圓滿音，說修多羅，名：普照因輪，令諸眾生隨類各解。",
        "translation": "\"Knowing they were teachable, the Tathāgata then spoke in a perfect voice, calling it the sūtra, which is called the wheel of universally illuminating causes, causing sentient beings to understand it individually according to their type.",
        "source": "T10n0279_073:0399c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼會中有八十那由他眾生，遠塵離垢，得法眼淨；無量那由他眾生，得無學地；十千眾生，住大乘道，入普賢行，成滿大願。",
        "translation": "At the time, there were 80 nayutas of sentient beings in that assembly who became dustless and spotless and attained purification of the Dharma eye, measureless nayutas of sentient beings who attained the stage of no more applied practice, and 10,000 sentient beings who abided on the great vehicle path, entered the practice of Samantabhadra, and fulfilled the great vow.",
        "source": "T10n0279_073:0399c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當爾之時，十方各百佛剎微塵數眾生，於大乘中，心得調伏；無量世界一切眾生，免離惡趣，生於天上。",
        "translation": "At that point, a hundred Buddha-temples in each of the ten directions and a tiny number of sentient beings attain control in the great vehicle, and all sentient beings in measureless worlds are freed from the bad destinies and are born up in the heavens.",
        "source": "T10n0279_073:0399c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善伏太子即於此時，得菩薩教化眾生令生善根解脫門。",
        "translation": "It was at this point that Prince Shanfu attained the gate of liberation of the good roots that the bodhisattvas teach and transform sentient beings to give rise to.",
        "source": "T10n0279_073:0399c22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0399c23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時太子豈異人乎？",
        "translation": "Was the prince then a different person?",
        "source": "T10n0279_073:0399c23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我身是也。",
        "translation": "\"This is me.",
        "source": "T10n0279_073:0399c24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我因往昔起大悲心，捨身命財救苦眾生，開門大施供養於佛，得此解脫。",
        "translation": "Because of the great compassion I had in the past, I sacrificed my body, life, and property to save suffering sentient beings, opened my door to make a great offering to the Buddha, and attained this liberation.",
        "source": "T10n0279_073:0399c24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子當知，我於爾時，但為利益一切眾生，不著三界，不求果報，不貪名稱，不欲自讚輕毀於他，於諸境界無所貪染、無所怖畏，但莊嚴大乘出要之道，常樂觀察一切智門，修行苦行，得此解脫。",
        "translation": "You should know, my son, that at the time, I only wanted to benefit all sentient beings, wasn't attached to the three realms, didn't seek rewards, didn't crave fame, didn't want to praise myself and disparage others, had no craving or fear in any objective realm, but simply adorned the great vehicle path of renunciation, always enjoyed observing all aspects of cognition, and cultivated ascetic practices to attain this liberation.",
        "source": "T10n0279_073:0399c26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0400a01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何，彼時五百大臣，欲害我者，豈異人乎？",
        "translation": "What do you think, were those 500 ministers different people who wanted to harm me?",
        "source": "T10n0279_073:0400a01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今提婆達多等五百徒黨是也。",
        "translation": "\"Now, this is Devadatta and 500 of his disciples.",
        "source": "T10n0279_073:0400a02_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸人等，蒙佛教化，皆當得阿耨多羅三藐三菩提，於未來世，過須彌山微塵數劫，爾時有劫，名：善光，世界名：寶光，於中成佛。",
        "translation": "These people, because of the transformation of the Buddha, will attain supreme, perfect enlightenment and pass through a dusty eon on Mount Sumeru in the future, when there will be an eon named Sunbeam and a world named Jewelbeam, in which they'll become buddhas.",
        "source": "T10n0279_073:0400a03_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其五百佛次第興世，最初如來，名曰：大悲；第二，名：饒益世間；第三，名：大悲師子；第四，名：救護眾生；乃至最後，名曰：醫王。",
        "translation": "Of those 500 buddhas that will arise in succession, the first is called the Tathāgata, the second is called the Benefactor of the World, the third is called the Teacher of Great Compassion, the fourth is called the Ambulance of Sentient Beings, and the last is called the King of Healers.",
        "source": "T10n0279_073:0400a06_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖彼諸佛大悲平等，然其國土、種族、父母、受生、誕生、出家、學道、往詣道場、轉正法輪、說修多羅、語言、音聲、光明、眾會、壽命、法住及其名號，各各差別。",
        "translation": "Although these buddhas are all greatly compassionate and equal, there are differences in their lands, races, parents, birth, birth, leaving home, training, going to the site of enlightenment, turning the right wheel of the Dharma, preaching sūtra, speech, sound, light, congregations, life spans, Dharma abodes, and their names.",
        "source": "T10n0279_073:0400a08_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0400a12_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸罪人，我所救者，即拘留孫等賢劫千佛，及百萬阿僧祇諸大菩薩——於無量精進力名稱功德慧如來所，發阿耨多羅三藐三菩提心，今於十方國土，行菩薩道，修習增長此菩提，教化眾生，令生善根解脫者是。",
        "translation": "\"Those sinners we've saved are the thousand buddhas of the auspicious eon like Kauśāmbī and the millions of incalculable great bodhisattvas who have arisen the mind of unsurpassed, corrected, and perfected bodhi in the Tathāgata of Immeasurable Power, Name, Merit, and Wisdom and are now practicing the bodhisattva path in the lands of the ten directions, cultivating and growing that bodhi, teaching sentient beings, and bringing about the liberation of good roots.",
        "source": "T10n0279_073:0400a12_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勝光王，今薩遮尼乾子大論師是。",
        "translation": "At the time, the king of Vairocana was the present-day great treatise master Sātsa-nirgrantha.",
        "source": "T10n0279_073:0400a17_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王宮人及諸眷屬，即彼尼乾六萬弟子——與師俱來，建大論幢，共佛論議，悉降伏之，授阿耨多羅三藐三菩提記者是。",
        "translation": "The king's palace and his retinue, which consisted of 60,000 disciples of Nirgrantha, came with the master, built a large banner of discussion, conferred with the Buddha, subdued them all, and granted him the unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_073:0400a17_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸人等，皆當作佛，國土莊嚴、劫數、名號，各各有異。",
        "translation": "Each of these people will be considered a Buddha, with their own land's adornment, number of eons, and name.",
        "source": "T10n0279_073:0400a20_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0400a21_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於爾時救罪人已，父母聽我捨離國土、妻子、財寶，於法輪音虛空燈王佛所出家學道。",
        "translation": "After I saved that sinner, my parents heard me renounce my land, wife, and possessions and leave home to train with the Ābhāsvara Dhāraṇī King Buddha.",
        "source": "T10n0279_073:0400a21_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百歲中，淨修梵行，即得成就百萬陀羅尼、百萬神通、百萬法藏、百萬求一切智勇猛精進，淨治百萬堪忍門，增長百萬思惟心，成就百萬菩薩力，入百萬菩薩智門，得百萬般若波羅蜜門，見十方百萬諸佛，生百萬菩薩大願；念念中，十方各照百萬佛剎；念念中，憶念十方世界前後際劫百萬諸佛；念念中，知十方世界百萬諸佛變化海；念念中，見十方百萬世界所有眾生種種諸趣，隨業所受生時、死時、善趣、惡趣、好色、惡色，其諸眾生種種心行、種種欲樂、種種根性、種種業習、種種成就，皆悉明了。",
        "translation": "五百歲中，淨修梵行，即得成就百萬陀羅尼、百萬神通、百萬法藏、百萬求一切智勇猛精進，淨治百萬堪忍門，增長百萬思惟心，成就百萬菩薩力，入百萬菩薩智門，得百萬般若波羅蜜門，見十方百萬諸佛，生百萬菩薩大願；念念中，十方各照百萬佛剎；念念中，憶念十方世界前後際劫百萬諸佛；念念中，知十方世界百萬諸佛變化海；念念中，見十方百萬世界所有眾生種種諸趣，隨業所受生時、死時、善趣、惡趣、好色、惡色，其諸眾生種種心行、種種欲樂、種種根性、種種業習、種種成就，皆悉明了。",
        "source": "T10n0279_073:0400a23_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0400b06_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於爾時命終之後，還復於彼王家受生，作轉輪王，彼法輪音虛空燈王如來滅後，次即於此值法空王如來，承事供養；次為帝釋，即此道場值天王藏如來，親近供養；次為夜摩天王，即於此世界值大地威力山如來，親近供養；次為兜率天王，即於此世界值法輪光音聲王如來，親近供養；次為化樂天王，即於此世界值虛空智王如來，親近供養；次為他化自在天王，即於此世界值無能壞幢如來，親近供養；次為阿脩羅王，即於此世界值一切法雷音王如來，親近供養；次為梵王，即於此世界值普現化演法音如來，親近供養。",
        "translation": "我於爾時命終之後，還復於彼王家受生，作轉輪王，彼法輪音虛空燈王如來滅後，次即於此值法空王如來，承事供養；次為帝釋，即此道場值天王藏如來，親近供養；次為夜摩天王，即於此世界值大地威力山如來，親近供養；次為兜率天王，即於此世界值法輪光音聲王如來，親近供養；次為化樂天王，即於此世界值虛空智王如來，親近供養；次為他化自在天王，即於此世界值無能壞幢如來，親近供養；次為阿脩羅王，即於此世界值一切法雷音王如來，親近供養；次為梵王，即於此世界值普現化演法音如來，親近供養。",
        "source": "T10n0279_073:0400b06_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_073:0400b18_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此寶光世界善光劫中，有一萬佛出興于世，我皆親近承事供養。",
        "translation": "In this eon of good radiance in the Baobab world, 10,000 buddhas arise in the world, and I become intimate with them and serve and make offerings to them.",
        "source": "T10n0279_073:0400b18_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次復有劫，名曰：日光，有六十億佛出興於世，最初如來，名：妙相山，我時為王，名曰：大慧，於彼佛所承事供養；次有佛出，名：圓滿肩，我為居士，親近供養；次有佛出，名：離垢童子，我為大臣，親近供養；次有佛出，名：勇猛持，我為阿脩羅王，親近供養；次有佛出，名：須彌相，我為樹神，親近供養；次有佛出，名：離垢臂，我為商主，親近供養；次有佛出，名：師子遊步，我為城神，親近供養；次有佛出，名為：寶髻，我為毘沙門天王，親近供養；次有佛出，名：最上法稱，我為乾闥婆王，親近供養；次有佛出，名：光明冠，我為鳩槃荼王，親近供養。",
        "translation": "次復有劫，名曰：日光，有六十億佛出興於世，最初如來，名：妙相山，我時為王，名曰：大慧，於彼佛所承事供養；次有佛出，名：圓滿肩，我為居士，親近供養；次有佛出，名：離垢童子，我為大臣，親近供養；次有佛出，名：勇猛持，我為阿脩羅王，親近供養；次有佛出，名：須彌相，我為樹神，親近供養；次有佛出，名：離垢臂，我為商主，親近供養；次有佛出，名：師子遊步，我為城神，親近供養；次有佛出，名為：寶髻，我為毘沙門天王，親近供養；次有佛出，名：最上法稱，我為乾闥婆王，親近供養；次有佛出，名：光明冠，我為鳩槃荼王，親近供養。",
        "source": "T10n0279_073:0400b20_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於彼劫中，如是次第有六十億如來出興於世。",
        "translation": "\"In that eon, six billion tathāgatas emerged from the world in this order.",
        "source": "T10n0279_073:0400c02_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常於此受種種身，一一佛所親近供養，教化成就無量眾生；於一一佛所，得種種三昧門、種種陀羅尼門、種種神通門、種種辯才門、種種一切智門、種種法明門、種種智慧門，照種種十方海，入種種佛剎海，見種種諸佛海，清淨成就，增長廣大。",
        "translation": "Here, I'm always accepting various kinds of bodies, making offerings close to each Buddha, teaching and accomplishing measureless sentient beings, attaining various samādhi gates, various dhāraṇī gates, various divine ability gates, various eloquence gates, various omniscience gates, various Dharma insight gates, various wisdom gates, illuminating various oceans of the ten directions, entering various oceans of Buddha bases, and seeing various oceans of Buddhas, which are purified and accomplished and which grow vastly.",
        "source": "T10n0279_073:0400c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如於此劫中親近供養爾所諸佛，於一切處、一切世界海微塵數劫，所有諸佛出興于世，親近供養，聽聞說法，信受護持，亦復如是。",
        "translation": "Just as he's been intimate with and supported all of these buddhas during this eon, so too have all the buddhas that have appeared in the world, in all places and in all worlds for a minute-million eons, been intimate with and supported, heard the teachings, and faithfully accepted and upheld them.",
        "source": "T10n0279_073:0400c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，一切諸如來所，皆悉修習此解脫門，復得無量解脫方便。」",
        "translation": "Thus, all the tathāgatas everywhere cultivate this gate of liberation and again attain measureless methods of liberation.\"",
        "source": "T10n0279_073:0400c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，救護一切眾生主夜神，欲重宣此解脫義，即為善財而說頌言：「汝以歡喜信樂心，　　問此難思解脫法；　我承如來護念力，　　為汝宣說應聽受。",
        "translation": "At the time, the night guardian deity who protects all sentient beings wanted to recapitulate the meaning of this liberation, so he spoke a verse for Shanzai, saying, \"With joy and faith, you asked about this difficult-to-conceive method of liberation; I acknowledge the Tathāgata's power to protect your mind and explain it for you, so listen and accept it.",
        "source": "T10n0279_073:0400c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去無邊廣大劫，　　過於剎海微塵數，　時有世界名寶光，　　其中有劫號善光。",
        "translation": "In a vast, limitless eon in the past, which passed through an ocean of bases and a trifle of dust, there was a world named Jewel Light, and there was an eon in it that was called Good Light.",
        "source": "T10n0279_073:0400c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於此善光大劫中，　　一萬如來出興世，　我皆親近而供養，　　從其修學此解脫。",
        "translation": "In this great eon of good radiance, 10,000 tathāgatas appeared in the world, and I all came close to them and made offerings to them as I cultivated their liberation.",
        "source": "T10n0279_073:0400c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時有王都名喜嚴，　　縱廣寬平極殊麗，　雜業眾生所居住，　　或心清淨或作惡。",
        "translation": "There was then a king whose capital was named Xiyan, which was vast and level and extremely beautiful, and inhabited by sentient beings with various activities, some of whom were pure in mind or did evil.",
        "source": "T10n0279_073:0400c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時有王名勝光，　　恒以正法御群生；　其王太子名善伏，　　形體端正備眾相。",
        "translation": "At the time, there was a king named Jōshō Kōkō, who constantly used the right teaching to subdue multitudes of sentient beings, and his crown prince was named Shōbō, whose body was perfectly proportioned with many features.",
        "source": "T10n0279_073:0400c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時有無量諸罪人，　　繫身牢獄當受戮；　太子見已生悲愍，　　上啟於王請寬宥。",
        "translation": "At the time, there were measureless criminals who were tied up in prison and would be killed. Seeing this, the crown prince felt compassion for them and asked the king to forgive him.",
        "source": "T10n0279_073:0400c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時諸臣共白王：　　『今此太子危王國，　如是罪人應受戮，　　如何悉救令除免？』",
        "translation": "The ministers then said to the king, 'Now, this prince's kingdom is in danger, and such sinners should be killed; how can they all be saved and freed?'",
        "source": "T10n0279_073:0400c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時勝光王語太子：　　『汝救彼罪自當受！』",
        "translation": "King Jōshō then said to the prince, 'You will accept the punishment for saving him!'",
        "source": "T10n0279_073:0401a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　太子哀念情轉深，　　誓救眾生無退怯。",
        "translation": "The prince's sympathetic thoughts became deeper, and he vowed to save sentient beings without flinching.",
        "source": "T10n0279_073:0401a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時王夫人采女等，　　俱來王所白王言：『願放太子半月中，　　布施眾生作功德。』",
        "translation": "The king's wife, a lady of the harvest, and others came to the king and said, 'May the crown prince be released for half a month to make a gift to sentient beings for their merit.'",
        "source": "T10n0279_073:0401a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時王聞已即聽許，　　設大施會濟貧乏，　一切眾生靡不臻，　　隨有所求咸給與。",
        "translation": "After hearing this, the king then agreed, setting up a great almsgiving to help the poor and needy, and all the sentient beings did not fail to receive it, so he gave it to them as they asked.",
        "source": "T10n0279_073:0401a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是半月日云滿，　　太子就戮時將至，　大眾百千萬億人，　　同時瞻仰俱號泣。",
        "translation": "Thus, when the clouds of the sun had filled for half a month and the time had come for the crown prince to be slain, a great multitude of hundreds of thousands of millions of people looked up at the same time, all wailing.",
        "source": "T10n0279_073:0401a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼佛知眾根將熟，　　而來此會化群生，　顯現神變大莊嚴，　　靡不親近而恭敬。",
        "translation": "Knowing that the faculties of sentient beings were about to ripen, that Buddha came to this meeting to convert a multitude of sentient beings, displaying a miraculous transformation and great adornment that made everyone approach and venerate him.",
        "source": "T10n0279_073:0401a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛以一音方便說，　　法燈普照修多羅，　無量眾生意柔軟，　　悉蒙與授菩提記。",
        "translation": "With a single voice, the Buddha spoke skillfully, shining the Dharma lamp universally on Cintāra, and measureless multitudes of people became flexible and were all given the mark of enlightenment.",
        "source": "T10n0279_073:0401a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善伏太子生歡喜，　　發興無上正覺心，　誓願承事於如來，　　普為眾生作依處。",
        "translation": "The well-versed prince became elated, aroused the mind of unsurpassed perfect enlightenment, vowed to serve the Tathāgata, and made himself a base for all sentient beings.",
        "source": "T10n0279_073:0401a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便即出家依佛住，　　修行一切種智道，　爾時便得此解脫，　　大悲廣濟諸群生。",
        "translation": "He then renounced his home and relied on the Buddha's abode, cultivating the path of omniscience, which then led to his liberation and great compassionate relief for all sentient beings.",
        "source": "T10n0279_073:0401a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於中止住經劫海，　　諦觀諸法真實性，　常於苦海救眾生，　　如是修習菩提道。",
        "translation": "He stops here, passes through an ocean of eons, observes the true nature of all things, always saves sentient beings in an ocean of suffering, and thus cultivates the path to enlightenment.",
        "source": "T10n0279_073:0401a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　劫中所有諸佛現，　　悉皆承事無有餘，　咸以清淨信解心，　　聽聞持護所說法。",
        "translation": "All the buddhas present in the eon are honored without remainder, and they all hear, uphold, and defend the teaching with pure faith and understanding.",
        "source": "T10n0279_073:0401a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　次於佛剎微塵數，　　無量無邊諸劫海，　所有諸佛現世間，　　一一供養皆如是。",
        "translation": "Next, there are countless, limitless eons of tiny dust buddha bases where all the buddhas appear in the world, and each one makes offerings like this.",
        "source": "T10n0279_073:0401a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我念往昔為太子，　　見諸眾生在牢獄，　誓願捨身而救護，　　因其證此解脫門。",
        "translation": "I remember when I was a prince and saw all the sentient beings in prison, and I vowed to sacrifice myself to rescue them because they realized the gate of liberation.",
        "source": "T10n0279_073:0401a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　經於佛剎微塵數，　　廣大劫海常修習，　念念令其得增長，　　復獲無邊巧方便。",
        "translation": "After passing through a dusty number of buddha bases and cultivating it over a vast ocean of eons, I would cause them to grow from moment to moment and obtain limitless skillful means.",
        "source": "T10n0279_073:0401a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼中所有諸如來，　　我悉得見蒙開悟，　令我增明此解脫，　　及以種種方便力。",
        "translation": "I've seen and been enlightened by all of those tathāgatas, which have given me a greater understanding of this liberation and various powers of skillful means.",
        "source": "T10n0279_073:0401a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於無量千億劫，　　學此難思解脫門；　諸佛法海無有邊，　　我悉一時能普飲。",
        "translation": "For measureless hundreds of millions of eons, I've studied this difficult-to-think gate of liberation, and the ocean of the buddhas' teachings knows no limit; I've been able to drink them all at once.",
        "source": "T10n0279_073:0401a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方所有一切剎，　　其身普入無所礙；　三世種種國土名，　　念念了知皆悉盡。",
        "translation": "All the buddhas in the ten directions are universally accessible to me, and there's no obstruction between them; the names of the various lands in the three worlds are all fully known in each moment.",
        "source": "T10n0279_073:0401b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世所有諸佛海，　　一一明見盡無餘；　亦能示現其身相，　　普詣於彼如來所。",
        "translation": "The ocean of buddhas in the three worlds is exhausted without remainder, and he can reveal his body's features and universally visit the Tathāgata's place.",
        "source": "T10n0279_073:0401b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又於十方一切剎，　　一切諸佛導師前，　普雨一切莊嚴雲，　　供養一切無上覺。",
        "translation": "In all the buddha-guides of all the buddhas in the ten directions, he rains down clouds of adornment to support all the unsurpassed enlightened ones.",
        "source": "T10n0279_073:0401b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又以無邊大問海，　　啟請一切諸世尊；　彼佛所雨妙法雲，　　皆悉受持無忘失。",
        "translation": "He also invites all the world-honored ones with a limitless ocean of great questions, and that Buddha rains down clouds of wondrous teachings that are all accepted and maintained without forgetting.",
        "source": "T10n0279_073:0401b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又於十方無量剎，　　一切如來眾會前，　坐於眾妙莊嚴座，　　示現種種神通力。",
        "translation": "At measureless buddhas in ten directions, he sits on a seat of marvelous adornment in front of a multitude of tathāgatas and demonstrates various supernormal powers.",
        "source": "T10n0279_073:0401b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又於十方無量剎，　　示現種種諸神變，　一身示現無量身，　　無量身中現一身。",
        "translation": "At measureless buddhas in ten directions, he also demonstrates various miraculous powers, demonstrating no limit to the number of ways a single body can appear, and appearing as a single body in the midst of nothing.",
        "source": "T10n0279_073:0401b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又於一一毛孔中，　　悉放無數大光明，　各以種種巧方便，　　除滅眾生煩惱火。",
        "translation": "In each pore, he radiates an infinite amount of great light, and with various skillful means, he removes the fires of affliction from sentient beings.",
        "source": "T10n0279_073:0401b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又於一一毛孔中，　　出現無量化身雲，　充滿十方諸世界，　　普雨法雨濟群品。",
        "translation": "In each pore, a cloud of measureless transformation bodies appears, filling the worlds of the ten directions and universally raining down the Dharma to help all sentient beings.",
        "source": "T10n0279_073:0401b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方一切諸佛子，　　入此難思解脫門，　悉盡未來無量劫，　　安住修行菩薩行。",
        "translation": "All the Buddha-children in the ten directions enter this gate of inconceivable liberation, and they all end up spending measureless eons in the future while stably cultivating the bodhisattva practice.",
        "source": "T10n0279_073:0401b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨其心樂為說法，　　令彼皆除邪見網，　示以天道及二乘，　　乃至如來一切智。",
        "translation": "They teach the Dharma according to their hearts' desire, causing them all to remove the web of wrong views and show them the way of gods and the two vehicles, up to the tathāgata's omniscience.",
        "source": "T10n0279_073:0401b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切眾生受生處，　　示現無邊種種身，　悉同其類現眾像，　　普應其心而說法。",
        "translation": "Where all sentient beings are born, he shows an infinite variety of bodies, manifests images of all sentient beings in the same category, and explains the Dharma according to their minds.",
        "source": "T10n0279_073:0401b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有得此解脫門，　　則住無邊功德海，　譬如剎海微塵數，　　不可思議無有量。",
        "translation": "If someone attains this gate of liberation, they'll abide in an ocean of limitless merit like a sea of blazing dust that's unfathomably numerous and incalculable.",
        "source": "T10n0279_073:0401b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0401b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此教化眾生令生善根解脫門。",
        "translation": "\"I only know this as the way to teach sentient beings and cause them to develop the liberation of good roots.",
        "source": "T10n0279_073:0401b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，超諸世間，現諸趣身，不住攀緣，無有障礙，了達一切諸法自性，善能觀察一切諸法，得無我智，證無我法，教化調伏一切眾生恒無休息，心常安住無二法門，普入一切諸言辭海；我今云何能知能說彼功德海、彼勇猛智、彼心行處、彼三昧境、彼解脫力？",
        "translation": "If bodhisattvas, mahāsattvas, transcend the world, manifest bodies of destinies, don't stop at perceptual objects, have no obstructions, comprehend the own-natures of all dharmas, are well able to observe all dharmas, attain the knowledge of selflessness, realize the dharma of selflessness, teach and tame all sentient beings without rest, always abide in the mind without a second dharma-gate, and universally enter the sea of all words, how can I now know and explain that ocean of merit, that courageous knowledge, that locus of mental functioning, that samādhi-realm, and that power of liberation?",
        "source": "T10n0279_073:0401b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_073:0401c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此閻浮提，有一園林，名：嵐毘尼；彼園有神，名：妙德圓滿。",
        "translation": "In this Jambudvīpa, there's a grove named Lumbinī, and there's a spirit in that grove named Maitreya, the Wonderful Perfection.",
        "source": "T10n0279_073:0401c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何修菩薩行、生如來家、為世光明，盡未來劫而無厭倦？」",
        "translation": "Do you go there and ask, \"How do bodhisattvas cultivate the bodhisattva practice, become born into the Tathāgata's household, and shine for the world for all future eons without tiring?\"",
        "source": "T10n0279_073:0401c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無量匝，合掌瞻仰，辭退而去。",
        "translation": "The boy of skillful livelihood then bowed his head at his feet, circled him measurelessly, folded his palms in respect, withdrew, and departed.",
        "source": "T10n0279_073:0401c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第七十三",
        "translation": "Dafangguang fo huayan jing roll 73",
        "source": "T10n0279_073:0401c09_0",
        "is_bad_quality": false
    }
]