[
    {
        "source_sentence": "大方廣佛華嚴經卷第十八",
        "translation": "Dafangguangfo huayan jing, vol. 18",
        "source": "T10n0279_018:0095a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "Translated by the Bhikṣuṇī of Khotan, the Tripiṭaka of Khotan",
        "source": "T10n0279_018:0095a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明法品第十八",
        "translation": "The Eighteenth Chapter of the Clarification of the Dharma",
        "source": "T10n0279_018:0095a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，精進慧菩薩白法慧菩薩言：「佛子！",
        "translation": "At that point, the Bodhisattva of Wisdom of Effort said to the Bodhisattva of Wisdom of the Dharma, \"Son of the Buddha!",
        "source": "T10n0279_018:0095a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩初發求一切智心，成就如是無量功德，具大莊嚴，昇一切智乘，入菩薩正位，捨諸世間法，得佛出世法，去、來、現在諸佛攝受，決定至於無上菩提究竟之處。",
        "translation": "After first arousing the intention to pursue omniscience, the bodhisattva achieves such measureless virtue and great adornment, ascends to the vehicle of omniscience, enters the bodhisattva's proper position, abandons worldly dharmas to attain the Buddha's supramundane dharma, is collected by the past, future, and present buddhas, and definitely reaches the final stage of unsurpassed enlightenment.",
        "source": "T10n0279_018:0095a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩於佛教中云何修習，令諸如來皆生歡喜，入諸菩薩所住之處，一切大行皆得清淨，所有大願悉使滿足，獲諸菩薩廣大之藏，隨所應化常為說法，而恒不捨波羅蜜行，所念眾生咸令得度，紹三寶種使不斷絕，善根方便皆悉不虛？",
        "translation": "How do those bodhisattvas cultivate Buddhism in a way that causes the tathāgatas to rejoice, enters the places where the bodhisattvas abide, purifies all their great practices, fulfills all their great vows, acquires the vast store of the bodhisattvas, always teaches as they are taught, never relinquishes the practice of the perfection of wisdom, makes all the sentient beings they think of possible, introduces the seeds of the Three Treasures so that they won't be cut off, and makes all their good roots and skills not in vain?",
        "source": "T10n0279_018:0095a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0095b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩以何方便，能令此法當得圓滿？",
        "translation": "What skillful means do those bodhisattvas use to cause this teaching to be completed in the future?",
        "source": "T10n0279_018:0095b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂哀愍，為我宣說；此諸大會，靡不樂聞！",
        "translation": "Please have mercy on me and explain this to me; these assemblies will not fail to delight in hearing it!",
        "source": "T10n0279_018:0095b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，如諸菩薩摩訶薩常勤修習，滅除一切無明黑暗，降伏魔怨，制諸外道，永滌一切煩惱心垢；悉能成就一切善根，永出一切惡趣諸難，淨治一切大智境界；成就一切菩薩諸地、諸波羅蜜、總持三昧、六通、三明、四無所畏清淨功德，莊嚴一切諸佛國土，及諸相好身、語、心行成就滿足，善知一切諸佛如來力、無所畏、不共佛法、一切智智所行境界；為欲成熟一切眾生，隨其心樂而取佛土，隨根、隨時如應說法；種種無量廣大佛事，及餘無量諸功德法、諸行、諸道及諸境界，皆悉圓滿，疾與如來功德平等；於諸如來、應、正等覺百千阿僧祇劫修菩薩行時所集法藏，悉能守護，開示演說，諸魔外道無能沮壞，攝持正法無有窮盡；於一切世界演說法時，天王、龍王、夜叉王、乾闥婆王、阿脩羅王、迦樓羅王、緊那羅王、摩睺羅伽王、人王、梵王、如來法王，皆悉守護；一切世間，恭敬供養，同灌其頂；常為諸佛之所護念，一切菩薩亦皆愛敬；得善根力，增長白法，開演如來甚深法藏，攝持正法以自莊嚴。",
        "translation": "「復次，如諸菩薩摩訶薩常勤修習，滅除一切無明黑暗，降伏魔怨，制諸外道，永滌一切煩惱心垢；悉能成就一切善根，永出一切惡趣諸難，淨治一切大智境界；成就一切菩薩諸地、諸波羅蜜、總持三昧、六通、三明、四無所畏清淨功德，莊嚴一切諸佛國土，及諸相好身、語、心行成就滿足，善知一切諸佛如來力、無所畏、不共佛法、一切智智所行境界；為欲成熟一切眾生，隨其心樂而取佛土，隨根、隨時如應說法；種種無量廣大佛事，及餘無量諸功德法、諸行、諸道及諸境界，皆悉圓滿，疾與如來功德平等；於諸如來、應、正等覺百千阿僧祇劫修菩薩行時所集法藏，悉能守護，開示演說，諸魔外道無能沮壞，攝持正法無有窮盡；於一切世界演說法時，天王、龍王、夜叉王、乾闥婆王、阿脩羅王、迦樓羅王、緊那羅王、摩睺羅伽王、人王、梵王、如來法王，皆悉守護；一切世間，恭敬供養，同灌其頂；常為諸佛之所護念，一切菩薩亦皆愛敬；得善根力，增長白法，開演如來甚深法藏，攝持正法以自莊嚴。",
        "source": "T10n0279_018:0095b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩所行次第，願皆演說！」",
        "translation": "May he explain the steps that all bodhisattvas take!\"",
        "source": "T10n0279_018:0095b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，精進慧菩薩欲重宣其義而說頌言：「大名稱者善能演，　　菩薩所成功德法，　深入無邊廣大行，　　具足清淨無師智。",
        "translation": "At that point, the bodhisattva Essence Wisdom wanted to reintroduce its meaning and spoke the verse, \"The great celebrity is well able to explain the qualities that bodhisattvas accomplish, profoundly penetrating limitless and vast practices, and fully possessing pure, untaught wisdom.",
        "source": "T10n0279_018:0095b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有菩薩初發心，　　成就福德智慧乘，　入離生位超世間，　　普獲正等菩提法。",
        "translation": "If there's a bodhisattva who first sets out to achieve the vehicle of merit and wisdom, enters a stage free of birth that transcends the world, and universally attains perfect enlightenment, then what is it in Buddhism that's resolute and resolute?",
        "source": "T10n0279_018:0095c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼復云何佛教中，　　堅固勤修轉增勝，　令諸如來悉歡喜，　　佛所住地速當入？",
        "translation": "What furthermore is it in Buddhism that is resolute, diligent, and increasingly superior, causing the tathāgatas to rejoice and quickly enter the Buddha's abode?",
        "source": "T10n0279_018:0095c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所行清淨願皆滿，　　及得廣大智慧藏，　常能說法度眾生，　　而心無依無所著。",
        "translation": "They fulfill all vows for the purification of their practices, attain a vast store of wisdom, and are always able to teach the Dharma and save sentient beings without relying on or attaching to anything in their minds.",
        "source": "T10n0279_018:0095c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩一切波羅蜜，　　悉善修行無缺減，　所念眾生咸救度，　　常持佛種使不絕。",
        "translation": "All the bodhisattvas' perfections are well cultivated without fail, and the sentient beings they're mindful of are all saved, always maintaining the Buddha's seed so that it never goes out.",
        "source": "T10n0279_018:0095c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所作堅固不唐捐，　　一切功成得出離，　如諸勝者所修行，　　彼清淨道願宣說！",
        "translation": "What they do is resolute and undaunted, and all their achievements are brought about by their release. Like those who practice well, they vow to proclaim the pure path!",
        "source": "T10n0279_018:0095c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　永破一切無明暗，　　降伏眾魔及外道，　所有垢穢悉滌除，　　得近如來大智慧。",
        "translation": "He permanently destroys all the darkness of ignorance, subdues Māra and non-Buddhists, cleans away all defilements, and attains nearness to the Tathāgata's great wisdom.",
        "source": "T10n0279_018:0095c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　永離惡趣諸險難，　　淨治大智殊勝境，　獲妙道力隣上尊，　　一切功德皆成就。",
        "translation": "He'll never escape the dangers of bad destinies, purify the superior state of great wisdom, attain the power of the wondrous path near the highest honored one, and achieve all merits.",
        "source": "T10n0279_018:0095c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　證得如來最勝智，　　住於無量諸國土，　隨眾生心而說法，　　及作廣大諸佛事。",
        "translation": "Realizing the Tathāgata's supreme wisdom, he lives in measureless lands, teaches Dharma according to the minds of sentient beings, and performs a vast array of Buddha-works.",
        "source": "T10n0279_018:0095c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何而得諸妙道，　　開演如來正法藏，　常能受持諸佛法，　　無能超勝無與等？",
        "translation": "How can he attain the wondrous path, uncover the Tathāgata's store of the true Dharma, and always uphold the Buddha's teachings, unsurpassing them and unequalled?",
        "source": "T10n0279_018:0095c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何無畏如師子，　　所行清淨如滿月？",
        "translation": "\"How is it that you are fearless like a lion, and what you do is pure like the full moon?",
        "source": "T10n0279_018:0095c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何修習佛功德，　　猶如蓮華不著水？」",
        "translation": "How is the cultivation of a buddha's virtue like a lotus flower that doesn't cling to water?\"",
        "source": "T10n0279_018:0095c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，法慧菩薩告精進慧菩薩言：「善哉！",
        "translation": "At that point, the Bodhisattva Dharma Wisdom addressed the Bodhisattva Essence Wisdom, saying, \"Good!",
        "source": "T10n0279_018:0095c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0095c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今為欲多所饒益、多所安樂、多所惠利，哀愍世間諸天及人，問於如是菩薩所修清淨之行。",
        "translation": "Now, in order to provide much benefit, much comfort, and much improvement, you'd like to pity the gods and humans of the world and ask about the pure conduct cultivated by such a bodhisattva.",
        "source": "T10n0279_018:0095c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0095c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝住實法，發大精進，增長不退，已得解脫；能作是問，同於如來。",
        "translation": "You abide in the true teaching, arouse great zeal, grow irreversible, and are liberated; to be able to ask this question is the same as the Tathāgata.",
        "source": "T10n0279_018:0095c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen closely!",
        "source": "T10n0279_018:0095c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen closely!",
        "source": "T10n0279_018:0095c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T10n0279_018:0095c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今承佛威神之力，為汝於中說其少分。",
        "translation": "Now, by the Buddha's authoritative power, I'll explain a small part of it for you here.",
        "source": "T10n0279_018:0095c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0095c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩已發一切智心，應離癡暗，精勤守護，無令放逸。",
        "translation": "Once they have aroused the mind of omniscience, the bodhisattvas and mahāsattvas should part with the darkness of delusion, diligently guard it, and not allow it to slip away.",
        "source": "T10n0279_018:0095c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0095c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩住十種法，名：不放逸。",
        "translation": "There are ten kinds of things that bodhisattvas and mahāsattvas abide in, which are called nonfrivolity.",
        "source": "T10n0279_018:0095c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0095c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，護持眾戒；二者，遠離愚癡，淨菩提心；三者，心樂質直，離諸諂誑；四者，勤修善根，無有退轉；五者，恒善思惟，自所發心；六者，不樂親近在家、出家一切凡夫；七者，修諸善業而不願求世間果報；八者，永離二乘，行菩薩道；九者，樂修眾善，令不斷絕；十者，恒善觀察自相續力。",
        "translation": "One, he guards the precepts; two, he parts with folly and purifies his mind for enlightenment; three, he is happy and straightforward in mind and parts with flattery; four, he diligently cultivates good roots without turning away; five, he always reflects well on what he has set out to do; six, he doesn't enjoy being close to all worldlings, whether lay or renunciant; seven, he cultivates good actions and doesn't wish to seek worldly rewards; eight, he permanently parts with the two vehicles and practices the bodhisattva path; nine, he enjoys cultivating many good qualities so that they aren't cut off; and ten, he always observes his own continuous power well.",
        "source": "T10n0279_018:0096a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩行此十法，是則名為住不放逸。",
        "translation": "If bodhisattvas practice these ten things, this is called abiding without laxity.",
        "source": "T10n0279_018:0096a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩住不放逸，得十種清淨。",
        "translation": "There are ten kinds of purity attained by a bodhisattva-mahāsattva who abides without dissipation.",
        "source": "T10n0279_018:0096a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，如說而行；二者，念智成就；三者，住於深定，不沈不舉；四者，樂求佛法，無有懈息；五者，隨所聞法，如理觀察，具足出生巧妙智慧；六者，入深禪定，得佛神通；七者，其心平等，無有高下；八者，於諸眾生上、中、下類，心無障礙，猶如大地等作利益；九者，若見眾生乃至一發菩提之心，尊重承事猶如和尚；十者，於授戒和尚及阿闍梨、一切菩薩、諸善知識、法師之所，常生尊重，承事供養。",
        "translation": "一者，如說而行；二者，念智成就；三者，住於深定，不沈不舉；四者，樂求佛法，無有懈息；五者，隨所聞法，如理觀察，具足出生巧妙智慧；六者，入深禪定，得佛神通；七者，其心平等，無有高下；八者，於諸眾生上、中、下類，心無障礙，猶如大地等作利益；九者，若見眾生乃至一發菩提之心，尊重承事猶如和尚；十者，於授戒和尚及阿闍梨、一切菩薩、諸善知識、法師之所，常生尊重，承事供養。",
        "source": "T10n0279_018:0096a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩住不放逸十種清淨。",
        "translation": "These are called the ten kinds of purity with which a bodhisattva abides without dissipation.",
        "source": "T10n0279_018:0096a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩住不放逸，發大精進；起於正念，生勝欲樂，所行不息；於一切法，心無依處；於甚深法，能勤修習；入無諍門，增廣大心；佛法無邊，能順了知，令諸如來皆悉歡喜。",
        "translation": "The bodhisattva Mahāsattva abides without laziness, generates great effort, arouses right mindfulness, gives rise to superior desires, and doesn't stop what he's doing; his mind has no basis in any dharma; he diligently cultivates the profound dharma; he enters the gate of no disputation, increasing his vast mind; he comprehends the limitlessness of the Buddha's teaching, making the tathāgatas all rejoice.",
        "source": "T10n0279_018:0096a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩復有十法，能令一切諸佛歡喜。",
        "translation": "\"There are ten more things that bodhisattvas, mahāsattvas, can do to make all the buddhas happy.",
        "source": "T10n0279_018:0096a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，精進不退；二者，不惜身命；三者，於諸利養無有希求；四者，知一切法皆如虛空；五者，善能觀察，普入法界；六者，知諸法印，心無倚著；七者，常發大願；八者，成就清淨忍智光明；九者，觀自善法，心無增減；十者，依無作門，修諸淨行。",
        "translation": "One, he makes effort and doesn't retreat; two, he doesn't spare his life; three, he has no desire for gain; four, he knows that all things are like space; five, he well observes and enters the Dharma realm universally; six, he knows the seals of the Dharma and has no attachment; seven, he always makes the great vow; eight, he achieves the light of pure tolerant wisdom; nine, he observes his own good qualities and has no increase or decrease in his mind; and ten, he cultivates pure practices based on the unconstructed approach.",
        "source": "T10n0279_018:0096a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩住十種法，能令一切如來歡喜。",
        "translation": "These are the ten ways in which a bodhisattva abides, which rejoice all tathāgatas.",
        "source": "T10n0279_018:0096a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十法，能令一切諸佛歡喜。",
        "translation": "\"There are another 10 things that cause all the buddhas to rejoice.",
        "source": "T10n0279_018:0096b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：安住不放逸；安住無生忍；安住大慈；安住大悲；安住滿足諸波羅蜜；安住諸行；安住大願；安住巧方便；安住勇猛力；安住智慧，觀一切法皆無所住，猶如虛空。",
        "translation": "They are: abiding in nonfrivolity; abiding in the acceptance of nonarising; abiding in great kindness; abiding in great compassion; abiding in the fulfillment of the perfections; abiding in practices; abiding in the great vow; abiding in skillful means; abiding in the power of courage; and abiding in wisdom, observing that all things lack a place to stand, just like space.",
        "source": "T10n0279_018:0096b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩住此十法，能令一切諸佛歡喜。",
        "translation": "If bodhisattvas abide in these ten things, they'll cause all the buddhas to rejoice.",
        "source": "T10n0279_018:0096b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十種法，令諸菩薩速入諸地。",
        "translation": "There are ten kinds of things that cause bodhisattvas to quickly enter the stages.",
        "source": "T10n0279_018:0096b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096b08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，善巧圓滿福、智二行；二者，能大莊嚴波羅蜜道；三者，智慧明達，不隨他語；四者，承事善友，恒不捨離；五者，常行精進，無有懈怠；六者，善能安住如來神力；七者，修諸善根，不生疲倦；八者，深心利智，以大乘法而自莊嚴；九者，於地地法門，心無所住；十者，與三世佛善根方便同一體性。",
        "translation": "One, he skillfully completes the two practices of merit and wisdom; two, he greatly adorns the path of the perfection of wisdom; three, he has insight and doesn't follow the words of others; four, he serves good friends and doesn't abandon them; five, he always conducts himself with energy and has no laziness; six, he's well able to abide in the Tathāgata's supernormal powers; seven, he cultivates good roots and doesn't grow weary; eight, he has a deep mind and sharp wisdom, adorning himself with the great vehicle teaching; nine, his mind has no place in the ground-level teaching; and ten, he has the same essence as the three buddhas in terms of their good roots and methods.",
        "source": "T10n0279_018:0096b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096b15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此十種法，令諸菩薩速入諸地。",
        "translation": "These ten kinds of teaching cause bodhisattvas to quickly enter the stages.",
        "source": "T10n0279_018:0096b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，佛子！",
        "translation": "\"Furthermore, Son of the Buddha!",
        "source": "T10n0279_018:0096b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩初住地時，應善觀察；隨其所有一切法門，隨其所有甚深智慧，隨所修因，隨所得果，隨其境界，隨其力用，隨其示現，隨其分別，隨其所得，悉善觀察。",
        "translation": "When they first abide in the ground, bodhisattvas should well observe all the teachings they have, all the profound wisdom they possess, the causes they cultivate, the results they attain, their objects, their powers, their manifestations, their discernments, and their attainments.",
        "source": "T10n0279_018:0096b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知一切法，皆是自心，而無所著；如是知已，入菩薩地，能善安住。",
        "translation": "They know that all dharmas are their own mind and have no attachment, and once they know this, they enter the bodhisattva stage and are able to abide well.",
        "source": "T10n0279_018:0096b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096b21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩作是思惟：『我等宜應速入諸地。",
        "translation": "Those bodhisattvas think, 'It's appropriate for us to quickly enter the stages.'",
        "source": "T10n0279_018:0096b21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T10n0279_018:0096b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等若於地地中住，成就如是廣大功德；具功德已，漸入佛地；住佛地已，能作無邊廣大佛事。",
        "translation": "'If we abide in the ground level and accomplish such vast merit, then we'll gradually enter the buddha stage after possessing that merit, and after abiding in the buddha stage, we'll be able to perform an infinite number of vast buddha-works.",
        "source": "T10n0279_018:0096b22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故宜應常勤修習，無有休息，無有疲厭，以大功德而自莊嚴入菩薩地。』",
        "translation": "Therefore, it's appropriate to always diligently cultivate without rest or tire, adorned with great merit, and enter the bodhisattva ground on your own.'",
        "source": "T10n0279_018:0096b24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096b26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十種法，令諸菩薩所行清淨。",
        "translation": "There are ten kinds of things that purify what bodhisattvas do.",
        "source": "T10n0279_018:0096b26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096b27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，悉捨資財，滿眾生意；二者，持戒清淨，無所毀犯；三者，柔和忍辱，無有窮盡；四者，勤修諸行，永不退轉；五者，以正念力，心無迷亂；六者，分別了知無量諸法；七者，修一切行而無所著；八者，其心不動，猶如山王；九者，廣度眾生，猶如橋梁；十者，知一切眾生與諸如來同一體性。",
        "translation": "One, he thoroughly discards his possessions to fulfill the business of many; two, he observes the precepts with purity and doesn't violate them; three, he's gentle and patient, with no limit; four, he diligently cultivates his practices and never backslides; five, with the power of right mindfulness, his mind isn't confused; six, he discerns and knows measureless dharmas; seven, he cultivates all practices without attachment; eight, his mind doesn't budge like a mountain king; nine, he widely liberates sentient beings like a bridge; and ten, he knows that all sentient beings and tathāgatas are of the same essence.",
        "source": "T10n0279_018:0096b27_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096c04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十法，令諸菩薩所行清淨。",
        "translation": "These are the ten things that purify what bodhisattvas do.",
        "source": "T10n0279_018:0096c05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩既得行清淨已，復獲十種增勝法。",
        "translation": "\"After a bodhisattva attains the purity of his practice, he also attains ten kinds of superior qualities.",
        "source": "T10n0279_018:0096c05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096c06_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，他方諸佛，皆悉護念；二者，善根增勝，超諸等列；三者，善能領受佛加持力；四者，常得善人，為所依怙；五者，安住精進，恒不放逸；六者，知一切法平等無異；七者，心恒安住無上大悲；八者，如實觀法，出生妙慧；九者，能善修行巧妙方便；十者，能知如來方便之力。",
        "translation": "One, they are all supported by the buddhas of other directions; two, their good roots are strengthened beyond all others; three, they are well able to receive the Buddha's empowering power; four, they always have a good person to rely on; five, they are stable and energetic and never lose heart; six, they know that all things are equal and not different; seven, their mind is constantly abiding in unsurpassed great compassion; eight, they accurately observe things and produce marvelous wisdom; nine, they are able to skillfully practice skillful means; and ten, they can know the power of the Tathāgata's skillful means.",
        "source": "T10n0279_018:0096c06_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096c13_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩十種增勝法。",
        "translation": "These are the ten ways in which a bodhisattva excels.",
        "source": "T10n0279_018:0096c13_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096c13_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩有十種清淨願。",
        "translation": "There are ten pure vows of a bodhisattva.",
        "source": "T10n0279_018:0096c13_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096c14_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一願，成熟眾生，無有疲倦；二願，具行眾善，淨諸世界；三願，承事如來，常生尊重；四願，護持正法，不惜軀命；五願，以智觀察，入諸佛土；六願，與諸菩薩同一體性；七願，入如來門，了一切法；八願，見者生信，無不獲益；九願，神力住世，盡未來劫；十願，具普賢行，淨治一切種智之門。",
        "translation": "1. vow, to ripen sentient beings without weariness; 2. vow, to practice numerous good qualities and purify the world; 3. vow, to serve the Tathāgata and always give rise to respect; 4. vow, to safeguard the true teaching without sparing body and life; 5. vow, to enter the buddha-lands by observing with wisdom; 6. vow, to be of the same essence as the bodhisattvas; 7. vow, to enter the Tathāgata's gate and understand all dharmas; 8. vow, to give rise to faith in those who see and obtain benefit from them; 9. vow, to abide in the world with supernormal powers for all future eons; and 10. vow, to practice with universal worthies and purify the gate of all kinds of cognition.",
        "source": "T10n0279_018:0096c14_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0096c20_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩十種清淨願。",
        "translation": "These are the bodhisattvas' ten pure vows.",
        "source": "T10n0279_018:0096c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住十種法，令諸大願皆得圓滿。",
        "translation": "There are ten kinds of things that bodhisattvas abide in that cause the great vows to be fulfilled.",
        "source": "T10n0279_018:0096c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，心無疲厭；二者，具大莊嚴；三者，念諸菩薩殊勝願力；四者，聞諸佛土，悉願往生；五者，深心長久，盡未來劫；六者，願悉成就一切眾生；七者，住一切劫，不以為勞；八者，受一切苦，不生厭離；九者，於一切樂，心無貪著；十者，常勤守護無上法門。",
        "translation": "One, his mind is not weary; two, he possesses great adornment; three, he's mindful of the extraordinary vows of the bodhisattvas; four, he hears of the buddha lands and vows to be reborn there; five, he has a deep and long-lasting intention to end future eons; six, he wishes to fully achieve all sentient beings; seven, he remains for all eons without making it a chore; eight, he experiences all suffering without becoming disillusioned; nine, his mind is not attached to all pleasures; and ten, he always diligently guards the unsurpassed Dharma teaching.",
        "source": "T10n0279_018:0096c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0096c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩滿足如是願時，即得十種無盡藏。",
        "translation": "When a bodhisattva fulfills such a vow, he attains ten kinds of inexhaustible stores.",
        "source": "T10n0279_018:0096c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0096c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：普見諸佛無盡藏、總持不忘無盡藏、決了諸法無盡藏、大悲救護無盡藏、種種三昧無盡藏、滿眾生心廣大福德無盡藏、演一切法甚深智慧無盡藏、報得神通無盡藏、住無量劫無盡藏、入無邊世界無盡藏。",
        "translation": "They are: the inexhaustible store of seeing all the buddhas, the inexhaustible store of maintaining and not forgetting, the inexhaustible store of decisive comprehension of all dharmas, the inexhaustible store of great compassion and aid, the inexhaustible store of various samādhis, the inexhaustible store of filling the minds of sentient beings with vast and great merit, the inexhaustible store of profound wisdom in expounding all dharmas, the inexhaustible store of attaining supernormal powers, the inexhaustible store of abiding in an endless eon, and the inexhaustible store of entering an infinite world.",
        "source": "T10n0279_018:0096c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0097a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩十無盡藏。",
        "translation": "\"These are the bodhisattva's ten inexhaustible stores.",
        "source": "T10n0279_018:0097a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩得是十種藏已，福德具足，智慧清淨；於諸眾生，隨其所應而為說法。",
        "translation": "\"After attaining these ten kinds of stores, the bodhisattva has perfected virtue and purified wisdom, and he teaches sentient beings as they are suited.",
        "source": "T10n0279_018:0097a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0097a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩云何於諸眾生，隨其所應而為說法？",
        "translation": "How do bodhisattvas teach sentient beings as they should be taught?",
        "source": "T10n0279_018:0097a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：知其所作，知其因緣，知其心行，知其欲樂。",
        "translation": "They say, \"Know what they do, know their causes and conditions, know their mental functions, and know their desires and pleasures.",
        "source": "T10n0279_018:0097a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪欲多者，為說不淨；瞋恚多者，為說大慈；愚癡多者，教勤觀察；三毒等者，為說成就勝智法門；樂生死者，為說三苦；若著處所，說處空寂；心懈怠者，說大精進；懷我慢者，說法平等；多諂誑者，為說菩薩；其心質直、樂寂靜者，廣為說法，令其成就。",
        "translation": "Those with many desires are taught impurity; those with many angers are taught great kindness; those with many foolishness are taught diligent observation; those with the three poisons and so forth are taught the accomplishment of the method of superior knowledge; those who delight in birth and death are taught the three sufferings; those who are attached to places are taught the place of emptiness; those who are lazy in mind are taught great effort; those who harbor self-conceit are taught equality; those who are flattering are taught bodhisattvahood; and those whose minds are straightforward and who enjoy tranquility are taught extensively and made to achieve it.",
        "source": "T10n0279_018:0097a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是隨其所應而為說法。",
        "translation": "The bodhisattva thus explains the teaching as it accords with him.",
        "source": "T10n0279_018:0097a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為說法時，文相連屬，義無舛謬；觀法先後，以智分別；是非審定，不違法印；次第建立無邊行門，令諸眾生斷一切疑；善知諸根，入如來教；證真實際，知法平等；斷諸法愛，除一切執；常念諸佛，心無暫捨；了知音聲，體性平等；於諸言說，心無所著；巧說譬諭，無相違反，悉令得悟一切諸佛隨應普現平等智身。",
        "translation": "When expounding the Dharma, he connects the text with each other, making no distortion in meaning; he observes the precedence of dharmas and discerns their sequences with wisdom; he determines right from wrong and doesn't contradict the seal of the Dharma; he establishes an infinite number of practices in sequence, causing sentient beings to end all doubt; he well knows the faculties and enters the Tathāgata's teaching; he realizes the reality and knows the equality of dharmas; he stops craving for dharmas and removes all attachments; he's always mindful of the buddhas and doesn't let go of them for a moment; he understands the sounds and sounds and their equality in essence; he's unattached in his mind when he speaks; he skillfully explains parables without contradicting each other, and he fully brings about the realization that all buddhas universally manifest the body of equal wisdom according to their responses.",
        "source": "T10n0279_018:0097a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩如是為諸眾生而演說法，則自修習，增長義利，不捨諸度，具足莊嚴波羅蜜道。",
        "translation": "\"When a bodhisattva thus expounds the Dharma for sentient beings, he cultivates it himself, increases its benefits, doesn't abandon the perfections, and completes the adorned perfection of the path.",
        "source": "T10n0279_018:0097a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，菩薩為令眾生心滿足故，內外悉捨而無所著，是則能淨檀波羅蜜。",
        "translation": "When a bodhisattva fully abandons both internal and external [afflictions] for the purpose of satisfying the minds of sentient beings, this is the perfection of purifying the perfection of giving.",
        "source": "T10n0279_018:0097a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具持眾戒而無所著，永離我慢，是則能淨尸波羅蜜。",
        "translation": "By upholding the many precepts without any attachment and forever parting with self-conceit, he is able to purify the perfection of morality.",
        "source": "T10n0279_018:0097a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉能忍受一切諸惡，於諸眾生，其心平等，無有動搖，譬如大地能持一切，是則能淨忍波羅蜜。",
        "translation": "Fully enduring all evil, his mind is equal among sentient beings and unshaken, like the earth that can support them all, and this purifies the perfection of patience.",
        "source": "T10n0279_018:0097a28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普發眾業，常修靡懈，諸有所作恒不退轉，勇猛勢力無能制伏，於諸功德不取不捨，而能滿足一切智門，是則能淨精進波羅蜜。",
        "translation": "He generates all kinds of activity, cultivates constant relentlessness, never backsliding from what he does, has boldness and strength that can't be subdued, doesn't grasp or relinquish merit, and fulfills all approaches to cognition, which is the perfection of pure effort.",
        "source": "T10n0279_018:0097b01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於五欲境無所貪著，諸次第定悉能成就，常正思惟，不住不出，而能銷滅一切煩惱，出生無量諸三昧門，成就無邊大神通力；逆順次第，入諸三昧，於一三昧門入無邊三昧門，悉知一切三昧境界，與一切三昧三摩鉢底智印不相違背，能速入於一切智地，是則能淨禪波羅蜜。",
        "translation": "He has no craving for the five objects of desire, fully achieves the secondary concentrations, always correctly contemplates them, doesn't stop or exit, but is able to cease all afflictions, produce measureless samādhis, and accomplish limitless great supernormal powers; enters the samādhis in reverse order, enters the limitless samādhis at the gate of one samādhi, fully knows all the realms of samādhi, doesn't contradict the seal of the wisdom of the samādhis, and can quickly enter the ground of omniscience, which is the perfection of pure meditation.",
        "source": "T10n0279_018:0097b04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸佛所聞法受持，近善知識承事不倦；常樂聞法，心無厭足；隨所聽受，如理思惟；入真三昧，離諸僻見；善觀諸法，得實相印，了知如來無功用道；乘普門慧，入於一切智智之門，永得休息，是則能淨般若波羅蜜。",
        "translation": "He retains the teachings he hears from the buddhas, approaches good teachers, serves them without tire, always enjoys hearing the teachings without tire, reflects on them as they are heard and accepted, enters true concentration, parts with remote views, observes the teachings well, attains the seal of true characteristics, comprehends the Tathāgata's effortless path, rides the universal wisdom, enters the gate of the knowledge of all things, and attains permanent rest, and then he's able to purify the perfection of prajñā.",
        "source": "T10n0279_018:0097b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現一切世間作業，教化眾生而不厭倦，隨其心樂而為現身；一切所行皆無染著，或現凡夫、或現聖人所行之行，或現生死，或現涅槃；善能觀察一切所作，示現一切諸莊嚴事而不貪著，遍入諸趣度脫眾生，是則能淨方便波羅蜜。",
        "translation": "He shows all worldly activities, teaches sentient beings without wearying, and gives form to them according to their hearts' desire; he shows everything that he does without defiled attachment, whether it's the actions of mortals or sages, birth-and-death or nirvāṇa; he well observes all that he does, shows all the adornments without clinging to them, and enters all destinies to liberate sentient beings, which is the perfection of purifying skillful means.",
        "source": "T10n0279_018:0097b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盡成就一切眾生，盡莊嚴一切世界，盡供養一切諸佛，盡通達無障礙法，盡修行遍法界行，身恒住盡未來劫智，盡知一切心念，盡覺悟流轉還滅，盡示現一切國土，盡證得如來智慧，是則能淨願波羅蜜。",
        "translation": "To fully accomplish all sentient beings, fully adorn all worlds, fully make offerings to all buddhas, fully penetrate unobstructed dharmas, fully cultivate practices that pervade the Dharma realm, continuously abide in the body with knowledge of all future eons, fully know all mental states, fully awaken to the flow of transmigration and its cessation, fully manifest all lands, and fully realize the Tathāgata's wisdom, is the perfection of purifying vows.",
        "source": "T10n0279_018:0097b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具深心力，無有雜染故；具深信力，無能摧伏故；具大悲力，不生疲厭故；具大慈力，所行平等故；具總持力，能以方便持一切義故；具辯才力，令一切眾生歡喜滿足故；具波羅蜜力，莊嚴大乘故；具大願力，永不斷絕故；具神通力，出生無量故；具加持力，令信解領受故，是則能淨力波羅蜜。",
        "translation": "With the power of profound mind, which is unsullied, the power of deep faith, which is invincible, the power of great compassion, which doesn't cause weariness, the power of great kindness, which is equal in what it does, the power of a magical formula that can skillfully hold all meanings, the power of eloquence that makes all sentient beings rejoice and be satisfied, the power of the perfection of wisdom that adorns the great vehicle, the power of the great vow that never ends, the power of supernormal abilities that produce measurelessness, and the power of empowerment that causes faith and understanding to be received, this is the perfection of the power of purification.",
        "source": "T10n0279_018:0097b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知貪欲行者，知瞋恚行者，知愚癡行者，知等分行者，知修學地行者，一念中知無邊眾生行，知無邊眾生心，知一切法真實，知一切如來力，普覺悟法界門，是則能淨智波羅蜜。",
        "translation": "To know the formative forces of desire, the formative forces of anger, the formative forces of folly, the formative forces of equipoise, and the formative forces of the stage of cultivation, to know in a single moment the formative forces of limitless sentient beings, to know the minds of limitless sentient beings, to know the reality of all dharmas, to know the power of all tathāgatas, and to universally awaken to the gate of the Dharma realm is the perfection of purifying knowledge.",
        "source": "T10n0279_018:0097c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0097c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是清淨諸波羅蜜時、圓滿諸波羅蜜時、不捨諸波羅蜜時，住大莊嚴菩薩乘中。",
        "translation": "When bodhisattvas thus purify the perfections, when they perfect the perfections, and when they don't abandon the perfections, they abide in the great adorned bodhisattva vehicle.",
        "source": "T10n0279_018:0097c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所念，一切眾生皆為說法，令增淨業而得度脫。",
        "translation": "According to his thoughts, he teaches all sentient beings, increasing their pure activities and enabling them to be liberated.",
        "source": "T10n0279_018:0097c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "墮惡道者，教使發心；在難中者，令勤精進；多貪眾生，示無貪法；多瞋眾生，令行平等；著見眾生，為說緣起；欲界眾生，教離欲恚惡不善法；色界眾生，為其宣說毘鉢舍那；無色界眾生，為其宣說微妙智慧；二乘之人，教寂靜行；樂大乘者，為說十力廣大莊嚴。",
        "translation": "He teaches those who have fallen into bad destinies to arouse their minds, those who are in difficulty to make them work hard, those who are greedy to show them the way to no greed, those who are angry to practice equality, those who are attached to views to teach them about dependent arising, those in the desire realm to teach them to part with bad and unskillful things, those in the form realm to teach them about vipaśyanā, those in the formless realm to teach them about subtle wisdom, those in the second vehicle to teach them the practice of tranquility, and those who are delighted with the great vehicle to teach them the vast adornment of the ten powers.",
        "source": "T10n0279_018:0097c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其往昔初發心時，見無量眾生墮諸惡道，大師子吼作如是言：『我當以種種法門，隨其所應而度脫之！』",
        "translation": "As he had first set out in the past, when he saw measureless sentient beings fall into bad destinies, the great teacher Roar said, 'I will use various teachings to liberate them as they arise!'",
        "source": "T10n0279_018:0097c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩具足如是智慧，廣能度脫一切眾生。",
        "translation": "Equipped with such wisdom, a bodhisattva is able to broadly liberate all sentient beings.",
        "source": "T10n0279_018:0097c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0097c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩具足如是智慧，令三寶種永不斷絕。",
        "translation": "Bodhisattvas possess such wisdom that the seeds of the Three Treasures are never cut off.",
        "source": "T10n0279_018:0097c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0279_018:0097c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩教諸眾生發菩提心，是故能令佛種不斷；常為眾生開闡法藏，是故能令法種不斷；善持教法，無所乖違，是故能令僧種不斷。",
        "translation": "The bodhisattva Mahāsattva teaches sentient beings to give rise to the mind of enlightenment, which enables the Buddha seed to be sustained; he always expounds the dharma-store for sentient beings, which enables the Dharma seed to be sustained; and he well maintains the teaching without deviating from it, which enables the Saṃgha seed to be sustained.",
        "source": "T10n0279_018:0097c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，悉能稱讚一切大願，是故能令佛種不斷；分別演說因緣之門，是故能令法種不斷；常勤修習六和敬法，是故能令僧種不斷。",
        "translation": "Furthermore, he fully praises all the great vows, which keeps the Buddha seed going; he discerns and explains the gate of causes and conditions, which keeps the Dharma seed going; and he always diligently cultivates the six ways of paying homage, which keeps the Saṃgha seed going.",
        "source": "T10n0279_018:0097c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，於眾生田中下佛種子，是故能令佛種不斷；護持正法，不惜身命，是故能令法種不斷；統理大眾，無有疲倦，是故能令僧種不斷。",
        "translation": "Furthermore, by planting the buddha seed in the field of sentient beings, it's possible to keep the buddha seed going; by safeguarding the right teaching and not shying away from his own life, it's possible to keep the Dharma seed going; and by tending to the masses without tire, it's possible to keep the saṃgha seed going.",
        "source": "T10n0279_018:0097c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，於去、來、今佛，所說之法、所制之戒，皆悉奉持，心不捨離，是故能令佛、法、僧種永不斷絕。",
        "translation": "Furthermore, by fully upholding the teachings and precepts established by the buddhas of the past, future, and present and not abandoning them at heart, the seeds of buddha, dharma, and saṃgha can be made to never cease.",
        "source": "T10n0279_018:0098a01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是紹隆三寶，一切所行無有過失，隨有所作，皆以迴向一切智門，是故三業皆無瑕玷。",
        "translation": "When bodhisattvas thus promote the Three Treasures, everything they do is without error, and whatever they do is directed back to the approach of omniscience; therefore, the three activities are without blemish.",
        "source": "T10n0279_018:0098a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無瑕玷故，所作眾善，所行諸行，教化眾生，隨應說法，乃至一念，無有錯謬，皆與方便智慧相應，悉以向於一切智智，無空過者。",
        "translation": "Because they are unsullied, the good deeds they do, the practices they perform, the sentient beings they teach, and the recitations they give as appropriate are without error, and they are all in accord with the wisdom of skillful means and are all directed toward the knowledge of all things, with no fault of emptiness.",
        "source": "T10n0279_018:0098a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩如是修習善法，念念具足十種莊嚴。",
        "translation": "\"When bodhisattvas thus cultivate good qualities, each moment is replete with ten kinds of adornment.",
        "source": "T10n0279_018:0098a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are the ten?",
        "source": "T10n0279_018:0098a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：身莊嚴，隨諸眾生所應調伏而為示現故；語莊嚴，斷一切疑，皆令歡喜故；心莊嚴，於一念中入諸三昧故；佛剎莊嚴，一切清淨，離諸煩惱故；光明莊嚴，放無邊光普照眾生故；眾會莊嚴，普攝眾會，皆令歡喜故；神通莊嚴，隨眾生心，自在示現故；正教莊嚴，能攝一切聰慧人故；涅槃地莊嚴，於一處成道，周遍十方悉無餘故；巧說莊嚴，隨處、隨時、隨其根器為說法故。",
        "translation": "They are: bodily adornment, which shows sentient beings as they should be disciplined; verbal adornment, which cuts off all doubt and makes everyone rejoice; mental adornment, which enters into samādhi in a single thought; buddha-body adornment, which purifies everything and frees them from affliction; brilliance adornment, which radiates limitless light and universally illuminates sentient beings; congregational adornment, which universally includes all congregations and makes everyone rejoice; supernormal adornment, which freely shows sentient beings according to their minds; right teaching adornment, which can bring in all wise people; nirvāṇa ground adornment, which accomplishes the path in one place and travels around to all the ten directions without remainder; and skillful explanation adornment, which teaches the Dharma wherever, whenever, and according to their faculties and abilities.",
        "source": "T10n0279_018:0098a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就如是莊嚴，於念念中，身、語、意業皆無空過，悉以迴向一切智門。",
        "translation": "When a bodhisattva accomplishes such adornment, his physical, verbal, and mental actions are all without error in each moment of recollection, and they all lead back to the approach of omniscience.",
        "source": "T10n0279_018:0098a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生見此菩薩，當知亦復無空過者，以必當成阿耨多羅三藐三菩提故。",
        "translation": "If there are sentient beings who see this bodhisattva, they should know that he also has no faults of emptiness because he will surely achieve unsurpassed, correct enlightenment.",
        "source": "T10n0279_018:0098a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞名，若供養，若同住，若憶念，若隨出家，若聞說法，若隨喜善根，若遙生欽敬，乃至稱揚、讚歎名字，皆當得阿耨多羅三藐三菩提。",
        "translation": "If they hear their name, make offerings, live with them, remember them, follow them out of the house, hear them preach, rejoice in their good roots, become respectful from afar, and even praise and glorify their name, they'll surely attain supreme perfect enlightenment.",
        "source": "T10n0279_018:0098a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0098a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有藥，名為：善見，眾生見者，眾毒悉除；菩薩如是成就此法，眾生若見，諸煩惱毒皆得除滅，善法增長。",
        "translation": "It's like a medicine called \"good vision,\" which removes all the poisons when sentient beings see it; if a bodhisattva thus accomplishes this teaching, the poisons of affliction will all be removed when sentient beings see it, and the good qualities will grow.",
        "source": "T10n0279_018:0098a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0098a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩住此法中，勤加修習，以智慧明，滅諸癡闇；以慈悲力，摧伏魔軍；以大智慧及福德力，制諸外道；以金剛定，滅除一切心垢煩惱；以精進力，集諸善根；以淨佛土諸善根力，遠離一切惡道諸難；以無所著力，淨智境界；以方便智慧力，出生一切菩薩諸地、諸波羅蜜，及諸三昧、六通、三明、四無所畏，悉令清淨；以一切善法力，成滿一切諸佛淨土，無邊相好身、語及心具足莊嚴；以智自在觀察力，知一切如來力、無所畏、不共佛法，悉皆平等；以廣大智慧力，了知一切智智境界；以往昔誓願力，隨所應化，現佛國土，轉大法輪，度脫無量無邊眾生。",
        "translation": "菩薩摩訶薩住此法中，勤加修習，以智慧明，滅諸癡闇；以慈悲力，摧伏魔軍；以大智慧及福德力，制諸外道；以金剛定，滅除一切心垢煩惱；以精進力，集諸善根；以淨佛土諸善根力，遠離一切惡道諸難；以無所著力，淨智境界；以方便智慧力，出生一切菩薩諸地、諸波羅蜜，及諸三昧、六通、三明、四無所畏，悉令清淨；以一切善法力，成滿一切諸佛淨土，無邊相好身、語及心具足莊嚴；以智自在觀察力，知一切如來力、無所畏、不共佛法，悉皆平等；以廣大智慧力，了知一切智智境界；以往昔誓願力，隨所應化，現佛國土，轉大法輪，度脫無量無邊眾生。",
        "source": "T10n0279_018:0098a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0098b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩勤修此法，次第成就諸菩薩行，乃至得與諸佛平等，於無邊世界中為大法師，護持正法；一切諸佛之所護念，守護受持廣大法藏；獲無礙辯，深入法門；於無邊世界大眾之中，隨類不同，普現其身，色相具足，最勝無比，以無礙辯巧說深法；其音圓滿善巧分布故，能令聞者入於無盡智慧之門；知諸眾生心行煩惱而為說法，所出言音具足清淨故，一音演暢，能令一切皆生歡喜；其身端正有大威力故，處於眾會，無能過者；善知眾心故，能普現身；善巧說法故，音聲無礙；得心自在故，巧說大法，無能沮壞；得無所畏故，心無怯弱；於法自在故，無能過者；於智自在故，無能勝者；般若波羅蜜自在故，所說法相，不相違背；辯才自在故，隨樂說法，相續不斷；陀羅尼自在故，決定開示諸法實相；辯才自在故，隨所演說，能開種種譬諭之門；大悲自在故，勤誨眾生，心無懈息；大慈自在故，放光明網悅可眾心。",
        "translation": "菩薩摩訶薩勤修此法，次第成就諸菩薩行，乃至得與諸佛平等，於無邊世界中為大法師，護持正法；一切諸佛之所護念，守護受持廣大法藏；獲無礙辯，深入法門；於無邊世界大眾之中，隨類不同，普現其身，色相具足，最勝無比，以無礙辯巧說深法；其音圓滿善巧分布故，能令聞者入於無盡智慧之門；知諸眾生心行煩惱而為說法，所出言音具足清淨故，一音演暢，能令一切皆生歡喜；其身端正有大威力故，處於眾會，無能過者；善知眾心故，能普現身；善巧說法故，音聲無礙；得心自在故，巧說大法，無能沮壞；得無所畏故，心無怯弱；於法自在故，無能過者；於智自在故，無能勝者；般若波羅蜜自在故，所說法相，不相違背；辯才自在故，隨樂說法，相續不斷；陀羅尼自在故，決定開示諸法實相；辯才自在故，隨所演說，能開種種譬諭之門；大悲自在故，勤誨眾生，心無懈息；大慈自在故，放光明網悅可眾心。",
        "source": "T10n0279_018:0098b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是處於高廣師子之座，演說大法。",
        "translation": "Thus, the bodhisattva is placed high and wide on the lion's seat, expounding the great teaching.",
        "source": "T10n0279_018:0098c01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯除如來及勝願智諸大菩薩，其餘眾生無能勝者、無見頂者、無映奪者；欲以難問令其退屈，無有是處。",
        "translation": "Except for the Tathāgata and the great bodhisattvas of superior vow knowledge, there's no one other sentient beings can outshine, no one who sees the top, and no one who reflects back; there's no place for them to go if they want to be turned back by difficult questions.",
        "source": "T10n0279_018:0098c02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0279_018:0098c04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩得如是自在力已，假使有不可說世界量廣大道場，滿中眾生，一一眾生威德色相皆如三千大千世界主。",
        "translation": "After the bodhisattva Mahāsattva has attained this kind of sovereign power, suppose there were an ineffable world that's measured and vast, and the great avenue were filled with sentient beings, each of whom would have the appearance and dignity of the lord of a world of 3,000 great one-thousand worlds.",
        "source": "T10n0279_018:0098c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於此，纔現其身，悉能映蔽如是大眾，以大慈悲安其怯弱，以深智慧察其欲樂，以無畏辯為其說法，能令一切皆生歡喜。",
        "translation": "Here, the bodhisattva reveals himself as a little girl who can fully reflect such a large group of people, calm their fears and weaknesses with great compassion, examine their desires and pleasures with profound wisdom, and speak for them with fearless eloquence, making them all rejoice.",
        "source": "T10n0279_018:0098c07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T10n0279_018:0098c10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_018:0098c10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩成就無量智慧輪故，成就無量巧分別故，成就廣大正念力故，成就無盡善巧慧故，成就決了諸法實相陀羅尼故，成就無邊際菩提心故，成就無錯謬妙辯才故，成就得一切佛加持深信解故，成就普入三世諸佛眾會道場智慧力故，成就知三世諸佛同一體性清淨心故，成就三世一切如來智、一切菩薩大願智能作大法師開闡諸佛正法藏及護持故。」",
        "translation": "It's because the bodhisattva Mahāsattva has accomplished the immeasurable wheel of wisdom, accomplished measureless skillful discrimination, accomplished the power of vast correct mindfulness, accomplished inexhaustible skillful wisdom, accomplished the dhāraṇī that clearly understands the true characteristics of all dharmas, accomplished the boundless mind of enlightenment, accomplished marvelous eloquence, accomplished the deep conviction of attaining the blessings of all buddhas, accomplished the power of wisdom that universally enters the meeting places of all buddhas in the three times, accomplished the pure mind that knows the same essential nature of all buddhas in the three times, and accomplished the wisdom of all tathāgatas and all bodhisattvas' great vows to become great Dharma teachers who expound the true dharma stores of the buddhas and safeguard them.\"",
        "source": "T10n0279_018:0098c10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，法慧菩薩欲重宣其義，承佛神力而說頌言：「心住菩提集眾福，　　常不放逸植堅慧，　正念其意恒不忘，　　十方諸佛皆歡喜。",
        "translation": "Desiring to recapitulate their meaning, the Bodhisattva Dharma Wisdom then, acting on the Buddha's spiritual power, spoke in verse, \"Abiding mindfully in enlightenment, I gather many merits, I cultivate resolute wisdom without laziness, and I'm constantly mindful of my intention not to forget it, so the buddhas of the ten directions are all delighted.",
        "source": "T10n0279_018:0098c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　念欲堅固自勤勵，　　於世無依無退怯，　以無諍行入深法，　　十方諸佛皆歡喜。",
        "translation": "Striving on their own with resolute mindfulness, they have no support and don't falter in the world, and they enter the profound Dharma with non-frivolous conduct, making the buddhas of the ten directions rejoice.",
        "source": "T10n0279_018:0098c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛歡喜已堅精進，　　修行福智助道法，　入於諸地淨眾行，　　滿足如來所說願。",
        "translation": "After the buddhas rejoice, they make resolute effort, cultivate the factors that aid in the path of merit and wisdom, enter the stages of pure practices, and fulfill the vows taught by the Tathāgata.",
        "source": "T10n0279_018:0098c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是而修獲妙法，　　既得法已施群生，　隨其心樂及根性，　　悉順其宜為開演。",
        "translation": "After thus cultivating and acquiring the wonderful Dharma, he gives it to sentient beings according to their hearts, minds, and natures and expounds it according to their desires.",
        "source": "T10n0279_018:0098c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩為他演說法，　　不捨自己諸度行，　波羅蜜道既已成，　　常於有海濟群生。",
        "translation": "Once he has accomplished the perfect path, he's always helping sentient beings in the ocean of existence.",
        "source": "T10n0279_018:0098c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　晝夜勤修無懈倦，　　令三寶種不斷絕，　所行一切白淨法，　　悉以迴向如來地。",
        "translation": "Day and night, he diligently cultivates without laziness, causing the seeds of the Three Treasures to be uninterrupted, and all the white pure dharmas that he practices are dedicated to the Tathāgata's stage.",
        "source": "T10n0279_018:0099a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩所修眾善行，　　普為成就諸群生，　令其破闇滅煩惱，　　降伏魔軍成正覺。",
        "translation": "The many good practices that bodhisattvas cultivate are intended for the benefit of all sentient beings, causing them to dispel darkness and cease affliction and subdue the armies of Māra to become rightly awakened.",
        "source": "T10n0279_018:0099a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是修行得佛智，　　深入如來正法藏，　為大法師演妙法，　　譬如甘露悉霑灑。",
        "translation": "Thus cultivating attains buddha wisdom, deeply enters the Tathāgata's store of true dharma, and presents the wondrous Dharma for the great Dharma teacher, like sweet dew that fully sprinkles.",
        "source": "T10n0279_018:0099a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慈悲哀愍遍一切，　　眾生心行靡不知，　如其所樂為開闡，　　無量無邊諸佛法。",
        "translation": "He has compassion for them all, doesn't know the thoughts and actions of sentient beings, and explains them as he wishes, teaching the Buddha's teachings in measureless and limitless ways.",
        "source": "T10n0279_018:0099a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　進止安徐如象王，　　勇猛無畏猶師子，　不動如山智如海，　　亦如大雨除眾熱。」",
        "translation": "He's calm and collected like an elephant king, bold and fearless like a lion, motionless like a mountain, wise like the ocean, and like a great rain that removes the heat of many.\"",
        "source": "T10n0279_018:0099a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，法慧菩薩說此頌已，如來歡喜，大眾奉行。",
        "translation": "After the Bodhisattva Dharma Wisdom spoke this verse, the Tathāgata rejoiced and the whole community approved.",
        "source": "T10n0279_018:0099a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第十八",
        "translation": "Dafangguang fo huayan jing fangdai xviii",
        "source": "T10n0279_018:0099a13_0",
        "is_bad_quality": false
    }
]