[
    {
        "source_sentence": "大方廣佛華嚴經卷第十",
        "translation": "Dafangguangfo huayan jing, vol. 10",
        "source": "T10n0293_010:0704c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罽賓國三藏般若奉　詔譯",
        "translation": "Imperial Translation of the Tripiṭaka of the State of Kāśmīra",
        "source": "T10n0293_010:0704c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎入不思議解脫境界普賢行願品",
        "translation": "Chapter of the Vows of Samantabhadra, Entering the Realm of Inconceivable Liberation",
        "source": "T10n0293_010:0704c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_010:0704c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我又善知一切聲論、音聲、語言、內外、因起、名字、訓釋普遍無窮，假使帝釋於梵王所，聽受聲明，盡其天壽，足滿千歲，亦不能知聲論邊際，我一念頃，以此算法，悉能了知，盡其源底。",
        "translation": "\"Furthermore, I well know all the treatises on sound, sound, language, internal and external, causes and causes, names, explanations, and so forth, so that even if Śakra were to hear and accept a statement from King Brahmā and live his whole heavenly life, which would be a thousand years, he wouldn't be able to know the limits of the treatises on sound, but in a moment's thought, I'd be able to comprehend them all by this method and exhaust their source.",
        "source": "T10n0293_010:0704c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_010:0704c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼復教我菩薩算法，所謂：百千為一洛叉；一百洛叉為一俱胝；俱胝俱胝為一阿庾多；阿庾多阿庾多為一那由他；那由他那由他為一頻婆羅；頻婆羅頻婆羅為一矜羯羅；矜羯羅矜羯羅為一阿伽羅；阿伽羅阿伽羅為一微濕伐羅；微濕伐羅微濕伐羅為一鉢囉伐羅；鉢囉伐羅鉢囉伐羅為一鉢囉麼；鉢囉麼鉢囉麼為一婆嚩羅；婆嚩羅婆嚩羅為一阿婆羅；阿婆羅阿婆羅為一多婆羅；多婆羅多婆羅為一獶鉢彌耶；獶鉢彌耶獶鉢彌耶為一阿枲摩；阿枲摩阿枲摩為一普摩；普摩普摩為一禰摩；禰摩禰摩為一阿婆鈐；阿婆鈐阿婆鈐為一微婆伽；微婆伽微婆伽為一微婆奢；微婆奢微婆奢為一沒哩嚩迦；沒哩嚩迦沒哩嚩迦為一那賀羅；那賀羅那賀羅為一毘邏伽；毘邏伽毘邏伽為一彌嚩伽；彌嚩伽彌嚩伽為一毘伽婆；毘伽婆毘伽婆為一僧羯邏摩；僧羯邏摩僧羯邏摩為一毘薩羅；毘薩羅毘薩羅為一毘贍婆；毘贍婆毘贍婆為一慈汦伽；慈汦伽慈汦伽為一毘盛伽；毘盛伽毘盛伽為一毘嚕陀；毘嚕陀毘嚕陀為一微皤訶；微皤訶微皤訶為一微薄帝；微薄帝微薄帝為一毘佉擔；毘佉擔毘佉擔為一都邏那；都邏那都邏那為一阿覩[里*也]；阿覩[里*也]阿覩[里*也]為一嚩邏那；嚩邏那嚩邏那為一微皤蘭；微皤蘭微皤蘭為一三末耶；三末耶三末耶為一微覩羅；微覩羅微覩羅為一奚婆羅；奚婆羅奚婆羅為一陀嚩羅；陀嚩羅陀嚩羅為一微度栗娜；微度栗娜微度栗娜為一奢彌陀；奢彌陀奢彌陀為一儞[口*尸]嚩囉；儞[口*尸]嚩囉儞[口*尸]嚩囉為一微者囉；微者囉微者囉為一微舍囉；微舍囉微舍囉為一微儞薩多；微儞薩多微儞薩多為一阿瓢孽哆；阿瓢孽哆阿瓢孽哆為一微悉步多；微悉步多微悉步多為一泥嚩囉；泥嚩囉泥嚩囉為一波哩殺陀；波哩殺陀波哩殺陀為一微目差；微目差微目差為一鉢哩哆；鉢哩哆鉢哩哆為一喝哩多；喝哩多喝哩多為一阿嚕迦；阿嚕迦阿嚕迦為一印[寧*吉]哩耶；印[寧*吉]哩耶印[寧*吉]哩耶為一系嚕迦；系嚕迦系嚕迦為一奴嚩那；奴嚩那奴嚩那為一何嚕那；何嚕那何嚕那為一婆嚕陀；婆嚕陀婆嚕陀為一謎嚕陀；謎嚕陀謎嚕陀為一乞羼耶；乞羼耶乞羼耶為一阿差目多；阿差目多阿差目多為一翳嚕婆耶；翳嚕婆耶翳嚕婆耶為一微麼嚕耶；微麼嚕耶微麼嚕耶為一曼弩婆耶；曼弩婆耶曼弩婆耶為一微灑馱耶；微灑馱耶微灑馱耶為一三麼陀；三麼陀三麼陀為一鉢囉麼怛囉；鉢囉麼怛囉鉢囉麼怛囉為一阿囉麼怛囉；阿囉麼怛囉阿囉麼怛囉為一勃麼怛囉勃麼；怛囉勃麼怛囉為一阿畔麼怛囉；阿畔麼怛囉阿畔麼怛囉為一伽麼怛囉；伽麼怛囉伽麼怛囉為一那麼怛囉；那麼怛囉那麼怛囉為一奚麼怛囉；奚麼怛囉奚麼怛囉為一鞞麼怛囉；鞞麼怛囉鞞麼怛囉為一鉢囉麼怛囉；鉢囉麼怛囉鉢囉麼怛囉為一尸麼怛囉；尸麼怛囉尸麼怛囉為一翳囉；翳囉翳囉為一薜羅；薜羅薜羅為一帝羅；帝羅帝羅為一偈羅；偈羅偈羅為一窣步囉；窣步囉窣步囉為一制羅耶；制羅耶制羅耶為一泥羅；泥羅泥羅為一計羅；計羅計羅為一細羅；細羅細羅為一嫓羅；嫓羅嫓羅為一謎羅；謎羅謎羅為一娑邏茶；娑邏茶娑邏茶為一謎嚕陀；謎嚕陀謎嚕陀為一冥嚕陀；冥嚕陀冥嚕陀為一契嚕陀；契嚕陀契嚕陀為一摩覩羅；摩覩羅摩覩羅為一珠嚕哆；珠嚕哆珠嚕哆為一娑母羅；娑母羅娑母羅為一阿野娑；阿野娑阿野娑為一迦麼羅；迦麼羅迦麼羅為一摩伽婆；摩伽婆摩伽婆為一阿婆囉；阿婆囉阿婆囉為一系嚕婆；系嚕婆系嚕婆為一吠嚧婆；吠嚧婆吠嚧婆為一迦澁嚩羅；迦澁嚩羅迦澁嚩羅為一何婆羅；何婆羅何婆羅為一毘婆囉；毘婆囉毘婆囉為一那婆羅；那婆羅那婆羅為一寧畔多；寧畔多寧畔多為一摩婆羅；摩婆羅摩婆羅為一娑囉那；娑囉那娑囉那為一勃邏摩；勃邏摩勃邏摩為一勃邏麼那；勃邏麼那勃邏麼那為一微伽摩；微伽摩微伽摩為一鄔波跋多；鄔波跋多鄔波跋多為一儞哩泥捨；儞哩泥捨儞哩泥捨為一阿差耶；阿差耶阿差耶為一三姥馱；三姥馱三姥馱為一阿畔多；阿畔多阿畔多為一阿嚩摩娜；阿嚩摩娜阿嚩摩娜為一優鉢羅；優鉢羅優鉢羅為一波頭摩；波頭摩波頭摩為一僧祇；僧祇僧祇為一阿婆儉弭耶；阿婆儉弭耶阿婆儉弭耶為一孽[亭*也]；孽[亭*也]孽[亭*也]為一阿僧祇；阿僧祇阿僧祇為一阿僧祇轉；阿僧祇轉阿僧祇轉為一無量；無量無量為一無量轉；無量轉無量轉為一無邊；無邊無邊為一無邊轉；無邊轉無邊轉為一無等；無等無等為一無等轉；無等轉無等轉為一不可數；不可數不可數為一不可數轉；不可數轉不可數轉為一不可稱；不可稱不可稱為一不可稱轉；不可稱轉不可稱轉為一不可思；不可思不可思為一不可思轉；不可思轉不可思轉為一不可量；不可量不可量為一不可量轉；不可量轉不可量轉為一不可說；不可說不可說為一不可說轉；不可說轉不可說轉為一不可說不可說此；又不可說不可說為一不可說不可說轉。",
        "translation": "彼復教我菩薩算法，所謂：百千為一洛叉；一百洛叉為一俱胝；俱胝俱胝為一阿庾多；阿庾多阿庾多為一那由他；那由他那由他為一頻婆羅；頻婆羅頻婆羅為一矜羯羅；矜羯羅矜羯羅為一阿伽羅；阿伽羅阿伽羅為一微濕伐羅；微濕伐羅微濕伐羅為一鉢囉伐羅；鉢囉伐羅鉢囉伐羅為一鉢囉麼；鉢囉麼鉢囉麼為一婆嚩羅；婆嚩羅婆嚩羅為一阿婆羅；阿婆羅阿婆羅為一多婆羅；多婆羅多婆羅為一獶鉢彌耶；獶鉢彌耶獶鉢彌耶為一阿枲摩；阿枲摩阿枲摩為一普摩；普摩普摩為一禰摩；禰摩禰摩為一阿婆鈐；阿婆鈐阿婆鈐為一微婆伽；微婆伽微婆伽為一微婆奢；微婆奢微婆奢為一沒哩嚩迦；沒哩嚩迦沒哩嚩迦為一那賀羅；那賀羅那賀羅為一毘邏伽；毘邏伽毘邏伽為一彌嚩伽；彌嚩伽彌嚩伽為一毘伽婆；毘伽婆毘伽婆為一僧羯邏摩；僧羯邏摩僧羯邏摩為一毘薩羅；毘薩羅毘薩羅為一毘贍婆；毘贍婆毘贍婆為一慈汦伽；慈汦伽慈汦伽為一毘盛伽；毘盛伽毘盛伽為一毘嚕陀；毘嚕陀毘嚕陀為一微皤訶；微皤訶微皤訶為一微薄帝；微薄帝微薄帝為一毘佉擔；毘佉擔毘佉擔為一都邏那；都邏那都邏那為一阿覩[里*也]；阿覩[里*也]阿覩[里*也]為一嚩邏那；嚩邏那嚩邏那為一微皤蘭；微皤蘭微皤蘭為一三末耶；三末耶三末耶為一微覩羅；微覩羅微覩羅為一奚婆羅；奚婆羅奚婆羅為一陀嚩羅；陀嚩羅陀嚩羅為一微度栗娜；微度栗娜微度栗娜為一奢彌陀；奢彌陀奢彌陀為一儞[口*尸]嚩囉；儞[口*尸]嚩囉儞[口*尸]嚩囉為一微者囉；微者囉微者囉為一微舍囉；微舍囉微舍囉為一微儞薩多；微儞薩多微儞薩多為一阿瓢孽哆；阿瓢孽哆阿瓢孽哆為一微悉步多；微悉步多微悉步多為一泥嚩囉；泥嚩囉泥嚩囉為一波哩殺陀；波哩殺陀波哩殺陀為一微目差；微目差微目差為一鉢哩哆；鉢哩哆鉢哩哆為一喝哩多；喝哩多喝哩多為一阿嚕迦；阿嚕迦阿嚕迦為一印[寧*吉]哩耶；印[寧*吉]哩耶印[寧*吉]哩耶為一系嚕迦；系嚕迦系嚕迦為一奴嚩那；奴嚩那奴嚩那為一何嚕那；何嚕那何嚕那為一婆嚕陀；婆嚕陀婆嚕陀為一謎嚕陀；謎嚕陀謎嚕陀為一乞羼耶；乞羼耶乞羼耶為一阿差目多；阿差目多阿差目多為一翳嚕婆耶；翳嚕婆耶翳嚕婆耶為一微麼嚕耶；微麼嚕耶微麼嚕耶為一曼弩婆耶；曼弩婆耶曼弩婆耶為一微灑馱耶；微灑馱耶微灑馱耶為一三麼陀；三麼陀三麼陀為一鉢囉麼怛囉；鉢囉麼怛囉鉢囉麼怛囉為一阿囉麼怛囉；阿囉麼怛囉阿囉麼怛囉為一勃麼怛囉勃麼；怛囉勃麼怛囉為一阿畔麼怛囉；阿畔麼怛囉阿畔麼怛囉為一伽麼怛囉；伽麼怛囉伽麼怛囉為一那麼怛囉；那麼怛囉那麼怛囉為一奚麼怛囉；奚麼怛囉奚麼怛囉為一鞞麼怛囉；鞞麼怛囉鞞麼怛囉為一鉢囉麼怛囉；鉢囉麼怛囉鉢囉麼怛囉為一尸麼怛囉；尸麼怛囉尸麼怛囉為一翳囉；翳囉翳囉為一薜羅；薜羅薜羅為一帝羅；帝羅帝羅為一偈羅；偈羅偈羅為一窣步囉；窣步囉窣步囉為一制羅耶；制羅耶制羅耶為一泥羅；泥羅泥羅為一計羅；計羅計羅為一細羅；細羅細羅為一嫓羅；嫓羅嫓羅為一謎羅；謎羅謎羅為一娑邏茶；娑邏茶娑邏茶為一謎嚕陀；謎嚕陀謎嚕陀為一冥嚕陀；冥嚕陀冥嚕陀為一契嚕陀；契嚕陀契嚕陀為一摩覩羅；摩覩羅摩覩羅為一珠嚕哆；珠嚕哆珠嚕哆為一娑母羅；娑母羅娑母羅為一阿野娑；阿野娑阿野娑為一迦麼羅；迦麼羅迦麼羅為一摩伽婆；摩伽婆摩伽婆為一阿婆囉；阿婆囉阿婆囉為一系嚕婆；系嚕婆系嚕婆為一吠嚧婆；吠嚧婆吠嚧婆為一迦澁嚩羅；迦澁嚩羅迦澁嚩羅為一何婆羅；何婆羅何婆羅為一毘婆囉；毘婆囉毘婆囉為一那婆羅；那婆羅那婆羅為一寧畔多；寧畔多寧畔多為一摩婆羅；摩婆羅摩婆羅為一娑囉那；娑囉那娑囉那為一勃邏摩；勃邏摩勃邏摩為一勃邏麼那；勃邏麼那勃邏麼那為一微伽摩；微伽摩微伽摩為一鄔波跋多；鄔波跋多鄔波跋多為一儞哩泥捨；儞哩泥捨儞哩泥捨為一阿差耶；阿差耶阿差耶為一三姥馱；三姥馱三姥馱為一阿畔多；阿畔多阿畔多為一阿嚩摩娜；阿嚩摩娜阿嚩摩娜為一優鉢羅；優鉢羅優鉢羅為一波頭摩；波頭摩波頭摩為一僧祇；僧祇僧祇為一阿婆儉弭耶；阿婆儉弭耶阿婆儉弭耶為一孽[亭*也]；孽[亭*也]孽[亭*也]為一阿僧祇；阿僧祇阿僧祇為一阿僧祇轉；阿僧祇轉阿僧祇轉為一無量；無量無量為一無量轉；無量轉無量轉為一無邊；無邊無邊為一無邊轉；無邊轉無邊轉為一無等；無等無等為一無等轉；無等轉無等轉為一不可數；不可數不可數為一不可數轉；不可數轉不可數轉為一不可稱；不可稱不可稱為一不可稱轉；不可稱轉不可稱轉為一不可思；不可思不可思為一不可思轉；不可思轉不可思轉為一不可量；不可量不可量為一不可量轉；不可量轉不可量轉為一不可說；不可說不可說為一不可說轉；不可說轉不可說轉為一不可說不可說此；又不可說不可說為一不可說不可說轉。",
        "source": "T10n0293_010:0704c28_3",
        "is_bad_quality": true
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_010:0706a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我復以此菩薩所知算數之法，分別算知無數由旬，廣大沙聚顆粒多少；亦能算知十方盡虛空所有世界，種種安立差別次第；亦能算知十方所有一切世界廣狹大小種種分量，及以名字差別不同。",
        "translation": "\"Again, by this method of calculation that the bodhisattva knows, he can discriminatingly calculate the number of grains of sand that collect in a vast area for countless leagues; he can also calculate the various ways in which all the worlds in the ten directions are arranged in a particular order; he can also calculate the various ways in which all the worlds in the ten directions are measured in terms of their breadth and width and their size, and he can discriminate between their names.",
        "source": "T10n0293_010:0706a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：一切劫名、一切佛名、一切法名、一切諦名、一切業名、一切菩薩名、一切眾生名，皆悉了知通達無礙。",
        "translation": "He fully understands and comprehends without obstruction the names of all eons, the names of all buddhas, the names of all dharmas, the names of all truths, the names of all actions, the names of all bodhisattvas, and the names of all sentient beings.",
        "source": "T10n0293_010:0706a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_010:0706a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此一切工巧大神通智光明法門，如諸菩薩摩訶薩，能知一切諸眾生數，及知一切諸眾生名；能知一切法品類數，及知一切法品類名；能知三世諸時劫數，及知三世諸時劫名；能知一切諸如來數，及知一切諸如來名；能知一切諸菩薩數，及知一切諸菩薩名；亦能算知一切世界染淨成壞相續次第。",
        "translation": "\"I only know this Dharma gate of great supernormal cognitive illumination of all skillful means, just as bodhisattvas, mahāsattvas, can know the number of all sentient beings and know the names of all sentient beings; can know the number of types of all dharmas and know the names of all types of dharmas; can know the number of eons in the three times and know the names of eons in the three times; can know the number of all tathāgatas and know the names of all tathāgatas; can know the number of all bodhisattvas and know the names of all bodhisattvas; and can calculate the continuous sequence of defilement and decay in all worlds.",
        "source": "T10n0293_010:0706a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切時分日月年劫相續次第，一切諸佛出興名號相續次第，一切諸佛所轉法輪相續次第，一切菩薩發心行道相續次第，一切菩薩成熟眾生相續次第，一切眾生所造因業相續次第，一切眾生所受果報相續次第，如是乃至一切名相，展轉出生無盡緣起相續次第，如是菩薩所得算數自在法門，自利利他廣大饒益，能令眾生隨順悟入，次第成熟究竟解脫。",
        "translation": "The sequential order of all the time divisions, suns, moons, years, and eons, the sequential order of all the names of buddhas that arise, the sequential order of all the buddhas' turning of the wheel of the Dharma, the sequential order of all the bodhisattvas' arousal of mind and practice, the sequential order of all the bodhisattvas' maturation of sentient beings, the sequential order of all the causes and actions created by sentient beings, the sequential order of all the rewards received by sentient beings, the sequential order of all the names and forms that are produced in succession, the sequential order of endless conditions that arise, and the counted, self-contained, and vastly beneficial Dharma approach that bodhisattvas attain for their own benefit and for the benefit of others can cause sentient beings to conform, awaken, and enter, and ripen in sequence for their ultimate liberation.",
        "source": "T10n0293_010:0706a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我何能說其功德，示其所行，顯其境界，彰其勝力，辨其樂欲，宣其助道，發其大願，闡其妙行，演其諸度，讚其清淨，開其殊勝智慧光明，如是菩薩所有功德，乃至少分尚不能知，豈能盡知一切諸佛勝妙威神大功德海，圓滿一切諸佛福智寶聚波羅蜜果，證悟諸佛如燈照現無礙法界，演說諸佛廣大清淨自在法輪，遊戲諸佛最勝甚深三昧境界，覺了諸佛神通明智解脫法門？",
        "translation": "How could I explain their merits, show what they do, reveal their objects, make known their surpassing power, identify their desires, proclaim their aids, give rise to their great vows, elucidate their wondrous actions, expound their liberations, praise their purity, and reveal the radiance of their excellent wisdom?",
        "source": "T10n0293_010:0706b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0706b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南方有城名海別，住有優婆夷名辨具足，汝詣彼問菩薩云何學菩薩行，修菩薩道。」",
        "translation": "In the south, there's a city named Kāśyapa where Upāsikā named Prabhākaramitra lives, so go there and ask the bodhisattva how he trains in the bodhisattva practices and cultivates the bodhisattva path.\"",
        "source": "T10n0293_010:0706b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子聞是語已，歡喜踊躍，生尊敬心，獲得希有信樂寶心，成就廣大利眾生心。",
        "translation": "After hearing those words, the boy of good fortune rejoiced and roused with joy, became respectful, attained the rare and precious mind of faith and joy, and accomplished the mind of vastly improving sentient beings.",
        "source": "T10n0293_010:0706b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉能明見一切諸佛出興次第，降生成道，說法涅槃，最勝清淨，究竟圓滿，悟入甚深微妙智慧。",
        "translation": "He was able to clearly see all the buddhas in the sequence of their appearances, descend into the world, preach nirvāṇa, become most pure, and completely complete, and realize their profound and subtle wisdom.",
        "source": "T10n0293_010:0706b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普於諸趣皆隨現身，了知三世差別境界，獲得無盡大功德藏，放大智慧自在光明，開三有城所有關鍵趣向佛智，究竟菩提，頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "He follows them all into the present body, understands the distinct realms of the three worlds, acquires a limitless store of great merit, magnifies the unimpeded radiance of wisdom, opens up the three cities of existence to all key destinies, approaches buddha wisdom, and ultimately attains enlightenment, bows his head at his feet, circles him measurelessly, venerates him, and leaves.",
        "source": "T10n0293_010:0706b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子隨順思惟善知識教，正念觀察，慇懃渴仰，心無厭足，猶如巨海，受大雲雨，吞納眾流。",
        "translation": "At the time, the boy of good fortune followed the reflection of the good teacher's teaching, correctly observed it with mindfulness, longed for it, and had a mind that was never satisfied, like a huge ocean that receives great clouds and rain and swallows in numerous streams.",
        "source": "T10n0293_010:0706b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念言：「善知識教，猶如春日，生長一切善法根苗；善知識教，如秋滿月，凡所照觸，身意清涼；善知識教，如夏雪山，能除一切諸獸熱渴；善知識教，如芳池日，能開一切善心蓮華；善知識教，如日珠輪，照引眾生，至法寶處；善知識教，如閻浮樹，開敷一切福智華果；善知識教，如大龍王，自在興布妙法雲雨；善知識教，如妙高山，積集種種無漏功德，三十三天莊嚴止住；善知識教，如天帝釋，功德諸天所共圍遶，能破愛見阿脩羅軍。」",
        "translation": "作是念言：「善知識教，猶如春日，生長一切善法根苗；善知識教，如秋滿月，凡所照觸，身意清涼；善知識教，如夏雪山，能除一切諸獸熱渴；善知識教，如芳池日，能開一切善心蓮華；善知識教，如日珠輪，照引眾生，至法寶處；善知識教，如閻浮樹，開敷一切福智華果；善知識教，如大龍王，自在興布妙法雲雨；善知識教，如妙高山，積集種種無漏功德，三十三天莊嚴止住；善知識教，如天帝釋，功德諸天所共圍遶，能破愛見阿脩羅軍。」",
        "source": "T10n0293_010:0706b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是思惟，漸次前行，至海住城，周遍求覓此優婆夷。",
        "translation": "Thus thinking, he gradually moved on to the city of Kāśyapa and searched everywhere for this Upāsikā.",
        "source": "T10n0293_010:0706c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼眾人咸告之言：「善男子！",
        "translation": "The people there then all told him, \"Good man!",
        "source": "T10n0293_010:0706c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼優婆夷在此城內，住自宅中。」",
        "translation": "That Upāsikā is staying in his own house in this city.\"",
        "source": "T10n0293_010:0706c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財聞已，即詣其門，合掌而立，見其舍宅，廣博殊麗，種種莊嚴，眾寶垣牆，周匝圍遶，四面皆有寶莊嚴門。",
        "translation": "After hearing this, Shan Cai went to his gate, stood with his palms together, and saw that his abode was vast and beautiful, adorned in various ways, surrounded by a wall of treasures, and with a jeweled gate on each side.",
        "source": "T10n0293_010:0706c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財入已，見優婆夷處於寶座，妙年盛色，容貌端嚴，不御華瓔，素服垂髮，威光殊特，人所樂見。",
        "translation": "After Sun Cai entered, he saw Upāsikā sitting on a jeweled throne, beautifully youthful and prosperous, with an elegant appearance, not wearing flowers ornaments, wearing plain clothes and hanging his hair, and with a distinctive appearance that people were delighted to see.",
        "source": "T10n0293_010:0706c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除佛、菩薩，餘無能及；有勝威力，有廣大心，令諸眾生，見聞親近，咸生尊重、愛敬之心。",
        "translation": "There's nothing like him except for buddhas and bodhisattvas, who have surpassing authority and a vast heart that causes sentient beings to respect and adore him when they see and hear him.",
        "source": "T10n0293_010:0706c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其宅中，敷十億座，超諸人天一切所有，皆是菩薩業力所成。",
        "translation": "In his house, he spreads out a billion seats, surpassing everything that exists in humans and gods, all made possible by the bodhisattva's karmic power.",
        "source": "T10n0293_010:0706c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宅內無有衣服、飲食及餘嚴具，但於其前，置一小器，復有十千童女圍遶，一切妙寶莊飾其身。",
        "translation": "Inside the abode there are no clothes, food, or other necessities, but instead, there's a small container placed in front of it, surrounded by 10,000 maidens, and adorned with all the marvelous treasures.",
        "source": "T10n0293_010:0706c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言音和雅，常侍左右，瞻仰承順，情無厭怠。",
        "translation": "They speak elegantly, are always at his side, and venerate and obey him with untiring attention.",
        "source": "T10n0293_010:0706c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身出妙香，普熏城內及遍虛空，一切人天聞其香者，於菩提心皆不退轉。",
        "translation": "A wonderful fragrance emanates from his body, perfuming the city and pervading the sky, and when all humans and gods hear his fragrance, their minds don't turn away from bodhi.",
        "source": "T10n0293_010:0706c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其餘眾生遇斯香者：身心柔軟，無怒害心、無怨結心、無慳嫉心、無諂誑心、無險曲心、無貪愛心、無瞋恚心、無幻偽心、無下劣心、無高慢心、無邪僻心、無障礙心、無執著心、住平等心、起大慈心、發利益心、住律儀心、離貪求心。",
        "translation": "When other sentient beings encounter that fragrance, they're gentle in body and mind, free of anger and harmful thoughts, free of enmity, free of stinginess and jealousy, free of flattery, free of harsh thoughts, free of craving, free of anger, free of falsehood, free of inferior thoughts, free of arrogance, free of deviant thoughts, free of obstructive thoughts, free of attachment, abide in an equal mind, arouse great kindness, arouse beneficial thoughts, abide in a disciplined mind, and free of desiring thoughts.",
        "source": "T10n0293_010:0706c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞其聲者，歡喜踊躍；見其身者，悉離貪染。",
        "translation": "Those who hear their voices rejoice and jump for joy, and those who see their bodies are freed from craving and defilement.",
        "source": "T10n0293_010:0707a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財即前頂禮優婆夷足，右遶恭敬合掌而立。",
        "translation": "At that point, Shan Cai then saluted Upāsikā at his feet, circled to his right, and stood with his palms together in respect.",
        "source": "T10n0293_010:0707a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「聖者！",
        "translation": "He said, \"Noble one!",
        "source": "T10n0293_010:0707a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，修菩薩道，我聞聖者，善能誘誨，願為我說。」",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices and cultivates the bodhisattva path, so I've heard that the noble one is well able to guide you and would like to explain it for me.\"",
        "source": "T10n0293_010:0707a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即告言：「善男子！",
        "translation": "He then told them, \"Good man!",
        "source": "T10n0293_010:0707a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩無盡福德莊嚴藏解脫門，能於如是一小器中，隨諸眾生種種欲樂，如應為出種種甘美上好飲食，色香味觸悉皆充足。",
        "translation": "I've attained the bodhisattva's liberation gate of the store of endless merit and adornment, which enables him to follow the various desires and pleasures of sentient beings in such a small container as will produce a variety of delicious and excellent foods, which are all plentiful in form, smell, taste, and touch.",
        "source": "T10n0293_010:0707a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0707a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此器中，所出飲食，假使百眾生、千眾生、百千眾生、億眾生、百億眾生、千億眾生、百千億眾生、那由他眾生，乃至不可說不可說眾生；假使閻浮提極微塵數眾生，一四天下極微塵數眾生，小千世界、中千世界、大千世界極微塵數眾生，乃至不可說不可說佛剎極微塵數眾生，假使十方一切世界極微塵數眾生，隨其欲樂，悉令充滿。",
        "translation": "\"Suppose I were to produce food and drink in this vessel for a hundred sentient beings, a thousand sentient beings, a hundred thousand sentient beings, a hundred million sentient beings, a hundred billion sentient beings, a hundred billion sentient beings, a hundred billion sentient beings, a hundred billion sentient beings, a hundred billion sentient beings, or even sentient beings that are ineffable and ineffable; suppose there were a very tiny number of sentient beings in Jambudvīpa, a very tiny number of sentient beings under one or four heavens, a very tiny number of sentient beings in the small thousand worlds, the medium thousand worlds, and the great thousand worlds, or even a very tiny number of sentient beings in the ineffable and ineffable Buddha-temple; suppose there were a very tiny number of sentient beings in all the worlds in the ten directions who would fill it according to their desires and pleasures.",
        "source": "T10n0293_010:0707a09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飢渴消除，身心安樂，智慧增長，然其飲食，無有窮盡，亦不減少，如出飲食，乃至能出種種床座、種種敷具、種種繒綵、種種衣服、種種車乘、種種幢幡、種種軒蓋、種種華鬘、種種瓔珞、種種珍寶、種種散香、種種丸香、種種塗香、種種燒香、種種末香，乃至種種如法資具，隨其來者，普心給施，不擇怨親、貴賤、貧富，如所意願，悉令豐足。",
        "translation": "Their hunger and thirst are eliminated, their bodies and minds are made comfortable, and their wisdom grows, yet their diet is inexhaustible and doesn't decrease as they eat and drink, up to the point where they can produce various seats, various spreads, various silken fabrics, various garments, various chariots and vehicles, various banners and streamers, various canopies, various flowers and jewelry, various scattered incense, various pellets, various coatings, various burning incense, various powdered incense, and various provisions according to the teaching, which are universally given with the same intention, regardless of enmity, nobility, or poverty, and are made abundant according to their wishes.",
        "source": "T10n0293_010:0707a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆於我所，生尊重心、生恭敬心、生無厭心、生調伏心。",
        "translation": "In my place, they all will develop respect, become venerable, become unwearying, and become disciplined.",
        "source": "T10n0293_010:0707a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_010:0707a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使東方一世界中所有眾生，修習聲聞、獨覺乘者，食我食已，皆證聲聞、獨覺乘果，住最後身。",
        "translation": "Suppose all the sentient beings in the eastern One World who practice the vehicle of the śrāvakas and pratyekbuddhas and who eat my food realize the fruit of the vehicle of the śrāvakas and pratyekbuddhas and abide in the final body.",
        "source": "T10n0293_010:0707a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一世界，如是次第百世界、千世界、百千世界、億世界、百億世界、千億世界、百千億世界、百千億那由他世界、閻浮提極微塵數世界、一四天下極微塵數世界、小千世界極微塵數世界、中千世界極微塵數世界、大千世界極微塵數世界，乃至不可說不可說佛剎極微塵數世界，其中所有一切眾生，修習聲聞、獨覺乘者，食我食已，皆證聲聞、辟支佛果，住最後身，南、西、北方，四維，上、下，亦復如是。",
        "translation": "Thus, in this single world, and in this order, there would be a hundred worlds, a thousand worlds, a hundred thousand worlds, a billion worlds, a hundred billion worlds, a hundred billion worlds, a hundred billion nayutas, the extremely fine numbered world of Jambudvīpa, the extremely fine numbered world of the one or four worlds, the extremely fine numbered world of the lesser thousand worlds, the extremely fine numbered world of the middle thousand worlds, the extremely fine numbered world of the great thousand worlds, and even the extremely fine numbered world of the ineffable and ineffable buddha bases, in which all sentient beings cultivating the vehicle of the śrāvakas and pratyekbuddhas realize the fruit of the śrāvakas and pratyekabuddhas and abide in their final body after they eat from my food, and so it would be in the south, west, north, the four counterpoints, and the upper and lower parts of the world.",
        "source": "T10n0293_010:0707a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又，善男子！",
        "translation": "Again, good sons!",
        "source": "T10n0293_010:0707b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如東方一世界，乃至不可說不可說佛剎極微塵數世界，其中所有最後身菩薩，食我食已，皆詣最勝菩提道場，降伏魔軍，成等正覺。",
        "translation": "\"Suppose there's a world in the east or even a very tiny number of ineffable and indescribable Buddha bases, in which all the last-bodied bodhisattvas who have eaten my food have gone to the site of the most excellent enlightenment, subdued the armies of Māra, and become perfectly enlightened.",
        "source": "T10n0293_010:0707b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南、西、北方，四維，上、下，所有一世界，乃至不可說不可說佛剎極微塵數世界，其中所有最後身菩薩，食我食已，皆得往詣最勝道場，降伏魔軍，成等正覺。",
        "translation": "From the south, west, north, the four counterpoints, up, and down, there's a single world ... up to the most minute number of unexplainable and indescribable Buddha bases ... in which all the last-bodied bodhisattvas who have eaten from me will go to the site of the most excellent enlightenment, subdue the armies of Māra, and become perfectly enlightened.",
        "source": "T10n0293_010:0707b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0707b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見我此十千童女眷屬以不？」",
        "translation": "Do you see these ten thousand maidens of mine as retinues?\"",
        "source": "T10n0293_010:0707b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「已見！」",
        "translation": "replied, \"I have seen it!\"",
        "source": "T10n0293_010:0707b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優婆夷言：「善男子！",
        "translation": "Upāsikā said, \"Good sons!",
        "source": "T10n0293_010:0707b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我所有菩薩眷屬，百萬阿僧祇，此十千童女而為上首，皆悉與我行同類行、同一大願、同一善根、同出離道、同清淨解、同清淨信、同清淨念、同清淨趣、同清淨智、同無量覺、同淨諸根、同普遍心、同廣大心、同所行境、同所證理、同決定解、同明了法、同淨妙色、同無量力、同最精進、同正法音、同隨類音、同清淨音、同第一音、同讚功德、同清淨業、同清淨報、同廣大慈、同普遍悲、同普救護、同遍成熟。",
        "translation": "今我所有菩薩眷屬，百萬阿僧祇，此十千童女而為上首，皆悉與我行同類行、同一大願、同一善根、同出離道、同清淨解、同清淨信、同清淨念、同清淨趣、同清淨智、同無量覺、同淨諸根、同普遍心、同廣大心、同所行境、同所證理、同決定解、同明了法、同淨妙色、同無量力、同最精進、同正法音、同隨類音、同清淨音、同第一音、同讚功德、同清淨業、同清淨報、同廣大慈、同普遍悲、同普救護、同遍成熟。",
        "source": "T10n0293_010:0707b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同淨身業，隨緣現起，如所應見，皆令歡喜；同淨語業，於法自在，隨俗訓釋，宣布法化；同能普詣諸佛道場，同能普往一切佛所，供養承事；同現覺智，悉解諸佛差別法門；同得安住一切菩薩清淨行地。",
        "translation": "With the same pure physical action, they arise according to conditions and make everyone rejoice when they see what's appropriate; with the same pure speech action, they're at ease with the Dharma, follow secular explanations, and announce the teaching of the Dharma; with the same ability to universally visit the sites of the buddhas' paths and to universally go to all the buddhas' places to make offerings and serve them; with the same awakened wisdom, they fully understand the buddhas' distinctive teachings; and with the same ability to abide in all the bodhisattvas' pure stages of practice.",
        "source": "T10n0293_010:0707b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0707b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是十千童女，能取此食，於一念頃遍至十方，供養一切住最後身諸大菩薩，及供一切聲聞、獨覺，乃至遍詣十方世界諸餓鬼趣，皆令充足，除其飢渴。",
        "translation": "Those 10,000 girls could take this food and travel to ten directions in a moment's thought to make offerings to all the great bodhisattvas who reside in their final bodies, to all the śrāvakas and solitary realizers, and even to the destinies of the hungry ghosts in the world in ten directions, making them all full and relieving their hunger and thirst.",
        "source": "T10n0293_010:0707c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_010:0707c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此十千童女，又取我食，能於天中，充足天食；亦於龍中，充足龍食，乃至能於人、非人中，隨其所須，施諸飲食，悉令充足。",
        "translation": "These 10,000 girls who take my food can provide enough food for the gods and enough food for dragons, even to the point where they can give food and drink to humans and non-humans as they need it.",
        "source": "T10n0293_010:0707c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此器中，曾無減少，何況有盡？",
        "translation": "There's never been a decrease in this vessel of mine, so how could there be an end?",
        "source": "T10n0293_010:0707c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0707c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且待須臾，汝當自見。」",
        "translation": "Wait a moment, and you will see for yourself.\"",
        "source": "T10n0293_010:0707c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，善財即見無量眾生，從四門入，皆優婆夷本願所請，既來集已，敷座令坐，隨其所須，給施飲食；乃至種種上妙資具，悉皆充足，令諸眾生，心生歡喜，安隱適悅，互相慶慰。",
        "translation": "When he spoke these words, Shanzai saw measureless sentient beings entering through four gates, all of whom Upāsikā had originally requested, and once they had gathered here, he prepared a seat for them to sit on, gave them food and drink as they desired, and supplied them with all the finest necessities, making all of them happy in spirit, comfortable, and comfortable, and comforting each other.",
        "source": "T10n0293_010:0707c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此器中，所出之物，無減無盡。",
        "translation": "What comes out of this vessel is without decrease or limit.",
        "source": "T10n0293_010:0707c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，優婆夷作此施已，告善財言：「善男子！",
        "translation": "After making this gift, Upāsikā addressed Śubhaji, saying, \"Good man!",
        "source": "T10n0293_010:0707c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此菩薩無盡福德莊嚴藏解脫門，如諸菩薩摩訶薩無盡福德大莊嚴藏，甚深無底，猶如大海；廣大無際，猶若虛空；滿眾生心，如如意珠；所求皆得，如大寶聚；擁護一切，如輪圍山；長諸善根，如大雲雨；守護法藏，猶如關鑰；普集法寶，如妙高山；破無明闇，猶如燈燭；普蔭群生，猶如高蓋。",
        "translation": "\"I only know that this bodhisattva's treasury of inexhaustible merit and adornment is a gate of liberation like the bodhisattva-mahāsattva's treasury of inexhaustible merit and great adornment, which is as deep and bottomless as the ocean, vast and limitless as space, full of the minds of sentient beings like the wish-granting pearl, capable of obtaining whatever is sought like a great cluster of treasures, shielding all things like a mountain surrounded by a wheel, nurturing good roots like a great cloud of rain, guarding the treasury of the Dharma like a shut-off key, universally collecting Dharma treasure like a wonderful high mountain, dispelling the darkness of ignorance like a candle, and universally shading sentient beings like a high canopy.",
        "source": "T10n0293_010:0707c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我云何能知、能說彼功德行？",
        "translation": "How can I know and explain their meritorious actions?",
        "source": "T10n0293_010:0707c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0707c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南方有城，名為大有，彼有長者，名具足智，汝詣彼問菩薩云何學菩薩行，修菩薩道。」",
        "translation": "There's a city in the south named Daiśa, and there's an elder there named Completely Awakened, so go there and ask the bodhisattva how he trains in the bodhisattva practices and cultivates the bodhisattva path.\"",
        "source": "T10n0293_010:0707c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "The Boy of Good Fortune then bowed his head at his feet, circled him measureless times, paid homage to him, paid respect to him, and withdrew.",
        "source": "T10n0293_010:0707c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子得菩薩無盡莊嚴福德藏解脫門已，隨順思惟彼福德大海；觀察彼福德虛空；向彼福德聚；登彼福德山；攝彼福德藏；飲彼福德泉；游彼福德池；淨彼福德場；見彼福德藏；入彼福德教；開彼福德眼；行彼福德道；植彼福德種。",
        "translation": "After realizing the bodhisattva's liberation through the treasury of inexhaustible merit, the Boy of Good Wealth then followed his contemplation of that ocean of merit, observed that space of merit, headed for that cluster of merit, climbed that mountain of merit, collected that store of merit, drank from that spring of merit, swam in that pool of merit, purified that site of merit, saw that store of merit, entered that teaching of merit, opened that eye of merit, practiced that path of merit, and planted that seed of merit.",
        "source": "T10n0293_010:0707c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸次而行，至大有城，周遍詢求明智居士。",
        "translation": "He travels step by step to the great city of existence and searches everywhere for wise gentlemen.",
        "source": "T10n0293_010:0708a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善知識心生渴仰，念善知識心無間斷，慕善知識志樂堅固，方便求見諸善知識常無厭足；願得承事諸善知識，精勤匪懈，以善知識熏修其心。",
        "translation": "Their aspirations for good teachers are aroused, their mindfulness of good teachers is uninterrupted, their aspirations for good teachers are resolute, their skillful means of seeing good teachers are never exhausted, and they wish to serve good teachers, diligently and tirelessly cultivate their minds with good teachers.",
        "source": "T10n0293_010:0708a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知由依止善知識故，能滿眾善；知由依止善知識故，能生眾福；知由依止善知識故，能長眾行；知由依止善知識故，不由他教，自能承事一切善友；知由依止善知識故，清淨一切菩薩諸根。",
        "translation": "They know that it's because they rely on good teachers that they can fulfill many good qualities, that it's because they rely on good teachers that they can produce many merits, that it's because they rely on good teachers that they can develop many practices, that it's because they rely on good teachers that they can serve all good friends on their own without being taught by others, and that it's because they rely on good teachers that they can purify all the bodhisattva's faculties.",
        "source": "T10n0293_010:0708a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是思惟，長其善根、深其志樂、益其德本、廣其大悲、近一切智、具普賢道、照明一切諸佛正法、增長菩薩所有行願、明照如來十力智光。",
        "translation": "Thus contemplating them, they grow their good roots, deepen their aspirations, enhance their virtues, expand their great compassion, approach all wisdom, become fully endowed with the path of Samantabhadra, illuminate all the true buddha-teachings, increase all the actions and vows of the bodhisattvas, and shine brightly with the ten powers and wisdom of the Tathāgata.",
        "source": "T10n0293_010:0708a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財見彼居士在於城內，市四衢道七寶臺上，處於眾寶莊嚴之座；其座妙好，無數清淨，如意寶王，以為其身，種種金剛、帝青摩尼以為其足，寶繩珠網以為交絡，無垢藏摩尼寶而校飾之。",
        "translation": "At the time, Shan Cai saw that householder inside the city on a seven-jeweled dais in the city's four thoroughfares, sitting on a seat adorned with multitudes of treasures; the marvelous beauty of his seat was countless and pure, with the wish-granting jeweled king for his body, various adamantine and cerulean maṇi for his feet, a web of precious cords and beads for his interlacing, and the mohair of the stainless store decorated with maṇi treasures.",
        "source": "T10n0293_010:0708a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以五百妙寶形像，而為莊嚴；敷天寶衣，建天幢幡，張大寶網，施大寶帳，閻浮檀金以為其蓋；淨瑠璃寶，以為其竿；令人執持，以覆其上；鵝王羽翮，以為其扇；白犛牛尾，以為其拂；悉以離垢妙寶莊嚴。",
        "translation": "He adorned them with five hundred exquisitely jeweled images, spread out his celestial jeweled robes, built celestial banners and streamers, spread out a great jeweled net, made a great jeweled canopy, made a gold canopy of jambu, made a pure beryl pole, had someone carry it and cover it, made a fan of king goose feathers, and made a whisk of white yak tail; all of them were adorned with exquisitely jewels.",
        "source": "T10n0293_010:0708a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天諸童子，執持左右，熏眾妙香，雨眾天華，晝夜常奏五百樂音，其音美妙，過於天樂，眾生聞者，無不歡悅。",
        "translation": "The gods' children hold it to their right and left, perfuming it with many wonderful incense and raining celestial flowers, and they always play five hundred musical sounds by day and night, sounds so beautiful that they surpass the music of the gods, and no sentient being is left unhappy when they hear them.",
        "source": "T10n0293_010:0708a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十千眷屬，前後圍遶，色相端嚴，人所喜見。",
        "translation": "Surrounded by his ten thousand attendants, he's resplendent in appearance and pleasing to behold.",
        "source": "T10n0293_010:0708a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天莊嚴具，以為嚴飾，出過天人，最勝無比，悉已成就菩薩志欲，皆與居士，同昔善根，侍立瞻對，承其教命。",
        "translation": "They are adorned with heavenly adornments that surpass those of gods and humans and are unsurpassed, and they've all accomplished the aspirations of the bodhisattvas, so they all share the same good roots as the householder, stand up, look around, and accept his instructions.",
        "source": "T10n0293_010:0708a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼城內一切眾生，及虛空中所有天眾，於居士所，生隨順心、生愛樂心、生歡喜心，以心隨順、歡喜、愛樂善知識故，即起一切天拘蘇摩妙寶華雲，普雨一切天拘蘇摩妙寶華雨。",
        "translation": "At the time, all the sentient beings in that city and all the gods in the sky became compliant, joyous, and delighted with the householder, and because their hearts were compliant, joyous, and delighted in the good teacher, a cloud of marvelous jewels and flowers of the gods Kusuma arose, and it rained down marvelous jewels and flowers of the gods Kusuma.",
        "source": "T10n0293_010:0708a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸人天，亦與居士往昔同種清淨善根。",
        "translation": "Those humans and gods also shared the same pure good roots as the householder in the past.",
        "source": "T10n0293_010:0708b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財見是事已，前禮其足，遶無數匝，合掌而立，白言：「聖者！",
        "translation": "Seeing this, Shanzai saluted his feet, circled him for countless turns, stood with his palms together, and said, \"Sage!",
        "source": "T10n0293_010:0708b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為利樂諸眾生故，發阿耨多羅三藐三菩提心；為令一切眾生滅除苦難故；為令一切眾生究竟安樂故；為令一切眾生出生死海故；為令一切眾生入法寶洲故；為令一切眾生枯竭愛河故；為令一切眾生起大慈悲故；為令一切眾生捨離貪著故；為令一切眾生渴仰佛智故；為令一切眾生越度生死大曠野故；為令一切眾生愛樂諸佛勝功德故；為令一切眾生出三界城故；為令一切眾生入一切智城故。",
        "translation": "我為利樂諸眾生故，發阿耨多羅三藐三菩提心；為令一切眾生滅除苦難故；為令一切眾生究竟安樂故；為令一切眾生出生死海故；為令一切眾生入法寶洲故；為令一切眾生枯竭愛河故；為令一切眾生起大慈悲故；為令一切眾生捨離貪著故；為令一切眾生渴仰佛智故；為令一切眾生越度生死大曠野故；為令一切眾生愛樂諸佛勝功德故；為令一切眾生出三界城故；為令一切眾生入一切智城故。",
        "source": "T10n0293_010:0708b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是等種種利益，發菩提心，而未知菩薩云何學菩薩行，云何修菩薩道，而能攝護一切眾生，為諸眾生作依止處。",
        "translation": "With these kinds of benefits, they give rise to the mind of enlightenment, but they don't know how a bodhisattva trains in the bodhisattva practices and cultivates the bodhisattva path, which can then protect all sentient beings and serve as a base for all sentient beings.",
        "source": "T10n0293_010:0708b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說。」",
        "translation": "I've heard that the noble ones are good at guiding and teaching, so please explain this for me.\"",
        "source": "T10n0293_010:0708b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士告言：「善哉！",
        "translation": "The monk told him, \"Good!",
        "source": "T10n0293_010:0708b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T10n0293_010:0708b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0708b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝乃能為如是利故，發阿耨多羅三藐三菩提心。",
        "translation": "Then you'll be able to give rise to the mind of unsurpassed, correct, and complete enlightenment for such a benefit.",
        "source": "T10n0293_010:0708b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0708b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心，是人難得！",
        "translation": "This is a rare person who gives rise to the mind of unsurpassed, correct enlightenment!",
        "source": "T10n0293_010:0708b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能發心，是人則能求菩薩行，心無動轉，值遇善知識，心無厭足；親近善知識，心無勞倦；承事善知識，心無憂慼；供養善知識，終不退轉；愛念善知識，終不放捨；渴仰善知識，無暫懈息；求覓善知識，無時憩止；行善知識教，未曾怠惰；稟善知識命，心無誤失。",
        "translation": "If someone can arouse the intention, then they can pursue bodhisattva practices without agitation, encounter a good teacher without weariness, approach a good teacher without weariness, serve a good teacher without sadness, make offerings to a good teacher without ever turning away, remember a good teacher without ever abandoning him, long for a good teacher without ever stopping, seek a good teacher without ever stopping, practice the teachings of a good teacher without ever being lazy, and claim the life of a good consciousness without mistaken thought.",
        "source": "T10n0293_010:0708b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者，有大威力，難得親近、承事、供養，若能給侍、瞻禮、讚歎心無憂悔，則得具足一切功德，不為煩惱毒亂其心。",
        "translation": "A good teacher has great authority and is difficult to get close to, serve, and make offerings to, but if he can serve, venerate, and praise them without regret, then he'll be fully endowed with all merits and won't let afflictions poison his mind.",
        "source": "T10n0293_010:0708b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0708c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見我此十千眷屬眾會人不？」",
        "translation": "Have you seen this congregation of 10,000 members of my retinue?\"",
        "source": "T10n0293_010:0708c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「已見！」",
        "translation": "replied, \"I have seen it!\"",
        "source": "T10n0293_010:0708c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士言：「善男子！",
        "translation": "The householder said, \"Good man!",
        "source": "T10n0293_010:0708c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已令其發阿耨多羅三藐三菩提心，生如來家，增長白法，安住無量諸波羅蜜；學佛十力，離世間種，住如來種；壞生死輪，轉淨法輪；滅三惡趣，住正法趣。",
        "translation": "I've caused them to arouse the mind of unsurpassed, perfect enlightenment, become part of the Tathāgata's family, grow in the white Dharma, abide in measureless perfections, train in the Buddha's ten powers, part with the worldly seeds and abide in the Tathāgata's seeds, destroy the wheel of birth-and-death and turn to the pure Dharma wheel, cease the three bad destinies, and abide in the right Dharma destiny.",
        "source": "T10n0293_010:0708c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等諸菩薩行，悉能成就，普能救護一切眾生。",
        "translation": "Such and other bodhisattva practices are all accomplished, and they can universally aid all sentient beings.",
        "source": "T10n0293_010:0708c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0708c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得隨意出生福德藏解脫門，一切眾生凡有所須，悉滿其願。",
        "translation": "\"I can freely produce the liberation of the store of merit, and all sentient beings will fulfill their vows whenever they need anything.",
        "source": "T10n0293_010:0708c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：須食與食，須飲與飲，如是種種衣服、瓔珞、華鬘、繒綵、燒香、塗香、末香、金銀、真珠、珍奇眾寶，種種幢幡，種種軒蓋、房舍、屋宅、倚臥之具，種種燈燭、病緣湯藥，種種船舫、象馬、車乘、奴婢、牛羊、及諸侍使，如是一切資生之物。",
        "translation": "That is, food when they need it, drink when they need it, such things as various kinds of clothing, jewelry, flower garlands, silken ribbons, burning incense, perfuming, powdered incense, gold and silver, genuine pearls, precious treasures, various banners and streamers, various canopies, dwellings, houses, and bedding, various lamps and candles, medicines for illnesses, various boats, elephants and horses, chariots, slaves, cattle and sheep, and attendants, and all such things that provide for life.",
        "source": "T10n0293_010:0708c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復能與天冠寶飾、髻中明珠，乃至所愛妻、妾、男、女、眼、耳、鼻、舌、皮、肉、骨髓、身體、手足，不揀貧富、貴賤、好醜，隨其來意，皆悉與之，乃至為說真實妙法，使令修證，究竟圓滿。",
        "translation": "They can also give them all jewelry from the crown of the gods and the bright pearl in their topknots, as well as their favorite wives, concubines, men, women, eyes, ears, noses, tongues, skin, flesh, bones, marrow, bodies, hands, and feet, without discriminating between rich and poor, high and low, or good and ugly, as they wish, and they'll explain the true and wonderful teaching for them so that they'll cultivate it and ultimately perfect it.",
        "source": "T10n0293_010:0708c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0708c18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且待須臾，汝當自見。」",
        "translation": "Wait a moment, and you will see for yourself.\"",
        "source": "T10n0293_010:0708c18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，無量眾生，從種種方所、種種世界、種種國土、種種城邑、種種聚落、種種居處，形類差別，愛樂不同，其數無量，皆以菩薩往昔願力，俱來集會。",
        "translation": "When he spoke these words, measureless numbers of sentient beings in various places, worlds, lands, cities, villages, and dwelling places, with different forms and preferences, were assembled here by the power of the bodhisattva's past vows.",
        "source": "T10n0293_010:0708c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，居士知眾雲集，普遍觀察，繫念須臾，仰視虛空，如其所須，悉從空下，相續流入居士掌中。",
        "translation": "At the time, the householder knew that there were clouds of people gathered, so he generally observed them, fixing his attention for a moment and looking up into space, and as he needed them, they all descended from space and successively flowed into the householder's palm.",
        "source": "T10n0293_010:0708c22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨諸眾會，一切願求，皆手授與，普令滿足。",
        "translation": "According to the congregation, he granted all their wishes with his hand, and they were universally fulfilled.",
        "source": "T10n0293_010:0708c24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既滿願已，生大歡喜，身色光悅，心意調柔，堪任受化，然後為說種種妙法。",
        "translation": "After fulfilling their vows, he becomes greatly elated, his body glows with joy, and his mind is so refined that he's capable of being trained, and then he teaches them various wonderful things.",
        "source": "T10n0293_010:0708c25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：為得充足諸美食者，與說種種集福德門；演說一切離貧窮行，演說富饒甘露財行，演說法智大尊重行，演說相好莊嚴身行，成就威德降魔怨行，成就法喜禪悅食行；增長成就難屈伏行，善能了達無上食行，令得常命，色力安辯，具足法門。",
        "translation": "They are: \"Suppose he teaches various ways to gather merit for those who have enough delicious food, teaches all the practices that free them from poverty, teaches the practice of abundant, nectar-rich possessions, teaches the practice of great respect for the knowledge of the teaching, teaches the practice of a well-appointed body, accomplishes the practice of subduing Māra and resentments with authority, accomplishes the practice of food that brings joy to the Dharma and meditation, develops and accomplishes the practice of subduing difficult situations, and well understands the practice of unsurpassed food, which leads to eternal life, peaceful discernment in appearance, and the fulfillment of the teaching.",
        "source": "T10n0293_010:0708c27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為得充足諸好飲者，與其說法，令於生死捨離渴愛，欣樂佛乘，入深法味；為得充足諸上味者，與其說法，皆令具足，充滿法味，證得如來味中上味；為得充足種種舟船及車乘者，與其宣說出離法門，皆令越度生死大海，載於最勝無上大乘；為得充足諸衣服者，與其說法，令得清淨慚愧之衣，乃至如來清淨妙相，金色皮膚，如是一切資生之物，隨意與之，靡不周贍。",
        "translation": "He teaches those who have obtained enough good drink to abandon craving in birth-and-death, delight in the Buddha vehicle, and enter the profound taste of the Dharma; he teaches those who have obtained enough of the best flavors to make them all adequate, fill them with the taste of the Dharma, and realize the best of the Tathāgata's flavors; he teaches those who have obtained enough of various boats and chariots to teach them the way out, which causes them to cross the ocean of birth-and-death and carry them to the most excellent and unsurpassed great vehicle; he teaches those who have obtained enough of clothing to obtain pure robes of conscience, up to the Tathāgata's pure and marvelous features, golden skin, and all such things that are necessary for life, and gives them as he wishes, making them all available.",
        "source": "T10n0293_010:0709a03_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後悉為如應說法，隨其所宜，各令悟入無上清淨智慧法門，既聞法已，還歸本處。",
        "translation": "He then taught them all as they should be taught, making them each awaken to the unsurpassed pure gate of wisdom according to their own abilities, and after hearing the teaching, they returned to their original place.",
        "source": "T10n0293_010:0709a12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，居士為善財童子顯示菩薩不可思議解脫境界已，告言：「善男子！",
        "translation": "After he had shown the boy of good fortune the unfathomable state of liberation of the bodhisattva, the householder told him, \"Good man!",
        "source": "T10n0293_010:0709a14_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此隨意出生福德藏解脫門，如諸菩薩摩訶薩成就寶手，遍覆十方一切世界，為供養佛普施眾生，以自在力，興種種色寶雲，雨種種色寶雨；所謂：種種色瓔珞、種種色寶冠、種種色妙鬘、種種色世服、種種色法衣、種種色嚴具、種種色寶華、種種色妙香、種種色塗香、種種色末香、種種色樓閣、種種色寶蓋、種種色幢幡、種種色音樂，其聲美妙，歌讚佛法，乃至種種資生之具，普遍一切眾生住處，充滿一切佛剎道場，悉以供養一切諸佛，亦為成熟一切眾生，而我云何能知、能說彼諸功德自在神力？",
        "translation": "我唯知此隨意出生福德藏解脫門，如諸菩薩摩訶薩成就寶手，遍覆十方一切世界，為供養佛普施眾生，以自在力，興種種色寶雲，雨種種色寶雨；所謂：種種色瓔珞、種種色寶冠、種種色妙鬘、種種色世服、種種色法衣、種種色嚴具、種種色寶華、種種色妙香、種種色塗香、種種色末香、種種色樓閣、種種色寶蓋、種種色幢幡、種種色音樂，其聲美妙，歌讚佛法，乃至種種資生之具，普遍一切眾生住處，充滿一切佛剎道場，悉以供養一切諸佛，亦為成熟一切眾生，而我云何能知、能說彼諸功德自在神力？",
        "source": "T10n0293_010:0709a15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_010:0709a27_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方有一大城，名師子宮，彼有長者，名尊法寶髻，汝往彼問菩薩云何學菩薩行，修菩薩道。」",
        "translation": "South of here there's a large city named Shizi Palace, and there's an elder there named Venerable Dharma Jewel Topknot, so go there and ask the bodhisattva how he trains in the bodhisattva practices and cultivates the bodhisattva path.\"",
        "source": "T10n0293_010:0709a27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子歡喜踊躍，深自慶幸，知因一切善知識故，圓滿功德，於善知識，尊重謙卑，如弟子禮。",
        "translation": "The Boy of Good Fortune then rejoiced and jumped for joy, profoundly rejoicing, knowing that he had perfected his virtue because of all the good teachers, and he respected and humbled the good teacher as a disciple.",
        "source": "T10n0293_010:0709a29_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是念：「由此居士，開悟於我，令我得聞希有之法。」",
        "translation": "He had this thought, \"This householder has enlightened me and enabled me to hear this rare teaching.\"",
        "source": "T10n0293_010:0709b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是思惟，不斷愛念善知識見、不壞尊重善知識心、常樂受行善知識教、決定信順善知識語、敬善知識展轉增勝、事善知識心無退轉，頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "Because of this reflection, he constantly retains his mindfulness of the view of the good teacher, doesn't despoil his respect for the good teacher, always happily accepts the good teacher's teaching, is certain to obey the good teacher's words, develops and increases his respect for the good teacher, serves the good teacher with undaunted resolve, salutes his feet, circles him for countless turns, pays respect to him, resigns, and departs.",
        "source": "T10n0293_010:0709b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第十",
        "translation": "Dafangguang fo huayan jing, vol. 10",
        "source": "T10n0293_010:0709b09_0",
        "is_bad_quality": false
    }
]