[
    {
        "source_sentence": "大方廣佛華嚴經卷第六十八",
        "translation": "Dafangguangfo huayan jing roll sixty-eight",
        "source": "T10n0279_068:0365a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "Translated by the Bhikṣuṇī of Khotan, the Tripiṭaka of Khotan",
        "source": "T10n0279_068:0365a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入法界品第三十九之九",
        "translation": "Chapter 39-9 of the Gaṇḍavyūhasūtra",
        "source": "T10n0279_068:0365a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子，大智光明照啟其心，思惟觀察見諸法性，得了知一切言音陀羅尼門，得受持一切法輪陀羅尼門，得與一切眾生作所歸依大悲力，得觀察一切法義理光明門，得充滿法界清淨願，得普照十方一切法智光明，得遍莊嚴一切世界自在力，得普發起一切菩薩業圓滿願。",
        "translation": "At the time, the boy Śubhaji, the light of great wisdom illuminating his mind, contemplated, observed, and saw the nature of all dharmas, attained the dhāraṇī approach of knowing all speech sounds, the dhāraṇī approach of upholding all the Dharma wheels, the great compassionate power of making all sentient beings his refuge, the bright approach of observing the principle of all dharmas, the vow to fill the Dharma realm with pureness, the wisdom light of universal illumination of all dharmas in the ten directions, the sovereign power of adorning all worlds, and the vow to completely initiate all bodhisattva actions.",
        "source": "T10n0279_068:0365a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸次遊行，至險難國寶莊嚴城，處處尋覓婆須蜜多女。",
        "translation": "He gradually marched to the jeweled city of the country of Saddharmapuṇḍarīka and searched everywhere for the Pārasumitra woman.",
        "source": "T10n0279_068:0365b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中有人不知此女功德智慧，作如是念：「今此童子，諸根寂靜，智慧明了，不迷不亂，諦視一尋，無有疲懈，無所取著，目視不瞬，心無所動，甚深寬廣，猶如大海；不應於此婆須蜜女，有貪愛心，有顛倒心，生於淨想，生於欲想；不應為此女色所攝。",
        "translation": "Not knowing this woman's qualities and wisdom, some people in the city had this thought, \"Now, this boy, with his quiet faculties and clear wisdom, isn't confused or distracted, examines one thing with care, isn't fatigued, doesn't cling to anything, looks without blinking, has a mind that's unmoving, and is as deep and wide as the ocean; he shouldn't have cravings for this Vasumitra woman, have a mistaken mind, give rise to perceptions of purity, and give rise to perceptions of desire; he shouldn't be taken in by this woman's form.",
        "source": "T10n0279_068:0365b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「此童子者，不行魔行，不入魔境，不沒欲泥，不被魔縛，不應作處已能不作，有何等意而求此女？」",
        "translation": "\"What intention does that boy have for seeking this woman when he doesn't engage in demonic behavior, doesn't enter the demonic realm, doesn't fall into the mire of desire, isn't bound by demons, and is able to refrain from doing what shouldn't be done?\"",
        "source": "T10n0279_068:0365b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中有人先知此女有智慧者，告善財言：「善哉善哉！",
        "translation": "One of them, who had foreseen that this woman had wisdom, told the good treasure, \"Good, good!",
        "source": "T10n0279_068:0365b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0365b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今乃能推求尋覓婆須蜜女，汝已獲得廣大善利。",
        "translation": "Now that you've been able to pursue the search for Vasumitra, you've attained a great deal of good benefit.",
        "source": "T10n0279_068:0365b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0365b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應決定求佛果位，決定欲為一切眾生作所依怙，決定欲拔一切眾生貪愛毒箭，決定欲破一切眾生於女色中所有淨想。",
        "translation": "You should be certain to seek the Buddhahood, certain to want to be a refuge for all sentient beings, certain to want to remove the poisonous arrow of craving from all sentient beings, and certain to want to destroy all pure thoughts of the female form in all sentient beings.",
        "source": "T10n0279_068:0365b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0365b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆須蜜女於此城內市鄽之北自宅中住。」",
        "translation": "The Vātsumī woman lives in her house to the north of the marketplace in this city.\"",
        "source": "T10n0279_068:0365b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子聞是語已，歡喜踊躍，往詣其門。",
        "translation": "After hearing those words, the boy of good fortune rejoiced and rushed to her door.",
        "source": "T10n0279_068:0365b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見其住宅廣博嚴麗，寶牆、寶樹及以寶塹，一一皆有十重圍遶；其寶塹中，香水盈滿，金沙布地，諸天寶華、優鉢羅華、波頭摩華、拘物頭華、芬陀利華遍覆水上；宮殿、樓閣處處分布，門闥、窓牖相望間列，咸施網鐸，悉置幡幢，無量珍奇以為嚴飾；瑠璃為地，眾寶間錯，燒諸沈水，塗以栴檀，懸眾寶鈴，風動成音，散諸天華遍布其地；種種嚴麗不可稱說，諸珍寶藏其數百千，十大園林以為莊嚴。",
        "translation": "He saw the breadth and splendor of her abode, with its jeweled walls, jeweled trees, and jeweled moats, each surrounded by a ten-fold circumference; in those jeweled moats, perfume filled the air, gold sand spread across the ground, and the water was covered with the jeweled flowers of the gods, the blue lotus, the blue lotus, the white lotus, the white lotus, the white lotus, and the white lotus; palaces and mansions were scattered everywhere, doors and windows looked out from each other, nets were placed, banners and banners were placed, and countless treasures were decorated; the ground was made of beryl, interspersed with many treasures, immersed in immersed water, coated with sandalwood, hung with jeweled bells that made sounds in the wind, and scattered with celestial flowers; all of these things were unspeakably beautiful, and there were hundreds of thousands of treasures stored in ten great groves that were decorated.",
        "source": "T10n0279_068:0365b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財見此女人，顏貌端嚴，色相圓滿，皮膚金色，目髮紺青，不長不短，不麁不細，欲界人、天無能與比；音聲美妙超諸梵世，一切眾生差別言音，悉皆具足，無不解了；深達字義，善巧談說，得如幻智，入方便門；眾寶瓔珞及諸嚴具莊嚴其身，如意摩尼以為寶冠而冠其首；復有無量眷屬圍遶，皆共善根同一行願，福德大藏具足無盡。",
        "translation": "At the time, Shan Cai saw this woman with a beautiful face, a perfectly proportioned complexion, golden skin, and violet hair, neither long nor short, neither crude nor fine, unsurpassed by humans or gods in the desire realm; a voice so beautiful it surpassed those of the Brahmā world; the distinctive speech and sounds of all sentient beings, which were all complete and unintelligible; a deep understanding of the meaning of words, skillful discourse, knowledge of illusions, and entry into the gate of skillful means; a body adorned with many precious jewelry and ornaments, and a crown of jewels made of wish-granting maṇi at its head; and surrounded by measureless retinues, all sharing the same roots of good conduct and vows, the great store of merit was complete and inexhaustible.",
        "source": "T10n0279_068:0365c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆須蜜多女從其身出廣大光明，普照宅中一切宮殿；遇斯光者，身得清涼。",
        "translation": "A vast radiance then emanated from the Vātsumitra woman's body, shining universally in all the palaces in her house; those who encountered that radiance were cooled.",
        "source": "T10n0279_068:0365c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財前詣其所，頂禮其足，合掌而住，白言：「聖者！",
        "translation": "At the time, Shanzai went to her, bowed his head at her feet, put his palms together, and stayed there, saying, \"Sage!",
        "source": "T10n0279_068:0365c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_068:0365c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_068:0365c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能教誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to teach, so please explain it for me!\"",
        "source": "T10n0279_068:0365c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即告言：「善男子！",
        "translation": "He then said, \"Good man!",
        "source": "T10n0279_068:0365c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩解脫，名：離貪欲際，隨其欲樂而為現身。",
        "translation": "\"I've attained the bodhisattva's liberation, which is called freedom from desire, and I will present myself according to their desires and pleasures.",
        "source": "T10n0279_068:0365c15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若天見我，我為天女，形貌、光明殊勝無比；如是乃至人、非人等而見我者，我即為現人、非人女，隨其樂欲皆令得見。",
        "translation": "If a god sees me, I'll be a goddess with an appearance and radiance unsurpassed, and so forth, even if a person or nonperson sees me, I'll be a present person or nonperson woman who follows their desires and makes them visible.",
        "source": "T10n0279_068:0365c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有眾生欲意所纏來詣我所，我為說法，彼聞法已，則離貪欲，得菩薩無著境界三昧；若有眾生暫見於我，則離貪欲，得菩薩歡喜三昧；若有眾生暫與我語，則離貪欲，得菩薩無礙音聲三昧；若有眾生暫執我手，則離貪欲，得菩薩遍往一切佛剎三昧；若有眾生暫昇我座，則離貪欲，得菩薩解脫光明三昧；若有眾生暫觀於我，則離貪欲，得菩薩寂靜莊嚴三昧；若有眾生見我頻申，則離貪欲，得菩薩摧伏外道三昧；若有眾生見我目瞬，則離貪欲，得菩薩佛境界光明三昧；若有眾生抱持於我，則離貪欲，得菩薩攝一切眾生恒不捨離三昧；若有眾生咂我脣吻，則離貪欲，得菩薩增長一切眾生福德藏三昧。",
        "translation": "「若有眾生欲意所纏來詣我所，我為說法，彼聞法已，則離貪欲，得菩薩無著境界三昧；若有眾生暫見於我，則離貪欲，得菩薩歡喜三昧；若有眾生暫與我語，則離貪欲，得菩薩無礙音聲三昧；若有眾生暫執我手，則離貪欲，得菩薩遍往一切佛剎三昧；若有眾生暫昇我座，則離貪欲，得菩薩解脫光明三昧；若有眾生暫觀於我，則離貪欲，得菩薩寂靜莊嚴三昧；若有眾生見我頻申，則離貪欲，得菩薩摧伏外道三昧；若有眾生見我目瞬，則離貪欲，得菩薩佛境界光明三昧；若有眾生抱持於我，則離貪欲，得菩薩攝一切眾生恒不捨離三昧；若有眾生咂我脣吻，則離貪欲，得菩薩增長一切眾生福德藏三昧。",
        "source": "T10n0279_068:0365c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡有眾生親近於我，一切皆得住離貪際，入菩薩一切智地現前無礙解脫。」",
        "translation": "Whenever sentient beings approach me, they'll all abide free of craving and enter the bodhisattva's stage of omniscience and present unobstructed liberation.\"",
        "source": "T10n0279_068:0366a04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「聖者種何善根、修何福業，而得成就如是自在？」",
        "translation": "Shanzai said, \"What good roots did the noble man plant and what meritorious actions did he cultivate that allowed him to achieve such mastery?\"",
        "source": "T10n0279_068:0366a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "They replied, \"Good sons!",
        "source": "T10n0279_068:0366a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念過去，有佛出世，名為：高行；其王都城，名曰：妙門。",
        "translation": "I remembered that in the past, a Buddha appeared in the world named Gao Xing, and his king's capital city was called Miao Men.",
        "source": "T10n0279_068:0366a07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0366a09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼高行如來哀愍眾生，入於王城蹈彼門閫，其城一切悉皆震動，忽然廣博，眾寶莊嚴，無量光明遞相映徹，種種寶華散布其地，諸天音樂同時俱奏，一切諸天充滿虛空。",
        "translation": "When that Gao Xing Tathāgata sympathizes with sentient beings and enters the king's city to traverse its gates, everything in that city shakes and suddenly becomes vast and adorned with multitudes of treasures, measureless lights are reflected in each other, various kinds of precious flowers are scattered on the ground, the music of the gods plays together, and all the gods fill the sky.",
        "source": "T10n0279_068:0366a09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0366a13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼時，為長者妻，名曰：善慧；見佛神力，心生覺悟，則與其夫往詣佛所，以一寶錢而為供養。",
        "translation": "At the time, I was the wife of an elder named Shanhui who, seeing the Buddha's miraculous powers, became enlightened in her mind, so she and her husband went to the Buddha and offered him a precious coin as an offering.",
        "source": "T10n0279_068:0366a13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，文殊師利童子為佛侍者，為我說法，令發阿耨多羅三藐三菩提心。",
        "translation": "At the time, Mañjuśrī was the Buddha's attendant, preaching to me and causing me to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_068:0366a15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0366a17_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此菩薩離貪際解脫。",
        "translation": "\"I only know that this bodhisattva is liberated at the limit of greed.",
        "source": "T10n0279_068:0366a17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，成就無邊巧方便智，其藏廣大，境界無比；而我云何能知能說彼功德行？",
        "translation": "Just like the bodhisattvas, the Mahāsattvas have accomplished limitless skillful expedient wisdom, and their store is vast, with an unsurpassed realm, so how could I know and explain their meritorious actions?",
        "source": "T10n0279_068:0366a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0366a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方有城，名：善度；中有居士，名：鞞瑟胝羅，彼常供養栴檀座佛塔。",
        "translation": "South of here there's a city named Shandu, and there's a householder named Vaiṣṭhila who always makes offerings to the stūpa on a sandalwood throne.",
        "source": "T10n0279_068:0366a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "When you go there, ask, \"How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_068:0366a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無量匝，慇懃瞻仰，辭退而去。",
        "translation": "The Boy of Good Fortune then bowed his head at his feet, circled him measurelessly, paid homage, and withdrew.",
        "source": "T10n0279_068:0366a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子漸次遊行，至善度城，詣居士宅，頂禮其足，合掌而立，白言：「聖者！",
        "translation": "The boy of good fortune then gradually marched to the city of Śāntū, went to the house of the householder, bowed his head at his feet, put his palms together, and stood up, saying, \"Sage!",
        "source": "T10n0279_068:0366a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_068:0366a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_068:0366a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to guide and teach, so please explain it for me!\"",
        "source": "T10n0279_068:0366a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士告言：「善男子！",
        "translation": "The householder told him, \"Good man!",
        "source": "T10n0279_068:0366a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩解脫，名：不般涅槃際。",
        "translation": "I've attained the bodhisattva's liberation, which is called the limit of non-parinirvāṇa.",
        "source": "T10n0279_068:0366a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0366b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不生心言：『如是如來已般涅槃，如是如來現般涅槃，如是如來當般涅槃。』",
        "translation": "I don't give rise to the thought, 'Thus has the Tathāgata already achieved parinirvāṇa, thus is the Tathāgata now achieving parinirvāṇa, and thus will the Tathāgata achieve parinirvāṇa in the future.'",
        "source": "T10n0279_068:0366b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我知十方一切世界諸佛如來，畢竟無有般涅槃者，唯除為欲調伏眾生而示現耳。",
        "translation": "I know that there are ultimately no Tathāgatas or Buddhas in all the worlds of the ten directions who are parinirvāṇa except for those who manifest themselves in order to tame sentient beings.",
        "source": "T10n0279_068:0366b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0366b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我開栴檀座如來塔門時，得三昧，名：佛種無盡。",
        "translation": "When I opened the door of the tathāgata's pagoda on the sandalwood throne, I attained the samādhi called, \"The Buddha's seeds are inexhaustible.",
        "source": "T10n0279_068:0366b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0366b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念念中入此三昧，念念得知一切無量殊勝之事。」",
        "translation": "I enter this concentration in each moment, and I learn all the measureless and extraordinary things in each moment.\"",
        "source": "T10n0279_068:0366b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「此三昧者，境界云何？」",
        "translation": "Sun Cai said, \"What's the object of this concentration?\"",
        "source": "T10n0279_068:0366b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士答言：「善男子！",
        "translation": "The householder replied, \"Good man!",
        "source": "T10n0279_068:0366b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我入此三昧，隨其次第，見此世界一切諸佛，所謂：迦葉佛、拘那含牟尼佛、拘留孫佛、尸棄佛、毘婆尸佛、提舍佛、弗沙佛、無上勝佛、無上蓮華佛；如是等而為上首，於一念頃，得見百佛，得見千佛，得見百千佛，得見億佛、千億佛、百千億佛、阿庾多億佛、那由他億佛，乃至不可說不可說世界微塵數佛，如是一切，次第皆見。",
        "translation": "Entering this concentration, I followed their order and saw all the buddhas of this world, namely, Kāśyapa Buddha, Kanakamuni Buddha, Kauśāmbīpa Buddha, Śikhin Buddha, Vipaśyin Buddha, Tiṣya Buddha, Puṣya Buddha, the unsurpassed Buddha, and the unsurpassed Lotus Buddha, and so forth, as the leader, I was able to see a hundred buddhas, a thousand buddhas, a hundred thousand buddhas, a hundred million buddhas, a hundred billion buddhas, a hundred billion buddhas, Ayodhyā billion buddhas, a hundred million buddhas, and even a tiny number of buddhas in the ineffable and ineffable world, and so forth, all in order.",
        "source": "T10n0279_068:0366b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦見彼佛，初始發心，種諸善根，獲勝神通，成就大願，修行妙行，具波羅蜜，入菩薩地，得清淨忍，摧伏魔軍，成正等覺，國土清淨，眾會圍遶，放大光明，轉妙法輪，神通變現；種種差別，我悉能持，我悉能憶，悉能觀察，分別顯示。",
        "translation": "They also see that Buddha who first arouses the aspiration, plants good roots, acquires extraordinary powers, fulfills the great vows, cultivates wondrous practices, perfects the perfection of conduct, enters the bodhisattva stage, attains pure forbearance, destroys armies of Māra, becomes perfectly enlightened, has a pure land, is surrounded by congregations, magnifies his brilliance, turns the wonderful wheel of the Dharma, and has miraculous powers that manifest, and I'm able to maintain, recall, and examine all of the various distinctions that are discerned.",
        "source": "T10n0279_068:0366b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來彌勒佛等一切諸佛，現在毘盧遮那佛等一切諸佛，悉亦如是。",
        "translation": "All the buddhas of the future, including Maitreya Buddha, and all the buddhas of the present, including Mahāvairocana Buddha, will be likewise.",
        "source": "T10n0279_068:0366b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此世界，十方世界所有三世一切諸佛、聲聞、獨覺、諸菩薩眾，悉亦如是。",
        "translation": "So it is with all the buddhas, śrāvakas, pratyekbuddhas, and bodhisattva congregations of the three worlds in the worlds of the ten directions.",
        "source": "T10n0279_068:0366b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0366b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯得此菩薩所得不般涅槃際解脫。",
        "translation": "\"I have attained only this bodhisattva's liberation at the limit of non-parinirvāṇa.",
        "source": "T10n0279_068:0366b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，以一念智普知三世，一念遍入一切三昧，如來智日恒照其心，於一切法無有分別，了一切佛悉皆平等、如來及我一切眾生等無有二，知一切法自性清淨，無有思慮，無有動轉，而能普入一切世間，離諸分別，住佛法印，悉能開悟法界眾生；而我云何能知能說彼功德行？",
        "translation": "Suppose bodhisattvas, mahāsattvas, with the wisdom of a single thought universally know the three worlds, enter all samādhis with a single thought, have the sun of the Tathāgata's wisdom constantly shining in their minds, have no discrimination among all things, understand that all buddhas are equal, that the Tathāgata and I and all sentient beings are not two, know that the self-nature of all things is pure, have no deliberation, and are not subject to agitation, and are able to universally enter all worlds, part with discrimination, abide in the Buddha's seal of Dharma, and are fully able to enlighten sentient beings in the Dharma realm; how could I know and explain their meritorious conduct?",
        "source": "T10n0279_068:0366b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0366c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方有山，名：補怛洛迦；彼有菩薩，名：觀自在。",
        "translation": "South of here there's a mountain named Potalaka, and there's a bodhisattva there named Avalokitêśvara.",
        "source": "T10n0279_068:0366c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Do you go there and ask, \"How does a bodhisattva train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_068:0366c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說頌言：「海上有山多聖賢，　　眾寶所成極清淨，　華果樹林皆遍滿，　　泉流池沼悉具足。",
        "translation": "He then spoke a verse, saying, \"On the ocean there's a mountain full of sages and virtuous men, made of many treasures that are perfectly pure, full of flowers and fruits, with groves of trees, and fully supplied with springs and pools.",
        "source": "T10n0279_068:0366c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勇猛丈夫觀自在，　　為利眾生住此山；　汝應往問諸功德，　　彼當示汝大方便。」",
        "translation": "That brave man observes sovereignty, so he abides on this mountain for the benefit of sentient beings; you should go there and ask about its merits, and he will show you great skill.\"",
        "source": "T10n0279_068:0366c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無量匝已，慇懃瞻仰，辭退而去。",
        "translation": "The Boy of Good Fortune then bowed his head at his feet, circled him measurelessly, paid homage to him, paid respect to him, and withdrew.",
        "source": "T10n0279_068:0366c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子一心思惟彼居士教，入彼菩薩解脫之藏，得彼菩薩能隨念力，憶彼諸佛出現次第，念彼諸佛相續次第，持彼諸佛名號次第，觀彼諸佛所說妙法，知彼諸佛具足莊嚴，見彼諸佛成正等覺，了彼諸佛不思議業。",
        "translation": "At that point, the boy of good fortune single-mindedly contemplated that householder's teaching, entered that bodhisattva's store of liberation, attained the power of that bodhisattva's mindfulness of following, recalled the sequence of appearances of those buddhas, recalled the sequence of continuity of those buddhas, held the sequence of their names, observed the marvelous Dharma taught by those buddhas, knew the buddhas' complete adornment, saw the buddhas' accomplishment of perfect enlightenment, and comprehended the buddhas' inconceivable actions.",
        "source": "T10n0279_068:0366c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸次遊行，至於彼山，處處求覓此大菩薩。",
        "translation": "He gradually marched up to that mountain and searched everywhere for this great bodhisattva.",
        "source": "T10n0279_068:0366c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見其西面巖谷之中，泉流縈映，樹林蓊欝，香草柔軟，右旋布地。",
        "translation": "He saw a valley to the west of him with a spring flowing in, a grove of trees, and soft herbs spreading out to the right.",
        "source": "T10n0279_068:0366c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀自在菩薩於金剛寶石上結跏趺坐，無量菩薩皆坐寶石恭敬圍遶，而為宣說大慈悲法，令其攝受一切眾生。",
        "translation": "The Bodhisattva of Spontaneous Contemplation was sitting cross-legged on a diamond jewel, surrounded by measureless bodhisattvas sitting on the jewel in respect, and he was teaching the Dharma of great compassion, causing them to take in all sentient beings.",
        "source": "T10n0279_068:0366c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財見已，歡喜踊躍，合掌諦觀，目不暫瞬，作如是念：「善知識者，則是如來；善知識者，一切法雲；善知識者，諸功德藏；善知識者，難可值遇；善知識者，十力寶因；善知識者，無盡智炬；善知識者，福德根芽；善知識者，一切智門；善知識者，智海導師；善知識者，至一切智助道之具。」",
        "translation": "Seeing this, Shanzai rejoiced and jumped for joy, folded his palms and looked closely at them without taking a moment's glance, and had this thought, \"Good teacher, then, is the Tathāgata; good teacher, the cloud of all teachings; good teacher, the store of merits; good teacher, difficult to encounter; good teacher, the cause of the ten treasures of strength; good teacher, the torch of inexhaustible wisdom; good teacher, the root sprout of merit; good teacher, the gate of all wisdom; good teacher, the guide of the ocean of wisdom; good teacher, the aid to the path of attaining all wisdom.\"",
        "source": "T10n0279_068:0366c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便即往詣大菩薩所。",
        "translation": "He then went to the great bodhisattva's place.",
        "source": "T10n0279_068:0366c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，觀自在菩薩遙見善財，告言：「善來！",
        "translation": "At that point, the Bodhisattva Avalokitêśvara saw the good fortune from a distance and told him, \"Well come!",
        "source": "T10n0279_068:0366c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝發大乘意普攝眾生，起正直心專求佛法，大悲深重救護一切，普賢妙行相續現前，大願深心圓滿清淨，勤求佛法悉能領受，積集善根恒無厭足，順善知識不違其教；從文殊師利功德智慧大海所生，其心成熟，得佛勢力；已獲廣大三昧光明，專意希求甚深妙法，常見諸佛生大歡喜，智慧清淨猶如虛空，既自明了復為他說，安住如來智慧光明。」",
        "translation": "You have aroused the intention of the great vehicle to include all sentient beings, arouse a correct and upright mind to focus on the Buddha's teaching, deeply compassionate and caring for all, continuously manifest the marvelous conduct of Samantabhadra, profoundly vowed to perfect and purify your mind, diligently seek to fully receive the Buddha's teaching, constantly accumulate good roots without tire, conform to good teachers and don't disobey their teachings, arise from the ocean of Mañjuśrī's merit and wisdom, mature your mind, and attain the Buddha's power, attain vast radiance in samādhi, intently pursue the profound and wonderful Dharma, become overjoyed at seeing the buddhas, have wisdom as pure as space, understand for yourself and teach for others, and abide in the Tathāgata's wisdom and radiance.\"",
        "source": "T10n0279_068:0366c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子頂禮觀自在菩薩足，遶無數匝，合掌而住，白言：「聖者！",
        "translation": "At the time, the boy Śubhajra bowed his head at the feet of the Bodhisattva Avalokitêśvara, circled him around countless times, put his palms together, and stood down, saying, \"Sage!",
        "source": "T10n0279_068:0367a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_068:0367a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_068:0367a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能教誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to teach, so please explain it for me!\"",
        "source": "T10n0279_068:0367a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩告言：「善哉善哉！",
        "translation": "The bodhisattva told him, \"Good, good!",
        "source": "T10n0279_068:0367a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0367a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已能發阿耨多羅三藐三菩提心。",
        "translation": "You've been able to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_068:0367a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0367a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已成就菩薩大悲行解脫門。",
        "translation": "\"I've accomplished the bodhisattva's liberation through the practice of great compassion.",
        "source": "T10n0279_068:0367a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0367a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以此菩薩大悲行門，平等教化一切眾生相續不斷。",
        "translation": "With this bodhisattva's greatly compassionate practice, I'll teach all sentient beings equally and continuously.",
        "source": "T10n0279_068:0367a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0367a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我住此大悲行門，常在一切諸如來所，普現一切眾生之前。",
        "translation": "\"I abide in this practice of great compassion, remaining in the presence of all tathāgatas and universally present to all sentient beings.",
        "source": "T10n0279_068:0367a16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或以布施，攝取眾生；或以愛語，或以利行，或以同事，攝取眾生；或現色身，攝取眾生；或現種種不思議色淨光明網，攝取眾生；或以音聲，或以威儀，或為說法，或現神變，令其心悟而得成熟；或為化現同類之形，與其共居而成熟之。",
        "translation": "Sometimes I take in sentient beings through generosity, sometimes I take in sentient beings through loving words, sometimes I take in sentient beings through beneficial actions, sometimes I take in sentient beings through coworkers, sometimes I take in sentient beings through the appearance of a physical body, sometimes I take in sentient beings through the appearance of a net of pure radiance of inconceivable form, sometimes I take in sentient beings through sounds, sometimes I take in sentient beings through deportment, sometimes I preach a sermon, sometimes I perform a miraculous transformation that makes their minds awaken and bring them to maturity, and sometimes I take on the form of one of their kind and live with them to bring them to maturity.",
        "source": "T10n0279_068:0367a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0367a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我修行此大悲行門，願常救護一切眾生；願一切眾生，離險道怖，離熱惱怖，離迷惑怖，離繫縛怖，離殺害怖，離貧窮怖，離不活怖，離惡名怖，離於死怖，離大眾怖，離惡趣怖，離黑闇怖，離遷移怖，離愛別怖，離怨會怖，離逼迫身怖，離逼迫心怖，離憂悲怖。",
        "translation": "As I practice this practice of great compassion, may I always protect all sentient beings, and may all sentient beings be freed from the fear of dangerous paths, the fear of fever, the fear of delusion, the fear of bondage, the fear of killing, the fear of poverty, the fear of not being alive, the fear of bad repute, the fear of death, the fear of the masses, the fear of bad destinies, the fear of darkness, the fear of displacement, the fear of separation from what's loved, the fear of association with enemies, the fear of oppression of the body, the fear of oppression of the mind, and the fear of grief and sorrow.",
        "source": "T10n0279_068:0367a23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是願：『願諸眾生，若念於我，若稱我名，若見我身，皆得免離一切怖畏。』",
        "translation": "Again, he made this vow: 'May all sentient beings who think of me, who call me by my name, and who see my body be freed from all fears.'",
        "source": "T10n0279_068:0367a29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0367b01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以此方便，令諸眾生離怖畏已，復教令發阿耨多羅三藐三菩提心永不退轉。",
        "translation": "After I use this method to free sentient beings from fear, I'll also teach them to give rise to the mind of unsurpassed, correct, and complete enlightenment and never turn back.",
        "source": "T10n0279_068:0367b01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0367b03_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯得此菩薩大悲行門。",
        "translation": "\"I've only attained this bodhisattva's approach of great compassion.",
        "source": "T10n0279_068:0367b03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，已淨普賢一切願，已住普賢一切行，常行一切諸善法，常入一切諸三昧，常住一切無邊劫，常知一切三世法，常詣一切無邊剎，常息一切眾生惡，常長一切眾生善，常絕眾生生死流；而我云何能知能說彼功德行？」",
        "translation": "Just as the bodhisattvas, the great beings who have purified all the vows of Samantabhadra, have abided in all the practices of Samantabhadra, always practice all the good qualities, always enter all the samādhis, always abide in all the limitless eons, always know all the three worldly dharmas, always visit all the limitless bases, always calm all the evils of sentient beings, always nurture the goodness of all sentient beings, and always stop the flow of birth-and-death of sentient beings, how could I know and explain their meritorious actions?\"",
        "source": "T10n0279_068:0367b04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，東方有一菩薩，名曰：正趣，從空中來，至娑婆世界輪圍山頂，以足按地；其娑婆世界六種震動，一切皆以眾寶莊嚴。",
        "translation": "It was then that a bodhisattva named Right Destiny came from the sky in the east, reached the top of the Śrāvastī mountain range, and pressed his feet to the ground; the Śrāvastī world was shaken in six ways, and everything was adorned with various treasures.",
        "source": "T10n0279_068:0367b09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正趣菩薩放身光明，映蔽一切日、月、星、電，天龍八部、釋、梵、護世所有光明皆如聚墨；其光普照一切地獄、畜生、餓鬼、閻羅王處，令諸惡趣，眾苦皆滅，煩惱不起，憂悲悉離。",
        "translation": "The Bodhisattva of Right Destiny radiates his body in a bright light that reflects off all the sun, moon, stars, and lightning, and all the lights of the gods, dragons, eight families, Śākyamunis, Brahmās, and world protectors are like a mass of ink; his light shines universally in all hells, animals, hungry ghosts, and the realm of Yama, causing all the miseries of the bad destinies to cease, afflictions to cease, and sorrow and pity to be fully removed.",
        "source": "T10n0279_068:0367b12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於一切諸佛國土，普雨一切華香、瓔珞、衣服、幢蓋；如是所有諸莊嚴具，供養於佛。",
        "translation": "In all the buddha lands, it also rains down flowers, fragrances, jewelry, clothing, and banners, and all such adornments are offered to the buddhas.",
        "source": "T10n0279_068:0367b16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復隨眾生心之所樂，普於一切諸宮殿中而現其身，令其見者皆悉歡喜，然後來詣觀自在所。",
        "translation": "He also follows the desires of sentient beings and shows himself in all the palaces and halls, making all who see him rejoice, and then comes to Avalokitêśvara.",
        "source": "T10n0279_068:0367b18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，觀自在菩薩告善財言：「善男子！",
        "translation": "The Bodhisattva Avalokitêśvara then addressed Śubhajra, saying, \"Good sons!",
        "source": "T10n0279_068:0367b20_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見正趣菩薩來此會不？」",
        "translation": "Have you seen the Bodhisattva of the Right Path come to this meeting?\"",
        "source": "T10n0279_068:0367b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「已見。」",
        "translation": "He said, \"I've seen it.\"",
        "source": "T10n0279_068:0367b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告言：「善男子！",
        "translation": "He told them, \"Good sons!",
        "source": "T10n0279_068:0367b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可往問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "May you go and ask, 'How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?'\"",
        "source": "T10n0279_068:0367b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子敬承其教，遽即往詣彼菩薩所，頂禮其足，合掌而立，白言：「聖者！",
        "translation": "At that point, the Boy of Good Fortune, respectfully acknowledging his teaching, rushed over to that bodhisattva, bowed his head at his feet, stood with his palms together, and said, \"Sage!",
        "source": "T10n0279_068:0367b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_068:0367b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_068:0367b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能教誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to teach, so please explain it for me!\"",
        "source": "T10n0279_068:0367b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正趣菩薩言：「善男子！",
        "translation": "The bodhisattva in the right destiny said, \"Good sons!",
        "source": "T10n0279_068:0367b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩解脫，名：普門速疾行。」",
        "translation": "I've attained the bodhisattva's liberation, which is called the \"swift practice of the universal gate.\"",
        "source": "T10n0279_068:0367b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財言：「聖者！",
        "translation": "Shanzai said, \"Sage!",
        "source": "T10n0279_068:0367b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於何佛所得此法門？",
        "translation": "Which Buddha has received this teaching?",
        "source": "T10n0279_068:0367b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所從來剎，去此幾何？",
        "translation": "Where did the bases come from, and how far did they go?",
        "source": "T10n0279_068:0367c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發來久如？」",
        "translation": "How long has it been since it was produced?\"",
        "source": "T10n0279_068:0367c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告言：「善男子！",
        "translation": "He said, \"Good sons!",
        "source": "T10n0279_068:0367c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事難知，一切世間天、人、阿脩羅、沙門、婆羅門等所不能了；唯勇猛精進無退無怯諸菩薩眾，已為一切善友所攝、諸佛所念，善根具足，志樂清淨，得菩薩根，有智慧眼，能聞能持，能解能說。」",
        "translation": "This is difficult to know and cannot be comprehended by all worldly gods, humans, ascetics, ascetics, priests, and so forth; only those bodhisattvas who are courageous and energetic, have no retrogression or timidity, are included in all good friends, are mindful of the buddhas, have perfect good roots, have pure intentions, have attained bodhisattva roots, have the eye of wisdom, and are able to hear and retain and to understand and speak.\"",
        "source": "T10n0279_068:0367c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財言：「聖者！",
        "translation": "Shanzai said, \"Sage!",
        "source": "T10n0279_068:0367c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我承佛神力、善知識力，能信能受，願為我說！」",
        "translation": "I inherit the Buddha's spiritual power and the power of good teachers who can believe and accept it, so please explain it for me!\"",
        "source": "T10n0279_068:0367c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正趣菩薩言：「善男子！",
        "translation": "The bodhisattva in the right destiny said, \"Good sons!",
        "source": "T10n0279_068:0367c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從東方妙藏世界普勝生佛所而來此土，於彼佛所得此法門，從彼發來已經不可說不可說佛剎微塵數劫，一一念中舉不可說不可說佛剎微塵數步，一一步過不可說不可說世界微塵數佛剎。",
        "translation": "I came to this land from the place of the Universally Victorious Birth Buddha in the eastern Sumeru world, where I received this teaching from that Buddha, and since then I've arisen from that Buddha and have been in ineffable and ineffable buddha bases for a number of dusty eons, lifted ineffable and ineffable buddha bases in a number of dusty steps with each thought, and passed through ineffable and ineffable buddha bases in the world in a number of dusty steps with each step.",
        "source": "T10n0279_068:0367c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一佛剎，我皆遍入，至其佛所，以妙供具而為供養；此諸供具，皆是無上心所成，無作法所印，諸如來所忍，諸菩薩所歎。",
        "translation": "I've entered every single one of those buddha-blocks, gone to each one, made offerings to them with marvelous provisions, and made those offerings because they were made by the unsurpassed mind, sealed by unconstructed dharmas, tolerated by tathāgatas, and praised by bodhisattvas.",
        "source": "T10n0279_068:0367c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0367c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我又普見彼世界中一切眾生，悉知其心，悉知其根，隨其欲解，現身說法，或放光明，或施財寶，種種方便，教化調伏，無有休息。",
        "translation": "I also see all the sentient beings in that world, know their minds and know their faculties, and according to their desires, I present myself to teach, shine a light, give treasure, and do various things to teach and tame them without rest.",
        "source": "T10n0279_068:0367c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如從東方，南、西、北方，四維、上、下，亦復如是。",
        "translation": "Suppose he goes from the east, south, west, north, the four counterpoints, up, and down, and so it is.",
        "source": "T10n0279_068:0367c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0367c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯得此菩薩普疾行解脫，能疾周遍到一切處。",
        "translation": "\"I've only attained the liberation of this bodhisattva who quickly practices and is able to quickly reach all places.",
        "source": "T10n0279_068:0367c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，普於十方無所不至，智慧境界等無差別，善布其身悉遍法界，至一切道，入一切剎，知一切法，到一切世，平等演說一切法門，同時照耀一切眾生，於諸佛所不生分別，於一切處無有障礙；而我云何能知能說彼功德行？",
        "translation": "Just like the bodhisattvas, they reach everywhere in the ten directions, have equality and non-differentiation in their states of wisdom, skillfully distribute their bodies throughout the Dharma realm, reach all paths, enter all buddhas, know all things, go to all worlds, equally expound all teachings, and simultaneously illuminate all sentient beings, making no distinctions among buddha-places and having no obstructions in any place, so how could I know and explain their meritorious conduct?",
        "source": "T10n0279_068:0367c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0367c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方有城，名：墮羅鉢底；其中有神，名曰：大天。",
        "translation": "South of here there's a city named Dvārapati, and within it there's a god named Mahādeva.",
        "source": "T10n0279_068:0367c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go there and ask, \"How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_068:0367c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "The Boy of Good Fortune then bowed his head at his feet, circled him measureless times, paid homage to him, and withdrew.",
        "source": "T10n0279_068:0367c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子入菩薩廣大行，求菩薩智慧境，見菩薩神通事，念菩薩勝功德，生菩薩大歡喜，起菩薩堅精進，入菩薩不思議自在解脫，行菩薩功德地，觀菩薩三昧地，住菩薩總持地，入菩薩大願地，得菩薩辯才地，成菩薩諸力地。",
        "translation": "At that point, the boy of good fortune entered the vast practice of the bodhisattva, sought the bodhisattva's sphere of wisdom, saw the bodhisattva's miraculous abilities, remembered the bodhisattva's superior virtues, became greatly elated, arouse the bodhisattva's resolute effort, entered the bodhisattva's inconceivable freedom and liberation, practiced the bodhisattva's stage of merit, observed the bodhisattva's stage of concentration, abided in the bodhisattva's stage of mastery, entered the bodhisattva's stage of great vows, attained the bodhisattva's stage of eloquence, and became a bodhisattva in the stage of powers.",
        "source": "T10n0279_068:0368a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸次遊行，至於彼城，推問大天今在何所？",
        "translation": "He gradually marched over to that city and asked, \"Where is the great god now?",
        "source": "T10n0279_068:0368a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人咸告言：「在此城內，現廣大身，為眾說法。」",
        "translation": "Everyone told him, \"Here in this city, he has shown himself to be vast and speaks to the people.\"",
        "source": "T10n0279_068:0368a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財至大天所，頂禮其足，於前合掌而作是言：「聖者！",
        "translation": "It was then that Shanzai went to the great god, bowed his head at his feet, put his palms together, and said, \"Sage!",
        "source": "T10n0279_068:0368a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_068:0368a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_068:0368a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能教誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to teach, so please explain it for me!\"",
        "source": "T10n0279_068:0368a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大天長舒四手，取四大海水自洗其面，持諸金華以散善財，而告之言：「善男子！",
        "translation": "At that point, the great god spread out his four hands, took the four large rivers of water and washed his own face, held gold flowers and scattered them for good buys, and told him, \"Good man!",
        "source": "T10n0279_068:0368a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩，難可得見，難可得聞，希出世間，於眾生中最為第一，是諸人中芬陀利華，為眾生歸，為眾生救，為諸世間作安隱處，為諸世間作大光明，示迷惑者安隱正道；為大導師，引諸眾生入佛法門；為大法將，善能守護一切智城。",
        "translation": "All bodhisattvas are difficult to see and difficult to hear, rare in the world, the greatest among sentient beings, the best among people, the puṇḍarīka, who gives refuge to sentient beings, saves sentient beings, makes a peaceful place for the world, creates a great radiance for the world, shows the deluded the right path to stability, is a great guide, leads sentient beings into the Buddha's teaching, and is a great Dharma general who skillfully guards the city of all wisdom.",
        "source": "T10n0279_068:0368a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是難可值遇，唯身、語、意無過失者，然後乃得見其形像、聞其辯才，於一切時常現在前。",
        "translation": "Such a bodhisattva is difficult to meet, except for one who has no faults with body, speech, or thought, and then one can see his image, hear his eloquence, and always appear before him at all times.",
        "source": "T10n0279_068:0368a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0368a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已成就菩薩解脫，名為：雲網。」",
        "translation": "I've accomplished the bodhisattva's liberation, which is called, 'Cloud Net.'\"",
        "source": "T10n0279_068:0368a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財言：「聖者！",
        "translation": "Shanzai said, \"Sage!",
        "source": "T10n0279_068:0368a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雲網解脫境界云何？」",
        "translation": "What is the sphere of the cloud net of liberation?\"",
        "source": "T10n0279_068:0368a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大天於善財前，示現金聚、銀聚、瑠璃聚、玻瓈聚、硨磲聚、碼碯聚、大焰寶聚、離垢藏寶聚、大光明寶聚、普現十方寶聚、寶冠聚、寶印聚、寶瓔珞聚、寶璫聚、寶釧聚、寶鎖聚、珠網聚、種種摩尼寶聚、一切莊嚴具聚、如意摩尼聚，皆如大山；又復示現一切華、一切鬘、一切香、一切燒香、一切塗香、一切衣服、一切幢幡、一切音樂、一切五欲娛樂之具，皆如山積；及現無數百千萬億諸童女眾。",
        "translation": "At the time, the great god showed Sun Cai a gold cluster, a silver cluster, a lapis lazuli cluster, a glass cluster, a coral cluster, an agate cluster, a great cluster of flaming treasures, a cluster of treasures free of stains, a cluster of great radiant treasures, a cluster of treasures in ten directions, a cluster of jeweled crowns, a cluster of jeweled seals, a cluster of jeweled jewelry, a cluster of jeweled flags, a cluster of jeweled pins, a cluster of jeweled chains, a cluster of beads and nets, a cluster of various maṇi treasures, a cluster of all ornaments, and a cluster of wishful thinking maṇi, all of which were like a great mountain; and he also showed a cluster of all flowers, all garlands, all incense, all burning incense, all perfumes, all clothing, all banners and streamers, all music, and all the five implements of sexual pleasure, all of which were like mountains.",
        "source": "T10n0279_068:0368a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼大天告善財言：「善男子！",
        "translation": "The great celestial addressed Sun Cai, saying, \"Good sons!",
        "source": "T10n0279_068:0368b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可取此物，供養如來，修諸福德，并施一切，攝取眾生，令其修學檀波羅蜜，能捨難捨。",
        "translation": "You can take this thing, make offerings to the Tathāgata, cultivate virtue, and give it to all living beings to cultivate the perfection of giving and the ability to relinquish what's difficult to relinquish.",
        "source": "T10n0279_068:0368b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0368b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我為汝，示現此物，教汝行施；為一切眾生悉亦如是，皆令以此善根熏習，於三寶所、善知識所，恭敬供養，增長善法，發於無上菩提之意。",
        "translation": "Just as I showed you this thing and taught you to give it, so I will do the same for all sentient beings, causing them to cultivate these good roots, honor and make offerings to the Three Treasures and good teachers, grow in good qualities, and give rise to the intention of unsurpassed bodhi.",
        "source": "T10n0279_068:0368b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0368b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生貪著五欲，自放逸者，為其示現不淨境界；若有眾生瞋恚、憍慢、多諍競者，為其示現極可怖形，如羅剎等飲血噉肉；令其見已，驚恐惶懼，心意調柔，捨離怨結。",
        "translation": "If there are sentient beings who crave the five desires and are careless, show them the unclean realm; if there are sentient beings who are angry, arrogant, and contentious, show them a most fearful shape like a Rāṣṇa who eats blood and eats flesh; cause them to be frightened and fearful when they see it, so they will pacify their minds and free themselves from the bond of enmity.",
        "source": "T10n0279_068:0368b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生惛沈、懶惰，為其示現王、賊、水、火及諸重疾；令其見已，心生惶怖，知有憂苦而自勉策。",
        "translation": "If there are sentient beings who are depressed and lazy, show them the king, thieves, water, fire, and other serious illnesses; cause them to become frightened when they see them, know that they have sorrow and suffering, and then make effort on their own.",
        "source": "T10n0279_068:0368b12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是等種種方便，令捨一切諸不善行，修行善法；令除一切波羅蜜障，具波羅蜜；令超一切障礙險道，到無障處。",
        "translation": "With these kinds of methods, they cause them to abandon all unskillful actions and cultivate good qualities, remove all the arhat hindrances and perfect the arhat, and transcend all obstacles and dangerous paths to reach a place without obstacles.",
        "source": "T10n0279_068:0368b14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0368b17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此雲網解脫。",
        "translation": "\"I only know the liberation of this cloud net.",
        "source": "T10n0279_068:0368b17_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，猶如帝釋，已能摧伏一切煩惱阿脩羅軍；猶如大水，普能消滅一切眾生諸煩惱火；猶如猛火，普能乾竭一切眾生諸愛欲水；猶如大風，普能吹倒一切眾生諸見取幢；猶如金剛，悉能摧破一切眾生諸我見山。",
        "translation": "Suppose bodhisattvas, like Indra, have been able to subdue all the armies of the afflicted asuras; like great waters that universally quench the fires of affliction in all sentient beings; like fierce fires that universally dry up the waters of craving in all sentient beings; like a great wind that universally blows down the banners of views and grasping of opinions in all sentient beings; like adamant that fully destroys the mountains of self-view in all sentient beings.",
        "source": "T10n0279_068:0368b17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我云何能知能說彼功德行？",
        "translation": "How can I know and explain their meritorious actions?",
        "source": "T10n0279_068:0368b22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0368b23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此閻浮提摩竭提國菩提場中，有主地神，其名：安住。",
        "translation": "In the site of enlightenment in this Jambudvīpa country, there's a lord deity of the grounds whose name is Anjou.",
        "source": "T10n0279_068:0368b23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "When you go there, ask, \"How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_068:0368b24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子禮大天足，遶無數匝，辭退而去。",
        "translation": "The Boy of Good Fortune then bowed his head at the feet of the Mahādeva, circled him measureless times, withdrew, and departed.",
        "source": "T10n0279_068:0368b25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子漸次遊行，趣摩竭提國菩提場內安住神所，百萬地神同在其中，更相謂言：「此來童子即是佛藏，必當普為一切眾生作所依處，必當普壞一切眾生無明[穀-禾+卵]藏。",
        "translation": "At that point, the boy of good fortune gradually marched over to the abode of the gods inside the site of enlightenment in Magadhātu, where a million earth deities were present together, and they all said to each other, \"This boy here is the Buddha's storehouse, which will surely serve as a base for all sentient beings and will surely destroy the store of ignorance [grain - grain + egg] in all sentient beings.",
        "source": "T10n0279_068:0368b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人已生法王種中，當以離垢無礙法繒而冠其首，當開智慧大珍寶藏，摧伏一切邪論異道。」",
        "translation": "This person has been born among the seed of the Dharma king, and he will be crowned with the immaculate, unobstructed Dharma silks, which will open up a great treasury of wisdom and destroy all mistaken beliefs and divergent paths.\"",
        "source": "T10n0279_068:0368c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，安住等百萬地神，放大光明，遍照三千大千世界，普令大地同時震吼，種種寶物處處莊嚴，影潔光流遞相鑒徹；一切葉樹俱時生長，一切華樹咸共開敷，一切果樹靡不成熟，一切河流遞相灌注，一切池沼悉皆盈滿；雨細香雨遍灑其地，風來吹華普散其上，無數音樂一時俱奏，天莊嚴具咸出美音；牛王、象王、師子王等，皆生歡喜，踊躍、哮吼，猶如大山相擊出聲；百千伏藏自然踊現。",
        "translation": "When that happened, a million earth spirits, including Anzhe, radiated their brilliance, shining brightly throughout the 3,000 great thousand worlds, causing the whole earth to simultaneously roar, various treasures to be adorned everywhere, and their shadows, cleanliness, and luminosity to flow together and penetrate; all the leafy trees to grow at once, all the flowering trees to bloom together, all the fruit-bearing trees to ripen, all the rivers to flow together, and all the ponds to be filled; fine, fragrant rain to sprinkle the ground, flowers to blow in the wind to scatter everywhere, countless music to be played at once, and the adornments of the gods to produce beautiful sounds; the king of cattle, the king of elephants, and the lion king all rejoicing, jumping and roaring like great mountains striking each other with sound; and a hundred thousand hidden treasures to naturally spring forth.",
        "source": "T10n0279_068:0368c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，安住地神告善財言：「善來童子！",
        "translation": "The god of the entrenchment then addressed Shanzai, saying, \"Well come, boy!",
        "source": "T10n0279_068:0368c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於此地曾種善根，我為汝現，汝欲見不？」",
        "translation": "You have planted good roots here, and I will show them for you; do you want to see them?\"",
        "source": "T10n0279_068:0368c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財禮地神足，遶無數匝，合掌而立，白言：「聖者！",
        "translation": "At that point, the good treasure worshipped the feet of the earth spirit, circled him for countless turns, stood with his palms together, and said, \"Sage!",
        "source": "T10n0279_068:0368c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然！",
        "translation": "Only!",
        "source": "T10n0279_068:0368c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲見。」",
        "translation": "I want to see it.\"",
        "source": "T10n0279_068:0368c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，安住地神以足按地，百千億阿僧祇寶藏自然踊出，告言：「善男子！",
        "translation": "Then, the earth spirit who was staying put pressed his foot against the ground, and a hundred billion incalculable treasures naturally sprang forth and told him, \"Good man!",
        "source": "T10n0279_068:0368c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此寶藏隨逐於汝，是汝往昔善根果報，是汝福力之所攝受，汝應隨意自在受用。",
        "translation": "Now, this treasure store following you around is the result of your good roots in the past, and it's the result of your good qualities that you should enjoy as you wish.",
        "source": "T10n0279_068:0368c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0368c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩解脫，名：不可壞智慧藏，常以此法成就眾生。",
        "translation": "I've attained the bodhisattva's liberation, which is called the indestructible store of wisdom, and I've always accomplished sentient beings' success with this teaching.",
        "source": "T10n0279_068:0368c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0368c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我憶自從然燈佛來，常隨菩薩，恭敬守護，觀察菩薩所有心行、智慧境界、一切誓願、諸清淨行、一切三昧、廣大神通、大自在力、無能壞法，遍往一切諸佛國土，普授一切諸如來記，轉於一切諸佛法輪，廣說一切修多羅門，大法光明普皆照耀，教化調伏一切眾生，示現一切諸佛神變，我皆能領受、皆能憶持。",
        "translation": "I remember that since the Randana Buddha came, I've always followed the bodhisattva, respected and guarded him, observed all his mental functions, his state of wisdom, all his vows, his pure practices, all his samādhis, his vast supernormal powers, his great unhindered abilities, his incapability of destroying things, traveled to all the buddha lands, granted universal assurance of the Tathāgata's remembrance, turned the Dharma wheel of all the buddhas, explained in detail all the sūtra teachings, shone with the light of the great Dharma, taught, disciplined, and disciplined all sentient beings, and manifested all the buddha's miracles, all of which I've been able to comprehend and recall.",
        "source": "T10n0279_068:0368c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0368c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古世，過須彌山微塵數劫，有劫名：莊嚴，世界名：月幢，佛號：妙眼，於彼佛所得此法門。",
        "translation": "It was an eon ago, past a dusty eon on Mount Sumeru, when there was an eon named Adorned, a world named Moonraker, and a Buddha named Marvelous Eye, that Buddha attained this teaching.",
        "source": "T10n0279_068:0368c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0369a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於此法門，若入若出修習增長，常見諸佛未曾捨離，始從初得乃至賢劫，於其中間，值遇不可說不可說佛剎微塵數如來、應、正等覺，悉皆承事，恭敬供養；亦見彼佛詣菩提座，現大神力；亦見彼佛所有一切功德善根。",
        "translation": "In this teaching, I've cultivated and grown in cultivation whether entering or leaving, and I've often seen buddhas I've never abandoned, from the time I first attained it until the good eon when I met an inexplicable and ineffable number of buddha-tathāgatas, worthies, and correct enlightened ones, all of whom I served, respected, and made offerings to; I've also seen those buddhas ascend to the throne of enlightenment and display great supernormal powers; and I've seen all the merits and good roots of those buddhas.",
        "source": "T10n0279_068:0369a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0369a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此不可壞智慧藏法門。",
        "translation": "\"I only know this dharma-gate of the indestructible store of wisdom.",
        "source": "T10n0279_068:0369a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩常隨諸佛，能持一切諸佛所說，入一切佛甚深智慧，念念充遍一切法界，等如來身，生諸佛心，具諸佛法，作諸佛事；而我云何能知能說彼功德行？",
        "translation": "Just as bodhisattvas, mahāsattvas, and buddhas always follow them, they can retain the teachings of all buddhas, enter into the profound wisdom of all buddhas, mindfully fill all the Dharma realms, equal the body of the Tathāgata, give rise to the minds of buddhas, embody the teachings of buddhas, and perform the works of buddhas; how can I know and explain their meritorious actions?",
        "source": "T10n0279_068:0369a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0369a11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此閻浮提摩竭提國迦毘羅城，有主夜神，名：婆珊婆演底。",
        "translation": "In this city of Kapilavastu in Mahākauṣṭhila, there's a night guardian named Vātsīpaṇi.",
        "source": "T10n0279_068:0369a11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "When you visit him, ask, \"How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_068:0369a12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子禮地神足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "The Boy of Good Fortune then bowed his head at the feet of the earth spirit, circled him measureless times, paid homage to him, and withdrew.",
        "source": "T10n0279_068:0369a13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子一心思惟安住神教，憶持菩薩不可沮壞智藏解脫，修其三昧，學其軌則，觀其遊戲，入其微妙，得其智慧，達其平等，知其無邊，測其甚深。",
        "translation": "At the time, the boy of good fortune single-mindedly contemplated the abiding spirit's teaching, recalled the bodhisattva's indestructible liberation of the store of wisdom, cultivated his samādhi, studied his principles, observed his play, entered his subtleties, attained his wisdom, attained his equality, knew his limitlessness, and fathomed his great depth.",
        "source": "T10n0279_068:0369a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸次遊行，至於彼城，從東門入，佇立未久，便見日沒。",
        "translation": "He gradually marched up to that city, entered through the eastern gate, and before standing there for a long time, he saw the sun disappear.",
        "source": "T10n0279_068:0369a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心念隨順諸菩薩教，渴仰欲見彼主夜神，於善知識生如來想，復作是念：「由善知識得周遍眼，普能明見十方境界；由善知識得廣大解，普能了達一切所緣；由善知識得三昧眼，普能觀察一切法門；由善知識得智慧眼，普能明照十方剎海。」",
        "translation": "With mindfulness of following the teachings of the bodhisattvas, he longed to see that lord of the night, and he gave rise to the Tathāgata conception of a good teacher and again thought, \"A good teacher has attained the all-seeing eye, which can universally see the realms in ten directions; a good teacher has attained a vast understanding, which can universally comprehend all perceptual objects; a good teacher has attained the samādhi eye, which can universally observe all dharma-gates; and a good teacher has attained the wisdom eye, which can universally illuminate the sea of buddhas in ten directions.\"",
        "source": "T10n0279_068:0369a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念時，見彼夜神於虛空中，處寶樓閣香蓮華藏師子之座，身真金色，目髮紺青，形貌端嚴，見者歡喜，眾寶瓔珞以為嚴飾，身服朱衣，首戴梵冠，一切星宿炳然在體。",
        "translation": "When he thought this, he saw that night god sitting in the sky on the lotus treasury lion throne in a jeweled tower with a true gold body, violet hair, and a dignified appearance that made those who saw him rejoice, adorned with a multitude of jewelry, wearing a vermilion robe and a brahma crown, and with all the stars shining brightly on his body.",
        "source": "T10n0279_068:0369a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其身上一一毛孔，皆現化度無量無數惡道眾生，令其免離險難之像；是諸眾生，或生人中，或生天上，或有趣向二乘菩提，或有修行一切智道。",
        "translation": "In each pore of his body, he behaves like he's saving measureless and countless sentient beings in the evil destinies from harm and trouble, and some of those sentient beings are born among humans, some are born in the heavens, some are headed toward bodhi in the two vehicles, and some are cultivating the path of omniscience.",
        "source": "T10n0279_068:0369b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼一一諸毛孔中，示現種種教化方便，或為現身，或為說法，或為示現聲聞乘道，或為示現獨覺乘道，或為示現諸菩薩行、菩薩勇猛、菩薩三昧、菩薩自在、菩薩住處、菩薩觀察、菩薩師子頻申、菩薩解脫遊戲，如是種種成熟眾生。",
        "translation": "In each of those pores, they show various teaching techniques, either for presenting themselves, teaching Dharma, showing the path of the śrāvaka vehicle, showing the path of the pratyekabuddha vehicle, or showing the bodhisattva practices, bodhisattva boldness, bodhisattva samādhi, bodhisattva mastery, bodhisattva abodes, bodhisattva observation, bodhisattva lion frequency, bodhisattva liberating play, and so forth, to ripen sentient beings.",
        "source": "T10n0279_068:0369b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財童子見聞此已，心大歡喜，以身投地，禮夜神足，遶無數匝，於前合掌而作是言：「聖者！",
        "translation": "After he heard this, the boy Sun Cai rejoiced greatly, threw himself to the ground, bowed his head at the feet of the god Yama, circled him measureless times, put his palms together in front of him, and said, \"Sage!",
        "source": "T10n0279_068:0369b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，我心冀望依善知識獲諸如來功德法藏。",
        "translation": "Having first aroused the mind of unsurpassed, correct enlightenment, I'm hoping to rely on a good teacher to acquire the treasury of the Tathāgata's merits and teachings.",
        "source": "T10n0279_068:0369b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願示我一切智道，我行於中，至十力地！」",
        "translation": "Please show me the path of omniscience, in which I will practice and reach the ten stages of power!\"",
        "source": "T10n0279_068:0369b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼夜神告善財言：「善哉善哉！",
        "translation": "The night god then addressed the good treasure, saying, \"Good, good!",
        "source": "T10n0279_068:0369b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0369b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能深心敬善知識，樂聞其語，修行其教；以修行故，決定當得阿耨多羅三藐三菩提。",
        "translation": "You can deeply honor a good teacher, gladly listen to his words, and cultivate his teachings; as a result of your practice, you'll surely attain supreme perfect enlightenment.",
        "source": "T10n0279_068:0369b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0369b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩破一切眾生癡暗法光明解脫。",
        "translation": "\"I've attained the bodhisattva's liberation through the brightness of the Dharma that destroys the delusion of all sentient beings.",
        "source": "T10n0279_068:0369b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0369b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於惡慧眾生，起大慈心；於不善業眾生，起大悲心；於作善業眾生，起於喜心；於善惡二行眾生，起不二心；於雜染眾生，起令生清淨心；於邪道眾生，起令生正行心；於劣解眾生，起令興大解心；於樂生死眾生，起令捨輪轉心；於住二乘道眾生，起令住一切智心。",
        "translation": "I will give rise to a mind of great kindness for sentient beings with bad wisdom, a mind of great compassion for sentient beings with unskillful actions, a mind of joy for sentient beings doing good actions, a mind of nonduality for sentient beings doing both good and bad actions, a mind to cause sentient beings with defilements to become pure, a mind to cause sentient beings in the wrong path to develop right practices, a mind to cause sentient beings with poor understanding to develop great understanding, a mind to cause sentient beings who are comfortable with birth and death to abandon transmigration, and a mind to cause sentient beings abiding in the two-vehicle path to abide in omniscience.",
        "source": "T10n0279_068:0369b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_068:0369b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以得此解脫故，常與如是心共相應。",
        "translation": "Because I've attained this liberation, I'll always be associated with such a mind.",
        "source": "T10n0279_068:0369b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0369b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於夜闇人靜，鬼、神、盜賊、諸惡眾生所遊行時，密雲重霧、惡風暴雨、日月星宿並皆昏蔽不見色時，見諸眾生，若入於海，若行於陸，山林、曠野、諸險難處，或遭盜賊，或乏資糧，或迷惑方隅，或忘失道路，慞惶憂怖不能自出；我時即以種種方便而救濟之。",
        "translation": "When it's dark at night and people are quiet, and when ghosts, spirits, thieves, and other unwholesome beings are parading about, and when dense clouds and heavy fog, bad winds and heavy rain, and the sun, moon, and stars are all obscured from view, I see sentient beings who have entered the sea, are traveling on land, or are in mountain forests or wildernesses or places of difficulty, or who have been robbed or plundered, are confused about their direction, or have forgotten their path, and are perplexed and frightened and unable to escape on their own; I then rescue them with various methods.",
        "source": "T10n0279_068:0369b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「為海難者，示作船師、魚王、馬王、龜王、象王、阿脩羅王及以海神；為彼眾生，止惡風雨，息大波浪，引其道路，示其洲岸，令免怖畏，悉得安隱。",
        "translation": "\"For someone in trouble at sea, I'll show them how to be a shipmaster, a fish king, a horse king, a turtle king, an elephant king, an asura king, and a sea god; I'll stop bad winds and rain, calm large waves, guide their path, and show them the shore, freeing them from fear and allowing them to be completely at ease.",
        "source": "T10n0279_068:0369c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『以此善根，迴施眾生，願令捨離一切諸苦。』",
        "translation": "Again, they think, 'This is a way to return good roots to sentient beings, in the hope that they'll be freed from all suffering.'",
        "source": "T10n0279_068:0369c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「為在陸地一切眾生於夜暗中遭恐怖者，現作日月及諸星宿、晨霞、夕電種種光明，或作屋宅，或為人眾，令其得免恐怖之厄。",
        "translation": "\"For all the sentient beings on land who are terrified in the darkness of the night, he creates a variety of lights from the sun and moon, the stars, the morning sun, and the evening lightning, or he makes them into homes or people, so that they're spared the trouble of fear.",
        "source": "T10n0279_068:0369c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『以此善根，迴施眾生，悉令除滅諸煩惱暗。』",
        "translation": "Again, he thinks, 'This good root will be given back to sentient beings, so that the darkness of their afflictions will be removed.'",
        "source": "T10n0279_068:0369c09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生，有惜壽命，有愛名聞，有貪財寶，有重官位，有著男女，有戀妻妾，未稱所求，多生憂怖；我皆救濟，令其離苦。",
        "translation": "All sentient beings who cherish longevity, love fame and reputation, covet wealth and treasure, value official positions, are attached to men and women, and are fond of wives and concubines who don't quite measure up to what they want often become sad and frightened, and I rescue them all and free them from suffering.",
        "source": "T10n0279_068:0369c10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「為行山險而留難者，為作善神，現形親近；為作好鳥，發音慰悅；為作靈藥，舒光照耀；示其果樹，示其泉井，示正直道，示平坦地，令其免離一切憂厄。",
        "translation": "\"For someone who travels through a mountainous region and has difficulty, I'll create a good deity to show up and be close to, a good bird to make a sound to comfort, a elixir to shine, a fruit tree to show them, a spring to show them a well, a straight path to show them, and a level ground to show them, so that they'll be spared all sorrow and trouble.",
        "source": "T10n0279_068:0369c13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「為行曠野、稠林、險道，藤蘿所羂、雲霧所暗而恐怖者，示其正道，令得出離。",
        "translation": "\"For someone who travels through a wilderness, a dense forest, or a dangerous path that's encumbered by vines and darkened by clouds and mists, show them the right path so they can escape.",
        "source": "T10n0279_068:0369c16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念言：『願一切眾生，伐見稠林，截愛羅網，出生死野，滅煩惱暗，入一切智平坦正道，到無畏處畢竟安樂。』",
        "translation": "Have this thought, 'May all sentient beings cut down dense forests and cut off webs of desire, emerge from the wilderness of birth and death, cease the darkness of affliction, enter the level and proper path of omniscience, and arrive at the fearless place of ultimate happiness.'",
        "source": "T10n0279_068:0369c18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0369c21_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，樂著國土而憂苦者；我以方便，令生厭離。",
        "translation": "'If there are sentient beings who are happily attached to their land and are sad and distressed, I'll make them become disillusioned with it with skillful means.'",
        "source": "T10n0279_068:0369c21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念言：『願一切眾生不著諸蘊，住一切佛薩婆若境。』",
        "translation": "They have this thought, 'May all sentient beings not be attached to the aggregates and abide in the realm of all the buddha-saṃpāramitās.'",
        "source": "T10n0279_068:0369c22_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0369c23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，樂著聚落，貪愛宅舍，常處黑暗，受諸苦者；我為說法，令生厭離，令法滿足，令依法住。",
        "translation": "'If there are sentient beings who are attracted to villages, crave homes, remain in darkness, and experience suffering, I will teach them, causing them to become disillusioned with them, fulfilling the teaching, and making them abide according to the teaching.'",
        "source": "T10n0279_068:0369c23_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念言：『願一切眾生，悉不貪樂六處聚落，速得出離生死境界，究竟安住一切智城。』",
        "translation": "They have this thought, 'May all sentient beings stop craving the six dwelling places and quickly escape the realm of birth-and-death and thoroughly abide in the city of omniscience.'",
        "source": "T10n0279_068:0369c26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0369c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生行暗夜中，迷惑十方，於平坦路生險難想，於險難道起平坦想，以高為下，以下為高，其心迷惑，生大苦惱。",
        "translation": "\"If there are sentient beings walking in the dark of night who are confused about the ten directions, who conceptualize the level road as difficult, who conceptualize the difficult road as level, who think of the high as the low, and who think of the low as the high, their minds are confused, and great suffering arises.",
        "source": "T10n0279_068:0369c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以方便舒光照及，若欲出者，示其門戶；若欲行者，示其道路；欲度溝洫，示其橋梁；欲涉河海，與其船筏；樂觀方者，示其險易安危之處；欲休息者，示其城邑、水、樹之所。",
        "translation": "With skillful means, I shine a bright light on them, showing them the entrance if they want to get out, the road if they want to walk, the bridge if they want to cross a ditch, the raft if they want to wade across a river or sea, the dangerous and easy places and the safe places if they want to rest, and the town, water, and tree places if they want to rest.",
        "source": "T10n0279_068:0370a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念言：『如我於此照除夜暗，令諸世事悉得宣敘；願我普於一切眾生生死長夜、無明暗處，以智慧光普皆照了。",
        "translation": "They think, 'Thus, I will shine here to remove the darkness of the night and make all worldly affairs known; may I universally illuminate with the light of wisdom the long night of birth and death and the dark places of ignorance for all sentient beings.",
        "source": "T10n0279_068:0370a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生無有智眼，想心見倒之所覆翳，無常常想，無樂樂想，無我我想，不淨淨想，堅固執著我人眾生、蘊界處法，迷惑因果，不識善惡，殺害眾生，乃至邪見，不孝父母，不敬沙門及婆羅門，不知惡人，不識善人，貪著惡事，安住邪法，毀謗如來，壞正法輪，於諸菩薩呰辱傷害，輕大乘道，斷菩提心，於有恩人反加殺害，於無恩處常懷怨結，毀謗賢聖，親近惡伴，盜塔寺物，作五逆罪，不久當墮三惡道處。",
        "translation": "是諸眾生無有智眼，想心見倒之所覆翳，無常常想，無樂樂想，無我我想，不淨淨想，堅固執著我人眾生、蘊界處法，迷惑因果，不識善惡，殺害眾生，乃至邪見，不孝父母，不敬沙門及婆羅門，不知惡人，不識善人，貪著惡事，安住邪法，毀謗如來，壞正法輪，於諸菩薩呰辱傷害，輕大乘道，斷菩提心，於有恩人反加殺害，於無恩處常懷怨結，毀謗賢聖，親近惡伴，盜塔寺物，作五逆罪，不久當墮三惡道處。",
        "source": "T10n0279_068:0370a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願我速以大智光明，破彼眾生無明黑暗，令其疾發阿耨多羅三藐三菩提心。』",
        "translation": "May I quickly shine the light of great wisdom to pierce the darkness of ignorance in those sentient beings and cause them to quickly give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T10n0279_068:0370a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既發心已，示普賢乘，開十力道，亦示如來法王境界，亦示諸佛一切智城、諸佛所行、諸佛自在、諸佛成就、諸佛總持、一切諸佛共同一身、一切諸佛平等之處，令其安住。",
        "translation": "Once he has aroused that intention, he shows them the vehicle of Samantabhadra, opens up the path of the ten powers, shows them the realm of the Tathāgata Dharma King, and shows them the city of omniscience of the buddhas, what the buddhas do, the autonomy of the buddhas, their accomplishment, their preservation, the common unity of all the buddhas, and the equality of all the buddhas, so that they may stand still.",
        "source": "T10n0279_068:0370a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0370a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生，或病所纏，或老所侵，或苦貧窮，或遭禍難，或犯王法，臨當受刑，無所依怙，生大怖畏；我皆救濟，使得安隱。",
        "translation": "\"All sentient beings who are afflicted by illness, attacked by old age, suffering from poverty, subject to misfortune, or in violation of the king's laws are about to be punished, have no support, and become very frightened; I rescue them all and make them comfortable.",
        "source": "T10n0279_068:0370a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『願我以法普攝眾生，令其解脫一切煩惱、生老病死、憂悲苦患，近善知識，常行法施，勤行善業，速得如來清淨法身，住於究竟無變易處。』",
        "translation": "Again, he thinks, 'May I universally embrace sentient beings with the Dharma, freeing them from all afflictions, birth, old age, illness, death, grief, sorrow, and suffering, draw near to good teachers, always practice Dharma generosity, and diligently perform good actions, so that they can quickly attain the Tathāgata's pure Dharma body and abide in a place that's ultimately changeless.'",
        "source": "T10n0279_068:0370a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0370a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生入見稠林，住於邪道，於諸境界起邪分別，常行不善身、語、意業，妄作種種諸邪苦行，於非正覺生正覺想，於正覺所非正覺想，為惡知識之所攝受，以起惡見，將墮惡道；我以種種諸方便門而為救護，令住正見，生人天中。",
        "translation": "\"All sentient beings enter the thicket of views, abide in wrong paths, form wrong discriminations in various realms, always perform unskillful bodily, verbal, and mental actions, deludedly engage in various wrong and painful practices, give rise to perceptions of right awakening that aren't right awakening and perceptions of what's not right awakening that are not right awakening, and are taken in by bad associates, which give rise to bad views that will lead them to fall into a bad path; I rescue them through various methods, causing them to abide in right view and be born among the gods.",
        "source": "T10n0279_068:0370a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『如我救此將墜惡道諸眾生等，願我普救一切眾生，悉令解脫一切諸苦，住波羅蜜出世聖道，於一切智得不退轉，具普賢願，近一切智，而不捨離諸菩薩行，常勤教化一切眾生。』」",
        "translation": "Again, he thought, 'As I saved these sentient beings who were about to fall into the evil path, may I save all sentient beings, liberate them all from all suffering, abide in the perfect transcendent noble path, attain irreversibility in all cognition, possess the vow of Samantabhadra, approach all cognition, not abandon the practices of the bodhisattvas, and always strive to teach all sentient beings.'\"",
        "source": "T10n0279_068:0370b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，婆珊婆演底主夜神，欲重宣此解脫義，承佛神力，觀察十方，為善財童子而說頌言：「我此解脫門，　　生淨法光明，　能破愚癡暗，　　待時而演說。",
        "translation": "At the time, Lord Vasantī, the god of the night, wanted to recapitulate the meaning of this liberation, and with the Buddha's spiritual power, he observed the ten directions and spoke a verse for Boy Sun Cai, saying, \"This gate of liberation of mine produces pure Dharma light, destroys the darkness of delusion, and is ready to be explained at the right time.",
        "source": "T10n0279_068:0370b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔無邊劫，　　勤行廣大慈，　普覆諸世間，　　佛子應修學。",
        "translation": "In an eternity ago, I diligently practiced vast compassion that covered the whole world, and the Buddha-child should train it.",
        "source": "T10n0279_068:0370b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　寂靜大悲海，　　出生三世佛，　能滅眾生苦，　　汝應入此門。",
        "translation": "The ocean of quiescent great compassion gives rise to the buddhas of the three worlds and can end the suffering of sentient beings, so you should enter this gate.",
        "source": "T10n0279_068:0370b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能生世間樂，　　亦生出世樂，　令我心歡喜，　　汝應入此門。",
        "translation": "It produces worldly happiness and supramundane happiness that make my heart rejoice, so you should enter this gate.",
        "source": "T10n0279_068:0370b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既捨有為患，　　亦遠聲聞果，　淨修諸佛力，　　汝應入此門。",
        "translation": "Having abandoned the sufferings of existential beings and distanced yourself from the fruit of śrāvaka, and having purified yourself by cultivating the powers of the buddhas, you should enter this gate.",
        "source": "T10n0279_068:0370b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我目甚清淨，　　普見十方剎，　亦見其中佛，　　菩提樹下坐，　相好莊嚴身，　　無量眾圍遶，　一一毛孔內，　　種種光明出；　見諸群生類，　　死此而生彼，　輪迴五趣中，　　常受無量苦。",
        "translation": "My eyes are perfectly pure, and I see buddhas in all the ten directions, including one sitting under a bodhi tree with a beautiful, adorned body, surrounded by measureless crowds, and various kinds of light emanating from every pore; I see all sentient beings who die here and are born there, are reborn in the cycle of the five destinies, and always experience measureless suffering.",
        "source": "T10n0279_068:0370b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我耳甚清淨，　　聽之無不及，　一切語言海，　　悉聞能憶持；　諸佛轉法輪，　　其聲妙無比，　所有諸文字，　　悉皆能憶持。",
        "translation": "My ears are so pure, they don't fail to hear them, and I can recall all the oceans of language that I hear; the buddhas turn the wheel of the Dharma, and their sounds are unsurpassed, so I can recall all the words that they write.",
        "source": "T10n0279_068:0370b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我鼻甚清淨，　　於法無所礙，　一切皆自在，　　汝應入此門。",
        "translation": "My nose is so pure, it doesn't obstruct anything in the Dharma, and everything is self-contained; you should enter this gate.",
        "source": "T10n0279_068:0370c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我舌甚廣大，　　淨好能言說，　隨應演妙法，　　汝應入此門。",
        "translation": "My tongue is so vast and pure that it's capable of speaking and teaching the wondrous Dharma as it should, so you should enter this gate.",
        "source": "T10n0279_068:0370c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我身甚清淨，　　三世等如如，　隨諸眾生心，　　一切悉皆現。",
        "translation": "My body is so pure that the three worlds are just like each other, and everything is manifested according to the minds of sentient beings.",
        "source": "T10n0279_068:0370c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我心淨無礙，　　如空含萬像，　普念諸如來，　　而亦不分別。",
        "translation": "My mind is pure and unobstructed, like space containing myriad images, and I'm universally mindful of the tathāgatas and don't discriminate between them.",
        "source": "T10n0279_068:0370c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　了知無量剎，　　一切諸心海，　諸根及欲樂，　　而亦不分別。",
        "translation": "I perceive measureless bases, all mental oceans, faculties, and desires, but I don't discriminate them.",
        "source": "T10n0279_068:0370c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我以大神通，　　震動無量剎，　其身悉遍往，　　調彼難調眾。",
        "translation": "With my great supernormal powers, I shake measureless buddhas, completely pervading their bodies, and taming their difficult-to-control multitudes.",
        "source": "T10n0279_068:0370c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我福甚廣大，　　如空無有盡，　供養諸如來，　　饒益一切眾。",
        "translation": "My merit is so great that it's like space without limit, making offerings to the tathāgatas and benefiting all of them.",
        "source": "T10n0279_068:0370c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我智廣清淨，　　了知諸法海，　除滅眾生惑，　　汝應入此門。",
        "translation": "My knowledge is vast and pure, I fully understand the ocean of all dharmas, and I remove the mental disturbances of sentient beings, so you should enter this gate.",
        "source": "T10n0279_068:0370c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我知三世佛，　　及以一切法，　亦了彼方便，　　此門遍無等。",
        "translation": "I know the buddhas of the three times and all dharmas, and I also understand their methods, so this gate is pervasive and unequalled.",
        "source": "T10n0279_068:0370c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一一塵中見，　　三世一切剎，　亦見彼諸佛，　　此是普門力。",
        "translation": "Seeing each one in a particle of dust, seeing all the buddhas of the three times and also seeing those buddhas is the power of the universal approach.",
        "source": "T10n0279_068:0370c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方剎塵內，　　悉見盧舍那，　菩提樹下坐，　　成道演妙法。」",
        "translation": "Within the dust of buddhas in the ten directions, they all see Rocana, sitting under the bodhi tree, accomplishing the path and teaching the wonderful Dharma.\"",
        "source": "T10n0279_068:0370c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子白夜神言：「汝發阿耨多羅三藐三菩提心為幾時耶？",
        "translation": "It was then that the Boy of Wealth said to the god of the night, \"How long have you been arousing the mind of unsurpassed, correct enlightenment?",
        "source": "T10n0279_068:0370c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得此解脫其已久如，乃能如是饒益眾生？」",
        "translation": "How long has it been since he attained this liberation, and how could he thus benefit sentient beings?\"",
        "source": "T10n0279_068:0370c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其神答言：「善男子！",
        "translation": "The spirit replied, \"Good sons!",
        "source": "T10n0279_068:0370c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古世，過如須彌山微塵數劫，有劫名：寂靜光，世界名：出生妙寶，有五億佛於中出現。",
        "translation": "Once upon a time in an ancient land, after an eon as numerous as the dust of Mount Sumeru, there was an eon named Quiet Light and a world named Birth of Marvelous Jewels, in which 500 million buddhas appeared.",
        "source": "T10n0279_068:0370c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼世界中有四天下，名：寶月燈光，有城，名：蓮華光，王名：善法度，以法施化，成就七寶，王四天下。",
        "translation": "In that world there were four worlds named Jewel Moonlight, a city named Lotus Light, and a king named Shan Fadao, who taught by teaching by Dharma and accomplished the seven treasures, and there were four worlds under the king.",
        "source": "T10n0279_068:0370c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有夫人，名：法慧月，夜久眠寐。",
        "translation": "The king has a wife named Dharma Wisdom Moon who sleeps long into the night.",
        "source": "T10n0279_068:0371a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼城東有一大林，名為：寂住，林中有一大菩提樹，名：一切光摩尼王莊嚴身出生一切佛神力光明。",
        "translation": "At the time, there was a large forest named Silent Abode on the east side of that city, and in that forest was a large bodhi tree named All Shining King Maṇi Adorned Body that produced the spiritual radiance of all the buddhas.",
        "source": "T10n0279_068:0371a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，有佛名：一切法雷音王，於此樹下成等正覺，放無量色廣大光明，遍照出生妙寶世界。",
        "translation": "\"At the time, there was a Buddha named Dharma Thunder King of All Light, who became perfectly enlightened under this tree and radiated a vast radiance of measureless color that radiated throughout the world of miraculous treasures that were produced.",
        "source": "T10n0279_068:0371a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓮華光城內有主夜神，名為：淨月，詣王夫人法慧月所，動身瓔珞以覺夫人，而告之言：『夫人當知，一切法雷音王如來，於寂住林成無上覺，及廣為說諸佛功德自在神力、普賢菩薩所有行願。』",
        "translation": "Inside the city of lotus light, a night guardian named Jñānacandra visited the king's wife, Fayutsuki, moved her body in jewelry to awaken her, and told her, 'You should know, madam, that the Tathāgata King of the Dharma Thunderclap has become unsurpassedly enlightened in the Jetavana Grove and has explained in detail the Buddha's merits, his supernormal powers, and the vows of the Bodhisattvas of Universal Worthy.'",
        "source": "T10n0279_068:0371a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令王夫人發阿耨多羅三藐三菩提意，供養彼佛及諸菩薩、聲聞、僧眾。",
        "translation": "She caused the king's wife to arouse the intention to perfect perfect enlightenment and make offerings to that Buddha, the bodhisattvas, śrāvakas, and saṃgha.",
        "source": "T10n0279_068:0371a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0371a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王夫人法慧月者，豈異人乎？",
        "translation": "Wasn't that Mrs. Wang's dharma, Huiyue, a different person?",
        "source": "T10n0279_068:0371a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我身是也！",
        "translation": "I myself am!",
        "source": "T10n0279_068:0371a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我於彼佛所發菩提心種善根故，於須彌山微塵數劫，不生地獄、餓鬼、畜生諸惡趣中，亦不生於下賤之家，諸根具足，無有眾苦，於天人中福德殊勝，不生惡世，恒不離佛及諸菩薩、大善知識，常於其所種植善根，經八十須彌山微塵數劫常受安樂，而未滿足菩薩諸根。",
        "translation": "\"Because I aroused the mind of enlightenment and planted good roots in that Buddha's place, I won't be born in the miserable destinies of hell, hungry ghosts, or animals, or in a lowly home, have perfected my faculties, experience no suffering, have excellent fortune among gods and humans, won't be born in a bad world, and will never part from the buddhas, bodhisattvas, and great good teachers who always plant good roots in their places.",
        "source": "T10n0279_068:0371a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「過此劫已，復過萬劫，於賢劫前，有劫名：無憂遍照，世界名：離垢妙光。",
        "translation": "\"After this eon, there will be another 10,000 eons before the good eon when there's an eon named 'No Sorrows, Pervasive Illumination,' and a world named 'Free from Dirt, Wonderful Light.'",
        "source": "T10n0279_068:0371a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其世界中淨穢相雜，有五百佛於中出現。",
        "translation": "In that world, a mixture of purity and defilement exists, and five hundred buddhas appear in it.",
        "source": "T10n0279_068:0371a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第一佛，名：須彌幢寂靜妙眼如來、應、正等覺；我為：名稱長者；女名：妙慧光明，端正殊妙。",
        "translation": "The first of those buddhas is called Sumeru-banner, Tathāgata of Tranquility and Marvelous Vision, Worthy, and Perfectly Enlightened; I am the elder of the name; and the name of the woman is Marvelous Wisdom and Radiance, which is correct and marvelous.",
        "source": "T10n0279_068:0371a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼淨月夜神，以願力故，於離垢世界一四天下妙幢王城中生，作主夜神，名：清淨眼。",
        "translation": "That pure-moon night god was born in the Sumeru-banner city of the king of marvelous eyes on one of the four continents of the world free of pollution because of the power of his vow, and he became the chief night god named Pure Eyes.",
        "source": "T10n0279_068:0371a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於一時，在父母邊，夜久眠息。",
        "translation": "One time, I was near my parents and slept for a long time during the night.",
        "source": "T10n0279_068:0371a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼清淨眼來詣我所，震動我宅，放大光明，出現其身，讚佛功德言：『妙眼如來坐菩提座，始成正覺。』",
        "translation": "That Pure Eye came to me, shook my house, magnified its light, and appeared in its body, praising the Buddha's merits and saying, 'The Marvelous Eyes Tathāgata sat on the throne of enlightenment and first became perfectly enlightened.'",
        "source": "T10n0279_068:0371a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸諭於我及以父母并諸眷屬，令速見佛；自為前導，引至佛所，廣興供養。",
        "translation": "He encouraged me, my parents, and my retinue to quickly see the Buddha, led them to the Buddha, and made extensive offerings.",
        "source": "T10n0279_068:0371b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我纔見佛，即得三昧，名：出生見佛調伏眾生三世智光明輪。",
        "translation": "\"After I first saw the Buddha, I immediately attained the samādhi called 'born to see the Buddha's radiant wheel of wisdom that disciplines sentient beings in the three times.'",
        "source": "T10n0279_068:0371b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獲此三昧故，能憶念須彌山微塵數劫，亦見其中諸佛出現，於彼佛所聽聞妙法；以聞法故，即得此破一切眾生暗法光明解脫。",
        "translation": "Attaining this concentration, I was able to recall the countless eons of Mount Sumeru and see the buddhas appearing there, and I heard the wonderful Dharma from those buddhas; as a result of hearing the Dharma, I attained the liberation of this radiant light that destroys the dark dharmas of all sentient beings.",
        "source": "T10n0279_068:0371b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得此解脫已，即見其身遍往佛剎微塵數世界，亦見彼世界所有諸佛，又見自身在其佛所；亦見彼世界一切眾生，解其言音，識其根性，知其往昔曾為善友之所攝受，隨其所樂而為現身，令生歡喜。",
        "translation": "After attaining this liberation, he sees himself traveling to a world of dusty buddha bases, sees all the buddhas of that world, sees himself in one of their buddha-places, sees all the sentient beings of that world, understands their speech and sounds, recognizes their faculties, knows that they've been taken in by good friends in the past, and gives rise to joy as he takes delight in the present body.",
        "source": "T10n0279_068:0371b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我時於彼所得解脫，念念增長，此心無間；又見自身遍往百佛剎微塵數世界，此心無間；又見自身遍往千佛剎微塵數世界，此心無間；又見自身遍往百千佛剎微塵數世界。",
        "translation": "\"At the time, I was mindfully growing in the liberation they had attained, and this mind was uninterrupted; I also saw myself going to a hundred buddha-blossom worlds with a tiny number of dust motes, and this mind was uninterrupted; I also saw myself going to a thousand buddha-blossom worlds with a tiny number of dust motes, and this mind was uninterrupted; and I saw myself going to a hundred thousand buddha-blossom worlds with a tiny number of dust motes.",
        "source": "T10n0279_068:0371b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，念念乃至不可說不可說佛剎微塵數世界，亦見彼世界中一切如來；亦自見身在彼佛所，聽聞妙法，受持憶念，觀察決了；亦知彼佛諸本事海、諸大願海，彼諸如來嚴淨佛剎，我亦嚴淨；亦見彼世界一切眾生，隨其所應而為現身教化調伏。",
        "translation": "Thus, from moment to moment, he sees all the tathāgatas in the numberless worlds of the ineffable and indescribable buddhas, sees himself in the presence of those buddhas, hears the wonderful Dharma, retains its maintenance, recollects it, and observes and comprehends it, knows the oceans of their abilities and great vows, and that those tathāgatas adorn and purify their buddha-blocs, and I also adorn and purify them, and sees all the sentient beings in that world being taught and disciplined in their present bodies as they should be.",
        "source": "T10n0279_068:0371b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此解脫門，念念增長，如是乃至充滿法界。",
        "translation": "This gate of liberation grows from moment to moment, and so it goes on to fill the Dharma realm.",
        "source": "T10n0279_068:0371b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0371b22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此菩薩破一切眾生暗法光明解脫。",
        "translation": "\"I only know that this bodhisattva destroys the bright liberation of the dark dharmas of all sentient beings.",
        "source": "T10n0279_068:0371b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，成就普賢無邊行願，普入一切諸法界海，得諸菩薩金剛智幢自在三昧，出生大願，住持佛種；於念念中，成滿一切大功德海，嚴淨一切廣大世界；以自在智，教化成熟一切眾生；以智慧日，滅除一切世間暗障；以勇猛智，覺悟一切眾生惛睡；以智慧月，決了一切眾生疑惑；以清淨音，斷除一切諸有執著；於一切法界一一塵中，示現一切自在神力，智眼明淨，等見三世。",
        "translation": "Just like the bodhisattvas, they accomplish the boundless vows of Samantabhadra, universally enter the ocean of all the Dharma realms, attain the samādhi of the bodhisattvas' adamantine wisdom banner of mastery, generate the great vow, and maintain the Buddha's seed; in each recitation, they complete the ocean of all great merits and adorn and purify the whole vast world; with unimpeded knowledge, they teach and mature all sentient beings; with the sun of wisdom, they extinguish all the world's dark hindrances; with the wisdom of courage, they awaken all sentient beings to drowsiness; with the moon of wisdom, they resolve all sentient beings' doubts and confusions; with the voice of purity, they end all attachments to existence; and in each particle of the Dharma realm, they display all their sovereign powers and have a clear eye of wisdom that sees the three worlds equally.",
        "source": "T10n0279_068:0371b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我何能知其妙行、說其功德、入其境界、示其自在？",
        "translation": "How could I know their wondrous actions, explain their merits, enter their realms, and show them their mastery?",
        "source": "T10n0279_068:0371c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_068:0371c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此閻浮提摩竭提國菩提場內，有主夜神，名：普德淨光。",
        "translation": "Inside the site of enlightenment in this Jambudvīpa country of Magadhava, there's a night guardian named Pūrṇa-prabhāsa.",
        "source": "T10n0279_068:0371c05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我本從其發阿耨多羅三藐三菩提心，常以妙法開悟於我。",
        "translation": "I originally aroused from him the mind of unsurpassed, correct enlightenment, and he always enlightens me with his wonderful teaching.",
        "source": "T10n0279_068:0371c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道。」",
        "translation": "Go there and ask, 'How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?'\"",
        "source": "T10n0279_068:0371c07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子向婆珊婆演底神而說頌曰：「見汝清淨身，　　相好超世間，　如文殊師利，　　亦如寶山王。",
        "translation": "It was then that the Boy of Wealth addressed the god Vasantī and spoke in verse, \"I see your pure body, whose features transcend the world, like Mañjuśrī and the king of the jeweled mountains.",
        "source": "T10n0279_068:0371c08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝法身清淨，　　三世悉平等，　世界悉入中，　　成壞無所礙。",
        "translation": "Your Dharma body is pure, the three worlds are all equal, the worlds all enter into it, and there's nothing that prevents it from being formed or destroyed.",
        "source": "T10n0279_068:0371c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我觀一切趣，　　悉見汝形像，　一一毛孔中，　　星月各分布。",
        "translation": "I look at all destinies and see your form, and in every pore, the stars and moon are distributed.",
        "source": "T10n0279_068:0371c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝心極廣大，　　如空遍十方，　諸佛悉入中，　　清淨無分別。",
        "translation": "Your mind is so vast that it's like space pervading the ten directions, into which all the buddhas enter, that it's pure and undiscriminated.",
        "source": "T10n0279_068:0371c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一一毛孔內，　　悉放無數光，　十方諸佛所，　　普雨莊嚴具。",
        "translation": "In each pore, they all radiate an incalculable amount of light, and the buddhas of the ten directions all rain down adornments.",
        "source": "T10n0279_068:0371c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一一毛孔內，　　各現無數身，　十方諸國土，　　方便度眾生。",
        "translation": "In every pore, each one shows an incalculable body, and the lands of the ten directions are filled with the skillful means to save sentient beings.",
        "source": "T10n0279_068:0371c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一一毛孔內，　　示現無量剎，　隨諸眾生欲，　　種種令清淨。",
        "translation": "In each pore, he shows measureless bases that purify variously according to the desires of sentient beings.",
        "source": "T10n0279_068:0371c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有諸眾生，　　聞名及見身，　悉獲功德利，　　成就菩提道。",
        "translation": "If there are sentient beings who hear their names and see their bodies, they'll all attain merit and realize the path to enlightenment.",
        "source": "T10n0279_068:0371c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多劫在惡趣，　　始得見聞汝，　亦應歡喜受，　　以滅煩惱故。",
        "translation": "Many eons in a bad destiny have passed since they first saw and heard of you, but they should rejoice and accept it because it ceases affliction.",
        "source": "T10n0279_068:0371c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　千剎微塵劫，　　歎汝一毛德，　劫數猶可窮，　　功德終無盡。」",
        "translation": "Thousands of incalculable eons praise your merit as a single hair, and the number of eons can still be exhausted, yet your virtue is ultimately inexhaustible.\"",
        "source": "T10n0279_068:0371c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子說此頌已，頂禮其足，遶無量匝，慇懃瞻仰，辭退而去。",
        "translation": "After reciting this verse, the boy of good fortune bowed his head at his feet, circled him measurelessly, paid respect to him, withdrew, and departed.",
        "source": "T10n0279_068:0372a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第六十八",
        "translation": "Dafangguang fo huayan jing roll 68",
        "source": "T10n0279_068:0372a03_0",
        "is_bad_quality": false
    }
]