[
    {
        "source_sentence": "度世品經卷第一",
        "translation": "Sutra on the Course to Salvation, Vol. 1",
        "source": "T10n0292_001:0617b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏三藏竺法護譯",
        "translation": "Translation of the Tripiṭaka of the Yuezhi Family of the Western Jin Dynasty by Zhu Fahou",
        "source": "T10n0292_001:0617b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛遊摩竭國法閑道場普光講堂蓮華藏師子座——覺了真諦，無有二行；度無想法，如佛遊居以致平等；一切諸佛進退遊行無所罣礙亦無蔭蔽；法無退還、行無等倫，所見奉敬不可思議；現等三世，其身所顯普周世界；分別諸法，慧無猶豫；具足諸法，坐佛樹下究暢經典；不疑正覺、不想計身，一切菩薩志願、道慧、佛行無二；所濟第一，度於彼岸，不壞如來建立脫門；諸佛土地不可限量，所遊平等，所修法境曠若虛空。",
        "translation": "聞如是：一時佛遊摩竭國法閑道場普光講堂蓮華藏師子座——覺了真諦，無有二行；度無想法，如佛遊居以致平等；一切諸佛進退遊行無所罣礙亦無蔭蔽；法無退還、行無等倫，所見奉敬不可思議；現等三世，其身所顯普周世界；分別諸法，慧無猶豫；具足諸法，坐佛樹下究暢經典；不疑正覺、不想計身，一切菩薩志願、道慧、佛行無二；所濟第一，度於彼岸，不壞如來建立脫門；諸佛土地不可限量，所遊平等，所修法境曠若虛空。",
        "source": "T10n0292_001:0617b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方國土不可計會億百那術一切塵限諸菩薩數其亦如此，菩薩大士皆生補處，當成無上正真之道，各各他異十方佛國來會此土——皆成開士、皆發慧目，德門無極；開化一切眾生諸界，順律唱道，權方便門，曉了隨時，住菩薩法；一切世界講堂、樓閣越升慧定，而以觀察滅度之地；尊敬道慧，蠲除一切言辭、行陰，所可釋去明識因宜；攝取眾生，入於無量，道遊其中；一切眾生所作禍福皆有報應，終不腐朽；分別應時，所試觀察永無所獲；解知眾生諸界志性，達了諸根，省應可度，從其緣便，應病授藥；去來今佛所可頒宣章句議理，輒受奉持，已受其決，執懷平等，解發正藏；所當歸者，入於現世、度世無量；法自所入真正悉已暢解，有為、無為觀之無二。",
        "translation": "十方國土不可計會億百那術一切塵限諸菩薩數其亦如此，菩薩大士皆生補處，當成無上正真之道，各各他異十方佛國來會此土——皆成開士、皆發慧目，德門無極；開化一切眾生諸界，順律唱道，權方便門，曉了隨時，住菩薩法；一切世界講堂、樓閣越升慧定，而以觀察滅度之地；尊敬道慧，蠲除一切言辭、行陰，所可釋去明識因宜；攝取眾生，入於無量，道遊其中；一切眾生所作禍福皆有報應，終不腐朽；分別應時，所試觀察永無所獲；解知眾生諸界志性，達了諸根，省應可度，從其緣便，應病授藥；去來今佛所可頒宣章句議理，輒受奉持，已受其決，執懷平等，解發正藏；所當歸者，入於現世、度世無量；法自所入真正悉已暢解，有為、無為觀之無二。",
        "source": "T10n0292_001:0617b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去來今佛一切如來所入道場、一時道御、建平解、成平等覺，悉能示現。",
        "translation": "All the tathāgatas, past and present, have entered the site of enlightenment, once-returned to the path, established a peaceful understanding, and become equally enlightened, and they've all been able to show it.",
        "source": "T10n0292_001:0617c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心閑、心懅，已了佛道。",
        "translation": "With their minds at ease and their minds transfixed, they've already realized the Buddha Way.",
        "source": "T10n0292_001:0617c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不離一切眾生發心，入一人心則能普入一切眾生所知、所樂。",
        "translation": "Without departing from the aspirations of all sentient beings, he enters one mind and then can universally enter what all sentient beings know and enjoy.",
        "source": "T10n0292_001:0617c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自於其慧而不動轉。",
        "translation": "Their own wisdom doesn't budge.",
        "source": "T10n0292_001:0617c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩身逮得普智、諸通慧心，住於其地而不退轉。",
        "translation": "Those bodhisattvas who have acquired universal knowledge and the mind of penetrating wisdom abide in that stage and don't falter.",
        "source": "T10n0292_001:0617c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所行力無休懈，周旋往來慧無所行一切人故。",
        "translation": "Because the power of what bodhisattvas do has no laxity, their wisdom circulates back and forth to all people without any action.",
        "source": "T10n0292_001:0617c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無數劫在於生死曉了建立，不可計劫難可值見。",
        "translation": "During incalculably long eons, they've been in birth-and-death and have clearly understood and established it, and it's difficult to find them in incalculable eons.",
        "source": "T10n0292_001:0617c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩寶真正難遇，常轉法輪未曾勞廢，開化眾生令入律品，過去、當來、現在如來嚴淨斯處逮成眾生。",
        "translation": "Those bodhisattva treasures are truly difficult to encounter, always turning the wheel of the Dharma without ever wasting time, enlightening sentient beings and causing them to enter the Vinaya, and past, future, and present Tathāgatas have adorned and purified this place and captured it for sentient beings.",
        "source": "T10n0292_001:0617c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具足本行，所誓已具，功行殊特。",
        "translation": "Their activities are complete, their vows are fulfilled, and their performance is exceptional.",
        "source": "T10n0292_001:0617c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩及餘學士，十方諸佛所可諮嗟，劫數無際所歎無限，其無元底與眾超異。",
        "translation": "Such a bodhisattva and the rest of his disciples are admired by the buddhas of the ten directions, praised by an infinite number of eons, and their lack of a fundamental basis is surpassed by all others.",
        "source": "T10n0292_001:0617c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰：普賢菩薩、普因(一作目)菩薩、普化菩薩、普智菩薩、普眼菩薩、普光菩薩、普觀菩薩、普明菩薩、普英菩薩、普覺菩薩，如是之等不可稱計億百那術十方諸佛國土塵數。",
        "translation": "Their names are: Samantabhadra Bodhisattva, Pūrṇa-kauṇḍinya Bodhisattva, Pūrṇa-kauṇḍinya Bodhisattva, Pūrṇa-kauṇḍinya Bodhisattva, Pūrṇa-kauṇḍinya Bodhisattva, Pūrṇa-kauṇḍinya Bodhisattva, Pūrṇa-kauṇḍinya Bodhisattva, and so on, which are incalculable numbers of dust in the lands of buddhas in the ten directions.",
        "source": "T10n0292_001:0617c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，普賢成就所願——其所誓志志願超殊：若諸佛興，普往求請；曉了隨時，皆持諸佛所化法目，不斷一切如來之教；諸佛興世，速疾受決成最正覺，名號、國土已淨畢了；所住法輪見無佛國示現為佛，嚴治一切凶弊、穢濁、難化世界，休息滅除諸菩薩眾罣礙禍福，入無陰蓋正諦法界。",
        "translation": "Thus, Samantabhadra fulfills this vow - his vow is transcendent: if the buddhas arise, he goes to them universally, asks them to do so; at all times he understands them, he holds the Dharma eye created by the buddhas, doesn't stop teaching all the tathāgatas; when the buddhas arise in the world, he quickly accepts the resolution to become the most awakened one, his name and land are purified and fully comprehended; the Dharma wheel he stands on sees no buddha land manifested as a buddha, he strictly heals all the bad, polluted, and difficult-to-transform worlds, he rests and removes the hindrances and misfortunes of the bodhisattvas, and enters the Dharma realm of the true truth without hindrances.",
        "source": "T10n0292_001:0617c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，普賢菩薩即以佛藏三昧正受。",
        "translation": "Samādhi of the Buddha-store was then correctly received by Samantabhadra Bodhisattva.",
        "source": "T10n0292_001:0618a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "這三昧已，應時遍入十方諸佛之所遊居，靡不周暢、皆以通達，無有餘土而不徹者，講堂、法境、其虛空界，悉至無際。",
        "translation": "After this samādhi, he should then enter and travel to all the buddhas in the ten directions, penetrating them all, and there's no place left that he doesn't penetrate, including the lecture hall, the Dharma realm, and the realm of space, which all reach without limit.",
        "source": "T10n0292_001:0618a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方剎土六反震動，其大光明靡所不照，謦揚洪音莫不聞聲。",
        "translation": "As the six counter-movements of the buddhas and lands in the ten directions shake, there's nothing that their great radiance doesn't illuminate, and there's no sound that isn't heard with a loud, clear voice.",
        "source": "T10n0292_001:0618a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普賢菩薩從三昧興，見諸菩薩咸來俱會，欣然大悅。",
        "translation": "From his samādhi, Samantabhadra arises and is delighted to see all the bodhisattvas come together.",
        "source": "T10n0292_001:0618a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普智菩薩覩諸菩薩皆來雲集亦復踊躍，前問普賢菩薩大士：「善哉，佛子！",
        "translation": "Seeing all the bodhisattvas gathered in clouds, Bodhisattva Samantabhadra also perked up and asked Bodhisattva Samantabhadra, \"Good, Son of the Buddha!",
        "source": "T10n0292_001:0618a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今諸菩薩十方來會，渴仰經典，瞻戴仁者如冥思明。",
        "translation": "Now, all the bodhisattvas from ten directions have come to the meeting, eagerly awaiting the sūtras, and they look up to the benevolent ones as if they were deep in thought and insight.",
        "source": "T10n0292_001:0618a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯為解說諸菩薩行，從始至終令無疑——結者亘然，如病得愈、盲者得目。",
        "translation": "They only explain the bodhisattva practices from beginning to end so that there's no doubt - the fetters are unbroken, like a sick person who's been healed and a blind person who's been given eyesight.",
        "source": "T10n0292_001:0618a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何謂菩薩有所依怙而無所著？",
        "translation": "\"What's the meaning of a bodhisattva having something to rely on and nothing to cling to?",
        "source": "T10n0292_001:0618a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩未曾有想？",
        "translation": "What is meant by a bodhisattva's unprecedented conceptions?",
        "source": "T10n0292_001:0618a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為行？",
        "translation": "What is meant by practice?",
        "source": "T10n0292_001:0618a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂善友？",
        "translation": "What is meant by a good friend?",
        "source": "T10n0292_001:0618a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂精進？",
        "translation": "What is meant by exertion?",
        "source": "T10n0292_001:0618a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂勸信？",
        "translation": "What is meant by encouraging faith?",
        "source": "T10n0292_001:0618a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂化眾生？",
        "translation": "What does it mean to transform sentient beings?",
        "source": "T10n0292_001:0618a18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂禁戒？",
        "translation": "What are the prohibitions?",
        "source": "T10n0292_001:0618a18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂受決？",
        "translation": "What is meant by receiving a judgment?",
        "source": "T10n0292_001:0618a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不相求短？",
        "translation": "What is meant by a bodhisattva not seeking shortage of each other?",
        "source": "T10n0292_001:0618a18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂入如來？",
        "translation": "What does it mean to enter the Tathāgata?",
        "source": "T10n0292_001:0618a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂得入眾生性行？",
        "translation": "What is meant by the attainment of the practice of the nature of sentient beings?",
        "source": "T10n0292_001:0618a19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂逮入於諸世界？",
        "translation": "What does it mean to have gained entry into all the worlds?",
        "source": "T10n0292_001:0618a20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂曉入諸念劫數靡所不達？",
        "translation": "What is meant by the term \"entering deeply into the kalpas of mindfulness that are not unobtainable?",
        "source": "T10n0292_001:0618a20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂暢說於三世事？",
        "translation": "What is meant by speaking freely about the events of the three times?",
        "source": "T10n0292_001:0618a21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂得入三處？",
        "translation": "What is meant by gaining access to the three places?",
        "source": "T10n0292_001:0618a21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂無厭其所發心，無所缺漏？",
        "translation": "What is meant by not tiring of what one has set out to do and not missing anything?",
        "source": "T10n0292_001:0618a22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩分別諸辯？",
        "translation": "What is meant by a bodhisattva's discernment of arguments?",
        "source": "T10n0292_001:0618a22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩逮得總持？",
        "translation": "What is meant by a bodhisattva acquiring a mastery?",
        "source": "T10n0292_001:0618a23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩頒宣佛道？」",
        "translation": "What does it mean for a bodhisattva to proclaim the Buddha's way?\"",
        "source": "T10n0292_001:0618a23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普賢菩薩緣普智問，欲令來者皆得開解，讚言：「善哉！",
        "translation": "In response to the question of universal wisdom, the Samantabhadra Bodhisattva, desiring to cause all comers to attain enlightenment, praised him, \"Good!",
        "source": "T10n0292_001:0618a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸會菩薩皆共咸聽。",
        "translation": "The assembled bodhisattvas all listened together.",
        "source": "T10n0292_001:0618a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩有十事法，有所依怙而無所著。",
        "translation": "\"There are ten things that bodhisattvas rely on and aren't attached to.",
        "source": "T10n0292_001:0618a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0618a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依菩薩心令不違失、依於善友常修專精、倚于德本而植福慶、順度無極能奉行故、恃一切法無所歸故、怙誓諸願使親道故、專於諸行習具足故、附諸菩薩一生補故、歸奉諸佛心歡然故、奉諸如來歎如父故，是為菩薩十事法，有所依怙為無所著。",
        "translation": "Relying on the bodhisattva's mind so that there's no loss, relying on good friends to cultivate concentration, relying on the foundations of virtue to cultivate merit, conforming to the infinite, and being able to practice, relying on all things to which there's no refuge, relying on vows to make one intimate with the Way, focusing on the cultivation of practices, attaching to the bodhisattvas for a lifetime, taking refuge in the buddhas with joy, and taking refuge in the Tathāgatas who praise him as their father are the ten things of a bodhisattva that have a support and no attachment.",
        "source": "T10n0292_001:0618a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此，疾逮無上如來大慧至無極依。」",
        "translation": "Abiding here, a bodhisattva quickly acquires the unsurpassed great wisdom of the Tathāgata, which reaches the infinite support.\"",
        "source": "T10n0292_001:0618b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是頌曰：「依者無所依，　　自歸於諸佛，　解法無所望，　　乃至於大願。",
        "translation": "The verse then says, \"He has no support, so he takes refuge in the buddhas, has no expectation of understanding the teaching, and attains the great vow.",
        "source": "T10n0292_001:0618b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見諸佛歡然，　　依之而奉敬，　恃怙諸如來，　　因具足道行。",
        "translation": "He sees the buddhas joyfully, relies on them with respect, relies on the tathāgatas, and thus completes the practice of the path.",
        "source": "T10n0292_001:0618b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事，未曾有想。",
        "translation": "\"There are ten things about bodhisattvas that have never been conceived before.",
        "source": "T10n0292_001:0618b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0618b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念諸德本如己無異，身積眾善以施眾生；一切功訓以為道想；解達眾生為道器想；願濟一切如己願想；皆以諸法施不及想；察一切法念如佛法；為一切行如奉身想；一切言辭於諸所行無所妄想；覩見諸佛為父母想；於眾如來為無二想。",
        "translation": "They remember that the origin of all virtues is the same as their own, accumulate in themselves many good qualities to bestow on sentient beings, contemplate all meritorious teachings as the path, understand sentient beings as the vessel of the path, vow to help all things as they vow, give all things less than their vows, examine all things with mindfulness as the Buddha's teaching, perform all actions as they serve themselves, speak all words with no false notions about what's being done, see the buddhas as their parents, and think of the tathāgatas as not two.",
        "source": "T10n0292_001:0618b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是，族姓子！",
        "translation": "Yes, clansman!",
        "source": "T10n0292_001:0618b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩眾未曾有想，菩薩住此，疾成無上、逮眾德本。」",
        "translation": "Never has there been a conception among bodhisattvas that a bodhisattva abiding here would quickly become unsurpassed and acquire the roots of many virtues.\"",
        "source": "T10n0292_001:0618b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是頌曰：「為一切積德，　　念之如己身，　觀察於眾生，　　亦如道法器。",
        "translation": "The verse then says, \"Accumulate virtues for all [sentient beings], mindful of them as yourself, and observing them in sentient beings, they're also like the Dharma vessel of the path.",
        "source": "T10n0292_001:0618b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸眾生造願，　　與身等無異，　歸命於道法，　　令致無從生。",
        "translation": "The vows created by sentient beings are no different than their own bodies, and they are destined to be endowed with the teachings of the Way, so that they will never arise.",
        "source": "T10n0292_001:0618b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事為行。",
        "translation": "\"There are ten things that bodhisattvas do.",
        "source": "T10n0292_001:0618b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0618b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "講說分別眾生所行、而求一切諸法所行、普學禁戒尋即奉行、積累諸行眾德之本、一心專精奉修三昧、曉了聖慧所當歸趣、慇懃謹勅無所違失、遊於剎土欲莊嚴故、修善知識不離恭恪、奉如來行敬如師子，是為十事。」",
        "translation": "These are the ten things that he teaches about discerning what sentient beings do, seeking what all dharmas do, training in the universal observance of the precepts and then carrying them out, accumulating the roots of merit in various practices, focusing his mind intently on cultivating concentration, understanding the destinies of noble wisdom, being diligent about following orders, not failing to follow them, traveling through the lands with the desire to adorn them, cultivating good teachers, not departing from deference, and practicing the Tathāgata with respect as a teacher and son.\"",
        "source": "T10n0292_001:0618b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「一切有所行，　　當開化眾生，　勤求於諸法，　　而奉行禁戒。",
        "translation": "He then spoke this verse, \"Whatever he does, he will enlighten sentient beings, diligently pursue the teachings, and observe the precepts.",
        "source": "T10n0292_001:0618b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　積累眾德本，　　一心歸定意，　曉了聖明慧，　　所遊淨剎土。",
        "translation": "Accumulating the roots of many virtues, they unify their minds in concentration, understand the noble, bright, and wise, and tour the pure bodhisattva lands.",
        "source": "T10n0292_001:0618c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事為善友。",
        "translation": "\"There are ten things that bodhisattvas do to be good friends.",
        "source": "T10n0292_001:0618c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0618c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "建立道意、能修德本、入度無極、頒宣道法、開化眾生、分別辯才、稱舉群萌、除眾妄想、住無患厭、立普賢行入諸佛慧則為善友，是為十事。」",
        "translation": "Establishing the intention for the path, cultivating the fundamentals of virtue, entering the infinitude of perfections, proclaiming the teachings of the path, enlightening sentient beings, discerning eloquence, praising the multitude of sentient beings, removing deluded notions, abiding in freedom from disillusionment, and establishing the practice of Samantabhadra as a good friend who enters the wisdom of the buddhas are ten things.\"",
        "source": "T10n0292_001:0618c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是頌曰：「心建立於道，　　精勤修德本，　入諸度無極，　　頒宣諸經典，　開化度眾生，　　辯才決眾疑，　稱譽於黎庶，　　除去眾想念。",
        "translation": "The verse then says, \"Establishing his mind on the path, he diligently cultivates the fundamentals of virtue, enters into the infinite number of liberations, promulgates the sutras, enlightens and educates sentient beings, eloquently resolves numerous doubts, praises the common people, and removes numerous conceptual errors.",
        "source": "T10n0292_001:0618c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事為精進。",
        "translation": "\"There are ten things that bodhisattvas do to exert themselves.",
        "source": "T10n0292_001:0618c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0618c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "講說一切眾生之界、識念經典之所歸趣、嚴淨一切諸佛世界、又當奉行諸菩薩戒、常忍一切眾難之患、為斷地獄餓鬼畜生燒煮之痛、降伏一切眾魔官屬、不令眾生懷瞋恨心、當奉十方諸佛世尊、常遇諸佛歸命諮受，是，族姓子！",
        "translation": "They will expound the realms of all sentient beings, consciously recollect the destinies of the sutras, and adorn and purify all the buddha-realms; they will practice the bodhisattva precepts; they will always endure the suffering of all difficulties; they will end the burning pain of hell, hungry ghosts, and animals; they will subdue all the officials of Māra; they will not allow sentient beings to harbor anger; they will serve the world-honored buddhas of the ten directions; they will always meet the buddhas and give their orders for their acceptance.",
        "source": "T10n0292_001:0618c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應行菩薩十事精進。」",
        "translation": "You should conduct the ten bodhisattva endeavors.\"",
        "source": "T10n0292_001:0618c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「歸命於諸佛，　　嚴淨眾佛土，　奉修菩薩行，　　忍一切苦惱，　斷三塗之難，　　降伏魔官屬，　能悅於眾生，　　常見諸如來。",
        "translation": "The verse then goes, \"I take refuge in the buddhas, adorn and purify the land of the buddhas, cultivate the bodhisattva practice, tolerate all suffering and distress, end the difficulties of the three destinies, subdue the officials of Māra, please sentient beings, and commonly encounter the tathāgatas.",
        "source": "T10n0292_001:0618c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事為勸信。",
        "translation": "\"There are ten things that bodhisattvas do to encourage faith.",
        "source": "T10n0292_001:0618c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0618c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常建立意，亦勸他人使發道心；仁和第一，無所諍訟，亦化他人立於欣悅；蠲除愚法，亦化他人令棄邪典，使住佛道；務求德本，亦勸他人使志善原；歸度無極，亦勸他人求波羅蜜；己生佛種，亦誘他人令務佛性；身已得入無所有法，開進他人使立空法；讚諸佛慧無所譏謗，示宣他人不毀正覺；具足普智，諸願純備，亦導他人成諸通慧；究竟道誓以得嚴淨如來、至真無盡之慧，亦當建立一切眾人入如來道；是為十事。」",
        "translation": "常建立意，亦勸他人使發道心；仁和第一，無所諍訟，亦化他人立於欣悅；蠲除愚法，亦化他人令棄邪典，使住佛道；務求德本，亦勸他人使志善原；歸度無極，亦勸他人求波羅蜜；己生佛種，亦誘他人令務佛性；身已得入無所有法，開進他人使立空法；讚諸佛慧無所譏謗，示宣他人不毀正覺；具足普智，諸願純備，亦導他人成諸通慧；究竟道誓以得嚴淨如來、至真無盡之慧，亦當建立一切眾人入如來道；是為十事。」",
        "source": "T10n0292_001:0618c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「已建立在道，　　亦化於他人，　心不懷諍訟，　　和悅忿恚者。",
        "translation": "He then spoke this verse, \"Having established himself on the path, he also converts others, keeping his mind free of quarrels and pleasing those who are angry.",
        "source": "T10n0292_001:0619a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　棄捐眾愚冥，　　開化癡邪徑，　常求眾德本，　　誘之住道義。",
        "translation": "Giving up the ignorance of many, he opens the path of folly and error, always seeking the roots of virtue, and entices them to abide in the meaning of the path.",
        "source": "T10n0292_001:0619a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事開化眾生。",
        "translation": "\"There are ten things that bodhisattvas do to enlighten sentient beings.",
        "source": "T10n0292_001:0619a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩布施誘進眾生，和顏悅色而勸進之；班宣經道令其亘然；誘進分別己身無異；所施無量發起人界；顯佛菩薩行誘眾生種；示諸世間如火然熾；訓教眾生無上道法；神足變化若干感動；曉了若干善權方便；隨其習俗度脫眾生；是為十事。」",
        "translation": "A bodhisattva's almsgiving induces sentient beings, encouraging them with a pleasant countenance; it proclaims the sūtras and paths so that they're unified; it induces them to discern their own identity as being without difference; it gives measureless gifts that give rise to the human realm; it reveals the bodhisattva's practice of inducing the seeds of sentient beings; it shows the world as a blazing fire; it instructs sentient beings on the unsurpassed way; it's a miraculous transformation that causes certain types of movement; it's a skillful method that understands certain good qualities; it liberates sentient beings according to their customs; these are the ten things.\"",
        "source": "T10n0292_001:0619a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「菩薩行布施，　　已用化眾生，　常和顏悅色，　　誘進諸不及。",
        "translation": "The verse then goes, \"The bodhisattva practices generosity, which is used to convert sentient beings, always looks pleasant, and entices those who don't measure up.",
        "source": "T10n0292_001:0619a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　覩世如然熾，　　顯示佛大道，　神足現變化，　　若干權方便。",
        "translation": "He sees the world as a blazing blaze, shows the Buddha's great way, and has miraculous powers and methods to display transformation.",
        "source": "T10n0292_001:0619a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩禁戒有十事。",
        "translation": "\"There are ten things that a bodhisattva precepts.",
        "source": "T10n0292_001:0619a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不捨道心、捐聲聞緣覺意、觀察一切眾生愍行、開化群萌令住佛法、奉修菩薩所應學者、解一切法悉不可得、所造德本勸助至道、未曾猗著於諸佛身、能忍諸法亦無所倚、濟護諸根以為禁戒；是為十事。」",
        "translation": "Not abandoning the mind of the path, abandoning the thoughts of śrāvakas and pratyekbuddhas, observing the compassionate actions of all sentient beings, enlightening the masses so that they abide in the Buddha-dharma, cultivating those whom bodhisattvas should learn, understanding that all things are unobtainable, creating the basis of virtue that encourages the ultimate path, never becoming absorbed in the bodies of the buddhas, tolerating all things without reliance, and protecting the faculties so that the precepts are upheld are ten things.\"",
        "source": "T10n0292_001:0619a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「常和於道心，　　捨聲聞、緣覺，　愍傷於眾生，　　勸使立佛法。",
        "translation": "The verse then goes, \"Always harmonizing with the mind of the path, he abandoned the śrāvakas and pratyekbuddhas, pitied sentient beings, and encouraged the establishment of the Buddha-dharma.",
        "source": "T10n0292_001:0619a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　學諸菩薩行，　　解法無所有，　一切所行德，　　勸助於佛道。",
        "translation": "He trains in the practices of bodhisattvas, understands that the Dharma is nonexistent, and encourages all the virtues he practices to aid the Buddha's path.",
        "source": "T10n0292_001:0619a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事受決，所見受決能自知之。",
        "translation": "\"There are ten things a bodhisattva is determined to do, and he can know for himself what he's seeing and what he's determined to do.",
        "source": "T10n0292_001:0619b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發仁和心、自然道意、不厭菩薩行、棄捐一切諸所妄想而能奉修諸佛之法、皆能篤信諸如來身所可宣說、亦以究暢成就德本、化於一切使住佛道、等敬親友而無二心、視諸善友如見諸佛、古昔所願將護佛道，是為十事受決。」",
        "translation": "Giving rise to a benevolent mind and a natural intention for the path, not tiring of bodhisattva practices, discarding all false notions and cultivating the teachings of the buddhas, faithfully believing in what the tathāgatas themselves can teach, accomplishing the roots of virtue with thoroughness, teaching all sentient beings to abide in the buddha path, equally honoring close friends without dual mind, regarding good friends as if they were seeing the buddhas, and vowing in the past to protect the buddha path are the ten things that are accepted and decided.\"",
        "source": "T10n0292_001:0619b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「等心敬善友，　　利義皆由之，　將護古昔願，　　清和發道意。",
        "translation": "He then spoke this verse, \"Equally honoring good friends is the cause of all their benefits and meanings, safeguarding past vows and clearly and harmoniously arousing the intention for the path.",
        "source": "T10n0292_001:0619b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不厭菩薩行，　　棄捐眾妄想，　使住諸佛法，　　篤信如來教。",
        "translation": "Not tiring of bodhisattva practices, they abandon all false notions, make them abide in the Buddha's teaching, and devote themselves to faith in the Tathāgata's teaching.",
        "source": "T10n0292_001:0619b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事不相求短。",
        "translation": "\"There are ten things that bodhisattvas don't seek shortchanging each other.",
        "source": "T10n0292_001:0619b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入於宿世本所誓願、隨時入行導習其便、不失正義皆得通入、諸度無極具足成就、隨其宜便、所可入者順從所願、隨其所樂以開化之、莊嚴剎土勸使入道、神足變化使從其教、普為示現所生之處，是為十事不相求短。」",
        "translation": "Entering the vows of past lives, he enters into practice at any time, guides its skillful performance, penetrates without losing the correct meaning, fully accomplishes the perfections, follows their expediency, conforms to what he wishes to enter, enlightens him according to his desire, adorns the buddha-lands and encourages him to enter the path, transforms his spiritual abilities and makes him follow his teaching, and universally shows where he's born, which are the ten things that are not mutually sought after.\"",
        "source": "T10n0292_001:0619b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「入於宿世願，　　世行隨宜便，　遵習不失節，　　順諸度無極。",
        "translation": "He then spoke this verse, \"Having entered into the vows of past lives, he follows worldly practices as appropriate, observes them without losing restraint, and conforms to the limitless liberal arts.",
        "source": "T10n0292_001:0619b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　因得大成就，　　從若干信樂，　為莊嚴佛土，　　以神足變化。",
        "translation": "They attain great accomplishment as a result, and from that certain faith, they adorn the Buddha's land with miraculous abilities and transformations.",
        "source": "T10n0292_001:0619b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事入於如來，去、來、現在一切諸佛所可由成。",
        "translation": "\"There are ten things that bodhisattvas enter into with the Tathāgata, which were, came, and are achievable by all the buddhas.",
        "source": "T10n0292_001:0619b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入於無量平等道教、而轉無限經法之輪、宣傳無量慧義之要、順從無際音聲通暢、開化無底眾生之類、顯暢無數神足變化、隨時遍至若干種形、入於無喻諸三昧定、照耀開悟不可計量、示力無畏顯現無限使入滅度，是為十事如來所入。」",
        "translation": "Entering the teaching of the path of infinite equality, turning the wheel of infinite sūtras and teachings, propagating the essentials of infinite wisdom, following the unbounded fluency of sounds and voices, enlightening bottomless classes of sentient beings, manifesting countless miraculous powers and transformations, readily reaching various forms, entering the samādhi concentration without metaphor, shining and awakening incalculably, and displaying powers and fearlessness that infinitely bring about deliverance are the ten things into which tathāgatas enter.\"",
        "source": "T10n0292_001:0619b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是頌曰：「過去、來、現在，　　一切諸如來，　入無量道教，　　轉無限法輪，　順無際道法，　　宣無底慧場，　開化無數人，　　神足不可計。",
        "translation": "The verse then says, \"Tathāgatas past, future, and present have all entered the teachings of measureless paths, turned the infinite wheel of the Dharma, followed the teachings of limitless paths, declared the site of bottomless wisdom, enlightened and transformed countless people, and their spiritual abilities are incalculable.",
        "source": "T10n0292_001:0619b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事入眾生性行。",
        "translation": "\"There are ten things that bodhisattvas do to enter the nature and conduct of sentient beings.",
        "source": "T10n0292_001:0619c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入於本行眾生所解；隨時開度當來受身；一切人民遍於群萌；現在所作入於眾生；善行本末；隨時救濟諸非法行；當宣道；眾生心性所入，曉了一切根原所趣；分別若干，隨所愛樂；發起諸礙、塵勞、愛欲，數數說法以度脫之；是為十事入眾生性。」",
        "translation": "He enters into the understanding of sentient beings in this life; at any time, he liberates the body of future recipients; he pervades all people; he enters into the lives of sentient beings in what he does now; he conducts himself in a good way, knowing at any time the origin of all unlawful actions; he proclaims the path; he enters into the nature of the minds of sentient beings, discerns certain things, follows their desires, and gives rise to obstacles, defilements, and cravings, explaining them repeatedly to liberate them; these are the ten things that enter into the nature of sentient beings.\"",
        "source": "T10n0292_001:0619c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「曉了過世行，　　亦復知當來，　分別現在事，　　眾生所可行。",
        "translation": "The verse then goes, \"He understands past worldly actions and also knows future ones, discriminating present things that are feasible for sentient beings.",
        "source": "T10n0292_001:0619c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　入於眾德行，　　亦遊於無德，　其心靡不周，　　使諸根成就。",
        "translation": "Entering into the practice of many virtues and also wandering about in the absence of virtue, their minds are not without variety, and they bring about the accomplishment of their faculties.",
        "source": "T10n0292_001:0619c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事入於世界。",
        "translation": "\"There are ten things that bodhisattvas do to enter the world.",
        "source": "T10n0292_001:0619c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常知止足、在於世間而修清淨無所沾污、處於俗間心存少求、演無極香薰諸迷惑、所入方俗如一土塵、周於無量微妙之義、亦遍曠然無量世界、度脫有身四大之患、恭敬自歸於諸佛道、亦復遊入無道天下，是為十事遊入世界。」",
        "translation": "He always knows his composure, cultivates purity and absence of defilement while in the world, conducts himself in the mundane realm with few expectations, produces the infinite fragrance that perfumes delusion, enters the local mundane world like a speck of dust, circumvents measureless subtle objects, pervades the vast and limitless world, frees himself from the four major afflictions of the physical body, respectfully returns himself to the buddha path, and also travels into the world without a path, which are the ten things that travel into the world.\"",
        "source": "T10n0292_001:0619c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「在世知止足，　　所行常清淨，　所入而少求，　　周遍無極業，　猶如塵世界，　　解微妙之行，　小大無不達，　　入於諸所有。",
        "translation": "The verse then goes, \"They know when they're in the world that they're satisfied, that their conduct is always pure, that they enter with few expectations, that they completely pervade limitless activity, that they're like the dusty world, that they understand subtle forms of conduct, that they're small and large, and that they enter all of them.",
        "source": "T10n0292_001:0619c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事，曉入諸念劫數靡所不達。",
        "translation": "\"There are ten things that bodhisattvas do that are so acute that they enter into all the eons of mindfulness that they don't reach.",
        "source": "T10n0292_001:0619c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0619c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知過去劫、曉當來對、知現在事、知有限世、識無限礙、入於有限無限之事、了諸有數無數劫事、於諸有數使入無為、令諸無念暢入有念、暢諸有念使入無念，是為十事曉了諸劫靡所不達。」",
        "translation": "To know past eons, understand future oppositions, know present events, know finite worlds, realize infinite obstructions, enter into finite and infinite events, comprehend the events of numberless and incalculable eons, cause existent thoughts to enter into nonexistence, and cause existent thoughts to enter into nonexistence are ten things that are not unobtainable when you comprehend eons.\"",
        "source": "T10n0292_001:0619c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「入於過去念，　　當來亦如是，　遊步在現世，　　而皆悉念之。",
        "translation": "He then spoke this verse, \"Entering mindfulness in the past, he'll do the same in the future, wandering through the present life, and he'll be mindful of them all.",
        "source": "T10n0292_001:0620a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　周流無量劫，　　有數若無數、　無念入有念、　　一切想無想。",
        "translation": "They circulate throughout measureless eons, whether numbered or numberless, without mindfulness they enter into mindfulness, and all thoughts are perceived without perception.",
        "source": "T10n0292_001:0620a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事，暢說三世而無二言。",
        "translation": "\"There are ten things that bodhisattvas do that are explained universally throughout the three worlds without saying two things.",
        "source": "T10n0292_001:0620a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十事？",
        "translation": "What are the ten things?",
        "source": "T10n0292_001:0620a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以過去而宣說之、往古以沒豫說當來、滅來久遠演現在處、尚未當來豫說過去、尚未欲至輒宣現在、亦復班宣未來生者、傳於現在忽以過去、解於現在謂之未來、目所覩者宣之平等、現了三世一時悉達，是為十事暢說三世。」",
        "translation": "He explains it in terms of the past, discusses the past as it disappeared, discusses the present as it's long since ceased, discusses the past as it's yet to come, announces the present as it's yet to come, and also announces those who will be born in the future, transmits the present and suddenly uses the past, understands the present as the future, and announces the equality of those whom he sees, fully comprehending the three times in one moment. These are the ten things that are explained universally in the three times.\"",
        "source": "T10n0292_001:0620a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「能說過去事，　　演古如是來，　說過為現在，　　亦暢當來事。",
        "translation": "He then spoke this verse, \"He could explain the events of the past, recount them as they were in the past, and explain them as they are in the present and as they will be in the future.",
        "source": "T10n0292_001:0620a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去、今、現在，　　未至豫演生，　解生現以過，　　目見今當來。",
        "translation": "Past, present, and present, they've yet to arrive, discussing birth, understanding birth in the present and past, and seeing the present and future with their eyes.",
        "source": "T10n0292_001:0620a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事入於三處。",
        "translation": "\"There are ten things that bodhisattvas do to enter the three places.",
        "source": "T10n0292_001:0620a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0620a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入諸有數、至無所念、到有所獲、趣諸有教、遊眾想處、歸眾方俗、暢眾言辭、達不可盡、諮嗟寂然、暢眾憺怕，是為十事入於三處。」",
        "translation": "Entering the three places in ten ways: 'Entering the many, reaching nothing, attaining something, heading for the teachings that exist, traveling to the place of conception, returning to the commonplace in many directions, speaking fluently, attaining inexhaustibility, consulting with contempt and calmness, and accompanying the many with fear.'",
        "source": "T10n0292_001:0620a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「入眾有所念，　　有所得教授，　在想眾方俗，　　所念不可盡。",
        "translation": "The verse then says, \"They enter the many places where there's mindfulness, where there's a teaching that's attained, and where there's conception of the commonplace in many directions that's inexhaustibly recollected.",
        "source": "T10n0292_001:0620a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宣傳寂然事，　　亦入於憺怕，　滅除諸惡事，　　如是成道意。",
        "translation": "They publicize quiescent things, enter into fear, and cease bad things, thus accomplishing the intention of the path.",
        "source": "T10n0292_001:0620a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事，無厭其所發心，無所缺漏。",
        "translation": "\"There are ten things that bodhisattvas do without tire, which are not missing from the mind that they arouse.",
        "source": "T10n0292_001:0620a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0620a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養諸佛，住在眾色而不懈惓；敬順一切諸善、親友；求諸經典，不以為難；博聞眾經，啟受不逮；發意之頃頒宣經道；開化眾生，示以法律；發起一切使至佛道；於無數劫住一世界修菩薩行；普遊諸國，靡不周遍；未曾懷疑佛諸經典，問則發遣；是為十事發心無厭，無所缺漏。」",
        "translation": "He makes offerings to the buddhas, abides in many forms without tire, pays respect to all his good friends and relatives, seeks out the sūtras without making them difficult, he has heard widely of the scriptures and has never failed to inspire them, in the moment he arouses his mind, he announces the path of the scriptures, enlightens sentient beings and shows them the way, initiates all those who will make it to the buddha path, abides in one world for countless eons cultivating the bodhisattva practice, travels to all the countries and doesn't fail to pervade them, asks questions about the buddhas' sūtras, and sends them away, making these ten things an unwearying and uncontaminated effort.\"",
        "source": "T10n0292_001:0620a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「供養諸佛身，　　不以為厭足，　亦順眾善友，　　務求諸經典。",
        "translation": "He then spoke this verse, \"Making offerings to the buddha's body is not considered sufficient, and he follows the good friends who strive to pursue the sutras.",
        "source": "T10n0292_001:0620b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所求不懈倦，　　見諸發心者，　為說道訓教，　　開化諸菩薩。",
        "translation": "They don't tire of their pursuits, meet those who arouse their minds, teach the way, and enlighten the bodhisattvas.",
        "source": "T10n0292_001:0620b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事分別諸辯。",
        "translation": "\"Bodhisattvas have ten things to discern between arguments.",
        "source": "T10n0292_001:0620b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0620b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別眾生所入辯慧、曉了諸根當可歸趣、了諸罪福諸所報應、覩其所生在於何處、皆知世間諸所有無、覩見諸佛之所遊居、曉了經法義理深淺、暢解法界之所存沒、達於三世——去、來、現——事、亦能分別不可計數所行言慈，是為十事菩薩諸辯。」",
        "translation": "The eloquence and wisdom that discerns what sentient beings enter, understands the sense faculties' likely destinations, discerns the rewards of sins and merits, sees where they're born, knows the world's existence and nonexistence, sees where the buddhas travel, understands the depth and principle of the sūtras and Dharma, comprehends the existence and disappearance of the Dharma realm, and comprehends the three worlds-past, future, and present-as well as the incalculable words and compassion that are practiced, these are the ten things of a bodhisattva's eloquence.\"",
        "source": "T10n0292_001:0620b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「曉眾生所知；　　諸根之所趣，　隨所立罪福，　　見之當所生。",
        "translation": "The verse then says, \"They know what sentient beings know, what their faculties are headed, and what sins and merits are established according to their views, and they see what's likely to arise.",
        "source": "T10n0292_001:0620b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　分別諸世界；　　亦曉了法品，　究暢佛道慧，　　三世之本末。",
        "translation": "He discerns the worlds, also understands the qualities of the Dharma, and he thoroughly penetrates the Buddha's wisdom of the path and the origins and destinies of the three worlds.",
        "source": "T10n0292_001:0620b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事逮得總持。",
        "translation": "\"There are ten things that bodhisattvas acquire to maintain in a comprehensive way.",
        "source": "T10n0292_001:0620b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0620b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "博有所聞輒則奉持；懷抱經典，悉不忘失；執法錠燎，有所宣化皆從方便解諸經典；曉法自然，逮法光明，致諸佛道不可思議；執諸定意，現在聞佛，面前啟受尋奉行法；入道場音，能隨方俗演出言辭不可思議；念三世事、去來今佛不可計法，隨時宣傳；懷若干辯一切諸佛經典之要；耳所聞誼不可稱限，所興聖慧能暢諸聽；持諸佛法，建立如來十力、無畏；是為十事菩薩總持。」",
        "translation": "博有所聞輒則奉持；懷抱經典，悉不忘失；執法錠燎，有所宣化皆從方便解諸經典；曉法自然，逮法光明，致諸佛道不可思議；執諸定意，現在聞佛，面前啟受尋奉行法；入道場音，能隨方俗演出言辭不可思議；念三世事、去來今佛不可計法，隨時宣傳；懷若干辯一切諸佛經典之要；耳所聞誼不可稱限，所興聖慧能暢諸聽；持諸佛法，建立如來十力、無畏；是為十事菩薩總持。」",
        "source": "T10n0292_001:0620b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「博聞輒執持，　　不忘一切法，　曉了隨時說，　　解諸法自然。",
        "translation": "The verse then goes, \"He is well-versed and readily retains them, doesn't forget all the teachings, understands them at any time, and comprehends the naturalness of all dharmas.",
        "source": "T10n0292_001:0620c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以法大光明，　　不可思議慧，　現在得三昧，　　目前聞經典。",
        "translation": "With the great radiance of the Dharma and inconceivable wisdom, he now attains samādhi and currently hears the sūtras.",
        "source": "T10n0292_001:0620c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事為頒宣佛道。",
        "translation": "\"There are ten things a bodhisattva does to proclaim the Buddha Way.",
        "source": "T10n0292_001:0620c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0620c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了道議、志誓大願、分別罪福之所歸趣、常住正覺、不懷自大、暢達法界、識知定意、明解心本、曉了本淨、隨本而覺使成佛道，是為十事菩薩班宣佛道。」",
        "translation": "To fully understand the concept of the path, vow to make a great vow, discern the destination of sins and merits, always abide in right awakening, harbor no pride, comprehend the Dharma realm, know the mind's origin, understand the mind's origin, comprehend the original purity, and awaken to the Buddha Way according to the origin is the ten things the bodhisattvas do to proclaim the Buddha Way.\"",
        "source": "T10n0292_001:0620c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「曉了於佛道，　　解願知罪福，　為諸佛所立，　　解法無自大，　分別心本淨，　　定意之所歸，　本淨亦自然，　　隨本而覺悟。」",
        "translation": "The verse then goes, \"They fully understand the Buddha Way, understand the vows and know sins and merits, are established by the buddhas, understand that the Dharma is without its own greatness, discern that the mind is originally pure, set their minds on what to aim for, are originally pure and natural, and awaken according to the origin.\"",
        "source": "T10n0292_001:0620c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是時，三千世界為大震動，其大光明普照十方。",
        "translation": "When the Buddha said this, the 3,000 worlds shook greatly, and his great radiance shone universally in the ten directions.",
        "source": "T10n0292_001:0620c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天、龍、神皆來散華，以諸音樂來娛樂佛，歡喜悅豫，皆共欣慶：「幸哉！",
        "translation": "The gods, dragons, and spirits all came to scatter flowers and entertain the Buddha with music, rejoicing and celebrating together, \"How fortunate!",
        "source": "T10n0292_001:0620c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等宿世其德純厚得豫此會，服深妙議無極道慧，何其祿厚。",
        "translation": "In our prior lives, our virtues were so pure that we were able to attend this meeting, and we've received such profound and sublime advice and wisdom about the infinite way that it's been so rewarding.",
        "source": "T10n0292_001:0620c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊能仁十方慈恩開示法藏，療治盲冥，消化五陰、六衰、三毒、五蓋、十二因緣、六十二見。",
        "translation": "The Bhagavān Nengren's benevolence in ten directions revealed the Dharma treasure, cured blindness and ignorance, and digested the five aggregates, six decayers, three poisons, five hindrances, twelve causes and conditions, and sixty-two views.",
        "source": "T10n0292_001:0620c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示以五事：戒、定、慧、解、度知見品，五眼，六通，六度無極——布施、持戒、忍辱、精進、一心、智慧——以成佛道。",
        "translation": "He showed them five things: morality, meditation, wisdom, understanding, the knowledge and vision of the perfections, the five eyes, the six powers, and the limitless six perfections--giving, observing precepts, forbearance, effort, unity of mind, and wisdom--in order to achieve the Buddha Way.",
        "source": "T10n0292_001:0620c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "班宣開示十二部經，開化邪見六十二疑使發道意，諸佛遙讚、菩薩悅豫。」",
        "translation": "Ban Xuan reveals twelve scriptures, enlightens sixty-two doubts about wrong views, and causes them to arouse the intention for the path, which the buddhas praise in a distance and the bodhisattvas rejoice over.\"",
        "source": "T10n0292_001:0620c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普智菩薩復問普賢：「何謂發菩薩心？",
        "translation": "Again, Samantabhadra Pūrṇa asked Samantabhadra, \"What does it mean to arouse the bodhisattva aspiration?",
        "source": "T10n0292_001:0620c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂行法？",
        "translation": "What is meant by the practice of the Dharma?",
        "source": "T10n0292_001:0620c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂大哀？",
        "translation": "What is meant by great pity?",
        "source": "T10n0292_001:0620c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂緣發道心，以其所緣而興其意？",
        "translation": "What is meant by the conditioned arousal of the mind of the Way, which gives rise to its intention by means of its condition?",
        "source": "T10n0292_001:0620c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂見善友發恭恪心？",
        "translation": "What does it mean to see a good friend and become respectful?",
        "source": "T10n0292_001:0620c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩逮得清淨？",
        "translation": "What is meant by a bodhisattva acquiring purity?",
        "source": "T10n0292_001:0620c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂度無極？",
        "translation": "What is meant by the supreme perfection?",
        "source": "T10n0292_001:0620c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂佛慧？",
        "translation": "What is buddha's wisdom?",
        "source": "T10n0292_001:0620c28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂所歷？",
        "translation": "What is meant by experienced?",
        "source": "T10n0292_001:0620c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩力？",
        "translation": "What is meant by bodhisattva power?",
        "source": "T10n0292_001:0620c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂平等？",
        "translation": "What is meant by equality?",
        "source": "T10n0292_001:0620c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂生覺聖？",
        "translation": "What is meant by the noble one who gives rise to enlightenment?",
        "source": "T10n0292_001:0620c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂說法？",
        "translation": "What is meant by expounding the Dharma?",
        "source": "T10n0292_001:0620c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂而行奉持？",
        "translation": "What does it mean to practice and uphold?",
        "source": "T10n0292_001:0621a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂辯才？",
        "translation": "What is meant by eloquence?",
        "source": "T10n0292_001:0621a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂無數？",
        "translation": "What is meant by countless?",
        "source": "T10n0292_001:0621a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為行等心？",
        "translation": "What is meant by a mind equal in practice?",
        "source": "T10n0292_001:0621a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂行慧？",
        "translation": "What is the wisdom of practice?",
        "source": "T10n0292_001:0621a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而不自大？」",
        "translation": "What is meant by a bodhisattva who is not arrogant?\"",
        "source": "T10n0292_001:0621a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普賢菩薩答曰：「善哉！",
        "translation": "Samantabhadra replied, \"Good!",
        "source": "T10n0292_001:0621a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子所問甚為深妙，何其快哉。",
        "translation": "The Buddha-child's question is so profound and subtle, how could it be so pleasant?",
        "source": "T10n0292_001:0621a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽諦聽，今為仁說。」",
        "translation": "Listen closely, listen closely, and I'll explain it for you, sir.\"",
        "source": "T10n0292_001:0621a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普智菩薩與諸大眾受教而聽。",
        "translation": "The Bodhisattva Samantabhadra and the crowd accepted the teaching and listened.",
        "source": "T10n0292_001:0621a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普賢菩薩言：「有十事發菩薩心。",
        "translation": "Samantabhadra Bodhisattva said, \"There are ten things that give rise to the bodhisattva's aspiration.",
        "source": "T10n0292_001:0621a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0621a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發心之時常懷大慈，護持一切眾生之類；所行憐愍，察於人民勤苦之惱如身自更，一切所有皆能惠施；念一切智，心則為原首；念一切智故能發意不毀聖誼；興從嚴心，學諸菩薩禁戒之要；其心堅固亦如金剛，蠲除一切諸惡垢濁；其所生意若如江海，導御一切諸清白法；其志強固如須彌山，則能堪忍眾庶言辭、善惡音聲；其所發心造立永安，施於眾生大誠信業而心獨步；智度無極，曉了諸法，隨便將護；是為十事發菩薩心。」",
        "translation": "發心之時常懷大慈，護持一切眾生之類；所行憐愍，察於人民勤苦之惱如身自更，一切所有皆能惠施；念一切智，心則為原首；念一切智故能發意不毀聖誼；興從嚴心，學諸菩薩禁戒之要；其心堅固亦如金剛，蠲除一切諸惡垢濁；其所生意若如江海，導御一切諸清白法；其志強固如須彌山，則能堪忍眾庶言辭、善惡音聲；其所發心造立永安，施於眾生大誠信業而心獨步；智度無極，曉了諸法，隨便將護；是為十事發菩薩心。」",
        "source": "T10n0292_001:0621a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「而發大哀心，　　將護於眾生，　見之在苦惱，　　愍之如己身。",
        "translation": "The verse then goes, \"He arouses a mind of great compassion, protects sentient beings, sees them in distress, and pities them as himself.",
        "source": "T10n0292_001:0621a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　思惟一切智，　　得志所莊嚴，　其心如金剛，　　智慧如江海。",
        "translation": "He contemplates all kinds of wisdom, attains the adornment of intention, and his mind is like adamant, and his wisdom is like a river and an ocean.",
        "source": "T10n0292_001:0621a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事行普賢法。",
        "translation": "\"There are ten things that bodhisattvas do to practice the Dharma of Samantabhadra.",
        "source": "T10n0292_001:0621a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0621a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於當來劫與一切俱，普願行仁；奉敬未至如來、至真等處色法；開化眾生立菩薩行；積眾德本而誓普賢；皆能遊入諸度無極；所願和雅，具菩薩行，遵修諸法；皆欲莊嚴諸佛世界平等諸議，受生一切十方佛國；曉了方便，求眾經典；悉樂現生於諸佛土；逮成無上正真之道；是為十事菩薩行法。」",
        "translation": "In the coming eon, he and all the others will universally vow to practice kindness; he'll pay respect to the Tathāgatas who have yet to arrive and to the true and equipoised form and dharma; he'll enlighten sentient beings and establish the bodhisattva practice; he'll accumulate the roots of many virtues and vow to be universally virtuous; he'll be able to travel to the infinity of the perfections; he'll be elegant in what he wishes, complete in the bodhisattva practices, and abide by the cultivation of all dharmas; he'll want to adorn the buddha-world with discussions of equality and accept birth in all the ten buddha lands; he'll understand the methods and seek out the scriptures; he'll be delighted to be born in the buddha lands; he'll achieve the unsurpassed true path; these are the ten things of the bodhisattva practices.\"",
        "source": "T10n0292_001:0621a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「悉知當來劫，　　奉敬諸如來，　菩薩等眾生，　　所誓普賢行。",
        "translation": "The verse then goes, \"We all know the eons to come, revere the tathāgatas, and the bodhisattvas and other sentient beings who vow to conduct themselves as universally virtuous.",
        "source": "T10n0292_001:0621a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　積累眾德本，　　入諸度無極，　莊嚴諸佛土，　　疾成無上覺。",
        "translation": "Accumulating the roots of many virtues, they enter the peerless stages of perfection, adorn the buddha lands, and quickly become unsurpassedly enlightened.",
        "source": "T10n0292_001:0621b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事常行大哀。",
        "translation": "\"There are ten things that bodhisattvas always do with great compassion.",
        "source": "T10n0292_001:0621b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0621b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀於眾生孤獨無種為興大哀、察之無道化以大悲、見貧厄眾令殖德本、將久眠寐使得覺悟、見眾生界無有方便化之隨時、為諸貪欲所繫縛者而勸護之、瞻於群萌所遭厄難愍之令濟、覩久疾病療之以慈哀、離善法者顯示道議、若見眾生失於佛法愍哀悅豫，是為十事菩薩大哀。」",
        "translation": "To observe that sentient beings are alone and lack seeds and to give rise to great compassion, to examine their lack of path and teach them with great compassion, to see poor and disadvantaged sentient beings and cause them to cultivate their roots of virtue, to sleep for a long time and make them awaken, to see that the sentient realm has no skillful means to teach them at any time, to encourage and protect those bound by craving, to look at the difficulties that beset sentient beings and cause them to be relieved, to see long-standing illnesses and treat them with compassion, to show the Way's advice to those who have left the good Dharma, and to sympathize and rejoice when they see sentient beings who have lost the Dharma are ten things of great compassion to the bodhisattvas.\"",
        "source": "T10n0292_001:0621b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「在世行大哀，　　觀察於眾生，　久遠遭疾厄，　　由斷德本故。",
        "translation": "The verse then goes, \"He exercises great compassion in the world, observing sentient beings who have suffered illness and trouble for a long time because he has cut off the roots of virtue.",
        "source": "T10n0292_001:0621b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為興無蓋哀，　　建立於佛道，　菩薩行大慈，　　以開化眾生。",
        "translation": "To engender unhindered compassion and establish the Buddha Way, the bodhisattva practices great kindness to enlighten sentient beings.",
        "source": "T10n0292_001:0621b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事緣發道心。",
        "translation": "\"There are ten things that cause a bodhisattva to arouse the aspiration for enlightenment.",
        "source": "T10n0292_001:0621b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0621b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教誨眾生令順誼律而發道心、欲除一切眾苦惱患、建立人民使意永安、見於群萌在無明地使發道意、好勸眾生使入佛慧、順隨正覺奉敬一切諸佛最聖、皆欲得見如來、至真、亦復樂覩諸佛色像相好威容、亦復愛喜入諸佛道故發大意、亦復敬愛十力無畏，是為十事緣發道心。」",
        "translation": "He teaches sentient beings to conform to the rules of propriety and give rise to the mind of the path, wants to remove all suffering and affliction, builds up the people so that their minds are permanently at ease, sees the sentient beings in the land of nescience and gives rise to the mind of the path, encourages sentient beings to enter the Buddha's wisdom, follows right awakening and venerates all the buddhas as most noble, wants to see the Tathāgata and the supreme truth, is delighted to see the buddhas' appearance and good looks, has great intentions because he loves and delights in entering the buddha path, and venerates the ten powers and fearlessness as the ten conditions for giving rise to the mind of the path.\"",
        "source": "T10n0292_001:0621b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「見眾生所滅，　　為惱患所縛，　欲令至永安，　　故發菩薩心。",
        "translation": "The verse then goes, \"Seeing what ceases in sentient beings, bound by affliction and suffering, and wanting to bring about permanent peace, they therefore arouse the bodhisattva's mind.",
        "source": "T10n0292_001:0621b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人民在無智，　　勸示以佛慧，　令奉三界將，　　常覩諸如來。",
        "translation": "While the people lack knowledge, he encourages and shows them the Buddha's wisdom, making them serve the generals of the three realms and always see the Tathāgatas.",
        "source": "T10n0292_001:0621b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩見善友發恭恪心，菩薩初發正真道意，與善友俱謙下恭順，欲得務成佛一切智，故習善友為之屈意。",
        "translation": "\"When a bodhisattva sees a good friend and becomes respectful, the bodhisattva first arouses the true intention for the path, is humble and deferential with that good friend, and wants to work toward achieving the Buddha's omniscience, so he accords with that good friend to bend his mind to it.",
        "source": "T10n0292_001:0621b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「見善友發意有十事。",
        "translation": "\"There are ten things that come from seeing a good friend's aspiration.",
        "source": "T10n0292_001:0621c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0621c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉敬自歸、心無愛欲、如所聞音則能奉行、心愛樂之、志不瑕穢、常一其心、以諸德本合為一業、懷抱一願發世尊意、其志平等、所行具足，是為十見善親友發恭恪心。」",
        "translation": "Respectfully taking refuge in himself, his mind lacks desire, he conforms to the sounds he hears, his heart is pleased with them, his intentions are not defiled, and he's always unified in mind; he combines the fundamentals of virtues into a single action, harbors the single vow, and gives rise to the thoughts of the world-honored one; his intentions are equal, and his actions are complete. This is called the ten views of good friends and relatives that engender a respectful mind.\"",
        "source": "T10n0292_001:0621c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「心常懷恭恪，　　如所聞奉行，　如喜無瑕穢，　　其意常專一。",
        "translation": "The verse then goes, \"His mind is always respectful, as he hears and conducts himself, as his joy is unsullied, and his intentions are always focused.",
        "source": "T10n0292_001:0621c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　合集眾德本，　　自歸於世尊，　常尊平等行，　　道心乃具成。",
        "translation": "Gathering the roots of many virtues, he takes refuge in the Bhagavān, always honoring equal conduct, and then his mind of enlightenment is complete.",
        "source": "T10n0292_001:0621c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩清淨有十事。",
        "translation": "\"There are ten things that make a bodhisattva pure.",
        "source": "T10n0292_001:0621c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0621c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨如虛空，究竟無失；於諸色淨，隨眾生本而開化之；諸音清淨，演不可誼言辭眾響；其辯才淨，分別無量佛所說法；其慧清淨，皆棄無智；所生亦淨，得諸菩薩自在由己；眷屬微妙，曉了眾生宿世所行而開化之；報應亦淨，除去一切罣礙、陰蓋；所願解明，解諸菩薩所生一品；其行皦然，出普賢乘；是為十事得清淨。」",
        "translation": "They are pure as space, with no loss of the ultimate; they are pure in form, transforming sentient beings according to their origin; they are pure in sound, uttering multitudes of unspeakable words; they are pure in eloquence, discerning the teachings of measureless buddhas; they are pure in wisdom, discarding ignorance; they are pure in what is produced, attaining the freedom of the bodhisattvas to do as they please; they are subtle in their dependents, understanding the past lives of sentient beings and transforming them; they are pure in what is rewarded, removing all obstructions and hindrances; they are clear in understanding what is desired, understanding the single category of birth of the bodhisattvas; they are sparkling in their practice, emerging from the vehicle of Samantabhadra; these are the ten things that are purified.\"",
        "source": "T10n0292_001:0621c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰(丹本注云，諸本闕頌)。",
        "translation": "He then spoke in verse (the Dan edition notes say that the verse is missing from the texts).",
        "source": "T10n0292_001:0621c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事逮度無極。",
        "translation": "\"There are ten things that bodhisattvas do to attain unsurpassed freedom.",
        "source": "T10n0292_001:0621c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0621c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行度無極，一切所有皆能布施；戒度無極，具足佛禁；忍度無極，能行仁和，逮佛淨力；進度無極，所行勤修而不退轉；寂度無極，使意一定；智度無極，觀一切法本自然諦；慧度無極，入佛十力；願度無極，具足普賢；神足度無極，多所變化，無所不現；法度無極，等御一切諸法本末；是為菩薩十度無極。",
        "translation": "The perfection of practice, which enables one to give generously to all that exists; the perfection of precepts, which fulfills the Buddha's prohibitions; the perfection of forbearance, which enables one to practice kindness and harmony and acquires the Buddha's purifying power; the perfection of progress, which engages in diligent cultivation and doesn't regress; the perfection of quiescence, which focuses the mind; the perfection of wisdom, which observes the innate truth of all things; the perfection of wisdom, which enters the Buddha's ten powers; the perfection of vows, which fully embodies Samantabhadra; the perfection of spiritual abilities, which are varied and never fail to appear; and the perfection of the Dharma, which equally guides the fundamentals of all things; these are the bodhisattva's ten perfections.",
        "source": "T10n0292_001:0621c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此，得歸無上如來、正真無極大慧，具足六度。」",
        "translation": "Abiding here, the bodhisattva attains the unsurpassed tathāgata, correct and true infinite great wisdom, and the fulfillment of the six perfections.\"",
        "source": "T10n0292_001:0621c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「布施度無極，　　皆能施所有；　持戒度無極，　　清淨佛諸行；　忍辱度無極，　　仁和不懷恚；　精進度無極，　　勤修不退還；　一心度無極，　　志定無憒亂；　智慧度無極，　　觀諸法自然；　神通度無極，　　普入佛道力；　所願行平等，　　神足道諸法。",
        "translation": "The verse then goes, \"The degree of generosity is limitless, for they all give what they have; the degree of observing precepts is limitless, for they purify the Buddha's ways; the degree of tolerating is limitless, for they are kind and peaceful and don't harbor anger; the degree of diligence is limitless, for they diligently cultivate and don't retreat; the degree of unity of mind is limitless, for their concentration is unconfused; the degree of wisdom is limitless, for they contemplate the spontaneity of things; the degree of psychic abilities is limitless, for they universally enter the power of the Buddha's path; and the practices they desire are equal, for they are the spiritual feet of the path's teachings.",
        "source": "T10n0292_001:0621c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事慧。",
        "translation": "\"Bodhisattvas have the wisdom of ten things.",
        "source": "T10n0292_001:0622a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉解一切十方世界其眾生種不可思議；識別諸宗、曉了諸法，不失時節；若干種形若以一品皆令覺知；達諸法界，能班宣慧；曉了一切虛空本末，通使無餘第一佛慧；十方世界諸過去事皆能知之；十方佛土諸當來事悉能見之；十方佛國今現在事普入教化；曉願如來一切諸行，具入一切慧；解知去來今現在佛皆同一行，是為菩薩十慧義。",
        "translation": "He understands all the unfathomable varieties of sentient beings in the world in the ten directions, discerns doctrines and understands dharmas without losing time, makes certain forms known in a single class, reaches the realms of reality, and is able to work with wisdom to proclaim them, understands the fundamentals of all of space, and makes the wisdom of the first Buddha without remainder; he knows all the past events in the world in the ten directions, sees all the future events in the Buddha lands of the ten directions, thoroughly enters into the teaching of the present events in the Buddha lands of the ten directions, understands the wishes of the Tathāgata and enters into all wisdom, and knows that the past, future, and present buddhas are all the same practice, which is the meaning of the bodhisattva's ten kinds of wisdom.",
        "source": "T10n0292_001:0622a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此，其大光明自在照耀，具足所願，信諸佛法，則以一慧解諸佛法。」",
        "translation": "When a bodhisattva abides here, his great radiance shines freely, he fulfills his vows, believes in the Buddha's teaching, and then understands the Buddha's teaching with a single wisdom.\"",
        "source": "T10n0292_001:0622a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「能知十方界，　　眾生不可計，　普令入道慧，　　使無若干念。",
        "translation": "The verse then goes, \"He can know the worlds of the ten directions, where sentient beings cannot be counted, and he universally causes them to enter the wisdom of the path so that there aren't many kinds of mindfulness.",
        "source": "T10n0292_001:0622a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能分別諸法，　　平等如虛空，　佛慧為第一，　　能達三世事。",
        "translation": "He can discern qualities that are equal as space, and Buddha's wisdom is the greatest, able to comprehend the affairs of the three worlds.",
        "source": "T10n0292_001:0622a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事而有所歷。",
        "translation": "\"There are ten things that bodhisattvas experience.",
        "source": "T10n0292_001:0622a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉解諸法為一品義、一切經典而有節限、曉了諸慧則為一相、分別眾生心念行慧無為無數、見諸群黎皆以一等、明識眾生所行塵勞、人民志性繫縛在行、明識眾生所行善惡、一切菩薩所行志願樂不自大、如來十力建立無餘而上正覺，是為十事菩薩經歷。」",
        "translation": "Fully understanding the meaning of all dharmas as one class, all scriptures as limited, comprehending wisdom as one aspect, discerning the mindfulness of sentient beings' actions and wisdom as countless, seeing all the living beings as one, clearly recognizing the defilements performed by sentient beings, the people's aspirations as fetters to their actions, clearly recognizing the good and bad performed by sentient beings, the aspirations and vows performed by all bodhisattvas as not being arrogant, and establishing the ten powers of the Tathāgata without remainder and ascending to right awakening are the ten things bodhisattvas experience.\"",
        "source": "T10n0292_001:0622a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「知諸法為一，　　解了際限故，　眾慧合一相，　　眾生心無數。",
        "translation": "The verse then goes, \"They know that all things are one, understand their limits, unite the characteristics of wisdom, and make the minds of sentient beings countless.",
        "source": "T10n0292_001:0622a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　解見諸人民，　　塵勞行所迷、　眾結所縛束，　　不得普智心。",
        "translation": "Understanding the views of people, deluded by their laborious deeds and bound by numerous fetters, they aren't able to universally know their minds.",
        "source": "T10n0292_001:0622b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事力。",
        "translation": "\"Bodhisattvas have the power of ten things.",
        "source": "T10n0292_001:0622b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法皆入自然；諸有經典悉如所化，眾義若幻；計諸法數皆為佛法；諸所經典悉無所倚；一切所有歸三脫門；見眾善友重事奉敬；心習勢力；以眾德本入無上慧道王之堂；未曾誹謗深微之慧；信樂諸佛一切智心，終不退轉善權力故；是為十事菩薩之力。」",
        "translation": "All things come naturally, all scriptures are like what's being taught, and all meanings are illusory; all dharmas are counted as Buddha dharmas, all scriptures have no support, and all things belong to the gate of triple liberation; seeing all good friends, venerating them with respect, and cultivating strength in mind; entering the hall of the king of the unsurpassed path of wisdom based on many virtues; never denigrating profound and subtle wisdom; believing in the Buddha's omniscience and mind and never turning away from it with good power; these are the ten powers of a bodhisattva.\"",
        "source": "T10n0292_001:0622b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「一切法自然，　　皆如幻化力；　諸法悉佛法，　　義歸三脫門。",
        "translation": "He then spoke this verse, \"All things that are natural are like the power of illusion and transformation, and all things are the Buddha's teaching, the meaning of which goes to the gate of triple liberation.",
        "source": "T10n0292_001:0622b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　奉敬眾善友，　　常積眾德本，　入無上慧堂，　　篤信佛深法。",
        "translation": "They honor many good friends, always accumulate the roots of merit, enter the hall of unsurpassed wisdom, and devote themselves to faith in the Buddha's profound teaching.",
        "source": "T10n0292_001:0622b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩平等有十事。",
        "translation": "\"There are ten things that make a bodhisattva equal.",
        "source": "T10n0292_001:0622b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等心眾生、亦等諸法、普觀佛土、性行無二、因諸德本、等諸菩薩、所願無異、諸度無極亦無差別、一切諸行皆歸同像、十方諸佛悉為一佛，是為十平等。」",
        "translation": "Equally mindful of sentient beings, they are also equal to the teachings, universally observe the buddha-lands, have no dual natures or practices, have the same root of virtues, are equal to the bodhisattvas, have no differences in what they desire, have no limits or distinctions in the perfections, have all their practices return to the same image, and all the buddhas of the ten directions are one Buddha, which is called the ten kinds of equality.\"",
        "source": "T10n0292_001:0622b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「等心念眾生，　　普觀眾經典；　亦等諸剎土，　　性行不懷二。",
        "translation": "The verse then goes, \"Equally mindful of sentient beings, they universally audience the scriptures, and equally mindful of the buddhas, their natures and deeds are not two.",
        "source": "T10n0292_001:0622b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆合諸德本，　　菩薩常行慈，　所願無若干，　　具諸度無極。",
        "translation": "They are all united with the roots of virtues, and the bodhisattvas always practice kindness, wishing for nothing in excess and bringing about the infinitude of all perfections.",
        "source": "T10n0292_001:0622b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事發覺聖。",
        "translation": "\"There are ten things a bodhisattva does to discover what's noble.",
        "source": "T10n0292_001:0622b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法但有音耳、皆歸寂然、諸法如幻、經義若影、目所見者悉因緣合、諸義業淨、一切諸法悉假文字、諸事之業因其本淨、道慧無想究盡本原、諸有形者皆由法界，是為十生覺聖。」",
        "translation": "All things that exist but have sounds and ears all return to quiescence, all things are illusory, the meanings of sūtras are like shadows, everything the eye sees is combined by causes and conditions, the activities of meanings are purified, all things are nominal in words, the activities of things are purified by their origin, the wisdom of the path has no conceptions and investigates their origin, and all things that have form come from the Dharma realm. These are the ten sages of awakening who are born.\"",
        "source": "T10n0292_001:0622b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「諸法悉寂然，　　譬之如幻化，　假喻若影響，　　皆由因緣生。",
        "translation": "The verse then goes, \"All dharmas are quiescent, likened to illusory transformations, and if they are affected by nominal expressions, they all arise from causes and conditions.",
        "source": "T10n0292_001:0622b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法本末淨，　　一切無所生，　悉因其本際，　　無想為真諦。",
        "translation": "The origin and derivatives of all dharmas are purified, and nothing arises from their original end, which is the true truth of no ideation.",
        "source": "T10n0292_001:0622c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩說法有十事。",
        "translation": "\"There are ten things that bodhisattvas teach about the Dharma.",
        "source": "T10n0292_001:0622c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "演深妙法、所說義者隨時得入、講若干事、當多宣暢諸通慧事、亦能分別諸度無極、宣示如來十種力事、解三世義、常說菩薩不退轉法、諮嗟諸佛功訓之德、班宣菩薩、諸佛、如來平等出家，是為十事菩薩說法。」",
        "translation": "Expounding profound and subtle principles, making their meanings readily accessible, teaching certain things, making many announcements about the things of penetrating wisdom, discerning the limitlessness of the perfections, declaring the ten kinds of power of the tathāgatas, understanding the meaning of the three worlds, always teaching the irreversibility of bodhisattvas, consulting the virtues of the Buddha's teachings, and classically proclaiming the equality of bodhisattvas, buddhas, and tathāgatas as renunciant practitioners are the ten things bodhisattvas teach.\"",
        "source": "T10n0292_001:0622c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「講說深妙法，　　悉使入道義，　演若干之慧，　　多宣一切智。",
        "translation": "The verse then goes, \"He teaches the profound and subtle Dharma, fully initiates them into the meaning of the path, expounds various kinds of wisdom, and proclaims much about all cognition.",
        "source": "T10n0292_001:0622c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　演諸度無極，　　顯示十種力，　三世無罣礙，　　菩薩不退轉。",
        "translation": "He explains the limitlessness of the perfections, demonstrates the ten powers, is unobstructed in the three times, and is a bodhisattva who doesn't turn back.",
        "source": "T10n0292_001:0622c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事而行奉行。",
        "translation": "\"There are ten things that bodhisattvas do and adhere to.",
        "source": "T10n0292_001:0622c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "積累一切諸善德本；聞諸如來講說經典輒能受持；執一切現，舉喻說之；御導一切奉行法門；懷抱總持道義慧門；皆能斷除狐疑、諸著；悉以具足諸菩薩行；一切如來辯才平等開化說法，演其光輝；言皆受諸佛；所娛樂業而建立之，使得至於無上正真；是為十事說平等門而奉行之。」",
        "translation": "He has accumulated a stock of virtues, readily accepts the sūtras taught by the tathāgatas, grasps all manifestations, explains them in parables, guides all those who follow the teaching, embraces the totality of the path's meaning and wisdom, eliminates doubts and attachments, fully completes the bodhisattva practices, eloquently and equally teaches all tathāgatas, expounds their glories, and accepts the entertaining activities of the buddhas, building them up to unsurpassed correctness; these are the ten things he teaches and consecrates as the gate of equality.\"",
        "source": "T10n0292_001:0622c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「積累眾德本，　　諮嗟如來法，　觀諸法平等，　　奉宣道慧門。",
        "translation": "He then spoke this verse, \"Accumulating the roots of many virtues, he consults the Tathāgata's teaching with admiration, observes the equality of all things, and dedicates himself to proclaiming the gate of the wisdom of the path.",
        "source": "T10n0292_001:0622c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　棄捐諸疑著，　　具足菩薩行，　諸法為世門，　　皆令入道室。",
        "translation": "Giving up attachments to doubt and perfecting the bodhisattva's practice, these things are the gate to the world, and they all make it into the room of the path.",
        "source": "T10n0292_001:0622c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事分別辯才。",
        "translation": "\"Bodhisattvas have ten abilities to discern and explain things.",
        "source": "T10n0292_001:0622c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0622c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所演諸法永無想念、分別諸經悉無所行、諸義辯才亦無所著、解諸法空班宣無量、一切諸法悉佛所立、一切所有悉無所依、皆能分別諸法章句、宣暢經典真諦之義、常以等心愍於眾生、應意說法令得悅豫，是為十辯才。」",
        "translation": "Never missing the things that are explained, discerning the sutras in all their forms without any practice, eloquent in explaining their meanings without any attachment, understanding the emptiness of all dharmas and declaring them to be limitless, establishing all dharmas by the Buddha, relying on none of them, discerning the words and phrases of all dharmas, proclaiming the true meaning of the sutras, always being kind to sentient beings with equal mind, and agreeable to their wishes and pleasing to them are the ten eloquent ones.\"",
        "source": "T10n0292_001:0622c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「講經無想念，　　一切無想行，　不著於諸法，　　解之悉為空；　辯才無限量，　　諸法佛所立，　一切無所猗，　　解之悉本無。",
        "translation": "The verse then goes, \"A lecturer has no thoughts, performs all thoughtless actions, isn't attached to things, and understands them all as empty; his eloquence has no limit, and the things established by the buddhas are all uninterrupted, so their understanding is all originally nonexistent.",
        "source": "T10n0292_001:0623a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事得自在。",
        "translation": "\"There are ten things that bodhisattvas do to attain mastery.",
        "source": "T10n0292_001:0623a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0623a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開化眾生、照耀諸法、修諸德本、行無極慧、不著禁戒、所造善本勸助佛道、所行精進而不退還、降伏眾魔、其所愛喜解了道心一切佛道、在於邪見而成正覺，是為十得自在。」",
        "translation": "Enlightening sentient beings, illuminating qualities, cultivating the bases of virtues, practicing infinite wisdom, not clinging to prohibitions, creating good roots that encourage the Buddha Way, performing assiduously and not turning back, subduing Māra, delighting in and understanding the mind of the Way, and realizing the right path in the face of wrong views are the ten attainments of freedom.\"",
        "source": "T10n0292_001:0623a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「曉開教眾生，　　得照耀諸法，　奉行眾德本，　　自在無極慧。",
        "translation": "The verse then goes, \"I've clearly opened the teaching to sentient beings, attained illumination of the Dharma, consecrated the roots of many virtues, and attained the supreme wisdom of mastery.",
        "source": "T10n0292_001:0623a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心皆無所著，　　精進不懈惓，　降伏於眾魔，　　道心得由己。",
        "translation": "With their minds free of attachment and their efforts unremitting, they subdue Māra and bring their own mind to the path.",
        "source": "T10n0292_001:0623a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事所施無數。",
        "translation": "\"There are ten things that bodhisattvas do that are countless.",
        "source": "T10n0292_001:0623a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0623a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開化一切諸世間難，眾生本末亦不可計、經典之事亦不可量、一切所作亦無崖底、有計諸法崖際難盡、眾德之本亦無儔匹、一切諸惡悉無能宣、諸所志願亦無邊際、眾行所趣無能為喻、一切菩薩獨步無侶、諸佛、正覺獨尊無雙，是為十事所施無數。」",
        "translation": "The difficulty of opening up all the world, the incalculability of the origins of sentient beings, the immeasurability of scriptural works, the fact that there's no limit to what can be done, the difficulty of exhausting the limit of measured things, the lack of a limit to the origins of virtues, the lack of an end to all evils, the lack of a limit to what can be wished, the lack of a limit to what can be described as the destinies of various courses of action, the lack of a companion for all bodhisattvas standing alone, and the lack of a pair for all buddhas and right awakening saints, are ten things that are given without number.\"",
        "source": "T10n0292_001:0623a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「世計不可計、　　眾生無有數、　諸法無邊際、　　所造亦無限、　德本無儔匹、　　諸惡無處所、　菩薩無等侶、　　諸佛無儔匹。」",
        "translation": "The verse then goes, \"The world's calculations are incalculable, sentient beings are countless, dharmas are limitless, the works they create are infinite, the basis of virtue is without equal, evils have no place, bodhisattvas have no equal partners, and buddhas have no equal.\"",
        "source": "T10n0292_001:0623a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事為行等心。",
        "translation": "\"There are ten things that bodhisattvas do as part of their practice and so forth.",
        "source": "T10n0292_001:0623b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0623b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等心積德、志願同等、眾生身意亦無有二、入於人民罪福所趣、普遊諸法、視諸佛土淨穢同一、勸化眾生使入篤信、等心諸行及眾妄想、皆入諸佛十力無畏、悉由如來平等之慧，是為十等心。」",
        "translation": "To accumulate virtue with equal minds, to have the same aspirations, to have no duality in the bodies and minds of sentient beings, to enter the destinies of people's sins and merits, to travel broadly among the teachings, to regard the purification and defilement of all the buddha-lands as the same, to encourage sentient beings into devotion, to equalize their minds and practices and the deluded notions of many, to enter the ten powers and fearlessness of the buddhas, and to have them all come from the equal wisdom of the Tathāgata are the ten equal minds.\"",
        "source": "T10n0292_001:0623b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「等心積德本，　　興顯一切願，　平等眾生心，　　罪福無殊異。",
        "translation": "The verse then goes, \"Equally minded, they accumulate virtue, give rise to all vows, and equalize the minds of sentient beings, so there's no distinction between crimes and merits.",
        "source": "T10n0292_001:0623b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　普入諸經典、　　等觀諸佛土，　愍念諸眾生，　　使入無異行。",
        "translation": "They universally enter the sutras, equally contemplate the buddha-lands, and have compassion for sentient beings, so that they enter into practices that are not different from each other.",
        "source": "T10n0292_001:0623b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事行慧。",
        "translation": "\"Bodhisattvas have the wisdom of ten practices.",
        "source": "T10n0292_001:0623b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0623b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了眾生當歸解慧；遍入諸國若干剎土，未入者入之；遊諸貪網，除去臭穢；所遊諸界知其增減；曉了諸法各各有異；或復一品普能周旋；眾界音聲解世間眾想、所住顛倒、所念各異；以一言辭普入一切諸法言教；如來威變建立法界；一切眾生處在三世，諸佛入中訓誨無廢，皆令入道；是為十事菩薩行慧。」",
        "translation": "He understands the wisdom that sentient beings must take refuge in; he enters many buddha-lands in various countries and enters those who haven't yet entered them; he travels through the web of craving and removes the stink; he knows the increase and decrease of the worlds he travels to; he understands that each dharma has its own variation; he can universally circulate one class at a time; he understands the sounds of the world's various concepts, the mistakenness of their abodes, and the differences in their thoughts; he universally enters all the teachings of the Dharma with a single word; the Tathāgata's authoritative transformation establishes the Dharma realm; all sentient beings are situated in the three worlds; the buddhas enter, teach, and lead them into the path without fail; these are the ten things of the bodhisattva's practice and wisdom.\"",
        "source": "T10n0292_001:0623b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「信解眾生界，　　普入諸佛土，　悉至於十方，　　等觀諸世界。",
        "translation": "The verse then goes, \"Believing and understanding the realm of sentient beings, they universally enter the buddha-lands, fully reach the ten directions, and equally contemplate the worlds.",
        "source": "T10n0292_001:0623b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法無若干，　　入不可計身，　如來所變化，　　開度於三界。",
        "translation": "There are countless dharmas and incalculable bodies, and the Tathāgata's transformations unlock and liberate the three realms.",
        "source": "T10n0292_001:0623b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有十事而不自大。",
        "translation": "\"There are ten things a bodhisattva does that aren't arrogant.",
        "source": "T10n0292_001:0623b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T10n0292_001:0623b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不輕慢人、蚑行、喘息；身心謙下，不輕易人；不以剎土而自貢高；若得奉敬，不懷自大；不以好音而自歎譽；行願備悉，不以綺飾；開化眾生離於懈怠；成至正覺；常懷哀愍講說經典；不諮嗟身，有所建立而不自大；是為十事不自大。」",
        "translation": "They don't despise people, slow their movements, or breathe; they are humble in body and mind and don't take people lightly; they don't think highly of themselves because of their bases; they don't think big when they are venerated; they don't praise themselves for their good sounds; they practice and vow everything and don't decorate themselves; they enlighten sentient beings and part with laziness; they become supremely awakened; they always speak the sutras with compassion; they don't consult and contemn themselves; they build something and don't become arrogant; these are the ten things that don't make them arrogant.\"",
        "source": "T10n0292_001:0623b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時頌曰：「不輕慢眾生、　　得剎土不悅、　而奉敬不歡、　　離於好音聲、　無貪諸所願，　　開化於眾生，　得成最正覺，　　頒宣大道慧。」",
        "translation": "The verse then goes, \"Not despising sentient beings, not delighting in the attainment of the bhūmis, honoring and not rejoicing in them, parting with pleasant sounds, and not craving what they desire, they enlighten sentient beings, achieve supreme perfect enlightenment, and promulgate the great wisdom of the way.\"",
        "source": "T10n0292_001:0623c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是法時，天、龍、鬼神、世間人民、阿須倫、迦留羅、甄陀羅、摩睺勒莫不歡喜，咸發道意。",
        "translation": "When he spoke this teaching, gods, dragons, spirits, worldly people, asuras, garuḍas, kaluras, khandhas, and mahoras rejoiced and arouse the intention to follow the Way.",
        "source": "T10n0292_001:0623c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師子、虎、狼、熊、羆、鹿黨、魚、鼈、黿、鼉、諸小小虫，皆有慈心，無相害意，聞所說法各各歡喜而發道意。",
        "translation": "The lions, tigers, wolves, bears, deer, fish, turtle, gems, and small insects all have kind hearts and no intention of harming each other, and each rejoices when they hear what's being taught and gives rise to the intention to practice the path.",
        "source": "T10n0292_001:0623c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天散華，其落如雨；燒眾名香，欝如雲興；箜篌、樂器不鼓自鳴。",
        "translation": "The gods scatter flowers that fall like rain, burn multitudes of famous incense, and create clouds of smoke, and their harps and instruments sound without drumming.",
        "source": "T10n0292_001:0623c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當爾之時，莫不喜敬。",
        "translation": "At that point, no one is without joy and respect.",
        "source": "T10n0292_001:0623c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "度世品經卷第一",
        "translation": "Sutra of the Chapter of Deliverance, Volume 1",
        "source": "T10n0292_001:0623c13_0",
        "is_bad_quality": false
    }
]