[
    {
        "source_sentence": "佛說較量一切佛剎功德經",
        "translation": "Sutra on the Comparative Merit of all the Buddhas",
        "source": "T10n0290_001:0592a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試光祿卿",
        "translation": "Tripiṭaka of the Western Translation of the Sutra, Chaozan Dashi, and Guangluqing",
        "source": "T10n0290_001:0592a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao dashi ministers, Faxian, in accordance with the imperial edict, translated",
        "source": "T10n0290_001:0592a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在王舍城法野菩提道場，坐金剛摩尼寶師子之座，有菩薩摩訶薩眾周匝圍繞，復有十佛剎百千俱胝那由他眾聽佛說法。",
        "translation": "Thus I have heard: One time, the Buddha was sitting in the enlightenment site of Dharmafield in Rājagṛha sitting on his adamantine maṇi-jewel lion throne, surrounded by a multitude of bodhisattvas, and surrounded by a multitude of ten buddhas and one hundred thousand koṭīs of nayutas who were listening to his teaching.",
        "source": "T10n0290_001:0592a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有一菩薩摩訶薩，名不思議光王，即從座起，瞻視大會諸菩薩已而白眾言：「汝諸佛子，今當諦聽！",
        "translation": "At the time, a certain bodhisattva, the inconceivable King of Radiance, rose from his seat, looked at the bodhisattvas in the assembly, and said to them, \"Now, listen closely, you sons of the Buddha!",
        "source": "T10n0290_001:0592a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此娑婆世界滿一大劫，較量時分，是彼西方極樂世界無量壽佛剎一晝夜。",
        "translation": "This sahāva world is one great eon full, and a comparable period of time is one day and one night in the Immeasurable Life Buddha Temple of the Western paradise world.",
        "source": "T10n0290_001:0592b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼極樂世界一大劫，較量時分，是阿儞弭沙世界縛日囉(二合)娑誐囉鉢囉摩哩那曩如來佛剎一晝夜。",
        "translation": "For a great eon in that paradise world, that comparable time period is one day and night in the Vajra (two halves) Sāgara (Skt. Vajra), the palace of the Tathāgata Mālīnānāga.",
        "source": "T10n0290_001:0592b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼阿儞弭沙世界一大劫，較量時分，是不退輪光明世界敷蓮花身如來佛剎中一晝夜。",
        "translation": "For a great eon or a comparable period of time in the world of ānipāli, that's one day and one night in the lotus-body Tathāgata's buddha-mantle in the world of the nonretrogressing wheel of light.",
        "source": "T10n0290_001:0592b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼不退輪光明世界一大劫，較量時分，是無塵世界法王如來佛剎中一晝夜。",
        "translation": "That nonretrogressing world of radiant light has a great eon, which, when measured against time, is one day and night in the buddha-block of the Dharma-king Tathāgata of the immaterial world.",
        "source": "T10n0290_001:0592b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼無塵世界一大劫，較量時分，是燈光世界師子如來佛剎中一晝夜。",
        "translation": "It's a great eon in the dustless world and a comparable period of time, which is one day and one night in the luminous world of the lion-tathāgata Buddha's blaze.",
        "source": "T10n0290_001:0592b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼燈光世界一大劫，較量時分，是善光世界毘盧遮那如來佛剎中一晝夜。",
        "translation": "That great eon of the world of the lamp light compares to a single day and night in the buddha-blaze of the Tathāgata Śubha Heaven in the world of good light.",
        "source": "T10n0290_001:0592b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善光世界一大劫，較量時分，是難勝世界法敷身如來佛剎中一晝夜。",
        "translation": "It's a great eon in that world of good radiance, and it's a day and night in the buddha-body Tathāgata's temple in the difficult-to-overcome world when measured against time.",
        "source": "T10n0290_001:0592b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼難勝世界一大劫，較量時分，是謨賀世界一切通意王如來佛剎中一晝夜。",
        "translation": "It's a great eon in the Nāgârjuna world and a comparable period of time, which is one day and one night in the buddha-block of the Tathāgata, King of Shared Wisdom, in the Mahāyāna world.",
        "source": "T10n0290_001:0592b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼謨賀世界一大劫，較量時分，是現圓光世界讚歎如來佛剎中一晝夜。",
        "translation": "That great eon of the world of Mogha and its comparative time period is one day and night in the present world of perfect radiance praising the Tathāgata's buddha-blaze.",
        "source": "T10n0290_001:0592b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，一切世界依劫算數過十佛剎百千俱胝那由他微塵數劫已，有世界名蓮花吉祥，彼佛世尊名賢吉祥，是彼佛剎中一晝夜。",
        "translation": "Thus, after all the worlds have passed through ten Buddha buddhas and one hundred thousand koṭīs of dusty eons based on the calculation of eons, there's a world named Lotus Auspicious, whose Bhagavān's name is Bhadrika Auspicious, and it's a single day and night in that Buddha's buddha.",
        "source": "T10n0290_001:0592b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有菩薩地名普行地，行如是無量菩薩行。",
        "translation": "\"There's a bodhisattva ground called the ground of universal practice, which engages in measureless bodhisattva practices like these.",
        "source": "T10n0290_001:0592b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛子！",
        "translation": "\"Son of the Buddha!",
        "source": "T10n0290_001:0592b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人於此『較量一切佛剎功德經』受持、讀誦、為他解說，彼人命終，十方佛剎恒河沙數諸佛如來悉皆現前，滿彼有情一切所願。」",
        "translation": "If another person accepts, recites, and explains this Sutra on the Merits of Immeasurable Life of All Buddhas, the tathāgatas of the Ganges River Sands of buddhas in the ten directions will all appear before him or her at the end of his or her life and fulfill all the wishes of sentient beings.\"",
        "source": "T10n0290_001:0592b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，不思議光王菩薩及諸大眾，聞佛所說，皆大歡喜，信受奉行。",
        "translation": "After the Buddha spoke this sūtra, the inconceivable Radiant King Bodhisattva and the large crowd that heard what he taught rejoiced greatly, believed it, and approved of it.",
        "source": "T10n0290_001:0592b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說較量一切佛剎功德經",
        "translation": "Foshuo qiangqie yiqie foshuze gongde jing",
        "source": "T10n0290_001:0592b29_0",
        "is_bad_quality": false
    }
]