[
    {
        "source_sentence": "大方廣佛華嚴經卷第十五",
        "translation": "Dafangguangfo huayan jing, vol. 15",
        "source": "T10n0279_015:0075b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "Translated by the Bhikṣuṇī of Khotan, the Tripiṭaka of Khotan",
        "source": "T10n0279_015:0075b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢首品第十二之二",
        "translation": "Xianshou pin xii bis",
        "source": "T10n0279_015:0075b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有勝三昧名安樂，　　能普救度諸群生，　放大光明不思議，　　令其見者悉調伏。",
        "translation": "\"There's a superior samādhi called well-being that saves all sentient beings, radiates inconceivable light, and causes them all to see it and subdue it.",
        "source": "T10n0279_015:0075b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所放光明名善現，　　若有眾生遇此光，　必令獲益不唐捐，　　因是得成無上智。",
        "translation": "The light that's emitted is called good manifestation, and if sentient beings encounter this light, they surely won't be overwhelmed by it, and they'll attain unsurpassed knowledge as a result.",
        "source": "T10n0279_015:0075b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼光示現於諸佛，　　示法示僧示正道，　亦示佛塔及形像，　　是故得成此光明。",
        "translation": "That light shows the buddhas, shows the Dharma, shows the saṃgha, shows the right path, and shows stūpas and images, and so it's possible to achieve this light.",
        "source": "T10n0279_015:0075b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名照耀，　　映蔽一切諸天光，　所有闇障靡不除，　　普為眾生作饒益。",
        "translation": "It also emits a light called shining brightly, which shines through all the heavenly lights, removes all the darkness and hindrances, and universally benefits sentient beings.",
        "source": "T10n0279_015:0075c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此光覺悟一切眾，　　令執燈明供養佛，　以燈供養諸佛故，　　得成世中無上燈。",
        "translation": "This light enlightens all sentient beings, causing them to appropriate lamps and make offerings to the buddhas, and because they make offerings to the buddhas with their lamps, they become the supreme lamp in the world.",
        "source": "T10n0279_015:0075c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　然諸油燈及酥燈，　　亦然種種諸明炬，　眾香妙藥上寶燭，　　以是供佛獲此光。",
        "translation": "Still, oil lamps and ghee lamps, as well as various bright torches and candles of the highest jewels with many fragrances and wonderful medicines, are offered to the buddhas to obtain this light.",
        "source": "T10n0279_015:0075c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名濟度，　　此光能覺一切眾，　令其普發大誓心，　　度脫欲海諸群生。",
        "translation": "This light also emits a brightness called 'salvation,' which awakens all sentient beings and causes them to universally give rise to the great vow to liberate the masses of beings in the ocean of desire.",
        "source": "T10n0279_015:0075c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能普發大誓心，　　度脫欲海諸群生，　則能越度四瀑流，　　示導無憂解脫城。",
        "translation": "If he can universally give rise to the great vow to liberate the masses of beings in the ocean of desire, then he can cross the four raging currents and lead them to the city of sorrowless liberation.",
        "source": "T10n0279_015:0075c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於諸行路大水處，　　造立橋梁及船筏，　毀呰有為讚寂靜，　　是故得成此光明。",
        "translation": "At the places of great waters on their paths, they build bridges and rafts, disparaging sentient beings and praising tranquility, and thus attain this radiance.",
        "source": "T10n0279_015:0075c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名滅愛，　　此光能覺一切眾，　令其捨離於五欲，　　專思解脫妙法味。",
        "translation": "It also emits a light called cessation of craving, which awakens all sentient beings, causes them to abandon the five desires, and focuses on the wonderful taste of the Dharma of liberation.",
        "source": "T10n0279_015:0075c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能捨離於五欲，　　專思解脫妙法味，　則能以佛甘露雨，　　普滅世間諸渴愛。",
        "translation": "If they can abandon the five desires and focus on the subtle taste of the Dharma of liberation, then they can use the Buddha's sweet dew to rain down universal cessation of worldly cravings.",
        "source": "T10n0279_015:0075c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惠施池井及泉流，　　專求無上菩提道，　毀呰五欲讚禪定，　　是故得成此光明。",
        "translation": "Bestowing gifts from ponds, wells, and springs, they'd focus on the unsurpassed path to enlightenment, disparage the five desires, and praise meditation, and thus attain this radiance.",
        "source": "T10n0279_015:0075c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名歡喜，　　此光能覺一切眾，　令其愛慕佛菩提，　　發心願證無師道。",
        "translation": "It also emits a bright light called rejoicing, which awakens all sentient beings, causes them to adore the buddha's aspiration for enlightenment, and makes them want to realize the path of no teacher.",
        "source": "T10n0279_015:0075c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　造立如來大悲像，　　眾相莊嚴坐華座，　恒歎最勝諸功德，　　是故得成此光明。",
        "translation": "He creates a great compassionate image of the Tathāgata, sits adorned with multitudes of features on a lotus seat, and constantly praises the most excellent qualities, which is how he attains this radiance.",
        "source": "T10n0279_015:0075c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名愛樂，　　此光能覺一切眾，　令其心樂於諸佛，　　及以樂法樂眾僧。",
        "translation": "This light also emits a radiance called delight, which awakens all sentient beings and causes their minds to delight in the buddhas and the Dharma to delight in the saṃgha.",
        "source": "T10n0279_015:0075c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若常心樂於諸佛，　　及以樂法樂眾僧，　則在如來眾會中，　　逮成無上深法忍。",
        "translation": "If their minds are always delighted with the buddhas and they delight in the Dharma and the saṃgha, then they'll be among the Tathāgatas' many assemblies and will have attained unsurpassed profound patience with the Dharma.",
        "source": "T10n0279_015:0075c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　開悟眾生無有量，　　普使念佛法僧寶，　及示發心功德行，　　是故得成此光明。",
        "translation": "Enlightening sentient beings beyond measure, they universally call to mind the treasures of buddhas, Dharma, and saṃgha and show the meritorious conduct of those who have aroused their minds, and thus they achieve this radiance.",
        "source": "T10n0279_015:0075c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名福聚，　　此光能覺一切眾，　令行種種無量施，　　以此願求無上道。",
        "translation": "It also radiates a light called the merit cluster, which awakens all sentient beings, causes them to perform various measureless gifts, and vows to pursue the unsurpassed path with this.",
        "source": "T10n0279_015:0075c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設大施會無遮限，　　有來求者皆滿足，　不令其心有所乏，　　是故得成此光明。",
        "translation": "If there's a great gathering of almsgivers, there's no limit to the number of those who come seeking it, and they're all satisfied, so their minds aren't depleted, and this light is made possible.",
        "source": "T10n0279_015:0076a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名具智，　　此光能覺一切眾，　令於一法一念中，　　悉解無量諸法門。",
        "translation": "It also emits a light called perfect wisdom, which is able to perceive all sentient beings and cause them to fully understand measureless teachings in a single thought of a single thing.",
        "source": "T10n0279_015:0076a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為諸眾生分別法，　　及以決了真實義，　善說法義無虧減，　　是故得成此光明。",
        "translation": "He discerns the teaching for sentient beings and determines its true meaning, skillfully explains the teaching's meaning without loss, and thus he attains this radiance.",
        "source": "T10n0279_015:0076a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名慧燈，　　此光能覺一切眾，　令知眾生性空寂，　　一切諸法無所有。",
        "translation": "It also emits a light called the lamp of wisdom, which perceives all sentient beings, causes them to know that the nature of sentient beings is empty and that all dharmas are nonexistent.",
        "source": "T10n0279_015:0076a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　演說諸法空無主，　　如幻如焰水中月，　乃至猶如夢影像，　　是故得成此光明。",
        "translation": "It teaches that all dharmas are empty and have no subject, like an illusion, like the moon in a flame of water, or like a dream image, and so it attains this light.",
        "source": "T10n0279_015:0076a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名法自在，　　此光能覺一切眾，　令得無盡陀羅尼，　　悉持一切諸佛法。",
        "translation": "It also emits a light called Dharma Freely, which awakens all beings, causes them to attain an inexhaustible dhāraṇī, and fully upholds all the Buddha's teachings.",
        "source": "T10n0279_015:0076a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恭敬供養持法者，　　給侍守護諸賢聖，　以種種法施眾生，　　是故得成此光明。",
        "translation": "It respects and supports those who uphold the Dharma, serves and guards the noble ones, and gives various teachings to sentient beings, which is how this light is made possible.",
        "source": "T10n0279_015:0076a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名能捨，　　此光覺悟慳眾生，　令知財寶悉非常，　　恒樂惠施心無著。",
        "translation": "This light also emits a radiance called equanimity, which awakens stingy sentient beings, makes them know that their wealth and treasure are all unsurpassed, and constantly enjoys generosity with a mind free of attachment.",
        "source": "T10n0279_015:0076a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慳心難調而能調，　　解財如夢如浮雲，　增長惠施清淨心，　　是故得成此光明。",
        "translation": "Being stingy, it's difficult to control but can be controlled, liberates wealth like a dream or a floating cloud, and increases the pure mind of generosity; thus, it's possible to achieve this radiance.",
        "source": "T10n0279_015:0076a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名除熱，　　此光能覺毀禁者，　普使受持清淨戒，　　發心願證無師道。",
        "translation": "It also emits a light called \"removing fever,\" which awakens those who violate the precepts, causes them to uphold pure precepts, and arouses the resolve to realize the path of no teacher.",
        "source": "T10n0279_015:0076a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勸引眾生受持戒，　　十善業道悉清淨，　又令發向菩提心，　　是故得成此光明。",
        "translation": "It encourages sentient beings to uphold the precepts, purifies all of the ten good actions, and causes them to arouse the mind devoted to enlightenment; thus, this light is produced.",
        "source": "T10n0279_015:0076a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名忍嚴，　　此光覺悟瞋恚者，　令彼除瞋離我慢，　　常樂忍辱柔和法。",
        "translation": "This light also emits a radiance called the adornment of forbearance, which awakens those who hold onto anger, causes them to rid themselves of anger and become free of pride, and always enjoys the gentle Dharma of forbearance and humility.",
        "source": "T10n0279_015:0076a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生暴惡難可忍，　　為菩提故心不動，　常樂稱揚忍功德，　　是故得成此光明。",
        "translation": "The violence of sentient beings is difficult to tolerate, but their minds aren't moved for the sake of bodhi, and they always delight in praising the merit of forbearance; thus, they achieve this radiance.",
        "source": "T10n0279_015:0076a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名勇猛，　　此光覺悟嬾墮者，　令彼常於三寶中，　　恭敬供養無疲厭。",
        "translation": "This light also emits a brightness called boldness, which awakens those who lazily fall into the Three Treasures and causes them to always be among the Three Treasures, respecting and offering support without tiring.",
        "source": "T10n0279_015:0076a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若彼常於三寶中，　　恭敬供養無疲厭，　則能超出四魔境，　　速成無上佛菩提。",
        "translation": "If they always remain among the three treasures, respectfully offer support, and don't grow weary, then they'll be able to transcend the four demonic realms and quickly achieve unsurpassed Buddhahood and enlightenment.",
        "source": "T10n0279_015:0076b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勸化眾生令進策，　　常勤供養於三寶，　法欲滅時專守護，　　是故得成此光明。",
        "translation": "He encourages sentient beings to make effort, always diligently makes offerings to the three treasures, and focuses on guarding them when the Dharma is about to cease, so he can achieve this radiance.",
        "source": "T10n0279_015:0076b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名寂靜，　　此光能覺亂意者，　令其遠離貪恚癡，　　心不動搖而正定。",
        "translation": "It also emits a bright light called quiescence, which awakens those with disturbed thoughts, causing them to be free of craving, ill-will, and delusion, and their minds are unshaken and correctly concentrated.",
        "source": "T10n0279_015:0076b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨離一切惡知識，　　無義談說雜染行，　讚歎禪定阿蘭若，　　是故得成此光明。",
        "translation": "He parts with all bad friends, talks meaninglessly about defiled behavior, and praises the araṇya of meditation, and thus he attains this radiance.",
        "source": "T10n0279_015:0076b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名慧嚴，　　此光覺悟愚迷者，　令其證諦解緣起，　　諸根智慧悉通達。",
        "translation": "It also emits a light called wisdom adornment, which awakens the deluded and causes them to realize the truth, understand dependently arisen, and fully comprehend their faculties and wisdom.",
        "source": "T10n0279_015:0076b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能證諦解緣起，　　諸根智慧悉通達，　則得日燈三昧法，　　智慧光明成佛果。",
        "translation": "If they can realize the understanding of causes and conditions and fully comprehend the wisdom of their faculties, then they'll attain the samādhi dharma of the sun lamp and the fruit of Buddhahood with the light of wisdom.",
        "source": "T10n0279_015:0076b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　國財及己皆能捨，　　為菩提故求正法，　聞已專勤為眾說，　　是故得成此光明。",
        "translation": "He can abandon both his country's wealth and himself, seek the right teaching for the sake of enlightenment, and concentrate on teaching it to others after hearing it; thus, he'll achieve this radiance.",
        "source": "T10n0279_015:0076b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名佛慧，　　此光覺悟諸含識，　令見無量無邊佛，　　各各坐寶蓮華上。",
        "translation": "It also radiates a light called Buddha's wisdom, and this light awakens the contained consciousnesses, causing them to see measureless and limitless buddhas, each sitting on a jeweled lotus.",
        "source": "T10n0279_015:0076b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　讚佛威德及解脫，　　說佛自在無有量，　顯示佛力及神通，　　是故得成此光明。",
        "translation": "It praises the Buddha's authority and liberation, explains the Buddha's unfathomable abilities, and shows the Buddha's power and superknowledge, which is how this light came to be.",
        "source": "T10n0279_015:0076b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名無畏，　　此光照觸恐怖者，　非人所持諸毒害，　　一切皆令疾除滅。",
        "translation": "This light also emits a brightness called fearlessness, which illuminates those who come in contact with terror and causes the quick extinction of all the poisonous hazards that no one holds.",
        "source": "T10n0279_015:0076b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能於眾生施無畏，　　遇有惱害皆勸止，　拯濟厄難孤窮者，　　以是得成此光明。",
        "translation": "It's a fearless light that bestows fearlessness on sentient beings, encourages the suppression of any harm, and saves those who are destitute in trouble and distress; thus, it's possible to achieve this radiance.",
        "source": "T10n0279_015:0076b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名安隱，　　此光能照疾病者，　令除一切諸苦痛，　　悉得正定三昧樂。",
        "translation": "It also emits a bright light called peace, which illuminates the sick and causes the removal of all suffering and pain, and it fully attains the bliss of right concentration and samādhi.",
        "source": "T10n0279_015:0076b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　施以良藥救眾患，　　妙寶延命香塗體，　酥油乳蜜充飲食，　　以是得成此光明。",
        "translation": "By bestowing good medicines to save those who suffer, rubbing a life-prolonging scent on their bodies with marvelous treasures, and filling their diet with butter, oil, milk, and honey, this light is made possible.",
        "source": "T10n0279_015:0076b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名見佛，　　此光覺悟將沒者，　令隨憶念見如來，　　命終得生其淨國。",
        "translation": "It also emits a light called 'seeing the Buddha,' which enlightens those who are about to perish and causes them to follow the memory of the Tathāgata and see him, so that they can be born in his pure land at the end of their lives.",
        "source": "T10n0279_015:0076b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見有臨終勸念佛，　　又示尊像令瞻敬，　俾於佛所深歸仰，　　是故得成此光明。",
        "translation": "Seeing someone near death who's encouraged to remember the Buddha and shown an image of him to venerate, they'll deeply venerate him, and thus they'll attain this radiance.",
        "source": "T10n0279_015:0076b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名樂法，　　此光能覺一切眾，　令於正法常欣樂，　　聽聞演說及書寫。",
        "translation": "This light also emits a radiance called the pleasant dharma, which awakens all sentient beings, causes them to be constantly delighted by the right teaching, and makes them hear, expound, and write it.",
        "source": "T10n0279_015:0076c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法欲盡時能演說，　　令求法者意充滿，　於法愛樂勤修行，　　是故得成此光明。",
        "translation": "When the desire for the Dharma runs out, it's explained, filling those who seek the Dharma with intention, and they diligently cultivate their love for the Dharma, which is why this light has been produced.",
        "source": "T10n0279_015:0076c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名妙音，　　此光開悟諸菩薩，　能令三界所有聲，　　聞者皆是如來音。",
        "translation": "It also emits a light called marvelous sound, which enlightens bodhisattvas and causes all the sounds of the three realms to be heard as the Tathāgata's voice.",
        "source": "T10n0279_015:0076c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以大音聲稱讚佛，　　及施鈴鐸諸音樂，　普使世間聞佛音，　　是故得成此光明。",
        "translation": "Praising the Buddha with a great voice and bestowing music such as bells and tolls, it causes the world to hear the Buddha's voice, and thus this light is made possible.",
        "source": "T10n0279_015:0076c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名施甘露，　　此光開悟一切眾，　令捨一切放逸行，　　具足修習諸功德。",
        "translation": "It also emits a light called the ambrosia of giving, which enlightens all beings, causes them to abandon all careless ways, and fully cultivates their virtues.",
        "source": "T10n0279_015:0076c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說有為法非安隱，　　無量苦惱悉充遍，　恒樂稱揚寂滅樂，　　是故得成此光明。",
        "translation": "It teaches that the teachings of existential phenomena are not peaceful, that measureless suffering and distress are all filled, and that the joy of tranquility and cessation is always celebrated with joy; therefore, this light is attained.",
        "source": "T10n0279_015:0076c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名最勝，　　此光開悟一切眾，　令於佛所普聽聞，　　戒定智慧增上法。",
        "translation": "It also emits a light called the most brilliant, a light that enlightens all sentient beings, causes them to be heard universally by the buddhas, and increases the teachings of morality, meditation, and wisdom.",
        "source": "T10n0279_015:0076c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常樂稱揚一切佛，　　勝戒勝定殊勝慧，　如是為求無上道，　　是故得成此光明。",
        "translation": "It's a constant delight to praise all the buddhas, superior morality, superior concentration, and superior wisdom, and so to pursue the unsurpassed path, it's possible to achieve this light.",
        "source": "T10n0279_015:0076c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名寶嚴，　　此光能覺一切眾，　令得寶藏無窮盡，　　以此供養諸如來。",
        "translation": "This light also emits a radiance called Baoyan, which awakens all sentient beings and causes them to attain an inexhaustible store of treasures with which to make offerings to the tathāgatas.",
        "source": "T10n0279_015:0076c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以諸種種上妙寶，　　奉施於佛及佛塔，　亦以惠施諸貧乏，　　是故得成此光明。",
        "translation": "It's a gift of various wonderful treasures to the Buddha and his stūpa, and it's a gift to the poor, which is how this light is made possible.",
        "source": "T10n0279_015:0076c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名香嚴，　　此光能覺一切眾，　令其聞者悅可意，　　決定當成佛功德。",
        "translation": "This light also emits a radiance called fragrant adornment, which awakens all sentient beings, pleases those who hear it, and determines the merits of the future Buddha.",
        "source": "T10n0279_015:0076c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人天妙香以塗地，　　供養一切最勝主，　亦以造塔及佛像，　　是故得成此光明。",
        "translation": "It's a wonderful fragrance that people and gods use to coat the ground, to make offerings to the most excellent lords, and to build stūpas and Buddha images, which is how this light is made possible.",
        "source": "T10n0279_015:0076c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名雜莊嚴，　　寶幢幡蓋無央數，　焚香散華奏眾樂，　　城邑內外皆充滿。",
        "translation": "It also emits a light called a variety of adornments, with an incalculable number of jeweled banners and banners, burns incense, scatters flowers, and plays music, filling the city and beyond.",
        "source": "T10n0279_015:0076c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　本以微妙妓樂音，　　眾香妙華幢蓋等，　種種莊嚴供養佛，　　是故得成此光明。",
        "translation": "This light is made possible by the subtle sounds of musicians, the many fragrant, flowery banners and shrouds, and other adornments that are offered to the Buddha.",
        "source": "T10n0279_015:0076c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名嚴潔，　　令地平坦猶如掌，　莊嚴佛塔及其處，　　是故得成此光明。",
        "translation": "It also emits a bright light called Yanjing, which makes the ground level like the palm of your hand and adorns the Buddha's stūpa and its place, thus making it possible to create this light.",
        "source": "T10n0279_015:0077a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名大雲，　　能起香雲雨香水，　以水灑塔及庭院，　　是故得成此光明。",
        "translation": "It also emits a bright light called a great cloud that produces clouds of fragrance and rains perfume, sprinkling stūpas and courtyards with water, and thus making it possible to achieve this light.",
        "source": "T10n0279_015:0077a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名嚴具，　　令裸形者得上服，　嚴身妙物而為施，　　是故得成此光明。",
        "translation": "It also emits a bright light called an ornament that causes a naked person to obtain superior clothing and adorn the body with marvelous things for charity, and thus this light is made possible.",
        "source": "T10n0279_015:0077a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名上味，　　能令飢者獲美食，　種種珍饌而為施，　　是故得成此光明。",
        "translation": "Another bright light that shines is called superior taste, which causes a hungry person to obtain a delicious meal and give various delicacies as alms, and thus he attains this radiance.",
        "source": "T10n0279_015:0077a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光明名大財，　　令貧乏者獲寶藏，　以無盡物施三寶，　　是故得成此光明。",
        "translation": "Another light that radiates is called great wealth, which causes the poor to acquire a treasure trove and give endless things to the Three Treasures; thus, this light is made possible.",
        "source": "T10n0279_015:0077a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名眼清淨，　　能令盲者見眾色，　以燈施佛及佛塔，　　是故得成此光明。",
        "translation": "It also emits a light called clear eyes, which enables a blind person to see many forms and give lamps to buddhas and stūpas; thus, this light is made possible.",
        "source": "T10n0279_015:0077a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名耳清淨，　　能令聾者悉善聽，　鼓樂娛佛及佛塔，　　是故得成此光明。",
        "translation": "It also emits a light called the purification of the ear, which causes the deaf to hear well and drums music to the Buddha and his stūpa, and so this light is made possible.",
        "source": "T10n0279_015:0077a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名鼻清淨，　　昔未聞香皆得聞，　以香施佛及佛塔，　　是故得成此光明。",
        "translation": "Another light that radiates is called the nose that's pure, which can cause those who haven't heard incense in the past to hear it and give it to the Buddha and his stūpa; thus, this light is produced.",
        "source": "T10n0279_015:0077a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名舌清淨，　　能以美音稱讚佛，　永除麁惡不善語，　　是故得成此光明。",
        "translation": "Another light that radiates is called the purification of the tongue, which praises the Buddha with beautiful words and permanently removes harsh and unskillful speech; thus, this light is made possible.",
        "source": "T10n0279_015:0077a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名身清淨，　　諸根缺者令具足，　以身禮佛及佛塔，　　是故得成此光明。",
        "translation": "It also emits a light called the purification of the body, which makes the lacking faculties complete and venerates the Buddha and his stūpa with its body, thus making it possible to achieve this radiance.",
        "source": "T10n0279_015:0077a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名意清淨，　　令失心者得正念，　修行三昧悉自在，　　是故得成此光明。",
        "translation": "It also emits a light called the purification of mind, which causes those who lose their mind to attain right mindfulness and fully attain mastery over the practice of samādhi; thus, this light is produced.",
        "source": "T10n0279_015:0077a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名色清淨，　　令見難思諸佛色，　以眾妙色莊嚴塔，　　是故得成此光明。",
        "translation": "The light also emitted is called the purification of form, which causes inconceivable buddha forms to be seen and adorns stūpas with many wonderful forms, and thus this light is made possible.",
        "source": "T10n0279_015:0077a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名聲清淨，　　令知聲性本空寂，　觀聲緣起如谷響，　　是故得成此光明。",
        "translation": "It also emits a light called the purity of sound, which causes one to know that the nature of sound is inherently empty and tranquil, and to contemplate the dependent arising of sound like the sound of a grain, and thus he attains this radiance.",
        "source": "T10n0279_015:0077a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名香清淨，　　令諸臭穢悉香潔，　香水洗塔菩提樹，　　是故得成此光明。",
        "translation": "It also emits a light called \"fragrance\" that purifies odors and causes smells to cleanse stūpas and perfumes stūpas and bodhi trees, which is how this light is made possible.",
        "source": "T10n0279_015:0077a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名味清淨，　　能除一切味中毒，　恒供佛僧及父母，　　是故得成此光明。",
        "translation": "It also emits a light called \"taste\" that's pure, which removes all tastes and poisons and makes constant offerings to buddhas, saṃgha, and parents, and so this light is made possible.",
        "source": "T10n0279_015:0077a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名觸清淨，　　能令惡觸皆柔軟，　戈鋋劍戟從空雨，　　皆令變作妙華鬘。",
        "translation": "It also emits a light called the purity of touch, which causes bad touches to be gentle and soft, and gores, spears, and nails to rain down from the sky, all of which are transformed into marvelous flower garlands.",
        "source": "T10n0279_015:0077b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以昔曾於道路中，　　塗香散華布衣服，　迎送如來令蹈上，　　是故今獲光如是。",
        "translation": "In the past, I smeared incense and spread flowers on my clothes in the path to welcome the Tathāgata and make him ride up, so now I've attained such a radiance.",
        "source": "T10n0279_015:0077b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又放光名法清淨，　　能令一切諸毛孔，　悉演妙法不思議，　　眾生聽者咸欣悟。",
        "translation": "The light that's emitted is called the purification of dharmas, which causes all the pores to display the marvelous Dharma that's inconceivable, and sentient beings who hear it are delighted and enlightened.",
        "source": "T10n0279_015:0077b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　因緣所生無有生，　　諸佛法身非是身，　法性常住如虛空，　　以說其義光如是。",
        "translation": "There's nothing that arises from causes and conditions, the buddha's Dharma body is not a body, and the Dharma nature always abides like space, so he explains its meaning in terms of light like this.",
        "source": "T10n0279_015:0077b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是等比光明門，　　如恒河沙無限數，　悉從大仙毛孔出，　　一一作業各差別。",
        "translation": "Such comparable entries of light as these are like the sands of the Ganges, which are countless, all emanate from the pores of great sages, and each one operates with distinction.",
        "source": "T10n0279_015:0077b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如一毛孔所放光，　　無量無數如恒沙，　一切毛孔悉亦然，　　此是大仙三昧力。",
        "translation": "Like the light emitted from a single pore, it's measureless and countless like the sands of Ganges, and so are all the pores; this is the great man's samādhi power.",
        "source": "T10n0279_015:0077b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如其本行所得光，　　隨彼宿緣同行者，　今放光明故如是，　　此是大仙智自在。",
        "translation": "Just like the light from his past lives, following those who traveled with him on previous occasions, the light now radiates like this, and this is the great man's mastery of wisdom.",
        "source": "T10n0279_015:0077b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　往昔同修於福業，　　及有愛樂能隨喜，　見其所作亦復然，　　彼於此光咸得見。",
        "translation": "Those who have cultivated meritorious actions together in the past and those who delight in them will likewise see what they've done, and they'll all be able to see this light.",
        "source": "T10n0279_015:0077b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有自修眾福業，　　供養諸佛無央數，　於佛功德常願求，　　是此光明所開覺。",
        "translation": "If someone cultivates meritorious actions on their own, makes offerings to the buddhas that are countless, and always aspires to the buddhas' merits, this is the light that reveals their awakening.",
        "source": "T10n0279_015:0077b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如生盲不見日，　　非為無日出世間，　諸有目者悉明見，　　各隨所務修其業。",
        "translation": "It's like being born blind and not seeing the sun, not because there's no sun when it appears in the world, but those who have eyesight see clearly and cultivate their karma according to their purpose.",
        "source": "T10n0279_015:0077b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大士光明亦如是，　　有智慧者皆悉見，　凡夫邪信劣解人，　　於此光明莫能覩。",
        "translation": "The great man's light is likewise, and it's seen by everyone who has wisdom, while ordinary people of mistaken faith and poor understanding can't see anything in that light.",
        "source": "T10n0279_015:0077b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　摩尼宮殿及輦乘，　　妙寶靈香以塗瑩，　有福德者自然備，　　非無德者所能處。",
        "translation": "A maṇi palace or a carriage, coated with the fragrance of a wonderful jewel, is naturally available to those with virtue, and it's not within the reach of those without virtue.",
        "source": "T10n0279_015:0077b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大士光明亦如是，　　有深智者咸照觸，　邪信劣解凡愚人，　　無有能見此光明。",
        "translation": "The great man's light is likewise, illumined by those with profound knowledge, while ordinary foolish people with wrong beliefs and poor understanding aren't able to see this light.",
        "source": "T10n0279_015:0077b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有聞此光差別，　　能生清淨深信解，　永斷一切諸疑網，　　速成無上功德幢。",
        "translation": "If someone hears this difference in light, they can develop a pure, deep faith, which permanently ends all webs of doubt and quickly creates a banner of unsurpassed merit.",
        "source": "T10n0279_015:0077b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有勝三昧能出現，　　眷屬莊嚴皆自在，　一切十方諸國土，　　佛子眾會無倫匹。",
        "translation": "There's a superior samādhi that arises, an army of retinues that adorn themselves, and a multitude of Buddha children in all the lands of the ten directions that have no equal.",
        "source": "T10n0279_015:0077c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有妙蓮華光莊嚴，　　量等三千大千界，　其身端坐悉充滿，　　是此三昧神通力。",
        "translation": "There's a marvelous lotus adorned with radiance, equal in size to 3,000 great thousand worlds, and its body is completely filled with the sagacity of this samādhi.",
        "source": "T10n0279_015:0077c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有十剎微塵數，　　妙好蓮華所圍遶，　諸佛子眾於中坐，　　住此三昧威神力。",
        "translation": "There are another ten buddhas, a tiny number, surrounded by marvelous lotus flowers, in which a multitude of Buddha children sit, abiding in this samādhi of awesome power.",
        "source": "T10n0279_015:0077c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宿世成就善因緣，　　具足修行佛功德，　此等眾生遶菩薩，　　悉共合掌觀無厭。",
        "translation": "Having accomplished good causes and conditions in prior lifetimes and fully cultivated the Buddha's virtues, these sentient beings surround the bodhisattva, all joining their palms together and observing without tire.",
        "source": "T10n0279_015:0077c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如明月在星中，　　菩薩處眾亦復然，　大士所行法如是，　　入此三昧威神力。",
        "translation": "Like the bright moon among the stars, the bodhisattva handles crowds similarly, and the way the great man conducts himself is thus, entering this samādhi with authoritative and spiritual power.",
        "source": "T10n0279_015:0077c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如於一方所示現，　　諸佛子眾共圍遶，　一切方中悉如是，　　住此三昧威神力。",
        "translation": "As it appears from one side, the sons of the Buddha are all surrounded by it, and it's thus in all directions that they abide in this samādhi with authoritative power.",
        "source": "T10n0279_015:0077c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有勝三昧名方網，　　菩薩住此廣開示，　一切方中普現身，　　或現入定或從出。",
        "translation": "There's a superior samādhi called \"directional net\" that the bodhisattva abides in and explains in detail, and it's a body that universally appears in all directions, either entering concentration or emerging from it.",
        "source": "T10n0279_015:0077c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或於東方入正定，　　而於西方從定出；　或於西方入正定，　　而於東方從定出；　或於餘方入正定，　　而於餘方從定出。",
        "translation": "Sometimes they enter right concentration in the east and emerge from it in the west, or they enter right concentration in the west and emerge from it in the east, or they enter right concentration in another direction and emerge from it in another direction.",
        "source": "T10n0279_015:0077c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是入出遍十方，　　是名菩薩三昧力。",
        "translation": "Such entry and exit pervading the ten directions is called the bodhisattva's power of samādhi.",
        "source": "T10n0279_015:0077c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盡於東方諸國土，　　所有如來無數量，　悉現其前普親近，　　住於三昧寂不動。",
        "translation": "Throughout the lands of the east, there are Tathāgatas without number who appear before him and are universally approachable, abiding in samādhi with stillness and immovability.",
        "source": "T10n0279_015:0077c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　而於西方諸世界，　　一切諸佛如來所，　皆現從於三昧起，　　廣修無量諸供養。",
        "translation": "In the western worlds, all the buddha-tathāgatas are present, arise from samādhi, and make countless offerings.",
        "source": "T10n0279_015:0077c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盡於西方諸國土，　　所有如來無數量，　悉現其前普親近，　　住於三昧寂不動。",
        "translation": "Throughout the lands of the West, there are Tathāgatas without number who appear before them, are universally approachable, and abide in samādhi that's still and unmoving.",
        "source": "T10n0279_015:0077c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　而於東方諸世界，　　一切諸佛如來所，　皆現從於三昧起，　　廣修無量諸供養。",
        "translation": "In the eastern worlds, all the buddha-tathāgatas appear to arise from samādhi and make measureless offerings.",
        "source": "T10n0279_015:0077c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是十方諸世界，　　菩薩悉入無有餘，　或現三昧寂不動，　　或現恭敬供養佛。",
        "translation": "Thus, in the worlds of the ten directions, bodhisattvas all enter without remainder, sometimes manifesting samādhi that's still and motionless, or manifesting respect and offerings to the Buddha.",
        "source": "T10n0279_015:0077c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於眼根中入正定，　　於色塵中從定出，　示現色性不思議，　　一切天人莫能知。",
        "translation": "They enter right concentration in the eye faculty, emerge from concentration in form and dust, and show their form nature without thinking about it, which none of the gods or humans can know.",
        "source": "T10n0279_015:0077c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於色塵中入正定，　　於眼起定心不亂，　說眼無生無有起，　　性空寂滅無所作。",
        "translation": "Entering right concentration in the form dust, he arises from concentration in the eye and his mind isn't disturbed, explaining that the eye is unarisen and unarisen, and that its nature is empty and tranquil without activity.",
        "source": "T10n0279_015:0078a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於耳根中入正定，　　於聲塵中從定出，　分別一切語言音，　　諸天世人莫能知。",
        "translation": "He enters right concentration in the ear faculty, exits concentration in the sound dust, and discerns the sounds of all languages, which are unknowable to gods and humans.",
        "source": "T10n0279_015:0078a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於聲塵中入正定，　　於耳起定心不亂，　說耳無生無有起，　　性空寂滅無所作。",
        "translation": "Entering right concentration in the sound dust, he arouses concentration in his ear and his mind isn't distracted, teaching that the ear is unarisen, unarisen, and empty in nature, quiescent, and unacted upon.",
        "source": "T10n0279_015:0078a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於鼻根中入正定，　　於香塵中從定出，　普得一切上妙香，　　諸天世人莫能知。",
        "translation": "He enters correct concentration in the nasal faculty, exits concentration in scent dust, and attains all the most sublime fragrances that are unknowable to gods and humans.",
        "source": "T10n0279_015:0078a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於香塵中入正定，　　於鼻起定心不亂，　說鼻無生無有起，　　性空寂滅無所作。",
        "translation": "Entering right concentration in the scent dust, he arouses concentration in his nose without distraction, teaching that the nose is unarisen, unarisen, and empty in nature, quiescent, and unacted upon.",
        "source": "T10n0279_015:0078a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於舌根中入正定，　　於味塵中從定出，　普得一切諸上味，　　諸天世人莫能知。",
        "translation": "He enters right concentration in the gustatory faculty, exits concentration in the tasty dust, and attains all the excellent flavors universally, which are unknown to gods and humans.",
        "source": "T10n0279_015:0078a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於味塵中入正定，　　於舌起定心不亂，　說舌無生無有起，　　性空寂滅無所作。",
        "translation": "Entering right concentration in the taste dust, he arouses concentration in his tongue and his mind isn't disturbed, teaching that the tongue is unarisen, unarisen, and empty in nature, quiescent, and unacted upon.",
        "source": "T10n0279_015:0078a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於身根中入正定，　　於觸塵中從定出，　善能分別一切觸，　　諸天世人莫能知。",
        "translation": "He enters right concentration in the physical faculty, exits concentration in the sense of the tactile objects, and is able to skillfully discern all sensations, which are unknown to gods and humans.",
        "source": "T10n0279_015:0078a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於觸塵中入正定，　　於身起定心不亂，　說身無生無有起，　　性空寂滅無所作。",
        "translation": "Entering right concentration in the sense faculty, he arises from concentration in the body and his mind isn't disturbed, explaining that the body is unarisen, unarisen, and empty in nature, tranquil, and unacted upon.",
        "source": "T10n0279_015:0078a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於意根中入正定，　　於法塵中從定出，　分別一切諸法相，　　諸天世人莫能知。",
        "translation": "He enters right concentration in the mind faculty, exits concentration in the Dharma dust, and discerns the characteristics of all dharmas, which are unknown to gods and humans.",
        "source": "T10n0279_015:0078a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於法塵中入正定，　　從意起定心不亂，　說意無生無有起，　　性空寂滅無所作。",
        "translation": "Entering right concentration in the dust of dharmas, he produces a concentration from mind that's not distracted, explains that mind is unarisen, unarisen, and empty in nature, tranquil, and unacted upon.",
        "source": "T10n0279_015:0078a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　童子身中入正定，　　壯年身中從定出，　壯年身中入正定，　　老年身中從定出；　老年身中入正定，　　善女身中從定出；　善女身中入正定，　　善男身中從定出；　善男身中入正定，　　比丘尼身從定出；　比丘尼身入正定，　　比丘身中從定出；　比丘身中入正定，　　學無學身從定出；　學無學身入正定，　　辟支佛身從定出；　辟支佛身入正定，　　現如來身從定出；　於如來身入正定，　　諸天身中從定出；　諸天身中入正定，　　大龍身中從定出；　大龍身中入正定，　　夜叉身中從定出；　夜叉身中入正定，　　鬼神身中從定出；　鬼神身中入正定，　　一毛孔中從定出；　一毛孔中入正定，　　一切毛孔從定出；　一切毛孔入正定，　　一毛端頭從定出；　一毛端頭入正定，　　一微塵中從定出；　一微塵中入正定，　　一切塵中從定出；　一切塵中入正定，　　金剛地中從定出；　金剛地中入正定，　　摩尼樹上從定出；　摩尼樹上入正定，　　佛光明中從定出；　佛光明中入正定，　　於河海中從定出；　於河海中入正定，　　於火大中從定出；　於火大中入正定，　　於風起定心不亂；　於風大中入正定，　　於地大中從定出；　於地大中入正定，　　於天宮殿從定出；　於天宮殿入正定，　　於空起定心不亂。",
        "translation": "　童子身中入正定，　　壯年身中從定出，　壯年身中入正定，　　老年身中從定出；　老年身中入正定，　　善女身中從定出；　善女身中入正定，　　善男身中從定出；　善男身中入正定，　　比丘尼身從定出；　比丘尼身入正定，　　比丘身中從定出；　比丘身中入正定，　　學無學身從定出；　學無學身入正定，　　辟支佛身從定出；　辟支佛身入正定，　　現如來身從定出；　於如來身入正定，　　諸天身中從定出；　諸天身中入正定，　　大龍身中從定出；　大龍身中入正定，　　夜叉身中從定出；　夜叉身中入正定，　　鬼神身中從定出；　鬼神身中入正定，　　一毛孔中從定出；　一毛孔中入正定，　　一切毛孔從定出；　一切毛孔入正定，　　一毛端頭從定出；　一毛端頭入正定，　　一微塵中從定出；　一微塵中入正定，　　一切塵中從定出；　一切塵中入正定，　　金剛地中從定出；　金剛地中入正定，　　摩尼樹上從定出；　摩尼樹上入正定，　　佛光明中從定出；　佛光明中入正定，　　於河海中從定出；　於河海中入正定，　　於火大中從定出；　於火大中入正定，　　於風起定心不亂；　於風大中入正定，　　於地大中從定出；　於地大中入正定，　　於天宮殿從定出；　於天宮殿入正定，　　於空起定心不亂。",
        "source": "T10n0279_015:0078a24_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "　是名無量功德者，　　三昧自在難思議，　十方一切諸如來，　　於無量劫說不盡。",
        "translation": "This is called a person of immeasurable merit whose samādhi is unfathomably powerful and unfathomable, and it can't be explained in detail by all the tathāgatas in the ten directions over an immeasurable number of eons.",
        "source": "T10n0279_015:0078b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切如來咸共說，　　眾生業報難思議，　諸龍變化佛自在，　　菩薩神力亦難思。",
        "translation": "All the tathāgatas share this teaching, saying that the results of sentient beings' actions are unfathomable, that dragons change into buddhas with ease, and that the bodhisattva's spiritual powers are also unfathomable.",
        "source": "T10n0279_015:0078b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲以譬諭而顯示，　　終無有諭能諭此，　然諸智慧聰達人，　　因於譬故解其義。",
        "translation": "They want to show it by means of an example, but there's no example that can teach it, yet those of intelligence and insight understand its meaning because of the example.",
        "source": "T10n0279_015:0078b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聲聞心住八解脫，　　所有變現皆自在，　能以一身現多身，　　復以多身為一身。",
        "translation": "A direct disciple's mind abides in the eight liberations, is free to manifest all of them, can manifest many bodies with one, and then make many bodies into one.",
        "source": "T10n0279_015:0078b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於虛空中入火定，　　行住坐臥悉在空，　身上出水身下火，　　身上出火身下水。",
        "translation": "He enters the fire concentration in space, walks, sits, and lies down in space, generates water from his body and fire from his body, and generates water from his body and fire from his body.",
        "source": "T10n0279_015:0078c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是皆於一念中，　　種種自在無邊量。",
        "translation": "Thus, in a single thought, their various abilities are limitless.",
        "source": "T10n0279_015:0078c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼不具足大慈悲，　　不為眾生求佛道，　尚能現此難思事，　　況大饒益自在力。",
        "translation": "If they aren't fully endowed with great compassion and don't pursue the Buddha Way for the sake of sentient beings, they're still able to perform this unfathomable task, so why wouldn't they greatly enhance their unimpeded power?",
        "source": "T10n0279_015:0078c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如日月遊虛空，　　影像普遍於十方，　泉池陂澤器中水，　　眾寶河海靡不現。",
        "translation": "It's like the sun and moon traveling through space, their images pervading the ten directions, the water in a spring, a pond, a lagoon, or a river of multitudes of treasures that don't appear.",
        "source": "T10n0279_015:0078c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩色像亦復然，　　十方普現不思議，　此皆三昧自在法，　　唯有如來能證了。",
        "translation": "Bodhisattva form and images are likewise, appearing inconceivably in ten directions, which are all self-effulgent samādhis that only the Tathāgata can comprehend.",
        "source": "T10n0279_015:0078c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如淨水中四兵像，　　各各別異無交雜，　劍戟弧矢類甚多，　　鎧冑車輿非一種。",
        "translation": "Like the four images of soldiers in pure water, each is distinct and unadulterated, with a great variety of swords, pikes, arrows, and arrows, and no single type of armor, chariots, or mounts.",
        "source": "T10n0279_015:0078c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨其所有相差別，　　莫不皆於水中現，　而水本自無分別，　　菩薩三昧亦如是。",
        "translation": "Whatever differences they have, they all appear in the water, but the water itself has no discrimination, and so does bodhisattva samādhi.",
        "source": "T10n0279_015:0078c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　海中有神名善音，　　其音普順海眾生，　所有語言皆辨了，　　令彼一切悉歡悅。",
        "translation": "There's a spirit in the ocean named Shan Yin, whose voice is universally submissive to ocean sentient beings, and he discerns all speech and makes them all happy.",
        "source": "T10n0279_015:0078c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼神具有貪恚癡，　　猶能善解一切音，　況復總持自在力，　　而不能令眾歡喜！",
        "translation": "Even though that god is possessed of craving, ill-will, and delusion, he's still able to skillfully understand all sounds, so why wouldn't he have the sovereign power to control them all and not cause them to rejoice?",
        "source": "T10n0279_015:0078c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有一婦人名辯才，　　父母求天而得生，　若有離惡樂真實，　　入彼身中生妙辯。",
        "translation": "\"There's a woman named eloquence whose parents seek heavenly birth, and if there's anything that's free of evil and pleasant and real, she enters her body and produces marvelous eloquence.",
        "source": "T10n0279_015:0078c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼有貪欲瞋恚癡，　　猶能隨行與辯才，　何況菩薩具智慧，　　而不能與眾生益！",
        "translation": "Even though she has craving and anger, ill-will, and delusion, she can still act and speak eloquently, so why wouldn't a bodhisattva with wisdom be able to give benefit to sentient beings?",
        "source": "T10n0279_015:0078c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如幻師知幻法，　　能現種種無量事，　須臾示作日月歲，　　城邑豐饒大安樂。",
        "translation": "\"It's like an illusionist who knows illusory dharmas and can manifest measureless things, showing them in a moment's notice as the sun, moon, and years, and making cities abundant and great in well-being.",
        "source": "T10n0279_015:0078c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　幻師具有貪恚癡，　　猶能幻力悅世間，　況復禪定解脫力，　　而不能令眾歡喜！",
        "translation": "Even though an illusionist has craving, ill-will, and delusion, he can still delight the world with his illusory powers, so why wouldn't he be able to delight all people with the power of liberation through meditation?",
        "source": "T10n0279_015:0078c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天阿脩羅鬪戰時，　　脩羅敗衄而退走，　兵仗車輿及徒旅，　　一時竄匿莫得見。",
        "translation": "When the god Asura fights, he's defeated and retreats, and his troops, chariots, and hordes flee into hiding without being seen.",
        "source": "T10n0279_015:0078c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼有貪欲瞋恚癡，　　尚能變化不思議，　況住神通無畏法，　　云何不能現自在！",
        "translation": "Even though they have craving, anger, ill-will, and delusion, they can change without thinking, so why wouldn't they be able to abide in the Dharma of supernormal powers and fearlessness, and how could they not show their mastery?",
        "source": "T10n0279_015:0078c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　釋提桓因有象王，　　彼知天主欲行時，　自化作頭三十三，　　一一六牙皆具足；　一一牙上七池水，　　清淨香潔湛然滿；　一一清淨池水中，　　各七蓮華妙嚴飾；　彼諸嚴飾蓮華上，　　各各有七天玉女，　悉善技藝奏眾樂，　　而與帝釋相娛樂。",
        "translation": "\"Śakra Devānām-Indra has an elephant king who, when he knows the gods are about to practice, transforms himself into a head of thirty-three with each of the six tusks complete; in the water of each tusk are seven pools of pure, clean water filled with a clear fragrance; in the water of each pure pool are seven lotus flowers each exquisitely adorned; on each of those ornamented lotus flowers are seven heavenly jade maidens who are skilled in performing multitudes of music and entertain Indra.",
        "source": "T10n0279_015:0079a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼象或復捨本形，　　自化其身同諸天，　威儀進止悉齊等，　　有此變現神通力。",
        "translation": "Sometimes those elephants abandon their original forms and transform themselves into bodies identical to those of the gods, with their mannerisms and movements all equal, and with the miraculous powers of such manifestations.",
        "source": "T10n0279_015:0079a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼有貪欲瞋恚癡，　　尚能現此諸神通，　何況具足方便智，　　而於諸定不自在！",
        "translation": "Even if they have craving, anger, ill-will, and delusion, they're still able to manifest these powers, so why wouldn't they be able to perfect the knowledge of skillful means and not be at ease in those concentrations?",
        "source": "T10n0279_015:0079a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如阿脩羅變作身，　　蹈金剛際海中立，　海水至深僅其半，　　首共須彌正齊等。",
        "translation": "\"Suppose an asura transforms into a body, rides into the middle of the adamantine ocean, and the water is only half as deep as its head, and its head is exactly the same as Sumeru's.",
        "source": "T10n0279_015:0079a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼有貪欲瞋恚癡，　　尚能現此大神通，　況伏魔怨照世燈，　　而無自在威神力！",
        "translation": "If they have craving, anger, ill-will, and delusion, they're still capable of displaying this great superknowledge, so how could they subdue Māra's enemies and shine the lamp of the world without having sovereign, authoritative, and spiritual powers?",
        "source": "T10n0279_015:0079a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天阿脩羅共戰時，　　帝釋神力難思議，　隨阿脩羅軍眾數，　　現身等彼而與敵。",
        "translation": "When the gods and asuras fought together, Tathāgata's unfathomable powers matched the number of his army with the number of asuras who showed themselves equal to their opponents.",
        "source": "T10n0279_015:0079a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸阿脩羅發是念：　　『釋提桓因來向我，　必取我身五種縛。』",
        "translation": "Those asuras then had this thought, 'Śakra Devānām-Indra is coming toward me, and he'll surely take the five kinds of fetters off my body.'",
        "source": "T10n0279_015:0079a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　由是彼眾悉憂悴。",
        "translation": "As a result, they were all distressed.",
        "source": "T10n0279_015:0079a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　帝釋現身有千眼，　　手持金剛出火焰，　被甲持杖極威嚴，　　脩羅望見咸退伏。",
        "translation": "Tidewater reveals himself as a man with a thousand eyes, holding a vajra in his hand that shoots out flames, wearing armor and carrying a staff that's so dignified that all the sūras who see it retreat.",
        "source": "T10n0279_015:0079a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼以微小福德力，　　猶能摧破大怨敵，　何況救度一切者，　　具足功德不自在！",
        "translation": "With the power of a little merit, he can still defeat a great enemy, so why wouldn't he save all of them with unsurpassed virtue?",
        "source": "T10n0279_015:0079a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　忉利天中有天鼓，　　從天業報而生得，　知諸天眾放逸時，　　空中自然出此音。",
        "translation": "\"In the Heaven of Thirty-three, there's a heavenly drum that arises from the results of heavenly actions, and it naturally sounds like this in the sky when it's aware that the gods are careless.",
        "source": "T10n0279_015:0079a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切五欲悉無常，　　如水聚沫性虛偽，　諸有如夢如陽焰，　　亦如浮雲水中月。",
        "translation": "All five desires are impermanent, like water that collects foam and is hypocritical in nature, and all existences are like dreams, like sunbeams, or like floating clouds and the moon in water.",
        "source": "T10n0279_015:0079a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　放逸為怨為苦惱，　　非甘露道生死徑，　若有作諸放逸行，　　入於死滅大魚口。",
        "translation": "Carelessness is enmity and suffering, not the path to birth and death on the nectarine path, and if someone engages in careless behavior, they'll enter the mouth of the great fish that dies and disappears.",
        "source": "T10n0279_015:0079a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間所有眾苦本，　　一切聖人皆厭患，　五欲功德滅壞性，　　汝應愛樂真實法。",
        "translation": "Of all the world's causes of suffering, all sages are disillusioned, and since the five desirable qualities are destructive, you should delight in the true teaching.",
        "source": "T10n0279_015:0079a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三十三天聞此音，　　悉共來昇善法堂，　帝釋為說微妙法，　　咸令順寂除貪愛。",
        "translation": "When the Trāyastriṃśa gods hear this sound, they all ascend to the hall of the good Dharma, and Indra speaks the subtle Dharma for them, causing them all to become tranquil and free from craving.",
        "source": "T10n0279_015:0079b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼音無形不可見，　　猶能利益諸天眾，　況隨心樂現色身，　　而不濟度諸群生！",
        "translation": "Even though that voice has no form and can't be seen, it can still benefit the gods, so why wouldn't it be possible to follow your heart's pleasure in manifesting a body that doesn't help all sentient beings?",
        "source": "T10n0279_015:0079b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天阿脩羅共鬪時，　　諸天福德殊勝力，　天鼓出音告其眾：　　『汝等宜應勿憂怖！』",
        "translation": "When the gods Asura were fighting together, the gods' merits were so great that a divine drum would sound out to the crowd, saying, 'Don't be afraid, you guys!'",
        "source": "T10n0279_015:0079b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天聞此所告音，　　悉除憂畏增益力。",
        "translation": "When the gods heard what they were told, they all removed their fears and increased their powers.",
        "source": "T10n0279_015:0079b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時阿脩羅心震懼，　　所將兵眾咸退走。",
        "translation": "Then, Ashura's heart trembles with fear, and the troops he's generating all retreat.",
        "source": "T10n0279_015:0079b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　甘露妙定如天鼓，　　恒出降魔寂靜音，　大悲哀愍救一切，　　普使眾生滅煩惱。",
        "translation": "Like a heavenly drum, that marvelous concentration of ambrosia constantly produces a calming voice that subdues Māra, greatly pities and saves them all, and causes sentient beings to cease their afflictions.",
        "source": "T10n0279_015:0079b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　帝釋普應諸天女，　　九十有二那由他，　令彼各各心自謂：　　『天王獨與我娛樂。』",
        "translation": "Indra universally responds to the goddesses, 90 or 22 nayutas, causing each of them to say to themselves, 'The king of gods alone entertains me.'",
        "source": "T10n0279_015:0079b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如天女中身普應，　　善法堂內亦如是，　能於一念現神通，　　悉至其前為說法。",
        "translation": "Just as the middle body of the goddesses is universally responsive, so too is the interior of the hall of the good Dharma, where they can manifest their supernormal powers at a single thought and all come before them to preach.",
        "source": "T10n0279_015:0079b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　帝釋具有貪恚癡，　　能令眷屬悉歡喜，　況大方便神通力，　　而不能令一切悅！",
        "translation": "Indra has craving, ill-will, and delusion, and he can make his followers all rejoice, but how much more so when he has the power of great skillful means and supernormal abilities that can't please them all!",
        "source": "T10n0279_015:0079b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　他化自在六天王，　　於欲界中得自在，　以業惑苦為罥網，　　繫縛一切諸凡夫。",
        "translation": "\"The six heavenly kings who are freely transformed by others attain mastery in the desire realm, and they bind all worldlings with the web of karma, delusion, and suffering.",
        "source": "T10n0279_015:0079b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼有貪欲瞋恚癡，　　猶於眾生得自在，　況具十種自在力，　　而不能令眾同行！",
        "translation": "Even though they have craving, desire, anger, ill-will, and delusion, they're still at ease with sentient beings, so how much more so when they have ten kinds of sovereign power that can't cause others to walk with them!",
        "source": "T10n0279_015:0079b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三千世界大梵王，　　一切梵天所住處，　悉能現身於彼坐，　　演暢微妙梵音聲。",
        "translation": "\"The great brahma king of the 3,000 worlds and all the places where brahma gods reside can all appear in person and sit there, producing the subtle sound of the brahma voice.",
        "source": "T10n0279_015:0079b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼住世間梵道中，　　禪定神通尚如意，　況出世間無有上，　　於禪解脫不自在！",
        "translation": "They abide in the secular Brahma path, yet their meditation and superknowledge are as they wish, so why wouldn't they go beyond the secular world and not be at ease in meditation and liberation?",
        "source": "T10n0279_015:0079b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　摩醯首羅智自在，　　大海龍王降雨時，　悉能分別數其滴，　　於一念中皆辨了。",
        "translation": "Mahêśvara's knowledge is so powerful that when the great ocean dragon king sends down rain, he's able to discern and count its drops, discerning them all in a single thought.",
        "source": "T10n0279_015:0079b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量億劫勤修學，　　得是無上菩提智，　云何不於一念中，　　普知一切眾生心！",
        "translation": "After countless millions of eons of diligent cultivation, he has attained this unsurpassed knowledge of enlightenment, so why doesn't he universally know the minds of all sentient beings in a single moment of thought?",
        "source": "T10n0279_015:0079b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生業報不思議，　　以大風力起世間，　巨海諸山天宮殿，　　眾寶光明萬物種。",
        "translation": "The results of sentient beings' actions are inconceivable, and they arise in the world with the power of a great wind, which produces a huge ocean, mountains, and heavenly palaces, where multitudes of treasures illuminate myriad varieties of things.",
        "source": "T10n0279_015:0079c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦能興雲降大雨，　　亦能散滅諸雲氣，　亦能成熟一切穀，　　亦能安樂諸群生。",
        "translation": "It also generates clouds and sends down great rains, disperses clouds of air, matures all grains, and brings comfort to all sentient beings.",
        "source": "T10n0279_015:0079c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　風不能學波羅蜜，　　亦不學佛諸功德，　猶成不可思議事，　　何況具足諸願者！",
        "translation": "Even though the breeze can't train in the perfection of pāramitā and doesn't train in the Buddha's attributes, it still accomplishes unfathomable things, so why would it be possible for someone to fulfill all of his vows?",
        "source": "T10n0279_015:0079c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　男子女人種種聲，　　一切鳥獸諸音聲，　大海川流雷震聲，　　皆能稱悅眾生意。",
        "translation": "The various sounds of men and women, the sounds of all the birds and animals, and the thunderous noise of the ocean and rivers all please multitudes of business.",
        "source": "T10n0279_015:0079c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　況復知聲性如響，　　逮得無礙妙辯才，　普應眾生而說法，　　而不能令世間喜！",
        "translation": "How much more so when he knows the nature of sound as sound and acquires the marvelous unhindered eloquence to teach to all sentient beings, but can't cause the world to rejoice!",
        "source": "T10n0279_015:0079c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　海有希奇殊特法，　　能為一切平等印，　眾生寶物及川流，　　普悉包容無所拒。",
        "translation": "\"There's a rare and extraordinary thing in the ocean that can be the seal of equality for all things, and it fully embraces the treasures of sentient beings and rivers without rejecting anything.",
        "source": "T10n0279_015:0079c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無盡禪定解脫者，　　為平等印亦如是，　福德智慧諸妙行，　　一切普修無厭足。",
        "translation": "He who is liberated by inexhaustible meditation, thus is he who seals equality, and he cultivates all the marvelous practices of merit and wisdom without tire.",
        "source": "T10n0279_015:0079c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大海龍王遊戲時，　　普於諸處得自在，　興雲充遍四天下，　　其雲種種莊嚴色：　第六他化自在天，　　於彼雲色如真金，　化樂天上赤珠色；　　兜率陀天霜雪色；　夜摩天上瑠璃色；　　三十三天碼碯色；　四王天上玻瓈色；　　大海水上金剛色；　緊那羅中妙香色；　　諸龍住處蓮華色；　夜叉住處白鵝色；　　阿脩羅中山石色；　欝單越處金焰色；　　閻浮提中青寶色；　餘二天下雜莊嚴，　　隨眾所樂而應之。",
        "translation": "　大海龍王遊戲時，　　普於諸處得自在，　興雲充遍四天下，　　其雲種種莊嚴色：　第六他化自在天，　　於彼雲色如真金，　化樂天上赤珠色；　　兜率陀天霜雪色；　夜摩天上瑠璃色；　　三十三天碼碯色；　四王天上玻瓈色；　　大海水上金剛色；　緊那羅中妙香色；　　諸龍住處蓮華色；　夜叉住處白鵝色；　　阿脩羅中山石色；　欝單越處金焰色；　　閻浮提中青寶色；　餘二天下雜莊嚴，　　隨眾所樂而應之。",
        "source": "T10n0279_015:0079c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復他化自在天，　　雲中電耀如日光；　化樂天上如月光；　　兜率天上閻浮金；　夜摩天上珂雪色；　　三十三天金焰色；　四王天上眾寶色；　　大海之中赤珠色；　緊那羅界瑠璃色；　　龍王住處寶藏色；　夜叉所住玻瓈色；　　阿脩羅中碼碯色；　欝單越境火珠色；　　閻浮提中帝青色；　餘二天下雜莊嚴，　　如雲色相電亦然。",
        "translation": "Also, in the Paranirmita-vaśavartin Heaven, lightning shines like sunlight in the clouds; it's like moonlight in the Paranirmita-vaśavartin Heaven; it's gold in Tuṣita Heaven; it's snow-colored in Yama Heaven; it's gold-flame in the Trāyastriṃśa Heaven; it's the color of many treasures in the Four Kings' Heaven; it's red-pearl in the ocean; it's lapis lazuli in the Kiṃnaras' Realm; it's the color of a jeweled treasure house where the dragon king lives; it's the color of a rock crystal where the yakṣas live; it's the color of a sparkling pearl in Uttarakuru; it's the color of indigo in Yambudvī; and it's a variety of adornments under the other two heavens, just like the color of clouds and lightning.",
        "source": "T10n0279_015:0079c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　他化雷震如梵音；　　化樂天中大鼓音；　兜率天上歌唱音；　　夜摩天上天女音；　於彼三十三天上，　　如緊那羅種種音；　護世四王諸天所，　　如乾闥婆所出音；　海中兩山相擊聲；　　緊那羅中簫笛聲；　諸龍城中頻伽聲；　　夜叉住處龍女聲；　阿脩羅中天鼓聲；　　於人道中海潮聲。",
        "translation": "They are transformed by the thunder of Brahmā, the sound of a great drum in the Nirmāṇarati Heaven, the sound of singing in the Tuṣita Heaven, the sound of a goddess in the Yama Heaven, various sounds in the Trāyastriṃśa Heaven like those of Kisna, the sounds of the four guardian gods like those of Gandharva, the sound of two mountains striking against each other in the ocean, the sound of a flute in Kisna, the sound of a conch in the city of dragons, the sound of a nymph in the Yama Heaven, the sound of a heavenly drum in Asura, and the sound of the ocean tide in the human path.",
        "source": "T10n0279_015:0080a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　他化自在雨妙香，　　種種雜華為莊嚴；　化樂天雨多羅華，　　曼陀羅華及澤香；　兜率天上雨摩尼，　　具足種種寶莊嚴，　髻中寶珠如月光，　　上妙衣服真金色；　夜摩中雨幢幡蓋，　　華鬘塗香妙嚴具，　赤真珠色上好衣，　　及以種種眾妓樂；　三十三天如意珠，　　堅黑沈水栴檀香，　欝金雞羅多摩等，　　妙華香水相雜雨；　護世城中雨美膳，　　色香味具增長力，　亦雨難思眾妙寶，　　悉是龍王之所作。",
        "translation": "　他化自在雨妙香，　　種種雜華為莊嚴；　化樂天雨多羅華，　　曼陀羅華及澤香；　兜率天上雨摩尼，　　具足種種寶莊嚴，　髻中寶珠如月光，　　上妙衣服真金色；　夜摩中雨幢幡蓋，　　華鬘塗香妙嚴具，　赤真珠色上好衣，　　及以種種眾妓樂；　三十三天如意珠，　　堅黑沈水栴檀香，　欝金雞羅多摩等，　　妙華香水相雜雨；　護世城中雨美膳，　　色香味具增長力，　亦雨難思眾妙寶，　　悉是龍王之所作。",
        "source": "T10n0279_015:0080a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復於彼大海中，　　注雨不斷如車軸，　復雨無盡大寶藏，　　亦雨種種莊嚴寶。",
        "translation": "Also, in that ocean, it rains unceasingly like a chariot shaft, rains an inexhaustible store of great treasures, and rains down all kinds of adorned treasures.",
        "source": "T10n0279_015:0080a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　緊那羅界雨瓔珞，　　眾色蓮華衣及寶，　婆利師迦末利香，　　種種樂音皆具足；　諸龍城中雨赤珠；　　夜叉城內光摩尼；　阿脩羅中雨兵仗，　　摧伏一切諸怨敵；　欝單越中雨瓔珞，　　亦雨無量上妙華；　弗婆瞿耶二天下，　　悉雨種種莊嚴具；　閻浮提雨清淨水，　　微細悅澤常應時，　長養眾華及果藥，　　成熟一切諸苗稼。",
        "translation": "In the realm of the kiṃnara, it rains ornaments, lotus-hued robes and treasures, the fragrance of vārṣika and mallikā, and every kind of pleasant sound; in the cities of the dragons, it rains red pearls; in the city of the yakṣas, shining maṇi; in the city of asura, it rains armaments that subdue all enemies; in the city of Uttarakuru, it rains ornaments and measureless marvelous flowers; in the two worlds of Pūrva-Ghoṣa, it rains all kinds of adornments; in Jambudvīpa, it rains pure water that's always finely pleasant, nourishes flowers and medicines, and matures all crops.",
        "source": "T10n0279_015:0080a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是無量妙莊嚴，　　種種雲電及雷雨，　龍王自在悉能作，　　而身不動無分別。",
        "translation": "Such measureless and marvelous adornments, various clouds, lightning, and thunderstorms are all created by the dragon king's mastery, yet his body doesn't budge or discriminate.",
        "source": "T10n0279_015:0080b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼於世界海中住，　　尚能現此難思力，　況入法海具功德，　　而不能為大神變！",
        "translation": "When he lives in the ocean of worlds, he's still able to display this unfathomable power, so how could he enter the ocean of the Dharma with all its attributes and not be capable of great miraculous powers!",
        "source": "T10n0279_015:0080b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼諸菩薩解脫門，　　一切譬諭無能顯，　我今以此諸譬諭，　　略說於其自在力。",
        "translation": "\"Those bodhisattvas' approach to liberation is not revealed by any explanation, and now I'll explain it briefly in terms of its sovereign power by using these explanations.",
        "source": "T10n0279_015:0080b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第一智慧廣大慧，　　真實智慧無邊慧，　勝慧及以殊勝慧，　　如是法門今已說。",
        "translation": "This is the first wisdom, vast wisdom, true wisdom, limitless wisdom, superior wisdom, and exceptional wisdom, as I've explained in this teaching.",
        "source": "T10n0279_015:0080b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此法希有甚奇特，　　若人聞已能忍可，　能信能受能讚說，　　如是所作甚為難。",
        "translation": "This is a rare and extraordinary teaching that can be tolerated, believed, accepted, and praised if someone hears it, and such an action is very difficult.",
        "source": "T10n0279_015:0080b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間一切諸凡夫，　　信是法者甚難得，　若有勤修清淨福，　　以昔因力乃能信。",
        "translation": "For all the world's worldlings, believing in this teaching is very difficult to attain, but if someone diligently cultivates pure merit, they'll be able to believe it because of the power of past causes.",
        "source": "T10n0279_015:0080b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切世界諸群生，　　少有欲求聲聞乘，　求獨覺者轉復少，　　趣大乘者甚難遇。",
        "translation": "Of all the world's masses of people, few want to pursue the śrāvaka vehicle, and those who pursue the solitary realizer are increasingly few, so it's very difficult to meet someone who's headed for the great vehicle.",
        "source": "T10n0279_015:0080b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　趣大乘者猶為易，　　能信此法倍更難，　況復持誦為人說，　　如法修行真實解！",
        "translation": "It's still easy to enter the great vehicle, but it's twice as difficult to believe in this teaching, much less to recite it and explain it to others and cultivate true understanding according to the teaching!",
        "source": "T10n0279_015:0080b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有以三千大千界，　　頂戴一劫身不動，　彼之所作未為難，　　信是法者乃為難。",
        "translation": "\"There's someone who takes 3,000 great one-thousand worlds and wears their body unmoving for an eon, whose actions aren't difficult but whose belief in the teaching is difficult.",
        "source": "T10n0279_015:0080b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有以手擎十佛剎，　　盡於一劫空中住，　彼之所作未為難，　　能信此法乃為難。",
        "translation": "\"Is there someone who holds ten buddha bases in their hands and completely abides in the air for an eon? What they do is not difficult, but it's difficult for them to believe in this teaching.",
        "source": "T10n0279_015:0080b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十剎塵數眾生所，　　悉施樂具經一劫，　彼之福德未為勝，　　信此法者為最勝。",
        "translation": "Those ten buddha-halas are numerous, and all of their blessings endure for an eon. Their merit is not yet superior, but believing in this teaching is the most superior.",
        "source": "T10n0279_015:0080b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十剎塵數如來所，　　悉皆承事盡一劫，　若於此品能誦持，　　其福最勝過於彼。」",
        "translation": "All the tathāgatas in the ten buddha-lands are served for an entire eon, and if they could recite this teaching, their merit would be superior to theirs.\"",
        "source": "T10n0279_015:0080b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，賢首菩薩說此偈已，十方世界六返震動，魔宮隱蔽，惡道休息。",
        "translation": "After Bhadrapāla spoke this verse, the world in the ten directions was shaken by six rebirths, the demon's palace was hidden, and the evil destinies were at rest.",
        "source": "T10n0279_015:0080b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方諸佛普現其前，各以右手而摩其頂，同聲讚言：「善哉！",
        "translation": "The buddhas of the ten directions all appeared before him, each rubbing his right hand on his head and praising him with one voice, \"Good!",
        "source": "T10n0279_015:0080b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T10n0279_015:0080b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快說此法！",
        "translation": "Quickly explain this teaching!",
        "source": "T10n0279_015:0080b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等一切悉皆隨喜。」",
        "translation": "We all rejoice in everything.\"",
        "source": "T10n0279_015:0080b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第十五",
        "translation": "Dafangguang fo huayan jing roll fifteen",
        "source": "T10n0279_015:0080c01_0",
        "is_bad_quality": false
    }
]