[
    {
        "source_sentence": "大周新譯大方廣佛華嚴經序",
        "translation": "Preface to the New Translation of the Dazhou Dafangfo Huayan jing",
        "source": "T10n0279_001:0001a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天冊金輪聖神皇帝製",
        "translation": "Made by the Holy Emperor, the Golden Wheel of the Heavenly Register",
        "source": "T10n0279_001:0001a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓋聞：「造化權輿之首，天道未分；龜龍繫象之初，人文始著。",
        "translation": "It's been said, \"At the time when the government of creation was first established, the Way of the Gods was yet to be divided; at the time when the tortoise and the dragon were first fettered with the elephant, humanity first became prominent.",
        "source": "T10n0279_001:0001a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖萬八千歲，同臨有截之區；七十二君，詎識無邊之義。」",
        "translation": "Although eighteen thousand years old, they were all in the same region of existence, and seventy-two rulers, they failed to realize the limitless meaning.\"",
        "source": "T10n0279_001:0001a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是人迷四忍，輪迴於六趣之中；家纏五蓋，沒溺於三塗之下。",
        "translation": "As a result, people are confused about the four tolerances and are reincarnated in the six destinies, and their families are tethered to the five hindrances and submerged beneath the three destinies.",
        "source": "T10n0279_001:0001a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及夫鷲巖西峙，象駕東驅，慧日法王超四大而高視，中天調御越十地以居尊，包括鐵圍，延促沙劫。",
        "translation": "As Vulture Peak stands to the west and the elephant drives to the east, the Dharma King of Wisdom Sun rises above the four elements and looks up, and the tamer of the middle gods transcends the ten stages and assumes supremacy, encompassing them with iron rings and prolonging eons.",
        "source": "T10n0279_001:0001a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其為體也，則不生不滅；其為相也，則無去無來。",
        "translation": "When it's its essence, it doesn't arise or cease, and when it's its characteristics, there's no going or coming.",
        "source": "T10n0279_001:0001a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念處、正勤，三十七品為其行；慈、悲、喜、捨，四無量法運其心。",
        "translation": "Mindfulness and right effort are their thirty-seven practices, and kindness, pity, joy, and equanimity are the four immeasurable qualities that carry their minds.",
        "source": "T10n0279_001:0001a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方便之力難思，圓對之機多緒，混大空而為量，豈算數之能窮？",
        "translation": "The power of skillful means is difficult to fathom, and the capacity for perfect alignment is so varied that it's hard to fathom how to calculate it when it's mixed with great emptiness.",
        "source": "T10n0279_001:0001a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入纖芥之微區，匪名言之可述，無得而稱者，其唯大覺歟！",
        "translation": "The only one who enters the smallest region of a mustard seed, who is beyond the reach of language, and who has nothing to commend him is greatly enlightened!",
        "source": "T10n0279_001:0001a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "朕曩劫植因，叨承佛記。",
        "translation": "I planted the causes in the past eons and have been honored by the Buddha's prediction.",
        "source": "T10n0279_001:0001a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金仙降旨，大雲之偈先彰；玉扆披祥，寶雨之文後及。",
        "translation": "The golden recluse sent down a decree, and the great cloud of verses was revealed first; the jade scriptures were auspicious, and the precious rain document came later.",
        "source": "T10n0279_001:0001a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "加以積善餘慶，俯集微躬，遂得地平天成，河清海晏。",
        "translation": "With the remaining good fortune accumulated, I've bent my humble self over, and thus have attained a level earth and a heaven, and a clear river and a calm sea.",
        "source": "T10n0279_001:0001a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殊禎絕瑞，既日至而月書；貝牒靈文，亦時臻而歲洽。",
        "translation": "The most rare and wonderful thing about the world was that the sun came and the moon wrote about it, and the precious and spiritual writing reached them at the right time and in good time.",
        "source": "T10n0279_001:0001a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逾海越漠，獻賝之禮備焉；架險航深，重譯之辭罄矣。",
        "translation": "Beyond the sea and across the desert, the offering of the gem was prepared; the shelf was perilous and the voyage deep, and the words of the retranslation were exhausted.",
        "source": "T10n0279_001:0001a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《大方廣佛華嚴經》者，斯乃諸佛之密藏，如來之性海。",
        "translation": "The Dafangguang fo huayan jing is the hidden treasury of the buddhas and the ocean of the tathāgata's nature.",
        "source": "T10n0279_001:0001a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "視之者，莫識其指歸；挹之者，罕測其涯際。",
        "translation": "Those who look at it don't know what it refers to; those who dig into it rarely fathom its limit.",
        "source": "T10n0279_001:0001a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有學、無學，志絕窺覦；二乘、三乘，寧希聽受。",
        "translation": "Those who have and those who haven't studied it never wish to peer into it, and those who are two or three vehicles would rather hear and accept it.",
        "source": "T10n0279_001:0001a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最勝種智，莊嚴之迹既隆；普賢、文殊，願行之因斯滿。",
        "translation": "The most excellent type of cognition has produced the traces of its adornment, and Samantabhadra and Mañjuśrī have completed the causes of their vows and practices.",
        "source": "T10n0279_001:0001a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一句之內，包法界之無邊；一毫之中，置剎土而非隘。",
        "translation": "Within a single phrase, it encompasses the limitlessness of the Dharma realm, and within a single speck, it places buddha-lands that are not narrow.",
        "source": "T10n0279_001:0001a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩竭陀國，肇興妙會之緣；普光法堂，爰敷寂滅之理。",
        "translation": "The land of Magadha is the cause for the birth of the marvelous assembly, and the hall of the Dharma of universal illumination is the place where the principle of extinction is laid out.",
        "source": "T10n0279_001:0001a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緬惟奧義，譯在晉朝；時逾六代，年將四百。",
        "translation": "The translation of this profound teaching dates back to the Jin dynasty; it has been translated for more than six generations and is approaching 400 years old.",
        "source": "T10n0279_001:0001b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然圓一部之典，纔獲三萬餘言，唯啟半珠，未窺全寶。",
        "translation": "Yet, the complete edition of this scripture has yielded only 30,000 words, revealing only half a pearl but not yet the whole treasure.",
        "source": "T10n0279_001:0001b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "朕聞其梵本，先在于闐國中，遣使奉迎，近方至此。",
        "translation": "I've heard about its Sanskrit edition, which was first published in Yutan, and I sent an envoy to welcome it here recently.",
        "source": "T10n0279_001:0001b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既覩百千之妙頌，乃披十萬之正文。",
        "translation": "I've seen a hundred thousand wonderful verses, and I've read a hundred thousand texts.",
        "source": "T10n0279_001:0001b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "粵以證聖元年，歲次乙未，月旅沽洗，朔惟戊申，以其十四日辛酉，於大遍空寺，親受筆削，敬譯斯經。",
        "translation": "In the first year of Zhengsheng's reign, the year ended with the year Bewei, the moon traveled to Gushang, and the moon began with the month Wushang. On the fourteenth day of the month, at Xingyou, I personally received a writing and sharpening at Dapeng Kongsi and respectfully translated this sūtra.",
        "source": "T10n0279_001:0001b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂得甘露流津，預夢庚申之夕；膏雨灑潤，後覃壬戌之辰。",
        "translation": "It was then that the nectar flowed freely, anticipating the evening of Genshen's dream, and the anointing rain sprinkled the evening of Nonsuch's subsequent preparation.",
        "source": "T10n0279_001:0001b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "式開實相之門，還符一味之澤。",
        "translation": "This opened the gate of true characteristics and restored the moat of unity of flavor.",
        "source": "T10n0279_001:0001b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以聖曆二年，歲次己亥，十月壬午朔，八日己丑，繕寫畢功；添性海之波瀾，廓法界之疆域。",
        "translation": "In the second year of the Shengli period, during the year jihai, on the eighth day of the tenth month, the moon of nonwu, the writing was completed; it added to the waves of the ocean of nature and contoured the boundaries of the Dharma realm.",
        "source": "T10n0279_001:0001b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘頓教，普被於無窮；方廣真筌，遐該於有識。",
        "translation": "The sudden teaching of the great vehicle was universally applied to infinity, and the true chyuan of Fangguang was widely applied to the consciousnesses of sentient beings.",
        "source": "T10n0279_001:0001b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈謂後五百歲，忽奉金口之言；娑婆境中，俄啟珠函之祕。",
        "translation": "Is it true that in the next five hundred years, he suddenly received the words of Chrysostom, and in the realm of sahāsāra, he suddenly revealed the secrets of the pearl box?",
        "source": "T10n0279_001:0001b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所冀：闡揚沙界，宣暢塵區；並兩曜而長懸，彌十方而永布。",
        "translation": "What was hoped for: to elucidate the sandy realm and proclaim it to the dusty region; to combine the two luminaries and hang them for a long time, and to cover the ten directions and spread them forever.",
        "source": "T10n0279_001:0001b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一窺寶偈，慶溢心靈；三復幽宗，喜盈身意。",
        "translation": "One glimpse of the precious verse overflows my heart and soul with joy; three times I've repeated the esoteric teaching, and my body and mind are filled with delight.",
        "source": "T10n0279_001:0001b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖則無說無示，理符不二之門；然而因言顯言，方闡大千之義。",
        "translation": "Although it's neither explained nor shown, it conforms to the gate of nonduality in principle; yet it reveals the meaning of the great chiliocosm by means of language.",
        "source": "T10n0279_001:0001b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輒申鄙作，爰題序云。",
        "translation": "I have readily explained my humble work, and I have titled the preface as follows.",
        "source": "T10n0279_001:0001b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第一",
        "translation": "Dafangguang fo huayan jing roll 1",
        "source": "T10n0279_001:0001b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "Translated by the Bhikṣuṇī of Khotan, the Tripiṭaka of Khotan",
        "source": "T10n0279_001:0001b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世主妙嚴品第一之一",
        "translation": "The First of the World-Lord's Chapter of Marvelous Adornment",
        "source": "T10n0279_001:0001b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時，佛在摩竭提國阿蘭若法菩提場中，始成正覺。",
        "translation": "Thus I have heard: One time, the Buddha was in the enlightenment site of the Dharma in Araṇyavatī in Magadha when he first became perfectly enlightened.",
        "source": "T10n0279_001:0001b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地堅固，金剛所成；上妙寶輪，及眾寶華、清淨摩尼，以為嚴飾；諸色相海，無邊顯現；摩尼為幢，常放光明，恒出妙音，眾寶羅網，妙香華纓，周匝垂布；摩尼寶王，變現自在，雨無盡寶及眾妙華分散於地；寶樹行列，枝葉光茂。",
        "translation": "The ground was solid and made of adamantine material; it was adorned by a wheel of marvelous jewels, a multitude of precious flowers, and pure maṇi; an ocean of colors and forms was displayed without limit; a maṇi banner that always shone brightly and produced a constant, marvelous sound; a web of treasures and a mantle of marvelous flowers and fragrances spread everywhere; the maṇi treasure king manifested itself freely, raining endless treasures and multitudes of marvelous flowers on the ground; and a jeweled tree was planted in rows with branches and leaves that shone brightly.",
        "source": "T10n0279_001:0001b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛神力故，令此道場一切莊嚴於中影現。",
        "translation": "Because of the Buddha's spiritual power, this site of enlightenment is mirrored in all its splendor.",
        "source": "T10n0279_001:0001c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其菩提樹高顯殊特：金剛為身，瑠璃為幹；眾雜妙寶以為枝條；寶葉扶踈，垂蔭如雲；寶華雜色，分枝布影，復以摩尼而為其果，含輝發焰，與華間列。",
        "translation": "Its bodhi tree is distinguished by its height: a body of adamantine and a trunk of lapis lazuli, its branches made of a variety of wonderful treasures, its leaves lined with jewels and shaded like clouds, its flowers of various colors branched and shadowed, and its fruit, which is made of maṇi, glowing and flaming, arrayed among the flowers.",
        "source": "T10n0279_001:0001c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其樹周圍咸放光明，於光明中雨摩尼寶，摩尼寶內，有諸菩薩，其眾如雲，俱時出現。",
        "translation": "A bright light radiates from all around the tree, and in that light it rains maṇi-jewel, and inside the maṇi-jewel there are bodhisattvas and their multitudes appear at the same time like clouds.",
        "source": "T10n0279_001:0001c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以如來威神力故，其菩提樹恒出妙音，說種種法，無有盡極。",
        "translation": "Because of the Tathāgata's authoritative power, the bodhi tree always produces marvelous sounds that teach a variety of things that have no limit.",
        "source": "T10n0279_001:0001c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所處宮殿樓閣，廣博嚴麗充遍十方，眾色摩尼之所集成，種種寶華以為莊校；諸莊嚴具流光如雲，從宮殿間萃影成幢。",
        "translation": "The palace and tower where the Tathāgata resides is vast and ornate, filling the ten directions, incorporating many colored maṇi, and decorated with various jewels and flowers, and the ornaments shine like clouds, forming a banner from the shadows gathered in the palace.",
        "source": "T10n0279_001:0001c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊菩薩道場眾會咸集其所，以能出現諸佛光明不思議音。",
        "translation": "The numerous assemblies at the site of the infinite bodhisattva path gather there to produce the inconceivable sounds of the buddhas' brightness.",
        "source": "T10n0279_001:0001c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩尼寶王而為其網，如來自在神通之力所有境界皆從中出；一切眾生居處屋宅，皆於此中現其影像。",
        "translation": "The maṇi-jewel king acts as a net from which all the realms of the Tathāgata's sovereign supernormal powers emerge, and all the places where sentient beings live and the houses they occupy are all imaged here.",
        "source": "T10n0279_001:0001c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以諸佛神力所加，一念之間，悉包法界。",
        "translation": "Also, because of the buddhas' spiritual powers, they all encompass the Dharma realm in a single thought.",
        "source": "T10n0279_001:0001c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其師子座，高廣妙好：摩尼為臺，蓮華為網，清淨妙寶以為其輪，眾色雜華而作瓔珞。",
        "translation": "His lion throne is high and wide and marvelous: a platform made of maṇi, a net of lotus flowers, a wheel of pure marvelous treasures, and a necklace of flowers of various colors.",
        "source": "T10n0279_001:0001c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堂榭、樓閣、階砌、戶牖，凡諸物像，備體莊嚴；寶樹枝果，周迴間列。",
        "translation": "The halls, pavilions, mansions, staircases, windows, and statues are all adorned in their entirety, and the branches of the jeweled trees and fruits are arranged in a circular fashion.",
        "source": "T10n0279_001:0001c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩尼光雲，互相照耀；十方諸佛，化現珠玉；一切菩薩髻中妙寶，悉放光明而來瑩燭。",
        "translation": "Clouds of maṇi light shine from one to another, and the buddhas of the ten directions are transformed into jewels and jade, while all the wonderful treasures in the buns of the bodhisattvas radiate their light and come to candle them.",
        "source": "T10n0279_001:0001c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以諸佛威神所持，演說如來廣大境界，妙音遐暢，無處不及。",
        "translation": "Upholded by the buddhas' authority, they also explained the Tathāgata's vast range of objects with a marvelous voice that was heard everywhere.",
        "source": "T10n0279_001:0001c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊處于此座，於一切法成最正覺，智入三世悉皆平等，其身充滿一切世間，其音普順十方國土。",
        "translation": "At the time, the Bhagavān was sitting here, had become most perfectly awakened to all things, had knowledge that entered the three worlds equally, filled all the world with his body, and universally acceded to the lands of the ten directions with his voice.",
        "source": "T10n0279_001:0001c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空具含眾像，於諸境界無所分別；又如虛空普遍一切，於諸國土平等隨入。",
        "translation": "He was like space that contains all the images and discerns nothing about the various realms, and like space that pervades them all, he enters them equally.",
        "source": "T10n0279_001:0001c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身恒遍坐一切道場，菩薩眾中威光赫奕，如日輪出，照明世界。",
        "translation": "His body is always pervasively seated in all places of practice, and he shines brilliantly among the bodhisattvas like a sun wheel emerging to illuminate the world.",
        "source": "T10n0279_001:0002a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三世所行，眾福大海，悉已清淨，而恒示生諸佛國土。",
        "translation": "The oceans of merit that have been practiced in the three times are all purified, and he's always shown birth in the lands of the buddhas.",
        "source": "T10n0279_001:0002a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊色相，圓滿光明，遍周法界，等無差別；演一切法，如布大雲。",
        "translation": "Their limitless color and shape and their perfect radiance completely pervade the Dharma realm without distinction, and they expound all teachings like the spreading of a great cloud.",
        "source": "T10n0279_001:0002a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一毛端，悉能容受一切世界而無障礙，各現無量神通之力，教化調伏一切眾生；身遍十方而無來往，智入諸相，了法空寂。",
        "translation": "Every hair on his head can accommodate all the worlds without obstruction, and each displays measureless supernormal powers to teach, transform, and tame all sentient beings; his body pervades the ten directions without coming or going, and his wisdom enters all forms and comprehends the emptiness of phenomena.",
        "source": "T10n0279_001:0002a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三世諸佛所有神變，於光明中靡不咸覩；一切佛土不思議劫所有莊嚴，悉令顯現。",
        "translation": "All the miraculous powers of the buddhas of the three times are visible in the light, and all the adornments of inconceivable eons in all the buddha lands are fully revealed.",
        "source": "T10n0279_001:0002a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十佛世界微塵數菩薩摩訶薩所共圍遶，其名曰：普賢菩薩摩訶薩、普德最勝燈光照菩薩摩訶薩、普光師子幢菩薩摩訶薩、普寶焰妙光菩薩摩訶薩、普音功德海幢菩薩摩訶薩、普智光照如來境菩薩摩訶薩、普寶髻華幢菩薩摩訶薩、普覺悅意聲菩薩摩訶薩、普清淨無盡福光菩薩摩訶薩、普光明相菩薩摩訶薩、海月光大明菩薩摩訶薩、雲音海光無垢藏菩薩摩訶薩、功德寶髻智生菩薩摩訶薩、功德自在王大光菩薩摩訶薩、善勇猛蓮華髻菩薩摩訶薩、普智雲日幢菩薩摩訶薩、大精進金剛臍菩薩摩訶薩、香焰光幢菩薩摩訶薩、大明德深美音菩薩摩訶薩、大福光智生菩薩摩訶薩……。",
        "translation": "有十佛世界微塵數菩薩摩訶薩所共圍遶，其名曰：普賢菩薩摩訶薩、普德最勝燈光照菩薩摩訶薩、普光師子幢菩薩摩訶薩、普寶焰妙光菩薩摩訶薩、普音功德海幢菩薩摩訶薩、普智光照如來境菩薩摩訶薩、普寶髻華幢菩薩摩訶薩、普覺悅意聲菩薩摩訶薩、普清淨無盡福光菩薩摩訶薩、普光明相菩薩摩訶薩、海月光大明菩薩摩訶薩、雲音海光無垢藏菩薩摩訶薩、功德寶髻智生菩薩摩訶薩、功德自在王大光菩薩摩訶薩、善勇猛蓮華髻菩薩摩訶薩、普智雲日幢菩薩摩訶薩、大精進金剛臍菩薩摩訶薩、香焰光幢菩薩摩訶薩、大明德深美音菩薩摩訶薩、大福光智生菩薩摩訶薩……。",
        "source": "T10n0279_001:0002a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有十佛世界微塵數。",
        "translation": "Such as these are the heads of the ten buddha-worlds and are numbered in tiny dust motes.",
        "source": "T10n0279_001:0002a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩，往昔皆與毘盧遮那如來共集善根，修菩薩行；皆從如來善根海生，諸波羅蜜悉已圓滿；慧眼明徹，等觀三世；於諸三昧，具足清淨；辯才如海，廣大無盡；具佛功德，尊嚴可敬；知眾生根，如應化伏；入法界藏，智無差別；證佛解脫，甚深廣大；能隨方便，入於一地，而以一切願海所持，恒與智俱盡未來際；了達諸佛希有廣大祕密之境，善知一切佛平等法，已踐如來普光明地，入於無量三昧海門；於一切處，皆隨現身；世法所行，悉同其事；總持廣大，集眾法海；辯才善巧，轉不退輪；一切如來功德大海，咸入其身；一切諸佛所在國土，皆隨願往；已曾供養一切諸佛，無邊際劫，歡喜無倦；一切如來得菩提處，常在其中，親近不捨；恒以所得普賢願海，令一切眾生智身具足。",
        "translation": "此諸菩薩，往昔皆與毘盧遮那如來共集善根，修菩薩行；皆從如來善根海生，諸波羅蜜悉已圓滿；慧眼明徹，等觀三世；於諸三昧，具足清淨；辯才如海，廣大無盡；具佛功德，尊嚴可敬；知眾生根，如應化伏；入法界藏，智無差別；證佛解脫，甚深廣大；能隨方便，入於一地，而以一切願海所持，恒與智俱盡未來際；了達諸佛希有廣大祕密之境，善知一切佛平等法，已踐如來普光明地，入於無量三昧海門；於一切處，皆隨現身；世法所行，悉同其事；總持廣大，集眾法海；辯才善巧，轉不退輪；一切如來功德大海，咸入其身；一切諸佛所在國土，皆隨願往；已曾供養一切諸佛，無邊際劫，歡喜無倦；一切如來得菩提處，常在其中，親近不捨；恒以所得普賢願海，令一切眾生智身具足。",
        "source": "T10n0279_001:0002a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就如是無量功德。",
        "translation": "He accomplishes such measureless merits.",
        "source": "T10n0279_001:0002b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有佛世界微塵數執金剛神，所謂：妙色那羅延執金剛神、日輪速疾幢執金剛神、須彌華光執金剛神、清淨雲音執金剛神、諸根美妙執金剛神、可愛樂光明執金剛神、大樹雷音執金剛神、師子王光明執金剛神、密焰勝目執金剛神、蓮華光摩尼髻執金剛神……。",
        "translation": "There are also a number of dust motes in the Buddha's realm that possess the vajra spirits, namely, the vajra spirits of Narayan the Wonderful Color, the vajra spirits of Nārāyaṇa the Speedy Banner of the Sun, the vajra spirits of Sumeru the Flower Light, the vajra spirits of the Sound of the Pure Clouds, the vajra spirits of the Wonderfulness of the Faculties, the vajra spirits of the Desirable Light, the vajra spirits of the Thundering Sound of the Great Tree, the vajra spirits of the Shizi King, the vajra spirits of the Dense Flame of the Eyes, and the vajra spirits of the Maṇi Bun of the Lotus Light....",
        "source": "T10n0279_001:0002b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有佛世界微塵數，皆於往昔無量劫中恒發大願，願常親近供養諸佛；隨願所行，已得圓滿，到於彼岸；積集無邊清淨福業，於諸三昧所行之境悉已明達；獲神通力，隨如來住，入不思議解脫境界；處於眾會，威光特達，隨諸眾生所應現身而示調伏；一切諸佛化形所在，皆隨化往；一切如來所住之處，常勤守護。",
        "translation": "Thus, as the chief, there are the Buddha-realm minutest number of people who have always made the great vow throughout the countless eons past to always be close to and make offerings to the buddhas; who have fulfilled that vow and reached the other shore; who have accumulated limitless pure meritorious actions and fully comprehended the objects of samādhi practice; who have attained the supernormal powers to follow the Tathāgata's abodes and enter the realm of inconceivable liberation; who have an especially powerful presence in congregations, showing and subduing sentient beings in the bodies that respond to their needs; who go along with all the buddhas wherever they take the form of a transformation; and who are always diligent about guarding all the places where the Tathāgata lives.",
        "source": "T10n0279_001:0002b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有佛世界微塵數身眾神，所謂：華髻莊嚴身眾神、光照十方身眾神、海音調伏身眾神、淨華嚴髻身眾神、無量威儀身眾神、最上光嚴身眾神、淨光香雲身眾神、守護攝持身眾神、普現攝取身眾神、不動光明身眾神……。",
        "translation": "There are also a myriad of body gods in the Buddha's world, which are called: the body gods of the flower-bun adornment, the body gods of the light that shines in the ten directions, the body gods of the ocean sound that tames the body, the body gods of the pure flower adornment bun, the body gods of the measureless manner, the body gods of the supreme radiance, the body gods of the fragrant clouds of pure light, the body gods that guard and retain the body, the body gods that universally apprehend the body, and the body gods of the immovable light....",
        "source": "T10n0279_001:0002b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有佛世界微塵數，皆於往昔成就大願，供養承事一切諸佛。",
        "translation": "At the head of these, there's a Buddha-realm of tiny dust motes that all accomplished the great vow to make offerings to and serve all the buddhas in the past.",
        "source": "T10n0279_001:0002c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有佛世界微塵數足行神，所謂；寶印手足行神、蓮華光足行神、清淨華髻足行神、攝諸善見足行神、妙寶星幢足行神、樂吐妙音足行神、栴檀樹光足行神、蓮華光明足行神、微妙光明足行神、積集妙華足行神……。",
        "translation": "There are also a tiny number of foot soldiers in the Buddha world, which are called the foot soldiers of the jeweled hand, the foot soldiers of lotus light, the foot soldiers of the pure flower topknot, the foot soldiers of gathering good views, the foot soldiers of the wonderfully jeweled star banner, the foot soldiers of the blissful exhalation of wonderful sounds, the foot soldiers of the light from the sandalwood tree, the foot soldiers of lotus light, the foot soldiers of subtle light, and the foot soldiers of the accumulation of marvelous flowers....",
        "source": "T10n0279_001:0002c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有佛世界微塵數，皆於過去無量劫中，親近如來，隨逐不捨。",
        "translation": "At the head of such people, there are a tiny number of dust motes in the Buddha's world that have been close to the Tathāgata throughout the countless eons of the past, following him around and not abandoning him.",
        "source": "T10n0279_001:0002c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有佛世界微塵數道場神，所謂：淨莊嚴幢道場神、須彌寶光道場神、雷音幢相道場神、雨華妙眼道場神、華纓光髻道場神、雨寶莊嚴道場神、勇猛香眼道場神、金剛彩雲道場神、蓮華光明道場神、妙光照耀道場神……。",
        "translation": "There are also a myriad of deities of the Buddha-realm's ritual sites, which are called: the ritual site deity of the banner of pure adornment, the ritual site deity of Sumeru's precious light, the ritual site deity of the thundering banner shape, the ritual site deity of the marvelous eye of the rain-flower, the ritual site deity of the flower-topknot, the ritual site deity of the adorned rain-jewel, the ritual site deity of the fragrant eye of courage, the ritual site deity of the vajra-colored clouds, the ritual site deity of the lotus flower's radiance, and the ritual site deity of the marvelous illumination....",
        "source": "T10n0279_001:0002c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有佛世界微塵數，皆於過去值無量佛，成就願力，廣興供養。",
        "translation": "Such as these, they're the heads of tiny dust motes of Buddha-worlds that have all met measureless buddhas in the past, fulfilled their vows, and made extensive offerings.",
        "source": "T10n0279_001:0002c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有佛世界微塵數主城神，所謂：寶峯光耀主城神、妙嚴宮殿主城神、清淨喜寶主城神、離憂清淨主城神、華燈焰眼主城神、焰幢明現主城神、盛福光明主城神、清淨光明主城神、香髻莊嚴主城神、妙寶光明主城神……。",
        "translation": "There are also a diminutive number of chief city deities of the Buddha world, which are called: the chief city deity of the radiant jeweled peak, the chief city deity of the palace of marvelous adornment, the chief city deity of the pure joy treasure, the chief city deity of the pure freedom from sorrow, the chief city deity of the flaming eye of the flower lamp, the chief city deity of the bright appearance of the flaming banner, the chief city deity of the abundantly blessed radiance, the chief city deity of the pure radiance, the chief city deity of the fragrant topknot, and the chief city deity of the marvelous jeweled radiance....",
        "source": "T10n0279_001:0002c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有佛世界微塵數，皆於無量不思議劫，嚴淨如來所居宮殿。",
        "translation": "At the head of such-and-such, there are a tiny number of Buddha-worlds that have adorned and purified the palace where the Tathāgata resides for measureless, unfathomable eons.",
        "source": "T10n0279_001:0002c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有佛世界微塵數主地神，所謂：普德淨華主地神、堅福莊嚴主地神、妙華嚴樹主地神、普散眾寶主地神、淨目觀時主地神、妙色勝眼主地神、香毛發光主地神、悅意音聲主地神、妙華旋髻主地神、金剛嚴體主地神……。",
        "translation": "Furthermore, there are a diminutive number of ground-level deities in the Buddha's world, which are called: the ground-level deity who presides over the purity of the flowers of universal virtue, the ground-level deity who presides over the adornment of solid merit, the ground-level deity who presides over the marvelous flower adornment tree, the ground-level deity who presides over the scattering of numerous treasures, the ground-level deity who presides over the clear eyes when they contemplate, the ground-level deity who presides over the marvelously colored superior eye, the ground-level deity whose fragrant hair glows, the ground-level deity who presides over the pleasing sounds, the ground-level deity who presides over the marvelous flower swirling topknot, and the ground-level deity who presides over the adorned body of Vajra....",
        "source": "T10n0279_001:0002c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有佛世界微塵數，皆於往昔發深重願，願常親近諸佛如來，同修福業。",
        "translation": "These are the chief deities, and there are a tiny number of buddha-worlds that have all made a profound vow in the past to always be close to the buddha-tathāgatas and cultivate good karma together.",
        "source": "T10n0279_001:0003a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主山神，所謂：寶峯開華主山神，華林妙髻主山神、高幢普照主山神、離塵淨髻主山神、光照十方主山神、大力光明主山神、威光普勝主山神、微密光輪主山神、普眼現見主山神、金剛密眼主山神……。",
        "translation": "There are also measureless chief mountain deities, including the chief mountain deity of the jeweled peak with its opening flower, the chief mountain deity of the marvelous topknot of the flower forest, the chief mountain deity of the high banner that shines universally, the chief mountain deity of the pure topknot that's free of dust, the chief mountain deity of the light that shines in ten directions, the chief mountain deity of the great radiance, the chief mountain deity of the universal radiance, the chief mountain deity of the subtle and dense wheel of light, the chief mountain deity of the universal eye that sees clearly, and the chief mountain deity of the vajra eye that's dense....",
        "source": "T10n0279_001:0003a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆於諸法得清淨眼。",
        "translation": "These are the heads of an incalculable number of them, and they all attain purified vision of the things.",
        "source": "T10n0279_001:0003a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有不可思議數主林神，所謂：布華如雲主林神、擢幹舒光主林神、生芽發耀主林神、吉祥淨葉主林神、垂布焰藏主林神、清淨光明主林神、可意雷音主林神、光香普遍主林神、妙光迴耀主林神、華果光味主林神……。",
        "translation": "There are also an unfathomable number of chief forest spirits, which are called: the chief forest spirits who spread flowers like clouds, the chief forest spirits who mushroom and shine, the chief forest spirits who sprout buds and shine, the chief forest spirits who are blessed with pure leaves, the chief forest spirits who spread flaming treasures, the chief forest spirits who are purely radiant, the chief forest spirits who are agreeable to thunderous sounds, the chief forest spirits whose fragrance is universal, the chief forest spirits whose marvelous light shines forth, and the chief forest spirits whose flowers and fruits are luminous and flavorful....",
        "source": "T10n0279_001:0003a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，不思議數，皆有無量可愛光明。",
        "translation": "Such and such are the chief, inconceivable, and each has measureless desirable lights.",
        "source": "T10n0279_001:0003a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主藥神，所謂：吉祥主藥神、栴檀林主藥神、清淨光明主藥神、名稱普聞主藥神、毛孔光明主藥神、普治清淨主藥神、大發吼聲主藥神、蔽日光幢主藥神、明見十方主藥神、益氣明目主藥神……。",
        "translation": "There are also measureless chief medicine spirits, including the auspicious chief medicine spirit, the chief medicine spirit of the sandalwood forest, the chief medicine spirit of pure light, the chief medicine spirit whose name is universally heard, the chief medicine spirit whose pores are illuminated, the chief medicine spirit whose purity is universally healed, the chief medicine spirit whose voice is loud, the chief medicine spirit whose light banners cover the sun, the chief medicine spirit who sees clearly in ten directions, and the chief medicine spirit who improves energy and brightens eyes ... .",
        "source": "T10n0279_001:0003a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，性皆離垢，仁慈祐物。",
        "translation": "These are the heads of an infinite number of them, all of whom are spotless by nature and kind to things.",
        "source": "T10n0279_001:0003a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主稼神，所謂：柔軟勝味主稼神、時華淨光主稼神、色力勇健主稼神、增長精氣主稼神、普生根果主稼神、妙嚴環髻主稼神、潤澤淨華主稼神、成就妙香主稼神、見者愛樂主稼神、離垢淨光主稼神……。",
        "translation": "There are also measureless chief crops spirits, which are called: chief crops spirits of softness and excellent taste, chief crops spirits of the pure light of seasonal flowers, chief crops spirits of strength of form, chief crops spirits of the growth of vitality, chief crops spirits of the production of roots and fruits, chief crops spirits of the marvelously adorned crown, chief crops spirits of the moistened and pure flowers, chief crops spirits of the accomplishment of wonderful fragrances, chief crops spirits of the delight of those who see, chief crops spirits of the pure light that's free of defilement ...",
        "source": "T10n0279_001:0003a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，莫不皆得大喜成就。",
        "translation": "There are countless such leaders, and they all attain great joy and success.",
        "source": "T10n0279_001:0003a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主河神，所謂：普發迅流主河神、普潔泉澗主河神、離塵淨眼主河神、十方遍吼主河神、救護眾生主河神、無熱淨光主河神、普生歡喜主河神、廣德勝幢主河神、光照普世主河神、海德光明主河神……。",
        "translation": "There are also measureless river gods, including the river god who generates swift streams, the river god who cleans springs universally, the river god who's free of the pure eye of dust, the river god who roars everywhere in the ten directions, the river god who rescues sentient beings, the river god who has a feverless, pure light, the river god who's universally joyous, the river god who's the banner of vast virtue, the river god who shines universally, and the river god who's the ocean of virtuous light....",
        "source": "T10n0279_001:0003a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，有無量數，皆勤作意利益眾生。",
        "translation": "Thus, there are measureless leaders who diligently work to benefit sentient beings.",
        "source": "T10n0279_001:0003b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主海神，所謂：出現寶光主海神、成金剛幢主海神、遠塵離垢主海神、普水宮殿主海神、吉祥寶月主海神、妙華龍髻主海神、普持光味主海神、寶焰華光主海神、金剛妙髻主海神、海潮雷聲主海神……。",
        "translation": "There are also measureless chief sea deities, namely, the chief sea deity who produces a jeweled light, the chief sea deity who forms the adamantine banner, the chief sea deity who's far removed from the dust and pollution, the chief sea deity who fills the palace of the universal waters, the chief sea deity who's an auspicious jeweled moon, the chief sea deity who's a marvelous flower dragon topknot, the chief sea deity who universally sustains the taste of light, the chief sea deity who's a jeweled flame and flower light, the chief sea deity who's a vajra marvelous topknot, and the chief sea deity who's the thunder of the ocean ... .",
        "source": "T10n0279_001:0003b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，悉以如來功德大海充滿其身。",
        "translation": "These are the heads of an incalculable number of them, all filling their bodies with the great ocean of the Tathāgata's merit.",
        "source": "T10n0279_001:0003b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主水神，所謂：普興雲幢主水神、海潮雲音主水神、妙色輪髻主水神、善巧漩澓主水神、離垢香積主水神、福橋光音主水神、知足自在主水神、淨喜善音主水神、普現威光主水神、吼音遍海主水神……。",
        "translation": "There are also measureless chief water deities, which are called: the chief water deity of the cloud banner that prospers, the chief water deity of the cloud sound of the ocean tide, the chief water deity of the marvelously colored wheel topknot, the chief water deity of the skillful whirlpool, the chief water deity of the fragrance accumulation that leaves the stain behind, the chief water deity of the luminous sound of the merit bridge, the chief water deity of the mastery of knowing, the chief water deity of the good sound of joy, the chief water deity of the universal radiance, and the chief water deity of the roaring sound that pervades the ocean....",
        "source": "T10n0279_001:0003b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，常勤救護一切眾生而為利益。",
        "translation": "These are the highest of these, and their number is countless, always working to protect and benefit all sentient beings.",
        "source": "T10n0279_001:0003b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無數主火神，所謂：普光焰藏主火神、普集光幢主火神、大光普照主火神、眾妙宮殿主火神、無盡光髻主火神、種種焰眼主火神、十方宮殿如須彌山主火神、威光自在主火神、光明破暗主火神、雷音電光主火神……。",
        "translation": "There are also countless fire deities, including the fire deity of the universal blazing store, the fire deity of the universal collection of light banners, the fire deity of the great universal illumination, the fire deity of the many marvelous palaces, the fire deity of the endless buns of light, the fire deity of the various eyes of flame, the fire deity of the palaces in the ten directions like Mount Sumeru, the fire deity of the unimpeded radiance, the fire deity of the light that refutes darkness, and the fire deity of the thundering, lightning, and flash of lightning....",
        "source": "T10n0279_001:0003b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，不可稱數，皆能示現種種光明，令諸眾生熱惱除滅。",
        "translation": "These are incalculable leaders who can show various kinds of light to remove the feverishness and distress of sentient beings.",
        "source": "T10n0279_001:0003b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主風神，所謂：無礙光明主風神、普現勇業主風神、飄擊雲幢主風神、淨光莊嚴主風神、力能竭水主風神、大聲遍吼主風神、樹杪垂髻主風神、所行無礙主風神、種種宮殿主風神、大光普照主風神……。",
        "translation": "There are also measureless chief wind gods, which are called the chief wind god of unobstructed light, the chief wind god of universally displayed courageous actions, the chief wind god of billowing clouds and banners, the chief wind god of purely radiant adornment, the chief wind god of strength that dries up water, the chief wind god of a great universal roar, the chief wind god of a pendulous topknot, the chief wind god of unobstructed movement, the chief wind god of various palaces, and the chief wind god of a great universal light....",
        "source": "T10n0279_001:0003b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤散滅我慢之心。",
        "translation": "These are the chief deities, and their number is countless, all of whom work to dissipate their minds of pride.",
        "source": "T10n0279_001:0003c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主空神，所謂：淨光普照主空神、普遊深廣主空神、生吉祥風主空神、離障安住主空神、廣步妙髻主空神、無礙光焰主空神、無礙勝力主空神、離垢光明主空神、深遠妙音主空神、光遍十方主空神……。",
        "translation": "There are also measureless chief air deities, which are called the chief air deity of pure light that illuminates everywhere, the chief air deity of a deep and wide range, the chief air deity of an auspicious breeze that arises, the chief air deity of a peaceful abode free of hindrances, the chief air deity of a broad and marvelous topknot, the chief air deity of an unobstructed blaze of light, the chief air deity of unhindered superior strength, the chief air deity of a light free of defilement, the chief air deity of a profound and marvelous voice, and the chief air deity of a light that pervades the ten directions....",
        "source": "T10n0279_001:0003c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，心皆離垢，廣大明潔。",
        "translation": "These are the leaders of an incalculable number of them, all of them with minds free of pollution and vastly clear and pure.",
        "source": "T10n0279_001:0003c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主方神，所謂：遍住一切主方神、普現光明主方神、光行莊嚴主方神、周行不礙主方神、永斷迷惑主方神、普遊淨空主方神、大雲幢音主方神、髻目無亂主方神、普觀世業主方神、周遍遊覽主方神……。",
        "translation": "There are also measureless primary deities, which are: the primary deity who omnipresently abides in all directions, the primary deity who universally produces light, the primary deity whose radiance conducts adornment, the primary deity whose circumambulation isn't obstructed, the primary deity who permanently ends delusion, the primary deity who universally travels through pure space, the primary deity whose sound is a great cloud banner, the primary deity whose topknot eyes are unconfused, the primary deity who universally observes worldly activities, and the primary deity who universally travels around....",
        "source": "T10n0279_001:0003c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，能以方便，普放光明，恒照十方，相續不絕。",
        "translation": "These are the chief deities, which are numberless and capable of universally shining their light with skillful means, constantly shining in the ten directions, and continuing without break.",
        "source": "T10n0279_001:0003c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主夜神，所謂：普德淨光主夜神、喜眼觀世主夜神、護世精氣主夜神、寂靜海音主夜神、普現吉祥主夜神、普發樹華主夜神、平等護育主夜神、遊戲快樂主夜神、諸根常喜主夜神、出生淨福主夜神……。",
        "translation": "There are also measureless chief night spirits, namely, the chief night spirits of the universal virtue of pure light, the chief night spirits of the joyful eye that observes the world, the chief night spirits of the energy that protects the world, the chief night spirits of the quiescent ocean sound, the chief night spirits of the universal manifestation of good fortune, the chief night spirits of the universal emission of flowers, the chief night spirits of the equal protection of nurture, the chief night spirits of play and joy, the chief night spirits of the constant joy of the faculties, and the chief night spirits of the birth of pure merit ... .",
        "source": "T10n0279_001:0003c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤修習，以法為樂。",
        "translation": "These are the highest of these, and their number is countless, all diligently cultivating the joy of the Dharma.",
        "source": "T10n0279_001:0003c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量主晝神，所謂：示現宮殿主晝神、發起慧香主晝神、樂勝莊嚴主晝神、香華妙光主晝神、普集妙藥主晝神、樂作喜目主晝神、普現諸方主晝神、大悲光明主晝神、善根光照主晝神、妙華瓔珞主晝神……。",
        "translation": "There are also measureless chief priests, which are: the chief priests who reveal the palace, the chief priests who produce the fragrance of wisdom, the chief priests who are delightfully adorned, the chief priests who are the marvelous radiance of fragrant flowers, the chief priests who gather wonderful medicines universally, the chief priests who delight in the eye of joy, the chief priests who universally reveal all directions, the chief priests who are the brightness of great compassion, the chief priests who are the illumination of good roots, and the chief priests who are the jewels of marvelous flowers....",
        "source": "T10n0279_001:0003c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆於妙法能生信解，恒共精勤嚴飾宮殿。",
        "translation": "These are the heads of an incalculable number of people who are capable of producing faith in the wonderful Dharma and who always work together to adorn the palace.",
        "source": "T10n0279_001:0003c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量阿脩羅王，所謂：羅睺阿脩羅王、毘摩質多羅阿脩羅王、巧幻術阿脩羅王、大眷屬阿脩羅王、大力阿脩羅王、遍照阿脩羅王、堅固行妙莊嚴阿脩羅王、廣大因慧阿脩羅王、出現勝德阿脩羅王、妙好音聲阿脩羅王……。",
        "translation": "There are also measureless Aśūra Kings, namely, Rāhu Aśūra, Vimalacitra Aśūra, Skilful Illusion Aśūra, Great Affiliate Aśūra, Vigorous Aśūra, Pervasive Illumination Aśūra, Resolute Conduct Myriad Adornments Aśūra, Vast Causal Wisdom Aśūra, Emergence of Superb Virtues Aśūra, and Wonderful Sound Aśūra....",
        "source": "T10n0279_001:0003c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，悉已精勤摧伏我慢及諸煩惱。",
        "translation": "These are the heads of an incalculable number of people who have diligently subdued their pride and other afflictions.",
        "source": "T10n0279_001:0004a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有不可思議數迦樓羅王，所謂：大速疾力迦樓羅王、無能壞寶髻迦樓羅王、清淨速疾迦樓羅王、心不退轉迦樓羅王、大海處攝持力迦樓羅王、堅固淨光迦樓羅王、巧嚴冠髻迦樓羅王、普捷示現迦樓羅王、普觀海迦樓羅王、普音廣目迦樓羅王……。",
        "translation": "There are also an unfathomable number of other garuḍêndra kings, namely, Garuḍêndra the King of Great Speed, Garuḍêndra the King of Incorruptible Jewels, Garuḍêndra the King of Speedy Purity, Garuḍêndra the King of Nonretrogression, Garuḍêndra the King of Holding Power at the Great Ocean, Garuḍêndra the King of Resolute and Pure Light, Garuḍêndra the King of the Exquisitely Adorned Topknot, Garuḍêndra the King of Universal Speedy Manifestation, Garuḍêndra the King of the Universally Observing Ocean, Garuḍêndra the King of the Universally Sounding Wide Eyes....",
        "source": "T10n0279_001:0004a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，不思議數，悉已成就大方便力，善能救攝一切眾生。",
        "translation": "These are the heads of the hierarchy, inconceivably numerous, all of whom have accomplished the power of great skillful means and are well able to save all sentient beings.",
        "source": "T10n0279_001:0004a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量緊那羅王，所謂：善慧光明天緊那羅王、妙華幢緊那羅王、種種莊嚴緊那羅王、悅意吼聲緊那羅王、寶樹光明緊那羅王、見者欣樂緊那羅王、最勝光莊嚴緊那羅王、微妙華幢緊那羅王、動地力緊那羅王、攝伏惡眾緊那羅王……。",
        "translation": "There are also measureless guardian kiṃnara kings, namely, the goddess of good wisdom guardian kiṃnara, the king of marvelous flowers guardian kiṃnara, the king of various adornments guardian kiṃnara, the king of joyful roars guardian kiṃnara, the king of jeweled trees guardian kiṃnara, the king of delightful beings guardian kiṃnara, the king of most excellent luminous adornment guardian kiṃnara, the king of marvelous flowers guardian kiṃnara, the king of earth-shaking power guardian kiṃnara, the king of subduing evil multitudes guardian kiṃnara ... .",
        "source": "T10n0279_001:0004a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤精進，觀一切法，心恒快樂，自在遊戲。",
        "translation": "These are the leaders of an incalculable number of people who exert themselves, contemplate all things, are constantly happy, and play with ease.",
        "source": "T10n0279_001:0004a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量摩睺羅伽王，所謂：善慧摩睺羅伽王、清淨威音摩睺羅伽王、勝慧莊嚴髻摩睺羅伽王、妙目主摩睺羅伽王、如燈幢為眾所歸摩睺羅伽王、最勝光明幢摩睺羅伽王、師子臆摩睺羅伽王、眾妙莊嚴音摩睺羅伽王、須彌堅固摩睺羅伽王、可愛樂光明摩睺羅伽王……。",
        "translation": "There are also measureless mahoraga kings, namely, the mahoraga king of good wisdom, the mahoraga king of pure and dignified sounds, the mahoraga king of the ornamented topknot of excellent wisdom, the mahoraga king of the marvelously eyed lord, the mahoraga king of the lamp post to which all people take refuge, the mahoraga king of the banner of most excellent light, the mahoraga king of the lion's conception, the mahoraga king of many wonderful and adorned sounds, the mahoraga king of the Sumerian firmament, and the mahoraga king of the delightful radiance....",
        "source": "T10n0279_001:0004a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤修習廣大方便，令諸眾生永割癡網。",
        "translation": "These are the heads of countless others who diligently cultivate vast skillful means to cause sentient beings to permanently cut off the web of delusion.",
        "source": "T10n0279_001:0004a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量夜叉王，所謂：毘沙門夜叉王、自在音夜叉王、嚴持器仗夜叉王、大智慧夜叉王、焰眼主夜叉王、金剛眼夜叉王、勇健臂夜叉王、勇敵大軍夜叉王、富資財夜叉王、力壞高山夜叉王……。",
        "translation": "There are also measureless yakṣa kings, namely, Vaiśravaṇa yakṣa king, Vipaśyin yakṣa king, Vajra-eyed yakṣa king, Vajra-eyed yakṣa king, Vajra-armed yakṣa king, Vajra-opposed yakṣa king, Wealthy yakṣa king, and Powerful yakṣa king who destroys high mountains....",
        "source": "T10n0279_001:0004b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤守護一切眾生。",
        "translation": "These are the heads of an incalculable number of them, all diligently guarding all sentient beings.",
        "source": "T10n0279_001:0004b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量諸大龍王，所謂：毘樓博叉龍王、娑竭羅龍王、雲音妙幢龍王、焰口海光龍王、普高雲幢龍王、德叉迦龍王、無邊步龍王、清淨色龍王、普運大聲龍王、無熱惱龍王……。",
        "translation": "There are also measureless great dragon kings, namely, Virūpakṣa, Sāgara, Meghasvaradhara, Yamaguchi, Meghasvaradhara, Takṣaka, Bimbisāra, Puruṣapāda, Pūrṇa, and Nirmāṇarati....",
        "source": "T10n0279_001:0004b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，莫不勤力興雲布雨，令諸眾生熱惱消滅。",
        "translation": "These are the leaders of an incalculable number of dragons who diligently produce clouds and spread rain to make the feverish afflictions of sentient beings disappear.",
        "source": "T10n0279_001:0004b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量鳩槃荼王，所謂：增長鳩槃荼王、龍主鳩槃荼王、善莊嚴幢鳩槃荼王、普饒益行鳩槃荼王、甚可怖畏鳩槃荼王、美目端嚴鳩槃荼王、高峯慧鳩槃荼王、勇健臂鳩槃荼王、無邊淨華眼鳩槃荼王、廣大天面阿脩羅眼鳩槃荼王……。",
        "translation": "There are also measureless kumbhāṇḍa kings, namely, the Growing Kumbhāṇḍa King, the Dragon Lord Kumbhāṇḍa King, the Well-Arranged Banner Kumbhāṇḍa King, the Universally Beneficial Conduct Kumbhāṇḍa King, the Very Fearful Kumbhāṇḍa King, the Beautifully Eyed and Adorned Kumbhāṇḍa King, the High Peak Wisdom Kumbhāṇḍa King, the Brave-Armed Kumbhāṇḍa King, the Infinitely Pure Flower-Eye Kumbhāṇḍa King, and the Vast God-faced Asura-Eye Kumbhāṇḍa King....",
        "source": "T10n0279_001:0004b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤修學無礙法門，放大光明。",
        "translation": "These are the heads of an incalculable number of people who diligently train in the unhindered teaching and magnify their light.",
        "source": "T10n0279_001:0004b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量乾闥婆王，所謂：持國乾闥婆王、樹光乾闥婆王、淨目乾闥婆王、華冠乾闥婆王、普音乾闥婆王、樂搖動妙目乾闥婆王、妙音師子幢乾闥婆王、普放寶光明乾闥婆王、金剛樹華幢乾闥婆王、樂普現莊嚴乾闥婆王……。",
        "translation": "There are also countless other Qianmuang kings, namely, the country-holding Qianmuang king, the tree-bright Qianmuang king, the pure-eyed Qianmuang king, the flower-crowned Qianmuang king, the pervasive sound Qianmuang king, the blissfully shaking marvelous-eyed Qianmuang king, the marvelously sounding lion-banner Qianmuang king, the universally radiating radiance of treasures Qianmuang king, the vajra-tree-flower-banner Qianmuang king, the blissfully universally adorned Qianmuang king....",
        "source": "T10n0279_001:0004b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆於大法深生信解，歡喜愛重，勤修不倦。",
        "translation": "There are countless such ascendants who have deep faith in the great teaching, rejoice, love, and diligently cultivate it.",
        "source": "T10n0279_001:0004b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量月天子，所謂月天子：華王髻光明天子、眾妙淨光明天子、安樂世間心天子、樹王眼光明天子、示現清淨光天子、普遊不動光天子、星宿王自在天子、淨覺月天子、大威德光明天子……。",
        "translation": "There are also measureless moon-god children, which are called moon-god children: the moon-god child of the flower king's topknot, the moon-god child of the many wonderful and pure lights, the moon-god child of the mind that's comfortable in the world, the moon-god child of the visionary tree king, the moon-god child of the clear and distinct light that appears, the moon-god child of the immovable light that travels everywhere, the moon-god child of the star constellation king, the moon-god child of pure awakening, and the moon-god child of the great majestic radiance ...",
        "source": "T10n0279_001:0004b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤顯發眾生心寶。",
        "translation": "These are the heads of an incalculable number of them, all of whom diligently display the treasures that motivate the minds of sentient beings.",
        "source": "T10n0279_001:0004c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量日天子，所謂日天子：光焰眼天子、須彌光可畏敬幢天子、離垢寶莊嚴天子、勇猛不退轉天子、妙華纓光明天子、最勝幢光明天子、寶髻普光明天子、光明眼天子、持勝德天子、普光明天子……。",
        "translation": "There are also measureless sun-rulers, which are called sun-rulers: the goddess with the fiery eye of light, the goddess with the fearsome banner of Sumeru's light, the goddess with the adorned jewels free of stain, the goddess with boldness and irreversibility, the goddess with the brilliant light of the marvelous flowers, the goddess with the brightest banner, the goddess with the universal light of the jeweled topknot, the goddess with the radiant eye, the goddess with the victorious qualities, and the goddess with universal light....",
        "source": "T10n0279_001:0004c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤修習，利益眾生，增其善根。",
        "translation": "These are the heads of an incalculable number of gods who diligently cultivate them, benefit sentient beings, and increase their good roots.",
        "source": "T10n0279_001:0004c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量三十三天王，所謂：釋迦因陀羅天王、普稱滿音天王、慈目寶髻天王、寶光幢名稱天王、發生喜樂髻天王、可愛樂正念天王、須彌勝音天王、成就念天王、可愛樂淨華光天王、智日眼天王、自在光明能覺悟天王……。",
        "translation": "There are also an infinite number of Trāyastriṃśa Heavenly Kings, called the Śākyamindra Heavenly King, the Universally Acclaimed Pūrṇa Heavenly King, the Jewel-topknot Heavenly King of Compassionate Eyes, the Jewel-banner Heavenly King of Radiant Names, the Happiness-Topknot Heavenly King, the Adorably Blissful Correct Mindfulness Heavenly King, the Sumeru Superb Sound Heavenly King, the Accomplished Mindfulness Heavenly King, the Adorably Blissful Pure Flower Light Heavenly King, the Sun-Eye Heavenly King, and the Self-illuminating Awakening Heavenly King....",
        "source": "T10n0279_001:0004c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤發起一切世間廣大之業。",
        "translation": "These are the heads of an incalculable number of gods who diligently undertake the vast activities of the world.",
        "source": "T10n0279_001:0004c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量須夜摩天王，所謂：善時分天王、可愛樂光明天王、無盡慧功德幢天王、善變化端嚴天王、總持大光明天王、不思議智慧天王、輪臍天王、光焰天王、光照天王、普觀察大名稱天王……。",
        "translation": "There are also measureless god kings of the Sumeru Heaven, namely, the god king of good time division, the god king of delightful light, the god king of the endless banner of wisdom and merit, the god king of well-transformed finery, the god king of great radiance with a mastery, the god king of inconceivable wisdom, the god king of the wheel navel, the god king of brilliant light, the god king of luminous illumination, and the god king of the universal observation of great names....",
        "source": "T10n0279_001:0004c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤修習廣大善根，心常喜足。",
        "translation": "These are the heads of an incalculable number of people who diligently cultivate vast good roots and are always content in their hearts.",
        "source": "T10n0279_001:0004c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有不可思議數兜率陀天王，所謂：知足天王、喜樂海髻天王、最勝功德幢天王、寂靜光天王、可愛樂妙目天王、寶峯淨月天王、最勝勇健力天王、金剛妙光明天王、星宿莊嚴幢天王、可愛樂莊嚴天王……。",
        "translation": "There are also an unfathomable number of Tuṣita Heavenly Kings, namely, the God of Adequacy, the God of the Sea of Joyful Knots, the God of the Banner of Most Excellent Merit, the God of Quiet Light, the God of Lovely and Wonderful Eyes, the God of the Pure Moon on the Peak of Jewels, the God of Most Excellent Courageous Strength, the God of Wonderful Vajra Light, the God of the Astral Ornament, and the God of Lovely Adornment....",
        "source": "T10n0279_001:0004c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，不思議數，皆勤念持一切諸佛所有名號。",
        "translation": "These are the heads of the hierarchy who, without thinking about how many, diligently recite and uphold all the names of the buddhas.",
        "source": "T10n0279_001:0004c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量化樂天王，所謂：善變化天王、寂靜音光明天王、變化力光明天王、莊嚴主天王、念光天王、最上雲音天王、眾妙最勝光天王、妙髻光明天王、成就喜慧天王、華光髻天王、普見十方天王……。",
        "translation": "There are also the heavenly kings of unquantifiable bliss, which are called the god king of skillful transformation, the god king of silent sound and light, the god king of transforming power and light, the god king of adornment, the god king of mindfulness and light, the god king of supreme cloud sounds, the god king of many wonderful and most excellent lights, the god king of marvelous topknot lights, the god king of accomplished joy and wisdom, the god king of flowery topknots, and the god king who sees all the ten directions ... .",
        "source": "T10n0279_001:0005a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤調伏一切眾生，令得解脫。",
        "translation": "These are the heads of an incalculable number of people who diligently subdue all sentient beings and bring about their liberation.",
        "source": "T10n0279_001:0005a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無數他化自在天王，所謂：得自在天王、妙目主天王、妙冠幢天王、勇猛慧天王、妙音句天王、妙光幢天王、寂靜境界門天王、妙輪莊嚴幢天王、華蘂慧自在天王、因陀羅力妙莊嚴光明天王……。",
        "translation": "There are also countless otherwise-transformed sovereign celestial kings, namely, the king of the gods who attain sovereignty, the king of the gods with the marvelous eye, the king of the gods with the marvelous crown, the king of the gods with courageous wisdom, the king of the gods with marvelous sounds and phrases, the king of the gods with the marvelous light, the king of the gods with the serene realm gate, the king of the gods with the marvelous wheel adornment, the king of the gods with the superb wisdom, and the king of the gods with the marvelous adorned light of Indra's power....",
        "source": "T10n0279_001:0005a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆勤修習自在方便廣大法門。",
        "translation": "These are the heads of an incalculable number of them, all diligently cultivating the vast, detailed teaching of unimpeded skillful means.",
        "source": "T10n0279_001:0005a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有不可數大梵天王，所謂：尸棄天王、慧光天王、善慧光明天王、普雲音天王、觀世言音自在天王、寂靜光明眼天王、光遍十方天王、變化音天王、光明照耀眼天王、悅意海音天王……。",
        "translation": "There are also an incalculable number of great brahma heavenly kings, namely, the Śikhin Heavenly King, the Wisdom Radiance Heavenly King, the Good Wisdom Radiance Heavenly King, the Universal Cloud Sound Heavenly King, the Avalokitêśvara Sound Free-Range Heavenly King, the Tranquil Light Eye Heavenly King, the Light Pervading the Ten Directions Heavenly King, the Changing Sound Heavenly King, the Brightly Shining Eye Heavenly King, and the Joyful Sea Sound Heavenly King....",
        "source": "T10n0279_001:0005a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，不可稱數，皆具大慈，憐愍眾生，舒光普照，令其快樂。",
        "translation": "These are incalculable leaders who are endowed with great kindness, pity for sentient beings, and shine their light universally to make them happy.",
        "source": "T10n0279_001:0005a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量光音天王，所謂：可愛樂光明天王、清淨妙光天王、能自在音天王、最勝念智天王、可愛樂清淨妙音天王、善思惟音天王、普音遍照天王、甚深光音天王、無垢稱光明天王、最勝淨光天王……。",
        "translation": "There are also measureless luminous sound heavenly kings, namely, the god king of lovely light, the god king of pure and marvelous light, the god king of unobstructed sound, the god king of most excellent mindfulness, the god king of lovely, pure, and marvelous sound, the god king of well-considered sound, the god king of universal sound and pervasive illumination, the god king of deeply luminous sound, the god king of immaculate praise, and the god king of most excellent pure light ... .",
        "source": "T10n0279_001:0005a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，皆住廣大寂靜喜樂無礙法門。",
        "translation": "These are the highest of these, and their number is countless, all abiding in the vast, tranquil, joyous, and unhindered Dharma gate.",
        "source": "T10n0279_001:0005a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量遍淨天王，所謂：清淨名稱天王、最勝見天王、寂靜德天王、須彌音天王、淨念眼天王、可愛樂最勝光照天王、世間自在主天王、光焰自在天王、樂思惟法變化天王、變化幢天王、星宿音妙莊嚴天王……。",
        "translation": "There are also measureless omnipresent heavenly kings, namely, the Heavenly King of Pure Names, the Heavenly King of Most Excellent Views, the Heavenly King of Quiet Virtue, the Heavenly King of Sumeru's Voice, the Heavenly King of Pure Mindfulness, the Heavenly King of Adorable, Most Excellent Illumination, the Heavenly King of Worldly Mastery, the Heavenly King of Radiant Avalanche, the Heavenly King of Pleasantly Contemplated Dharma Changes, the Heavenly King of the Changing Banners, and the Heavenly King of the Starry Night's Sound of Sublime Adornment....",
        "source": "T10n0279_001:0005a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，悉已安住廣大法門，於諸世間勤作利益。",
        "translation": "These are the heads of an incalculable number of them, all of whom have settled down to the vast teaching and are diligently working for the benefit of the world.",
        "source": "T10n0279_001:0005b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量廣果天王，所謂：愛樂法光明幢天王、清淨莊嚴海天王、最勝慧光明天王、自在智慧幢天王、樂寂靜天王、普智眼天王、樂旋慧天王、善種慧光明天王、無垢寂靜光天王、廣大清淨光天王……。",
        "translation": "There are also measureless guardian gods who are the guardian gods of delight in the Dharma's radiance, the guardian gods of the ocean of purity and adornment, the guardian gods of the most excellent wisdom, the guardian gods of the banner of sovereign wisdom, the guardian gods of blissful tranquility, the guardian gods of the eye of universal wisdom, the guardian gods of blissful revolving wisdom, the guardian gods of the light of good seeds of wisdom, the guardian gods of the light of immaculate tranquility, and the guardian gods of the vast pure light....",
        "source": "T10n0279_001:0005b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，其數無量，莫不皆以寂靜之法而為宮殿安住其中。",
        "translation": "These are the heads of an incalculable number of them, and they all make palaces and dwell in them using the method of quiescence.",
        "source": "T10n0279_001:0005b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無數大自在天王，所謂：妙焰海天王、自在名稱光天王、清淨功德眼天王、可愛樂大慧天王、不動光自在天王、妙莊嚴眼天王、善思惟光明天王、可愛樂大智天王、普音莊嚴幢天王、極精進名稱光天王……。",
        "translation": "復有無數大自在天王，所謂：妙焰海天王、自在名稱光天王、清淨功德眼天王、可愛樂大慧天王、不動光自在天王、妙莊嚴眼天王、善思惟光明天王、可愛樂大智天王、普音莊嚴幢天王、極精進名稱光天王……。",
        "source": "T10n0279_001:0005b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等而為上首，不可稱數，皆勤觀察無相之法，所行平等。",
        "translation": "These are incalculable leaders who diligently contemplate the teaching of signlessness and equality in what they do.",
        "source": "T10n0279_001:0005b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第一",
        "translation": "Dafangguang fo huayan jing roll 1",
        "source": "T10n0279_001:0005b17_0",
        "is_bad_quality": false
    }
]