[
    {
        "source_sentence": "大方廣佛華嚴經卷第十三",
        "translation": "Dafangguangfo huayan jing, vol. 13",
        "source": "T10n0293_013:0719b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罽賓國三藏般若奉　詔譯",
        "translation": "Imperial Translation of the Tripiṭaka of the State of Kāśmīra",
        "source": "T10n0293_013:0719b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入不思議解脫境界普賢行願品",
        "translation": "Chapter on the Vows of Samantabhadra for Entering the Realm of Inconceivable Liberation",
        "source": "T10n0293_013:0719b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子一心正念，隨順思惟彼王所得幻智法門，觀察彼王如幻解脫，思惟彼王如幻法性，發如幻願，淨如幻法，悟如幻業，隨順如幻成就之法，出生如幻不思議智，清淨如幻三世性相；以如幻智，起於種種如幻變化。",
        "translation": "At the time, the boy of good fortune was single-mindedly and correctly mindful, following the method of contemplating the king's attained illusory wisdom, observing the king's illusory liberation, contemplating the king's illusory nature, generating illusory vows, purifying illusory things, realizing illusory actions, following the illusory accomplishment of things, producing illusory inconceivable wisdom, and purifying the illusory nature and characteristics of the three times with illusory wisdom; with that illusory wisdom, he was able to produce various illusory transformations.",
        "source": "T10n0293_013:0719b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是思念，漸次前行，經歷人間聚落、城邑。",
        "translation": "Thus contemplating this, they gradually move forward through human settlements and cities.",
        "source": "T10n0293_013:0719b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或至曠野巖谷、險難山川原隰，處處尋求，無有疲懈。",
        "translation": "They might go to a wild valley or a difficult mountain or river plain, and they'll search for them everywhere without tire.",
        "source": "T10n0293_013:0719b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後乃至妙光大城，於其門側問眾人言：「此名何城？",
        "translation": "He then goes to the great city of marvelous light and asks the crowd at its entrance, \"What's this city called?",
        "source": "T10n0293_013:0719b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何王統御？」",
        "translation": "What king rules?\"",
        "source": "T10n0293_013:0719b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人咸報言：「此妙光城，是大光王之所住處。」",
        "translation": "Everyone reported, \"This city of marvelous light is where the great King of Light lives.\"",
        "source": "T10n0293_013:0719b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子歡喜踊躍，志樂清淨。",
        "translation": "The boy of good fortune then rejoiced and jumped for joy, and his intentions were purified.",
        "source": "T10n0293_013:0719b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心瞻慕，作如是念：「我善知識在此城中，我今必當親得奉覲，聞諸菩薩所行之行；聞諸菩薩出要之門；聞諸菩薩所證之法；聞諸菩薩不思議功德；聞諸菩薩不思議自在；聞諸菩薩不思議平等；聞諸菩薩不思議勇猛；聞諸菩薩不思議境界；聞諸菩薩不思議法性；聞諸菩薩不思議三昧；聞諸菩薩不思議解脫遊戲；聞諸菩薩不思議廣大清淨。」",
        "translation": "With one mind, he looked up and had this thought, \"My good friend is here in the city, so now I will surely get to personally meet him and hear what the bodhisattvas do; hear the way the bodhisattvas come forth; hear the things the bodhisattvas realize; hear the merits the bodhisattvas don't contemplate; hear the autonomy the bodhisattvas don't contemplate; hear the equality the bodhisattvas don't contemplate; hear the courage the bodhisattvas don't contemplate; hear the realms the bodhisattvas don't contemplate; hear the Dharma nature the bodhisattvas don't contemplate; hear the games of liberation the bodhisattvas don't contemplate; and hear the vast purity the bodhisattvas don't contemplate.\"",
        "source": "T10n0293_013:0719b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，入妙光城，周遍觀察。",
        "translation": "After he had this thought, he entered the City of Marvelous Light and looked around it.",
        "source": "T10n0293_013:0719c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見此大城眾寶嚴飾，以金銀、瑠璃、玻瓈、赤珠、硨磲、碼碯七寶所成，七重寶塹，周匝圍遶。",
        "translation": "He saw this great city adorned with a multitude of treasures made of gold, silver, glass, bricks, red beads, coral, and agates, and surrounded by seven moats of treasure.",
        "source": "T10n0293_013:0719c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八功德水盈滿其中，底布金沙，光明照耀。",
        "translation": "It's filled with the waters of the eight excellent qualities, and its floor is covered with golden sand that shines brightly.",
        "source": "T10n0293_013:0719c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優鉢羅華、波頭摩華、拘物頭華、芬陀利華遍布其上。",
        "translation": "Uppala, padma, kovidāra, and puṇḍarī flowers are scattered all over it.",
        "source": "T10n0293_013:0719c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其水清徹，隨時溫涼。",
        "translation": "The water is clear and penetrating, and it's always warm and cool.",
        "source": "T10n0293_013:0719c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白栴檀泥，澄垽其下。",
        "translation": "White sandalwood mud coagulates beneath it.",
        "source": "T10n0293_013:0719c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其水隨泥，如栴檀色。",
        "translation": "The water follows the mud, and it's the color of sandalwood.",
        "source": "T10n0293_013:0719c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶多羅樹七重行列，枝葉繁茂蓊欝莊嚴。",
        "translation": "There are seven rows of jeweled tārā trees, whose branches and leaves are luxuriant and ornate.",
        "source": "T10n0293_013:0719c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七重金剛以為垣牆，所謂：師子光明金剛垣、無能超勝金剛垣、不可沮壞金剛垣、精進難伏金剛垣、堅固無著金剛垣、天衣網藏金剛垣、無垢妙色金剛垣。",
        "translation": "The seven layers of vajras are made into a wall, which is called the vajra wall of lion's light, the vajra wall of unsurpassed power, the vajra wall of indestructibility, the vajra wall of effort and difficulty in subduing, the vajra wall of sturdiness and nonattachment, the vajra wall of the net of heavenly clothing, and the vajra wall of the marvelous immaculate form.",
        "source": "T10n0293_013:0719c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是七重一一圍遶，悉以無數摩尼妙寶間錯莊嚴。",
        "translation": "Each of these seven rings is surrounded by countless wonderful jewels interspersed and adorned with countless maṇi.",
        "source": "T10n0293_013:0719c19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮檀金種種眾寶而為埤堄，金銀、瑠璃、赤珠、碼碯、玻瓈、海藏真珠等寶以為嚴飾。",
        "translation": "They are adorned with a variety of gold, silver, rutile, red pearl, agate, glass, and the genuine pearl of the ocean store.",
        "source": "T10n0293_013:0719c20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城縱廣一十由旬，周迴八方，面開八門，皆以七寶周遍嚴飾。",
        "translation": "The city is 10 leagues wide, circling eight sides and opening eight gates, and it's decorated with a perimeter of seven treasures.",
        "source": "T10n0293_013:0719c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝青瑠璃以為其地，眾色雜寶隨處莊嚴。",
        "translation": "Its ground is made of indigo-rutile, and it's adorned with a variety of colors and treasures.",
        "source": "T10n0293_013:0719c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種珍奇，甚可愛樂。",
        "translation": "It's filled with a variety of treasures that are truly delightful.",
        "source": "T10n0293_013:0719c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城內有十億街道，一一道邊，安布妙寶以為莊嚴。",
        "translation": "Inside the city, there are a billion streets, each lined with a border, decorated with marvelous treasures.",
        "source": "T10n0293_013:0719c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過天帝釋所遊之路，一一道間皆有無數萬億眾生於中止住。",
        "translation": "As he travels along the path of Indra, there are measureless trillions of sentient beings stopping between each road.",
        "source": "T10n0293_013:0719c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無數百千廣大宮殿，一一皆以眾寶合成。",
        "translation": "Countless hundreds of thousands of vast palaces and halls are each made of various treasures.",
        "source": "T10n0293_013:0719c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無數不思議閻浮檀金樓閣，帝青瑠璃摩尼寶網羅覆其上；無數不思議白銀樓閣，赤真珠摩尼寶網羅覆其上；無數不思議毘瑠璃樓閣，廣博妙藏摩尼寶網羅覆其上；無數不思議玻瓈樓閣，日藏摩尼王網羅覆其上；無數不思議光照世間摩尼寶樓閣，吉祥光藏摩尼王網羅覆其上；無數不思議帝青摩尼寶王樓閣，妙光摩尼王網羅覆其上；無數不思議眾生海藏摩尼寶王樓閣，焰光明藏摩尼王網羅覆其上；無數不思議金剛寶王樓閣，無能勝幢摩尼王網羅覆其上；無數不思議栴檀香王樓閣，天曼陀羅華摩訶曼陀羅華網羅覆其上；無數不思議無等香王樓閣，種種華網羅覆其上。",
        "translation": "復有無數不思議閻浮檀金樓閣，帝青瑠璃摩尼寶網羅覆其上；無數不思議白銀樓閣，赤真珠摩尼寶網羅覆其上；無數不思議毘瑠璃樓閣，廣博妙藏摩尼寶網羅覆其上；無數不思議玻瓈樓閣，日藏摩尼王網羅覆其上；無數不思議光照世間摩尼寶樓閣，吉祥光藏摩尼王網羅覆其上；無數不思議帝青摩尼寶王樓閣，妙光摩尼王網羅覆其上；無數不思議眾生海藏摩尼寶王樓閣，焰光明藏摩尼王網羅覆其上；無數不思議金剛寶王樓閣，無能勝幢摩尼王網羅覆其上；無數不思議栴檀香王樓閣，天曼陀羅華摩訶曼陀羅華網羅覆其上；無數不思議無等香王樓閣，種種華網羅覆其上。",
        "source": "T10n0293_013:0719c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如是等無數不思議種種莊嚴妙寶樓閣，種種寶網羅覆其上。",
        "translation": "There are countless such inconceivable mansions of various ornamented marvelous treasures, which are covered with a variety of jeweled nets.",
        "source": "T10n0293_013:0720a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一樓閣，眾寶欄楯周匝圍遶；寶多羅樹，次第行列，皆以寶繩而為界道。",
        "translation": "Each tower is surrounded by a perimeter of jeweled railings, and the rows of jeweled tārā trees are arranged in order, each bounded by a rope of treasure.",
        "source": "T10n0293_013:0720a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一寶繩，懸以金鈴；一一金鈴，眾寶鬘絡，如孔雀尾，異色端嚴，風動成音，聞之可意。",
        "translation": "Each precious cord is suspended from a golden bell, and each golden bell is covered with a multitude of jeweled garlands like a peacock's tail, decorated with different colors, and the wind makes sounds that are audible and pleasing to the ear.",
        "source": "T10n0293_013:0720a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城復有阿僧祇摩尼寶網、阿僧祇寶鈴網、阿僧祇天香網、阿僧祇天華網，阿僧祇寶形像網。",
        "translation": "The city also has a net of incalculable maṇi treasures, a net of incalculable precious bells, a net of incalculable heavenly fragrances, a net of incalculable heavenly flowers, and a net of incalculable precious images.",
        "source": "T10n0293_013:0720a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城復有阿僧祇金剛帳、阿僧祇寶衣帳、阿僧祇寶蓋帳、阿僧祇寶幡帳、阿僧祇寶山帳、阿僧祇寶華鬘帳、阿僧祇寶樓閣帳之所彌覆，處處羅列寶蓋幢幡。",
        "translation": "The city is also covered by the Asaṅghian vajra canopy, the Asaṅghian treasured robe canopy, the Asaṅghian treasured canopy, the Asaṅghian treasured banner canopy, the Asaṅghian treasured mountain canopy, the Asaṅghian treasured flower garland canopy, and the Asaṅghian treasured tower canopy, and there are crowds of jeweled canopies and banners everywhere.",
        "source": "T10n0293_013:0720a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中寶池，德水盈滿；底布金沙，光映內外；天諸妙華，敷榮其上；天諸寶鳥，浮戲其中，出和雅音，悅可人意；池岸階砌，七寶莊嚴，帝釋寶池，無以為比。",
        "translation": "The city's jeweled pond is filled with the water of virtue, its bottom is covered with golden sand, and its light reflects both inside and out; it's decorated with the marvelous flowers of the gods, and the precious birds of the gods float in it, producing harmonious sounds that please people's desires; its shore is lined with steps and adorned with seven treasures, and there's nothing like the jeweled pond of Indra.",
        "source": "T10n0293_013:0720a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當此城中有一樓閣，名妙法藏，阿僧祇種種色寶以為莊嚴，光明照耀，最勝無比，眾生樂見，心無厭足，彼大光王，常處其中。",
        "translation": "In this city there's a tower called the treasury of the fine dharma, adorned by incalculably colored treasures that shine with unsurpassed brilliance, which sentient beings delight in seeing and are unsatisfied with, and in which that great king of light always abides.",
        "source": "T10n0293_013:0720a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子於彼大城妙寶樓閣、寶池、寶塹、寶樹、寶牆、寶蓋、寶幢、寶鈴、寶網如是一切珍寶妙物，受用資具，乃至男女六塵境界皆無愛著；唯於正法園苑之中，深心渴慕，但正思惟究竟之法，一心願樂見善知識。",
        "translation": "At the time, the boy of good fortune had no attachment whatsoever to the great city's wonderful jeweled mansions, jeweled pools, jeweled moats, jeweled trees, jeweled walls, jeweled canopies, jeweled banners, jeweled bells, jeweled nets, or any of the other precious and wonderful things that he owned and used, or even to the six objective realms of men and women.",
        "source": "T10n0293_013:0720b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸漸前行，普遍觀察，見大光王去於所住樓閣不遠四衢道中，坐如意摩尼寶蓮華藏廣大莊嚴師子寶座。",
        "translation": "As he gradually moved forward, he looked around and saw the great luminous king sitting on the vast, ornate lion's jeweled throne of the wish-granting lotus treasury not far from the tower where he was staying and in the middle of the four roads.",
        "source": "T10n0293_013:0720b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "紺瑠璃寶以為其足；金繒為帳；眾寶為網；閻浮金繩交絡嚴飾上妙天衣，以為茵蓐，四布敷設阿僧祇妙寶形像，隨處莊嚴。",
        "translation": "Its legs were made of violet-glazed jewels, its feet were made of gold silken fabric, its net was made of various jewels, and its gold cords were intertwined and adorned with the finest celestial robes, which served as mats, and its four spreads were decorated with images of incalculable marvelous treasures that adorned him in various places.",
        "source": "T10n0293_013:0720b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王具有三十二種大人之相，八十隨好而以嚴身。",
        "translation": "The king has thirty-two major characteristics of a great personage and eighty minor features that adorn his body.",
        "source": "T10n0293_013:0720b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如真金山，光色熾盛；如淨空日，威光赫奕；如盛滿月，見者清涼，心無厭足；如梵天王，處於梵眾，威德殊勝；亦如大海，聚功德寶，無量無邊；亦如大雲，遍法性空，法雷震吼；如淨空界，顯現種種法門星象；如雪山王，相好樹林以為嚴飾；如須彌山，四色普現眾生心海；如寶洲渚，種種智寶充滿其中。",
        "translation": "He's like a true gold mountain whose radiance is blazing, like a clear sky sun whose majestic splendor is brilliant, like a full moon whose coolness is refreshing to the viewer and whose mind is unsatisfied, like the Brahma heaven king whose presence in the Brahma community is marked by outstanding authority, like the ocean whose treasures of merit are measureless and limitless, like a great cloud that pervades the emptiness of the nature of things and roars with the thunder of the Dharma, like the pure sky realm that displays various astrological images of the Dharma teaching, like the snow mountain king whose grove of beautiful trees adorns him, like Mount Sumeru whose four colors universally reveal the sea of sentient beings' minds, and like a jeweled island whose various wisdom treasures fill it.",
        "source": "T10n0293_013:0720b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於王座前復有無量金銀、瑠璃、真珠、摩尼、珊瑚、琥珀、珂貝、璧玉諸珍寶聚，種種寶衣、華鬘、瓔珞及諸飲食皆悉充滿。",
        "translation": "In front of the king's throne there's another innumerable cluster of gold, silver, beryl, genuine pearls, maṇi, coral, amber, precious metals, and jade, and it's filled with all kinds of precious clothing, flowers, jewelry, and food and drink.",
        "source": "T10n0293_013:0720b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復見無數百千萬億駟馬寶車，百千萬億天諸妓樂，百千萬億天諸妙香，百千萬億病緣湯藥，無數乳牛蹄角金色，無數千億端正女人。",
        "translation": "There's also a vision of countless hundreds of thousands of millions of precious chariots, hundreds of thousands of millions of heavenly musicians, hundreds of thousands of millions of heavenly perfumes, hundreds of thousands of millions of medicines for illnesses, countless milk cows with golden hooves and horns, and countless hundreds of millions of perfectly proportioned women.",
        "source": "T10n0293_013:0720b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上妙栴檀以塗其體，天衣瓔珞種種莊嚴，六十四能靡不該練，儀範禮則，悉皆善知。",
        "translation": "Their bodies are coated with the finest sandalwood, their heavenly robes and jewelry are adorned in various ways, their sixty-four abilities are all well-practiced, and their manners and etiquette are all well understood.",
        "source": "T10n0293_013:0720b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨眾生心，而以給施；城邑、聚落四衢道側，相次陳列，福舍義堂，滿二十億。",
        "translation": "They bestow gifts according to the desires of sentient beings, lining up cities and villages in order along the four roads, and filling two billion mansions with houses of merit and halls of meaning.",
        "source": "T10n0293_013:0720b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安置一切珍寶妙物及諸飲食，充滿其中。",
        "translation": "They are filled with all the treasures, wonderful things, and food and drink.",
        "source": "T10n0293_013:0720c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一道傍有二十億諸大菩薩，以此諸物惠施眾生，令無所乏。",
        "translation": "On the side of one road, there are two billion great bodhisattvas who give these things to sentient beings, so that there's nothing to lack.",
        "source": "T10n0293_013:0720c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲攝受諸眾生故，為欲發起一切眾生愛敬心故，為欲發起一切眾生歡喜心故，為欲發起一切眾生踊躍心故，為欲清淨一切眾生正信心故，為令眾生心清涼故，為令眾生除愛熱故，為令眾生息煩惱故，為令眾生解真實故，為令眾生入種智故，為令眾生捨怨敵故，為令眾生離諸惡故，為令眾生拔邪見故，為令眾生淨諸業故。",
        "translation": "That's because they want to bring in sentient beings, because they want to arouse the desire and respect of all sentient beings, because they want to arouse the joyous hearts of all sentient beings, because they want to arouse the enthusiastic hearts of all sentient beings, because they want to purify the right faith of all sentient beings, because they want to make sentient beings' minds cool, because they want to remove craving, because they want to calm their afflictions, because they want to make sentient beings understand the truth, because they want to bring sentient beings into the knowledge of seeds, because they want to abandon enemies, because they want to free sentient beings from evil, because they want to uproot wrong views, and because they want to purify their karma.",
        "source": "T10n0293_013:0720c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子五體投地，頂禮王足，遶無數匝，合掌而立，白言：「聖者！",
        "translation": "The boy of good fortune then threw himself to the ground with five bodies, bowed his head at the king's feet, circled him measureless times, put his palms together, and stood up, saying, \"Sage!",
        "source": "T10n0293_013:0720c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行、修菩薩道；我聞聖者善能誘誨，願為我說。」",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices and cultivates the bodhisattva path; I've heard that the noble one is well able to guide you, so please explain it for me.\"",
        "source": "T10n0293_013:0720c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王告言：「善男子！",
        "translation": "The king then told him, \"Good man!",
        "source": "T10n0293_013:0720c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得淨修菩薩大慈幢行解脫門，清淨滿足。",
        "translation": "I've purified and cultivated the bodhisattva's approach of liberation through the practice of the great banner of compassion, and I've fulfilled it purely.",
        "source": "T10n0293_013:0720c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0720c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於無量百千萬億乃至不可說不可說佛所，親近聽聞，問難此法，隨順思惟，審諦觀察，清淨悟入，修習莊嚴。",
        "translation": "I've been in the company of measureless hundreds of thousands of millions of unspeakable and ineffable buddhas, listening intimately, inquiring about this teaching, reflecting on it accordingly, examining it carefully, realizing it purely, and cultivating its adornment.",
        "source": "T10n0293_013:0720c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0720c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以此法為王，以此法教勅，以此法攝受，以此法隨逐世間，以此法興行政化，以此法調伏眾生，以此法引導眾生，以此法憐愍眾生，以此法安慰眾生，以此法運載眾生，以此法令眾生趣入，以此法令眾生修行，以此法與眾生方便，以此法令眾生思惟諸法究竟實性，以此法令眾生安住大慈；以慈為主，具足慈力。",
        "translation": "\"With this teaching as king, this teaching as command, this teaching as collection, this teaching as following the world, this teaching as creating administration, this teaching as disciplining sentient beings, this teaching as guiding sentient beings, this teaching as pitying sentient beings, this teaching as comforting sentient beings, this teaching as carrying sentient beings, this teaching as causing sentient beings to enter, this teaching as causing sentient beings to cultivate, this teaching as being skillful with sentient beings, this teaching as causing sentient beings to contemplate the ultimate true nature of things, and this teaching as causing sentient beings to abide in great kindness, with kindness as their lord and with the power of kindness.",
        "source": "T10n0293_013:0720c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是令住利益心、安樂心、哀愍心、攝受心、守護眾生心、常不捨離心、拔眾生苦無休息心、代諸眾生恒受苦心、令諸眾生住安樂心。",
        "translation": "Thus, it causes them to abide in mind of benefit, mind of well-being, mind of compassion, mind of taking in sentient beings, mind of guarding sentient beings, mind of never abandoning, mind of removing the suffering of sentient beings without rest, mind of constantly suffering on behalf of sentient beings, and mind of causing sentient beings to abide in well-being.",
        "source": "T10n0293_013:0720c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令眾生捨離一切障蓋、纏縛，得自在故；為令眾生究竟安樂，於諸眾生得自在故；為令眾生永斷如草蔓莚，滋長生死心故；為令眾生永斷如河相續，流注結使心故；為令眾生永斷煩惱習氣心故；為令眾生住於法性寂靜心故；為令眾生永息一切不善法故；為令眾生截生死流，入法流故；為令眾生入深法界，心無退轉；以智慧火，燒煩惱薪，永斷一切五道生處，具菩薩行，向一切智，心海清淨，無諸濁亂，信力堅固，諸天、魔、梵、沙門、婆羅門、人與非人所不能動。",
        "translation": "為令眾生捨離一切障蓋、纏縛，得自在故；為令眾生究竟安樂，於諸眾生得自在故；為令眾生永斷如草蔓莚，滋長生死心故；為令眾生永斷如河相續，流注結使心故；為令眾生永斷煩惱習氣心故；為令眾生住於法性寂靜心故；為令眾生永息一切不善法故；為令眾生截生死流，入法流故；為令眾生入深法界，心無退轉；以智慧火，燒煩惱薪，永斷一切五道生處，具菩薩行，向一切智，心海清淨，無諸濁亂，信力堅固，諸天、魔、梵、沙門、婆羅門、人與非人所不能動。",
        "source": "T10n0293_013:0721a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_013:0721a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我住如是大慈幢行解脫門故，能以正法教化世間。",
        "translation": "Because I abide in this great banner of compassion and practice the gate of liberation, I'm able to teach the world the right Dharma.",
        "source": "T10n0293_013:0721a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我國土中一切眾生，皆於我所無有恐怖。",
        "translation": "All the sentient beings in my land have no fear in my place.",
        "source": "T10n0293_013:0721a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有一切貧乏眾生，裸露飢羸來至我所。",
        "translation": "\"If there are all poor sentient beings who come to me naked and hungry.",
        "source": "T10n0293_013:0721a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或求衣服，或求飲食，乃至求索一切所須受用之物，我開庫藏示令知見，而告之言：『汝等昔來為此財寶造十不善種種惡業，由是業故貧窮、裸露、衣食不充。",
        "translation": "They may ask for clothing, food and drink, or even for whatever they need to enjoy, and I open the treasury and show it to them, telling them, 'In the past, you created ten unskillful kinds of bad karma for this wealth and treasure, and as a result of that karma you were poor, naked, and without enough food or clothing.",
        "source": "T10n0293_013:0721a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者悉施，汝等恣意取之。",
        "translation": "Now, I'll give it all away, and you can take it as you like.",
        "source": "T10n0293_013:0721a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既自充足，隨力修行，莫造諸惡，莫害眾生，莫起諸見，莫生執著。",
        "translation": "Now that you have enough, cultivate it according to your strength; don't do evil, don't harm sentient beings, don't give rise to views, and don't become attached to them.",
        "source": "T10n0293_013:0721a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等貧乏，若有所須，當來我所及四衢道二十億處義堂福舍，一切財寶種種具足。",
        "translation": "If you're poor and need anything, you'll find all kinds of possessions and treasures in my place and in the two billion places in the four roads and two billion places in the hall of merit in the future.",
        "source": "T10n0293_013:0721a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝隨意取，勿生疑難。』",
        "translation": "Take them as you like, and don't have any doubts about them.'",
        "source": "T10n0293_013:0721a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_013:0721a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此妙光城所住眾生，皆是菩薩發大乘意，行大乘行。",
        "translation": "The sentient beings living in this marvelous city of light are all bodhisattvas who have aroused the great vehicle intention and are practicing the great vehicle's practices.",
        "source": "T10n0293_013:0721a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸眾生起大悲心，普遍清淨，隨心所欲，所見不同。",
        "translation": "They give rise to the mind of great compassion for all sentient beings, are universally pure, and see things differently according to their minds.",
        "source": "T10n0293_013:0721a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或見此城其量狹小，或見此城其量廣大，或見此城土沙為地，或見瑠璃眾摩尼寶以為其地，或見垣牆聚土成立，或無能勝金剛所成，或見其地高下不平，或見其地平坦如掌，或見屋宅土木所成，或見殿堂眾寶嚴飾，及諸樓閣、階墀、窓闥、軒檻、戶牖，如是一切無非妙寶。",
        "translation": "Sometimes they see a city that's small in size, or they see a city that's large in size, or they see a city whose ground is made of sand, or they see a city whose ground is made of lapis lazuli and many maṇi treasures, or they see a wall made of clumps of earth, or they see a ground made of unsurpassed adamant, or they see a ground that's uneven in height, or they see a ground that's as flat as the palm of their hand, or they see a house made of earth and wood, or they see a hall adorned with many treasures, or they see a tower, a staircase, a window, a frontier, a door, or a window, all of which are nothing but marvelous treasures.",
        "source": "T10n0293_013:0721a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_013:0721b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生其心清淨，曾種善根，供養諸佛，發心趣向一切智道，以一切智為歸依處，及我昔時修菩薩行，以四攝事，曾所攝受，則見此城，具足眾寶，清淨莊嚴，餘皆見穢。",
        "translation": "If there are sentient beings whose minds are pure, who have planted good roots, made offerings to the buddhas, are motivated to pursue the path of omniscience, take omniscience as their refuge, and I cultivated the bodhisattva practice in the past and used the four practices to gather in, then they'll see this city, replete with many treasures and pure and adorned, and the rest will see it defiled.",
        "source": "T10n0293_013:0721b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0293_013:0721b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此國土中一切眾生，五濁世時，隨本業習，樂造諸惡，我起憐愍，攝受彼心，而欲救護。",
        "translation": "\"Regarding all the sentient beings in this land who, during the five turbid times, habituated karma and enjoyed doing evil, I felt compassion for them, collected their minds, and wanted to rescue them.",
        "source": "T10n0293_013:0721b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入於菩薩大慈為首，隨順世間大三昧門。",
        "translation": "I enter the great samādhi gate of the bodhisattvas, where great kindness is the foremost thing, and I accord with the world.",
        "source": "T10n0293_013:0721b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當入此三昧門時，彼諸眾生所有怖畏心、惱害心、怨敵心、諍論心，如是諸心，悉自銷滅。",
        "translation": "When I enter this samādhi gate, all the fearful, harmful, hostile, and argumentative thoughts of those sentient beings and such thoughts will all cease on their own.",
        "source": "T10n0293_013:0721b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T10n0293_013:0721b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入於菩薩大慈為首，順世三昧本性功能，法如是故。",
        "translation": "Entering the bodhisattva's great compassion as the leader and conforming to the original nature and function of worldly samādhi, the teaching is thus.",
        "source": "T10n0293_013:0721b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且待須臾，自當得見。」",
        "translation": "Just wait a moment, and you'll see it for yourself.\"",
        "source": "T10n0293_013:0721b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，大光王即入此定，其城內外六種震動，寶地、寶牆、寶堂、寶殿、臺觀、樓閣、階砌、戶牖，如是一切，互相衝擊，悉向於王，咸作曲躬敬禮之像，咸出妙音稱讚王德。",
        "translation": "When King Mahāprabhāsa entered this concentration, six internal and external vibrations in the city caused the jeweled ground, the jeweled walls, the jeweled halls, the jeweled palaces, the terraces, the mansions, the staircases, and the windows and doors, all of which impacted one another, to bow in respect to the king's image and emit marvelous sounds praising his virtue.",
        "source": "T10n0293_013:0721b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城內外所有人民靡不同時歡喜踊躍，俱來王所，投地頂禮。",
        "translation": "All the people inside and outside the city rejoiced and rushed to the king's residence, throwing themselves to the ground and bowing their heads in homage.",
        "source": "T10n0293_013:0721b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近王所住鳥獸之屬，互相瞻視，起慈悲心，咸向王前恭敬禮拜。",
        "translation": "The birds and animals that live near the king's residence look at each other, feel compassion, and venerate the king.",
        "source": "T10n0293_013:0721b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切山原及諸草樹，莫不迴轉，咸向於王如禮敬像。",
        "translation": "All the hills and fields and the grasses and trees that grow there all turn around and venerate the king's image as if it were a salutation.",
        "source": "T10n0293_013:0721b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陂池、泉井及以河海，悉皆騰溢，流注王前；十千龍王起大香雲，震雷激電，灑細香雨。",
        "translation": "Ponds, springs, wells, and rivers and seas all overflow and flow before the king, and 10,000 dragon kings raise huge clouds of incense, shake thunder and lightning, and shower down fine incense.",
        "source": "T10n0293_013:0721b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千六欲天王，所謂：四大天王、忉利天王、夜摩天王、兜率陀天王、妙變化天王、他化自在天王，如是等王而為上首，於虛空中作眾妓樂。",
        "translation": "There are also 10,000 god kings of the six desires, called the four great heavenly kings, the king of the Thirty-three gods, the king of the Yama gods, the king of the Tuṣita gods, the king of the marvelously transforming gods, and the king of the paranirmita-vaśavartin gods, who head these kings and create a multitude of musicians in the sky.",
        "source": "T10n0293_013:0721b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿僧祇天女歌詠讚歎；阿僧祇天寶華雲、阿僧祇天寶香雲、阿僧祇天寶鬘雲、阿僧祇天末香雲、阿僧祇天寶衣雲、阿僧祇天寶蓋雲、阿僧祇天寶幢雲、阿僧祇天寶幡雲，遍虛空中而為嚴飾，供養於王。",
        "translation": "The Asaṅga Heavenly Maidens sing and praise them, and clouds of Asaṅga Heavenly Jeweled Flowers, Asaṅga Heavenly Jeweled Incense, Asaṅga Heavenly Jeweled Garlands, Asaṅga Heavenly Jeweled Scents, Asaṅga Heavenly Jeweled Garments, Asaṅga Heavenly Jeweled Canopies, Asaṅga Heavenly Jeweled Banners, and Asaṅga Heavenly Jeweled Banners fill the sky and adorn themselves in support of the king.",
        "source": "T10n0293_013:0721c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有[醫-酉+言]羅鉢那大象王，以自在力，於虛空中布阿僧祇大寶蓮華；垂阿僧祇天寶瓔珞、阿僧祇寶繒帶、阿僧祇寶嚴具、阿僧祇寶衣服、阿僧祇寶鬘、阿僧祇寶華、阿僧祇寶香、阿僧祇燒香、阿僧祇塗香，種種奇妙以為嚴飾。",
        "translation": "Furthermore, there was [M.H. - U.S.] Rāhaparna, the great elephant king, who with his sovereign power spread out in the sky an incalculably large lotus flower, draped it with an incalculably jeweled necklace, an incalculably jeweled silken sash, an incalculably jeweled ornament, an incalculably jeweled robe, an incalculably jeweled garland, an incalculably jeweled flower, an incalculably jeweled scent, an incalculably burned scent, and an incalculably smeared scent, all of which were decorated in a marvelous way.",
        "source": "T10n0293_013:0721c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿僧祇天女出美妙音，歌詠讚歎。",
        "translation": "The Asaṅga-ṛddhi goddesses produce beautiful sounds, singing and praising them.",
        "source": "T10n0293_013:0721c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提內復有阿僧祇百千萬億諸羅剎王、諸夜叉王、鳩槃茶王、毘舍闍王、諸鬼王等，或居陸地、或處虛空、或住山間、或居大海；如是一切飲血、噉肉，殘害眾生，皆起慈心，願行利益，明識後世，不造諸惡，恭敬合掌，頂禮於王；恐怖不生，身心寂靜，皆得無量廣大安樂。",
        "translation": "Within Jambudvīpa, there are incalculably hundreds of thousands of millions of Rāṣṭrapāla kings, yakṣa kings, kumbhāṇḍa kings, piśāca kings, and demon kings, whether they live on land, in the sky, on mountains, or in the ocean, who drink blood, devour flesh, and inflict harm on sentient beings, become compassionate, wish to do good, clearly realize the afterlife, refrain from doing evil, respectfully bow with their palms together, and venerate the king; fears don't arise, and their bodies and minds are calm, and they all attain measureless and vast well-being.",
        "source": "T10n0293_013:0721c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如閻浮提餘三天下，乃至三千大千世界并及十方百千萬億那由他世界，其中所有毒惡眾生，悉亦如是。",
        "translation": "Thus are all the poisonous and unwholesome sentient beings in the other three worlds of Jambudvīpa, the 3,000 great one-thousand worlds, and the hundreds of thousands of millions of nayutas in ten directions.",
        "source": "T10n0293_013:0721c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆以菩薩大慈為首，隨順世間三昧法門，力如是故。",
        "translation": "All of these things are headed by the bodhisattva's great compassion, which follows the worldly approach of samādhi, and their power is thus.",
        "source": "T10n0293_013:0721c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，大光王從三昧起，告善財言：「善男子！",
        "translation": "When the great king of light rose from his samādhi, he told Shanzai, \"Good sons!",
        "source": "T10n0293_013:0721c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯得此菩薩大慈幢行順世三昧解脫門，如諸菩薩摩訶薩為高蓋，慈心普蔭諸眾生故；為圓滿，平等救護無分別故；為修行，下、中、上行悉等行故；為大地，能以慈心任持一切諸眾生故；為盛滿月，福德光明於諸世間平等現故；為淨日輪，以智光明照了一切所知境故；為世明燈，能破眾生諸黑闇故；為水清珠，能清眾生諂誑濁故；為如意寶，能滿眾生心所願故；為猛疾風，任持眾生及三昧宮殿一切智智大法城故；而我云何能知其行、能說其德、能稱量彼福德大山、能瞻仰彼功德眾星、能觀察彼大願風輪、能校量彼法平等力、能發起彼大修行心、能顯示彼大莊嚴海、能闡明彼普賢行門、能深入彼諸三昧窟、能讚歎彼大慈悲雲、能降注彼甘露法雨？",
        "translation": "I have attained only this bodhisattva's practice of the great banner of kindness and the liberation gate of following worldly samādhi, just as the bodhisattvas, mahāsattvas, are tall canopies that overshadow sentient beings with kindness; perfections that provide equal aid without discrimination; cultivations that are equal in their inferior, middling, and superior practices; great lands that can support all sentient beings with kindness; full moons that produce the light of merit equally in all worlds; pure suns that illuminate all knowables with the light of wisdom; worldly bright lamps that pierce the darkness of sentient beings; clear water pearls that purify the flattery and turbidity of sentient beings; wish-granting jewels that fulfill the wishes of sentient beings' hearts; and powerful winds that support sentient beings and the great dharma-city of wisdom in all samādhis and palaces.",
        "source": "T10n0293_013:0721c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0722a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方，有一王都名曰安住；有優婆夷名曰不動；汝詣彼問菩薩云何學菩薩行、修菩薩道。」",
        "translation": "South of here, there's a king whose capital is named Anjou, and there's an Upāsikā named Unmoved; go there and ask the bodhisattva how he trains in the bodhisattva practices and cultivates the bodhisattva path.\"",
        "source": "T10n0293_013:0722a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮王足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "The Boy of Good Fortune then bowed his head at the king's feet, circled him measureless times, paid homage to him, and withdrew.",
        "source": "T10n0293_013:0722a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子出妙光城，行於道路，正念思惟大光王教，憶念菩薩大慈幢行，思惟菩薩順世三昧，普見彼不思議菩薩清淨身，普念彼不思議妙寶師子座，增長彼不思議大願福德自在力，堅固彼不思議成熟眾生智，觀察彼不思議、不共受用大威德，憶念彼不思議神通差別相，思惟彼不思議清淨大眾會，分別彼不思議菩薩所作業；憶念明了，隨順信解，生歡喜心、生澄淨心、生猛利心、生欣悅心、生慶幸心、生踊躍心、生不亂心、生明照心、生堅固心、生廣博心、生無盡心。",
        "translation": "爾時，善財童子出妙光城，行於道路，正念思惟大光王教，憶念菩薩大慈幢行，思惟菩薩順世三昧，普見彼不思議菩薩清淨身，普念彼不思議妙寶師子座，增長彼不思議大願福德自在力，堅固彼不思議成熟眾生智，觀察彼不思議、不共受用大威德，憶念彼不思議神通差別相，思惟彼不思議清淨大眾會，分別彼不思議菩薩所作業；憶念明了，隨順信解，生歡喜心、生澄淨心、生猛利心、生欣悅心、生慶幸心、生踊躍心、生不亂心、生明照心、生堅固心、生廣博心、生無盡心。",
        "source": "T10n0293_013:0722a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是思惟，悲泣流淚。",
        "translation": "Thus thinking, they weep with pity.",
        "source": "T10n0293_013:0722a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念善知識，實為希有，難見、難聞。",
        "translation": "He thinks, \"Good teachers are rare indeed; they're hard to see and hard to hear.",
        "source": "T10n0293_013:0722a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者，是我寶山，出生一切諸功德寶；能遍清淨諸菩薩行，圓滿菩薩一切淨念，清淨菩薩陀羅尼輪，顯發菩薩三昧光明，修治菩薩見佛境界，普雨一切諸佛法雨，顯現如來不思議智，顯示一切菩薩願門，生長一切菩薩根芽。",
        "translation": "Good teacher, this is my precious mountain that produces all the treasures of merit, pervades and purifies all bodhisattva practices, fulfills all pure bodhisattva intentions, purifies the bodhisattva dhāraṇī wheel, reveals and illuminates bodhisattva samādhi, cultivates the bodhisattva's vision of the Buddha's state, rains down the Dharma rain of all buddhas, reveals the Tathāgata's inconceivable wisdom, shows all bodhisattva vows, and grows all bodhisattva root sprouts.",
        "source": "T10n0293_013:0722a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「善知識者，能救護我，令我不墮一切惡趣；善知識者，能引導我，令我得入平等佛慧；善知識者，能顯照我，令我了知諸夷險道；善知識者，能開示我，令我解了大乘奧義；善知識者，能勸發我，令我速入普賢諸行；善知識者，能曉悟我，令我速到一切智城；善知識者，能誨諭我，令我趣入法界大海；善知識者，能勸誘我，令我普見三世法海；善知識者，能教授我，令我得與眾聖集會；善知識者能增長我，令我出生一切白法。",
        "translation": "Again, he thinks, \"A good teacher can rescue me so that I won't fall into all bad destinies; a good teacher can guide me so that I'll enter the equal Buddha's wisdom; a good teacher can illuminate me so that I'll know the difficult and dangerous paths; a good teacher can instruct me so that I'll understand the mysteries of the great vehicle; a good teacher can encourage me so that I'll quickly enter the practices of the universally virtuous; a good teacher can enlighten me so that I'll quickly reach the city of omniscience; a good teacher can instruct me so that I'll enter the ocean of the Dharma realm; a good teacher can encourage me so that I'll see the ocean of the three worlds; a good teacher can teach me so that I'll assemble with the sages; and a good teacher can grow me so that I'll produce all white dharmas.",
        "source": "T10n0293_013:0722b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念善知識能以如是利益眾生。」",
        "translation": "Remembering that a good teacher can benefit sentient beings in this way,\"",
        "source": "T10n0293_013:0722b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財童子如是思惟，涕淚盈目，彼常守護覺悟菩薩，猶影隨形。",
        "translation": "As he thought this, the boy of good fortune filled his eyes with tears, and he always guarded the awakened bodhisattva like his shadow following his form.",
        "source": "T10n0293_013:0722b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來使天於虛空中而告之言：「善男子！",
        "translation": "The Tathāgata sent a celestial up in the sky who told him, \"Good sons!",
        "source": "T10n0293_013:0722b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有隨順善知識教，諸佛世尊悉皆歡喜；其有隨順善知識語，則得近於一切智地；其有能於善知識行，心無疑惑，則常值遇一切善友；其有發心，願常不離善知識者，則得具足一切甚深最勝義利。",
        "translation": "If someone follows the teaching of a good teacher, the buddhas and world-honored ones all rejoice; if they follow the words of a good teacher, they'll attain nearness to the ground of omniscience; if they can practice with a good teacher and have no doubts in their mind, they'll always meet all good friends; and if they have the intention to never part from a good teacher, they'll attain the full possession of all the profound and most excellent benefits.",
        "source": "T10n0293_013:0722b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0722b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可往詣安住王都，即當得見不動優婆夷大善知識，從彼請問諸菩薩行。」",
        "translation": "You may go to the city of the king of Anjou, where you will meet the great good friend Upāsikā and ask about the bodhisattva practices from there.\"",
        "source": "T10n0293_013:0722b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子從彼三昧智光明起，漸次遊行，至安住城，周遍求問不動優婆夷，今在何所？",
        "translation": "At that point, the boy of good fortune got up from that samādhi of wisdom and light, gradually marched over to the city of Anjou, and asked around about the Upaśālī who was Akṣobhya, \"Where is he now?",
        "source": "T10n0293_013:0722b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遇彼人眾咸示之言：「善男子！",
        "translation": "When they met them, they were all told, \"Good man!",
        "source": "T10n0293_013:0722b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不動優婆夷身是童女，侍覲父母，在自宅中，與其親屬及無量人，周匝圍遶，演說妙法。」",
        "translation": "The Akṣobhya Upāsikā was a young woman who visited her parents, stayed in their house with their relatives and countless others, and went around to explain the wonderful Dharma.\"",
        "source": "T10n0293_013:0722b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財聞已，其心歡喜，生寂靜心，生愛敬心，如見父母。",
        "translation": "After Shanzai heard this, his heart rejoiced, he became serene, became loving and respectful, and looked at his parents as if they were his parents.",
        "source": "T10n0293_013:0722b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念我於今所願圓滿。",
        "translation": "He thought, 'Now, I've fulfilled my vows.'",
        "source": "T10n0293_013:0722b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即詣不動優婆夷所，到彼宅門，住立觀察。",
        "translation": "He then went to Upāsikā Acalā, went to the entrance of his house, and stood there to examine it.",
        "source": "T10n0293_013:0722b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入其宅內，見彼堂宇，微妙清淨，眾寶莊嚴。",
        "translation": "Going inside his house, he sees a hall that's exquisitely clean and adorned with many treasures.",
        "source": "T10n0293_013:0722b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金色光明，普皆照耀。",
        "translation": "Golden-hued light shone everywhere.",
        "source": "T10n0293_013:0722c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是光明，觸善財身，善財即時獲得五百妙三昧門。",
        "translation": "When that light touched Shanzai's body, Shanzai immediately attained the five hundred subtle samādhi gates.",
        "source": "T10n0293_013:0722c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：入一切安樂自在幢三昧門；了一切寂靜相三昧門；遠離一切世間三昧門；普眼捨得三昧門；如來藏三昧門；得如是等五百三昧門。",
        "translation": "They are: the samādhi gate of entering the banner of sovereign power of all comfort; the samādhi gate of comprehending the characteristics of all quiescence; the samādhi gate of seclusion from all the world; the samādhi gate of the universal eye's equanimity; the samādhi gate of the tathāgatagarbha; and the attainment of these five hundred samādhi gates.",
        "source": "T10n0293_013:0722c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以得如是三昧門故，身心柔軟，如七日胎，微妙輕安，世無過者。",
        "translation": "Because they attain such a samādhi gate, their body and mind are as supple and flexible as a seven-day womb, and there's nothing more subtle and peaceful than that in the world.",
        "source": "T10n0293_013:0722c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又聞妙香，非諸天、龍、乾闥婆等人與非人之所能有。",
        "translation": "He also hears a wonderful fragrance that's beyond the reach of gods, dragons, gods and humans, or non-humans.",
        "source": "T10n0293_013:0722c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即前往詣，恭敬合掌，一心觀察。",
        "translation": "He went over to them, folded his palms in respect, and focused his mind on observing them.",
        "source": "T10n0293_013:0722c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見其形色，端正殊妙，十方世界一切女人無能與比，況復過者。",
        "translation": "He saw that his form was correct and marvelous, and there was no woman in the world in the ten directions who could compare with him, let alone exceed him.",
        "source": "T10n0293_013:0722c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯除如來及以一切灌頂菩薩。",
        "translation": "Only the Tathāgata and all the consecrated bodhisattvas are excepted.",
        "source": "T10n0293_013:0722c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其身殊勝，口出妙香。",
        "translation": "Their bodies are outstanding, and their mouths emit a wonderful fragrance.",
        "source": "T10n0293_013:0722c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宮殿莊嚴，受用資具、眷屬圍遶，威光熾盛，清淨無染，悉無與等，況其過者？",
        "translation": "Their palace is adorned, surrounded by the requisites for their use and their retinues, and their radiance is blazing, and they are pure and undefiled, so there's nothing like them, so why would there be anything beyond that?",
        "source": "T10n0293_013:0722c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方世界一切眾生無有於此優婆夷所起染著心。",
        "translation": "There are no sentient beings in the world in the ten directions who become defiledly attached to this Upāsikā.",
        "source": "T10n0293_013:0722c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生暫得瞻見，所有煩惱悉自銷滅。",
        "translation": "If there are sentient beings who momentarily attain a vision, all their afflictions will cease on their own.",
        "source": "T10n0293_013:0722c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如百萬大梵天王，決定不生欲界煩惱。",
        "translation": "It's like the millions of great brahma kings who are certain not to give rise to the afflictions of the desire realm.",
        "source": "T10n0293_013:0722c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有見此優婆夷者不起煩惱，亦復如是。",
        "translation": "If someone who sees this Upāsikā doesn't become afflicted, it's likewise.",
        "source": "T10n0293_013:0722c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方眾生觀此女人，歡喜愛敬，心無厭足，唯除具足大智慧者。",
        "translation": "When sentient beings in the ten directions look at this woman, they rejoice, adore, and are not disillusioned at heart, except for those who possess great wisdom.",
        "source": "T10n0293_013:0722c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子曲躬合掌，恭敬瞻視，正念觀察。",
        "translation": "At the time, the boy of good fortune bent his bow with his palms together, looked respectfully, and correctly observed with mindfulness.",
        "source": "T10n0293_013:0722c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見此女人，其身自在，不可思議。",
        "translation": "He saw this woman, whose body was completely at ease and unfathomable.",
        "source": "T10n0293_013:0722c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色相顏容，世無與等；光明洞徹，物無能障。",
        "translation": "Her appearance and countenance were unequalled in the world, and her radiance was so penetrating that nothing could obstruct it.",
        "source": "T10n0293_013:0722c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普為法界一切眾生，作大饒益，無有窮盡。",
        "translation": "She creates great benefits for all sentient beings in the Dharma realm that know no limit.",
        "source": "T10n0293_013:0722c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其身毛孔，恒出妙香，眷屬無邊，宮殿第一；功德深廣，不可思議，莫能究盡，知其涯際。",
        "translation": "From their pores and pores, a wonderful fragrance always escapes, their retinue is limitless, and their palace is the tallest; their merit is unfathomably deep and vast, and no one can fathom it or know its limits.",
        "source": "T10n0293_013:0722c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生歡喜心，以偈讚曰：「汝常護持清淨戒，　　普修菩薩無垢忍，　堅進不動如金剛，　　妙果超世無能比。」",
        "translation": "Rejoicing, he praised them in verse, \"You always uphold pure precepts, you universally cultivate the bodhisattva's stainless tolerance, you are resolute and unmoving like adamant, and your marvelous results are beyond compare.\"",
        "source": "T10n0293_013:0722c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎爾時，善財童子說此偈已，白言：「聖者！",
        "translation": "After speaking this verse, the Boy of Good Fortune said, \"Sage!",
        "source": "T10n0293_013:0722c27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，云何修菩薩道；我聞聖者善能誘誨，願為我說。」",
        "translation": "I had first aroused the mind of unsurpassed, correct enlightenment, but I didn't know how a bodhisattva trains in the bodhisattva path or cultivates it; I've heard that the noble one is well able to guide you, so please explain it for me.\"",
        "source": "T10n0293_013:0722c28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，不動優婆夷以菩薩柔軟語、可愛語、慈悲語，慰諭善財，而告之言：「善哉！",
        "translation": "Upāsikā Acalace then comforted Shanzai with the bodhisattva's gentle, lovely, and compassionate words, and told him, \"Good!",
        "source": "T10n0293_013:0723a02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T10n0293_013:0723a04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0723a04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已能發阿耨多羅三藐三菩提心。",
        "translation": "\"You've been able to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0293_013:0723a04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0723a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩難摧伏智慧藏解脫門，我得菩薩堅固受持願行門，我得菩薩一切法平等地總持門，我得菩薩一切法智光照辯才門，我得菩薩求一切法心無疲厭莊嚴三昧門。」",
        "translation": "I have attained the bodhisattva's gate of liberation from the store of indestructible wisdom, I have attained the bodhisattva's gate of resolute adherence to vows and practices, I have attained the bodhisattva's gate of maintaining the ground of equality for all dharmas, I have attained the bodhisattva's gate of illuminating eloquence in wisdom about all dharmas, and I have attained the bodhisattva's gate of adorned concentration of nonwearing mind in pursuit of all dharmas.\"",
        "source": "T10n0293_013:0723a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財童子白言：「聖者！",
        "translation": "The Boy of Wealth said, \"Sage!",
        "source": "T10n0293_013:0723a09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩難摧伏智慧藏解脫門，乃至求法心無疲厭莊嚴三昧門境界云何？」",
        "translation": "What is the bodhisattva's liberation gate of the store of indestructible wisdom, or even the adorned samādhi-gate sphere of the mind that never tires of seeking the Dharma?\"",
        "source": "T10n0293_013:0723a09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "They replied, \"Good sons!",
        "source": "T10n0293_013:0723a11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此處甚深，難知難信。」",
        "translation": "This place is so profound that it's difficult to know and difficult to believe.\"",
        "source": "T10n0293_013:0723a11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「唯願聖者承佛神力，為我宣說。",
        "translation": "Shanzai said, \"Please let the noble one, by the Buddha's spiritual power, explain this for me.",
        "source": "T10n0293_013:0723a12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我因聖者善知識力，能信、能受、能解、能知、能甚深入、能隨順行，明了觀察，憶念修習，離諸分別，究竟平等。」",
        "translation": "Because of the power of the noble one's good teacher, I'm able to believe, receive, understand, know, penetrate deeply, practice with compassion, observe clearly, recall, and cultivate, free of discrimination, and ultimately equal.\"",
        "source": "T10n0293_013:0723a13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大方廣佛華嚴經卷第十三",
        "translation": "*Fascicle 13 of the Flower Ornament Sutra",
        "source": "T10n0293_013:0723a15_26",
        "is_bad_quality": false
    }
]