[
    {
        "source_sentence": "佛說十地經卷第三",
        "translation": "Foshuo shidi jing, vol. 3",
        "source": "T10n0287_003:0545a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐于闐三藏沙門尸羅達摩",
        "translation": "Śīladharma, the Tripiṭaka monk of Yutan, Great Tang",
        "source": "T10n0287_003:0545a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於北庭龍興寺譯",
        "translation": "Translated at Longxingsi, Northern Court",
        "source": "T10n0287_003:0545a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩發光地第三",
        "translation": "Third Ground of the Appearance of Light by the Bodhisattvas",
        "source": "T10n0287_003:0545a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛子聞此地行已，　　菩薩境界難思議；　靡不恭敬心歡喜，　　散花空中為供養。",
        "translation": "After the Buddha's disciples heard about this practice, their bodhisattva's state was unfathomable; they all revered and rejoiced, scattering flowers in the air as an offering.",
        "source": "T10n0287_003:0545a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　讚言：「善哉！",
        "translation": "They praised him, saying, \"Good!",
        "source": "T10n0287_003:0545a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙主！",
        "translation": "Great Sage Lord!",
        "source": "T10n0287_003:0545a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　慈心愍念諸有情；　善說智者律儀法，　　第二地中之行相。",
        "translation": "\"With compassionate mindfulness of sentient beings, he well explains the disciplines of the wise ones and the conduct of the second ground.",
        "source": "T10n0287_003:0545a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是諸菩薩微妙行，　　真實無異無差別；　為欲利益諸群生，　　如是演說最清淨。",
        "translation": "These subtle actions of the bodhisattvas are truly not different or distinct, and they're most pure when explained for the benefit of sentient beings.",
        "source": "T10n0287_003:0545a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切天人供養者，　　願為演說第三地；　與法相應諸智業，　　如其境界為具闡。",
        "translation": "All gods and humans who make offerings to them want to explain the third ground for them, and the cognitive actions that correspond to the teaching are fully explained as their objective realm.",
        "source": "T10n0287_003:0545a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大仙所有施、淨戒，　　安忍、精進、靜慮、慧，　及以方便慈悲道，　　佛清淨道願皆說。」",
        "translation": "Of all the great sages' generosity, pure precepts, patience, effort, meditation, wisdom, and the path of skillful means and compassion, may the Buddha's pure path be explained.\"",
        "source": "T10n0287_003:0545a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時解脫月復請言：　　「無畏大師金剛藏！",
        "translation": "Again, Mochizuki Jietsuko asked, \"Great fearless teacher, Vajragarbha!",
        "source": "T10n0287_003:0545a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願說趣入第三地，　　柔和心者之功德。」",
        "translation": "May I explain the merits of someone who enters the third ground and pacifies the mind.\"",
        "source": "T10n0287_003:0545a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，金剛藏菩薩告眾菩薩言：「唯諸佛子！",
        "translation": "At that point, the Vajragarbha Bodhisattva addressed the bodhisattvas, saying, \"Only the buddhas!",
        "source": "T10n0287_003:0545a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是菩薩，第二地中增上意樂善清淨已，欲入菩薩第三地者，當以十種心之意樂作意而入。",
        "translation": "\"If a bodhisattva wants to enter the third ground of the bodhisattva after the aspiration to advance to the second ground is well-purified, he should enter with the aspiration to aspire to ten kinds of mind.",
        "source": "T10n0287_003:0545a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0287_003:0545a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：以清淨心意樂作意，以安住心意樂作意，以厭離心意樂作意，以離欲心意樂作意，以不退心意樂作意，以堅固心意樂作意，以熾然心意樂作意，以勇健心意樂作意，以勝妙心意樂作意，以廣大心意樂作意，菩薩以是十心意樂作意，證入第三地中。",
        "translation": "These are called: with pure mindfulness of contemplation, with well-abiding mindfulness of contemplation, with mindfulness of contemplation that's free from desire, with mindfulness of contemplation that's free from desire, with mindfulness of contemplation that's nonretrogressing, with mindfulness of contemplation that's resolute, with mindfulness of contemplation that's fiery, with mindfulness of contemplation that's vigorous, with mindfulness of contemplation that's excellent and marvelous, and with mindfulness of contemplation that's vast, the bodhisattva realizes entry into the third ground with these ten mindfulnesses of contemplation.",
        "source": "T10n0287_003:0545a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the children of the Buddha!",
        "source": "T10n0287_003:0545a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此第三地時，觀察一切諸有為行，皆見無常、有苦、不淨、不可依怙，終皆敗壞、不得久住，剎那生滅、前際不來、後際不去、現在不住。",
        "translation": "When the bodhisattva abides in this third ground, he observes all the conditioned things that exist and sees that they are impermanent, painful, impure, and unfounded, that they all eventually decay, that they can't be sustained for a long time, that they are produced and ceased momentarily, that they don't come in the past, that they don't go in the future, and that they don't abide in the present.",
        "source": "T10n0287_003:0545a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是無倒觀察一切行時，復觀見身無有救者、無所依怙，與憂、與歎、與惱相應，愛憎所繫多苦愁惱，無有停積。",
        "translation": "When the bodhisattva thus observes all conditioned things without error, he also observes that his body has no savior, no support, and is associated with grief, sorrow, and vexation, and that it's bound by craving and hate and is filled with suffering and grief, with no pause.",
        "source": "T10n0287_003:0545b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以貪、恚、癡猛火熾然共眾病長，見如是已，從一切行令心勝進趣如來智印。",
        "translation": "After seeing this, he causes his mind to advance from all his actions to the seal of the Tathāgata's knowledge because of the fierce fires of greed, anger, and delusion that grow together with many illnesses.",
        "source": "T10n0287_003:0545b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩見如來智不可思議，無等、無量、難得、無雜、無災、無惱，至無畏城不復退還，能救無量諸苦有情。",
        "translation": "This bodhisattva sees that the Tathāgata's unfathomable wisdom is unequalled, immeasurable, difficult to attain, unadulterated, untroubled, and uninjured, reaches the city of fearlessness, doesn't retreat, and can save measureless suffering sentient beings.",
        "source": "T10n0287_003:0545b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是見如來智無量利益、見一切行無量災患，則此轉更於有情所，發起十種心之意樂。",
        "translation": "Thus seeing that the Tathāgata's knowledge has measureless benefits and that all conditioned things have measureless disasters, the bodhisattva then goes on to arouse ten kinds of mental aspirations in sentient beings.",
        "source": "T10n0287_003:0545b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0287_003:0545b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：孤獨無依心之意樂，常恒貧窮心之意樂，以貪、恚、癡猛火熾然心之意樂，於有牢獄之所禁閉心之意樂，常無間斷以諸煩惱稠林所覆心之意樂，不能觀察心之意樂，無善法欲心之意樂，迷失佛法心之意樂，隨生死流心之意樂，失解脫道心之意樂，發此十種心之意樂。",
        "translation": "They are: the aspiration to be alone and without support, the aspiration to be constantly poor, the aspiration to be enflamed by the fierce fires of greed, anger, and delusion, the aspiration to be confined in a prison, the aspiration to be covered by the thickets of affliction that are never stopped, the aspiration to be unable to contemplate, the aspiration to lack the desire for good qualities, the aspiration to be lost in the Buddha-dharma, the aspiration to follow the flow of birth-and-death, and the aspiration to lose the path to liberation, and these are the ten kinds of aspirations that arise in the mind.",
        "source": "T10n0287_003:0545b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是見有情界眾災患已，發大精進作是念言：『此諸有情，我應救濟應令解脫，應令清淨、應當拔出、應令趣入、應令安住、應令歡喜、應令愛樂、應令調伏、應令寂滅。』",
        "translation": "After thus seeing the many calamities in the world of sentient beings, the bodhisattva arouses great effort and thinks, 'I should rescue these sentient beings and make them liberated, purified, uprooted, entered, settled, joyous, delightful, tamed, and tranquilized.'",
        "source": "T10n0287_003:0545b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是於彼諸行深心厭離，於諸有情興悲戀心，於佛妙智見大勝利，以如來智為所依止；為救有情勤修加行，作是思惟：『此諸有情墮在眾苦煩惱雜染，以何等道而能拔濟，令住究竟常樂涅槃？』",
        "translation": "Thus, the bodhisattva is deeply disillusioned with those practices, becomes compassionate and attached to sentient beings, sees the great benefit of the Buddha's marvelous wisdom, takes the Tathāgata's wisdom as his support, diligently cultivates applied practices to save sentient beings, and thinks, 'What path can rescue these sentient beings who have fallen into the stain of suffering and affliction and make them abide in final, everlasting nirvāṇa?'",
        "source": "T10n0287_003:0545b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即此菩薩便作是念：『此皆不離以無障礙智解脫處；此無障礙智解脫，不離一切法如實覺；此一切法如實覺悟，不離無行無生行慧；此慧光明，不離靜慮善巧決擇妙慧觀察；復此靜慮善巧決擇妙慧觀察，皆不離於多聞善巧。』",
        "translation": "The bodhisattva then thinks, 'None of this is free from the state of liberation with unobstructed knowledge; this unobstructed knowledge of liberation is not free from the true awakening of all things; this true awakening of all things is not free from the wisdom of formless actions and unborn actions; this wisdom illuminates, and it's not free from the wondrous wisdom of skillful discernment and analysis of meditation; and this wondrous wisdom of skillful discernment and analysis of meditation is not free from the skillfulness of being well-versed.'",
        "source": "T10n0287_003:0545b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以是善觀察智，專為訪求正法而行，日夜慕法聞法無厭，玩法、樂法、依法、靡法、住法、須法、怙法、歸法、法隨、法行。",
        "translation": "With this well-observed wisdom, the bodhisattva goes about specifically seeking the right Dharma, never tiring of admiring and hearing the Dharma day and night, playing with the Dharma, delighting in the Dharma, following the Dharma, abiding in the Dharma, needing the Dharma, relying on the Dharma, returning to the Dharma, following the Dharma, and practicing the Dharma.",
        "source": "T10n0287_003:0545c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是為求佛法修正行時，無有少物或資生具，或財穀倉庫而不能捨，於此終無難作之想，唯於說法補特伽羅生難遭想；為佛法故無有少分執受外物而不能捨，無少內物而不能捨，無有師長不誓承事，除慢、過慢，下意受行，無有身苦而不誓受。",
        "translation": "When bodhisattvas thus cultivate the practice of seeking the Buddha's teaching, there are no few things, or necessities, or stores of food and clothing that they can't abandon, and there are no difficult thoughts that arise only from teaching the Dharma to Pudgala; there are no few external things that they cling to for the sake of the Buddha's teaching that they can't abandon, no few internal things that they can't abandon, no teachers or leaders that they don't vow to serve, no conceit or arrogance, no practices with low intentions, and no physical suffering that they don't vow to experience.",
        "source": "T10n0287_003:0545c04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞佛法一四句頌歡喜踊躍，勝得三千大千世界充滿其中大珍寶聚。",
        "translation": "If someone hears one verse or four verses of the Buddha's teaching and rejoices, they'll surpass the 3,000 great one-thousand worlds filled with a great cluster of treasures in it.",
        "source": "T10n0287_003:0545c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞一頌善說正法，歡喜勝得轉輪王位。",
        "translation": "If they hear one verse of the right teaching well explained, they'll rejoice and rise to the position of wheel-turning king.",
        "source": "T10n0287_003:0545c11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞未聞法是佛所說，能引正等覺、能淨菩薩行歡喜踊躍，勝得一切釋梵王等，住百千劫極尊貴位。",
        "translation": "They rejoice and dance with joy when they hear a teaching from a Buddha who's capable of inducing the practice of righteous awakening and purifying bodhisattvas, and they surpass all the Śakra kings and so forth, abiding in a position of great honor for a hundred thousand eons.",
        "source": "T10n0287_003:0545c12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有告言：『我有一句佛所說法，能引正等覺、能淨菩薩行，汝今若能投極熾然大焰火坑受劇苦者，當為汝說。』",
        "translation": "Suppose someone were to tell you, 'I have a teaching from the Buddha that can lead to correct enlightenment and purify the bodhisattva's practice, and if you could throw yourself into a fiery pit that would be extremely painful, I would explain it for you.'",
        "source": "T10n0287_003:0545c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩聞已作是念言：『我為一句佛所說法，能引等正覺、能淨菩薩行，正使火坑量等三千大千世界，滿中熾火，我從梵天尚投身入，況小火坑。",
        "translation": "After hearing that, the bodhisattva had this thought, 'I spoke a single Buddha's teaching that can lead to correct awakening and purify the bodhisattva's practice, and it precisely caused a fiery pit the size of 3,000 great thousand worlds to be filled with blazing fire, into which I had plunged from the Brahma heavens, so why wouldn't I plunge into a small fiery pit?'",
        "source": "T10n0287_003:0545c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復我等為求佛法，尚應久處大捺落迦諸險惡趣受大苦惱，況於人中諸餘小苦而不能受。』",
        "translation": "Furthermore, in order to pursue the Buddha's teaching, we should still spend a long time in the dangerous and unpleasant destinies of the great hells and undergo great suffering, so why wouldn't we be able to undergo the other minor sufferings among humans?'",
        "source": "T10n0287_003:0545c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩發起如是精進求正法已，如其所聞而能如理內審觀察。",
        "translation": "After initiating such an effort to pursue the right teaching, the bodhisattva observes it accurately and internally based on what he's heard.",
        "source": "T10n0287_003:0545c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞正法已，獨居靜處心自決了作是思惟：『以正修行法隨法行，方得名為隨順佛法，非但純以語業演說而得清淨。』",
        "translation": "After hearing the right teaching, he lived alone in a quiet place, made up his mind, and thought, 'Only by correctly cultivating the practice of Dharma and following Dharma can we be called following the Buddha's teachings, not merely by expounding them through verbal actions that attain purity.'",
        "source": "T10n0287_003:0545c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住是發光地時，為欲修行法隨法行，離欲離諸惡不善法，有尋有伺，離生喜樂，入初靜慮具足安住。",
        "translation": "When a bodhisattva abides in this ground of arousal of the light, he wants to cultivate the practice of following the Dharma, part with desire, part with bad and unskillful things, part with discursive thought, part with joy and happiness, and enter the first concentration fully abiding.",
        "source": "T10n0287_003:0545c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋伺寂靜內等淨故一心趣故，無尋無伺定生喜樂，入第二靜慮具足安住。",
        "translation": "Because internal quiescence of discursive examination is equally pure and the single mind is headed for it, the absence of discursive examination and the concentration of discursive examination give rise to joy and happiness, and they enter the second concentration fully abiding.",
        "source": "T10n0287_003:0545c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於喜離欲安住於捨，正念正知，有身受樂，於是處所，諸聖宣說具足捨念及以正知，住身受樂入第三靜慮具足安住。",
        "translation": "Being joyful, free of desire, and abiding calmly in equanimity with right mindfulness and right knowledge, he has body sensations that are pleasant, and in this place, the noble ones proclaim that with perfect equanimity and right knowledge, he abides in body sensations that are pleasant and enters the third concentration with full abiding.",
        "source": "T10n0287_003:0546a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂斷苦斷先喜憂沒，不苦不樂捨念清淨，入第四靜慮具足安住。",
        "translation": "Stopping pleasure and suffering, first delight and sorrow disappear, and being mindful of equanimity without suffering or pleasure, he enters the fourth concentration fully abiding.",
        "source": "T10n0287_003:0546a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此菩薩超一切種色之想故，滅沒一切有對想故，以不作意種種想故，知無邊虛空，入空無邊處具足安住。",
        "translation": "Also, because this bodhisattva transcends all kinds of perceptions of form, ceases all perceptions of existence, and knows infinite space because he doesn't think various perceptions, he enters the boundless abode of emptiness with perfect abiding.",
        "source": "T10n0287_003:0546a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "超一切種空無邊處，知無邊識，入識無邊處具足安住。",
        "translation": "He transcends the infinite realm of all kinds of emptiness, knows the infinite consciousness, and enters the infinite realm of consciousness with perfect stability.",
        "source": "T10n0287_003:0546a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "超一切種識無邊處，知無所有，入無所有處具足安住。",
        "translation": "He transcends the borderless realm of all kinds of consciousness, knows that there's nothing, and enters the borderless realm fully and calmly.",
        "source": "T10n0287_003:0546a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "超一切種無所有處，知非想非非想，入於非想非非想處具足安住。",
        "translation": "He transcends the sphere of all kinds of lack of existence, knows what's neither perceived nor unperceived, and enters the sphere of neither perceived nor unperceived with perfect abiding.",
        "source": "T10n0287_003:0546a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但為隨順法隨法行，不以樂著安足處也。",
        "translation": "He simply follows principles and practices according to principles, not with joyful attachment to a place of stability.",
        "source": "T10n0287_003:0546a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩修慈俱心，廣大無二、無量、無恨、無怨、無障、無所惱害，遍至一切極於法界盡虛空性，諸世界中以慈普覆一切世間具足安住。",
        "translation": "\"Furthermore, the bodhisattva cultivates the mind of both kindness and pity, which is vast, without duality or measure, without hatred, without enmity, without obstruction, and without harm, reaching everywhere and the totality of the Dharma realm and the nature of space, and fully abiding with kindness in all the worlds that encompass all the worlds.",
        "source": "T10n0287_003:0546a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修悲俱心、修喜俱心亦復如是。",
        "translation": "The mind that cultivates both pity and joy is likewise.",
        "source": "T10n0287_003:0546a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修捨俱心廣大無二、無量、無恨、無怨、無障、無所惱害，遍至一切極於法界盡虛空性，諸世界中以捨普覆一切世間具足安住。",
        "translation": "Cultivating the mind of equanimity, which is vast, nondual, immeasurable, without hatred, without enmity, without obstruction, and without affliction, pervades all and extends to the entirety of the nature of space in the Dharma realm, and in all the worlds he fully abides with equanimity that completely covers all the world.",
        "source": "T10n0287_003:0546a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩受用無量諸神變事震動大地，一身為多身、多身為一身，或顯、或隱，迅疾無礙，牆壁山嶂皆能徹過如行於空，於虛空中跏趺而去猶如飛鳥，出沒於地猶若水中，履水如地，身出煙焰如大火聚，從身注水喻如大雲，此之日月有大神德有大威勢，以手捫摸，乃至梵世轉身自在；以天耳界清淨過人，悉聞人天二種音聲，若近、若遠乃至蚊蚋、蜣蜋等悉聞其聲。",
        "translation": "Furthermore, the bodhisattva receives measureless miraculous powers that shake the earth, turning one body into many bodies and many bodies into one, either visible or hidden, swift and unobstructed, penetrating walls and mountains like walking in space, sitting cross-legged in space and departing like a bird in flight, emerging from the ground like water, treading water like the ground, emitting smoke and flame like a great ball of fire, pouring water from his body like a great cloud, the sun and moon having great superknowledge and authority, touching with his hand, even in the Brahma world, and transforming himself freely; the divine ear, which is purer than human beings, can hear the two kinds of sounds of humans and gods, whether near or far, even gnats and dung beetles.",
        "source": "T10n0287_003:0546a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以他心智如實而知他有情心，所謂有貪心如實知有貪心，離貪心如實知離貪心，有瞋離瞋，有癡離癡，有染離染，狹小、廣大無量聚散，住定、出定，已得解脫、未得解脫，有亹、無亹，麁心、細心皆如實知。",
        "translation": "With knowledge of other minds, he truly knows the minds of other sentient beings, which is to say that he truly knows that there's a mind with craving, truly knows that he's free of craving, has anger and is free of anger, has delusion and is free of delusion, is defiled and is free of defilement, is small and vast and has measureless clusters and scatterings, abides in concentration and departs from concentration, has attained liberation and has yet to attain liberation, is persevering and is not persevering, and has true knowledge of crude and fine minds.",
        "source": "T10n0287_003:0546a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是以他心智，於他有情他數取趣心之所念心自了知。",
        "translation": "With knowledge of other minds, the bodhisattva thus knows for himself the mindfulness of other sentient beings' minds that have acquired several destinies.",
        "source": "T10n0287_003:0546b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以宿住智隨念無量諸宿住事，謂能隨念自他一生，二、三、四、五，至十、二十、三、四、五十，乃至百生、多百、多千、多百千生，成劫、壞劫及成壞劫，乃至隨念無量成壞劫，隨念百劫，隨念千劫、百千劫、俱胝劫、百俱胝劫、千俱胝劫、百千俱胝劫，乃至無量百千俱胝那庾多劫皆能隨念。",
        "translation": "With knowledge of past lives, he follows the mindfulness of measureless past lives, which is to say that he can follow the mindfulness of his own lifetime, two, three, four, five, ten, twenty, three, four, fifty, up to a hundred births, many hundreds, many thousands, many hundreds of thousands of births, eons of formation, eons of decay, and eons of formation and decay, up to measureless eons of formation and decay, a hundred eons, a thousand eons, a hundred thousand eons, a kalpa, a hundred kalpa, a thousand kalpa, a hundred thousand kalpa, and measureless hundred thousand kalpa-nayuta eons.",
        "source": "T10n0287_003:0546b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂我宿生曾在某處，如是名、如是姓、如是種族、如是形貌、如是飲食、如是壽量、如是久住、如是苦樂，從彼處沒來生此處，從此處沒往生於彼，如是形貌、如是言說，若略、若廣諸宿住事皆能隨念。",
        "translation": "That is, I was born somewhere in the past, with this name, this family name, this race, this appearance, this diet, this life span, this long abiding, this suffering and this happiness, and I was born here before coming from that place and born there before going from this place, with this appearance and this speech, whether abbreviated or extensive, and I'm able to recall all the things from my past lives.",
        "source": "T10n0287_003:0546b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以天眼界清淨過人，見諸有情死時、生時，好色、惡色、善趣、惡趣、若劣、若勝，隨業所行，諸有情類皆如實知。",
        "translation": "Because the divine eye realm is purer than human beings, it sees all sentient beings at the time of death and birth, whether they're in good form or bad form, good or bad destinies, inferior or superior, and the actions of karma, and all sentient beings know them exactly as they are.",
        "source": "T10n0287_003:0546b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂彼有情成就身、語及意惡行，誹謗賢聖、具足邪見，由邪見業現受因緣，身壞命終墮險惡趣生捺落迦。",
        "translation": "That is, when a sentient being accomplishes bad physical, verbal, and mental conduct, denigrates the good and noble, and is fully possessed of wrong views, they will be destined to fall into a dangerous and evil destiny and be born in Nādaka when their body breaks up and their life ends because of the causes and conditions of the actions of wrong views.",
        "source": "T10n0287_003:0546b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復彼有情成就身、語及意善行，讚美賢聖、成就正見，由正見業現受因緣，身壞命終當昇善趣，生於天中受諸快樂。",
        "translation": "That other sentient being produces good conduct of body, speech, and thought, praises the good and noble, and accomplishes right view, and because of the karma of right view they now receive the causes and conditions, they will ascend to a good destiny when their body breaks up and their life ends, and they'll be born among the gods and experience various pleasures.",
        "source": "T10n0287_003:0546b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是以天眼界清淨過人，以共形貌、以共言說，見諸有情死時、生時、好色、惡色、善趣、惡趣、若劣、若勝，隨業所行，諸有情類皆如實知。",
        "translation": "Thus, with the divine eye realm that's purer than that of humans, the bodhisattva sees sentient beings in common form and speech when they die, when they're born, in good form, bad form, good destinies, bad destinies, whether inferior, or superior, and the actions of karma, and he knows them all as they really are.",
        "source": "T10n0287_003:0546b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此菩薩於彼靜慮、解脫、等持及諸等至，隨意入出，而不由彼威力受生，若見彼處速能圓滿菩提分法故，以願力而生其中。",
        "translation": "Because this bodhisattva enters and leaves those states of meditation, liberation, equipoise, and the attainments as he wishes, and doesn't take birth there by virtue of their authority, he'll be born there by virtue of his vow if he sees that it's a place that quickly fulfills the factors of enlightenment.",
        "source": "T10n0287_003:0546b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩住此發光地已，由廣大見及由願力，現見多佛、多百佛、多千佛、多百千佛、多百千那庾多佛、多俱胝佛、多百俱胝佛、多千俱胝佛、多百千俱胝佛、多百千俱胝那庾多佛。",
        "translation": "\"After standing in this ground of emission of light, the bodhisattva, because of his vast vision and because of the power of his vow, now sees many buddhas, hundreds of buddhas, thousands of buddhas, hundreds of thousands of buddhas, hundreds of thousands of nayutas, corpuscles, hundreds of corpuscles, thousands of corpuscles, hundreds of thousands of corpuscles, and hundreds of thousands of corpuscles of nayutas.",
        "source": "T10n0287_003:0546b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見是如來、應、正等覺已，悉以廣大增上意樂，恭敬、尊重、承事、供養，奉施衣服、飲食、臥具、病緣醫藥、諸資生具，奉獻菩薩諸妙樂具，於僧伽眾而作恭敬，以此善根迴向無上正等菩提；殷重奉事諸佛如來，於其佛所恭敬聽法，聞已受持隨分修行。",
        "translation": "After seeing these Tathāgatas, Arhats, and Fully Awakened Ones, the bodhisattvas all respect, honor, serve, and make offerings with great and intensified aspirations, bestow clothing, food, bedding, medicines for illnesses, and necessities for daily life, present the bodhisattvas with marvelous implements of joy, pay respect to the saṃgha community, and dedicate these good roots to unsurpassed perfect enlightenment; they respectfully serve the Tathāgatas, listen respectfully to the Dharma in their buddha-places, and after hearing it, accept and practice it accordingly.",
        "source": "T10n0287_003:0546c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩觀一切法，無有移轉亦無壞滅，因緣而有；而此菩薩一切欲縛皆轉微薄；一切色縛、一切有縛、諸無明縛皆轉微薄；一切見縛先已除斷。",
        "translation": "\"Furthermore, the bodhisattva observes that all things lack transference and decay and come into existence by causes and conditions, and this bodhisattva sees that all fetters of desire are becoming slight, all fetters of form, all fetters of existence, and all fetters of ignorance are becoming slight, and all fetters of views have first been removed.",
        "source": "T10n0287_003:0546c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住是發光地中，於無量劫、無量百劫、無量千劫、無量百千劫、無量百千那庾多劫、無量俱胝劫、無量百俱胝劫、無量千俱胝劫、無量百千俱胝劫、無量百千俱胝那庾多劫，不積集故邪貪除斷，不積集故邪瞋除斷，不積集故邪癡除斷，所有善根轉更明淨。",
        "translation": "While standing in this ground of radiance, the bodhisattva removes wrong greed because it doesn't accumulate, removes wrong anger because it doesn't accumulate, removes wrong delusion because it doesn't accumulate, and transforms all good roots into greater clarity and purity during an incalculably long eon, an incalculably long hundred eons, an incalculably long thousand eons, an incalculably long hundred thousand eons, an incalculably long nayuta eons, an incalculably long corpse eon, an incalculably long hundred corpse eons, an incalculably long thousand corpse eons, and an incalculably long hundred thousand corpse eons.",
        "source": "T10n0287_003:0546c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the children of the Buddha!",
        "source": "T10n0287_003:0546c17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如真金，善巧金師自手鍊治，離諸垢已稱量不減；菩薩住此發光地中亦復如是，無量百劫乃至無量百千俱胝那庾多劫，由不積集邪貪除斷，由不積集邪恚除斷，由不積集邪癡除斷，所有善根轉更明淨。",
        "translation": "Like true gold that a skilled gold smith purifies with his own hands and measures without diminishing after it's freed from all impurity, so too does a bodhisattva abide in this ground of radiance for measureless hundreds of eons and measureless hundreds of thousands of koṭīs of nayutas, until he removes wrong greed that doesn't accumulate, removes wrong anger that doesn't accumulate, and removes wrong delusion that doesn't accumulate, and all of his good roots become more clearly purified.",
        "source": "T10n0287_003:0546c18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此菩薩轉更安忍，柔和意樂而得清淨。",
        "translation": "This bodhisattva then becomes more tolerant, and he attains purity with gentle intentions.",
        "source": "T10n0287_003:0546c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又悅美意樂，不瞋意樂，不動意樂，不濁意樂，無高下意樂，不希有情意下意樂，不望酬報意樂，無諂誑意樂，不稠林意樂，皆轉清淨。",
        "translation": "The aspiration to be pleased, the aspiration not to hate, the aspiration not to be moved, the aspiration not to be defiled, the aspiration not to be superior or inferior, the aspiration not to wish the inferiority of sentient beings, the aspiration not to expect reward, the aspiration not to flatter, and the aspiration not to be part of a forest all become purified.",
        "source": "T10n0287_003:0546c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此菩薩四攝事中利行偏多，十到彼岸中忍到彼岸而得增上，餘到彼岸隨力隨分非不修行。",
        "translation": "Of these four ways to bring benefit to the bodhisattvas, their actions are partial and numerous, and they attain superiority when they reach the other shore of forbearance among the ten shores, while the others reach the other shore according to their ability and according to their part, not without cultivating them.",
        "source": "T10n0287_003:0546c26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "\"Only the children of the Buddha!",
        "source": "T10n0287_003:0546c28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名略說菩薩第三發光地也。",
        "translation": "This is called the third ground of the bodhisattva's awakening of light, as outlined here.",
        "source": "T10n0287_003:0546c29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩安住於此地中，受生多分作釋天帝，有自在力，善化有情令離欲貪，善拔救護沒欲泥者。",
        "translation": "Abiding here, the bodhisattva is born in many parts of the world as Indra, has sovereign power, skillfully converts sentient beings to become free of desire, and skillfully plucks and rescues those who are trapped in the mire of desire.",
        "source": "T10n0287_003:0546c29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所作業，或以布施、或以愛語、或以利行、或以同事，此等一切悉皆不離佛作意、法作意、僧伽作意、菩薩作意、菩薩行作意、到彼岸作意、諸地作意、佛力作意、無所畏作意、佛不共法作意，乃至不離一切行相勝妙相應一切智智作意。",
        "translation": "All these actions, whether by generosity, by loving words, by beneficial conduct, or by coworkers, are not separate from the contemplation of the Buddha, the contemplation of the Dharma, the contemplation of the saṃgha, the contemplation of the bodhisattva, the contemplation of the bodhisattva's practice, the contemplation of reaching the other shore, the contemplation of the stages, the contemplation of the Buddha's power, the contemplation of being fearless, the contemplation of the Buddha's unique qualities, and the contemplation of the knowledge of all forms of conduct that are excellent and marvelous together.",
        "source": "T10n0287_003:0547a02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作願言：『我當一切有情中，為首、為勝、為殊勝、為妙、為微妙、為上、為無上、為導、為將、為帥，乃至願得一切智智所依止處。』",
        "translation": "Again, he makes the vow, saying, 'I will be the leader, superior, exceptional, marvelous, subtle, superior, unsurpassed, guide, general, and commander of all sentient beings, and I hope to attain the basis of the knowledge of all things.'",
        "source": "T10n0287_003:0547a08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若樂發起如是精進，棄捨一切家屬財位歸依聖教淨信出家，即一剎那頃瞬息須臾，能證百千諸三摩地；能見百千諸佛如來，彼佛加持皆能解了；能動百千世界，能往百千剎土，能照百千世界，能成熟百千有情，能住壽百千劫，於前後際能入百千劫。",
        "translation": "If someone happily initiates such effort, discarding all family possessions and positions, and relying on the noble teaching of pure faith to leave home, they'll be able to realize a hundred thousand samādhis in a split second, see a hundred thousand Tathāgatas, and understand all of their blessings; they'll be able to move a hundred thousand worlds, travel to a hundred thousand buddha-lands, illuminate a hundred thousand worlds, ripen a hundred thousand sentient beings, live a hundred thousand eons, and enter a hundred thousand eons both before and after.",
        "source": "T10n0287_003:0547a10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於百千法門能正思擇，示現百千身身，身皆能現百千菩薩眷屬圍遶。",
        "translation": "Capable of correctly discriminating among a hundred thousand teachings, they show a hundred thousand bodies, and each of them can be surrounded by a hundred thousand bodhisattva retinues.",
        "source": "T10n0287_003:0547a16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從此以上，是諸菩薩有願力者，由勝願故，所有遊戲，或身、或光明、或神通、或眼、或境界、或音聲、或行、或莊嚴、或勝解、或所作，此等乃至爾所百千俱胝那庾多劫不易可數。」",
        "translation": "From here on out, these bodhisattvas have the power of their vows, and because of their excellent vows, their play, whether it's body, light, superknowledge, vision, objects, sounds, actions, adornment, superior understanding, or deeds, such as these and so forth for a hundred thousand koṭīnaya eons cannot easily be counted.\"",
        "source": "T10n0287_003:0547a18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，金剛藏菩薩，欲重宣此義而說頌曰：「清淨安住厭離心，　　離欲無退及堅固；　熾然勇健勝妙廣，　　以此十心入三地。",
        "translation": "At the time, the Vajragarbha Bodhisattva wanted to reiterate this meaning and spoke the verse, \"With these ten states of mind, he enters the third ground while staying purely and peacefully disillusioned, free of desire, undaunted, and resolute, and fiery and robust in a marvelous way.",
        "source": "T10n0287_003:0547a21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩住於此地中，　　觀行無常、苦、不淨，　無怙、敗壞、不久停，　　遷變、無住、無來往。",
        "translation": "Abiding here, the bodhisattva observes that conditioned phenomena are impermanent, painful, and impure, lack support, spoil, and don't last long, and are subject to change, non-abiding, and non-returning.",
        "source": "T10n0287_003:0547a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀身無救、無依怙，　　有憂、有惱、續愛憎，　多苦不停或火然，　　與病俱有無休息。",
        "translation": "He observes that his body is unsalvaged and lacks support, that there's grief, vexation, and continued craving and hate, that much suffering doesn't stop and fire does, and that he has both illness and lack of rest.",
        "source": "T10n0287_003:0547a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　厭離三有求佛智，　　見彼妙智不思議；　無等、無量難證悟，　　無雜、無災、無逼惱，　歸大寂滅無退轉，　　能救無量苦有情。",
        "translation": "They become disillusioned with the three existences and seek the Buddha's wisdom, seeing that marvelous wisdom and not deliberating on it; unequalled, immeasurable, and difficult to realize; unadulterated, untroubled, and unencumbered; destined for great quiescence and nonretrogression; and able to save measureless suffering sentient beings.",
        "source": "T10n0287_003:0547a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見佛智已愍眾生，　　孤獨無依無救護，　三毒熾然常困乏，　　住諸有獄恒受苦，　煩惱習覆無慧目，　　志樂下劣喪法寶，　隨順生死怖涅槃，　　我應救彼勤精進。",
        "translation": "Having seen the Buddha's wisdom, he pities sentient beings who are alone, have no support, and no aid, are constantly wearied by the three poisons, live in the hells of constant suffering, are hindered by the habituation of affliction and lack the eye of wisdom, have inferior aspirations and lose the treasures of the Dharma, and conform to birth-and-death and fear nirvāṇa; I should save them and diligently pursue their endeavors.",
        "source": "T10n0287_003:0547b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　將求智慧益有情，　　思何方便令解脫？",
        "translation": "Seeking wisdom that will benefit sentient beings, what method should I consider to bring about their liberation?",
        "source": "T10n0287_003:0547b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不離處佛無礙智，　　斯由覺法如實理；　覺由無行無生慧，　　慧從定發定由聞。",
        "translation": "\"The Buddha's unimpeded wisdom that doesn't leave the premises is based on the awakening of the Dharma as it really is, and awakening comes from the lack of practice and unborn wisdom, and wisdom arises from concentration and concentration comes from hearing.",
        "source": "T10n0287_003:0547b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是思惟自策勵，　　日夜聽習尊重法；　為聞正法起敬心，　　國城、資具、諸珍寶，　妻子、眷屬及王位，　　如是一切皆能捨；　頭、目、耳、鼻、舌、牙齒，　　手、足、骨髓、心血、肉，　此等皆捨未為難，　　但於法師生難想。",
        "translation": "Thus motivated by this reflection, they listen to and study the teaching of reverence day and night. Hearing the right teaching and arousing respect for it, they are able to abandon their country, their belongings, their treasures, their wives, their retinues, and their position as king; their head, eyes, ears, nose, tongue, and teeth, their hands, feet, marrow, heart, blood, and flesh; it's not difficult to abandon them all, but they give rise to difficult thoughts about the Dharma teacher.",
        "source": "T10n0287_003:0547b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設有人等語菩薩，　　孰能投身大火坑；　我當與汝佛法寶，　　聞以投之無怯懼。",
        "translation": "Suppose someone were to say, \"Bodhisattva, who could plunge into a great fiery pit?\" I would give you the Buddha's Dharma treasure and cast it in without fear upon hearing it.",
        "source": "T10n0287_003:0547b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使火滿三千界，　　身從梵世而投入；　為求法故不為難，　　況復人間諸小苦。",
        "translation": "Suppose a fire were to fill 3,000 realms and you were to plunge into it from the Brahma world; it wouldn't be difficult to seek the Dharma, so why wouldn't it be the case for the minor sufferings of humans?",
        "source": "T10n0287_003:0547b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從初發意至菩提，　　其中設有無間苦；　為聞法故皆能受，　　何況人中諸苦事。",
        "translation": "From the first moment of aspiration to enlightenment, there's unremitting suffering within it; it's because they hear the teaching that they're able to experience it, let alone the suffering among humans.",
        "source": "T10n0287_003:0547b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞已如理正思惟，　　獲四靜慮、四等至，　四無量心、五神通，　　不隨其勢而受生。",
        "translation": "After correctly contemplating this, he attains the four meditations, four equipoises, four immeasurable minds, and five supernormal powers, and is not subject to birth according to their momentum.",
        "source": "T10n0287_003:0547b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩住此見多佛，　　供養聽聞心決定；　斷諸邪惑轉淨明，　　如鍊真金體無減。",
        "translation": "Abiding here, the bodhisattva sees many buddhas, makes offerings, listens, and has a determined mind; he stops wrong mental disturbances and turns pure and insightful, like gold that's been polished and whose body never decreases.",
        "source": "T10n0287_003:0547b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　住此多作釋天帝，　　化導無量諸有情；　令捨貪心住善道，　　一切專求佛功德。",
        "translation": "Abiding here, they often act as Indra, teaching and guiding measureless sentient beings, causing them to abandon greed and abide on the good path, and they all focus on the merits of the Buddha.",
        "source": "T10n0287_003:0547b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　住此精進剎那頃，　　能證百千三摩地；　見百千佛相嚴身，　　若具願力復過是。",
        "translation": "In the moment when they abide in this state of zeal, they'll realize a hundred thousand samādhis, see a hundred thousand buddhas in their adorned bodies, and if they possess the power of their vows, they'll surpass them.",
        "source": "T10n0287_003:0547b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切有情普利樂，　　彼諸菩薩最上行；　如是所有第三地，　　我依其義已解釋。」",
        "translation": "For the universal benefit of all sentient beings, these bodhisattvas' actions are the highest; thus, I've explained the third ground based on its meaning.\"",
        "source": "T10n0287_003:0547b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩發光地第三竟",
        "translation": "This is the end of the third ground of the bodhisattva's radiant body.",
        "source": "T10n0287_003:0547c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩焰慧地第四",
        "translation": "fourth stage of the bodhisattva's burning wisdom",
        "source": "T10n0287_003:0547c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛子聞此廣大行，　　可樂深妙殊勝法；　心皆勇悅大歡喜，　　普散眾花供養佛。",
        "translation": "When the Buddha's disciples hear about this vast practice, they rejoice in the profundity and excellence of the Dharma that's pleasing to them, and they rejoice greatly as they scatter flowers in offerings to the Buddha.",
        "source": "T10n0287_003:0547c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　演說如是妙法時，　　大地海水皆震動；　一切天女咸歡喜，　　悉吐妙音同讚歎。",
        "translation": "When he teaches this wonderful Dharma, the earth and sea tremble, and all the goddesses rejoice as they utter exquisite sounds in praise.",
        "source": "T10n0287_003:0547c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自在天王大欣慶，　　雨摩尼寶供養佛；　讚言：「佛為我出興，　　演說第一功德行；　如是智者諸地義，　　於百千劫甚難遇。",
        "translation": "Rejoicing greatly, the Ācārya King rained down maṇi treasures to offer to the Buddha, praising him, \"The Buddha arises for me, expounding the most excellent meritorious conduct; such is the doctrine of the stages of wisdom that's so difficult to encounter in a hundred thousand eons.",
        "source": "T10n0287_003:0547c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今忽然而得聞，　　菩薩勝行妙法音；　願更演說聰慧者，　　後決定地無餘道；　利益一切諸大眾，　　此諸佛子皆樂聞。」",
        "translation": "Now, I've suddenly come to hear the wonderful Dharma voice of the bodhisattva's superior practices; may he further explain it to you, the wise one, and then determine the stages without remainder; for the benefit of all the people, these Buddha-children are all delighted to hear it.\"",
        "source": "T10n0287_003:0547c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勇猛大心解脫月，　　請金剛藏言：「佛子！",
        "translation": "The moon of liberation with a fierce, great heart asked Vajragarbha, \"Son of the Buddha!",
        "source": "T10n0287_003:0547c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從此轉入第四地，　　所有行相願宣說。」",
        "translation": "From here, he turns into the fourth ground and vows to explain all his deeds.\"",
        "source": "T10n0287_003:0547c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，金剛藏菩薩告眾菩薩言：「唯諸佛子！",
        "translation": "At that point, the Vajragarbha Bodhisattva addressed the bodhisattvas, saying, \"Only the buddhas!",
        "source": "T10n0287_003:0547c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是菩薩，第三地明善清淨已，欲入菩薩第四智地，當以十種法明而入。",
        "translation": "\"If a bodhisattva wants to enter the fourth bodhisattva ground of wisdom after his third ground is well-purified with insight, he should enter it with ten kinds of insight about the Dharma.",
        "source": "T10n0287_003:0547c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0287_003:0547c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：以有情界思察明入，以諸世界思察明入，以真法界思察明入，以虛空界思察明入，以識界思察明入，以欲界思察明入，以色界思察明入，以無色界思察明入，以妙意樂勝解界思察明入，以廣大意樂勝解界思察明入，菩薩以此十法明入昇第四地。",
        "translation": "They are: perceiving and insightfully entering the realm of sentient beings, perceiving and insightfully entering the worlds, perceiving and insightfully entering the true Dharma realm, perceiving and insightfully entering the space realm, perceiving and insightfully entering the consciousness realm, perceiving and insightfully entering the desire realm, perceiving and insightfully entering the form realm, perceiving and insightfully entering the formless realm, perceiving and insightfully entering the realm of sublime aspiration, and perceiving and insightfully entering the realm of sublime aspiration in its broadest extent, by which the bodhisattva perceives and insights into these ten factors and ascends to the fourth ground.",
        "source": "T10n0287_003:0547c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the children of the Buddha!",
        "source": "T10n0287_003:0547c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩纔得焰慧地已，則由十種智成熟法，長如來家得彼體法。",
        "translation": "Once a bodhisattva has first attained the stage of burning wisdom, then by maturing ten kinds of wisdom, he'll grow up in the Tathāgata's household and attain its essential dharma.",
        "source": "T10n0287_003:0547c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T10n0287_003:0547c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：由意樂不退轉故，於三寶中不壞淨信，至究竟故，觀察諸行生滅性故，觀辯諸法性不起故，觀世間成壞故，觀業有生有死故，觀生死涅槃故，觀有情剎業故，觀前際後際故，觀無性無盡故。",
        "translation": "That is, it's because their aspirations don't change, their faith in the Three Treasures remains undiminished and pure until the ultimate end, because they examine the nature of the arising and ceasing of conditioned phenomena, because they contemplate the nature of things that don't arise, because they observe the formation and decay of the world, because they observe that actions are born and die, because they observe birth-and-death nirvāṇa, because they observe the manifest activity of sentient beings, because they observe the past and future, and because they observe that the nature of nothingness is inexhaustible.",
        "source": "T10n0287_003:0547c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the children of the Buddha!",
        "source": "T10n0287_003:0548a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就如是十種智成熟法，長如來家得彼體法。",
        "translation": "When a bodhisattva has accomplished these ten kinds of wisdom and matured them, he'll grow up in the Tathāgata's household and attain their essence.",
        "source": "T10n0287_003:0548a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，諸佛子！",
        "translation": "\"Furthermore, fellow buddhas!",
        "source": "T10n0287_003:0548a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此焰慧地時，隨於內身住循身觀，熾然精進正知具念除世貪憂；隨於外身住循身觀，熾然精進正知具念除世貪憂；隨內外身住循身觀，熾然精進正知具念除世貪憂；於內受、於外受、於內外受亦復如是；於內心、於外心、於內外心亦復如是；隨於內法住循法觀，熾然精進正知具念除世貪憂；隨於外法住循法觀，熾然精進正知具念除世貪憂；隨內外法住循法觀，熾然精進正知具念除世貪憂。",
        "translation": "菩薩住此焰慧地時，隨於內身住循身觀，熾然精進正知具念除世貪憂；隨於外身住循身觀，熾然精進正知具念除世貪憂；隨內外身住循身觀，熾然精進正知具念除世貪憂；於內受、於外受、於內外受亦復如是；於內心、於外心、於內外心亦復如是；隨於內法住循法觀，熾然精進正知具念除世貪憂；隨於外法住循法觀，熾然精進正知具念除世貪憂；隨內外法住循法觀，熾然精進正知具念除世貪憂。",
        "source": "T10n0287_003:0548a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩於諸未生惡不善法，為不生故，生欲策勵發起精勤策心持心；於諸已生惡不善法，為永斷故，生欲策勵發起精勤策心持心；於未生善法為令生故，生欲策勵發起精勤策心持心；於已生善法為令安住不忘，增廣倍修滿故，生欲策勵發起精勤策心持心。",
        "translation": "\"Furthermore, in order to prevent the arising of bad and unskillful qualities that have yet to arise, the bodhisattva generates desires that encourage and produces diligent attentiveness and maintenance of mind; in order to permanently end bad and unskillful qualities that have already arisen, he generates desires that encourage and produces diligent attentiveness and maintenance of mind; in order to cause the arising of good qualities that have yet to arise, he generates desires that encourage and produces diligent attentiveness and maintenance of mind; and in order to cause the good qualities that have already arisen to remain stable and not be forgotten, he increases and multiplies their cultivation and completion, he generates desires that encourage and produces diligent attentiveness and maintenance of mind.",
        "source": "T10n0287_003:0548a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩修欲等持斷行成就神足，依離、依無染、依滅迴向捨；修勤等持斷行成就神足，依離、依無染、依滅迴向捨；修心等持斷行成就神足，依離、依無染、依滅迴向捨；修觀等持斷行成就神足，依離、依無染、依滅迴向捨。",
        "translation": "Furthermore, the bodhisattva's spiritual accomplishment of the practice of stopping such cultivation of desire depends on seclusion, reliance on undefiledness, and indifference to cessation; the spiritual accomplishment of the practice of stopping such cultivation of diligence depends on seclusion, reliance on undefiledness, and indifference to cessation; the spiritual accomplishment of the practice of stopping such cultivation of mind depends on seclusion, reliance on undefiledness, and indifference to cessation; and the spiritual accomplishment of the practice of stopping such cultivation of contemplation depends on seclusion, reliance on undefiledness, and indifference to cessation.",
        "source": "T10n0287_003:0548a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩修信根，依離、依無染、依滅迴向捨；修精進根，依離、依無染、依滅迴向捨；修念根，依離、依無染、依滅迴向捨；修定根，依離、依無染、依滅迴向捨；修慧根，依離、依無染、依滅迴向捨。",
        "translation": "Furthermore, bodhisattvas cultivate the faculty of faith, relying on seclusion, lack of defilement, and cessation and indifference; they cultivate the faculty of effort, relying on seclusion, lack of defilement, and cessation and indifference; they cultivate the faculty of mindfulness, relying on seclusion, lack of defilement, and cessation and indifference; they cultivate the faculty of concentration, relying on seclusion, lack of defilement, and cessation and indifference; and they cultivate the faculty of wisdom, relying on seclusion, lack of defilement, and cessation and indifference.",
        "source": "T10n0287_003:0548a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩修信力，依離、依無染、依滅迴向捨；修精進力，依離、依無染、依滅迴向捨；修念力，依離、依無染、依滅迴向捨；修定力，依離、依無染、依滅迴向捨；修慧力，依離、依無染、依滅迴向捨。",
        "translation": "\"Furthermore, bodhisattvas cultivate the power of faith, relying on seclusion, lack of defilement, and cessation and indifference; they cultivate the power of effort, relying on seclusion, lack of defilement, and cessation and indifference; they cultivate the power of mindfulness, relying on seclusion, lack of defilement, and cessation and indifference; they cultivate the power of concentration, relying on seclusion, lack of defilement, and cessation and indifference; and they cultivate the power of wisdom, relying on seclusion, lack of defilement, and cessation and indifference.",
        "source": "T10n0287_003:0548b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩修念等覺支，依離、依無染、依滅迴向捨；修擇法等覺支，依離、依無染、依滅迴向捨；修精進等覺支，依離、依無染、依滅迴向捨；修喜等覺支，依離、依無染、依滅迴向捨；修輕安等覺支，依離、依無染、依滅迴向捨；修定等覺支，依離、依無染、依滅迴向捨；修捨等覺支，依離、依無染、依滅迴向捨。",
        "translation": "復次，菩薩修念等覺支，依離、依無染、依滅迴向捨；修擇法等覺支，依離、依無染、依滅迴向捨；修精進等覺支，依離、依無染、依滅迴向捨；修喜等覺支，依離、依無染、依滅迴向捨；修輕安等覺支，依離、依無染、依滅迴向捨；修定等覺支，依離、依無染、依滅迴向捨；修捨等覺支，依離、依無染、依滅迴向捨。",
        "source": "T10n0287_003:0548b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩修正見，依離、依無染、依滅迴向捨；修正念，依離、依無染、依滅迴向捨；修正思惟，依離、依無染、依滅迴向捨；修正語，依離、依無染、依滅迴向捨；修正業，依離、依無染、依滅迴向捨；修正命，依離、依無染、依滅迴向捨；修正精進，依離、依無染、依滅迴向捨；修正定，依離、依無染、依滅迴向捨；修正慧，依離、依無染、依滅迴向捨。",
        "translation": "復次，菩薩修正見，依離、依無染、依滅迴向捨；修正念，依離、依無染、依滅迴向捨；修正思惟，依離、依無染、依滅迴向捨；修正語，依離、依無染、依滅迴向捨；修正業，依離、依無染、依滅迴向捨；修正命，依離、依無染、依滅迴向捨；修正精進，依離、依無染、依滅迴向捨；修正定，依離、依無染、依滅迴向捨；修正慧，依離、依無染、依滅迴向捨。",
        "source": "T10n0287_003:0548b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩修此菩提分法，但於一切諸有情界有悲戀故，引發本願所扶持故，以大悲愍為先導故，成就大慈故，緣慮一切智者智故，引發佛剎諸莊嚴故，引發如來力、無所畏、不共佛法、相好言音故，希求後後殊勝法故，隨順甚深解脫佛法所聞行故，觀察廣大方便善巧故。",
        "translation": "When a bodhisattva cultivates this aspect of enlightenment, it's only because he has compassion for all sentient beings, arouses support from his original vows, leads with great compassion, accomplishes great kindness, considers the knowledge of all knowables, arouses the adornment of buddha bases, arouses the Tathāgata's power, fearlessness, and the distinctive qualities of buddhas and their characteristics, speaks and sounds, seeks subsequent excellence, follows the practices heard from the Buddha's teaching of profound liberation, and observes the skillfulness of vast methods.",
        "source": "T10n0287_003:0548b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "\"Only the children of the Buddha!",
        "source": "T10n0287_003:0548b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此焰慧地時，所有微細身見等惑，謂我、有情、命者、育者、士夫數取趣，蘊、界、處執，所起動亂思惟伺察，護持攝受畜積著處，如是一切皆悉遠離。",
        "translation": "When a bodhisattva abides in this burning wisdom ground, all the subtle afflictions of body views, such as attachment to self, sentient beings, beings of life, nurturers, and men, attachment to aggregates, elements, and fields, the disturbing thoughts and investigations that arise, and the places where attachments are accumulated that are guarded, collected, and accepted are all completely abandoned.",
        "source": "T10n0287_003:0548b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有一切不應作業，諸佛所訶、雜染所引，如是一切皆悉捨離。",
        "translation": "All that should not be done, that the buddhas reprimand, and that defilement leads to, such as these, are all completely abandoned.",
        "source": "T10n0287_003:0548b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有應作能順菩薩正行資糧，一切如來讚美之業，皆悉受行。",
        "translation": "All the things that should be done to provide the bodhisattvas with the necessary accumulation of right conduct and all the actions that are praised by the Tathāgata will be accepted and performed.",
        "source": "T10n0287_003:0548b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，展轉為菩薩道得圓滿故，如如方便慧所引發，修諸道支如是如是，得滋潤心柔和之忍，有堪能心，引利樂心，無雜染心，訪求後後殊勝法心，希勝智心，能救一切世間之心，尊重隨順諸師長心，如所聞法而修行心；又善知恩善知報恩，其心調和共住安樂，質直柔軟無稠林行無誑無慢，善順語者右受教誨，菩薩如是安忍成就、調伏成就、寂滅成就。",
        "translation": "Furthermore, in order to carry out the bodhisattva's path to its completion, he cultivates the factors of the path as such, attains the patience of a nurturing mind that's gentle, has a mind that's capable, leads to happiness, has no defilement, seeks subsequent superior qualities, has a mind with rare knowledge, is able to save all the world, respects and follows the minds of teachers and leaders, cultivates the practice of the Dharma as heard, and well knows kindness and well knows the repayment of kindness, lives in harmony and comfort with his mind, is straightforward and gentle, has no dense forests, practices without deceit or conceit, and rightly accepts the instruction of those who speak well, thus accomplishing the bodhisattva's patience, accomplishing his submission, and accomplishing his quiescence.",
        "source": "T10n0287_003:0548c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是忍調寂滅成就思惟現行，能淨上地諸業之時，獲大精進無有休息，不雜染精進、不退轉精進、廣大精進、無邊精進、熾然精進、無等精進、無映奪精進、成熟一切有情精進、善分別道非道精進。",
        "translation": "When he thus perceives the accomplishment of patience, control, and extinction, he's able to purify the activities of the higher stages and attain great effort without rest, undefiled effort, irreversible effort, vast effort, limitless effort, fiery effort, unequalled effort, unreflected effort, effort to mature all sentient beings, and effort to skillfully discriminate between path and non-path.",
        "source": "T10n0287_003:0548c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此菩薩善意樂界轉更清淨，增上意樂界不遺失，勝解明利善根得淨，離世垢濁斷諸疑惑，無疑之性現前具足證喜輕安，如來加持而得現前，無量心意樂皆悉成就。",
        "translation": "Furthermore, this bodhisattva's realm of good intentions becomes purer and purer, the realm of superior intentions isn't lost, the good roots of superior understanding and insight are purified, the defilements of the world are removed, the nature of no doubt is present and complete, joy and lightheartedness are realized, the Tathāgata's blessing is made manifest, and measureless mental pleasures are fully achieved.",
        "source": "T10n0287_003:0548c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩住此焰慧地中，以廣大見及以願力，現見多佛、多百佛、多千佛、多百千佛、多百千那庾多佛、多俱胝佛、多百俱胝佛、多千俱胝佛、多百千俱胝佛、多百千俱胝那庾多佛。",
        "translation": "\"While abiding in this burning ground of wisdom, the bodhisattva, with a vast vision and the power of his vow, now sees many buddhas, hundreds of buddhas, thousands of buddhas, hundreds of thousands of buddhas, hundreds of thousands of nayuta buddhas, many corpuscles, hundreds of corpuscles, thousands of corpuscles, hundreds of thousands of corpuscles, and hundreds of thousands of corpuscles of nayuta buddhas.",
        "source": "T10n0287_003:0548c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見是如來、應供、正等覺已，悉以廣大增上意樂，恭敬、尊重、承事、供養，奉施衣服、飲食、臥具、病緣醫藥諸資生具，奉獻菩薩諸妙樂具，於僧伽眾而作恭敬，以此善根迴向無上正等菩提，殷重奉事諸佛如來，於其佛所恭敬聽法。",
        "translation": "After seeing this Tathāgata, Worthy of Offerings, and Completely Enlightened, the bodhisattva all respects, honors, serves, and makes offerings with vast and intensified aspirations, bestows clothing, food, bedding, necessities for illness, and medicines, dedicates the bodhisattva's wonderful implements of joy, pays respect to the saṃgha community, dedicates this good root to unsurpassed perfect enlightenment, respectfully serves the Tathāgatas, and respectfully listens to the Dharma in their buddha-places.",
        "source": "T10n0287_003:0548c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞已受持，隨分修行多分，於彼諸佛聖教淨信出家，於此菩薩所有意樂增上意樂，勝解平等性轉復清淨。",
        "translation": "After hearing and upholding them, he cultivates their practice in measure, purifies his faith in the holy teachings of those buddhas, leaves home, and increases his aspiration for the happiness of this bodhisattva, and the equality of his resolve is purified once again.",
        "source": "T10n0287_003:0548c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩住此焰慧地已，復更無量百千俱胝那庾多劫，此之意樂勝解平等清淨而住，所有善根轉復熾然轉更明淨。",
        "translation": "\"After the bodhisattva abides in this burning ground of wisdom for measureless hundreds of thousands of koṭīs of nayuta eons, his aspirations for superior understanding and equality of mind are purified and his good roots become more vigorous and clearer.",
        "source": "T10n0287_003:0548c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the children of the Buddha!",
        "source": "T10n0287_003:0549a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧金師，以所鍊金作莊嚴具，非餘未作莊嚴具金之所映奪。",
        "translation": "\"Suppose a master goldsmith makes an ornament of gold that's been coined, so that it's not reflected in other gold that hasn't been made into an ornament.",
        "source": "T10n0287_003:0549a03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the children of the Buddha!",
        "source": "T10n0287_003:0549a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩安住焰慧地中亦復如是，所有善根，非餘安住下地菩薩所有善根而能映奪。",
        "translation": "\"So it is when a bodhisattva stands in the ground of burning wisdom, and the good roots he possesses can't be reflected by the good roots of other bodhisattvas who stand in the lower ground.",
        "source": "T10n0287_003:0549a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸佛子！",
        "translation": "\"Again, children of the Buddha!",
        "source": "T10n0287_003:0549a07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如摩尼寶清淨光輪所放光明，非餘寶珠所能映奪，所放光明一切世間風水雨等不能斷滅。",
        "translation": "Like a maṇi-jeweled wheel of pure light that emits a radiance that can't be reflected by other precious jewels, the radiance it emits can't be stopped by all the world's winds, rivers, rain, and so forth.",
        "source": "T10n0287_003:0549a07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the children of the Buddha!",
        "source": "T10n0287_003:0549a09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此焰慧地時亦復如是，非餘安住下地菩薩能所映奪，所有慧光，一切魔怨煩惱現行不能斷滅。",
        "translation": "\"So it is when a bodhisattva abides in this burning ground of wisdom, not when another bodhisattva abiding in a lower ground is able to reflect or be reflected by all the wisdom that can't be extinguished by the manifestation of all the Māra's hostile afflictions.",
        "source": "T10n0287_003:0549a09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此菩薩四攝事中同事偏多，十到彼岸中精進到彼岸而得增上，餘到彼岸隨力隨分非不修行。",
        "translation": "However, this bodhisattva's colleagues in the four collectives are partial and numerous, and he makes effort to reach the other shore among the ten shores and attains superiority, while the others reach the other shore according to their strength and according to their part, not without cultivation.",
        "source": "T10n0287_003:0549a12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "\"Only the children of the Buddha!",
        "source": "T10n0287_003:0549a14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名略說菩薩第四焰慧智地。",
        "translation": "This is called the fourth ground of the bodhisattva's knowledge of burning wisdom, as outlined here.",
        "source": "T10n0287_003:0549a14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住此第四地中，受生多作蘇夜摩天王，有自在力善化有情，令其除滅薩迦邪見，能令有情安住正見。",
        "translation": "When a bodhisattva abides in this fourth ground, he's often reborn as the Suyāma Heavenly Kings, who have the sovereign power to skillfully teach sentient beings, cause them to cease their mistaken views of the sāṅkhyas, and enable them to abide in right view.",
        "source": "T10n0287_003:0549a15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所作業或以布施、或以愛語、或以利行、或以同事，此等一切悉皆不離佛作意、法作意、僧伽作意、菩薩作意、菩薩行作意、到彼岸作意、諸地作意、佛力作意、無所畏作意、佛不共法作意，乃至不離一切行相勝妙相應一切智智作意。",
        "translation": "Whether it's by generosity, by loving words, by beneficial actions, or by coworkers, none of these things are free from the contemplation of buddhas, the contemplation of the Dharma, the contemplation of the saṃgha, the contemplation of bodhisattvas, the contemplation of bodhisattva practices, the contemplation of reaching the other shore, the contemplation of the stages, the contemplation of the power of buddhas, the contemplation of being fearless, the contemplation of the Buddha's distinctive qualities, or the contemplation of the knowledge of all forms of conduct that are excellent and marvelous together.",
        "source": "T10n0287_003:0549a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作願言：『我當一切諸有情中為首、為勝、為殊勝、為妙、為微妙、為上、為無上、為導、為將、為帥，乃至願得一切智智所依止處。』",
        "translation": "Again, he makes the vow, saying, 'I will be the leader, superior, exceptional, marvelous, subtle, superior, unsurpassed, guide, general, and commander of all sentient beings, and I hope to attain the basis of the knowledge of all things.'",
        "source": "T10n0287_003:0549a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若樂發起如是精進，由是精進，一剎那頃瞬息須臾，能證俱胝諸三摩地見俱胝佛。",
        "translation": "If someone happily initiates such effort, they'll be able to realize a momentary instant, in a single moment, a koṭī of samādhi and see a koṭī of buddhas because of that effort.",
        "source": "T10n0287_003:0549a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛加持皆能解了，能動俱胝世界，能往俱胝佛剎，能照俱胝世界，能成熟俱胝有情，能住壽俱胝劫，於前後際能入俱胝劫，能正思擇俱胝法門，能示現俱胝身，身身皆能現俱胝菩薩眷屬圍遶。",
        "translation": "They understand all of the buddha's blessings, move the corpuscular world, travel to the corpuscular buddha-base, illuminate the corpuscular world, mature sentient beings, live for a corpuscular eon, enter a corpuscular eon both before and after, correctly contemplate the corpuscular teaching, reveal the corpuscular body, and are surrounded by the corpuscular bodhisattva's retinue in body and in body.",
        "source": "T10n0287_003:0549a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從此以上，是諸菩薩有願力者，由勝願故，所有遊戲，或身、或光明、或神通、或眼、或境界、或音聲、或行、或莊嚴、或勝解、或所作，此等乃至爾所百千俱胝那庾多劫，不易可數。」",
        "translation": "From here on out, these bodhisattvas have the power of their vows, and because of their excellent vows, their play, whether it's body, light, superknowledge, eyes, objects, sounds, actions, adornment, superior understanding, or deeds, such as these up to the one hundred thousand koṭīnaya eons that exist here can't be easily counted.\"",
        "source": "T10n0287_003:0549b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛藏菩薩，欲重宣此義而說頌言：「菩薩已淨第三地，　　次觀有情世法界、　空、識、欲、色、無色界，　　勝大意樂能趣入。",
        "translation": "Vajragarbha Bodhisattva then wanted to reiterate this meaning and spoke in verse, \"After purifying the third ground, the bodhisattva perceives the worldly reality realm of sentient beings, emptiness, consciousness, desire, form, and the formless realm, and has the ability to enter them with great resolve.",
        "source": "T10n0287_003:0549b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩纔登焰慧地，　　長如來家永不退；　於佛、法、僧信不壞，　　觀法生滅無生起，　觀世成壞業有生，　　生死、涅槃剎等業；　觀前後際無性盡，　　如是修行長佛家。",
        "translation": "As a bodhisattva rises just a little further into the land of burning wisdom, he'll continue to call on the family of the Tathāgata and never retrogress; his faith in the Buddha, Dharma, and Saṃgha won't break down; he'll observe that dharmas arise and cease without being produced; he'll observe that actions of formation and decay in the world are produced; he'll observe that the past and future are endless; and he'll thus cultivate the long Buddhahood.",
        "source": "T10n0287_003:0549b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得是法已增慈愍，　　轉更勤修四念住；　身、受、心、法內外觀，　　世間貪愛皆除遣。",
        "translation": "After attaining this teaching, he increases his compassion, further diligently cultivates the four abodes of mindfulness, which are the internal appearance of body, feeling, mind, and dharmas, and which rid the world of craving.",
        "source": "T10n0287_003:0549b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩修治四正斷，　　惡法除滅善增長；　善修神足及根、力，　　七等覺支、八聖道。",
        "translation": "Cultivating the four correct eliminations, the bodhisattva removes bad qualities and increases goodness, skillfully cultivates spiritual abilities, faculties, and powers, and cultivates the seven branches of virtual enlightenment and the eight noble paths.",
        "source": "T10n0287_003:0549b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為度有情修覺分，　　本願扶持慈悲首；　求一切智嚴佛土，　　亦緣如來十種力，　四無所畏不共法，　　殊特相好深美音；　亦求妙道解脫處，　　尋大方便修覺分。",
        "translation": "They cultivate the factors of awakening for the salvation of sentient beings, support the chief of compassion in their original vow, seek the omniscience that adorns the Buddha-lands, also take the Tathāgata's ten powers as reference, the four fearless and unique qualities, the profound beauty of their special features, and their voice; they also seek the marvelous path to liberation and cultivate the factors of awakening with great skillful means.",
        "source": "T10n0287_003:0549b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身見為首六十二，　　我及我所無量種；　蘊、界、處等諸取著，　　第四地中悉遠離；　如來所訶煩惱雜，　　無義之業皆捨離。",
        "translation": "With the view of the body as the first of the sixty-two, there are measureless kinds of self and what belongs to self; the attachments to aggregates, elements, and fields are all removed in the fourth ground; the afflictions and defilements that the Tathāgata disposes of are all abandoned as meaningless actions.",
        "source": "T10n0287_003:0549b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛所讚清淨業，　　為度有情無不作；　菩薩勤修不懈怠，　　即得十心皆具足。",
        "translation": "The pure activities praised by the buddhas are not uncommonly performed to save sentient beings; bodhisattvas diligently cultivate them without laziness, and they attain the full possession of all ten mental states.",
        "source": "T10n0287_003:0549b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　專求佛道無厭倦，　　希受灌頂度有情；　恭敬尊德修法行，　　知恩易悔無慍暴。",
        "translation": "They never tire of devoting themselves to seeking the Buddha's path, hoping to receive the consecration to save sentient beings, honoring venerable virtue and cultivating the practice of the Dharma, knowing kindness and easily repenting without being unreasonable.",
        "source": "T10n0287_003:0549b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨慢離諂心調柔，　　轉更精勤不退轉；　又其意樂界清淨，　　增上意樂永不失。",
        "translation": "They abandon conceit, rid themselves of flattery, and become more diligent without turning back; their intentions and realms of pleasure are purified, and their superior intentions are never lost.",
        "source": "T10n0287_003:0549b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勝解決定善根增，　　疑網垢濁悉永離；　無疑現前得喜安，　　蒙佛加持無量志。",
        "translation": "Their resolve is resolute, their good roots increase, and the stain of the web of doubt is permanently removed; without doubt, they are now delighted and at ease, and they receive the Buddha's blessing with measureless aspirations.",
        "source": "T10n0287_003:0549c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩住此焰慧地，　　供那庾多無量佛；　聽聞正法亦出家，　　不可映奪如金飾。",
        "translation": "The bodhisattva abides in this burning ground of wisdom, making offerings to the measureless buddhas ofayuṭa; he hears the right teaching and leaves home, and it can't be reflected or refuted like gold jewelry.",
        "source": "T10n0287_003:0549c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩住此具功德，　　以智方便修行道；　不為眾魔心退轉，　　譬如妙寶無能壞。",
        "translation": "The bodhisattva abides here with replete virtue, cultivating the path with wisdom and skillful means; he doesn't let the minds of many demons falter, like a marvelous treasure that can't be destroyed.",
        "source": "T10n0287_003:0549c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多作夜摩天中王，　　於法自在眾所尊；　普化群生除惡見，　　專求佛智修善業。",
        "translation": "He often acts as the king of the Yama gods, is unimpeded in regard to the Dharma, is honored by many, universally transforms sentient beings, removes bad views, and focuses on seeking the Buddha's wisdom and cultivating good actions.",
        "source": "T10n0287_003:0549c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩勤加精進力，　　獲等持等俱胝數；　若以願智力所為，　　過於此數無能算。",
        "translation": "With the power of diligent effort, a bodhisattva attains a number as great as that of the equipoise; if he did so with the power of his vow, there's nothing that could be calculated beyond that number.",
        "source": "T10n0287_003:0549c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是菩薩第四地，　　所行精進微妙道；　功德義智共相應，　　我為佛子已宣說。」",
        "translation": "Thus, in the fourth ground, the subtle path of effort practiced by a bodhisattva is matched by the knowledge of virtues and meanings, which I've explained for the Buddha's son.\"",
        "source": "T10n0287_003:0549c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說十地經卷第三",
        "translation": "Foshuo shidi jing, vol. 3",
        "source": "T10n0287_003:0549c14_0",
        "is_bad_quality": false
    }
]