[
    {
        "source_sentence": "大方廣佛華嚴經卷第六十四",
        "translation": "Dafangguangfo huayan jing roll 64",
        "source": "T10n0279_064:0343a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "Translated by the Bhikṣuṇī of Khotan, the Tripiṭaka of Khotan",
        "source": "T10n0279_064:0343a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入法界品第三十九之五",
        "translation": "Chapter 39-5 of the Sutra on Entry into the Realm of Reality",
        "source": "T10n0279_064:0343a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子蒙善知識力，依善知識教，念善知識語，於善知識深心愛樂，作是念言：「因善知識，令我見佛；因善知識，令我聞法。",
        "translation": "At the time, the boy of good fortune, having been empowered by a good teacher, relied on the good teacher's teaching, recollected the good teacher's words, and was deeply delighted by the good teacher, had this thought, \"A good teacher made me see the Buddha, and a good teacher made me hear the Dharma.",
        "source": "T10n0279_064:0343a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者是我師傅，示導於我諸佛法故；善知識者是我眼目，令我見佛如虛空故；善知識者是我津濟，令我得入諸佛如來蓮華池故。」",
        "translation": "A good teacher is my teacher who shows me the Dharma of the buddhas, a good teacher is my eyes that allow me to see the buddhas as empty space, and a good teacher is my subsidy that allows me to enter the lotus-pond of the Tathāgatas.\"",
        "source": "T10n0279_064:0343a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸漸南行，至海潮處，見普莊嚴園，眾寶垣牆周匝圍遶，一切寶樹行列莊嚴；一切寶華樹，雨眾妙華，布散其地；一切寶香樹，香氣氛氳，普熏十方；一切寶鬘樹，雨大寶鬘，處處垂下；一切摩尼寶王樹，雨大摩尼寶，遍布充滿；一切寶衣樹，雨種種色衣，隨其所應，周匝敷布；一切音樂樹，風動成音，其音美妙，過於天樂；一切莊嚴具樹，各雨珍玩奇妙之物，處處分布，以為嚴飾。",
        "translation": "He gradually traveled south and reached the ocean tide and saw the Puṇḍaravana Park, which was surrounded by a wall of treasures and adorned by a procession of all the precious trees; all the precious flower trees that rained down multitudes of marvelous flowers that spread out over the ground; all the precious incense trees that fragrantly perfumed the ten directions; all the precious garland trees that rained down great precious garlands that hung down everywhere; all the maṇi-jewel king trees that rained down great maṇi-jewels that filled the whole place; all the precious robe trees that rained down various kinds of robe that were spread out around according to their desires; all the music trees that produced sounds from the wind that were more beautiful than the music of the gods; and all the ornaments trees that rained down treasures and wonderful things that were distributed everywhere to adorn the place.",
        "source": "T10n0279_064:0343a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地清淨無有高下，於中具有百萬殿堂，大摩尼寶之所合成；百萬樓閣，閻浮檀金以覆其上；百萬宮殿，毘盧遮那摩尼寶間錯莊嚴；一萬浴池，眾寶合成；七寶欄楯，周匝圍遶；七寶階道，四面分布；八功德水，湛然盈滿，其水香氣如天栴檀，金沙布底，水清寶珠周遍間錯；鳧鴈、孔雀、俱枳羅鳥遊戲其中，出和雅音；寶多羅樹周匝行列，覆以寶網，垂諸金鈴，微風徐搖，恒出美音；施大寶帳，寶樹圍遶，建立無數摩尼寶幢，光明普照百千由旬。",
        "translation": "其地清淨無有高下，於中具有百萬殿堂，大摩尼寶之所合成；百萬樓閣，閻浮檀金以覆其上；百萬宮殿，毘盧遮那摩尼寶間錯莊嚴；一萬浴池，眾寶合成；七寶欄楯，周匝圍遶；七寶階道，四面分布；八功德水，湛然盈滿，其水香氣如天栴檀，金沙布底，水清寶珠周遍間錯；鳧鴈、孔雀、俱枳羅鳥遊戲其中，出和雅音；寶多羅樹周匝行列，覆以寶網，垂諸金鈴，微風徐搖，恒出美音；施大寶帳，寶樹圍遶，建立無數摩尼寶幢，光明普照百千由旬。",
        "source": "T10n0279_064:0343a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中復有百萬陂池，黑栴檀泥凝積其底，一切妙寶以為蓮華敷布水上，大摩尼華光色照耀園中。",
        "translation": "There's also a million reservoirs in it, with black sandalwood clay puddled at the bottom, and all the marvelous treasures are spread out on the water as lotus flowers, and the color of the great maṇi-flower light shines through the garden.",
        "source": "T10n0279_064:0343b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有廣大宮殿，名：莊嚴幢，海藏妙寶以為其地，毘瑠璃寶以為其柱，閻浮檀金以覆其上，光藏摩尼以為莊嚴，無數寶王光焰熾然，重樓挾閣種種莊飾；阿盧那香王、覺悟香王，皆出妙香普熏一切。",
        "translation": "There's also a vast palace called the Adorned Banner, with a floor made of the ocean's store of marvelous treasures, pillars made of beryl, a roof of jambū gold, a mani-pura of light that adorns it, a blazing light from countless jeweled kings, and a pavilion decorated with many different kinds of decorations, as well as the fragrance kings of Alunar and Enlightenment, which all emit a wonderful fragrance that thoroughly perfumes everything.",
        "source": "T10n0279_064:0343b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其宮殿中，復有無量寶蓮華座周迴布列，所謂：照耀十方摩尼寶蓮華座、毘盧遮那摩尼寶蓮華座、照耀世間摩尼寶蓮華座、妙藏摩尼寶蓮華座、師子藏摩尼寶蓮華座、離垢藏摩尼寶蓮華座、普門摩尼寶蓮華座、光嚴摩尼寶蓮華座、安住大海藏清淨摩尼王寶蓮華座、金剛師子摩尼寶蓮華座。",
        "translation": "In the palace, there are also measureless jeweled lotus seats arranged in a circular pattern, called the Shining in the Ten Directions maṇi-jeweled lotus seat, the Vairocana maṇi-jeweled lotus seat, the Shining in the World maṇi-jeweled lotus seat, the Marvelous Store maṇi-jeweled lotus seat, the Shizi Store maṇi-jeweled lotus seat, the Free from Stain Store maṇi-jeweled lotus seat, the Universal Gate maṇi-jeweled lotus seat, the Radiant Adornment maṇi-jeweled lotus seat, the Abiding in the Great Ocean Store Pure maṇi-ruler maṇi-jeweled lotus seat, and the Vajra lion maṇi-jeweled lotus seat.",
        "source": "T10n0279_064:0343b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "園中復有百萬種帳，所謂：衣帳、鬘帳、香帳、華帳、枝帳、摩尼帳、真金帳、莊嚴具帳、音樂帳、象王神變帳、馬王神變帳、帝釋所著摩尼寶帳……如是等，其數百萬。",
        "translation": "There are also a million different kinds of canopies in the garden, called garment canopies, garland canopies, incense canopies, flower canopies, branch canopies, maṇi canopies, genuine gold canopies, ornamented cloth canopies, music canopies, elephant king miracle canopies, horse king miracle canopies, and maṇi-jeweled canopies worn by Indra...such and such, and they number in the millions.",
        "source": "T10n0279_064:0343b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有百萬大寶網彌覆其上，所謂：寶鈴網、寶蓋網、寶身網、海藏真珠網、紺瑠璃摩尼寶網、師子摩尼網、月光摩尼網、種種形像眾香網、寶冠網、寶瓔珞網……如是等，其數百萬。",
        "translation": "A million great nets of jewelry cover them, called the net of precious bells, the net of precious canopies, the net of precious bodies, the net of true pearls of the ocean store, the net of purple-glazed maṇi jewels, the net of lioness maṇi, the net of moon-lit maṇi, the net of incense from various images, the net of precious crowns, the net of precious jewelry ... such-and-such, and so on, numbering millions of them.",
        "source": "T10n0279_064:0343b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有百萬大光明之所照耀，所謂：焰光摩尼寶光明、日藏摩尼寶光明、月幢摩尼寶光明、香焰摩尼寶光明、勝藏摩尼寶光明、蓮華藏摩尼寶光明、焰幢摩尼寶光明、大燈摩尼寶光明、普照十方摩尼寶光明、香光摩尼寶光明……如是等，其數百萬。",
        "translation": "There are millions of great rays of light that shine, called the flaming maṇi-jeweled light, the moon-banner maṇi-jeweled light, the fragrant maṇi-jeweled light, the victorious store maṇi-jeweled light, the lotus store maṇi-jeweled light, the flaming banner maṇi-jeweled light, the great lamp maṇi-jeweled light, the maṇi-jeweled light that universally illuminates the ten directions, the fragrant maṇi-jeweled light ... such-and-such, and so on, which number in the millions.",
        "source": "T10n0279_064:0343b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常雨百萬莊嚴具，百萬黑栴檀香出妙音聲，百萬出過諸天曼陀羅華而以散之，百萬出過諸天瓔珞以為莊嚴，百萬出過諸天妙寶鬘帶處處垂下，百萬出過諸天眾色妙衣，百萬雜色摩尼寶妙光普照，百萬天子欣樂瞻仰頭面作禮，百萬采女於虛空中投身而下，百萬菩薩恭敬親近常樂聞法。",
        "translation": "Millions of adornments are always rained down, millions of black sandalwood incense emit wonderful sounds, millions of gods' maṇḍala flowers are produced and scattered, millions of gods' jewelry is produced and adorned, millions of gods' wonderfully colored garments are produced and draped everywhere, millions of gods' wonderfully colored robes are produced, millions of variegated maṇḍalas' wonderful light shines universally, millions of gods' children joyfully look up and bow with their heads, millions of women gatherers plunge down in the sky, and millions of bodhisattvas respectfully and intimately hear the Dharma with constant joy.",
        "source": "T10n0279_064:0343c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，休捨優婆夷坐真金座，戴海藏真珠網，冠挂出過諸天真金寶釧，垂紺青髮，大摩尼網莊嚴其首，師子口摩尼寶以為耳璫，如意摩尼寶王以為瓔珞，一切寶網垂覆其身，百千億那由他眾生曲躬恭敬。",
        "translation": "Upāsikā Āśvajit was sitting on a throne of genuine gold, wearing a true bejeweled net from the ocean treasury, wearing a crown that hung above the true gold-jeweled bracelets of the gods, with violet blue hair, a large mani-pedi adorning his head, a maṇi-jewel for his ears from his lion's mouth, a king of wish-granting maṇi-jewels for his jewelry, and all of the jeweled nets draped over his body, when hundreds of billions of beings from nayutas bowed down in respect.",
        "source": "T10n0279_064:0343c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方有無量眾生來詣其所，所謂：梵天、梵眾天、大梵天、梵輔天、自在天，乃至一切人及非人；南、西、北方，四維、上、下，皆亦如是。",
        "translation": "To the east, measureless sentient beings come to visit him, namely, the Brahma gods, the Brahmakāyika gods, the Brahma gods, the Paranirmitavaśavartin gods, and even all humans and non-humans, and so it is in the south, west, north, the four counterpoints, above, and below.",
        "source": "T10n0279_064:0343c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有見此優婆夷者，一切病苦悉得除滅，離煩惱垢，拔諸見刺，摧障礙山，入於無礙清淨境界，增明一切所有善根，長養諸根；入一切智慧門，入一切總持門；一切三昧門、一切大願門、一切妙行門、一切功德門，皆得現前；其心廣大，具足神通，身無障礙，至一切處。",
        "translation": "Anyone who sees this Upāsikā will be freed from all illness and pain, part with the stain of affliction, uproot the thorns of views, destroy mountains of obstacles, enter the unobstructed pure realm, increase awareness of all the good roots, nurture those roots, enter the gate of all wisdom, enter the gate of all mastery, and attain the manifestation of all the gates of samādhi, all the gates of great vows, all the gates of marvelous actions, and all the gates of merit; their mind is vast and fully endowed with supernormal powers, and their body is unobstructed, reaching everywhere.",
        "source": "T10n0279_064:0343c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子入普莊嚴園，周遍觀察，見休捨優婆夷坐於妙座，往詣其所，頂禮其足，遶無數匝，白言：「聖者！",
        "translation": "At the time, the Boy of Wealth entered the Ornament Park and looked around, saw Upāsikā Āśāsana sitting on a marvelous seat, went to him, bowed his head at his feet, circled him countless times, and said, \"Sage!",
        "source": "T10n0279_064:0343c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_064:0343c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_064:0343c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to guide and teach, so please explain it for me!\"",
        "source": "T10n0279_064:0343c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "休捨告言：「善男子！",
        "translation": "He told them, \"Good man!",
        "source": "T10n0279_064:0343c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯得菩薩一解脫門，若有見聞憶念於我，與我同住，供給我者，悉不唐捐。",
        "translation": "I have attained only the bodhisattva's single gate of liberation, so if anyone sees and hears about me, remembers me, lives with me, and makes offerings to me, they won't be spared.",
        "source": "T10n0279_064:0343c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_064:0343c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生不種善根，不為善友之所攝受，不為諸佛之所護念，是人終不得見於我。",
        "translation": "If sentient beings don't plant good roots, aren't taken in by good friends, and aren't guarded by the buddhas, that person will never see me.",
        "source": "T10n0279_064:0343c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_064:0344a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有眾生得見我者，皆於阿耨多羅三藐三菩提獲不退轉。",
        "translation": "If any sentient being were to see me, they'd attain irreversibility in the unsurpassed, correct enlightenment.",
        "source": "T10n0279_064:0344a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0344a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方諸佛常來至此，處於寶座為我說法；南、西、北方，四維、上、下，一切諸佛悉來至此，處於寶座為我說法。",
        "translation": "The buddhas of the east always come here and speak for me from their jeweled seats, and all the buddhas of the south, west, and north, the four counterpoints, the upper and lower, come here and speak for me from their jeweled seats.",
        "source": "T10n0279_064:0344a03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_064:0344a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常不離見佛聞法，與諸菩薩而共同住。",
        "translation": "I'll never part from seeing the Buddha and hearing the Dharma, and I'll dwell together with the bodhisattvas.",
        "source": "T10n0279_064:0344a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0344a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此大眾，有八萬四千億那由他，皆在此園與我同行，悉於阿耨多羅三藐三菩提得不退轉；其餘眾生住此園者，亦皆普入不退轉位。」",
        "translation": "Here in this great assembly of mine, there are 8,400,000,000,000 nayutas who are traveling with me in this park and have all attained irreversibility in the unsurpassed, correct, and complete enlightenment; all the other sentient beings who live in this park have also entered the stage of irreversibility.\"",
        "source": "T10n0279_064:0344a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「聖者發阿耨多羅三藐三菩提心為久近耶？」",
        "translation": "Sun Cai said, \"Has the noble one aroused the resolve to attain unsurpassed, correct enlightenment for a long time?\"",
        "source": "T10n0279_064:0344a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "They replied, \"Good sons!",
        "source": "T10n0279_064:0344a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我憶過去，於然燈佛所，修行梵行，恭敬供養，聞法受持；次前，於離垢佛所，出家學道，受持正法；次前，於妙幢佛所；次前，於勝須彌佛所；次前，於蓮華德藏佛所；次前，於毘盧遮那佛所；次前，於普眼佛所；次前，於梵壽佛所；次前，於金剛臍佛所；次前，於婆樓那天佛所。",
        "translation": "I remember a time in the past when I cultivated the religious practice, made offerings with respect, heard and upheld the teaching at Randana Buddha; the next time I left home, trained on the path, and upheld the right teaching at Vimalakīrti Buddha; the next time I went to Bhaiṣajyaguru Buddha; the next time I went to Padmasaṃbhava Buddha; the next time I went to Padmasaṃbhava Buddha; the next time I went to Vairocana Buddha; the next time I went to Universal Vision Buddha; the next time I went to Brahmā Life Buddha; the next time I went to Vajraśekhara Buddha; and the next time I went to Varuṇa Buddha.",
        "source": "T10n0279_064:0344a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_064:0344a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我憶過去，於無量劫無量生中，如是次第三十六恒河沙佛所，皆悉承事，恭敬供養，聞法受持，淨修梵行。",
        "translation": "I remember a time in the past when I served, venerated, made offerings to, heard the teachings, accepted, and purified the religious practice of the 36th Gaṅgāsaka Buddha in sequence over measureless eons and innumerable lifetimes.",
        "source": "T10n0279_064:0344a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此已往，佛智所知，非我能測。",
        "translation": "Since then, the Buddha's wisdom and knowledge have been unfathomable to me.",
        "source": "T10n0279_064:0344a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0344a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩初發心無有量，充滿一切法界故；菩薩大悲門無有量，普入一切世間故；菩薩大願門無有量，究竟十方法界故；菩薩大慈門無有量，普覆一切眾生故；菩薩所修行無有量，於一切剎一切劫中修習故；菩薩三昧力無有量，令菩薩道不退故；菩薩總持力無有量，能持一切世間故；菩薩智光力無有量，普能證入三世故；菩薩神通力無有量，普現一切剎網故；菩薩辯才力無有量，一音一切悉解故；菩薩清淨身無有量，悉遍一切佛剎故。」",
        "translation": "菩薩初發心無有量，充滿一切法界故；菩薩大悲門無有量，普入一切世間故；菩薩大願門無有量，究竟十方法界故；菩薩大慈門無有量，普覆一切眾生故；菩薩所修行無有量，於一切剎一切劫中修習故；菩薩三昧力無有量，令菩薩道不退故；菩薩總持力無有量，能持一切世間故；菩薩智光力無有量，普能證入三世故；菩薩神通力無有量，普現一切剎網故；菩薩辯才力無有量，一音一切悉解故；菩薩清淨身無有量，悉遍一切佛剎故。」",
        "source": "T10n0279_064:0344a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財童子言：「聖者久如當得阿耨多羅三藐三菩提？」",
        "translation": "The boy Śubhaji said, \"How long will the noble one attain unsurpassed, correct enlightenment?\"",
        "source": "T10n0279_064:0344b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "They replied, \"Good sons!",
        "source": "T10n0279_064:0344b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩不為教化調伏一眾生故發菩提心，不為教化調伏百眾生故發菩提心，乃至不為教化調伏不可說不可說轉眾生故發菩提心；不為教化一世界眾生故發菩提心，乃至不為教化不可說不可說轉世界眾生故發菩提心；不為教化閻浮提微塵數世界眾生故發菩提心，不為教化三千大千世界微塵數世界眾生故發菩提心，乃至不為教化不可說不可說轉三千大千世界微塵數世界眾生故發菩提心；不為供養一如來故發菩提心，乃至不為供養不可說不可說轉如來故發菩提心；不為供養一世界中次第興世諸如來故發菩提心，乃至不為供養不可說不可說轉世界中次第興世諸如來故發菩提心；不為供養一三千大千世界微塵數世界中次第興世諸如來故發菩提心，乃至不為供養不可說不可說轉佛剎微塵數世界中次第興世諸如來故發菩提心；不為嚴淨一世界故發菩提心，乃至不為嚴淨不可說不可說轉世界故發菩提心；不為嚴淨一三千大千世界微塵數世界故發菩提心，乃至不為嚴淨不可說不可說轉三千大千世界微塵數世界故發菩提心；不為住持一如來遺法故發菩提心，乃至不為住持不可說不可說轉如來遺法故發菩提心；不為住持一世界如來遺法故發菩提心，乃至不為住持不可說不可說轉世界如來遺法故發菩提心；不為住持一閻浮提微塵數世界如來遺法故發菩提心，乃至不為住持不可說不可說轉佛剎微塵數世界如來遺法故發菩提心。",
        "translation": "菩薩不為教化調伏一眾生故發菩提心，不為教化調伏百眾生故發菩提心，乃至不為教化調伏不可說不可說轉眾生故發菩提心；不為教化一世界眾生故發菩提心，乃至不為教化不可說不可說轉世界眾生故發菩提心；不為教化閻浮提微塵數世界眾生故發菩提心，不為教化三千大千世界微塵數世界眾生故發菩提心，乃至不為教化不可說不可說轉三千大千世界微塵數世界眾生故發菩提心；不為供養一如來故發菩提心，乃至不為供養不可說不可說轉如來故發菩提心；不為供養一世界中次第興世諸如來故發菩提心，乃至不為供養不可說不可說轉世界中次第興世諸如來故發菩提心；不為供養一三千大千世界微塵數世界中次第興世諸如來故發菩提心，乃至不為供養不可說不可說轉佛剎微塵數世界中次第興世諸如來故發菩提心；不為嚴淨一世界故發菩提心，乃至不為嚴淨不可說不可說轉世界故發菩提心；不為嚴淨一三千大千世界微塵數世界故發菩提心，乃至不為嚴淨不可說不可說轉三千大千世界微塵數世界故發菩提心；不為住持一如來遺法故發菩提心，乃至不為住持不可說不可說轉如來遺法故發菩提心；不為住持一世界如來遺法故發菩提心，乃至不為住持不可說不可說轉世界如來遺法故發菩提心；不為住持一閻浮提微塵數世界如來遺法故發菩提心，乃至不為住持不可說不可說轉佛剎微塵數世界如來遺法故發菩提心。",
        "source": "T10n0279_064:0344b03_2",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如是略說，不為滿一佛誓願故，不為往一佛國土故，不為入一佛眾會故，不為持一佛法眼故，不為轉一佛法輪故，不為知一世界中諸劫次第故，不為知一眾生心海故，不為知一眾生根海故，不為知一眾生業海故，不為知一眾生行海故，不為知一眾生煩惱海故，不為知一眾生煩惱習海故，乃至不為知不可說不可說轉佛剎微塵數眾生煩惱習海故，發菩提心。",
        "translation": "Thus, in brief, he doesn't give rise to the mind of enlightenment for the sake of fulfilling one Buddha's vow, going to one Buddha's land, entering one Buddha's congregation, maintaining one Buddha's Dharma eye, turning one Buddha's Dharma wheel, knowing the sequence of eons in one world, knowing the ocean of sentient beings' minds, knowing the ocean of sentient beings' faculties, knowing the ocean of sentient beings' actions, knowing the ocean of sentient beings' practices, knowing the ocean of sentient beings' afflictions, knowing the ocean of sentient beings' afflictive habits, or even knowing the ineffable and ineffable ocean of sentient beings' afflictive habits in the minutest number of worlds of the Buddha's buddha-body.",
        "source": "T10n0279_064:0344c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「欲教化調伏一切眾生悉無餘故發菩提心，欲承事供養一切諸佛悉無餘故發菩提心，欲嚴淨一切諸佛國土悉無餘故發菩提心，欲護持一切諸佛正教悉無餘故發菩提心，欲成滿一切如來誓願悉無餘故發菩提心，欲往一切諸佛國土悉無餘故發菩提心，欲入一切諸佛眾會悉無餘故發菩提心，欲知一切世界中諸劫次第悉無餘故發菩提心，欲知一切眾生心海悉無餘故發菩提心，欲知一切眾生根海悉無餘故發菩提心，欲知一切眾生業海悉無餘故發菩提心，欲知一切眾生行海悉無餘故發菩提心，欲滅一切眾生諸煩惱海悉無餘故發菩提心，欲拔一切眾生煩惱習海悉無餘故發菩提心。",
        "translation": "「欲教化調伏一切眾生悉無餘故發菩提心，欲承事供養一切諸佛悉無餘故發菩提心，欲嚴淨一切諸佛國土悉無餘故發菩提心，欲護持一切諸佛正教悉無餘故發菩提心，欲成滿一切如來誓願悉無餘故發菩提心，欲往一切諸佛國土悉無餘故發菩提心，欲入一切諸佛眾會悉無餘故發菩提心，欲知一切世界中諸劫次第悉無餘故發菩提心，欲知一切眾生心海悉無餘故發菩提心，欲知一切眾生根海悉無餘故發菩提心，欲知一切眾生業海悉無餘故發菩提心，欲知一切眾生行海悉無餘故發菩提心，欲滅一切眾生諸煩惱海悉無餘故發菩提心，欲拔一切眾生煩惱習海悉無餘故發菩提心。",
        "source": "T10n0279_064:0344c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_064:0344c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取要言之，菩薩以如是等百萬阿僧祇方便行故發菩提心。",
        "translation": "To summarize, the bodhisattva arouses the aspiration for enlightenment based on a million incalculable skillful actions like these.",
        "source": "T10n0279_064:0344c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0344c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩行普入一切法皆證得故，普入一切剎悉嚴淨故。",
        "translation": "It's because the bodhisattva's practice enters all dharmas universally and realizes them universally and enters all buddhas with complete purity.",
        "source": "T10n0279_064:0344c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善男子！",
        "translation": "Therefore, good sons!",
        "source": "T10n0279_064:0344c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嚴淨一切世界盡，我願乃盡；拔一切眾生煩惱習氣盡，我願乃滿。」",
        "translation": "It's when I've ended my vow to gloriously purify all worlds and when I've ended the habituated tendencies of removing the afflictions of all sentient beings that my vow is fulfilled.\"",
        "source": "T10n0279_064:0344c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財童子言：「聖者！",
        "translation": "The Boy of Wealth said, \"Sage!",
        "source": "T10n0279_064:0345a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此解脫名為何等？」",
        "translation": "What is the name of this liberation?\"",
        "source": "T10n0279_064:0345a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "They replied, \"Good sons!",
        "source": "T10n0279_064:0345a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此解脫名：離憂安隱幢。",
        "translation": "This liberation is called \"the banner of freedom from sorrow and comfort.",
        "source": "T10n0279_064:0345a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_064:0345a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此一解脫門。",
        "translation": "\"I know only this one gate of liberation.",
        "source": "T10n0279_064:0345a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，其心如海，悉能容受一切佛法；如須彌山，志意堅固，不可動搖；如善見藥，能除眾生煩惱重病；如明淨日，能破眾生無明闇障；猶如大地，能作一切眾生依處；猶如好風，能作一切眾生義利；猶如明燈，能為眾生生智慧光；猶如大雲，能為眾生雨寂滅法；猶如淨月，能為眾生放福德光；猶如帝釋，悉能守護一切眾生。",
        "translation": "Suppose bodhisattvas, mahāsattvas, and their minds are like oceans, fully able to contain all the Buddha's teachings; like Mount Sumeru, their resolve is resolute and unshakeable; like good-sighted medicine that removes the heavy illnesses of affliction in sentient beings; like a bright, pure sun that breaks through the dark hindrances of ignorance in sentient beings; like the earth that serves as a base for all sentient beings; like a good wind that serves as a benefit for all sentient beings; like a bright lamp that produces the light of wisdom for sentient beings; like a great cloud that rains down the Dharma of cessation for sentient beings; like the pure moon that radiates merit for sentient beings; like Indra that fully guards all sentient beings.",
        "source": "T10n0279_064:0345a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我云何能知能說彼功德行？",
        "translation": "How can I know and explain their meritorious actions?",
        "source": "T10n0279_064:0345a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0345a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方海潮之處，有一國土，名：那羅素；中有仙人，名：毘目瞿沙。",
        "translation": "South of here, on the tide of the ocean, there's a land called Nārāsu, and there's a sage named Vimuktaghosa.",
        "source": "T10n0279_064:0345a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go there and ask, \"How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_064:0345a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，慇懃瞻仰，悲泣流淚，作是思惟：「得菩提難，近善知識難，遇善知識難，得菩薩諸根難，淨菩薩諸根難，值同行善知識難，如理觀察難，依教修行難，值遇出生善心方便難，值遇增長一切智法光明難。」",
        "translation": "The boy of good fortune then bowed his head at his feet, circled him measureless times, looked up to him, wept with pity, and reflected, \"It's difficult to attain enlightenment, difficult to approach a good teacher, difficult to meet a good teacher, difficult to attain the bodhisattva's faculties, difficult to purify the bodhisattva's faculties, difficult to meet a fellow good teacher, difficult to observe correctly, difficult to practice according to the teaching, difficult to meet the skillful means for producing good thoughts, and difficult to meet the radiance of the teaching that increases all knowledge.\"",
        "source": "T10n0279_064:0345a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，辭退而行。",
        "translation": "After he had this thought, he withdrew and went on his way.",
        "source": "T10n0279_064:0345a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子隨順思惟菩薩正教，隨順思惟菩薩淨行，生增長菩薩福力心，生明見一切諸佛心，生出生一切諸佛心，生增長一切大願心，生普見十方諸法心，生明照諸法實性心，生普散一切障礙心，生觀察法界無闇心，生清淨意寶莊嚴心，生摧伏一切眾魔心。",
        "translation": "At the time, the boy of good fortune followed the contemplation of the bodhisattva's correct teaching and the contemplation of the bodhisattva's pure practice, which produced the mind of increasing the bodhisattva's power of merit, the mind of clearly seeing all the buddhas, the mind of producing all the buddhas, the mind of increasing all the great vows, the mind of seeing all the dharmas in the ten directions, the mind of clearly illuminating the true nature of all dharmas, the mind of dispersing all obstacles, the mind of observing the Dharma realm without darkness, the mind of adorning the jewels of pure thought, and the mind of subduing all the Māras.",
        "source": "T10n0279_064:0345a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸漸遊行，至那羅素國，周遍推求毘目瞿沙。",
        "translation": "He gradually travels to the country of Nārāṇasu and investigates Vimuktaghosa from coast to coast.",
        "source": "T10n0279_064:0345a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見一大林，阿僧祇樹以為莊嚴，所謂：種種葉樹扶疎布濩，種種華樹開敷鮮榮，種種果樹相續成熟，種種寶樹雨摩尼果，大栴檀樹處處行列，諸沈水樹常出好香，悅意香樹妙香莊嚴，波吒羅樹四面圍遶，尼拘律樹其身聳擢，閻浮檀樹常雨甘果，優鉢羅華、波頭摩華以嚴池沼。",
        "translation": "He saw a large forest adorned by incalculable trees, namely, various leaf trees that spread their leaves, various flower trees that bloom and flourish, various fruit trees that ripen continuously, various precious trees that rain maṇi fruit, large sandalwood trees that line every place, trees of still waters that always produce a nice fragrance, trees of pleasant odors that are adorned with a wonderful fragrance, the Pāṭaliputra tree that's surrounded on all sides, the Nirgrantha tree that rises up on its body, the Yambala tree that always rains sweet fruit, and the Upālapatra and Padmahāwa trees that adorn the pond.",
        "source": "T10n0279_064:0345a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子見彼仙人在栴檀樹下敷草而坐，領徒一萬，或著鹿皮，或著樹皮，或復編草以為衣服，髻環垂鬢，前後圍遶。",
        "translation": "The boy Śubhajra then saw this sage sitting under a sandalwood tree covered in grass, with 10,000 disciples, some wearing deerskin, some wearing tree bark, and some weaving grass for their clothing, with their buns and eyebrows hanging down and surrounded by their foreheads and afters.",
        "source": "T10n0279_064:0345b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財見已，往詣其所，五體投地，作如是言：「我今得遇真善知識。",
        "translation": "When Sun Cai saw this, he went to his place, threw his five bodies to the ground, and said, \"Now, I've met a really good teacher.",
        "source": "T10n0279_064:0345b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者，則是趣向一切智門，令我得入真實道故；善知識者，則是趣向一切智乘，令我得至如來地故；善知識者，則是趣向一切智船，令我得至智寶洲故；善知識者，則是趣向一切智炬，令我得生十力光故；善知識者，則是趣向一切智道，令我得入涅槃城故；善知識者，則是趣向一切智燈，令我得見夷險道故；善知識者，則是趣向一切智橋，令我得度險惡處故；善知識者，則是趣向一切智蓋，令我得生大慈涼故；善知識者，則是趣向一切智眼，令我得見法性門故；善知識者，則是趣向一切智潮，令我滿足大悲水故。」",
        "translation": "善知識者，則是趣向一切智門，令我得入真實道故；善知識者，則是趣向一切智乘，令我得至如來地故；善知識者，則是趣向一切智船，令我得至智寶洲故；善知識者，則是趣向一切智炬，令我得生十力光故；善知識者，則是趣向一切智道，令我得入涅槃城故；善知識者，則是趣向一切智燈，令我得見夷險道故；善知識者，則是趣向一切智橋，令我得度險惡處故；善知識者，則是趣向一切智蓋，令我得生大慈涼故；善知識者，則是趣向一切智眼，令我得見法性門故；善知識者，則是趣向一切智潮，令我滿足大悲水故。」",
        "source": "T10n0279_064:0345b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，從地而起，遶無量匝，合掌前住，白言：「聖者！",
        "translation": "After he said this, he rose from the ground, circled measurelessly, put his palms together, and stood in front of him, saying, \"Noble one!",
        "source": "T10n0279_064:0345b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_064:0345b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_064:0345b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to guide and teach, so please explain it for me!\"",
        "source": "T10n0279_064:0345b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，毘目瞿沙顧其徒眾，而作是言：「善男子！",
        "translation": "Vimuktaghosa then looked at his disciples and said, \"Good sons!",
        "source": "T10n0279_064:0345b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此童子已發阿耨多羅三藐三菩提心。",
        "translation": "This boy has aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_064:0345b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_064:0345b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此童子普施一切眾生無畏，此童子普興一切眾生利益，此童子常觀一切諸佛智海，此童子欲飲一切甘露法雨，此童子欲測一切廣大法海，此童子欲令眾生住智海中，此童子欲普發起廣大悲雲，此童子欲普雨於廣大法雨，此童子欲以智月普照世間，此童子欲滅世間煩惱毒熱，此童子欲長含識一切善根。」",
        "translation": "This boy universally bestows fearlessness on all sentient beings, this boy universally produces benefits for all sentient beings, this boy always observes the ocean of wisdom of all buddhas, this boy wants to drink all the nectar and dharma rain, this boy wants to survey all the vast ocean of the Dharma, this boy wants to cause sentient beings to abide in the ocean of wisdom, this boy wants to universally generate vast clouds of compassion, this boy wants to universally rain vast dharma rain, this boy wants to universally illuminate the world with the moon of wisdom, this boy wants to extinguish the poisonous fever of worldly afflictions, and this boy wants to maintain a long awareness of all good roots.\"",
        "source": "T10n0279_064:0345b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸仙眾聞是語已，各以種種上妙香華散善財上，投身作禮，圍遶恭敬，作如是言：「今此童子，必當救護一切眾生，必當除滅諸地獄苦，必當永斷諸畜生道，必當轉去閻羅王界，必當關閉諸難處門，必當乾竭諸愛欲海，必令眾生永滅苦蘊，必當永破無明黑闇，必當永斷貪愛繫縛，必以福德大輪圍山圍遶世間，必以智慧大寶須彌顯示世間，必當出現清淨智日，必當開示善根法藏，必使世間明識險易。」",
        "translation": "After the sages heard those words, they each scattered a variety of fine fragrances and flowers over the good assets, paid homage by throwing themselves down, surrounded themselves with respect, and said, \"Now, this boy will surely rescue all sentient beings, surely remove the pain of hell, surely permanently end the rebirth as an animal, surely turn away from the realm of Yama, surely close the gates of difficult places, surely dry up the sea of craving, surely cause sentient beings to permanently cease the aggregate of suffering, surely permanently destroy the darkness of ignorance, surely permanently end the fetters of craving, surely surround the world with the great wheel of merit, surely reveal the world with the great precious Sumeru of wisdom, surely produce the sun of pure wisdom, surely reveal the store of the Dharma of good roots, and surely make the world a clear and easy place for consciousness.\"",
        "source": "T10n0279_064:0345c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，毘目瞿沙告群仙言：「善男子！",
        "translation": "Vimuktaghosa then addressed the sages, saying, \"Good sons!",
        "source": "T10n0279_064:0345c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能發阿耨多羅三藐三菩提心，必當成就一切智道。",
        "translation": "If someone can give rise to the mind of unsurpassed, correct enlightenment, they will surely achieve the path of omniscience.",
        "source": "T10n0279_064:0345c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子已發阿耨多羅三藐三菩提心，當淨一切佛功德地。」",
        "translation": "This good man has aroused the mind of unsurpassed, correct enlightenment, and will purify all the buddha-places of merit.\"",
        "source": "T10n0279_064:0345c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，毘目瞿沙告善財童子言：「善男子！",
        "translation": "Vimuktaghosa then addressed the Boy of Wealth, \"Good sons!",
        "source": "T10n0279_064:0345c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩薩無勝幢解脫。」",
        "translation": "I've attained the bodhisattva's liberation with the unsurpassed banner.\"",
        "source": "T10n0279_064:0345c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「聖者！",
        "translation": "Shanzai said, \"Sage!",
        "source": "T10n0279_064:0345c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無勝幢解脫境界云何？」",
        "translation": "What is the realm of liberation without the banner of victory?\"",
        "source": "T10n0279_064:0345c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，毘目仙人即申右手，摩善財頂，執善財手。",
        "translation": "Immediately, Sage Vimok then extended his right hand, put it on the top of Sun Cai's head, and held Sun Cai's hand.",
        "source": "T10n0279_064:0345c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時，善財自見其身往十方十佛剎微塵數世界中，到十佛剎微塵數諸佛所，見彼佛剎及其眾會、諸佛相好、種種莊嚴；亦聞彼佛隨諸眾生心之所樂而演說法，一文一句皆悉通達，各別受持無有雜亂；亦知彼佛以種種解淨治諸願；亦知彼佛以清淨願成就諸力；亦見彼佛隨眾生心所現色相；亦見彼佛大光明網，種種諸色清淨圓滿；亦知彼佛無礙智慧大光明力；又自見身於諸佛所，經一日夜或七日夜、半月、一月、一年、十年、百年、千年，或經億年，或阿庾多億年，或那由他億年，或經半劫，或經一劫、百劫、千劫，或百千億乃至不可說不可說佛剎微塵數劫。",
        "translation": "即時，善財自見其身往十方十佛剎微塵數世界中，到十佛剎微塵數諸佛所，見彼佛剎及其眾會、諸佛相好、種種莊嚴；亦聞彼佛隨諸眾生心之所樂而演說法，一文一句皆悉通達，各別受持無有雜亂；亦知彼佛以種種解淨治諸願；亦知彼佛以清淨願成就諸力；亦見彼佛隨眾生心所現色相；亦見彼佛大光明網，種種諸色清淨圓滿；亦知彼佛無礙智慧大光明力；又自見身於諸佛所，經一日夜或七日夜、半月、一月、一年、十年、百年、千年，或經億年，或阿庾多億年，或那由他億年，或經半劫，或經一劫、百劫、千劫，或百千億乃至不可說不可說佛剎微塵數劫。",
        "source": "T10n0279_064:0345c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子為菩薩無勝幢解脫智光明照故，得毘盧遮那藏三昧光明；為無盡智解脫三昧光明照故，得普攝諸方陀羅尼光明；為金剛輪陀羅尼門光明照故，得極清淨智慧心三昧光明；為普門莊嚴藏般若波羅蜜光明照故，得佛虛空藏輪三昧光明；為一切佛法輪三昧光明照故，得三世無盡智三昧光明。",
        "translation": "At the time, the boy of good fortune attained the vairocana store samādhi light because the bodhisattva's unsurpassed banner of liberating wisdom shone brightly, the dhāraṇī light that universally gathers all directions because the inexhaustible wisdom and liberation samādhi light shone brightly, the extremely pure wisdom mind samādhi light because the vajra-wheel dhāraṇī gate shone brightly, the void store wheel samādhi light of the Buddha because the prajñāpāramitā of the universal adornment store shone brightly, and the inexhaustible wisdom samādhi light of the three times because the dharma-wheel samādhi light of all the Buddhas shone brightly.",
        "source": "T10n0279_064:0346a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人放善財手，善財童子即自見身還在本處。",
        "translation": "When that sage released Shanzai's hand, the boy Shanzai saw himself returning to his original spot.",
        "source": "T10n0279_064:0346a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼仙人告善財言：「善男子！",
        "translation": "The recluse then addressed Sun Cai, saying, \"Good man!",
        "source": "T10n0279_064:0346a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝憶念耶？」",
        "translation": "Do you recollect?\"",
        "source": "T10n0279_064:0346a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財言：「唯！",
        "translation": "The well-trained said, \"Yes!",
        "source": "T10n0279_064:0346a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是聖者善知識力。」",
        "translation": "This is the power of a holy person who's a good teacher.\"",
        "source": "T10n0279_064:0346a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人言：「善男子！",
        "translation": "The sage said, \"Good man!",
        "source": "T10n0279_064:0346a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯知此菩薩無勝幢解脫。",
        "translation": "\"I only know that this bodhisattva is liberated by the unsurpassed banner.",
        "source": "T10n0279_064:0346a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩成就一切殊勝三昧，於一切時而得自在，於一念頃出生諸佛無量智慧，以佛智燈而為莊嚴普照世間，一念普入三世境界，分形遍往十方國土，智身普入一切法界，隨眾生心普現其前觀其根行而為利益，放淨光明甚可愛樂；而我云何能知能說彼功德行、彼殊勝願、彼莊嚴剎、彼智境界、彼三昧所行、彼神通變化、彼解脫遊戲、彼身相差別、彼音聲清淨、彼智慧光明？",
        "translation": "Just as bodhisattvas, mahāsattvas achieve all excellent samādhi, attain mastery at all times, produce measureless wisdom from the buddhas in a moment of thought, adorn the world with the Buddha's lamp of wisdom, universally enter the three worldly realms with a single thought, travel to the lands of the ten directions in their separate forms, universally enter all the Dharma realms with their wisdom bodies, universally show up before the minds of sentient beings to observe their faculties and actions for their benefit, and emit pure radiance that's very pleasing, how could I know and explain their meritorious actions, their exceptional vows, their adorned bases, their wisdom realms, their samādhi practices, their miraculous powers and transformations, their liberating play, their distinctions in body shape, their purified sounds, and their wisdom radiance?",
        "source": "T10n0279_064:0346a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0346a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方，有一聚落，名：伊沙那；有婆羅門，名曰：勝熱。",
        "translation": "South of here, there's a village named Īśāna and a Brahmin named Vaiśravaṇa.",
        "source": "T10n0279_064:0346a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go there and ask, \"How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_064:0346a26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子歡喜踊躍，頂禮其足，遶無數匝，慇懃瞻仰，辭退南行。",
        "translation": "The boy of good fortune then rejoiced and jumped for joy, bowed his head at his feet, circled him measureless times, paid respect to him, and withdrew to go south.",
        "source": "T10n0279_064:0346a27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子為菩薩無勝幢解脫所照故，住諸佛不思議神力，證菩薩不思議解脫神通智，得菩薩不思議三昧智光明，得一切時熏修三昧智光明，得了知一切境界皆依想所住三昧智光明，得一切世間殊勝智光明；於一切處悉現其身，以究竟智說無二無分別平等法，以明淨智普照境界；凡所聞法皆能忍受，清淨信解，於法自性決定明了；心恒不捨菩薩妙行，求一切智永無退轉，獲得十力智慧光明，勤求妙法常無厭足，以正修行入佛境界，出生菩薩無量莊嚴，無邊大願悉已清淨；以無窮盡智知無邊世界網，以無怯弱心度無量眾生海；了無邊菩薩諸行境界，見無邊世界種種差別，見無邊世界種種莊嚴，入無邊世界微細境界，知無邊世界種種名號，知無邊世界種種言說，知無邊眾生種種解，見無邊眾生種種行，見無邊眾生成熟行，見無邊眾生差別想；念善知識。",
        "translation": "At the time, because he was illuminated by the bodhisattva's unsurpassed liberation, the Boy of Good Fortune abided in the inconceivable powers of the buddhas, realized the bodhisattva's inconceivable supernormal knowledge of liberation, attained the light of the bodhisattva's inconceivable samādhi knowledge, attained the light of the samādhi knowledge of all the times of perfuming, attained the light of the samādhi knowledge of all the realms that depend on conceptions, attained the light of the superior knowledge of all the world, was fully present in all places, explained the equality of dharmas without duality or discrimination with ultimate knowledge, universally illuminated the realms with clear and pure knowledge, tolerated all the teachings he heard, had pure faith, and knew with certainty the true nature of the teachings.",
        "source": "T10n0279_064:0346a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸次遊行，至伊沙那聚落，見彼勝熱修諸苦行求一切智。",
        "translation": "He gradually marches to the village of Īśāna and sees his overpowering ardor as he cultivates ascetic practices and seeks omniscience.",
        "source": "T10n0279_064:0346b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四面火聚猶如大山，中有刀山高峻無極，登彼山上投身入火。",
        "translation": "It's surrounded by fire like a great mountain, and there's a mountain of swords that's tall and limitless, so he rises up on that mountain and plunges into the fire.",
        "source": "T10n0279_064:0346b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，合掌而立，作如是言：「聖者！",
        "translation": "The Boy of Good Fortune then bowed his head at his feet, put his palms together, and stood up, saying, \"Noble one!",
        "source": "T10n0279_064:0346b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I have first aroused the mind of unsurpassed, correct enlightenment, but I don't know how a bodhisattva trains in the bodhisattva practices.",
        "source": "T10n0279_064:0346b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do we cultivate the bodhisattva path?",
        "source": "T10n0279_064:0346b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble one is well able to guide and teach, so please explain it for me!\"",
        "source": "T10n0279_064:0346b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「善男子！",
        "translation": "The brāhmaṇas said, \"Good sons!",
        "source": "T10n0279_064:0346b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今若能上此刀山，投身火聚，諸菩薩行悉得清淨。」",
        "translation": "Now, if you could go up this mountain of swords and plunge into this fiery mass, all of your bodhisattva practices would be purified.\"",
        "source": "T10n0279_064:0346b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子作如是念：「得人身難，離諸難難，得無難難，得淨法難，得值佛難，具諸根難，聞佛法難，遇善人難，逢真善知識難，受如理正教難，得正命難，隨法行難。",
        "translation": "The Boy of Good Fortune then had this thought, \"It's difficult to obtain a human life, difficult to part with difficulties, difficult to attain nothing difficult, difficult to obtain the pure Dharma, difficult to attain the Buddha, difficult to perfect the faculties, difficult to hear the Buddha's teaching, difficult to meet a good person, difficult to meet a truly good teacher, difficult to receive the correct teaching, difficult to attain right livelihood, and difficult to practice the Dharma as it is.",
        "source": "T10n0279_064:0346b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此將非魔、魔所使耶？",
        "translation": "Wouldn't these be the work of Māra or Māra?",
        "source": "T10n0279_064:0346b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將非是魔險惡徒黨，詐現菩薩善知識相，而欲為我作善根難、作壽命難，障我修行一切智道，牽我令入諸惡道中，欲障我法門、障我佛法？」",
        "translation": "Could it be that a party of Māra's adventurers and evildoers is falsely presenting the bodhisattva as a good teacher, intending to make it difficult for me to cultivate good roots and difficult for me to live, hinder my cultivation of the path of omniscience, lead me into bad destinies, and want to obstruct my teaching and my Buddhist teachings?\"",
        "source": "T10n0279_064:0346b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念時，十千梵天，在虛空中，作如是言：「善男子！",
        "translation": "When they thought this, 10,000 brahma gods were in the sky, saying, \"Good sons!",
        "source": "T10n0279_064:0346c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫作是念！",
        "translation": "Don't think like that!",
        "source": "T10n0279_064:0346c05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫作是念！",
        "translation": "Don't think like that!",
        "source": "T10n0279_064:0346c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此聖者得金剛焰三昧光明，發大精進，度諸眾生，心無退轉；欲竭一切貪愛海，欲截一切邪見網，欲燒一切煩惱薪，欲照一切惑稠林，欲斷一切老死怖，欲壞一切三世障，欲放一切法光明。",
        "translation": "Now, this noble man has attained the vajra-flame samādhi light, arouses great zeal, and delivers all sentient beings without turning back; he wants to dry up all oceans of craving, cut off all webs of wrong views, burn all firewood of affliction, illuminate all dense forests of delusion, end all fears of old age and death, destroy all the hindrances of the three worlds, and radiate all Dharma light.",
        "source": "T10n0279_064:0346c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0346c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我諸梵天多著邪見，皆悉自謂是自在者、是能作者，於世間中我是最勝。",
        "translation": "We brahma gods are often attached to wrong views, and we all say to ourselves that we're the sovereign one, the author, and the most superior among the worlds.",
        "source": "T10n0279_064:0346c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見婆羅門五熱炙身，於自宮殿心不樂著，於諸禪定不得滋味，皆共來詣婆羅門所。",
        "translation": "Seeing the Brahmin's body scorched by the five hottest things, their minds aren't happily attached to their own palaces, and they can't taste their meditation, so they all come together to the Brahmin's place.",
        "source": "T10n0279_064:0346c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門以神通力示大苦行為我說法，能令我等，滅一切見，除一切慢，住於大慈，行於大悲，起廣大心，發菩提意，常見諸佛，恒聞妙法，於一切處心無所礙。」",
        "translation": "With supernormal powers, the Brāhmaṇa showed us great austerities and taught for us, which enabled us to cease all views, remove all conceit, abide in great kindness, practice great compassion, arouse a vast mind, arouse the intention for enlightenment, meet the buddhas frequently, hear the wonderful Dharma constantly, and have our minds unobstructed in all places.\"",
        "source": "T10n0279_064:0346c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千諸魔，在虛空中，以天摩尼寶散婆羅門上，告善財言：「善男子！",
        "translation": "Again, there were 10,000 Māras in the sky who scattered Brahmā's gate with divine maṇi treasures and addressed Sun Cai, saying, \"Good sons!",
        "source": "T10n0279_064:0346c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明映奪於我所有宮殿諸莊嚴具皆如聚墨，令我於中不生樂著，我與眷屬來詣其所。",
        "translation": "When this brāhmaṇa's body is heated by the five hots, the light from his fire shines brightly and overwhelms all the ornaments in my palace like a mass of ink, causing me not to become attached to them with pleasure, and I come to him with my retinue.",
        "source": "T10n0279_064:0346c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門為我說法，令我及餘無量天子、諸天女等，皆於阿耨多羅三藐三菩提得不退轉。」",
        "translation": "This Brāhmaṇa preached for me, causing me and measureless other gods and goddesses to attain irreversibility in the unsurpassed, correct enlightenment.\"",
        "source": "T10n0279_064:0346c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千自在天王，於虛空中，各散天華，作如是言：「善男子！",
        "translation": "Again, there were ten thousand sovereign celestial kings scattering flowers in the sky, each saying, \"Good sons!",
        "source": "T10n0279_064:0346c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明映奪我等所有宮殿諸莊嚴具皆如聚墨，令我於中不生愛著，即與眷屬來詣其所。",
        "translation": "When this brāhmaṇa's body is heated by the five hots, the light from his fire brightly reflects off all of our palaces and adornments like so much ink, causing me to become unattached to them, and I then come to him with my retinue.",
        "source": "T10n0279_064:0346c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門為我說法，令我於心而得自在，於煩惱中而得自在，於受生中而得自在，於諸業障而得自在，於諸三昧而得自在，於莊嚴具而得自在，於壽命中而得自在，乃至能於一切佛法而得自在。」",
        "translation": "This brāhmaṇa taught me the Dharma and made me attain freedom of mind, freedom from affliction, freedom from birth, freedom from the hindrances of karma, freedom from the samādhis, freedom from the ornaments, freedom during my life, and freedom from all the Buddha's teachings.\"",
        "source": "T10n0279_064:0346c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千化樂天王，於虛空中，作天音樂，恭敬供養，作如是言：「善男子！",
        "translation": "Again, there were 10,000 joyful celestial kings who created celestial music in the sky, paid homage and made offerings, and said, \"Good sons!",
        "source": "T10n0279_064:0347a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明照我宮殿諸莊嚴具及諸采女，能令我等不受欲樂、不求欲樂、身心柔軟，即與眾俱來詣其所。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, the light from his fire shines brightly on the ornaments in my palace and the women I pick, causing us to stop desiring and seeking pleasure and to become flexible in body and mind, so that we come with them to his place.",
        "source": "T10n0279_064:0347a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門為我說法，能令我等心得清淨、心得明潔、心得純善、心得柔軟、心生歡喜，乃至令得清淨十力清淨之身，生無量身，乃至令得佛身、佛語、佛聲、佛心，具足成就一切智智。」",
        "translation": "When the Brāhmaṇa preaches for me, it purifies our minds, makes them clear and pure, makes them pure and good, makes them flexible, and makes them rejoice, so much so that they attain the pure body of the ten powers, which is without limit, and that they attain the body, speech, voice, and mind of the Buddha, which are complete in the knowledge of all things.\"",
        "source": "T10n0279_064:0347a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千兜率天王、天子、天女、無量眷屬，於虛空中，雨眾妙香，恭敬頂禮，作如是言：「善男子！",
        "translation": "Again, ten thousand Tuṣita god kings, godsons, goddesses, and countless retinues rained down a multitude of marvelous incense in the sky, paid homage with respect, and said, \"Good sons!",
        "source": "T10n0279_064:0347a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，令我等諸天及其眷屬，於自宮殿無有樂著，共詣其所。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, it causes us gods and their retinues to go to their palaces together without any pleasant attachments.",
        "source": "T10n0279_064:0347a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞其說法，能令我等不貪境界，少欲知足，心生歡喜，心得充滿，生諸善根，發菩提心，乃至圓滿一切佛法。」",
        "translation": "Hearing his teaching will cause us not to crave the external world, to have few desires and be satisfied, to be joyous at heart, to have our minds filled, to produce good roots, to arouse the mind of enlightenment, and to perfect all the Buddha's teachings.\"",
        "source": "T10n0279_064:0347a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千三十三天并其眷屬、天子、天女，前後圍遶，於虛空中，雨天曼陀羅華，恭敬供養，作如是言：「善男子！",
        "translation": "There were another 10,000 Trāyastriṃśa gods and their retinues, gods' children, and goddesses, surrounded by them in the sky, raining down celestial maṇḍala flowers, venerating and making offerings, and saying, \"Good sons!",
        "source": "T10n0279_064:0347a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，令我等諸天於天音樂不生樂著，共詣其所。",
        "translation": "When this brāhmaṇa's body is scorched by the five hottest things, it causes us gods not to become attached to the music of the gods and to go to their places together.",
        "source": "T10n0279_064:0347a20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門為我等說一切諸法無常敗壞，令我捨離一切欲樂，令我斷除憍慢放逸，令我愛樂無上菩提。",
        "translation": "The brāhmaṇa then explains for us that all things are impermanent and corruptible, causes me to abandon all desires and pleasures, stops my conceit and arrogance, and makes me long for unsurpassed bodhi.",
        "source": "T10n0279_064:0347a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T10n0279_064:0347a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當見此婆羅門時，須彌山頂六種震動，我等恐怖，皆發菩提心堅固不動。」",
        "translation": "When I see this Brahmin, the six kinds of trembling at the top of Mount Sumeru terrify us, and we all arouse the aspiration for enlightenment and remain resolute.\"",
        "source": "T10n0279_064:0347a24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千龍王，所謂：伊那跋羅龍王、難陀優波難陀龍王等，於虛空中，雨黑栴檀；無量龍女奏天音樂，雨天妙華及天香水，恭敬供養，作如是言：「善男子！",
        "translation": "Again, 10,000 dragon kings, namely, Dragon King Inabhara and Dragon King Nandopananda, rained black sandalwood in the sky, and measureless nymphs played celestial music, rained down divine flowers and perfume, paid homage and made offerings, and said, \"Good sons!",
        "source": "T10n0279_064:0347a26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明普照一切諸龍宮殿，令諸龍眾離熱沙怖、金翅鳥怖，滅除瞋恚，身得清涼，心無垢濁，聞法信解，厭惡龍趣，以至誠心悔除業障，乃至發阿耨多羅三藐三菩提意住一切智。」",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, his fire shines brightly and universally in the palaces and halls of all the dragons, causing all the dragons to part with their fear of the hot sand and the fear of the garuḍa, cease their anger, become cool in body and spotless in mind, hear the teaching and believe it, become disillusioned with the destinies of the dragons, repent sincerely and remove the karmic hindrances, and awaken to the unsurpassed, correct, and complete wisdom.\"",
        "source": "T10n0279_064:0347a29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千夜叉王，於虛空中，以種種供具，恭敬供養此婆羅門及以善財，作如是言：「善男子！",
        "translation": "Again, 10,000 yakṣa kings placed various offerings in the sky to honor this brāhmaṇa and provide him with good possessions, saying, \"Good sons!",
        "source": "T10n0279_064:0347b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，我及眷屬悉於眾生發慈愍心，一切羅剎、鳩槃荼等亦生慈心；以慈心故，於諸眾生無所惱害而來見我。",
        "translation": "When this brāhmaṇa's body was scorched by the five hottest things, I and my retinue were compassionate toward sentient beings, and all the rājas and kumbhāṇḍas also became compassionate; because of that compassion, they came to see me without being troubled by sentient beings.",
        "source": "T10n0279_064:0347b07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我及彼等，於自宮殿不生樂著，即與共俱，來詣其所。",
        "translation": "Not becoming attached to our own palace, I and they joined us and came to visit them.",
        "source": "T10n0279_064:0347b10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即為我等如應說法，一切皆得身心安樂，又令無量夜叉、羅剎、鳩槃荼等發於無上菩提之心。」",
        "translation": "The brāhmaṇas then taught us the Dharma as it should be taught, and they all attained physical and mental well-being and caused measureless yakṣas, rājas, kumbhāṇḍas, and others to develop the mind of unsurpassed enlightenment.\"",
        "source": "T10n0279_064:0347b11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千乾闥婆王，於虛空中，作如是言：「善男子！",
        "translation": "Again, there were 10,000 gandharva kings who rose up in the sky and said, \"Good sons!",
        "source": "T10n0279_064:0347b13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明照我宮殿，悉令我等受不思議無量快樂，是故我等來詣其所。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, his fire shines brightly in my palace, and it thoroughly causes us to experience inconceivable, immeasurable happiness; therefore, we've come to visit him.",
        "source": "T10n0279_064:0347b15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門為我說法，能令我等於阿耨多羅三藐三菩提得不退轉。」",
        "translation": "This brāhmaṇa preaches for me, and it's able to cause us to attain irreversibility in the unsurpassed, correct enlightenment.\"",
        "source": "T10n0279_064:0347b17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千阿脩羅王，從大海出，住在虛空，舒右膝輪，合掌前禮，作如是言：「善男子！",
        "translation": "Ten thousand other Ashura kings emerged from the ocean, stood in space, extended their right knee, saluted with their palms together, and said, \"Good sons!",
        "source": "T10n0279_064:0347b18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，我阿脩羅所有宮殿、大海、大地，悉皆震動，令我等捨憍慢放逸，是故我等來詣其所。",
        "translation": "When this brāhmaṇa's body is scorched by the five hottest things, my asura's palace, ocean, and earth all shake, causing us to abandon our conceit and dissipation; therefore, we've come to visit him.",
        "source": "T10n0279_064:0347b20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其聞法，捨離諂誑，安住忍地，堅固不動，圓滿十力。」",
        "translation": "Hearing the Dharma from them, we abandoned deceit, abided in the ground of patience, remained resolute, and completed the ten powers.\"",
        "source": "T10n0279_064:0347b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千迦樓羅王，勇力持王而為上首，化作外道童子之形，於虛空中唱如是言：「善男子！",
        "translation": "Ten thousand other Garuḍa kings, with the courageous king as their leader, took the form of a boy from another religion and spoke in the sky, saying, \"Good sons!",
        "source": "T10n0279_064:0347b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明照我宮殿，一切震動皆悉恐怖，是故我等來詣其所。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, his fire shines brightly in our palace, and all the tremors are terrifying.",
        "source": "T10n0279_064:0347b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即為我等如應說法，令修習大慈，稱讚大悲，度生死海，於欲泥中拔濟眾生，歎菩提心，起方便智，隨其所宜調伏眾生。」",
        "translation": "The brāhmaṇa then spoke for us as he should, causing us to cultivate great kindness, praise great compassion, cross the ocean of birth and death, rescue sentient beings from the mire of desire, praise the mind of bodhi, arouse expedient wisdom, and tame sentient beings as he saw fit.\"",
        "source": "T10n0279_064:0347b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十千緊那羅王，於虛空中，唱如是言：「善男子！",
        "translation": "Again, there were ten thousand kiṃnara kings who rose up in the sky and said, \"Good sons!",
        "source": "T10n0279_064:0347c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，我等所住宮殿諸多羅樹、諸寶鈴網、諸寶繒帶、諸音樂樹、諸妙寶樹及諸樂器，自然而出佛聲、法聲及不退轉菩薩僧聲、願求無上菩提之聲，云：『某方、某國，有某菩薩，發菩提心；某方、某國，有某菩薩，修行苦行，難捨能捨，乃至清淨一切智行；某方、某國，有某菩薩，往詣道場；乃至某方、某國，有某如來，作佛事已，而般涅槃。』",
        "translation": "此婆羅門五熱炙身時，我等所住宮殿諸多羅樹、諸寶鈴網、諸寶繒帶、諸音樂樹、諸妙寶樹及諸樂器，自然而出佛聲、法聲及不退轉菩薩僧聲、願求無上菩提之聲，云：『某方、某國，有某菩薩，發菩提心；某方、某國，有某菩薩，修行苦行，難捨能捨，乃至清淨一切智行；某方、某國，有某菩薩，往詣道場；乃至某方、某國，有某如來，作佛事已，而般涅槃。』",
        "source": "T10n0279_064:0347c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0347c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使有人，以閻浮提一切草木末為微塵，此微塵數可知邊際，我宮殿中寶多羅樹乃至樂器所說菩薩名、如來名、所發大願、所修行等，無有能得知其邊際。",
        "translation": "If someone were to take the dust of all the grass and trees in Jambudvīpa as a tiny particle, and this tiny particle could be counted to its limit, there would be no limit to what could be learned from the jeweled tārā tree in my palace or even from the names of the bodhisattvas and tathāgatas as explained by their instruments, the great vows they have made, and the practices they have cultivated.",
        "source": "T10n0279_064:0347c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0347c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等以聞佛聲、法聲、菩薩僧聲，生大歡喜，來詣其所。",
        "translation": "We were so delighted when we heard the sound of the Buddha, the Dharma, and the bodhisattva and saṃgha that we came to visit them.",
        "source": "T10n0279_064:0347c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即為我等如應說法，令我及餘無量眾生於阿耨多羅三藐三菩提得不退轉。」",
        "translation": "The brāhmaṇa then spoke for us as he should, causing us and measureless other sentient beings to attain irreversibility in the unsurpassed, correct enlightenment.\"",
        "source": "T10n0279_064:0347c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量欲界諸天，於虛空中，以妙供具，恭敬供養，唱如是言：「善男子！",
        "translation": "Again, measureless gods of the desire realm were present in the sky, making marvelous offerings, paying respectful tribute, and saying, \"Good sons!",
        "source": "T10n0279_064:0347c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明照阿鼻等一切地獄，諸所受苦悉令休息。",
        "translation": "When this brāhmaṇa's body is scorched by the five hots, its fire shines brightly in all the hells of avīci and beyond, and it brings rest to all the suffering that it endures.",
        "source": "T10n0279_064:0347c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等見此火光明故，心生淨信；以信心故，從彼命終，生於天中；為知恩故，而來其所，恭敬瞻仰，無有厭足。",
        "translation": "Seeing this fiery radiance, we have pure faith in our hearts; because of that faith, we're born among the gods when our lives end; and because we know how grateful we are, we come to them, respect and venerate them, and don't grow weary of them.",
        "source": "T10n0279_064:0347c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門為我說法，令無量眾生發菩提心。」",
        "translation": "At the time, the Brāhmaṇa taught for me, causing measureless sentient beings to arouse the mind of enlightenment.\"",
        "source": "T10n0279_064:0347c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子聞如是法，心大歡喜，於婆羅門所，發起真實善知識心，頭頂禮敬，唱如是言：「我於大聖善知識所生不善心，唯願聖者容我悔過！」",
        "translation": "Hearing this teaching, the boy of good fortune was greatly encouraged, arouse in him the mind of a truly good teacher, bowed his head in respect, and said, \"I've had unwholesome thoughts in the presence of a great noble and good teacher, may the noble one allow me to repent!\"",
        "source": "T10n0279_064:0347c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即為善財而說頌言：「若有諸菩薩，　　順善知識教，　一切無疑懼，　　安住心不動。",
        "translation": "The brāhmaṇa then spoke a verse for the good treasure, saying, \"Suppose there are bodhisattvas who follow the teaching of a good teacher, have no doubts or fears, and abide in a state of mental equipoise that isn't disturbed.",
        "source": "T10n0279_064:0347c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當知如是人，　　必獲廣大利，　坐菩提樹下，　　成於無上覺。」",
        "translation": "You should know that such a person will surely attain great rewards, sit under the bodhi tree, and become unsurpassed in awakening.\"",
        "source": "T10n0279_064:0348a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善財童子即登刀山，自投火聚；未至中間，即得菩薩善住三昧；纔觸火焰，又得菩薩寂靜樂神通三昧。",
        "translation": "At that point, the boy Sun Cai then climbed the mountain of swords and threw himself into the fire; before he reached the middle, he attained the concentration of the bodhisattva's well-abiding mind; as soon as he touched the fire, he attained the concentration of the bodhisattva's calm, joyful abilities.",
        "source": "T10n0279_064:0348a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善財白言：「甚奇！",
        "translation": "Sun Cai said, \"How marvelous!",
        "source": "T10n0279_064:0348a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖者！",
        "translation": "The Holy One!",
        "source": "T10n0279_064:0348a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是刀山及大火聚，我身觸時安隱快樂。」",
        "translation": "When I touch such a mountain of swords or a great ball of fire, I'm comfortable and happy.\"",
        "source": "T10n0279_064:0348a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門告善財言：「善男子！",
        "translation": "The brāhmaṇa then addressed Śubhaji, saying, \"Good man!",
        "source": "T10n0279_064:0348a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯得此菩薩無盡輪解脫。",
        "translation": "\"I have only attained the liberation of this bodhisattva's inexhaustible wheel.",
        "source": "T10n0279_064:0348a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩摩訶薩大功德焰，能燒一切眾生見惑令無有餘，必不退轉無窮盡心、無懈怠心、無怯弱心，發如金剛藏那羅延心，疾修諸行無遲緩心，願如風輪普持一切精進大誓皆無退轉；而我云何能知能說彼功德行？",
        "translation": "Just like the bodhisattvas, the great flames of merit of the great bodhisattvas can burn the delusion of all sentient beings in their views so that there's no remainder, they surely won't retrogress with an inexhaustible mind, a lazy mind, or a fainthearted mind, a mind like the vajra store Nārāyaṇa, a mind that hastens to cultivate practices without lag, and a vow like a wind-wheel that universally sustains all diligent great vows without turning back; how could I know or explain their meritorious actions?",
        "source": "T10n0279_064:0348a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T10n0279_064:0348a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此南方，有城名：師子奮迅；中有童女，名曰：慈行。",
        "translation": "South of here, there's a city named Shizi Fenxun, and there's a young woman named Maitreya.",
        "source": "T10n0279_064:0348a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Do you go there and ask, \"How do bodhisattvas train in the bodhisattva practices and cultivate the bodhisattva path?\"",
        "source": "T10n0279_064:0348a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，辭退而去。",
        "translation": "The boy of good fortune then bowed his head at his feet, circled him for countless turns, withdrew, and departed.",
        "source": "T10n0279_064:0348a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第六十四",
        "translation": "Dafangguang fo huayan jing roll 64",
        "source": "T10n0279_064:0348a19_0",
        "is_bad_quality": false
    }
]