[
    {
        "source_sentence": "佛說如來不思議祕密大乘經卷",
        "translation": "Foshuo rulai busiyi mimi dasheng jing roll",
        "source": "T11n0312_004:0711c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四",
        "translation": "fourth",
        "source": "T11n0312_004:0711c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫",
        "translation": "Tripiṭaka of the Western Paradise Translation Sutra, Chaosan Dashi",
        "source": "T11n0312_004:0711c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "試光祿卿傳梵大師賜紫",
        "translation": "Guangluqing zhuanfan dashi gongsi",
        "source": "T11n0312_004:0711c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "Translated by imperial order by the monks, ministers, and others, Fahou",
        "source": "T11n0312_004:0711c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩心密品第三之餘",
        "translation": "The Third and Remaining Chapter of the Esoteric Chapter of the Bodhisattva Mind",
        "source": "T11n0312_004:0711c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，金剛手大祕密主菩薩摩訶薩告寂慧菩薩摩訶薩言：「善男子！",
        "translation": "Furthermore, the Vajrapāṇi, the bodhisattva Mahāsattva of the Great Secret Lord, addressed the bodhisattva Mahāsattva of Silent Wisdom, saying, \"Good sons!",
        "source": "T11n0312_004:0711c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩心密者，謂修慈行即知無我，若修悲行即無眾生，若修喜行即無壽者，若修捨行即無有人，若修布施行即心調伏，若修持戒行即心寂靜，若修忍辱行即心無盡相，若修精進行即心離相，若修禪定行即心安定，若修慧行即心無伺察，若修四念處行即心無念亦無作意，若修四正斷行即心正平等，若修四神足行即心無戲論，若修信根即心無著，若修精進根即心無發悟，若修念根即得自然智心，若修定根即得平等性智心，若修慧根即得無根本心，若修五力即得心無屈伏，若修七覺支即得慧分別心，若修八正道即得無所修心，若修奢摩他即得寂止心，若修毘鉢舍那即得無所觀心，若修四聖諦即得畢竟無了知心，若修佛作意即得無作意心，若修法作意即得法界平等心，若修僧作意即得無住心，若修成熟有情行即得本來清淨心，若修攝受正法行即得法界無差別心，若修嚴淨佛土行即得虛空平等心，若修無生法忍行即得無所得心，若修不退轉地行即得無轉而轉心，若修成就諸相行即得無相心，若修莊嚴菩提果即得三界圓滿心，若修降伏諸魔行即得普攝一切有情心，若修趣向菩提行即得法界自性隨覺了心，若修轉法輪行即得無轉非無轉心，若修大涅槃行即得隨觀生死自性心。",
        "translation": "菩薩心密者，謂修慈行即知無我，若修悲行即無眾生，若修喜行即無壽者，若修捨行即無有人，若修布施行即心調伏，若修持戒行即心寂靜，若修忍辱行即心無盡相，若修精進行即心離相，若修禪定行即心安定，若修慧行即心無伺察，若修四念處行即心無念亦無作意，若修四正斷行即心正平等，若修四神足行即心無戲論，若修信根即心無著，若修精進根即心無發悟，若修念根即得自然智心，若修定根即得平等性智心，若修慧根即得無根本心，若修五力即得心無屈伏，若修七覺支即得慧分別心，若修八正道即得無所修心，若修奢摩他即得寂止心，若修毘鉢舍那即得無所觀心，若修四聖諦即得畢竟無了知心，若修佛作意即得無作意心，若修法作意即得法界平等心，若修僧作意即得無住心，若修成熟有情行即得本來清淨心，若修攝受正法行即得法界無差別心，若修嚴淨佛土行即得虛空平等心，若修無生法忍行即得無所得心，若修不退轉地行即得無轉而轉心，若修成就諸相行即得無相心，若修莊嚴菩提果即得三界圓滿心，若修降伏諸魔行即得普攝一切有情心，若修趣向菩提行即得法界自性隨覺了心，若修轉法輪行即得無轉非無轉心，若修大涅槃行即得隨觀生死自性心。",
        "source": "T11n0312_004:0711c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「寂慧！",
        "translation": "\"Wisdom of quiescence!",
        "source": "T11n0312_004:0712a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此等皆是得忍菩薩心祕密法心業清淨。",
        "translation": "You should know that these are all mental activities that have attained the purity of the secret dharma of the tolerant bodhisattva's mind.",
        "source": "T11n0312_004:0712a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼菩薩如是清淨已，即得一切有情心亦清淨，而是菩薩乃能隨入諸有情心，即彼一切有情之心，皆從大菩提心光明中出。",
        "translation": "If a bodhisattva thus purifies them, then he attains the mental purity of all sentient beings, and the bodhisattva is then able to follow and enter the minds of sentient beings, meaning that the minds of all those sentient beings all emerge from the light of the great bodhi mind.",
        "source": "T11n0312_004:0712a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空於一切處住、隨入一切處。",
        "translation": "It's like space that abides in all places and enters all places accordingly.",
        "source": "T11n0312_004:0712a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩心者亦復如是，於一切處住、隨入一切處。」",
        "translation": "So too, the bodhisattva's mind abides in all places and enters all places accordingly.\"",
        "source": "T11n0312_004:0712a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛手大祕密主菩薩摩訶薩如是宣說菩薩所有身語心密不思議正法，時會中有七萬二千天及人發阿耨多羅三藐三菩提心，三萬二千菩薩得無生法忍，八萬四千人遠塵離垢得法眼淨，八千苾芻不受諸法漏盡意解得心解脫。",
        "translation": "When the Vajrapāṇi, the great esoteric lord of bodhisattvas, Mahāsattva, thus proclaims the inconceivable true teaching of the bodhisattvas' physical, verbal, and mental secrets, 72,000 gods and humans will give rise to the mind of unsurpassed, 32,000 bodhisattvas will attain the forbearance of the nonarising of the Dharma, 84,000 people will become dustless and spotless and attain purification of the Dharma eye, and 8,000 nuns will not accept the contaminants of the Dharma and will attain mental liberation.",
        "source": "T11n0312_004:0712a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此三千大千世界六種震動，有大光明普遍照耀，虛空自然雨眾天華，復於空中有百千種殊妙音樂不鼓自鳴。",
        "translation": "At the time, six of these 3,000 great thousand worlds shook, a great bright light shone universally, and the sky naturally rained down multitudes of celestial flowers, and there were a hundred thousand kinds of marvelous music in the air that didn't sound on its own.",
        "source": "T11n0312_004:0712b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其音樂中出如是言：「若諸有情已得授記位者，方乃得聞此金剛手大祕密主菩薩摩訶薩所說正法。",
        "translation": "From that music came these words, \"Only then will sentient beings who have attained the stage of assurance of ordination be able to hear the right teaching from this Vajrapāṇi, the Bodhisattva Mahāsattva of the Great Secret Lord.",
        "source": "T11n0312_004:0712b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中聞已，受持讀誦如理修行、廣為他人隨應宣說，永不忘失大菩提心。",
        "translation": "After hearing it, they memorize it, recite it, practice it according to principle, and explain it to others accordingly, never forgetting the great mind of enlightenment.",
        "source": "T11n0312_004:0712b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知彼人非少善根而能成就，已於廣多佛世尊所深植善本，勤修一切最勝福行，當為一切有情作大饒益。」",
        "translation": "You should know that person doesn't have few good roots that can be accomplished, has deeply planted good roots in a wide variety of the Buddha's world-honored places, and diligently cultivates all the most excellent meritorious practices that will greatly benefit all sentient beings.\"",
        "source": "T11n0312_004:0712b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "震吼音聲菩薩來會品第四",
        "translation": "Chapter Four of the Śubha-vocal Bodhisattva's Coming Assembly",
        "source": "T11n0312_004:0712b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告寂慧菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva of Silent Wisdom, \"Good sons!",
        "source": "T11n0312_004:0712b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝聞空中多種鼓樂妙音聲不？」",
        "translation": "Do you hear the wonderful sound of many kinds of drums in the air?\"",
        "source": "T11n0312_004:0712b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧菩薩白佛言：「世尊！",
        "translation": "The bodhisattva Zhihui said to the Buddha, \"Bhagavān!",
        "source": "T11n0312_004:0712b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我初已聞。",
        "translation": "\"I first heard it.",
        "source": "T11n0312_004:0712b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是何等殊妙音聲？",
        "translation": "What's this marvelous sound?",
        "source": "T11n0312_004:0712b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛為說。」",
        "translation": "May the Buddha explain this for you.\"",
        "source": "T11n0312_004:0712b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「寂慧！",
        "translation": "The Buddha said, \"Silent wisdom!",
        "source": "T11n0312_004:0712b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當知，有菩薩摩訶薩名震吼音聲，從大雲世界雲音王如來所來此娑婆世界，瞻禮於我親近供養，及欲聽受金剛手菩薩宣說正法，亦復樂見十方來會諸大菩薩摩訶薩眾。",
        "translation": "Now, you should know that there's a bodhisattva Mahāsattva named Vibrating Sound who comes to this Saha world from the great cloud world of Tathāgata Cloud Sound King, pays homage to me, makes offerings to me, wants to hear the Vajrapāṇi teach the right Dharma, and is happy to see the great multitude of bodhisattvas, Mahāsattvas, and others from the ten directions who have come to assemble here.",
        "source": "T11n0312_004:0712b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是彼震吼音聲菩薩隱自身相住虛空中，雨眾妙華、鼓勝音樂，供養於我。",
        "translation": "That Vajrarāja sound bodhisattva hides his form and stands in the sky, raining down a profusion of marvelous flowers and drumming excellent music to offer to me.",
        "source": "T11n0312_004:0712b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其樂音中出如是聲：『世尊如來於大會中，非久宣說廣大正法。』」",
        "translation": "From his joyful voice came this sound: 'The Bhagavān Tathāgata has been proclaiming the vast correct teaching in this assembly for a long time.'\"",
        "source": "T11n0312_004:0712b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發是言已，即時震吼音聲菩薩摩訶薩從空而下入佛會中，頭面禮足右繞七匝，住於佛前而白佛言：「大雲世界雲音王如來問訊世尊，少病少惱，起居輕利，氣力安不？",
        "translation": "After he said this, the Bodhisattva Mahāsattva of the Sound of Shaking Roar descended from the sky into the Buddha's assembly, bowed his head at his feet, circled to his right seven times, stood in front of the Buddha, and said to him, \"The Tathāgata Meghasvara King of the Cloud World asks the Bhagavān, 'Is he little sick and little troubled, does he get up and go about lightly, and does he have good energy?'",
        "source": "T11n0312_004:0712b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛如來又作是說：『金剛手大祕密主菩薩摩訶薩，有大方便善說正法，是佛威神之所建立，乃能如是通達一切無量佛法。』」",
        "translation": "The Buddha-tathāgata also said, 'The Vajrapāṇi, the Bodhisattva of Great Mysteries, has great skill in explaining the right teaching, and this is the establishment of the Buddha's authority that enables him to thus comprehend all the Buddha's teachings that are measureless.'\"",
        "source": "T11n0312_004:0712b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告震吼音聲菩薩摩訶薩言：「善哉善男子！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva Vocalizing with Voices, saying, \"Good, good man!",
        "source": "T11n0312_004:0712c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝善來此大眾會中，樂聽金剛手大祕密主菩薩摩訶薩宣說如來祕密不思議法。",
        "translation": "You've come here in this assembly to listen with joy to the Vajrapāṇi, the bodhisattva Mahāsattva, the lord of great mysteries, as he proclaims the Tathāgata's esoteric and inconceivable teaching.",
        "source": "T11n0312_004:0712c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當於此諦聽諦受。」",
        "translation": "Here, you must listen closely and accept it.\"",
        "source": "T11n0312_004:0712c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持國輪王先行品第五",
        "translation": "Chapter 5 of the Precedent of the Wheel-Turning King Who Holds the Land",
        "source": "T11n0312_004:0712c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中諸菩薩眾咸起是念：「此金剛手大祕密主菩薩摩訶薩，往昔於何佛世尊所，親近聽受深種善根，復修何等廣大誓願，乃能如是具大辯才善說諸法？」",
        "translation": "It was then that a large group of bodhisattvas all thought, \"In the past, in what place did this Vajrapāṇi, the Bodhisattva of the Great Esoteric Master, listen intimately to deeply planted good roots and cultivate what great vow, so that he could skillfully explain the Dharma with such great eloquence?\"",
        "source": "T11n0312_004:0712c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知諸菩薩心疑念已，即告寂慧菩薩言：「善男子！",
        "translation": "Knowing that the bodhisattvas had doubts, the Bhagavān addressed Śīlabhadra, saying, \"Good sons!",
        "source": "T11n0312_004:0712c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念過去世中經阿僧祇劫，復過阿僧祇數無量無邊不可思議劫前，有劫名善現，世界名莊嚴。",
        "translation": "I remembered that in ages gone by, there were incalculably long eons and incalculably long unfathomable eons before an eon was named Well-Presented and the world was named Adorned.",
        "source": "T11n0312_004:0712c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛出世，號無邊功德寶眾莊嚴王如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "There was a Buddha who appeared in the world and was called the Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge, Well Gone, Understander of the World, Unsurpassed Person, Trainer, Teacher of Gods and People, Buddha, and World Honored One, who was called the Jewel of Infinite Merit, the King of Adornment.",
        "source": "T11n0312_004:0712c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧當知，彼莊嚴世界廣大妙好安隱豐樂，人民熾盛，地平如掌，無諸砂礫荊棘雜穢，草木樹林青欝可愛。",
        "translation": "Silent wisdom should tell you that that adorned world is vast, beautiful, peaceful, and abundant, with a population that flourishes, a level ground like the palm of your hand, no gravel or thorns to defile it, and lovely green grass and trees.",
        "source": "T11n0312_004:0712c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有名華，軟草覆地青潤妙好，如孔雀項右旋喜相，有色有香令人適悅。",
        "translation": "It also has a flower with name, a soft grass covering the ground that's green and marvelous, like a peacock's right side swirling with joy, and it has color and fragrance that are pleasing.",
        "source": "T11n0312_004:0712c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下足于地隨減四指，舉足還復隨起四指。",
        "translation": "He puts his foot down on the ground and subtracts four fingers as he goes, and then raises his foot again and raises four fingers as he goes.",
        "source": "T11n0312_004:0712c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無極寒熱溫涼調適，軟美清風令人愛樂。",
        "translation": "It's perfectly cool, warm, and comfortable, and its soft, beautiful, and refreshing breeze is delightful.",
        "source": "T11n0312_004:0712c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地莊嚴如吠瑠璃。",
        "translation": "Their ground is adorned like vaiḍūrya.",
        "source": "T11n0312_004:0712c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時人民色相嚴好，少貪瞋癡及餘煩惱，人有孝愛復具勢力，聞說善言能自開曉。",
        "translation": "Their people are beautiful in appearance, have little craving, anger, delusion, or other afflictions, are dutiful and powerful, and can reveal themselves when they hear and speak well.",
        "source": "T11n0312_004:0712c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼世尊無邊功德寶眾莊嚴王如來法中，有十二那庾多諸聲聞眾，三十二俱胝諸菩薩眾。",
        "translation": "Within the Dharma of that Bhagavān, the Tathāgata of Unlimited Merit and Jewels, there are 12 Āyurveda śrāvakas and 32 coffin bodhisattva congregations.",
        "source": "T11n0312_004:0712c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時人壽三十六俱胝歲，於中有人趣命終者。",
        "translation": "Their lives are 36 koṭī years old, and there's someone who's headed for the end of his life.",
        "source": "T11n0312_004:0712c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「寂慧當知，而彼善現劫中莊嚴世界，處于中四大洲。",
        "translation": "\"You should know, Silent Wisdom, that adorned world of the well-appearing eon is located on one of the four continents.",
        "source": "T11n0312_004:0713a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一四大洲其量廣闊八萬四千由旬，每一由旬中有千國城郡邑聚落周匝圍繞。",
        "translation": "Each of those four continents is 84,000 leagues wide, and in each league there are a thousand countries, cities, towns, and villages surrounding it.",
        "source": "T11n0312_004:0713a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼莊嚴世界中有大國城名極清淨，而彼國城分量廣闊，北六十四由旬、南四十由旬，東西亦然。",
        "translation": "In that adorned world, there's a large country whose name is extremely pure, and the size of that country's city is 64 leagues wide in the north, 40 leagues wide in the south, and similarly so in the east and west.",
        "source": "T11n0312_004:0713a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十千園苑而為嚴飾，國城之內復有十千州城縣邑。",
        "translation": "There are 10,000 parks and gardens that are decorated, and within the city there are another 10,000 cities, towns, and villages.",
        "source": "T11n0312_004:0713a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼極清淨國城之中，有大轉輪聖王名曰持國，七寶具足為四大洲主。",
        "translation": "In the midst of that perfectly pure country, there's a great wheel-turning sage king named Chikoku, complete with seven treasures, who is the lord of the four continents.",
        "source": "T11n0312_004:0713a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於先佛所深植善根，福德威光王中最勝，不退轉於阿耨多羅三藐三菩提心。",
        "translation": "He had deeply planted good roots with the previous buddhas, was the most brilliant among kings in terms of his merit and prestige, and didn't turn back from the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0312_004:0713a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「寂慧！",
        "translation": "\"Silent wisdom!",
        "source": "T11n0312_004:0713a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼持國轉輪聖王所居國城，縱廣正等十六由旬，廣大殊妙，有七重牆，七寶所成，其上復有七重樓閣，七重寶網垂諸寶鈴。",
        "translation": "\"The city of that country where the wheel-turning sage king holds statehood is exactly 16 leagues wide and vast and marvelous, with seven walls made of seven jewels, another seven-storied tower on top of that, and seven nets of jewels draped with jeweled bells.",
        "source": "T11n0312_004:0713a11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牆內周匝有四大園：一名眾花，二名德喜，三名孔雀喜，四名時分快樂。",
        "translation": "Surrounding the wall are four large gardens: one filled with flowers, two filled with joy, three filled with the joy of peacocks, and four filled with the joy of time.",
        "source": "T11n0312_004:0713a14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸園中各有大池：一名歡喜，二名喜上，三名香上，四名順流。",
        "translation": "In each of these gardens are large ponds: one named Rejoice, two named Joyful, three named Fragrant, and four named Shunryu.",
        "source": "T11n0312_004:0713a15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其池縱廣半由旬量，悉以眾寶砌其階級，閻浮檀金而為其底，金沙布地，八功德水充滿其中，有寶蓮華彌覆其內，鵝鴈鴛鴦眾鳥游泳。",
        "translation": "The pond is half a decade-wide in size, and it's entirely built with steps of many treasures, has a gold floor made of jambū, is covered with gold sand, is filled with the water of the eight virtues, and is covered with a jeweled lotus that swims with geese, dogs, and ducks.",
        "source": "T11n0312_004:0713a17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼持國轉輪聖王有其七萬宮嬪婇女，皆悉相好端嚴殊妙，而為女寶以用給侍，是諸宮嬪皆悉已發阿耨多羅三藐三菩提心。",
        "translation": "The wheel-turning sage king of that country has 70,000 ladies in his palace, all of whom are beautiful and exquisite, and they serve as ladies' treasures.",
        "source": "T11n0312_004:0713a20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有千子，色相端嚴，勇猛無畏能伏他軍人，各具其二十八種大丈夫相以為嚴飾，深心淨信於阿耨多羅三藐三菩提法。",
        "translation": "The king has a thousand sons who are noble in appearance, courageous and fearless enough to subdue other soldiers, each adorned with the 28 characteristics of a great personage, and who have a deep, pure heart and belief in the unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0312_004:0713a23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「寂慧！",
        "translation": "\"Silent wisdom!",
        "source": "T11n0312_004:0713a25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼世尊無邊功德寶眾莊嚴王如來，居極清淨大國城中。",
        "translation": "That Bhagavān, the Tathāgata, the Jewel of Infinite Merit, the Venerable King of Adornment, was staying in the middle of a great, extremely pure country.",
        "source": "T11n0312_004:0713a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼持國轉輪聖王，與諸大臣、婆羅門長者乃至一切人民，咸悉恭敬尊重供養其王淨信彼無邊功德寶眾莊嚴王如來及苾芻眾，滿一俱胝歲，承事供養廣持悅意，種種飲食珍妙衣服乃至一切受用等物，悉以奉上。",
        "translation": "That country-supporting wheel-turning sage king, his ministers, the elders of the brāhmaṇas, and all the people there all respected, venerated, and offered support to the king, who was pure and faithful to that Tathāgata, the Jeweled King of Limitless Merit, and to the congregation of monks, who served, supported, and gave their blessings, various foods, rare and wonderful clothing, and all the things they needed to enjoy.",
        "source": "T11n0312_004:0713a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸苾芻眾，各以三園用獻遊止。",
        "translation": "The congregation of monks each offered them three parks to roam around.",
        "source": "T11n0312_004:0713b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「寂慧！",
        "translation": "\"Silent wisdom!",
        "source": "T11n0312_004:0713b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼轉輪王有諸太子，心各清淨曾無放逸，親近彼佛勇聞正法，不以欲樂而為染著。",
        "translation": "\"That wheel-turning king has princely princes who are each pure of heart and have never been careless, who come close to that Buddha and courageously hear the right teaching, and who aren't defiled by desire or pleasure.",
        "source": "T11n0312_004:0713b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由不放逸其心寂定，聽正法故，是諸太子不久之間得五神通，即時各各踊身空中，猶如鵝王飛騰自在，從園至園，從此城邑至彼城邑，乃至遍遊四大洲界，隨行空中說伽陀曰：「『諸佛出世得何利？",
        "translation": "Because they weren't careless, their minds were calm and concentrated, and they listened to the right teaching, those princes soon attained the five supernormal powers, and they each immediately leaped into the air like a king goose flying freely from park to park, from this town to that town, and even around the four continents, saying in the air as they went, \"What benefits do the buddhas obtain when they appear in the world?\"",
        "source": "T11n0312_004:0713b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　總聚人間利復深。",
        "translation": "It's a collection of benefits that's equally profound for the human race.",
        "source": "T11n0312_004:0713b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　仁者聽法淨信心，　　經百劫中極難得。",
        "translation": "For a hundred eons, it's extremely difficult to attain the pure faith of a person who hears the teaching.",
        "source": "T11n0312_004:0713b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今此人中仙出世，　　宣說正法寂靜道，　　我今近彼善逝尊，　　由聞法故生善趣，　　聞正法已破惡趣，　　聞正法已善趣生，　　由聞法故煩惱除，　　心得清涼最上樂。』",
        "translation": "Now, when this sage among men appears in the world and teaches the right Dharma and the quiet path, I'll approach that honored one, and it'll be born in a good destiny because I've heard the right Dharma, destroy bad destinies after hearing the right Dharma, be born in a good destiny after hearing the right Dharma, remove afflictions because I've heard the Dharma, and attain the supreme bliss of mental clarity.'",
        "source": "T11n0312_004:0713b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　空中說是伽陀時，　　此大地中六震動，　　天人空中出妙聲，　　大雨眾華生悅意：　『若人得見佛大師，　　彼功德說不能盡，　　應當頂禮二足尊，　　合掌諦誠而恭信。",
        "translation": "When this was said in the sky about the buddha, six earthly tremors shook this great land, and marvelous sounds arose from the gods and humans in the sky, raining down flowers that gave rise to joy: 'If a person has seen the great teacher Buddha, whose merits cannot be explained in detail, they should bow their heads to the two-legged honored one, put their hands together, sincerely acknowledge, and venerate him.",
        "source": "T11n0312_004:0713b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼佛能知人心意，　　如其所應為說法。』",
        "translation": "That Buddha can know a person's mind and teach the Dharma just as it should be taught.'",
        "source": "T11n0312_004:0713b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　聞法三十六俱胝，　　人皆住勝菩提道；　　復有三百俱胝人，　　獲得最上淨法眼；　　一切皆生厭離心，　　歸佛出家依正教。",
        "translation": "Hearing the Dharma for thirty-six koṭīs, everyone abides on the path to superior enlightenment; there are another 300 koṭīs who attain the supreme pure eye of the Dharma; all become disillusioned, return to the Buddha, leave home, and rely on the right teaching.",
        "source": "T11n0312_004:0713b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又四俱胝那庾多，　　人受淨戒作佛事，　　聽法供養佛世尊，　　作已各還於本處。",
        "translation": "There are another four corpuscles of nayutas, people who receive the pure precepts and perform Buddha-works, listen to the teaching and make offerings to the Bhagavān, and then return to their original place after performing them.",
        "source": "T11n0312_004:0713b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼諸太子說伽陀已，同為其父持國轉輪聖王作供養事。",
        "translation": "\"After they spoke about the Gadhātu, those princes made offerings together to their father, the Wheel-Turning Sage King of Holding Land.",
        "source": "T11n0312_004:0713b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "擇以龍堅妙栴檀香造作樓閣，廣大殊麗妙好嚴飾，縱廣正等十由旬量，四方四隅分量齊等，樓觀門徑悉以龍堅妙栴檀香；製作圓具如天宮殿。",
        "translation": "They chose to build a tower made of the fragrance of the fine, fine sandalwood, which was vast and beautiful, beautifully adorned, measuring exactly ten leagues in length and breadth, with equal parts in the four quarters and four directions, and whose perimeter was completely filled with the fragrance of the fine, fine sandalwood of dragons; it was made to resemble a heavenly palace.",
        "source": "T11n0312_004:0713b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其龍堅香半兩價直過於閻浮檀金價，而彼樓閣巧施工力妙好嚴成。",
        "translation": "The price of half a tael of that fragrance was worth more than the price of gold from the river running through it, and the tower was adorned with the marvelous beauty of the building's skillful construction power.",
        "source": "T11n0312_004:0713c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時持國轉輪聖王欲詣世尊無邊功德寶眾莊嚴王如來所，瞻禮親近聽受正法。",
        "translation": "\"The wheel-turning sage king of the country that holds it then wanted to visit the Bhagavān, the Tathāgata of Immeasurable Merit and Treasures, the Adorned King, to venerate him and get close to him to hear the right teaching.",
        "source": "T11n0312_004:0713c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王諸子并宮嬪眷屬，侍從父王，即入栴檀大樓閣中。",
        "translation": "The king's sons and ladies of the court accompanied their father and went into the sandalwood mansion.",
        "source": "T11n0312_004:0713c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王處于蓮華莊嚴師子座上，太子宮嬪臣佐人民咸皆尊重，以一切種花鬘塗香、上妙衣服、寶幢幡蓋、微妙音樂廣伸供養。",
        "translation": "The king was placed on the lotus-adorned lion throne, and the prince's palace retinue, ministers, and people all paid respect to him and offered support with all kinds of flowers, perfumes, fine clothing, jeweled banners, and subtle music.",
        "source": "T11n0312_004:0713c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以寶網垂覆樓閣，眾共執擎而將前進，即時騰踊在虛空中，猶如鵝王自在而行。",
        "translation": "Again, he draped a jeweled net over the tower, and as they all carried it, they marched forward, soaring into the sky like a king goose moving freely.",
        "source": "T11n0312_004:0713c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前至佛所，徐徐以彼樓閣安置地已，持國轉輪聖王并太子宮嬪從樓閣中安庠而下，前詣佛所，頭面著地禮佛雙足，并苾芻眾各敬禮已，右繞七匝還住佛前，合掌諦誠聽受正法。",
        "translation": "After they had slowly placed the tower on the ground, the Wheel-Turning Sage King of Dharmapala and the princely palace attendants descended from the tower, made their way to the Buddha, bowed their heads to the ground at his feet, and the crowd of monks and nuns each paid homage, circled to his right seven times, returned to the Buddha, folded their palms, and sincerely listened to the right teaching.",
        "source": "T11n0312_004:0713c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼世尊無邊功德寶眾莊嚴王如來，知彼持國轉輪聖王來佛會中樂欲聽法，佛即如應為說妙法示教利喜。",
        "translation": "The Bhagavān, the Dhāraṇī of Immeasurable Treasures and Adorned Kings, then knew that the wheel-turning sage king of that country was delighted to come to the Buddha's meeting to hear the teaching, and the Buddha answered by teaching him the wonderful Dharma and showing him how to benefit and delight in it.",
        "source": "T11n0312_004:0713c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：『大王！",
        "translation": "The Buddha said, 'Great king!",
        "source": "T11n0312_004:0713c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當知有四種法，若如理修行者，即能安住大乘趣向勝道，所有善法而無壞失。",
        "translation": "Now, you should know that there are four things that, if correctly cultivated, will enable someone to stay in the great vehicle and head for the superior path, where all good qualities are not lost.",
        "source": "T11n0312_004:0713c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T11n0312_004:0713c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T11n0312_004:0713c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、信法能向勝道。",
        "translation": "\"One, faith in the teaching leads to the superior path.",
        "source": "T11n0312_004:0713c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復何名信？",
        "translation": "What's the name of that faith?",
        "source": "T11n0312_004:0713c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有信故而能隨順諸賢聖種，所不應作而悉不作。",
        "translation": "It means that because of faith, they can conform to the noble lineages of good men and refrain from doing what shouldn't be done.",
        "source": "T11n0312_004:0713c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、尊重能向勝道。",
        "translation": "Second, respectfulness leads to the superior path.",
        "source": "T11n0312_004:0713c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以尊重故，於諸聖者所說妙法而能聽受，諦受法故耳無外聽。",
        "translation": "Because of that respect, they can listen to and accept the wonderful things that are taught by noble people, and because they truly accept the teaching, their ears don't hear it from outside.",
        "source": "T11n0312_004:0713c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、無慢能向勝道。",
        "translation": "3. lacking conceit, they can head for the superior path.",
        "source": "T11n0312_004:0713c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無慢故，即能於彼一切賢聖恭信頂禮。",
        "translation": "Because they have no conceit, they can respectfully venerate all those good sages.",
        "source": "T11n0312_004:0713c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、精進能向勝道。",
        "translation": "4. effort is capable of heading for the superior path.",
        "source": "T11n0312_004:0713c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以精進故，若身若心悉得輕安，所作善法皆能成辦。",
        "translation": "Because of that effort, both body and mind are completely at ease, and the good things they do can be accomplished.",
        "source": "T11n0312_004:0713c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T11n0312_004:0713c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等四法若如理修行者，即能安住大乘趣向勝道。",
        "translation": "If these four things are correctly cultivated, they'll be able to stabilize in the great vehicle and head for the excellent path.",
        "source": "T11n0312_004:0713c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如來不思議祕密大乘經卷第四",
        "translation": "Foshuo rulai busiyi mimi dasheng jing, vol. 4",
        "source": "T11n0312_004:0713c29_0",
        "is_bad_quality": false
    }
]