[
    {
        "source_sentence": "大寶積經卷第九十六",
        "translation": "Mahāratnapratimaṇḍita-sūtra, Volume 96",
        "source": "T11n0310_096:0540a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏法師菩提流志奉　詔譯",
        "translation": "Translated by Imperial Decree by Bodhiruci, Master of the Tripiṭaka of the Great Tang",
        "source": "T11n0310_096:0540a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤授長者會第二十八",
        "translation": "Council of Elders for the Diligent Teaching of the Way 28",
        "source": "T11n0310_096:0540a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十人俱，皆是阿羅漢，諸漏已盡，無復煩惱得上調伏，猶如大龍，所作已辦，棄諸重擔，逮得己利，盡諸有結。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī with a large assembly of 1,250 monks, all of whom were arhats, had ended the contaminants, had no more afflictions, and had attained superior control, just like a great dragon who has accomplished his task, discarded the heavy burdens, attained his own benefit, and ended the bonds of existence.",
        "source": "T11n0310_096:0540a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正智解脫心得自在，最上應供，眾所知識。",
        "translation": "He has attained mastery over the mind and mind of right knowledge and liberation, and he is the most excellent offering to all knowables.",
        "source": "T11n0310_096:0540a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有阿難，猶在學地。",
        "translation": "Only Ānanda remains in the stage of training.",
        "source": "T11n0310_096:0540b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰：阿若憍陳如、摩訶迦葉、摩訶迦旃延、摩訶阿濕波、舍利弗、大目乾連、摩訶劫賓那、摩訶拘絺羅、摩訶梵頗、羅睺羅、難陀，如是等而為上首。",
        "translation": "Their names are Ājñāta-kauṇḍinya, Mahākāśyapa, Mahākātyāyana, Mahāśyapa, Śāriputra, Mahāmaudgalyāyana, Mahākauṣṭhila, Mahāvibhāga, Rāhula, and Nandāna, and so on, who are the leaders.",
        "source": "T11n0310_096:0540b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有菩薩摩訶薩五百人俱，皆得三昧及陀羅尼。",
        "translation": "There were another 500 bodhisattvas, Mahāsattvas, and they all attained samādhi and dhāraṇī.",
        "source": "T11n0310_096:0540b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍衛大城有一長者名勇猛授，富有財寶倉庫盈溢，金銀琉璃、車璩馬碯、珊瑚虎珀、摩尼真珠、象馬牛羊、奴婢僕使商估等類，一切眾多。",
        "translation": "At the time, there was an elder in the great city of Śrāvastī named Gṛdhrakūṭa who had an overflowing storehouse of wealth and treasure, including gold, silver, beryl, carts, horses, agates, coral, tiger pearls, precious maṇi pearls, elephants, horses, cattle, sheep, slaves, servants, messengers, merchants, and many other things.",
        "source": "T11n0310_096:0540b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勇猛授與五百長者遊讌聚會，作是議言：「諸仁者！",
        "translation": "At the time, Brave Grant was meeting with 500 elders for a pleasure gathering, and he said, \"Gentlemen!",
        "source": "T11n0310_096:0540b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛出世難，人身難得，時亦難遇，於佛法中以信出家是事亦難，成比丘性亦復甚難，如法修行是亦為難，知恩報恩少恩不忘是人難得，能於佛法生信樂心是人難得，信樂成就是事復難，莊嚴佛法是事亦難，解脫生死倍復為難。",
        "translation": "It's difficult for a buddha to appear in the world, difficult to obtain a human being, and difficult to encounter at the right time; it's also difficult to leave home with faith in the Buddha's teaching; it's also very difficult to become a monk; it's difficult to practice according to the teaching; it's difficult for someone to know and repay kindness and not forget a little kindness; it's difficult for someone to attain faith and happiness in the Buddha's teaching; it's again difficult to achieve faith and happiness; it's also difficult to adorn the Buddha's teaching; and it's doubly difficult to be liberated from birth and death.",
        "source": "T11n0310_096:0540b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等為於聲聞辟支佛乘而求滅度，為當發趣最上佛乘。」",
        "translation": "We seek [our] extinction for the vehicle of the śrāvakas and pratyekbuddhas, so that we can set out for the supreme Buddha vehicle.\"",
        "source": "T11n0310_096:0540b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸復唱言：「我等寧於無上佛道而趣涅槃。」",
        "translation": "They all then chanted, \"We'd rather go to nirvāṇa on the unsurpassed Buddha path.\"",
        "source": "T11n0310_096:0540b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是議已，前後圍遶出舍衛城向祇陀林，詣如來所頂禮佛足，右遶三匝却坐一面。",
        "translation": "After making this comment, they circled the front and back of the city, left Śrāvastī, headed for the Jetavana Grove, went to the Tathāgata, bowed their heads at the Buddha's feet, circled him three times to his right, and withdrew to sit to one side.",
        "source": "T11n0310_096:0540b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知而故問，告長者言：「汝等何緣今來我所？」",
        "translation": "Knowing this, the Bhagavān then asked the elders, \"What brings you to my place now?\"",
        "source": "T11n0310_096:0540b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勇猛授與五百長者從座而起，偏袒右肩右膝著地，合掌向佛白言：「世尊！",
        "translation": "Braveheart then rose from his seat with five hundred elders, bared his right shoulder, knelt on his right knee, put his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_096:0540b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等諸人同時集會作是議言：『佛世難遇，人身難得，乃至解脫生死倍復為難。",
        "translation": "We all gathered here together at the same time and said, 'The Buddha world is difficult to encounter, the human body is difficult to obtain, and even liberation from birth and death is doubly difficult.",
        "source": "T11n0310_096:0540b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等為於聲聞辟支佛乘而求滅度，為當發趣最上佛乘。』",
        "translation": "We seek [our] extinction for the vehicle of the śrāvakas and pratyekbuddhas, so we can set out for the supreme Buddha vehicle.'",
        "source": "T11n0310_096:0540b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸作是言：『我等寧於無上佛道而趣涅槃。』",
        "translation": "They all said, 'We'd rather go to nirvāṇa on the unsurpassed Buddha path.'",
        "source": "T11n0310_096:0540b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此議故，今詣如來、應、正等覺。",
        "translation": "Because of this discussion, we're now headed to the Tathāgata, the Worthy One, and the Perfectly Enlightened One.",
        "source": "T11n0310_096:0540b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_096:0540b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩志求阿耨多羅三藐三菩提者，應云何學？",
        "translation": "What should a bodhisattva-mahāsattva who aspires to seek supreme perfect enlightenment do in order to train?",
        "source": "T11n0310_096:0540b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應云何住？",
        "translation": "How should I stay?",
        "source": "T11n0310_096:0540c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修行？」",
        "translation": "How do we practice?\"",
        "source": "T11n0310_096:0540c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T11n0310_096:0540c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等發趣阿耨多羅三藐三菩提，來詣我所。",
        "translation": "You've come to me because you've set your sights on unsurpassed, correct enlightenment.",
        "source": "T11n0310_096:0540c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應當諦聽，善思念之。",
        "translation": "You should listen closely and consider it well.",
        "source": "T11n0310_096:0540c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸菩薩應學、應住、應所修行，當為汝說。」",
        "translation": "As bodhisattvas should train, abide, and practice, I will explain this for you.\"",
        "source": "T11n0310_096:0540c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸長者受教而聽。",
        "translation": "The elders then accepted the teaching and listened.",
        "source": "T11n0310_096:0540c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告長者：「菩薩摩訶薩於阿耨多羅三藐三菩提勝志樂者，當於一切眾生起大悲心，應廣修行，應勤熏習。",
        "translation": "The Buddha told the elders, \"A bodhisattva who has a superior intention for the unsurpassed, correct, and complete enlightenment should give rise to the mind of great compassion for all sentient beings, cultivate it broadly, and diligently cultivate it.",
        "source": "T11n0310_096:0540c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩於身命財及以妻子、倉庫舍宅、飲食衣服、車乘臥具、花鬘塗香、一切樂具，應無所著。",
        "translation": "Therefore, the bodhisattva should have no attachment to body, life, property, wives, storage buildings, food and clothing, bedding for vehicles, flowers and perfumes, or any other means of enjoyment.",
        "source": "T11n0310_096:0540c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_096:0540c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸眾生執著於身而生惡業，由惡業故墮地獄中。",
        "translation": "Because sentient beings cling to the body, bad actions are created, and it's because of bad actions that they fall into hell.",
        "source": "T11n0310_096:0540c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於眾生起大悲心，於身命財則不執著，便生善趣。",
        "translation": "If they give rise to the mind of great compassion for sentient beings, they won't cling to their bodies, lives, and possessions, and they'll be born in a good destiny.",
        "source": "T11n0310_096:0540c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩於阿耨多羅三藐三菩提勝志樂者，於諸眾生起慈悲已，應修大捨而不求報，不求報者應住戒律，三戒清淨應具忍辱，能忍諸惡應起精進不惜身命，應修一心安住禪定，應修智慧善巧方便，應於我人眾生壽命皆悉捨離。",
        "translation": "Therefore, after he arouses compassion for sentient beings, the bodhisattva Mahāsattva who has superior aspirations for the unsurpassed, perfect aspiration for enlightenment should cultivate great equanimity and not seek rewards; those who don't seek rewards should abide in morality and discipline; those who have purified the three precepts should possess forbearance; those who can tolerate evil should make effort and not spare their own lives; those who cultivate single-mindedness and abide in meditation; those who cultivate wisdom and skillful means should abandon all of us and the lives of sentient beings.",
        "source": "T11n0310_096:0540c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾生故，應行布施護持淨戒。",
        "translation": "For the sake of sentient beings, he should practice generosity and uphold pure precepts.",
        "source": "T11n0310_096:0540c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾生故，應修忍辱發起精進。",
        "translation": "For the sake of sentient beings, he should cultivate forbearance and arouse zeal.",
        "source": "T11n0310_096:0540c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾生故，應入禪定修習智慧善巧方便。」",
        "translation": "For the sake of sentient beings, they should enter meditation and cultivate wisdom and skillful means.\"",
        "source": "T11n0310_096:0540c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸長者復白佛言：「世尊！",
        "translation": "The elders then again said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_096:0540c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等於身及彼妻子一切財寶資生之具，心常愛惜。",
        "translation": "\"We always cherish all the things that provide for the birth of wealth and possessions in our bodies and in the minds of our wives.",
        "source": "T11n0310_096:0540c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_096:0540c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩云何觀察，於身命財能無貪悋？」",
        "translation": "How does the bodhisattva Mahāsattva observe that he can be free of craving for possessions of body and life?\"",
        "source": "T11n0310_096:0540c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告長者言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the elder, \"Good sons!",
        "source": "T11n0310_096:0540c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩於阿耨多羅三藐三菩提勝志樂者，應觀此身無量過患，微塵積集生住異滅，念念遷流九漏瘡門，猶如毒蛇所住窟穴，其中無主如空聚落，畢竟破壞如坏瓦瓶，惡露盈溢猶如穢器，受諸不淨猶如圊廁，不可觸動猶如惡瘡，貪美為患如雜毒食，不識恩德如未生怨，欺誤於人如惡知識，癡愛為害如友獼猴，斷智慧命猶如殺者，奪諸善法猶如劫賊，常求人便猶如怨讎，無有慈心猶如魁膾，難可承事如暴惡人，如箭著身觸之則痛，如朽腐舍常務修治，如老弱乘難可駈策，如毒蛇篋不可附近，如逆旅館疲苦所集，如孤獨舍無所攝屬，如獄卒伺害，如王者憂國，如邊城警畏，如惡國多災，如破器難持，如祠火無厭，如陽焰虛誑，如幻化惑人，如析芭蕉中無堅實，如水聚沫不可執持，如水上泡速起速滅，如河岸樹臨危動搖，如駛河流終歸死海。」",
        "translation": "菩薩摩訶薩於阿耨多羅三藐三菩提勝志樂者，應觀此身無量過患，微塵積集生住異滅，念念遷流九漏瘡門，猶如毒蛇所住窟穴，其中無主如空聚落，畢竟破壞如坏瓦瓶，惡露盈溢猶如穢器，受諸不淨猶如圊廁，不可觸動猶如惡瘡，貪美為患如雜毒食，不識恩德如未生怨，欺誤於人如惡知識，癡愛為害如友獼猴，斷智慧命猶如殺者，奪諸善法猶如劫賊，常求人便猶如怨讎，無有慈心猶如魁膾，難可承事如暴惡人，如箭著身觸之則痛，如朽腐舍常務修治，如老弱乘難可駈策，如毒蛇篋不可附近，如逆旅館疲苦所集，如孤獨舍無所攝屬，如獄卒伺害，如王者憂國，如邊城警畏，如惡國多災，如破器難持，如祠火無厭，如陽焰虛誑，如幻化惑人，如析芭蕉中無堅實，如水聚沫不可執持，如水上泡速起速滅，如河岸樹臨危動搖，如駛河流終歸死海。」",
        "source": "T11n0310_096:0540c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告長者：「次觀此身前後因緣，初從欲愛和合而生，為長養故咽於摶食，至於生藏痰陰消之。",
        "translation": "Again, he told the elder, \"Furthermore, when you examine the causes and conditions that precede and follow this body, you first see that it arises from the combination of desire and craving, swallows food given to it for nurturing, and reaches the growing store where the phlegm aggregate disappears.",
        "source": "T11n0310_096:0541a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次至黃藏將欲熟時，則變為酢。",
        "translation": "Next, when it's about to ripen in the yellow store, it turns to vinegar.",
        "source": "T11n0310_096:0541a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次至風藏風分汁滓，各別流行成大小便，汁變為血、血變為肉，肉處生脂、脂處為骨、骨中生髓，如是身緣前後不淨。",
        "translation": "Next, when it reaches the windy store, the juice and dregs of the windy part will each flow separately into urine and defecation, and the juice will turn into blood, the blood will turn into flesh, fat will grow where the flesh is, bone will grow where the fat is, and marrow will grow in the bone, so the body's causes and conditions are impure before and after.",
        "source": "T11n0310_096:0541a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩作是觀時，復應思惟，如此身者三百六十骨聚所成，如朽壞舍。",
        "translation": "When bodhisattvas observe this, they should also consider that this body is made of 360 bones, like a house that's rotted and decayed.",
        "source": "T11n0310_096:0541a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸節支持，以四細脈周匝彌布，五百分肉猶若泥塗，六脈相繫、五百筋纏、七百細脈以為編絡，十六麁脈鉤帶相連，有二肉繩長三尋半於內纏結，十六腸胃繞生熟藏，二十五氣脈猶如窓隙，一百七關穴如破碎器，八萬毛孔如亂草覆，五根七竅不淨盈滿，七重皮裹六味長養，猶如祠火吞受無厭。",
        "translation": "It's supported by four veins that circle around, 500 parts of flesh that look like mud, six veins that are bound together, 500 tendons that are tangled, 700 veins that are knitted together, 16 crude veins that are hooked and tied together, two flesh cords that are three and a half leagues long that are tangled up inside, 16 intestines and stomach that are surrounded by raw and ripened stores, 25 air veins that look like gaps, 107 shut-offs that look like broken containers, 80,000 pores that are covered like scraggly grass, five faculties and seven orifices that are impure and full, and seven layers of skin that are wrapped around six flavors that are long-lasting, like a shrine fire that's swallowed without tire.",
        "source": "T11n0310_096:0541a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之身，一切臭穢自性潰爛，誰當於此愛重憍慢？",
        "translation": "Such a body, with all its smelly self-nature festering, who would love and be proud of it?",
        "source": "T11n0310_096:0541a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯應觀察，如借他器、猶車運載、但為養育，至菩提故。」",
        "translation": "Only observe it as borrowing another vessel, like a chariot that carries but for nurturing, until it reaches enlightenment.\"",
        "source": "T11n0310_096:0541a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「是身眾穢器，　　猶如貯糞瓶，　凡夫無智慧，　　恃色生憍慢。",
        "translation": "It was then that the Bhagavān spoke this verse, \"This body is full of soiled vessels, like a dung-storing jar, and worldlings lack wisdom and become proud of form.",
        "source": "T11n0310_096:0541a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鼻中洟恒流，　　口氣常臭穢，　眼眵蟲遍身，　　誰當生淨想？",
        "translation": "With constant mucus flowing from their noses, foul breath in their mouths, and bugs and rhinoceroses all over their bodies, who would give rise to the idea of purity?",
        "source": "T11n0310_096:0541b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人執持炭，　　磨瑩欲令白，　假使至盡時，　　體色終無變。",
        "translation": "Like a person holding charcoal, they polish it with the intention of making it white, but even when it reaches its end, their body's color remains unchanged.",
        "source": "T11n0310_096:0541b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設欲淨其身，　　傾河以自洗，　身盡莫能淨，　　其事亦如是。」",
        "translation": "Suppose someone wants to purify their body and they were to pour a river into it to wash themselves, but nothing could purify their body until it was completely empty, and so it would be.\"",
        "source": "T11n0310_096:0541b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊說此偈已，復告五百諸長者言：「若諸菩薩發勝志樂趣於阿耨多羅三藐三菩提者，應觀此身四十四種。",
        "translation": "After the Bhagavān spoke this verse, he also told the five hundred elders, \"If bodhisattvas have aroused a resolute intention to pursue unsurpassed, perfect enlightenment, they should examine this body in 44 ways.",
        "source": "T11n0310_096:0541b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為四十四種？",
        "translation": "What are the forty-four kinds?",
        "source": "T11n0310_096:0541b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者此身可厭性無和合故，二者此身臭穢膿血常流故，三者是身不堅畢竟敗壞故，四者是身羸弱支節相持故，五者是身不淨穢惡流溢故，六者是身如幻誑惑凡愚故，七者是身瘡門九處常流故，八者是身火然欲火盛故，九者是身為火瞋火猛故，十者是身遍然癡火遍故，十一者是身盲冥貪瞋癡故，十二者是身墮網愛網覆故，十三者是身瘡聚瘡遍滿故，十四者是身不安四百四病故，十五者諸蟲住處八萬戶蟲故，十六者是身無常畢竟歸死故，十七者是身頑癡於法無知故，十八者猶如瓦器生住壞故，十九者是身逼迫多憂惱故，二十者無有救護必壞滅故，二十一者是身險惡諂誑難知故，二十二者如無底坑諸欲難滿故，二十三者如火受薪貪色無厭故，二十四者身無厭足貪受五欲故，二十五者如被捶打隨損害故，二十六者是身不定盛衰增減故，二十七者身隨心轉不正思惟故，二十八者身不知恩必棄塚間故，二十九者身為他食狐狼所噉故，三十者身如機關筋骨相持故，三十一者身不可觀膿血糞穢故，三十二者身不自由依飲食生故，三十三者身妄纏裹終敗壞故，三十四者身為惡友多逆害故，三十五者身為殺者自殘害故，三十六者身為苦器苦所逼故，三十七者身為苦聚五蘊生故，三十八者身為無主眾緣生故，三十九者是身無命離男女相故，四十者是身為空應觀蘊界處故，四十一者是身虛妄如夢中故，四十二者是身不實如幻化故，四十三者身為幻惑如陽焰故，四十四者身為欺誑如影像故。",
        "translation": "一者此身可厭性無和合故，二者此身臭穢膿血常流故，三者是身不堅畢竟敗壞故，四者是身羸弱支節相持故，五者是身不淨穢惡流溢故，六者是身如幻誑惑凡愚故，七者是身瘡門九處常流故，八者是身火然欲火盛故，九者是身為火瞋火猛故，十者是身遍然癡火遍故，十一者是身盲冥貪瞋癡故，十二者是身墮網愛網覆故，十三者是身瘡聚瘡遍滿故，十四者是身不安四百四病故，十五者諸蟲住處八萬戶蟲故，十六者是身無常畢竟歸死故，十七者是身頑癡於法無知故，十八者猶如瓦器生住壞故，十九者是身逼迫多憂惱故，二十者無有救護必壞滅故，二十一者是身險惡諂誑難知故，二十二者如無底坑諸欲難滿故，二十三者如火受薪貪色無厭故，二十四者身無厭足貪受五欲故，二十五者如被捶打隨損害故，二十六者是身不定盛衰增減故，二十七者身隨心轉不正思惟故，二十八者身不知恩必棄塚間故，二十九者身為他食狐狼所噉故，三十者身如機關筋骨相持故，三十一者身不可觀膿血糞穢故，三十二者身不自由依飲食生故，三十三者身妄纏裹終敗壞故，三十四者身為惡友多逆害故，三十五者身為殺者自殘害故，三十六者身為苦器苦所逼故，三十七者身為苦聚五蘊生故，三十八者身為無主眾緣生故，三十九者是身無命離男女相故，四十者是身為空應觀蘊界處故，四十一者是身虛妄如夢中故，四十二者是身不實如幻化故，四十三者身為幻惑如陽焰故，四十四者身為欺誑如影像故。",
        "source": "T11n0310_096:0541b12_2",
        "is_bad_quality": true
    },
    {
        "source_sentence": "是為四十四種。",
        "translation": "These are the forty-four kinds.",
        "source": "T11n0310_096:0541c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是觀時，所有身命愛欲執著，妻子舍宅飲食衣服、車乘香鬘一切樂具，皆悉厭離無所顧戀，速能成就六波羅蜜疾得阿耨多羅三藐三菩提。」",
        "translation": "When bodhisattvas observe this, they become free of all attachments to body and life, desires, wives, homes, food and clothing, carriages, and jewelry, and all other pleasures, and they quickly accomplish the six perfections and quickly attain unsurpassed, perfect enlightenment.\"",
        "source": "T11n0310_096:0541c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「善得人身甚為難，　　莫為此身造眾惡，　畢竟塚間餧狐狼，　　勿為惡見生貪愛。",
        "translation": "It was then that the Bhagavān spoke this verse, \"It's very difficult to attain a good human life, so don't create many bad deeds for this body, feed foxes and wolves in the final tomb, and don't give rise to craving for bad views.",
        "source": "T11n0310_096:0541c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡愚迷惑癡狂故，　　由愛此身造諸業，　此身亦復不知恩，　　晝夜唯增眾苦緣。",
        "translation": "Ordinary foolish people who are deluded and crazy create actions out of their craving for this body, and this body also doesn't know kindness, which only increases the causes of suffering day and night.",
        "source": "T11n0310_096:0541c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　機關動轉常疲困，　　洟唾便利恒充滿，　飢渴寒熱相煎迫，　　何有智者愛此身？",
        "translation": "With constant weariness from the mechanical barrier's movement, constant filling with saliva and fluids, and the torment of hunger, thirst, cold, and heat, why would any wise person love this body?",
        "source": "T11n0310_096:0541c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此身無厭如大坑，　　徒能長養眾怨害，　由此身故常作惡，　　於無量劫受諸苦。",
        "translation": "This body is unwearying like a great pit, which only nurtures resentment and harms people. Because of this body, it always does evil and suffers suffering for measureless eons.",
        "source": "T11n0310_096:0541c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應念定死修勝福，　　正信生於佛法中，　飲食衣服及塗香，　　長養此身來已久。",
        "translation": "They should be mindful of the superior merit of concentration and death, rightly believe in the birth of the Buddha's teaching, eat, clothe themselves, and anoint themselves with incense, and nurture this body for a long time to come.",
        "source": "T11n0310_096:0541c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　誰能執持令不壞，　　應知無益勿耽迷，　牟尼世尊難可遇，　　無量劫中時出現。",
        "translation": "Whoever can maintain it so that it doesn't break down should know it's useless and not get lost, for the World Honored Muni is hard to meet and appears at times throughout measureless eons.",
        "source": "T11n0310_096:0541c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當於佛法生淨信。",
        "translation": "He should give rise to pure faith in the Buddha's teachings.",
        "source": "T11n0310_096:0542a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　惡道可畏勿隨行，　設令壽命千億歲，　　猶懼無常生厭離，　何況須臾不可保，　　為彼沈淪惡趣中？",
        "translation": "Don't follow a fearful path, for even if it lasts a hundred billion years, you'd still fear impermanence and become disillusioned, so why wouldn't you be unable to protect yourself for a moment and sink into a bad destiny for them?",
        "source": "T11n0310_096:0542a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或有惡友來相勸，　　人身難得今已得，　多求財寶受娛樂，　　及此盛年恣嬉遊。",
        "translation": "Perhaps a bad friend comes along and encourages them, saying, \"Now that the human body is difficult to attain, let's seek much wealth and receive entertainment, and let's spend our prime years playing freely.",
        "source": "T11n0310_096:0542a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何有求財而樂者？",
        "translation": "How could anyone seek wealth and yet enjoy it?",
        "source": "T11n0310_096:0542a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　設得守護猶勤苦。",
        "translation": "\"Even if they could guard it, they'd still be diligent and pained.",
        "source": "T11n0310_096:0542a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如此愚人徒妄言，　　是故智者應觀察。",
        "translation": "Such foolish people speak falsely, so a wise person should examine them.",
        "source": "T11n0310_096:0542a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　財物如幻亦如夢，　　愚癡眾生被誑惑，　剎那時得剎那失，　　何有智者生愛心？",
        "translation": "'Property is like an illusion and a dream, and foolish sentient beings are deceived; they gain and lose momentarily, so why would a wise man become attached to it?'",
        "source": "T11n0310_096:0542a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如幻師幻化事，　　乾闥婆城種種色，　財寶如是誑凡愚，　　於虛妄中何有實？",
        "translation": "Like an illusionist's illusory transformation, the city of Gandhāra has a variety of forms, and its wealth and treasure thus serve to deceive ordinary fools.",
        "source": "T11n0310_096:0542a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種苦惱求財利，　　水火王賊常侵奪，　由此能為眾苦因，　　何有智者生愛樂？",
        "translation": "They seek wealth and profit from various afflictions, and are often plundered by fire, water, kings, and thieves.",
        "source": "T11n0310_096:0542a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有諸常懷貪愛者，　　馳逐財利無厭時，　能於父母無慈心，　　乃至親屬生怨害。",
        "translation": "\"Are there people who are constantly craving, who never tire of chasing after possessions and profits, who lack compassion for their parents, and whose relatives become hostile?",
        "source": "T11n0310_096:0542a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　言語善順心乖違，　　造作種種欺誑緣，　或學邪論邪呪等，　　誇衒伎藝如婬女。",
        "translation": "Their words are well-intentioned and contrary, and they create various deceptive conditions, or they learn wrong theories and wrong spells, or they exaggerate their skills like a promiscuous woman.",
        "source": "T11n0310_096:0542a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或復諂誑現柔和，　　或復剛強示威猛，　如是無量眾惡業，　　莫不皆由財利生。",
        "translation": "Sometimes they flatter people and show gentleness, or they're strong and demonstrative, and so on. There are countless bad actions, none of which are produced by wealth and profit.",
        "source": "T11n0310_096:0542a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　珊瑚金玉摩尼珠，　　是物本來如泡沫，　不能了知如幻化，　　為此虛誑墜三塗。",
        "translation": "Coral, gold, jade, and maṇi beads are originally like bubbles, but they can't be understood as illusory, so they falsely fall into the three destinies.",
        "source": "T11n0310_096:0542a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彌勒世尊出現時，　　一生次當補我處，　國界黃金而布地，　　是等為從何所來？",
        "translation": "When the Bhagavān Maitreya appeared, he would patch me up one more time in a lifetime, and he would spread gold across the country, so where did this come from?",
        "source": "T11n0310_096:0542a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　劫盡世間悉燒壞，　　須彌河海盡燋枯，　畢竟磨滅歸虛空，　　而此寶物何從去？",
        "translation": "At the end of an eon, the whole world is burned up, the Sumerian River and ocean are completely scorched up, and their final annihilation returns to space, but where will this precious thing go?",
        "source": "T11n0310_096:0542a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種惡業求財物，　　養育妻子謂歡娛，　臨命終時苦逼身，　　妻子無能相救者。",
        "translation": "They pursue various bad activities seeking wealth and possessions, nourish their wives, and call them pleasures, and when their life ends, suffering forces them to abandon their bodies, and their wives aren't able to help them.",
        "source": "T11n0310_096:0542a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼三塗怖畏中，　　不見妻子及親識，　車馬財寶屬他人，　　受苦誰能共分者？",
        "translation": "In the fear of those three destinies, they don't see their wives or intimate consciousnesses, and their chariots, horses, and treasure belong to others.",
        "source": "T11n0310_096:0542a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母兄弟及妻子，　　朋友僮僕并珍財，　死去無一來相親，　　唯有黑業常隨逐。",
        "translation": "Their parents, brothers, wives, friends, servants, and valuables, none of them come to be with them when they die, except for the black karma that always follows them.",
        "source": "T11n0310_096:0542b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智人終不為親愛，　　作諸惡業入阿鼻，　唯除業盡方得出，　　親屬無有能代者。",
        "translation": "A wise man never becomes attached, creating bad karma that enters avīci, and only when that karma is ended does he escape, and there's no one close to him who can take his place.",
        "source": "T11n0310_096:0542b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　閻羅使者唯考業，　　不問親緣及友朋，　汝得人身不捨惡，　　極苦今應甘忍受。",
        "translation": "Yama's messenger only examines karma, not relatives or friends, so you won't abandon evil in your person; now you should willingly endure extreme suffering.",
        "source": "T11n0310_096:0542b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　閻羅常告彼罪人，　　無有少罪我能加，　汝自作罪今自來，　　業報自招無代者。",
        "translation": "Yama always tells that person, \"There's no little sin I can inflict, and now you've done it yourself; the results of your actions will bring about their own retribution, and there's no substitute.",
        "source": "T11n0310_096:0542b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母妻子無能救，　　唯當勤修出離因，　是故應捨枷鏁業，　　善知遠離求安樂，　於家妻子應生怖，　　恒依佛教正修行，　在家熾然為苦本，　　猶如炎鑪甚可畏。",
        "translation": "Parents and wives can't be saved, but you must diligently cultivate the cause of emancipation; therefore, you must abandon the karma of bondage, well know that you're secluded, seek happiness, become frightened of your family and wife, and always rely on the correct practice of Buddhism; your home is a blazing source of suffering, like a hot stove that's very frightening.",
        "source": "T11n0310_096:0542b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身心燋熱鎮燒燃，　　誰有智者生貪著？",
        "translation": "With his body and mind scorching hot and burning, who is there a wise person who becomes attached to craving?",
        "source": "T11n0310_096:0542b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愛樂修行諸佛教，　　無所營求為快樂。",
        "translation": "\"Buddhists who cultivate the pursuit of happiness seek nothing for happiness.",
        "source": "T11n0310_096:0542b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚闇凡夫不覺知，　　家為苦本橫貪愛，　於彼皮筋骨肉中，　　迷惑妄生夫婦想，　不能了知如幻化，　　凡夫於此生貪著。",
        "translation": "A foolish man doesn't realize that home is the root of suffering and horizontal craving, and within that skin, bones, and flesh, delusion and falsehood create the perception of a husband and wife, which cannot be understood as illusory and transformative, and to which ordinary people become addicted.",
        "source": "T11n0310_096:0542b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者能知此過患，　　世間欲樂皆捐棄，　樂法當如求藥想，　　應速捨離居家縛。」",
        "translation": "A wise person who knows this misfortune will abandon all worldly desires and pleasures, and will enjoy the Dharma as he seeks medicine, quickly abandoning the bonds of home.\"",
        "source": "T11n0310_096:0542b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時五百長者聞此法已得無生忍，歡喜踊躍而說偈言：「慶哉獲大利，　　諸利中最上，　我等於佛法，　　皆生欣樂心。",
        "translation": "After hearing this teaching, the five hundred elders attained the patience of nonproduction, rejoiced, and jumped up and down in verse, saying, \"It's wonderful to attain great rewards, the greatest of all rewards, and we're all delighted with the Buddha's teaching.",
        "source": "T11n0310_096:0542b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　發趣於菩提，　　利樂眾生類，　以善而養命，　　覺慧自安心。",
        "translation": "We all arouse our resolve to achieve enlightenment, benefit and delight all sentient beings, nourish our lives with goodness, and awaken our wisdom with peace of mind.",
        "source": "T11n0310_096:0542b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憐愍諸眾生，　　願當成佛道，　我等皆已發，　　無上菩提心。",
        "translation": "With pity for sentient beings who wish to achieve the buddha path, we've all aroused the unsurpassed mind of enlightenment.",
        "source": "T11n0310_096:0542b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金色相莊嚴，　　照明於世界，　樂菩提心者，　　當得如來身。",
        "translation": "Adorned in golden form, we illuminate the world, and those who enjoy the mind of enlightenment will attain the Tathāgata's body.",
        "source": "T11n0310_096:0542b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大心菩提心，　　諸心中最上，　解脫一切縛，　　具足諸功德。",
        "translation": "A great mind, the mind of enlightenment, is the highest of all minds, freed from all fetters, and endowed with all merits.",
        "source": "T11n0310_096:0542c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　少福諸眾生，　　於此無欣樂，　不觀生死過，　　不樂菩提心。",
        "translation": "Sentient beings with little merit have no joy in it, don't contemplate the faults of birth and death, and don't delight in the mind of enlightenment.",
        "source": "T11n0310_096:0542c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩提心功德，　　若有色方分，　周遍虛空界，　　無能容受者？",
        "translation": "Could there be a single part of the merit of the bodhi-mind that would pervade the space realm and have no room for it?",
        "source": "T11n0310_096:0542c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恒河沙數等，　　諸佛剎土中，　假使布珍寶，　　供養於諸佛。",
        "translation": "There are so many buddha-lands, such as the sands of the Ganges, that even if they spread their treasures and make offerings to the buddhas, their merit is greater than that, and the limit is unobtainable.",
        "source": "T11n0310_096:0542c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有能一合掌，　　迴向菩提心，　其福過於彼，　　邊際不可得。",
        "translation": "If someone could clap their hands together and dedicate them to the mind of enlightenment, their merit would exceed theirs, and their limit would be unobtainable.",
        "source": "T11n0310_096:0542c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非唯供養福，　　餘福亦復然，　如是菩提心，　　最勝仙所說。",
        "translation": "Not just the merit of making offerings, but other merits as well, such is the mind of enlightenment that's most excellent, as described by the sage.",
        "source": "T11n0310_096:0542c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩提心最勝，　　如阿伽陀藥，　能除一切病，　　與一切安樂。",
        "translation": "The mind of enlightenment is most excellent, like agada, which removes all illnesses and brings about all kinds of well-being.",
        "source": "T11n0310_096:0542c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我見諸眾生，　　三火所熱惱，　智者無量劫，　　勤苦常修習。",
        "translation": "I've seen sentient beings who are tormented by the three fires, and the wise man has cultivated them with pain and suffering for measureless eons.",
        "source": "T11n0310_096:0542c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如醫王勇猛，　　具足菩提行，　救拔眾生苦，　　永離諸憂惱。",
        "translation": "Like the brave king of doctors, he possesses the practice of enlightenment, rescues sentient beings from suffering, and permanently escapes sorrow and vexation.",
        "source": "T11n0310_096:0542c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於一切生處，　　終不捨是心，　勤修諸行願，　　勇猛求佛法。",
        "translation": "He never gives up this mind in all places of birth, diligently cultivates his practices and vows, and vigorously seeks the Buddha's teaching.",
        "source": "T11n0310_096:0542c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等得善利，　　我等心欣樂，　今遇釋師子，　　當得如來身。」",
        "translation": "We attain good benefits, we're delighted at heart, and now we've met Shizi, the lion of the Śākyas, who will attain the Tathāgata's body.\"",
        "source": "T11n0310_096:0542c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即便微笑，從其面門放種種光，青黃赤白紅紫頗黎，照於無量無邊世界，乃至梵世日月威光皆悉隱蔽，還遶三匝從佛頂入。",
        "translation": "At that point, the Bhagavān smiled even as he radiated from the entrance of his face a variety of lights, blue, yellow, red, white, red, and purple, that shone in an infinite and unlimited world, even as the majestic light of the Brahmā sun and moon were all obscured, and he circled back three times and entered through the Buddha's head.",
        "source": "T11n0310_096:0542c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者阿難即從座起，偏袒右肩右膝著地，合掌向佛白言：「世尊！",
        "translation": "Venerable Ānanda then rose from his seat, bared his right shoulder, knelt on his right knee, put his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_096:0542c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何因緣現此微笑？",
        "translation": "What are the causes and conditions for this smile?",
        "source": "T11n0310_096:0542c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所現，非無因緣。」",
        "translation": "As the Buddha appears, it's not without a cause.\"",
        "source": "T11n0310_096:0542c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於佛前而說偈言：「諸佛最上之導師，　　不以無因現微笑，　哀愍世間利益者，　　願說所為之因緣。",
        "translation": "He then spoke a verse before the Buddha, saying, \"The buddhas' supreme guide doesn't smile for no reason, so he pities those who benefit the world and wishes to explain the causes and conditions for their actions.",
        "source": "T11n0310_096:0542c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貧乏眾生無法財，　　應說最上大乘施，　能作世間盲冥眼，　　願說微笑之因緣。」",
        "translation": "Poor sentient beings have no possessions, so they should explain the greatest great vehicle gift, which can be the blind and obscure eye of the world, and may explain the causes and conditions for smiling.\"",
        "source": "T11n0310_096:0543a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊告阿難曰：「汝見此五百長者今於我所發阿耨多羅三藐三菩提心不？」",
        "translation": "The Bhagavān then addressed Ānanda, \"Do you see these 500 elders now arousing the mind of unsurpassed, correct enlightenment in my place?\"",
        "source": "T11n0310_096:0543a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白言：「唯然已見。」",
        "translation": "Ānanda said, \"Only so, I've seen it.\"",
        "source": "T11n0310_096:0543a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「此五百長者，已於往昔百千億那由他諸佛所，承事供養種諸善根，今聞是法得無生忍。",
        "translation": "The Buddha told Ānanda, \"These 500 elders have cultivated good roots in the past by serving and making offerings to a hundred billion nayutas, and now that they've heard this teaching, they've attained the patience of nonproduction.",
        "source": "T11n0310_096:0543a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸長者，從是已後不生惡趣，於人天中常受快樂。",
        "translation": "From now on, these elders won't be born in a bad destiny and will always be happy among humans and gods.",
        "source": "T11n0310_096:0543a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於來世彌勒佛所，供養恭敬尊重讚歎。",
        "translation": "In the future, they'll go to Maitreya Buddha, make offerings, respect, venerate, and praise him.",
        "source": "T11n0310_096:0543a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及賢劫中一切諸佛，悉皆承事恭敬供養，於諸佛所聽聞正法，受持讀誦為他廣說。",
        "translation": "They all serve, respect, and make offerings to all the buddhas of the good eon, listen to and hear the right teaching from those buddhas, and they memorize, read, recite, and explain it to others.",
        "source": "T11n0310_096:0543a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過二十五劫，各於諸佛剎中成無上菩提，皆同一字號勝蓮花藏如來、應、正等覺。」",
        "translation": "After twenty-five eons, they each attain unsurpassed enlightenment in one of the buddha bases and are each called by the same name, Victorious Lotus Treasury Tathāgata, Worthy, and Perfectly Enlightened.\"",
        "source": "T11n0310_096:0543a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者阿難白佛言：「世尊！",
        "translation": "It was then that Venerable Ānanda said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_096:0543a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_096:0543a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有善逝！",
        "translation": "May there be a good death!",
        "source": "T11n0310_096:0543a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當何名此廣大法門？",
        "translation": "What shall we call this vast, great teaching?",
        "source": "T11n0310_096:0543a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you uphold it?\"",
        "source": "T11n0310_096:0543a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「是法門名『菩薩瑜伽師地』，亦名『勇猛授長者所問』，如是名號汝當受持。」",
        "translation": "The Buddha told Ānanda, \"This is the teaching called 'bodhisattva-yoga teacher ground,' and it's also called 'Courageous Granting of Questions to the Elders,' and such is the name you must bear.\"",
        "source": "T11n0310_096:0543a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，尊者阿難及諸比丘，五百長者、諸菩薩眾，天、人、阿修羅等，聞佛所說，皆大歡喜，信受奉行。",
        "translation": "After the Buddha taught this sūtra, Venerable Ānanda, the monks, the five hundred elders, the bodhisattva congregation, gods, humans, and asuras who heard what he taught rejoiced greatly, believed, accepted, and approved.",
        "source": "T11n0310_096:0543a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大寶積經卷第九十六",
        "translation": "Mahāratnapratimaṇḍita-sūtra, Volume 96",
        "source": "T11n0310_096:0543a22_0",
        "is_bad_quality": false
    }
]