[
    {
        "source_sentence": "大寶積經卷第九十五",
        "translation": "Mahāratnapratimaṇḍita-sūtra, Volume 95",
        "source": "T11n0310_095:0536c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏法師菩提流志奉　詔譯",
        "translation": "Translated by Imperial Decree by Bodhiruci, Master of the Tripiṭaka of the Great Tang",
        "source": "T11n0310_095:0536c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善順菩薩會第二十七",
        "translation": "The Twenty-seventh Assemblies of the Bodhisattvas of Shanshun",
        "source": "T11n0310_095:0536c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園，與諸大眾五百聲聞、十千菩薩恭敬圍遶。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī with a large crowd of 500 śrāvakas and 10,000 bodhisattvas respectfully surrounding him.",
        "source": "T11n0310_095:0536c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍衛城有一菩薩名曰善順，已於過去無量佛所種諸善根、承事供養，於阿耨多羅三藐三菩提得不退轉，住於大慈心不瞋恚，住於大悲弘濟無倦，住於大喜善安法界，住於大捨苦樂平等，節量時食少欲知足，常為眾生之所樂見。",
        "translation": "At the time, there was a bodhisattva in Śrāvastī named Shanshun who had planted good roots in measureless buddhas in the past, made offerings, attained irreversibility in the enlightenment of unsurpassed, abided in great kindness without anger, abided in great compassion without tire, abided in great joy that well-settled the Dharma realm, abided in great equanimity with equal pleasure and pain, ate sparingly at appropriate times with few desires, and knew fulfillment, and was always a joyful sight for sentient beings.",
        "source": "T11n0310_095:0536c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒以五戒及八齋法於某城中憐愍教化，然後復勸布施、持戒、忍辱、精進、禪定、智慧、慈悲喜捨、清淨梵行。",
        "translation": "He constantly teaches a certain city with kindness and compassion based on the five precepts and eight observances, and then encourages generosity, discipline, forbearance, effort, meditation, wisdom, kindness, compassion, joy, equanimity, and pure religious practice.",
        "source": "T11n0310_095:0537a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善順菩薩為令眾生見佛聞法，與諸人眾前後圍遶將詣佛所。",
        "translation": "At the time, the well-versed bodhisattva wanted to make sure that sentient beings would see the Buddha and hear the Dharma, so he and a group of people surrounded him from front to back and headed for the Buddha.",
        "source": "T11n0310_095:0537a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋以淨天眼見此菩薩，住上精進行頭陀行、具淨尸羅弘濟堅固，便自念言：「今此善順於諸梵行曾不懈息，將不為求帝釋處耶？",
        "translation": "When the god Śakra saw this bodhisattva with the pure divine eye, he abided in the highest state of zeal, practiced the ascetic practices, and perfected the firmness of the pure precepts, and then he thought to himself, \"Now, has this Shanshun never stopped following the religious practices, and won't he seek refuge with Śakra?",
        "source": "T11n0310_095:0537a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或貪王位及欲樂耶？」",
        "translation": "Do you crave the position of king and desire his pleasure?\"",
        "source": "T11n0310_095:0537a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即便化作四丈夫身至菩薩前，種種惡言毀罵菩薩，復以刀杖及於瓦石打擲加害。",
        "translation": "After that thought, he even transformed into the body of four great men and went up to the bodhisattva, abusing him with various harsh words and hurting him with knives, staves, and tiles and stones.",
        "source": "T11n0310_095:0537a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩住慈忍力，皆忍受之曾無瞋恨。",
        "translation": "The bodhisattva then abided in the power of compassion and tolerance, tolerating them all and never holding a grudge.",
        "source": "T11n0310_095:0537a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋復更化作四大丈夫，來語菩薩：「咄哉善順！",
        "translation": "Then, Indra again transformed into four great men and came to say to the bodhisattva, \"Duh, good sir!",
        "source": "T11n0310_095:0537a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸惡人以不善言罵辱於汝，及以瓦石刀杖之屬橫相打害，何不令我為汝讎報？",
        "translation": "Why don't those bad people insult you with unkind words and inflict harm on you with tiles, stones, knives, and sticks, so that I can take responsibility for your misdeeds?",
        "source": "T11n0310_095:0537a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當為汝斷彼命根。」",
        "translation": "I will cut off their life root for you.\"",
        "source": "T11n0310_095:0537a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩告彼人言：「善男子等莫作是語。",
        "translation": "It was then that the bodhisattva told those people, \"Good sons, don't say that.",
        "source": "T11n0310_095:0537a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若殺害者成就惡業。",
        "translation": "If you kill or harm someone, that will create bad karma.",
        "source": "T11n0310_095:0537a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使有人於我此身節節支解猶如棗葉，我終不生殺害之心。",
        "translation": "Suppose someone were to dismember this body of mine in sections like a jujube leaf, I would never give rise to the intention to kill them.",
        "source": "T11n0310_095:0537a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0537a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺害之人墮於地獄、餓鬼、畜生，乃至雖得人身，所生父母猶不愛念，恒為眾人之所憎惡。",
        "translation": "A person who kills is cast into hell, a hungry ghost, or an animal, and even though they've attained human birth, the parents they were born to still don't love them, and they're always hated by people.",
        "source": "T11n0310_095:0537a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_095:0537a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法凡有二種：一者善法，二者不善法。",
        "translation": "There are two kinds of all dharmas: good dharmas and unskillful dharmas.",
        "source": "T11n0310_095:0537a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由不善法墮於惡趣，若依善法獲於福利。」",
        "translation": "From unwholesome qualities they fall into bad destinies, but if they rely on wholesome qualities, they attain welfare.\"",
        "source": "T11n0310_095:0537a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善順菩薩欲重宣此義而說偈言：「善惡猶種植，　　皆隨業所生，　何有苦子因，　　成熟甘果者？",
        "translation": "It was then that the well-versed bodhisattva wanted to reiterate this meaning and spoke in verse, \"Good and evil are like seeds that are planted and produced according to actions, so why is there a cause of suffering that produces a sweet fruit?",
        "source": "T11n0310_095:0537a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現見法如是，　　智者應思惟，　苦報酬惡緣，　　為善常安樂。」",
        "translation": "Seeing things as they are, a wise person should consider this as a reward for suffering and a constant source of happiness for good.\"",
        "source": "T11n0310_095:0537a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天帝所化之人聞是言已，自念不能令彼菩薩為殺害業，忽然不現。",
        "translation": "After hearing these words, the person whom Emperor Tiandi had transformed suddenly disappeared, thinking to himself that he couldn't cause that bodhisattva to commit murder.",
        "source": "T11n0310_095:0537b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天帝復更化作金銀寶聚，令諸丈夫至菩薩所，作如是言：「汝可方便取此珍寶隨意所用。」",
        "translation": "Thereupon, Indra again transformed himself into a heap of gold and silver jewelry and sent the husbands to the bodhisattva, saying, \"You may conveniently take this treasure and use it as you like.\"",
        "source": "T11n0310_095:0537b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩告彼人言：「諸善男子莫作是說。",
        "translation": "The bodhisattva then told those people, \"Good sons, don't say that.",
        "source": "T11n0310_095:0537b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0537b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫盜業者能令眾生貧窮下劣無依無怙。",
        "translation": "\"The act of stealing can cause sentient beings to be poor, inferior, and without support or foundation.",
        "source": "T11n0310_095:0537b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使我貧命不存濟，終不行於不與取法。",
        "translation": "Even if I were poor and didn't survive to save my life, I wouldn't be able to stop taking what's not given.",
        "source": "T11n0310_095:0537b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸君當知，凡夫愚冥貪求覆蔽，何有智人行不與取？」",
        "translation": "You should know that ordinary foolish people are hindered by greed, so why would any wise person practice taking what's not given?\"",
        "source": "T11n0310_095:0537b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善順菩薩而說偈言：「積財雖千億，　　貪著心不捨，　智者說此人，　　在世恒貧苦。",
        "translation": "It was then that the well-versed bodhisattva spoke this verse, \"Although he has accumulated a hundred billion possessions, he clings to them with greed and doesn't abandon them, and the wise man says this person is always poor and suffering in the world.",
        "source": "T11n0310_095:0537b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼雖無一物，　　安住捨離心，　智者說斯人，　　世間最富貴。",
        "translation": "Although he doesn't have a single thing, he abides in equanimity, and the wise man says this person is the richest in the world.",
        "source": "T11n0310_095:0537b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者離諸惡，　　一切皆端嚴，　愚夫由作罪，　　舉身皆醜陋。",
        "translation": "The wise man is free of evil, and all things are dignified, while a foolish man's body is ugly because of the sins he commits.",
        "source": "T11n0310_095:0537b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者勸修善，　　愚夫恒為惡，　寧受智毀罵，　　不用愚稱讚。」",
        "translation": "A wise man encourages the cultivation of goodness, but a foolish man always does evil; he'd rather be rebuked by wise men than praised by foolish ones.\"",
        "source": "T11n0310_095:0537b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼天帝所化之人聞是言已悵然而去。",
        "translation": "After hearing those words, the person whom Emperor Tiandi had converted left in sadness.",
        "source": "T11n0310_095:0537b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天帝復自親試持俱胝金，至菩薩所作如是言：「我先於此舍衛大城，波斯匿王與餘丈夫有所諍論，須得一人為我曲證。",
        "translation": "The god then personally tried to carry the corpuscles of gold to the bodhisattva and said, \"Here in the great city of Śrāvastī, King Prasenajit and some other husbands had a dispute, and I needed someone to testify for me.",
        "source": "T11n0310_095:0537b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能為我作證人者，當用此金而以相奉。」",
        "translation": "If you can be a witness for me, you'll use this gold to present to me.\"",
        "source": "T11n0310_095:0537b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩告帝釋言：「仁者當知，夫妄語者為不善業，既誑自身，亦誑天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽。",
        "translation": "It was then that the bodhisattva addressed Tīrṣa, \"Sir, you should know that false speech is unwholesome activity that not only harms oneself but also gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, and mahoragas.",
        "source": "T11n0310_095:0537b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由於妄語，能為一切惡之根本，趣不善道、毀清淨戒，能壞色身、口氣常臭，所出言詞為人惡賤。」",
        "translation": "Because of false speech, it can be the root of all evil, lead to an unwholesome path, disparage the pure precepts, destroy the physical body, and have a bad breath, and produce words that are despised by people.\"",
        "source": "T11n0310_095:0537b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩重說偈言：「妄語之人，　　口氣常臭，　　入苦惡道，　無能救者。",
        "translation": "The bodhisattva then repeated the verse, saying, \"A person who speaks falsely, whose breath always smells bad, enters a painful and evil path, and there's no one who can save them.",
        "source": "T11n0310_095:0537b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　夫妄語者，　　誑於自身，　亦誑天龍，　　摩睺羅等。",
        "translation": "Someone who speaks falsely will deceive themselves, as well as gods, dragons, Mahoraga, and others.",
        "source": "T11n0310_095:0537c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當知妄語，　為諸惡本，　　毀清淨戒，　　死入三塗。",
        "translation": "You should know that false speech is the root of evil, disparages pure precepts, and leads to death in the three destinies.",
        "source": "T11n0310_095:0537c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝設與我，　　滿閻浮金，　　我終不能，　作於妄語。」",
        "translation": "Suppose you were to give me a full pile of gold, but I could never make a false statement.\"",
        "source": "T11n0310_095:0537c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋聞說是已忽然不現。",
        "translation": "After hearing this, the god Indra suddenly disappeared.",
        "source": "T11n0310_095:0537c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天帝復令舍支夫人、日光夫人及於五髻諸夫人等，往菩薩所，重加試鍊壞其禁戒。",
        "translation": "Then the emperor also sent Lady Śaścī, Lady Nikko, and the ladies of the five topknots to the bodhisattva's place to retest and break his precepts.",
        "source": "T11n0310_095:0537c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍支等即與五百盛年女人，以香塗身花粧藻飾，於後夜分至菩薩前而作是言：「我等女人年色姝盛，願親枕席相與為歡。」",
        "translation": "Śākyamuni and the others then gathered five hundred women in the prime of life, smeared their bodies with incense, decorated them with flowers, and went to the bodhisattva at the latter part of the night and said, \"We women are so beautiful in years that we'd like to share a bed and seat with them.\"",
        "source": "T11n0310_095:0537c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩以無染眼觀彼諸女，告之言曰：「地獄、畜生、閻羅王界，諸狂亂者、不正心者，耽昏臭穢膿血不淨，愛惡羅剎是汝親友，非諸天人清淨眷屬。」",
        "translation": "The bodhisattva then looked at those women with the undefiled eye and told them, \"Hell, animals, and the realm of Yama, those who are crazy and incorrect-minded, those who are confused, smelly, filthy, pus-blooded, and impure, and those who love bad rājas are your friends and relatives, not the pure followers of gods and humans.\"",
        "source": "T11n0310_095:0537c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩重說偈言：「愚人昏迷念不淨，　　耽染臭穢膿血身，　諸欲迅滅歸無常，　　永沈地獄閻羅界。",
        "translation": "It was then that the bodhisattva repeated the verse, saying, \"A foolish man's delusion and mindfulness are impure, his body is tainted with odor, filth, pus, and blood, his desires quickly cease and become impermanent, and he's permanently sunken into the hellish Yama's realm.",
        "source": "T11n0310_095:0537c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假令變化如汝等，　　色身殊勝滿世間，　我無一念貪染心，　　常生如夢如怨想。」",
        "translation": "Suppose you were to change like you, and your physical body were to fill the world with excellence, but I wouldn't have a single thought of greed or defilement that always gives rise to dreams and resentments.\"",
        "source": "T11n0310_095:0537c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍支等雖盡變態，而彼菩薩曾無貪染，各還天宮白帝釋言：「我觀善順志願堅固，當成正覺無有疑也。",
        "translation": "Although all of these Śākyas and others had undergone their transformations, the bodhisattvas who had never been defiled by craving each returned to the heavenly palace and said to Śākyamuni, \"I observe that Śrī Yaśas have a resolute resolve and will, and there's no doubt that they'll achieve perfect awakening.",
        "source": "T11n0310_095:0537c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0537c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於我等無少貪愛，但生厭離。」",
        "translation": "They have no desire for us, but become disillusioned with us.\"",
        "source": "T11n0310_095:0537c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時帝釋雖聞此言，猶懷憂惱如箭中身，恒作是念：「彼人必當毀奪於我，無有疑惑。",
        "translation": "Even though he heard those words, Indra still harbored sorrow like an arrow striking his body, and he kept thinking, \"That person will surely disparage me, without any doubts.",
        "source": "T11n0310_095:0537c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今應往重加試之，於諸願中的何所願？」",
        "translation": "Now, I should go there and test him again; what is it that I wish for among the vows?\"",
        "source": "T11n0310_095:0537c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思已至菩薩前，捨去憍慢頭頂禮足，以偈問曰：「仁今勤修淨梵行，　　於諸欲願何所求？",
        "translation": "After this thought, he went up to the bodhisattva, put aside his pride, bowed his head at his feet, and asked in a verse, \"Now, Sir, are you diligently cultivating the pure religious practice, and what do you seek in your desires and wishes?",
        "source": "T11n0310_095:0537c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為求日月釋梵天？",
        "translation": "What is the purpose of seeking the sun, moon, and Brahmā?",
        "source": "T11n0310_095:0538a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為求三有諸王位？」",
        "translation": "Why do you seek the position of king in the three realms?\"",
        "source": "T11n0310_095:0538a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善順菩薩以偈答曰：「我觀日月釋梵天，　　世間王位三有報，　一切無常不堅固，　　何有智者為茲願？」",
        "translation": "It was then that the Zenshun Bodhisattva replied in verse, \"I've observed the sun, moon, and Indra heavens, and I've observed the three worldly rewards of kingship, and all things are impermanent and not solid, so why would any wise person wish for this?\"",
        "source": "T11n0310_095:0538a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天帝聞此頌已，復白菩薩：「若如所言，為求何願？」",
        "translation": "After hearing this verse, Indra then again said to the bodhisattva, \"If it's as you say, what vow are you seeking?\"",
        "source": "T11n0310_095:0538a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是菩薩以偈答曰：「我本不貪世間樂，　　但求不生不滅身，　勤修方便濟群生，　　願同登彼菩提路。」",
        "translation": "The bodhisattva then replied in verse, \"I originally didn't crave worldly pleasures, but sought a body that neither arises nor ceases, diligently cultivated skillful means to help all sentient beings, and wished to ascend to the bodhi path together.\"",
        "source": "T11n0310_095:0538a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天帝聞是頌已心生安樂，必知菩薩不求釋位。",
        "translation": "After hearing this verse, the god Ti became comfortable in his mind and surely knew that the bodhisattva wasn't seeking the position of Buddhahood.",
        "source": "T11n0310_095:0538a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歡喜踊躍，以偈歎曰：「汝言弘濟為群生，　　此心廣大無與等，　願破魔軍證甘露，　　由斯恒轉勝法輪。」",
        "translation": "Rejoicing and jumping for joy, he praised them in verse, \"You say you're helping the masses of sentient beings, so vast is your mind that there's no equal, may you destroy the armies of Māra and realize the ambrosia, and from there you'll always turn the wheel of the excellent Dharma.\"",
        "source": "T11n0310_095:0538a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天帝說是偈已，恭敬旋遶禮菩薩足，忽然不現。",
        "translation": "After he spoke this verse, Emperor Tiandi respectfully circled around and bowed his head at the bodhisattva's feet, and suddenly he didn't appear.",
        "source": "T11n0310_095:0538a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善順菩薩於其晨朝入舍衛城遊化往來，得劫初時閻浮金鈴，其鈴價直過閻浮提。",
        "translation": "At the time, the well-adjusted bodhisattva entered Śrāvastī in the morning and traveled there to obtain a gold Jambu bell from the beginning of the eon that was worth more than Jambudvīpa.",
        "source": "T11n0310_095:0538a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩持此金鈴，於四衢中高聲唱言：「此舍衛城誰最貧窮，當以此鈴而施與之。」",
        "translation": "Holding this gold bell, the bodhisattva raised his voice in the four quadrants and said, \"Whoever is the poorest in this city of Śrāvastī should give this bell to him.\"",
        "source": "T11n0310_095:0538a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有最勝耆舊長者，聞是語已奔走而來，白菩薩言：「我於此城最為貧窮，可持此鈴而施於我。」",
        "translation": "Upon hearing those words, the most distinguished elderly man rushed over and said to the bodhisattva, \"I'm the poorest in this city; take this bell and give it to me.\"",
        "source": "T11n0310_095:0538a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩語長者言：「汝非貧者。",
        "translation": "The bodhisattva then said to the elder, \"You're not poor.",
        "source": "T11n0310_095:0538a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0538a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此城中，有善男子貧中最貧，應以此鈴而施與之。」",
        "translation": "In this city, there's a good man who's the poorest of the poor; he should give this bell to him.\"",
        "source": "T11n0310_095:0538a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者問言：「誰為此人？」",
        "translation": "The elder asked, \"Who's this person?\"",
        "source": "T11n0310_095:0538a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩答言：「波斯匿王於此城中最為貧者。」",
        "translation": "The bodhisattva replied, \"King Prasenajit is the poorest person in this city.\"",
        "source": "T11n0310_095:0538a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者謂菩薩言：「莫作是說。",
        "translation": "The elder then said to the bodhisattva, \"Don't say that.",
        "source": "T11n0310_095:0538a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0538a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿王富貴多財庫藏盈溢、珍奇賄貨用無窮盡。",
        "translation": "King Prasenajit had an overflowing treasury of wealth and possessions, and he used endless amounts of rare and valuable goods.",
        "source": "T11n0310_095:0538a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何乃言貧中最貧？」",
        "translation": "Why did he say he was the poorest of the poor?\"",
        "source": "T11n0310_095:0538a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩於大眾中以偈答言：「設有伏藏千億餘，　　以貪愛心無厭足，　猶如大海吞眾流，　　如斯愚人最為貧。",
        "translation": "The bodhisattva then answered the crowd with a verse, \"There are a hundred billion more stores that have been concealed, and because of craving, his mind isn't satisfied, it's like an ocean swallowing up all the currents, and such a foolish man is the poorest of the poor.",
        "source": "T11n0310_095:0538a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由此復令貪增長，　　展轉滋蔓相續生，　於現在世及未來，　　彼無智者常貧匱。」",
        "translation": "This also causes craving to grow and develop, continuing to grow and spread, and in the present and future, that ignorant person is always poor.\"",
        "source": "T11n0310_095:0538b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善順菩薩說此偈已，與諸大眾即便往詣波斯匿王。",
        "translation": "After he spoke this verse, the well-versed bodhisattva and the others went to King Prasenajit.",
        "source": "T11n0310_095:0538b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時彼王方與長者五百餘人算數校計庫藏財寶。",
        "translation": "The king then had 500 or so elders count and calculate the treasury's wealth and possessions.",
        "source": "T11n0310_095:0538b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時前白王言：「我於此城往來遊化，得劫初時閻浮金鈴，其鈴價直過閻浮提。",
        "translation": "The bodhisattva then went forward and said to the king, \"I've traveled to this city and found a gold bell from Jambudvīpa at the beginning of the eon that's worth more than Jambudvīpa.",
        "source": "T11n0310_095:0538b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼時竊作是念：『於此城中有最貧者，當持此鈴而施與之。』",
        "translation": "At the time, I secretly thought, 'There's the poorest person in this city, so I should take this bell and give it to him.'",
        "source": "T11n0310_095:0538b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更思惟：『城中最貧莫過王者。』",
        "translation": "Again, I thought, 'There's no poorer person in the city than the king.'",
        "source": "T11n0310_095:0538b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今齎此鈴願以相奉，王既貧窮為我受之。」",
        "translation": "Now, I'll bring this bell and vow to give it to him, for the king is poor and will accept it for me.\"",
        "source": "T11n0310_095:0538b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩作是言已重說偈言：「若人多貪求，　　積財無厭足，　如是狂亂人，　　名為最貧者。",
        "translation": "After he said this, the bodhisattva repeated the verse, \"Suppose someone covets a lot and accumulates wealth without tire, such a crazy person is called the poorest of the poor.",
        "source": "T11n0310_095:0538b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　王恒多賦稅，　　橫罰無過人，　愛著於國城，　　不觀來世業。",
        "translation": "The king constantly taxes much, punishes no one outrageously, becomes attached to the country's cities, and doesn't contemplate actions in the future.",
        "source": "T11n0310_095:0538b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於世得自在，　　不能蔭群生，　見諸貧苦人，　　曾無憐愍念。",
        "translation": "Attaining independence in the world, he can't overshadow crowds of living beings and sees poor people in poverty who have no compassion for him.",
        "source": "T11n0310_095:0538b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　耽染於女人，　　不懼於惡道，　邪亂未常覺，　　豈非貧窮者？",
        "translation": "He's addicted to women, has no fear of the evil path, and is not always aware of wrongdoing.",
        "source": "T11n0310_095:0538b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人知淨信，　　歸依佛法僧，　於身及命財，　　常念不堅固。",
        "translation": "\"If someone knows pure faith and takes refuge in the Buddha, Dharma, and Saṃgha, they'll always be mindful that they aren't resolute when it comes to body and life and property.",
        "source": "T11n0310_095:0538b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知不堅固已，　　於彼不迷惑，　能於身命財，　　永得常堅固。",
        "translation": "After knowing that they aren't stubborn, they aren't confused about them and can always attain stability in body, life, and property.",
        "source": "T11n0310_095:0538b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能勤念住，　　樂於不放逸，　彼人名富貴，　　善財常安樂。",
        "translation": "If they can diligently abide in mindfulness and enjoy nonfrivolity, they'll be known as wealthy and powerful, and their good fortune will always be comfortable.",
        "source": "T11n0310_095:0538b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如火焚燒時，　　不厭於林樹，　王今亦如是，　　貪愛無厭足。",
        "translation": "Like a forest or tree that doesn't grow weary when it's burning, the king is likewise now, insatiable in his craving.",
        "source": "T11n0310_095:0538b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　水不厭於雲，　　海不厭於水，　王今亦如是，　　何有厭足時。",
        "translation": "When water doesn't tire of clouds, and the ocean doesn't tire of water, the king is likewise now, so why is there a time when he grows weary of it?",
        "source": "T11n0310_095:0538b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　日月常巡歷，　　不厭於四方，　王今亦如是，　　終命無休息。",
        "translation": "The sun and moon always travel around, never tiring of the four directions, just as the king does now, so there's no rest in his final life.",
        "source": "T11n0310_095:0538c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如火焚燒時，　　不厭於草木，　智人亦如是，　　未甞不行善。",
        "translation": "Like a fire that burns, he doesn't tire of grass and trees, and so does the wise man, who never fails to do good deeds.",
        "source": "T11n0310_095:0538c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如水不厭雲，　　如海不厭水，　智人亦如是，　　不厭善增長。",
        "translation": "Like water that doesn't tire of clouds, or like the ocean that doesn't tire of water, so does the wise man not tire of growing goodness.",
        "source": "T11n0310_095:0538c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　王位雖自在，　　畢竟歸無常，　一切皆不淨，　　智者應捨離。」",
        "translation": "Although he may be at ease in his position as king, his final destination is impermanent, and all things are impure, so a wise man should abandon them.\"",
        "source": "T11n0310_095:0538c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王聞斯語已，內懷慚愧謂菩薩曰：「善哉仁者！",
        "translation": "After hearing these words, King Prasenajit said to the bodhisattva with an inner sense of shame, \"Good, sir!",
        "source": "T11n0310_095:0538c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝雖善勸，我猶未信。",
        "translation": "Although you have well-advised me, I'm still not convinced.",
        "source": "T11n0310_095:0538c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今汝斯言，為汝自說？",
        "translation": "Now, are you saying this for yourself?",
        "source": "T11n0310_095:0538c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為有證乎？」",
        "translation": "Is there realization?\"",
        "source": "T11n0310_095:0538c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩答言：「汝不聞耶？",
        "translation": "The bodhisattva replied, \"Don't you hear?",
        "source": "T11n0310_095:0538c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正等覺具一切智，今者現與無量天人、乾闥婆、阿修羅等，在於舍衛大城祇樹給孤獨園，當證大王是貧窮人。」",
        "translation": "The Tathāgata, the Worthy One, and the Perfectly Enlightened One possess all wisdom, and now he's with measureless gods, humans, gandharvas, asuras, and others at Anāthapiṇḍada Park in Jeta Grove in the great city of Śrāvastī, where they will realize that the king is a poor man.\"",
        "source": "T11n0310_095:0538c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「仁者！",
        "translation": "The king said, \"Sir!",
        "source": "T11n0310_095:0538c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如汝說，我願相與往見如來，聽聞教誨歸依供養。」",
        "translation": "If it's as you say, I'd like to go with you to see the Tathāgata, hear his teachings, and make offerings.\"",
        "source": "T11n0310_095:0538c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩答言：「大王當知，如來境界非諸凡愚之所能測，破煩惱慢哀愍眾生，已於聖智能知此世及於來世。",
        "translation": "The bodhisattva replied, \"Great king, you should know that the Tathāgata's state is unfathomable by ordinary foolish people, that he refutes affliction and conceit, that he pities sentient beings, and that he has learned noble wisdom about this world and the next.",
        "source": "T11n0310_095:0538c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善根勝意樂者，雖在極遠佛常加護。",
        "translation": "If someone has good roots and superior intentions, the Buddha will always protect them even though they're far away.",
        "source": "T11n0310_095:0538c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知我心，欲令大王於我生信，必當來此為我作證。」",
        "translation": "If he knows my mind and wants to convince the king of me, he will surely come here to testify for me.\"",
        "source": "T11n0310_095:0538c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩即於王前偏袒一肩，右膝著地合掌恭敬，即以偈頌請如來曰：「如來真實智，　　悲愍諸群生，　願知我深心，　　垂哀為作證。」",
        "translation": "The bodhisattva then bared one shoulder in front of the king, knelt on his right knee, put his palms together in respect, and invited the Tathāgata with a verse, saying, \"The Tathāgata's true wisdom is compassionate toward sentient beings, may he know my profound thoughts and compassionately testify for them.\"",
        "source": "T11n0310_095:0538c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩說偈請已，於彼大地忽然震裂。",
        "translation": "After the bodhisattva spoke the verse of invitation, the earth suddenly shook and rended.",
        "source": "T11n0310_095:0538c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百聲聞，十千菩薩，梵釋諸天及於龍鬼，無量眾生圍遶如來，從地踊出。",
        "translation": "Five hundred śrāvakas, ten thousand bodhisattvas, Brahmā, Śakra gods, dragons, and ghosts, and measureless multitudes of beings surrounded the Tathāgata and sprang out of the ground.",
        "source": "T11n0310_095:0538c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善順菩薩合掌恭敬，前白佛言：「世尊！",
        "translation": "With folded palms and respect, the well-adjusted bodhisattva went forward and said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_095:0538c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先於此舍衛城中遊化往來，得劫初時閻浮金鈴，其鈴價直過閻浮提。",
        "translation": "When I first traveled to this city of Śrāvastī and came back, I obtained a gold Jambū bell from the beginning of the eon that was worth more than Jambudvīpa.",
        "source": "T11n0310_095:0538c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於爾時便作是念：『若有眾生於舍衛城最貧窮者，當以此鈴而施與之。』",
        "translation": "At the time, I thought, 'If there are sentient beings in Śrāvastī who are the poorest of the poor, I will give them this bell.'",
        "source": "T11n0310_095:0539a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復自思惟：『波斯匿王於此城中最為貧者。",
        "translation": "Again, he thought, 'King Prasenajit is the poorest person in this city.",
        "source": "T11n0310_095:0539a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0539a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恃於王位，於諸眾生未嘗憐愍，殘剝欺奪橫加侵損，貪愛覆蔽不知厭足。』",
        "translation": "Riding on his position as king, he shows no compassion for sentient beings, brutally exploits and deceives them, and violates them by covering them with greed and not knowing when he's satisfied.'",
        "source": "T11n0310_095:0539a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以此王為最貧者，欲將金鈴而施與之。",
        "translation": "Considering this king to be the poorest of the poor, I wanted to give him a gold bell.",
        "source": "T11n0310_095:0539a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問我言：『謂我貧窮，誰為證者？』",
        "translation": "The king asked me, 'Who's the witness that I'm poor?'",
        "source": "T11n0310_095:0539a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我又答云：『如來大師應、正等覺，捨離煩惱瞋垢無餘，於諸眾生悉皆平等，當為作證。』",
        "translation": "I also answered, 'The Tathāgata, the great teacher, worthy and perfectly enlightened, is free of the defilement of affliction and anger without remainder, and he will realize that all sentient beings are equal.'",
        "source": "T11n0310_095:0539a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊示教利喜。」",
        "translation": "Please let the Bhagavān show you how to teach and bring benefit and joy to them.\"",
        "source": "T11n0310_095:0539a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為欲調伏波斯匿王，而告之曰：「大王當知，或有於法，善順貧窮、王為富貴。",
        "translation": "It was then that the Bhagavān wanted to subdue King Prasenajit and told him, \"Great king, you should know that there are things that are good for the poor and good for the king's wealth.",
        "source": "T11n0310_095:0539a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有於法，王為貧窮、善順富貴。",
        "translation": "There may be things that make a king poor and a king well-suited to wealth and prosperity.",
        "source": "T11n0310_095:0539a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0539a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身登王位於世自在，金銀摩尼車璩珊瑚庫藏盈滿；當於此時善順貧窮、王為富貴。",
        "translation": "\"When he ascends to the position of king and attains worldly sovereignty, his gold and silver maṇi chariot is full of coral, and the king's treasury is filled, so he'll skillfully submit to the poor and become rich and powerful.",
        "source": "T11n0310_095:0539a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤修梵行、樂淨尸羅、捨家多聞、離諸放逸、八齋五戒、弘濟無疲。",
        "translation": "He diligently cultivates the religious practice, takes delight in purifying the śīla, leaves home and is well-versed, parts with carelessness, observes the eight precepts, and promotes the five precepts without tire.",
        "source": "T11n0310_095:0539a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一於此，王實貧窮、善順富貴。",
        "translation": "If there's one of these, the king is really poor, and he's well-adjusted and wealthy.",
        "source": "T11n0310_095:0539a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王今應知，憍薩羅國一切眾生財物庫藏，比於善順五戒八齋堅固清淨，百分千分不及其一，至俱胝分亦不及一。」",
        "translation": "Now, the king should know that the wealth and possessions of all the sentient beings in Kauśālaka are no more solid and pure than the five precepts and eight purifications of Shanshun, which is less than one out of a thousand and less than one out of a koṭī.\"",
        "source": "T11n0310_095:0539a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王親聞如來真實教誨，捨所憍慢，合掌慇懃瞻仰善順，而說偈言：「善哉摧伏我憍慢，　　當得如來最勝身，　以此王位捨於汝，　　願恒為汝菩提眾。",
        "translation": "It was then that King Prasenajit heard the Tathāgata's true teaching, abandoned his pride, put his palms together, courted Shanshun, and spoke in verse, saying, \"Good, it's good to subdue my pride, for I will attain the Tathāgata's most excellent body, and I will always be a member of your enlightenment because I relinquished my position as king to you.",
        "source": "T11n0310_095:0539a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我實貧窮汝為富，　　今知此說非妄言，　王位徒為眾苦因，　　背於白法生惡趣。」",
        "translation": "I'm really poor and you're rich, but now I know this isn't a lie. The position of king is only a cause of suffering, and I turn my back on the white dharma and am born in a bad destiny.\"",
        "source": "T11n0310_095:0539a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王說是偈已，白佛言：「世尊！",
        "translation": "After speaking this verse, King Prasenajit said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_095:0539a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者發於無上大菩提心，願於眾生安樂解脫生死繫縛。",
        "translation": "Now, I've aroused the unsurpassed mind of great bodhi, wishing for the well-being of sentient beings and their liberation from the fetters of birth and death.",
        "source": "T11n0310_095:0539a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今願以財物庫藏金銀之屬分為三分，一分奉施如來世尊及比丘眾，一分施與舍衛城中貧窮苦惱無依怙者，一分財物留資國用。",
        "translation": "Now, I would like to divide my treasury of gold and silver into three parts, giving one part to the Tathāgata, the Bhagavān, and the community of monks, one part to those in Śrāvastī who are poor and suffering and have no support, and one part to preserve my wealth for the country's use.",
        "source": "T11n0310_095:0539a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡我所有園池花果，悉願奉施最勝如來并比丘眾。",
        "translation": "I wish to give all the flowers and fruits of my garden and pond to the Most Excellent Tathāgata and the community of monks.",
        "source": "T11n0310_095:0539b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊垂哀納受。」",
        "translation": "Please accept it with pity, Bhagavān.\"",
        "source": "T11n0310_095:0539b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時憍薩羅國五百長者覩斯事已，皆發無上大菩提心。",
        "translation": "After seeing this happen, the five hundred elders of Kośala all aroused the unsurpassed mind of great enlightenment.",
        "source": "T11n0310_095:0539b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善順菩薩白佛言：「世尊！",
        "translation": "It was then that the well-versed bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_095:0539b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來為諸大眾說於法要，令諸眾生遇如來者為不空過。」",
        "translation": "May the Tathāgata explain the essentials of the Dharma for the masses, so that it won't be an empty mistake for sentient beings to encounter the Tathāgata.\"",
        "source": "T11n0310_095:0539b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告眾人言：「善男子等，有三無量功德資糧，於諸如來雖有稱說猶不能盡，況於聲聞諸三乘等。",
        "translation": "It was then that the Bhagavān addressed the crowd, \"Good sons, there are three immeasurable accumulations of merit that cannot be exhausted despite being described by the Tathāgatas, so why wouldn't it be possible for śrāvakas and others of the three vehicles to meet them?",
        "source": "T11n0310_095:0539b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為三？",
        "translation": "What are the three?",
        "source": "T11n0310_095:0539b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者護持正法，二者發菩提心，三者勸諸眾生起無上願。",
        "translation": "One is to safeguard the right teaching, two is to give rise to the mind of enlightenment, and three is to encourage sentient beings to give rise to the unsurpassed vow.",
        "source": "T11n0310_095:0539b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三十二法，若善男子若善女人能勤修者，則為見於如來不空過也。",
        "translation": "\"Furthermore, there are 32 things that good men and good women diligently cultivate, which are the result of seeing the Tathāgata as not being in vain.",
        "source": "T11n0310_095:0539b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者於諸如來生不壞信，二者護持正法令得久住，三者於尊重僧而不輕慢，四者於應供人恭敬親近，五者於愛於憎心常平等，六者恒於正法樂聞恭敬，七者安住寂靜離於諠閙，八者於如來乘演說無倦，九者若說法時不為名利，十者志求真實如理勤修，十一捨施，十二持戒，十三忍辱，十四精進，十五禪定，十六正慧，十七於諸眾生隨樂護念，十八成熟眾生不忘失法，十九恒於己身善自調伏，二十以善法要調伏於他，二十一不染煩惱，二十二常樂出家，二十三住阿蘭若，二十四聖種喜足，二十五勤行頭陀，二十六捨不善法，二十七弘誓堅固，二十八蘭若無懈，二十九植眾善本，三十常不放逸，三十一遠二乘見，三十二讚歎大乘。」",
        "translation": "一者於諸如來生不壞信，二者護持正法令得久住，三者於尊重僧而不輕慢，四者於應供人恭敬親近，五者於愛於憎心常平等，六者恒於正法樂聞恭敬，七者安住寂靜離於諠閙，八者於如來乘演說無倦，九者若說法時不為名利，十者志求真實如理勤修，十一捨施，十二持戒，十三忍辱，十四精進，十五禪定，十六正慧，十七於諸眾生隨樂護念，十八成熟眾生不忘失法，十九恒於己身善自調伏，二十以善法要調伏於他，二十一不染煩惱，二十二常樂出家，二十三住阿蘭若，二十四聖種喜足，二十五勤行頭陀，二十六捨不善法，二十七弘誓堅固，二十八蘭若無懈，二十九植眾善本，三十常不放逸，三十一遠二乘見，三十二讚歎大乘。」",
        "source": "T11n0310_095:0539b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是五百比丘聞斯法已，遠塵離垢得法眼淨。",
        "translation": "After hearing this teaching, 500 monks became dustless and spotless and attained purification of the Dharma eye.",
        "source": "T11n0310_095:0539b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及萬二千眾生，同發阿耨多羅三藐三菩提心。",
        "translation": "Together with 12,000 other sentient beings, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_095:0539c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊以法教化令諸眾生獲善利已，與諸比丘并餘來眾忽然不現。",
        "translation": "After teaching the Dharma to bring good benefits to sentient beings, the Bhagavān suddenly disappeared with the monks and the rest of the assembly.",
        "source": "T11n0310_095:0539c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王既覩斯事踊躍歡喜，便以二衣價直百千兩金而以施於善順菩薩，作是言曰：「善哉仁者！",
        "translation": "Seeing this, King Prasenajit was overjoyed and rejoiced, so he gave the two garments worth a hundred thousand taels of gold to the well-adjusted bodhisattva and said, \"Good, sir!",
        "source": "T11n0310_095:0539c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂哀納。」",
        "translation": "Please accept it with kindness.\"",
        "source": "T11n0310_095:0539c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善順菩薩告於王言：「大王當知，我於此衣不應受之。",
        "translation": "The well-adjusted bodhisattva told the king, \"Great king, you should know that I shouldn't accept this robe.",
        "source": "T11n0310_095:0539c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0539c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我自有百衲之衣，恒掛樹枝以為箱篋，一切眾生無欺奪想。",
        "translation": "However, I have my own hundred patch robe that I always hang on a tree branch to make a case, so all sentient beings don't have thoughts of deception.",
        "source": "T11n0310_095:0539c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我既自身無慳悋心，亦令他人不生愛著，其有施者名清淨施。」",
        "translation": "Since I don't have a stingy heart myself and don't cause others to become attached to it, my giving is called \"pure giving.\"",
        "source": "T11n0310_095:0539c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波斯匿王復作是言：「汝若不受，願當為我以足踏之，令我長夜安樂利益。」",
        "translation": "King Prasenajit then also said, \"If you don't accept it, may you put your foot on it for me, so that I may enjoy its benefits for a long time.\"",
        "source": "T11n0310_095:0539c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時為於王故，即以雙足踏此二衣。",
        "translation": "For the king's sake, the bodhisattva then stepped on these two garments with both feet.",
        "source": "T11n0310_095:0539c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波斯匿王謂菩薩言：「今此之衣，便於汝身為我受訖。",
        "translation": "King Prasenajit then said to the bodhisattva, \"Now, this robe will be accepted for me in your person.",
        "source": "T11n0310_095:0539c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我何所用？」",
        "translation": "What use will I make of it?\"",
        "source": "T11n0310_095:0539c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善順菩薩告於王言：「汝持此衣，施於城中貧窮苦惱無依怙者。」",
        "translation": "The Shanshun Pusa told the king, \"Take these robes and give them to the poor and distressed people in the city who have no support.\"",
        "source": "T11n0310_095:0539c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王如菩薩教，持此二衣會諸貧人而施與之。",
        "translation": "Then, just as the bodhisattva had taught, King Prasenajit took these two garments, met the poor people, and gave them to them.",
        "source": "T11n0310_095:0539c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸貧人觸斯衣者，狂者得心、聾者得聞、盲者得見、根不具者悉得具足，由於菩薩威神力故。",
        "translation": "When the poor people touched these robes, the crazy ones got their minds, the deaf ones got to hear, the blind ones got to see, and the ones with impaired faculties all got to be replete because of the bodhisattva's authoritative power.",
        "source": "T11n0310_095:0539c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時眾人俱發聲言：「我今以何報菩薩恩？」",
        "translation": "The people then all spoke up and said, \"What will I do to repay the bodhisattva's kindness?\"",
        "source": "T11n0310_095:0539c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時空中有聲告曰：「諸人當知，善順菩薩不可以於花香飲食為報恩者，唯當速發菩提心耳。」",
        "translation": "At the time, a voice in the air told them, \"You should know that well-adhered bodhisattvas can't repay kindness with flowers and food, but must quickly give rise to the mind of enlightenment.\"",
        "source": "T11n0310_095:0539c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時五百貧人聞於空中有如是聲，咸說偈言：「我等今者，　　發菩提心，　　當成正覺，　說諸勝法。",
        "translation": "Hearing this voice in the air, five hundred poor people all spoke in verse, saying, \"Now, we have aroused the mind of enlightenment, will become perfectly enlightened, and will explain the excellent Dharma.",
        "source": "T11n0310_095:0539c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於諸眾生，　　施以安樂，　我樂菩提，　　得佛法故。」",
        "translation": "We will bestow comfort on all sentient beings, and I will enjoy enlightenment because I've attained the Buddha-dharma.\"",
        "source": "T11n0310_095:0539c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王白菩薩言：「善哉仁者！",
        "translation": "It was then that King Prasenajit said to the bodhisattva, \"Good, sir!",
        "source": "T11n0310_095:0539c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若詣彼將見如來，願時報我，我當隨從。」",
        "translation": "If you go there and will see the Tathāgata, then reward me when you wish, and I will follow you.\"",
        "source": "T11n0310_095:0539c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善順菩薩言：「大王當知，諸佛難值正法難聞，豈獨大王而自往耶？",
        "translation": "The Zenshun Bodhisattva said, \"Great king, you should know that it's difficult to meet the buddhas and difficult to hear the right teaching, so why wouldn't you be the only one who goes there on your own?",
        "source": "T11n0310_095:0539c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當為眾生作於善友。",
        "translation": "\"You must be a good friend to sentient beings.",
        "source": "T11n0310_095:0540a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王應於此舍衛城中勅諸人民悉令隨從，違王教者王法治之。",
        "translation": "The king should order all the people in this city of Śrāvastī to follow him, and he'll punish those who disobey his teaching.",
        "source": "T11n0310_095:0540a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_095:0540a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡諸菩薩猶有眷屬圍遶莊嚴，況於王乎。」",
        "translation": "Even bodhisattvas have retinues that surround them with adornment, so why wouldn't a king?\"",
        "source": "T11n0310_095:0540a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波斯匿王白菩薩言：「誰者是於菩薩眷屬？」",
        "translation": "King Prasenajit then said to the bodhisattva, \"Who are the members of the bodhisattva's retinue?\"",
        "source": "T11n0310_095:0540a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩答言：「勸菩提心是菩薩眷屬，令覺悟故。",
        "translation": "The bodhisattva replied, \"Encouragement of enlightenment is a follower of the bodhisattva, which causes awakening.",
        "source": "T11n0310_095:0540a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸見如來是菩薩眷屬，不虛妄故。",
        "translation": "Encouragement to see the Tathāgata is a member of the bodhisattva's family, so it's not false.",
        "source": "T11n0310_095:0540a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸聞正法是菩薩眷屬，獲多聞故。",
        "translation": "Encouraging hearing the right teaching is a member of the bodhisattva's retinue, which is why they've gained extensive learning.",
        "source": "T11n0310_095:0540a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸見聖眾是菩薩眷屬，得善友故。",
        "translation": "Encouraging views of the noble congregation is a member of the bodhisattva's retinue, which obtains good friends.",
        "source": "T11n0310_095:0540a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四攝是菩薩眷屬，攝眾生故。",
        "translation": "The four collectors are members of the bodhisattva's retinue, which is the reason they collect sentient beings.",
        "source": "T11n0310_095:0540a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六波羅蜜是菩薩眷屬，增長菩提故。",
        "translation": "The six perfections are members of the bodhisattva's retinue, which increases enlightenment.",
        "source": "T11n0310_095:0540a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十七品是菩薩眷屬，趣向道場故。",
        "translation": "The thirty-seven factors are the bodhisattva's retinue, which leads to the path.",
        "source": "T11n0310_095:0540a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩有斯眷屬莊嚴侍衛，能摧魔軍至師子吼，登最勝處。」",
        "translation": "With these retinues adorned as their guardians, the bodhisattvas are able to destroy Māra's army, reach the lion's roar, and ascend to the most excellent place.\"",
        "source": "T11n0310_095:0540a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王及諸大眾歡喜踊躍，九千眾生離煩惱垢得清淨眼。",
        "translation": "It was then that King Prasenajit and the great multitude rejoiced and jumped for joy, and nine thousand sentient beings were freed from the stain of affliction and attained pure eyes.",
        "source": "T11n0310_095:0540a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是經已，善順菩薩、波斯匿王，及諸天、人、乾闥婆、阿修羅等，聞佛所說，歡喜奉行。",
        "translation": "After the Buddha taught this sūtra, the well-versed bodhisattva, King Prasenajit, and the gods, humans, gandharvas, and asuras who heard what he taught rejoiced and handed it down.",
        "source": "T11n0310_095:0540a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大寶積經卷第九十五",
        "translation": "Da baoji jing roll 95",
        "source": "T11n0310_095:0540a19_0",
        "is_bad_quality": false
    }
]