[
    {
        "source_sentence": "大寶積經卷第二十四",
        "translation": "Mahāratnapratimaṇḍita-sūtra, Volume 24",
        "source": "T11n0310_024:0131c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏菩提流志奉　詔譯",
        "translation": "Translated by imperial order from the Tripiṭaka of the Great Tang by Bodhiruci",
        "source": "T11n0310_024:0131c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "被甲莊嚴會第七之四",
        "translation": "Gaṇḍavyūhasūtra 7-4",
        "source": "T11n0310_024:0131c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次無邊慧！",
        "translation": "\"Furthermore, infinite wisdom!",
        "source": "T11n0310_024:0131c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩如是觀察一切法時，便於諸法得法光明，不於空中而見於空，亦不離空而見於空，不見少法與空相應若不相應，不以空空不見於空、不見不空，亦不以見觀一切法。",
        "translation": "When bodhisattvas, mahāsattvas thus observe all things, they attain the illumination of the Dharma in all things, don't see emptiness in the air, don't see emptiness apart from emptiness, don't see few things that are associated or not associated with emptiness, don't see emptiness as emptiness, don't see what's not emptiness, and don't observe all things with that view.",
        "source": "T11n0310_024:0131c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是見時，不於無相而見無相，不異無相而見無相，亦無少法而與無相若相應若不相應。",
        "translation": "When they hold this view, they don't see marklessness in the absence of marks, don't see marklessness differently than marklessness, and don't see few things that are or aren't associated with marklessness.",
        "source": "T11n0310_024:0131c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不於無相以無相見，不於有相以有相見，非有相見非無相見，無生無作亦復如是。",
        "translation": "They don't see marklessness in terms of marklessness, don't see marks in terms of marks, don't see marks in terms of what's not marks, and don't see marks in terms of what's not marks, and so it is with regard to nonarising and nonconstruction.",
        "source": "T11n0310_024:0131c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不於盡中而見於盡，亦不異盡而見於盡，不見少法與盡相應若不相應，亦不於盡而以盡見，亦不於盡以無盡見，亦非盡見非無盡見。",
        "translation": "They don't see the end in the end, don't see the end differently than the end, don't see few things that are associated with the end or not associated with the end, don't see the end in terms of the end, don't see the end in terms of no end, and don't see the end in terms of no end, and don't see the end in terms of no end.",
        "source": "T11n0310_024:0131c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩作是見時，無有少法若可得見不可得見，若可顯了不可顯了，若可趣入不可趣入，若可覺知不可覺知。",
        "translation": "When bodhisattvas and mahāsattvas thus see, there's not a little thing that can be seen and can't be seen, that can be revealed and can't be revealed, that can be entered and can't be entered, and that can be perceived and can't be perceived.",
        "source": "T11n0310_024:0131c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊慧！",
        "translation": "Boundless wisdom!",
        "source": "T11n0310_024:0131c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩安住斯道大法光明，法光明故見一切法悉無有邊，於邊於中亦無所執，無所執故於佛法中而發趣之。」",
        "translation": "This is the bodhisattva Mahāsattva's abiding in the great Dharma light of this path, and it's because of the Dharma light that he sees that all things have no limit, that he doesn't attach to either limit or middle, and that he's aiming for the Buddha's teaching because he doesn't attach to anything.\"",
        "source": "T11n0310_024:0131c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「不於空見空，　　不異空見空，　能作如是見，　　說名為見空。",
        "translation": "It was then that the Bhagavān spoke this verse, \"He doesn't see emptiness in emptiness, doesn't see emptiness differently than emptiness, and can create such a view, which is called seeing emptiness.",
        "source": "T11n0310_024:0132a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不住於少法，　　亦不見少法，　於彼空相應，　　及以不相應。",
        "translation": "They don't abide in few dharmas or see few dharmas, and they are associated with and not associated with emptiness.",
        "source": "T11n0310_024:0132a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　空以自性空，　　於空無所取，　以無所取故，　　能知一切法。",
        "translation": "Because emptiness is empty in its own nature, they grasp nothing from emptiness, and because they grasp nothing, they can know all dharmas.",
        "source": "T11n0310_024:0132a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於見無所取，　　於觀無所執，　能知見與觀，　　此二俱不受。",
        "translation": "In views that have nothing to grasp, and in contemplations that have nothing to attach to, he can know both views and contemplations, and neither of them is apprehended.",
        "source": "T11n0310_024:0132a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於見悉清淨，　　於觀不可得，　如是觀諸法，　　畢竟無所執。",
        "translation": "In seeing, they are all purified, and in observing them, they're unobtainable; thus observing the dharmas, they ultimately lack appropriation.",
        "source": "T11n0310_024:0132a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不以無相見，　　不以無相觀，　亦不於無相，　　而作無相觀。",
        "translation": "They don't see things marklessly, don't observe things marklessly, and don't make markless observations in the absence of marks.",
        "source": "T11n0310_024:0132a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無相無所顯，　　無願不可得，　無有少法體，　　而可修習者。",
        "translation": "Without marks, there's nothing to show, without wishing for it, and there's no little substance of dharmas that can be cultivated.",
        "source": "T11n0310_024:0132a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不念於無相，　　亦不念無願，　如是無分別，　　顯了相無相。",
        "translation": "Not mindful of signlessness, nor mindful of wishing for signlessness, thus lacking discrimination, they reveal that signlessness has no marks.",
        "source": "T11n0310_024:0132a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不趣於無相，　　亦不入無相，　無趣無所入，　　顯了平等住。",
        "translation": "Not aiming for marklessness, nor entering marklessness, going nowhere, entering nowhere, and revealing the abode of equality.",
        "source": "T11n0310_024:0132a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智人不見相，　　亦不見無相，　不見不思惟，　　一切無顯了。",
        "translation": "A wise person doesn't see marks, doesn't see no marks, doesn't see and doesn't contemplate, and all are unrevealed.",
        "source": "T11n0310_024:0132a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人常思惟，　　無思無顯了，　於思及顯了，　　平等平等住。",
        "translation": "If someone always contemplates, nothing is contemplated, nothing is revealed, and in contemplation and in revelation, they equally abide.",
        "source": "T11n0310_024:0132a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是於無相，　　無作亦復然，　雖顯無所顯，　　思惟了知故。",
        "translation": "Thus, in marklessness, it's likewise in unconstructedness, even though it's manifested and nothing is manifested, because it's perceived and understood by contemplation.",
        "source": "T11n0310_024:0132a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無生亦如是，　　曾無少法生，　自性無所有，　　顯了而無體。",
        "translation": "Thus is unarisen, and so is uncreated, in which few things ever arise, their own nature is nonexistent, and they are revealed and have no essence.",
        "source": "T11n0310_024:0132a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若生若無生，　　有作及無作，　亦無少所執，　　智者不分別。",
        "translation": "Whether it arises or doesn't arise, whether it's created or uncreated, there's nothing little to attach to, and the wise don't discriminate.",
        "source": "T11n0310_024:0132a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　念慧無所動，　　顯了無思擇，　有體及無體，　　平等離諸性。",
        "translation": "Mindfulness and wisdom are unmoving, fully revealed and undiscriminated, with and without essence, and equally free of all natures.",
        "source": "T11n0310_024:0132b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不於盡見盡，　　亦不見無盡，　顯了無所見，　　盡智無過上。",
        "translation": "Not seeing the end in the end, nor seeing the endless, but comprehending and seeing nothing, exhaustive knowledge is unsurpassed.",
        "source": "T11n0310_024:0132b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若盡若無盡，　　二俱不分別，　以無分別故，　　無念平等住。",
        "translation": "Whether it's exhausted or inexhaustible, they are both nondiscriminated, and because of that lack of discrimination, mindfulness of nonexistence abides equally.",
        "source": "T11n0310_024:0132b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於盡無盡見，　　亦無無盡見，　如是見盡時，　　不執盡無盡。",
        "translation": "When he sees both end and endlessness, and he sees nothing endlessly, he doesn't attach to end and endlessness.",
        "source": "T11n0310_024:0132b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於盡無盡，　　一切無所執，　以無所執故，　　盡智當顯了。",
        "translation": "If there's no end and nothing inexhaustibly, all are unattached, and because there's no attachment, the knowledge of exhaustiveness will be revealed.",
        "source": "T11n0310_024:0132b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盡智之境界，　　無畏之所得，　顯了斯法故，　　菩薩善安住。」",
        "translation": "The realm of exhaustive knowledge, the attainment of fearlessness, and the revelation of this teaching make bodhisattvas well-situated.\"",
        "source": "T11n0310_024:0132b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾中復有菩薩摩訶薩名曰勝慧，從坐而起偏袒右肩，右膝著地合掌向佛，白言：「世尊！",
        "translation": "At the time, another bodhisattva in the crowd named Victorious Wisdom rose from his seat, bared his right shoulder, knelt on his right knee, put his palms together, and addressed the Buddha, saying, \"Bhagavān!",
        "source": "T11n0310_024:0132b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩為欲攝取諸法智故起於修行，乃能得此大法光明。",
        "translation": "It's because they want to gather knowledge of all dharmas that bodhisattvas, mahāsattvas, and practitioners arise to cultivate it that they can attain this great Dharma illumination.",
        "source": "T11n0310_024:0132b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於法光明無少可見，法光明故了一切法有為無為、世間出世間、若順若逆、若有戲論若無戲論。",
        "translation": "There's nothing little to see in that Dharma light, and that Dharma light makes it possible to understand all things that are existent and inactive, mundane and transmundane, whether agreeable or disagreeable, and whether there's conceptual elaboration or no conceptual elaboration.",
        "source": "T11n0310_024:0132b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_024:0132b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法光明，豈諸菩薩摩訶薩無修行而當得耶？」",
        "translation": "Is this light of the Dharma something that bodhisattvas, mahāsattvas, and non-practitioners should attain?\"",
        "source": "T11n0310_024:0132b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告勝慧菩薩摩訶薩言：「勝慧！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva Pratibhāna, saying, \"Pratibhāna!",
        "source": "T11n0310_024:0132b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩無少修行、無勝修行、不隨修行、不遍修行，能得無邊大法光明。",
        "translation": "Without little practice, without superior practice, without following practice, and without pervasive practice, bodhisattvas, mahāsattvas, can attain the limitless great radiance of the Dharma.",
        "source": "T11n0310_024:0132b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩尚不可得不可見耳，況菩薩行而當可得當可見乎？",
        "translation": "It's impossible for bodhisattvas and mahāsattvas to attain and see it, so why wouldn't bodhisattva practices be attainable and visible in the future?",
        "source": "T11n0310_024:0132b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如何乃見若干劫行能得無邊大法光明？",
        "translation": "How can one see how many eons of practice can lead to the infinite great radiance of the Dharma?",
        "source": "T11n0310_024:0132b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩一切行息所行清淨得法光明，法光明行非數量行、非隨相行，從何施設一切諸行？",
        "translation": "\"When all the bodhisattvas' and mahāsattvas' practices are purified by calming their minds and attaining the light of the Dharma, how do they define all their practices when their practices are not quantitative and not form-following practices?",
        "source": "T11n0310_024:0132b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然所修行，非施設行而亦不離。",
        "translation": "Still, the practice that's cultivated is not a designated practice, and it doesn't part from it.",
        "source": "T11n0310_024:0132b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝慧！",
        "translation": "Excellent wisdom!",
        "source": "T11n0310_024:0132b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩住此行時，捨一切行無所執取。",
        "translation": "When bodhisattvas, mahāsattvas abide in this practice, they abandon all practices and attach to nothing.",
        "source": "T11n0310_024:0132b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具斯行者非數量行、非隨相行、無相無行，乃能得此大法光明。」",
        "translation": "Such a practitioner doesn't practice numerically, doesn't practice according to characteristics, and has no characteristics and no practice, and then he can attain this great radiance of the Dharma.\"",
        "source": "T11n0310_024:0132c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「菩薩無所行，　　而亦無有行，　得無有行者，　　無畏而發趣。",
        "translation": "It was then that the Bhagavān spoke this verse, saying, \"A bodhisattva does nothing, yet there's no practice, and he attains the aim of fearlessness when he has no practice.",
        "source": "T11n0310_024:0132c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　未曾有勝行，　　亦無有遍行，　無行無勝行，　　平等而發趣。",
        "translation": "There's no superior practice yet, and there's no pervasive practice, no practice, and no superior practice, and they are equally arisen.",
        "source": "T11n0310_024:0132c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此行無示現，　　示無有諸相，　無相無行者，　　斯為行之相。",
        "translation": "Such practice is without display, displays no marks, and has no marks or practice, which is the mark of practice.",
        "source": "T11n0310_024:0132c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩無相行，　　不住於諸事，　無行無所住，　　智者乃成就。",
        "translation": "A bodhisattva's markless practice doesn't abide in things, and when there's no practice and nothing to abide in, the wise one accomplishes it.",
        "source": "T11n0310_024:0132c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無行則無動，　　斯行為無上，　能行不動行，　　勇進而發趣。",
        "translation": "When there's no form, there's no movement, and this practice is unsurpassed.",
        "source": "T11n0310_024:0132c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩不可得，　　行亦不可見，　亦不見色身，　　斯為善順者。",
        "translation": "The bodhisattva is unobtainable, his actions are invisible, and he doesn't see a form body, which makes him a good follower.",
        "source": "T11n0310_024:0132c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無色無形相，　　故無一切行，　於見無所取，　　斯為無比行。",
        "translation": "Being formless and markless, they lack all formative qualities, and they grasp nothing in their views, which is an incomparable action.",
        "source": "T11n0310_024:0132c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩無上行，　　不墮於施設，　亦無有遷變，　　於中無所執。",
        "translation": "The bodhisattva's unsurpassed practice doesn't fall under constructions, has no change, and has nothing to cling to in it.",
        "source": "T11n0310_024:0132c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行無施設故，　　乃為無上行，　若得如是行，　　獲大法光明。",
        "translation": "Because practice has no qualifications, it's unsurpassed practice, and if one attains such practice, they'll attain great dharma radiance.",
        "source": "T11n0310_024:0132c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩所修行，　　無言無劫量，　能以無量劫，　　顯說於諸行。",
        "translation": "The practices that bodhisattvas cultivate are without language or eons of measure, and they can be explained in terms of innumerable eons of practice.",
        "source": "T11n0310_024:0132c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩行清淨，　　清淨妙安住，　悉捨一切行，　　曾無攝取者。",
        "translation": "The bodhisattva's practice is pure, wonderfully abiding in purity, and he completely abandons all his practices, never grasping to any of them.",
        "source": "T11n0310_024:0132c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩恒住捨，　　守護於諸行，　已捨一切行，　　於捨妙安住。",
        "translation": "The bodhisattva always abides in equanimity, guarding the practices, having abandoned all practices, and abiding in the wonders of equanimity.",
        "source": "T11n0310_024:0132c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩無邊行，　　離邊及無邊，　彼行無所動，　　名為無上行。",
        "translation": "The bodhisattva's limitless practice, free of extremes and limitlessness, and his practice, which is unmoving, are called the unsurpassed practice.",
        "source": "T11n0310_024:0132c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩無相行，　　斯行為無上，　修行此行時，　　超越諸魔界。",
        "translation": "The bodhisattva's markless practice is unsurpassed, and when he cultivates it, he transcends the realms of Māra.",
        "source": "T11n0310_024:0133a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩無相行，　　明了於無相，　若相及無相，　　一切無所依。",
        "translation": "The bodhisattva's markless practice is comprehended in marklessness, and if there are marks and marklessness, they all have no basis.",
        "source": "T11n0310_024:0133a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩住此智，　　此行善成就，　無有少所行，　　說名不行者。",
        "translation": "The bodhisattva abides in this knowledge, and this practice is so well accomplished that there's nothing little to practice that's said to be impractical.",
        "source": "T11n0310_024:0133a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩常清淨，　　於行無所畏，　正念而發趣，　　斯為善安住。」",
        "translation": "The bodhisattva is always pure, has no fear about doing, and correctly attends to this, which is called well-abiding.\"",
        "source": "T11n0310_024:0133a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時勝慧菩薩摩訶薩復白佛言：「希有世尊！",
        "translation": "It was then that the Bodhisattva of Superior Wisdom, Mahāsattva, again said to the Buddha, \"It's rare, Bhagavān!",
        "source": "T11n0310_024:0133a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善丈夫若干修行乃為甚深，非諸愚夫有相有為所修行者少能行之。",
        "translation": "There are certain things that good men practice that are so profound that not many foolish men with marks and artificial forms can practice them.",
        "source": "T11n0310_024:0133a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_024:0133a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有少法入此行中，是故此行為善丈夫平等之行。",
        "translation": "There's no little dharma that enters into this practice, and therefore this practice is the practice of a good and equal person.",
        "source": "T11n0310_024:0133a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_024:0133a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善丈夫行非諸數量邊際能測。」",
        "translation": "The actions of a good man can't be fathomed by the limit of quantity.\"",
        "source": "T11n0310_024:0133a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時勝慧菩薩摩訶薩即以偈頌讚如來曰：「大雄正等覺，　　無上兩足尊，　演說甚深行，　　饒益諸菩薩。",
        "translation": "It was then that the Bodhisattva Mahāsattva of Superior Wisdom praised the Tathāgata in verse, saying, \"The great hero, the correct and perfectly enlightened one, the unsurpassed, two-legged honored one, teaches profound practices that benefit bodhisattvas.",
        "source": "T11n0310_024:0133a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊妙辯才，　　其量頗難測，　無邊辯才者，　　最勝大丈夫。",
        "translation": "The Bhagavān's subtle eloquence is unfathomable, and he has limitless eloquence, most excellent of great men.",
        "source": "T11n0310_024:0133a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法王息譏論，　　斯由正遍知，　乃為諸菩薩，　　說此無上行。",
        "translation": "The king of the Dharma calms criticism, and it's because of this correct omniscience that he teaches these unsurpassed practices for bodhisattvas.",
        "source": "T11n0310_024:0133a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊能演說，　　滅行之方便，　於行悉超過，　　智人當發趣。",
        "translation": "The Bhagavān can explain it, explaining the method of the practice of cessation, which is completely surpassed in practice and will arouse the resolve of wise people.",
        "source": "T11n0310_024:0133a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大龍不思議，　　無邊智境界，　遍知兩足尊，　　善開斯妙行。",
        "translation": "A great inconceivable dragon with limitless cognition of objects, the honored one with omniscience and two legs, skillfully discloses this wondrous practice.",
        "source": "T11n0310_024:0133a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊所開示，　　牟尼不動行，　此行無能動，　　故名無比行。",
        "translation": "The Bhagavān instructs the Muni's immovable practice, which has no ability to move and is therefore called incomparable practice.",
        "source": "T11n0310_024:0133a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大雄大牟尼，　　往昔所修行，　設以多劫行，　　無人能到者。",
        "translation": "The great hero, the great Muni, used to practice in a way that no one could reach even if they had done it for many eons.",
        "source": "T11n0310_024:0133a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩聞斯法，　　雖住於世間，　而於諸種智，　　不久亦當證。",
        "translation": "Even though bodhisattvas hear this teaching and live in the world, they'll soon realize various kinds of cognition.",
        "source": "T11n0310_024:0133a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等愍眾生，　　當於末世中，　於此無上法，　　能為護持者。",
        "translation": "We pity for sentient beings, and in this final age, we'll be able to defend this unsurpassed teaching.",
        "source": "T11n0310_024:0133b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等聞斯法，　　當於末世中，　為諸眾生故，　　能行亦能說。",
        "translation": "When we hear this teaching, we'll be able to practice and speak it for the sake of sentient beings in the final age.",
        "source": "T11n0310_024:0133b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等以光明，　　當於末世中，　為諸求法者，　　而興大利益。",
        "translation": "With our radiance, we will create great benefits for those who seek the Dharma in the final age.",
        "source": "T11n0310_024:0133b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等發誓願，　　當於末世中，　為諸眾生故，　　護持而建立。",
        "translation": "We have made a vow that in the latter days, we will protect and establish it for the sake of sentient beings.",
        "source": "T11n0310_024:0133b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等常思念，　　當於末世中，　供養佛法海，　　願持無上法。",
        "translation": "We always think, 'In the final age, we will support the Buddha's ocean of teachings and vow to maintain the unsurpassed Dharma.'",
        "source": "T11n0310_024:0133b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等於法藏，　　當為勝丈夫，　願持此法門，　　守護令久住。",
        "translation": "Here in the Dharma treasury, we will be excellent gentlemen, vowing to maintain this Dharma teaching and guard it so that it lasts a long time.",
        "source": "T11n0310_024:0133b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等於法水，　　誓願悉能飲，　而於此法門，　　當為守護者。",
        "translation": "We vow that we'll all be able to drink the water of the Dharma, and we'll be the guardians of this Dharma teaching.",
        "source": "T11n0310_024:0133b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等聞法已，　　當於末世中，　願為大丈夫，　　受持佛正法。",
        "translation": "After we hear the teaching, we'll become great men in the final age, willing to uphold the Buddha's right teaching.",
        "source": "T11n0310_024:0133b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等寧失命，　　不捨無上法，　願於此法中，　　而為持法者。",
        "translation": "We'd rather lose our lives than abandon the unsurpassed Dharma, and we want to be Dharma bearers in this Dharma.",
        "source": "T11n0310_024:0133b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等持此法，　　未曾生喜足，　渴聞斯甚深，　　決定契經故。",
        "translation": "We've never had enough joy in upholding this Dharma, but we've longed to hear how profound it is, so we've decided to follow the sūtras.",
        "source": "T11n0310_024:0133b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等於末世，　　為求諸法者，　當演斯正法，　　能令悉歡喜。",
        "translation": "For those of us who seek the Dharma in these latter days, we'll present this right teaching that will make them all rejoice.",
        "source": "T11n0310_024:0133b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法王叵思議，　　能作大依怙，　願垂加護我，　　念我持法者。」",
        "translation": "The king of the Dharma is inconceivable, a great refuge, may he grant me protection, and remember me as the holder of the Dharma.\"",
        "source": "T11n0310_024:0133b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告勝慧菩薩摩訶薩言：「善哉善哉！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva of Superior Wisdom, \"Good, good!",
        "source": "T11n0310_024:0133b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝慧！",
        "translation": "Excellent wisdom!",
        "source": "T11n0310_024:0133b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能於後末世之中，為欲護持此諸法故被大甲冑。",
        "translation": "In the latter part of your life, you'll be able to wear great armor because you want to protect these things.",
        "source": "T11n0310_024:0133b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦如往昔諸菩薩摩訶薩於最勝所，供養承事、種諸善根、久修梵行、被大甲冑，護持諸佛世尊法者而無異也。」",
        "translation": "Just as in the past, there was no difference between bodhisattvas, mahāsattvas, and those in the most distinguished places who made offerings, served, planted good roots, cultivated the religious practice over time, and wore great armor to safeguard the teachings of the world-honored buddhas.\"",
        "source": "T11n0310_024:0133b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「於後怖畏時，　　汝當持此法，　為利諸眾生，　　以此法開示。",
        "translation": "It was then that the Bhagavān spoke this verse, saying, \"In the fearful time to come, you will maintain this teaching and reveal it for the benefit of sentient beings.",
        "source": "T11n0310_024:0133c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於後末世時，　　汝持最勝法，　若聞斯法者，　　悉當生愛樂。",
        "translation": "In the latter part of the world, you'll maintain the most excellent teaching, and if you hear it, you'll all become delighted with it.",
        "source": "T11n0310_024:0133c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於後末世時，　　汝為持法者，　我說甚深法，　　汝當悉受持。",
        "translation": "In a latter, terminal age, you'll be a Dharma bearer, and I'll explain a very profound teaching that you'll thoroughly embrace.",
        "source": "T11n0310_024:0133c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　祕密修多羅，　　汝聞當憶念，　於斯理趣中，　　勿復有疑惑。",
        "translation": "You must remember the esoteric sūtra when you hear it, and in this principle of destiny, you mustn't again have doubts.",
        "source": "T11n0310_024:0133c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　決定甚深義，　　汝聞當憶念，　饒益諸眾生，　　為持法藏者。",
        "translation": "Decide on a profound meaning, and remember it when you hear it, for the benefit of all sentient beings, for those who maintain the Dharma treasure.",
        "source": "T11n0310_024:0133c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以法施一切，　　普潤諸眾生，　聞已令充悅，　　身心遍歡喜。",
        "translation": "He gives the Dharma to all, pervasively nourishes sentient beings, pleases them when he hears it, and makes them rejoice in body and mind.",
        "source": "T11n0310_024:0133c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為諸菩薩道，　　所行之理趣，　及彼修多羅，　　究竟受持故。",
        "translation": "It's for the sake of the bodhisattva path, the principles and destinies that they practice, and the ultimate maintenance of their sūtra.",
        "source": "T11n0310_024:0133c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝當能廣度，　　無量諸眾生，　一切世間中，　　所不能度者。",
        "translation": "You will be able to extensively save measureless sentient beings who can't be saved in all the world.",
        "source": "T11n0310_024:0133c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝持此法故，　　饒益諸世間，　獲勝眾福聚，　　以是而發趣。",
        "translation": "Because you maintain this teaching, you'll benefit the world and obtain a superior stock of merit, which will lead to rebirth.",
        "source": "T11n0310_024:0133c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今說此法，　　汝當悉受持，　於後末世中，　　為諸聰慧說。",
        "translation": "Now, I'll explain this teaching, and you will accept it in full, teaching it to wise people in the latter part of the world.",
        "source": "T11n0310_024:0133c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現在未來世，　　能持斯法者，　則為能受持，　　千佛之正法。",
        "translation": "In the present and future generations, those who can maintain this teaching will be those who can maintain the right teaching of a thousand buddhas.",
        "source": "T11n0310_024:0133c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為諸眾生故，　　護持斯法門，　於後末世中，　　而興大饒益。",
        "translation": "Maintaining this teaching for the sake of sentient beings will produce great benefit in the latter part of the final age.",
        "source": "T11n0310_024:0133c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能於末世，　　護持斯法者，　彼不於一佛，　　親近而承事。",
        "translation": "If someone can uphold this teaching in the latter days, they won't become intimate with a single Buddha and serve him.",
        "source": "T11n0310_024:0133c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能於末世，　　護持斯法者，　彼已多承事，　　善說斯法者。",
        "translation": "If someone can uphold this teaching in the latter part of the world, they'll have given much service to someone who well explains this teaching.",
        "source": "T11n0310_024:0133c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能於此法中，　　無有少疑惑，　末世護持法，　　斯為聰慧者。",
        "translation": "Someone who has few doubts about this teaching and protects the teaching in the latter days is wise.",
        "source": "T11n0310_024:0134a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　被大無邊甲，　　敵戰為殊勝，　而於末世中，　　乃能持此法。",
        "translation": "They're covered in great, limitless armor, and their opponents are superior, yet they're able to uphold this teaching in the final age.",
        "source": "T11n0310_024:0134a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼於佛正法，　　疑網悉已除，　聞法無所畏，　　乃能持此法。",
        "translation": "Having removed all webs of doubt about the Buddha's right teaching, he hears the teaching and has no fear, and then he's able to maintain that teaching.",
        "source": "T11n0310_024:0134a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故勝慧！",
        "translation": "\"Therefore, excellent wisdom!",
        "source": "T11n0310_024:0134a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子善女人勤求最勝大功德者，於末世中為深法故，應被甲冑受持讀誦解說其義。",
        "translation": "If there are good men and good women who diligently pursue the most excellent and great virtue, they should wear armor, memorize, recite, and explain its meaning for the sake of the profound Dharma in the final age.",
        "source": "T11n0310_024:0134a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次勝慧！",
        "translation": "\"Furthermore, excellent wisdom!",
        "source": "T11n0310_024:0134a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念往昔過無量劫復倍是數，有佛出世，號曰遍照如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "I remember a time in the past, many times over, when a Buddha appeared in the world who was called the universally shining Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Trainer of Husbands, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T11n0310_024:0134a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劫名超勝，國名離垢。",
        "translation": "The name of the eon is Transcendent, and the name of the country is Free from Stain.",
        "source": "T11n0310_024:0134a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地平正廣博嚴淨，七寶所成。",
        "translation": "Its ground is level, correct, vast, and pure, and it's made of seven treasures.",
        "source": "T11n0310_024:0134a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼大洲廣長延袤七萬由旬，於中復有六萬大城。",
        "translation": "That continent is 70,000 leagues long and wide, and there are 60,000 large cities within it.",
        "source": "T11n0310_024:0134a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一大城縱廣正等十六由旬，垣牆周匝樓雉嚴飾，門剎殊勝覩者歡悅，妙多羅樹行列圍繞，百千園苑而共莊嚴。",
        "translation": "Each great city measures exactly 16 leagues in width, is surrounded by walls, decorated with pagodas, has entrances and bases that are outstanding, is surrounded by rows of marvelous tārā trees, and has a hundred thousand parks and gardens that are decorated together.",
        "source": "T11n0310_024:0134a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸園苑中，臺座床敷處處嚴設，池沼渠流一一盈滿，涯岸階砌飾以眾寶，周迴平正出入安隱。",
        "translation": "In these parks and gardens, platforms and seats are decorated, pools and ditches are filled, and the banks and stairs are masoned and adorned with many treasures, and they are surrounded by a smooth and level circuit that provides ease of movement.",
        "source": "T11n0310_024:0134a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其岸邊，沈水栴檀多摩羅等雜香之樹扶踈布列。",
        "translation": "On their shores, mixed-period fragrant trees such as the sandalwood and tamālap are propped up and lined up.",
        "source": "T11n0310_024:0134a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一一城各有十千俱胝人民止住其中，彼諸眾生悉已成就十善業故，一切皆受如是安樂。",
        "translation": "In each of those cities, there are ten thousand corpuscles of people standing there, and all of those sentient beings have accomplished ten good deeds, so they all experience such well-being.",
        "source": "T11n0310_024:0134a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼如來，始從初劫超二百劫於中出現，是故彼劫名曰超勝。",
        "translation": "The Tathāgata then first appeared in that eon from the first eon, surpassing 200 eons, and therefore that eon is called surpassing.",
        "source": "T11n0310_024:0134a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼劫中有五百如來次第出現，一一剎土皆七寶成。",
        "translation": "In that eon, five hundred tathāgatas appeared in sequence, each one in a buddha land made of seven treasures.",
        "source": "T11n0310_024:0134a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛滅後正法住世各十千歲。",
        "translation": "After the Buddha's death, the true teaching remains in the world for 10,000 years each.",
        "source": "T11n0310_024:0134a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是五百如來現化於世，多有聲聞菩薩法會，一一法會各有俱胝那由他數無量菩薩趣一乘道獲無生忍。",
        "translation": "As these 500 tathāgatas manifested in the world, there were many Dharma assemblies of śrāvakas and bodhisattvas, each of which had an infinite number of bodhisattvas headed for the One Vehicle path to attain the acceptance of nonarising.",
        "source": "T11n0310_024:0134a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼劫中有轉輪王名勇猛軍，七寶成就王四天下。",
        "translation": "\"At the time, there was a wheel-turning king in that eon named Brave Army, who was the accomplished king of the seven treasures in the four worlds.",
        "source": "T11n0310_024:0134b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於閻浮提有一大城，其城周迴六十由旬，復有八萬俱胝人民止住其中，安隱快樂豐饒熾盛，七重隍塹、七重行樹、七重街道、七重表剎、七重鈴網，一千園苑所共圍遶莊嚴大城。",
        "translation": "In Jambudvīpa, there was a large city that circled 60 leagues around, and 80,000 of his people lived in it, abundantly prosperous and happy in their security, surrounded by seven moats, seven rows of trees, seven streets, seven table bases, seven bell nets, and 1,000 parks and gardens.",
        "source": "T11n0310_024:0134b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一園苑縱廣正等二十由旬，其中各有七重垣牆、七重羅網種種莊嚴，一一微妙眾寶珍玩猶如諸天。",
        "translation": "Each garden is exactly twenty leagues across, and each of them is adorned with seven layers of walls and seven layers of nets, each filled with the treasures of subtle jewels like those of the gods.",
        "source": "T11n0310_024:0134b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各復有一百池沼，毘琉璃寶以為堤岸，馬瑙雜玉以為階砌，眾華敷榮寶樹行列。",
        "translation": "Each has another hundred ponds and marshes, with beryl jewels for their banks, coral and jade for their steps, and a multitude of flowers and riches in their rows of precious trees.",
        "source": "T11n0310_024:0134b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大城中，王之正殿量七由旬，黃金青寶間錯所成，周以寶竿飾以琉璃，摩尼珠網彌覆其上，諸多羅樹暉映莊嚴。",
        "translation": "In the great city, the king's main hall measures seven leagues, made of interlaced gold and blue jewels, surrounded by a jeweled pole decorated with beryl, covered with a net of maṇi beads, and adorned by the shining rays of many a palm tree.",
        "source": "T11n0310_024:0134b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十淵池圍遶縈帶，底布真金覆以金網，雜琉璃寶以為津橋，純妙黃金而為階道。",
        "translation": "It's surrounded by twenty abyssal pools that are encircled and encircled by a gold mesh at the bottom, a golden bridge made of lapis lazuli, and a stairway of pure, sublime gold.",
        "source": "T11n0310_024:0134b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其池中，優鉢羅華、拘勿頭華、芬陀利花敷榮遍滿。",
        "translation": "In those pools, the blue lotus, white lotus, and puṇḍarīka flowers abound in splendor.",
        "source": "T11n0310_024:0134b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼轉輪王，二千婇女六萬諸子，與其眷屬於彼園中五欲娛樂，竊作是念：『諸欲無常不久變壞，我當決定志求佛法。",
        "translation": "That wheel-turning king, his 2,000 concubines, and 60,000 sons, along with their retinues, entertained themselves in that garden with the five desires, secretly thinking, 'Desires are impermanent and will soon become less permanent, so I must definitely pursue the Buddha's teaching.'",
        "source": "T11n0310_024:0134b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞法已如教修行，令我長夜利益安樂。』",
        "translation": "If I hear the teaching and practice it as it's taught, it will give me benefit and comfort for a long time.'",
        "source": "T11n0310_024:0134b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "適思惟已，忽然有天現虛空中，告彼王言：『善哉丈夫！",
        "translation": "After he had finished thinking this, suddenly a god appeared in the sky and told the king, 'Good, husband!",
        "source": "T11n0310_024:0134b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今有遍照如來出現於世，演說正法初中後善，王應速詣於彼佛所，當聞正法，令王長夜利益安樂，成就佛法圓滿佛法。』",
        "translation": "Now that the Tathāgata Prabhūtaratna has appeared in the world and explained the right teaching, junior and latter stages are good, the king should quickly go to that Buddha's place and will hear the right teaching that will cause the king to benefit and be comfortable for a long time and accomplish the Buddha's teaching and perfect the Buddha's teaching.'",
        "source": "T11n0310_024:0134b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞天言踊躍歡喜，與其眷屬侍從圍遶，即往遍照如來之所。",
        "translation": "Hearing the gods' words, the king rejoiced and jumped for joy, surrounded by his retinue and attendants, and went to the place of the universally illuminating Tathāgata.",
        "source": "T11n0310_024:0134b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頭面禮足而白佛言：『世尊！",
        "translation": "He bowed his head and feet and said to the Buddha, 'Bhagavān!",
        "source": "T11n0310_024:0134b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何等法能攝諸法善巧方便，能令梵行速得圓滿？",
        "translation": "\"What are the things that bring together these things with skillful means and can cause the rapid consummation of the religious practice?",
        "source": "T11n0310_024:0134b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當修行。』",
        "translation": "I will cultivate it.'",
        "source": "T11n0310_024:0134b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是問已，時彼如來廣為開示。",
        "translation": "After asking this question, the Tathāgata then gave a detailed explanation.",
        "source": "T11n0310_024:0134b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞法已，與其眷屬悉捨安樂資生之具，恭敬供養遍照如來及諸大眾滿二萬歲，於遍照如來法中出家修行正法。",
        "translation": "After hearing the teaching, the king and his retinue all left their necessities for a comfortable life, paid respect and offerings to the Tathāgata Prabhūtaratna and the general public for 20,000 years, and left home to cultivate the right teaching within the Tathāgata Prabhūta's teaching.",
        "source": "T11n0310_024:0134b28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以聞法故，於時獲得受法善根、持法善根、說法善根，有所聞法思惟不忘，無量功德精勤修習，乃發誓願：『願持如來三時正法，為諸眾生種種宣說。』",
        "translation": "As a result of hearing the Dharma, he then attained good roots for accepting the Dharma, good roots for maintaining the Dharma, and good roots for teaching the Dharma, didn't forget what he heard, diligently cultivated measureless merits, and vowed, 'May I maintain the Tathāgata's three periods of correct teaching and explain it in various ways for sentient beings.'",
        "source": "T11n0310_024:0134c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是願已，於勝超劫諸如來所，一一親近供養承事。",
        "translation": "After making this vow, he went to each of the Tathāgatas' places in the surpassing eons, becoming intimate with them, making offerings, and serving them.",
        "source": "T11n0310_024:0134c05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸如來現前正法、中時正法、後時正法悉能受持，教化成熟四萬八千俱胝那由他眾生趣於阿耨多羅三藐三菩提，方便調伏無量眾生住於聲聞辟支佛乘。",
        "translation": "Those Tathāgatas were fully capable of upholding the right teaching in the present, the right teaching in the interim, and the right teaching in the latter, teaching and maturing 48,000 koṭīs of sentient beings who were headed for unsurpassed, correct, and complete enlightenment, and they skillfully disciplined measureless sentient beings to abide in the vehicle of the śrāvakas and solitary buddhas.",
        "source": "T11n0310_024:0134c06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼劫之中最後如來，號曰電光。",
        "translation": "\"The last Tathāgata of that eon was called Telegraphic Lightning.",
        "source": "T11n0310_024:0134c10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勇猛軍比丘聞電光如來說法之時，獲無生忍。",
        "translation": "When that monk Brave Army heard the Dharma teachings of the Tathāgata of Lightning, he attained the acceptance of nonarising.",
        "source": "T11n0310_024:0134c11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "電光如來即為授記：『汝勇猛軍！",
        "translation": "The Tejaprabhā Tathāgata then gave him this prediction: 'You, Brave Army!",
        "source": "T11n0310_024:0134c12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世供養無量千佛世尊，受持如來三時正法，利益無量無數眾生，安立百千俱胝那由他眾生於阿耨多羅三藐三菩提，無量眾生住聲聞乘。",
        "translation": "In future generations, they'll make offerings to measureless thousands of world-honored buddhas, retain the Tathāgata's three periods of correct teaching, benefit measureless and countless sentient beings, and establish one hundred thousand koṭīs of nayutas in the unsurpassed, correct enlightenment, while measureless sentient beings abide in the śrāvaka vehicle.",
        "source": "T11n0310_024:0134c12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃過阿僧祇劫，證阿耨多羅三藐三菩提，號曰無邊精進光明功德超勝王如來。",
        "translation": "Thus, he passes through incalculably long eons and realizes unsurpassed, correct enlightenment, and is called the Tathāgata King of Unlimited Effort, Illuminating Power, and Exceeding Excellence.",
        "source": "T11n0310_024:0134c16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛剎土積集無量清淨功德，安隱豐樂，人民充滿，多有聲聞及菩薩眾。",
        "translation": "That Buddha's buddha land amasses measureless pure virtues, is peaceful and abundant, and its people are filled with a multitude of śrāvakas and bodhisattvas.",
        "source": "T11n0310_024:0134c18_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛壽命至五小劫，滅後正法住一小劫，法教流布天人受持，舍利塔廟遍諸剎土。』",
        "translation": "The Buddha's life span is up to five eons, and after his death the true teaching abides for an eon. The teaching spreads throughout the heavens and is upheld by humans, and relics, stūpas, and temples dot the buddha lands.'",
        "source": "T11n0310_024:0134c19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故勝慧！",
        "translation": "Therefore, excellent wisdom!",
        "source": "T11n0310_024:0134c21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於此清淨甚深之法，應當尊重受持修習，以法嚴具莊嚴其身，法莊嚴故證得如來金剛所成大那羅延堅固之身。",
        "translation": "All bodhisattvas, mahāsattvas, should respect, maintain, and cultivate this pure and profound Dharma, adorn their bodies with the Dharma adornment, and it's because of the Dharma adornment that they realize the Tathāgata's adamantine-produced, resilient body of Narāya.",
        "source": "T11n0310_024:0134c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使三千大千世界一切眾生盡其軀力，而欲破壞堅固之身，乃無有能摧伏之者。",
        "translation": "Even if all the sentient beings in the 3,000 great one-thousand worlds exhausted their physical strength and tried to destroy that sturdy body, there wouldn't be anyone who could subdue it.",
        "source": "T11n0310_024:0134c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世間天人阿修羅眾中，演法光明亦無有能敵論之者。",
        "translation": "Among all the world's gods, humans, and asuras, there would be no one who could counteract the radiance of the Dharma-expounding Dharma.",
        "source": "T11n0310_024:0134c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生於此深法受持讀誦精勤修習，隨其意樂生於清淨大族姓家，乃至坐於菩提樹下，名稱具足、世界殊妙，不雜異道，尚無梵志遮羅迦名，況有惡見邪求之輩。",
        "translation": "If sentient beings memorize, recite, and diligently cultivate this profound teaching, they'll be born according to their wishes into a pure, great clan home or even sit under a bodhi tree with a full set of names, a marvelous world, and no mixture of different paths, yet they don't have the name Brahmacārāja, so why wouldn't there be those with bad views and wrong intentions?",
        "source": "T11n0310_024:0134c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸不善法亦甞未聞，寧有習行不善根者。",
        "translation": "They've never even heard of unskillful things, so how could there be someone who cultivates unskillful roots?",
        "source": "T11n0310_024:0135a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能以足指放大光明，遍照無邊一切世界，一切眾生遇斯光者皆得安樂，當證阿耨多羅三藐三菩提。",
        "translation": "With his toes, he radiates a bright light that shines everywhere in the limitless world, and all sentient beings who encounter that light will attain well-being and will realize unsurpassed, correct enlightenment.",
        "source": "T11n0310_024:0135a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故勝慧！",
        "translation": "Therefore, excellent wisdom!",
        "source": "T11n0310_024:0135a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩摩訶薩於我法中勤修行者，當獲如是殊勝功德。",
        "translation": "If bodhisattvas, mahāsattvas, and those who diligently practice in my teaching, they will attain such extraordinary qualities.",
        "source": "T11n0310_024:0135a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若具說，不可窮盡。」",
        "translation": "If I were to explain them in detail, they couldn't be exhausted.\"",
        "source": "T11n0310_024:0135a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告無邊慧菩薩摩訶薩言：「無邊慧！",
        "translation": "It was then that the Bhagavān addressed the bodhisattva Mahāsattva Boundless Wisdom, saying, \"Boundless Wisdom!",
        "source": "T11n0310_024:0135a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有住斯菩薩道者勤修如是清淨深法，與空相應、寂靜相應，得法光明。",
        "translation": "If someone who abides on this bodhisattva path diligently cultivates such pure and profound dharmas that are associated with emptiness and tranquility, they attain the illumination of the Dharma.",
        "source": "T11n0310_024:0135a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以法光明，見一切法自性無異，性無異故所見清淨，見清淨故則無法見，亦無有法離自性見，法見清淨亦無清淨，無清淨者、無清淨時，能得清淨智之境界。",
        "translation": "With the light of the Dharma, he sees that the own-natures of all things are not different, that the views are pure because the natures are not different, that it's impossible to see because the views are pure, that there are no things that are free of views of their own natures, that views of the purity of things are not pure, and that the state of pure cognition can be attained when those views are not pure and are not pure.",
        "source": "T11n0310_024:0135a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸法界非界非非界，界見清淨，遠離諸界種種性想，離性想故於界理趣祕密言辭而能覺了，亦能遍知諸法非界，以見法界無差別故、不可壞故、不變異故，便獲一切法界理趣善巧方便。",
        "translation": "Seeing that the Dharma realm is neither a realm nor a realm, and that the view of the realm is purified, they're free of various conceptions of the nature of the realm, and because they're free of conceptions of the nature, they can perceive the esoteric words of the principle and the way of the realm and completely know that things are not realms because they see that the Dharma realm is nondistinct, indestructible, and unchanging, and then they acquire the skillful means to understand the principle and way of all the Dharma realms.",
        "source": "T11n0310_024:0135a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以善方便遍能了知法界理趣，以等持力於諸法界差別理趣隨順能入。",
        "translation": "Being able to fully comprehend the principles and objectives of the Dharma realm with good skillful means, they are able to follow and enter the various discriminating principles and objectives of the Dharma realm with the power of equipoise.",
        "source": "T11n0310_024:0135a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住此行時，以一切法善巧方便，於一切法無住無著，無所著故能於一切法界理趣隨其所應種種開示。",
        "translation": "When he abides in this practice, with skillful means for all things, he's unmoored and unattached to all things, and because he's unattached, he can give various insights into the principle and destinies of all the realms of reality as they arise.",
        "source": "T11n0310_024:0135a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等持力故，復能出生靜慮解脫等持等至，遊戲神通變一為多變多為一，山石牆壁飛行自在而無罣礙。",
        "translation": "Because of the power of equipoise, he can also produce equipoises of meditation and liberation, perform miraculous feats that change one into many and many into one, and fly freely over mountains and walls without obstruction.",
        "source": "T11n0310_024:0135a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善巧能知四界和合不住於界，知一切界與空界合，於虛空界無著無繫，以界和合善巧智故。",
        "translation": "He's skilled at knowing the confluence of the four elements and doesn't stop at the elements, knowing that all elements and the element of space are confluent, and he's unattached and unfettered in the element of space because of the skillful knowledge of the confluence of elements.",
        "source": "T11n0310_024:0135a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切界方便修習，以修習故決了水界，能於水界或令起煙、或令發焰、或復於中煙焰俱熾，乃至無量種種變現，為諸眾生作大饒益。",
        "translation": "He skillfully cultivates skillfulness in all elements, and because of that cultivation, he can decisively understand the water element and cause smoke to arise, cause flames to emit, or cause both smoke and flames to blaze in the water element, as well as countless other manifestations, which greatly benefit sentient beings.",
        "source": "T11n0310_024:0135a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以能安住法界理趣善巧方便而無所動，隨其意樂，隨何佛剎能於諸有轉胎藏形受化生身，常見十方一切世界諸佛如來。",
        "translation": "Because they are able to abide in the principle and destiny of the Dharma realm with skillful means and are unmoved, according to their wishes, they can transform the womb-container form of sentient beings into a transformation body at any buddha-stage, which is commonly seen as the Tathāgatas of all the worlds in the ten directions.",
        "source": "T11n0310_024:0135b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸如來，如是名號、如是族姓、如是眾會、如是說法、悉分別知。」",
        "translation": "Those tathāgatas are all separately known by such names, such lineages, such congregations, and such teachings.\"",
        "source": "T11n0310_024:0135b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾中復有菩薩摩訶薩名無邊勝，前白佛言：「世尊！",
        "translation": "At the time, there was another bodhisattva among the crowd named Boundless Victory who came forward and said to the Buddha, \"Bhagavān!",
        "source": "T11n0310_024:0135b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩住何等法，如佛所說能得如是最勝功德？」",
        "translation": "What kinds of things do bodhisattvas and mahāsattvas abide in that enable them to attain such supreme qualities as the Buddha has taught?\"",
        "source": "T11n0310_024:0135b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告無邊勝菩薩摩訶薩言：「無邊勝！",
        "translation": "It was then that the Bhagavān addressed the Infinite Victory Bodhisattva Mahāsattva, saying, \"Infinite Victory!",
        "source": "T11n0310_024:0135b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法無所住者，如我所說，能得如是最勝功德。",
        "translation": "All bodhisattvas, mahāsattvas, and those who don't have any abiding in all things as I've described them can attain such most excellent qualities.",
        "source": "T11n0310_024:0135b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊勝！",
        "translation": "Boundlessly excellent!",
        "source": "T11n0310_024:0135b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩若住於色受想行識、若住地界水界火界風界空界、若住欲界色界無色界，我於此經則不說有斯諸功德。",
        "translation": "If bodhisattvas, mahāsattvas, and consciousnesses abide in the form, feeling, perception, volition, and form realms, the earth realm, the water realm, the fire realm, the air realm, and the space realm, or the desire realm, the form realm, and the formless realm, I wouldn't say in this sūtra that there's such merit.",
        "source": "T11n0310_024:0135b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然諸菩薩摩訶薩於一切法而無所住，不入不出，故我說彼當得無邊大功德海。",
        "translation": "However, since bodhisattvas, mahāsattvas, and ascetics have no place to abide and don't enter or leave, I say they will attain an infinite ocean of great merit.",
        "source": "T11n0310_024:0135b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_024:0135b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩無有少法可得可住，亦無少法若入若出，善能安住諸法理趣而無所動。",
        "translation": "There are few things that bodhisattvas, mahāsattvas, can attain or abide in, and there are few things that enter or exit and are well able to abide in the principle and destiny of dharmas without being disturbed.",
        "source": "T11n0310_024:0135b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_024:0135b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩無住無動，以無動故無高無下，無高下故遠離於高不住於下，以不住故名善處住，善處住者於無處住，無處住者不住於處。",
        "translation": "\"Bodhisattvas, mahāsattvas have no abiding and no movement, and because there's no movement, there's nothing high and nothing low, and because there's nothing high and nothing low, they're free from heights and don't stop at the bottom; because they don't stop, they're called abiding in a good place, abiding in no place when they abide in a good place, and abiding in no place when they don't stop at a place.",
        "source": "T11n0310_024:0135b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩不於少法若有安立、若有積集，無處無住、無起無作。",
        "translation": "If bodhisattvas, mahāsattvas, don't establish themselves in few things or accumulate them if they exist, there's no place, no abiding, and nothing that arises or is created.",
        "source": "T11n0310_024:0135b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_024:0135b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "處不可得。",
        "translation": "\"The abode is unobtainable.",
        "source": "T11n0310_024:0135b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無處故則無分別，無分別故不動處住如法界住。",
        "translation": "Because there's no place, then there's no discrimination, and because there's no discrimination, the immovable stage abides as the Dharma realm abides.",
        "source": "T11n0310_024:0135b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有處住則無有住，於處無處無所執著名為善住。",
        "translation": "When there's no place to abide, then there's no abiding, and that's called abiding well when there's no place to which one has no attachment.",
        "source": "T11n0310_024:0135b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊勝！",
        "translation": "Boundless excellence!",
        "source": "T11n0310_024:0135b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於法理趣而安住者，如是安立住於無住。",
        "translation": "\"When bodhisattvas, mahāsattvas, and those who stand firm in the principle of the destination of dharmas, they thus establish their abiding in nonabiding.",
        "source": "T11n0310_024:0135b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無住處住，見一切法無有分別，住於如是無分別行。",
        "translation": "Abiding in abiding in abstinence, they see all things without discrimination and abide in such nondiscriminating practice.",
        "source": "T11n0310_024:0135b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是行，見一切法而無所動，則與如理而住相應、則與如理不動相應、則與如理不取相應。」",
        "translation": "With such practice, they see all things without being moved, which is associated with abiding in the truth, which is associated with being unmoving in the truth, and which is associated with not grasping the truth.\"",
        "source": "T11n0310_024:0135b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「菩薩正憶念，　　於義善思惟，　不住諸法中，　　說名為智者。",
        "translation": "It was then that the Bhagavān spoke this verse, \"A bodhisattva who correctly recollects, well contemplates meaning, and doesn't abide in dharmas is said to be a wise one.",
        "source": "T11n0310_024:0135c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　未曾有少法，　　可為安立者，　以無安立故，　　無畏而發趣。",
        "translation": "There's never been a few things that can be posited, and because they aren't posited, they fearlessly set out for them.",
        "source": "T11n0310_024:0135c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不立於諸色，　　亦不立諸受，　諸想及諸行，　　識等亦如是。",
        "translation": "It doesn't establish form, nor does it establish sensation, concepts, and volitions, nor does consciousness.",
        "source": "T11n0310_024:0135c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不住於諸蘊，　　諸界及諸處，　若處若非處，　　亦常無所住。",
        "translation": "They don't abide in the aggregates, the elements, or the fields, whether they are places or non-places, and they always lack abode.",
        "source": "T11n0310_024:0135c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不住於地界，　　亦不住水界，　火界及風界，　　亦常無所住。",
        "translation": "They don't abide in the element of earth, nor do they abide in the element of water, nor do they abide in the element of fire or wind, nor do they always abide in anything.",
        "source": "T11n0310_024:0135c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不住於欲界，　　色界無色界，　得無安立故，　　不住於三界。",
        "translation": "They don't abide in the desire realm, the form realm, or the formless realm, and because they attain stability, they don't abide in the three realms.",
        "source": "T11n0310_024:0135c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　及以虛空界，　　於彼無所住，　以無有所住，　　平等而發趣。",
        "translation": "And in the element of space, there's no abiding there, and because there's no abiding there, it's an equal destination.",
        "source": "T11n0310_024:0135c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　故無有少法，　　於中而可住，　若得無所住，　　斯為妙智者。",
        "translation": "Therefore, there's no little dharma in which to abide, and if he attains no abiding, this is marvelous cognition.",
        "source": "T11n0310_024:0135c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　妙智無所住，　　無住為菩薩，　能得如是住，　　則住法界中。",
        "translation": "When the sublime wisdom has no abode, the bodhisattva who has no abode is able to abide in the Dharma realm if he attains such an abode.",
        "source": "T11n0310_024:0135c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無住相應故，　　彼常能善住，　無住無依止，　　於法得安住。",
        "translation": "Because it's associated with nonabiding, they can always abide well, abiding in nonabiding without support, and attain stability in the Dharma.",
        "source": "T11n0310_024:0135c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若得不依止，　　則常無所動，　不入亦不出，　　平等善安住。",
        "translation": "If they attain non-support, they'll always be unmoving, not entering or leaving, and equally well-abiding.",
        "source": "T11n0310_024:0135c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於法如是住，　　斯為勇猛者，　一切法無高，　　一切法無下。",
        "translation": "Someone who thus abides in qualities is courageous, for all qualities are not high, and all qualities are not low.",
        "source": "T11n0310_024:0135c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是無所動，　　法界善安住，　安住不動故，　　便得無上住。",
        "translation": "Thus unmoving, they are well-abiding in the Dharma realm, and because they are well-abiding and unmoving, they attain a supreme abode.",
        "source": "T11n0310_024:0135c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不住住相應，　　斯為勇猛者，　不住於住處，　　於處無所動。",
        "translation": "Concomitant with abiding in nonabiding, this is courageous, doesn't abide in an abode, and is unmoving in that abode.",
        "source": "T11n0310_024:0135c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　成就無住處，　　而得善安住，　若處若非處，　　一切無所動。",
        "translation": "He accomplishes the abode of no-abiding and attains well-abiding, whether it's a place or a non-place, in which nothing moves.",
        "source": "T11n0310_024:0136a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　住於不動處，　　乃名為不動，　若住不動處，　　一切無所住。",
        "translation": "Stand in a place that's motionless, and it's called motionless, and if you stand in a place that's motionless, nothing stands.",
        "source": "T11n0310_024:0136a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不念處非處，　　常住無分別，　不住於處故，　　則無有所動。",
        "translation": "He's not mindful of either the abode or the non-abode, but he always abides without discrimination, and because he doesn't abide in the abode, nothing moves.",
        "source": "T11n0310_024:0136a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於處無所動，　　一切得無住，　若得不住處，　　處非處不動。",
        "translation": "Being unmoving in a place, all things attain unabiding, and if they attain unabiding, both the place and the non-place are unmoving.",
        "source": "T11n0310_024:0136a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於處不動，　　乃善住於處，　善住處安住，　　則住無所住，　能見一切法，　　住法相應住。",
        "translation": "If they don't move from place to place, they abide well in place, and when they abide well in place and are stable, they abide in nothing, are able to see all things, and abide in the characteristics of things as they should be abided in.",
        "source": "T11n0310_024:0136a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是見諸法，　　種種無所住，　無住無安住，　　善巧於法住。",
        "translation": "Thus seeing all dharmas in various ways, abiding in nothing, abiding in nothing, and abiding skillfully in dharmas.",
        "source": "T11n0310_024:0136a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常住於諸法，　　而無有分別，　離諸分別故，　　斯為不動者。",
        "translation": "He always abides in dharmas without discrimination, and because he's free of discrimination, this is called someone who isn't moving.",
        "source": "T11n0310_024:0136a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能住不動，　　於行無分別，　遠離處非處，　　斯為觀察者。",
        "translation": "If he can abide in immovability, has no discrimination in his actions, and is free of both places and non-places, this is someone who observes.",
        "source": "T11n0310_024:0136a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能觀不動，　　一切無所動，　諸法常平等，　　如是而發趣。",
        "translation": "If he can observe immovability, nothing is moved, and all things are always equal, he'll thus set out for the goal.",
        "source": "T11n0310_024:0136a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如理住相應，　　如理而不動，　得無動處者，　　常住於無處。」",
        "translation": "Concomitant with abiding in principle, they are immovable according to principle, and they attain a state of immovability that's always abiding in no place.\"",
        "source": "T11n0310_024:0136a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時無邊勝菩薩摩訶薩復白佛言：「希有世尊！",
        "translation": "It was then that the infinitely superior bodhisattva Mahāsattva again said to the Buddha, \"Sincerely yours, Bhagavān!",
        "source": "T11n0310_024:0136a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃能安立諸菩薩摩訶薩於法理趣，無有繫縛、無有解脫。",
        "translation": "It's then possible to establish that bodhisattvas, mahāsattvas, have no fetters and no liberation in the doctrinal destiny of the Dharma.",
        "source": "T11n0310_024:0136a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_024:0136a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於法理趣善巧安立，不與少法若相應若不相應、若和合若不和合、若攝取若不攝取、若有所歸若無所歸、若貪離貪、若瞋離瞋。",
        "translation": "Those bodhisattvas, mahāsattvas, skillfully establish the principle of the way things are, not agreeing or not agreeing with few things, combining or not combining, taking or not taking, returning to something or not returning to something, parting with greed, and parting with anger.",
        "source": "T11n0310_024:0136a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_024:0136a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法理趣之中善巧安立，設有眾生供養恭敬，不生貪愛毀辱逼惱，不生瞋恚，無種種想，離一切法。",
        "translation": "\"Bodhisattvas, mahāsattvas skillfully establish the principle and destiny of all things, making offerings to and respecting sentient beings, not craving, disrespecting and harassing them, not becoming angry, not having various conceptions, and being free of all things.",
        "source": "T11n0310_024:0136a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見少法能與少法若相應若不相應，超過相應不相應故。",
        "translation": "He doesn't see how few things can be associated or disassociated with few things, and it's because they're more than associated and disassociated.",
        "source": "T11n0310_024:0136b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離相應不相應想，了知相應不相應想。",
        "translation": "He's free of conceptions of what's associated and what's not associated, and he perceives conceptions of what's associated and what's not associated.",
        "source": "T11n0310_024:0136b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "超過了知，不於少法若進若退、若有所趣若無所趣而作相應。",
        "translation": "Exceeding this knowledge, they don't associate few things with something that's an advance or a retreat, or with something that has an aim or no aim.",
        "source": "T11n0310_024:0136b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法理趣之中而無妄念，亦無所取，以善方便不壞法性。",
        "translation": "In the midst of all the principles and destinies of dharmas, he has no false thoughts and grasps nothing, and he doesn't destroy the nature of dharmas with good methods.",
        "source": "T11n0310_024:0136b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_024:0136b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法如是住時，能以善巧宣說一切法界理趣，一切佛法速得圓滿。」",
        "translation": "When bodhisattvas and mahāsattvas thus abide in all things, they can skillfully explain the principle and destiny of all the Dharma realms, and all the Buddha-dharmas quickly become complete.\"",
        "source": "T11n0310_024:0136b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告無邊慧菩薩摩訶薩言：「無邊慧！",
        "translation": "It was then that the Bhagavān addressed the bodhisattva Mahāsattva Boundless Wisdom, saying, \"Boundless Wisdom!",
        "source": "T11n0310_024:0136b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於佛法中無所安立、無所住時，則見佛法無有安立、無有所住，亦無勝住、亦無遍住，見佛法住不傾動故、不流轉故、不變異故，一切法界相應而住，乃名一切法界理趣善巧安立。",
        "translation": "When bodhisattvas, mahāsattvas, have nothing to stand for and nothing to abide in in the Buddha's teaching, then they see that the Buddha's teaching has nothing to stand for, nothing to abide in, nothing to abide in above, and nothing to abide in everywhere, and they see that the Buddha's teaching abides in a way that's not tilted, doesn't flow, and doesn't change, and that's the result of abiding in all the Dharma realms together, which is called the skillful determination of the principle of all the Dharma realms.",
        "source": "T11n0310_024:0136b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊慧！",
        "translation": "Boundless wisdom!",
        "source": "T11n0310_024:0136b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於佛法中，無住無不住、無勝住無遍住、無處住無非處住，亦無所動，亦無分別、無勝分別、無遍分別，乃名一切法界理趣善巧安立。",
        "translation": "In the Buddha's teaching, bodhisattvas, mahāsattvas have no abiding, no non-abiding, no superior abiding, no pervasive abiding, no abiding in any place or no non-place, and nothing that moves, and no discrimination, no superior discrimination, and no pervasive discrimination, which are called the skillful establishment of the principle and aim of all the realms of reality.",
        "source": "T11n0310_024:0136b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊慧！",
        "translation": "Boundless wisdom!",
        "source": "T11n0310_024:0136b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩不見少法能與少法而為安立，亦不見有一切法處為勝安立，亦無分別、無勝分別、無遍分別，乃名一切法界理趣善巧安立。",
        "translation": "When bodhisattvas, mahāsattvas don't see how few things can be posited with few things, nor do they see all dharmas as being superiorly posited, nor are they discriminated, superiorly discriminated, or pervasively discriminated, this is called the skillful positing of all the principles and objectives of the Dharma realm.",
        "source": "T11n0310_024:0136b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊慧！",
        "translation": "Boundless wisdom!",
        "source": "T11n0310_024:0136b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩不見少法若住若去，亦無分別、無勝分別、無遍分別，見一切法如淨虛空，光明顯照遠離煩惱，於一切法光明照故，乃名一切法界理趣得善方便不以安立而觀法界。",
        "translation": "\"Bodhisattvas, mahāsattvas don't see few things as standing or departing, and they have no discrimination, no superior discrimination, and no pervasive discrimination, seeing all things as pure space, shining brightly and free from affliction, and because they shine brightly in all things, they are called the principle and aim of the whole Dharma realm and attain the skillful method of observing the Dharma realm without establishing it.",
        "source": "T11n0310_024:0136b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_024:0136b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不於法界少安立故。",
        "translation": "\"It's because they don't establish themselves little in the realm of reality.",
        "source": "T11n0310_024:0136b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空及以風界無有處所，亦無可見、無安立處、無依止處、無可示現。",
        "translation": "It's like space and the wind element have no place, and there's no place that's visible, no place of stability, no place of support, and nothing to show.",
        "source": "T11n0310_024:0136b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界亦爾，無可入處、無可見處、無安立處、無依止處，亦無了知、亦無示現。",
        "translation": "Similarly, the Dharma realm has no place to enter, no place to be seen, no place to be established, no place to rest, and no place to be known or shown.",
        "source": "T11n0310_024:0136b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩無示現故，與如如界相應而住。",
        "translation": "Because they have no manifestation, bodhisattvas, mahāsattvas, and thusness realms are abiding together.",
        "source": "T11n0310_024:0136c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊慧！",
        "translation": "Boundless wisdom!",
        "source": "T11n0310_024:0136c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法界無生無命無老無死、無昇無沈無示現界，是為法界。",
        "translation": "\"All realms of reality that have no birth, no life, no aging, no death, no rising, no sinking, and no manifestation realms are called the Dharma realm.",
        "source": "T11n0310_024:0136c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無變異界是為法界，而法界者遍一切處。",
        "translation": "The realm of no variation is the Dharma realm, and the Dharma realm pervades all places.",
        "source": "T11n0310_024:0136c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊慧！",
        "translation": "Boundless wisdom!",
        "source": "T11n0310_024:0136c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界無去亦無去處，無去處故乃名法界相應而住。",
        "translation": "The Dharma realm has neither going nor no going place, and because there's no going place, it's called the Dharma realm that's abiding together.",
        "source": "T11n0310_024:0136c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如如法界於中無處亦無非處。",
        "translation": "Thus, the Dharma realm has no place in it, and there's no place that's not a place.",
        "source": "T11n0310_024:0136c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0310_024:0136c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如如法界、如如自性無所有故。",
        "translation": "As such, the Dharma realm and thusness of self-nature are without existence.",
        "source": "T11n0310_024:0136c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無邊慧！",
        "translation": "\"Boundless wisdom!",
        "source": "T11n0310_024:0136c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩聞我此說，則於一切法界理趣便獲無邊大法光明。",
        "translation": "When bodhisattvas and mahāsattvas hear this teaching from me, they then attain a limitless great Dharma illumination in the principle destinies of all the Dharma realms.",
        "source": "T11n0310_024:0136c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以法光明得無生忍，速能圓滿如來十力、十八不共、一切佛法。",
        "translation": "Attaining the patient acceptance of nonarising because of that Dharma illumination, they'll quickly be able to perfect the Tathāgata's ten powers, eighteen distinctive characteristics, and all the Buddha's teachings.",
        "source": "T11n0310_024:0136c09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲成熟一切眾生廣大善根勝資糧故、如來種性無斷絕故，速詣道場轉于法輪，蔽諸魔宮摧伏異論，作善丈夫大師子吼，為諸眾生演說妙法，隨其樂欲、隨其志願、隨其發趣正解脫故，皆令趣於阿耨多羅三藐三菩提。」",
        "translation": "Because he wants to mature the vast accumulation of good roots in all sentient beings and the Tathāgata's seed nature is not cut off, he quickly goes to the site of enlightenment, turns the wheel of the Dharma, shields the demonic palaces from divergent views, subdues dissenting philosophers, becomes a great teacher who roars like a good husband, expounds the wonderful Dharma for sentient beings, and causes them to go to unsurpassed, correct liberation according to their desires, wishes, and aspirations.\"",
        "source": "T11n0310_024:0136c11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「一切菩薩，　　不住諸法，　　於佛法中，　無所安立。",
        "translation": "It was then that the Bhagavān spoke this verse, \"All bodhisattvas don't abide in the Dharma, and within the Dharma of the Buddha, there's nothing to stand on.",
        "source": "T11n0310_024:0136c16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　　無安立故，　於佛法中，　　無畏發趣。",
        "translation": "Because they are unstable, all bodhisattvas have no fear in the Buddha's teachings and no point of departure.",
        "source": "T11n0310_024:0136c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　見諸佛法，　　無住無處，　　妙善安立。",
        "translation": "All bodhisattvas see the Buddha's teachings as having no abiding place and no location, and they are wonderfully well-established.",
        "source": "T11n0310_024:0136c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切菩薩，　　不住於處，　　能見諸法，　無住無退。",
        "translation": "Without abiding in a place, all bodhisattvas see the Dharma, which has no abiding and no turning back.",
        "source": "T11n0310_024:0136c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　　見法無住，　不動佛法，　　不求佛法。",
        "translation": "All bodhisattvas see things as nonabiding, don't move the Buddha's teachings, and don't seek the Buddha's teachings.",
        "source": "T11n0310_024:0136c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　見法不異，　　不動佛法，　　亦不推尋。",
        "translation": "All bodhisattvas see things as they are and aren't different, don't move the Buddha's teachings, and don't seek them out.",
        "source": "T11n0310_024:0136c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切菩薩，　　見法如是，　　於法善巧，　方便而住。",
        "translation": "All bodhisattvas see things as they are, skillfully abide in the teachings, and skillfully work with the teachings.",
        "source": "T11n0310_024:0136c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　　見常平等，　不住佛法，　　亦非不住，　　常無住處，　亦非無處，　　常不分別，　　非不分別，　種種分別，　　常無所有。",
        "translation": "All bodhisattvas see permanence as equality, don't abide in the Buddha-dharma, don't stop, are always without abiding place, aren't without place, are always nondiscriminating, aren't nondiscriminating, and have various kinds of discrimination that are always without possession.",
        "source": "T11n0310_024:0136c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　無住相應，　　於諸時處，　　而無所動。",
        "translation": "All bodhisattvas are associated with nonabiding, and in all places and times, they are unmoving.",
        "source": "T11n0310_024:0136c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切菩薩，　　於法理趣，　　平等住時，　名為善住。",
        "translation": "When all bodhisattvas equally abide in the principles and aims of dharmas, that's called good abiding.",
        "source": "T11n0310_024:0137a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　　於法理趣，　不見少法，　　可平等住。",
        "translation": "All bodhisattvas, when they don't see few things as the principle aim of dharmas, can abide equally.",
        "source": "T11n0310_024:0137a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　能見諸法，　　無有處所，　　亦不離處，　得無所動，　　亦無親近。",
        "translation": "All bodhisattvas can see qualities that have no place and don't part from a place, attain immobility, and have no intimacy.",
        "source": "T11n0310_024:0137a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　於一切法，　　理趣善巧，　　方便安住，　住無所住，　　名為菩薩。",
        "translation": "All bodhisattvas are called bodhisattvas when they skillfully and conveniently abide in the principle of all things and abide in nothing.",
        "source": "T11n0310_024:0137a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　不於少法，　　若去若來，　　分別而住，　爾時乃住，　　諸法理趣。",
        "translation": "All bodhisattvas don't abide in a few things, whether past or future, with discrimination, and then they abide in the principle and aim of all things.",
        "source": "T11n0310_024:0137a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　於法理趣，　　種種安住，　　能起無邊，　大法光明。",
        "translation": "All bodhisattvas abide in various ways in the principles and objectives of dharmas, and they can produce limitless great dharma-light.",
        "source": "T11n0310_024:0137a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以法光明，　　住平等見，　見一切法，　　及法理趣，　　如淨虛空，　如影如像，　　平等無垢。",
        "translation": "Abiding in the vision of equality with the light of the Dharma, they see all things and the principles and destinies of dharmas as pure space, like shadows and images, and equal and undefiled.",
        "source": "T11n0310_024:0137a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　於見了知，　　亦無了知，　　遠離自性。",
        "translation": "All bodhisattvas perceive views and have no perceptions, which are free from their own nature.",
        "source": "T11n0310_024:0137a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切菩薩，　　如是觀察，　　於一切法，　理趣而住，　　能於法界，　　堅固勤修，　說名法界，　　理趣方便。",
        "translation": "All bodhisattvas thus observe, abide in the principle and objective of all things, and are able to resolutely cultivate the Dharma realm, which is called the Dharma realm and the principle and objective of skillful means.",
        "source": "T11n0310_024:0137a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　不住法界，　　觀諸法界，　　畢竟非有。",
        "translation": "All bodhisattvas don't abide in the Dharma realm and contemplate that the Dharma realm is ultimately nonexistent.",
        "source": "T11n0310_024:0137a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切菩薩，　　決了法界，　　見一切法，　如虛空風，　　無有安立，　　遍一切處。",
        "translation": "All bodhisattvas conclusively understand the Dharma realm, see all dharmas as the wind of space, which has no basis, and pervade all places.",
        "source": "T11n0310_024:0137a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法界亦爾，　　遍一切處，　　法界難思，　無可示現。",
        "translation": "So too, the Dharma realm pervades all places, and it's difficult to fathom and impossible to show.",
        "source": "T11n0310_024:0137a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於諸智者，　　不作親近，　無示現界，　　乃為法界，　　無有住處，　名為住者。",
        "translation": "Those who know it don't draw near to it, and there's no manifesting element that's the Dharma realm, which has no abiding place and is called an abider.",
        "source": "T11n0310_024:0137a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　法界無生，　　無命無老，　無死無沈，　　亦無出離。",
        "translation": "The Dharma realm has no birth, no life, no old age, no death, no sinking, and no escape.",
        "source": "T11n0310_024:0137a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　法界難思，　無來無去，　　法界非蘊，　　非界非處，　亦不離處，　　而無所動。",
        "translation": "The Dharma realm is difficult to fathom, has no coming or going, is not an aggregate, is not a realm or a place, and doesn't part from a place; it's unmoving.",
        "source": "T11n0310_024:0137a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　法界如如，　自性非有。",
        "translation": "The Dharma realm is as it is, and its own nature is not possessed.",
        "source": "T11n0310_024:0137a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切菩薩，　　如是了知，　法界難思，　　得法光明。",
        "translation": "All bodhisattvas thus understand that the Dharma realm is difficult to contemplate and attain illumination of the Dharma.",
        "source": "T11n0310_024:0137a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　由是發趣，　往詣道場，　　而於佛法，　　無有疑惑，　不為所動，　　以法光明，　　令諸眾生，　獲大安樂。",
        "translation": "Thus motivated, they go to the site of enlightenment, have no doubts about the Buddha's teaching, aren't moved, and cause sentient beings to attain great well-being with the light of the teaching.",
        "source": "T11n0310_024:0137b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無邊慧！",
        "translation": "\"Boundless wisdom!",
        "source": "T11n0310_024:0137b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩能於如是甚深之法勤修行者，乃得如是大法光明，以此智慧而發趣於阿耨多羅三藐三菩提。",
        "translation": "If bodhisattvas, mahāsattvas, and practitioners can diligently practice such a profound teaching, they'll attain such a great radiance of the teaching that their wisdom will lead them to unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_024:0137b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大寶積經卷第二十四",
        "translation": "Mahāratnapratimaṇḍita-sūtra, Vol. 24",
        "source": "T11n0310_024:0137b08_0",
        "is_bad_quality": false
    }
]