[
    {
        "source_sentence": "佛說如來不思議祕密大乘經卷",
        "translation": "Foshuo rulai busiyi mimi dasheng jing roll",
        "source": "T11n0312_007:0718c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七",
        "translation": "seventh",
        "source": "T11n0312_007:0718c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譯經三藏朝散大夫試光祿卿",
        "translation": "Tripiṭaka Translation of the Sutra, Trial of the Secretary of Guanglu by the Minister of Chaoshan",
        "source": "T11n0312_007:0718c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光梵大師賜紫沙門臣惟淨等",
        "translation": "Vaiśravaṇa, Minister Weixing, and others, bestowed by Great Master Guangfan",
        "source": "T11n0312_007:0718c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translation of the imperial edict",
        "source": "T11n0312_007:0718c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來身密不思議品第七之餘",
        "translation": "the seventh and final stage of the Tathāgata's esoteric and inconceivable body",
        "source": "T11n0312_007:0718c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Jiji-hye!",
        "source": "T11n0312_007:0718c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來身相，一眾會中有得見者、有不見者；其得見者歡喜瞻仰，其不見者默然懵瞪。",
        "translation": "\"Regarding the Tathāgata's bodily appearance, there are those who can see it and those who can't see it in a congregation, and those who can see it rejoice and venerate it, while those who can't see it stare blankly at it.",
        "source": "T11n0312_007:0718c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧當知，如來不以段食資養。",
        "translation": "Still, wise people should know that the Tathāgata doesn't feed himself with small portions of food.",
        "source": "T11n0312_007:0718c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生見佛亦受世間食者，謂有威力具足修菩提行，諸賢聖眾常隨佛後，於食器中承受其食。",
        "translation": "Some sentient beings who see the Buddha also receiving worldly food are those who have the authority and perfect cultivation of the enlightening practices, and the noble ones who always follow him and accept his food in a food container.",
        "source": "T11n0312_007:0718c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是乃眾生見佛如來數數舉食置食器中。",
        "translation": "Such sentient beings see the Buddha as a tathāgata who repeatedly lifts food into the food container.",
        "source": "T11n0312_007:0718c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸賢聖既受食已，若有眾生於佛法中所應化度，宿種善根業障盡者，雖復在在所生不得飲食饑渴羸劣，以其宿善力故，彼等眾生得佛如來殘食而食。",
        "translation": "After they accept the food, if there are sentient beings who should be saved by the Buddha's teaching and whose past good roots and karmic hindrances have ended, even though they're still born in the same place and can't eat, are hungry, thirsty, and weak, those sentient beings will receive the remnants of the Buddha Tathāgata's food and eat it because of their past good power.",
        "source": "T11n0312_007:0718c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食已飽滿心得輕安，身肢潤益深心清淨，即發阿耨多羅三藐三菩提心。",
        "translation": "After they've eaten and been satisfied, their minds are light and peaceful, and their limbs are nourished and their minds are deeply purified, which then gives rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0312_007:0718c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生墮在地獄、餓鬼、諸惡趣者，即不能發大菩提心。",
        "translation": "If sentient beings fall into hell, hungry ghosts, or other bad destinies, they won't be able to give rise to the great mind of enlightenment.",
        "source": "T11n0312_007:0719a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，乃至盡涅槃界，寂慧！",
        "translation": "For this reason, up to the final realm of nirvāṇa, calm wisdom!",
        "source": "T11n0312_007:0719a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知如來不受世間飲食，如來資養所謂法食。",
        "translation": "Therefore, you should know that the Tathāgata doesn't accept worldly food and drink, and the Tathāgata provides what's called Dharma food.",
        "source": "T11n0312_007:0719a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛身堅固如那羅延天，真實故、不壞故，金剛所成。",
        "translation": "The Buddha's body is as sturdy as that of the Nārāyaṇa gods, which is real and indestructible and made of adamantine material.",
        "source": "T11n0312_007:0719a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧！",
        "translation": "Silent wisdom!",
        "source": "T11n0312_007:0719a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來身者，非生熟藏之所成養，亦非涕洟雜惡不淨所成。",
        "translation": "\"The Tathāgata's body is not formed from the store of birth and maturation, nor is it formed from tears and mucus, or from bad and impure things.",
        "source": "T11n0312_007:0719a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來身者，如閻浮檀金，無缺無斷離諸過失。",
        "translation": "The Tathāgata's body is like jambū gold, without flaw or breakage, and free of faults.",
        "source": "T11n0312_007:0719a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來身者，具大威力體堅重故猶如金剛，極柔軟故如迦左隣那衣，隨所觸身皆獲妙樂。",
        "translation": "The Tathāgata's body is endowed with great authority, is like adamantine because its body is strong, and is like Kātyāyana's robe because it's extremely flexible, and attains marvelous happiness whenever it touches his body.",
        "source": "T11n0312_007:0719a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧當知，一時有諸具大威力天子天女禮敬佛足，隨禮敬時手觸佛足，觸已即發阿耨多羅三藐三菩提心。",
        "translation": "Silent Wisdom, you should know that there's a time when gods, sons, and daughters of great authority venerate the Buddha's feet and touch his feet with their hands as they venerate him, and after touching them, they immediately give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0312_007:0719a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知，如來不從雜染所生。",
        "translation": "Therefore, you should know that the Tathāgata doesn't arise from defilements.",
        "source": "T11n0312_007:0719a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Jiji-hui!",
        "source": "T11n0312_007:0719a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有貪行眾生暫見如來身已，即於自身生離貪想；瞋行眾生暫見如來身已即起慈心；癡行眾生暫見如來身已，即得智光照耀；等分行眾生暫見如來身已，即於己身離諸煩惱；慳悋眾生暫見如來身已，即能信解捨法；破戒眾生暫見如來身已，即能信解戒法清淨；忿恚心眾生暫見如來身已即得忍法；懈怠眾生暫見如來身已即起精進；散亂心眾生暫見如來身已即得寂定；愚癡眾生暫見如來身已即得勝慧。",
        "translation": "世間所有貪行眾生暫見如來身已，即於自身生離貪想；瞋行眾生暫見如來身已即起慈心；癡行眾生暫見如來身已，即得智光照耀；等分行眾生暫見如來身已，即於己身離諸煩惱；慳悋眾生暫見如來身已，即能信解捨法；破戒眾生暫見如來身已，即能信解戒法清淨；忿恚心眾生暫見如來身已即得忍法；懈怠眾生暫見如來身已即起精進；散亂心眾生暫見如來身已即得寂定；愚癡眾生暫見如來身已即得勝慧。",
        "source": "T11n0312_007:0719a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0312_007:0719a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取要而言，若諸眾生暫見如來身者，一切善法皆不捨離，一切不善疑等染法悉得銷除、安立善心，然佛如來而常安住無分別捨。",
        "translation": "To summarize, if sentient beings see the Tathāgata's body for a moment, they won't part with all good qualities, and all defiled qualities like unwholesome doubt can be removed and a good mind established, yet the Buddha Tathāgata always remains in equanimity without discrimination.",
        "source": "T11n0312_007:0719a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說是名如來身密。",
        "translation": "This is called the mystery of the Tathāgata's body.",
        "source": "T11n0312_007:0719a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Jñānôttara-vairocana!",
        "source": "T11n0312_007:0719a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如如來化所化人作諸佛事，而佛如來心無加行，亦無發悟復無作意。",
        "translation": "\"It's also like a Tathāgata who does all the buddha-works for the people he transforms, but the Tathāgata's mind has no applied practices, no awakening, and no intention to do so.",
        "source": "T11n0312_007:0719a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦不作是念：『我能化彼所化人等。』",
        "translation": "Nor does the Buddha think, 'I can teach those people I've trained.'",
        "source": "T11n0312_007:0719a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然所化眾生可應度者，若此世界若他世界，乃至阿僧祇百千世界一切眾生，為成熟故作諸利益。",
        "translation": "Still, if the sentient beings he transforms can be saved, whether in this world or in another world, or even in a hundred thousand incalculable worlds, he'll work for the benefit of all sentient beings in order to bring them to maturity.",
        "source": "T11n0312_007:0719a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說是名如來身密。",
        "translation": "This is called the mystery of the Tathāgata's body.",
        "source": "T11n0312_007:0719b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Silent Wisdom!",
        "source": "T11n0312_007:0719b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來身放廣大光明，具有無數百千種色，其光普照十方一切殑伽沙等諸佛剎土，廣為成熟一切眾生。",
        "translation": "The Tathāgata's body radiates a vast radiance with measureless hundreds of thousands of colors, and its light universally illuminates all the sands and buddha-lands in the ten directions, extensively maturing all sentient beings.",
        "source": "T11n0312_007:0719b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而佛如來無所發悟，亦無加行復無作意。",
        "translation": "The Tathāgata has no enlightenment, no applied practices, and no intention to do so.",
        "source": "T11n0312_007:0719b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等是名如來身密身業清淨。",
        "translation": "Such is called the Tathāgata's body, which is a dense body with pure activities.",
        "source": "T11n0312_007:0719b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「寂慧當知，今此皆是少略宣說如來身密身業業清淨，若廣說者，縱經一劫或過一劫，而亦不能得其邊際。」",
        "translation": "\"Silent Wisdom should know that this is only a brief explanation of the Tathāgata's close-knit body and purified physical actions, and if it were explained in detail, it wouldn't reach its limit even if it went on for an eon or more than an eon.\"",
        "source": "T11n0312_007:0719b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛手菩薩大祕密主說是如來身密不思議法時，會中有十千人發阿耨多羅三藐三菩提心，八千菩薩獲得忍法。",
        "translation": "When the Vajrapāṇi Bodhisattva, the Great Esoteric Master, explained this inconceivable teaching of the Tathāgata's mystical body, 10,000 people in the assembly aroused the mind of unsurpassed, correct enlightenment, and 8,000 bodhisattvas attained the Dharma of forbearance.",
        "source": "T11n0312_007:0719b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中有諸天人以諸妙花散於佛上，及供養金剛手菩薩大祕密主。",
        "translation": "At the time, gods and humans scattered marvelous flowers on top of the Buddha and made offerings to the Vajrapāṇi Bodhisattva, the Great Esoteric Master.",
        "source": "T11n0312_007:0719b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊舒右金色臂，置金剛手菩薩大祕密主頂上，作是讚言：「善哉善哉！",
        "translation": "The Bhagavān then extended his right golden arm and placed it on top of the Vajrapāṇi Bodhisattva's Great Esoteric Master, praising him, \"Good, good!",
        "source": "T11n0312_007:0719b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "祕密主！",
        "translation": "Master of Secrets!",
        "source": "T11n0312_007:0719b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝善宣說如來身密不思議法，我悉知之。",
        "translation": "You well explain the inconceivable dharma of the Tathāgata's body, and I know it all.",
        "source": "T11n0312_007:0719b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝所說法，我今隨喜。」",
        "translation": "I now rejoice in your explanation of the teaching.\"",
        "source": "T11n0312_007:0719b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來語密不思議品第八之一",
        "translation": "Tathāgata's Inconceivable Words, Eighth Chapter, One",
        "source": "T11n0312_007:0719b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，金剛手菩薩大祕密主告寂慧菩薩摩訶薩言：「復何名為如來語密語業清淨？",
        "translation": "Furthermore, the Vajrapāṇi Bodhisattva, the Great Esoteric Master, addressed the Bodhisattva Mahāsattva Silent Wisdom, saying, \"What else is called the purification of the Tathāgata's speech and esoteric actions?",
        "source": "T11n0312_007:0719b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂如來於晝夜中成證阿耨多羅三藐三菩提果，於晝夜中入大涅槃。",
        "translation": "It's called the Tathāgata realizing the fruit of unsurpassed, correct enlightenment in the middle of the day and night and entering great nirvāṇa in the middle of the day and night.",
        "source": "T11n0312_007:0719b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其中間，如來未嘗宣說一字，亦無詮表。",
        "translation": "Yet, in the interim, the Tathāgata never proclaims a single word, nor does he explain it.",
        "source": "T11n0312_007:0719b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0312_007:0719b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以佛如來常在三摩呬多故。",
        "translation": "\"It's because the Buddha-tathāgata is always in samākara.",
        "source": "T11n0312_007:0719b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦無出息入息、若尋若伺，以無尋伺故，所出語言離諸邪妄。",
        "translation": "The Tathāgata also has no exhaling or inhalation, no searching or inspection, and because there's no searching or inspection, the words that come out are free of error and delusion.",
        "source": "T11n0312_007:0719b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而佛世尊無尋無伺，無所分別無廣分別，無說無示復無詮表，然諸眾生亦聞如來有所宣說，而是如來畢竟在定。",
        "translation": "而佛世尊無尋無伺，無所分別無廣分別，無說無示復無詮表，然諸眾生亦聞如來有所宣說，而是如來畢竟在定。",
        "source": "T11n0312_007:0719b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切種及一切時，亦以文字而能詮表，復無所表。",
        "translation": "In all varieties and at all times, he also explains and represents them with words, and there's nothing to represent.",
        "source": "T11n0312_007:0719b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生因以文字生信重者，而彼眾生自謂如來為我說法，然佛如來心常安住無分別捨。",
        "translation": "If there are sentient beings who have faith and respect based on words, and they say the Tathāgata preaches for them, the Buddha Tathāgata's mind is always stable and free of discriminating equanimity.",
        "source": "T11n0312_007:0719c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Jiji-hui!",
        "source": "T11n0312_007:0719c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦非脣齒舌喉及其面門出諸音聲、有所聞聽，如來所出音聲從虛空出，但以眾生謂佛如來所有音聲從口門出。",
        "translation": "\"Nor does the Tathāgata make sounds with his lips, teeth, tongue, throat, and facial approach that are heard, for the sounds that the Tathāgata makes come out of space, but sentient beings say that the Tathāgata's sounds come from the mouth and approach.",
        "source": "T11n0312_007:0719c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧當知，如來語言具有六十四種殊妙之相。",
        "translation": "Stillness and wisdom should tell you that the Tathāgata's speech has sixty-four marvelous characteristics.",
        "source": "T11n0312_007:0719c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為六十四種？",
        "translation": "What are the sixty-four kinds?",
        "source": "T11n0312_007:0719c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者流澤，二者柔軟，三者悅意，四者可樂，五者清淨，六者離垢，七者明亮，八者甘美，九者樂聞，十者無劣，十一者圓具，十二者調順，十三者無澁，十四者無惡，十五者善柔，十六者悅耳，十七者適身，十八者心生勇銳，十九者心喜，二十者悅樂，二十一者無熱惱，二十二者如教令，二十三者善了知，二十四者分明，二十五者善愛，二十六者令生歡喜，二十七者使他如教令，二十八者令他善了知，二十九者如理，三十者利益，三十一者離重復過失，三十二者如獅子音聲，三十三者如龍音聲，三十四者如雲雷吼聲，三十五者如龍王聲，三十六者如緊那羅妙歌聲，三十七者如迦陵頻伽聲，三十八者如梵王聲，三十九者如共命鳥聲，四十者如帝釋美妙聲，四十一者如振鼓聲，四十二者不高，四十三者不下，四十四者隨入一切音聲，四十五者無缺減，四十六者無破壞，四十七者無染污，四十八者無希取，四十九者具足，五十者莊嚴，五十一者顯示，五十二者圓滿一切音聲，五十三者諸根適悅，五十四者無譏毀，五十五者無輕轉，五十六者無動搖，五十七者隨入一切眾會，五十八者諸相具足。",
        "translation": "一者流澤，二者柔軟，三者悅意，四者可樂，五者清淨，六者離垢，七者明亮，八者甘美，九者樂聞，十者無劣，十一者圓具，十二者調順，十三者無澁，十四者無惡，十五者善柔，十六者悅耳，十七者適身，十八者心生勇銳，十九者心喜，二十者悅樂，二十一者無熱惱，二十二者如教令，二十三者善了知，二十四者分明，二十五者善愛，二十六者令生歡喜，二十七者使他如教令，二十八者令他善了知，二十九者如理，三十者利益，三十一者離重復過失，三十二者如獅子音聲，三十三者如龍音聲，三十四者如雲雷吼聲，三十五者如龍王聲，三十六者如緊那羅妙歌聲，三十七者如迦陵頻伽聲，三十八者如梵王聲，三十九者如共命鳥聲，四十者如帝釋美妙聲，四十一者如振鼓聲，四十二者不高，四十三者不下，四十四者隨入一切音聲，四十五者無缺減，四十六者無破壞，四十七者無染污，四十八者無希取，四十九者具足，五十者莊嚴，五十一者顯示，五十二者圓滿一切音聲，五十三者諸根適悅，五十四者無譏毀，五十五者無輕轉，五十六者無動搖，五十七者隨入一切眾會，五十八者諸相具足。",
        "source": "T11n0312_007:0719c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Jiji-hui!",
        "source": "T11n0312_007:0720a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十九者，如來所出語言，普令十方一切世界一切眾生心意歡喜，佛亦不作是念：『我能宣說諸法。』",
        "translation": "59. When the Tathāgata speaks, he causes the minds of all sentient beings in all the worlds of the ten directions to rejoice, and the Buddha doesn't think, 'I can explain the teachings.'",
        "source": "T11n0312_007:0720a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂契經、應頌、記別、諷誦、自說、緣起、本事、本生、方廣、希法、論議、譬喻，又復祕密先行法、說本緣法、說昔因法，近說多說廣說，教示安立分位分別，解釋開明如來所說。",
        "translation": "They are sūtras, verses, assurances, recitations, recitations, self-explanations, dependent arising, abilities, births, directions, esoteric teachings, discussions, metaphors, furthermore, esoteric teachings that precede, explain original conditions, explain past causes, explain recent teachings, explain in detail, teach and establish positions, and explain and illuminate what the Tathāgata teaches.",
        "source": "T11n0312_007:0720a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等法，於彼一切大眾會中，若苾芻、苾芻尼、優婆塞、優婆夷眾會，若天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽等諸眾會，佛能各各隨其根性精進分量，如其所應為作法施。",
        "translation": "Thus, in all those assemblies, whether they're congregations of monks, monk's nuns, laymen, or laywomen, or congregations of gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, or mahoragas, the Buddha gives the Dharma according to the amount of effort required by their natures and as appropriate.",
        "source": "T11n0312_007:0720a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等眾會聞說法時，皆謂所說從佛如來口門而出。",
        "translation": "When those assemblies hear the teaching, they all say that what's being taught comes from the mouth of the Buddha-tathāgata.",
        "source": "T11n0312_007:0720a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然所說法亦無互相語言重復，而諸眾會各隨音聲曉了諸法。",
        "translation": "However, there's no repetition of each other's words in the teaching, and the assemblies each understand the teachings according to their sounds.",
        "source": "T11n0312_007:0720a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧！",
        "translation": "Silent wisdom!",
        "source": "T11n0312_007:0720a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即是名如來語密。",
        "translation": "This is called the mystery of the Tathāgata's words.",
        "source": "T11n0312_007:0720a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Silent Wisdom!",
        "source": "T11n0312_007:0720a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十者，一切眾生其數無量，一切眾生行亦無量，如來所說眾生心行略有八萬四千種類，但為根性下劣眾生，令其解入如來所說。",
        "translation": "Sixty, the number of all sentient beings is limitless, and the number of their conditioned activities is also limitless. The Tathāgata teaches that there are 84,000 types of mental functions of sentient beings, but it's only for the sake of sentient beings with inferior faculties to make them understand and enter what the Tathāgata teaches.",
        "source": "T11n0312_007:0720a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧當知，眾生心行無其分量。",
        "translation": "Stillness and wisdom should tell you that the mental condition of sentient beings has no limit.",
        "source": "T11n0312_007:0720a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有貪行眾生、瞋行眾生、癡行眾生、等分行眾生，彼彼眾生心行差別，若佛如來於一劫中或過一劫，乃至如來住世經百千劫，隨幾許壽量極壽分限，而亦不能說諸眾生心行邊際。",
        "translation": "For all the sentient beings in the world who act greedily, act angrily, act deludedly, or act equitably, there are differences in their mental functions, and even if the Buddha and Tathāgata were to remain in the world for a hundred thousand eons or even if the Tathāgata were to remain in the world for a hundred thousand eons, it wouldn't be possible to explain the limits of the mental functions of sentient beings according to a certain amount of life span and a very limited amount of life span.",
        "source": "T11n0312_007:0720a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛但說眾生心行無邊際者，而諸眾生不能解入返生癡迷，是故如來以善方便，於諸眾生無量行中，略說數有八萬四千。",
        "translation": "If the Buddha only explained that the mental functions of sentient beings are limitless, sentient beings wouldn't be able to understand and enter the delusion of going back to birth, so the Tathāgata uses good skill to explain briefly the 84,000 number of the measureless functions of sentient beings.",
        "source": "T11n0312_007:0720a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復如來所說諸法，隨諸眾生心行差別，如其所應皆令開覺。",
        "translation": "Furthermore, the Tathāgata teaches the Dharma according to the differences in mental functioning of sentient beings, and he causes them to awaken as he sees fit.",
        "source": "T11n0312_007:0720a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧！",
        "translation": "Silent wisdom!",
        "source": "T11n0312_007:0720a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即是名如來語密。",
        "translation": "This is called the mystery of the Tathāgata's words.",
        "source": "T11n0312_007:0720a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Silent Wisdom!",
        "source": "T11n0312_007:0720b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十一者，如來語祕密智，隨入一切眾生心意，然其語言不從如來口門中出，但從虛空而出。",
        "translation": "\"61. The Tathāgata's secret wisdom of speech enters the minds of all sentient beings, but his words don't come from the Tathāgata's mouth, they come out of space.",
        "source": "T11n0312_007:0720b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生謂佛如來所有語言從口門出者，彼勿起是見。",
        "translation": "If sentient beings say that all the words of a Buddha-tathāgata come from the mouth, they shouldn't give rise to that view.",
        "source": "T11n0312_007:0720b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0312_007:0720b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生，見佛語言從烏瑟膩沙相出，或從頂出，或髮際出，或從肩出，或從額出，或眉間出，或毫相中出，或從眼出，或從耳出，或從鼻出，或從頰出，或口門出，或從頸出，或從臂出，或從手出，或從指出，或兩脇出，或胸前出，或背後出，或從臍出，或陰藏出，或從眼出，或從膝出，或從腨出，或從踝出，或從足出，或從諸相好中出，或從一切毛孔中出，如是等眾生知解有異。",
        "translation": "If there are sentient beings who see the Buddha's speech coming from the form of Ursa Major, or from the top of the head, or from the hairline, or from the shoulders, or from the forehead, or from between the eyebrows, or from within the tuft of hair, or from the eyes, or from the ears, or from the nose, or from the cheeks, or from the mouth, or from the neck, or from the arms, or from the hands, or from the fingers, or from the front of the chest, or from the back, or from the navel, or from the storehouse, or from the eyes, or from the knees, or from the heart, or from the ankles, or from the feet, or from among the beautiful features, or from in all the pores, such sentient beings have different understandings.",
        "source": "T11n0312_007:0720b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧！",
        "translation": "Silent wisdom!",
        "source": "T11n0312_007:0720b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即是名如來語密。",
        "translation": "This is called the mystery of the Tathāgata's words.",
        "source": "T11n0312_007:0720b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Silent Wisdom!",
        "source": "T11n0312_007:0720b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十二者，如來所出語言，隨諸眾生種種信解、隨諸眾生心意成熟，普使隨應而得了知，然佛如來常住無分別捨。",
        "translation": "\"Sixty-two people, the Tathāgata produces words that are understood according to the various beliefs and understandings of sentient beings and according to the maturation of their minds, and they are universally adaptable, yet the Buddha-tathāgata always abides without discriminating equanimity.",
        "source": "T11n0312_007:0720b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間假法所成諸音樂器，隨彼所作而悉妙巧，手不觸近非假人力，微風吹動出美妙聲，其所出聲皆是先業差別風所吹擊。",
        "translation": "It's like musical instruments made from conventional dharmas in the world that are skillful in their construction, aren't artificial when touched by hand, and don't produce a beautiful sound when blown by a gentle breeze, because the sound they produce is caused by the blowing of a wind that distinguishes between prior actions.",
        "source": "T11n0312_007:0720b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來語言亦復如是，隨諸眾生一切意樂，智風吹擊，亦非如來勤力所出。",
        "translation": "Tathāgata speech is likewise, blown by the wind of wisdom according to the various desires of sentient beings, and it doesn't come from the Tathāgata's diligent effort.",
        "source": "T11n0312_007:0720b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來隨順一切眾生先業差別眾生境界，如應所說。",
        "translation": "The Tathāgata follows all sentient beings' prior karmic discriminations in their sentient realms as they should be described.",
        "source": "T11n0312_007:0720b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧！",
        "translation": "Silent wisdom!",
        "source": "T11n0312_007:0720b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如響聲隨有所表，其所出聲非內非外亦非中間。",
        "translation": "\"It's like a resonant sound that follows some expression, and the sound that comes out of it is neither internal nor external, and it's not in the middle.",
        "source": "T11n0312_007:0720b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來語言亦復如是，隨其所出但為表了眾生心意，而如來聲非內非外亦非中間。",
        "translation": "Tathāgata speech is likewise, following its emission only to express the thoughts of sentient beings, and the Tathāgata's voice is neither internal nor external nor intermediate.",
        "source": "T11n0312_007:0720b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如大海之中有如意珠寶，其名圓滿一切意樂，懸高幢上自然出聲。",
        "translation": "Also, suppose there's a wish-granting jewel in the ocean that's called the Perfection of All Wishes, and it hangs high on a banner and naturally produces sound.",
        "source": "T11n0312_007:0720b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂言此珠能滿一切眾生意樂，而是珠寶亦無分別。",
        "translation": "It's called a jewel that fills all of sentient beings' desires, but it's a jewel that makes no distinctions.",
        "source": "T11n0312_007:0720b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦復如是，語言妙寶深心清淨，懸置大悲幢上，隨諸眾生所有意樂，如來出妙語言悉令曉了，然佛如來常住無分別捨。",
        "translation": "The Tathāgata is likewise, a marvelous jewel of language that's profoundly pure in mind and suspended on a banner of great compassion, which causes the Tathāgata to produce marvelous speech that fully understands the intentions of sentient beings as they wish, even though the Buddha and Tathāgata always abide without discriminating equanimity.",
        "source": "T11n0312_007:0720b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂慧！",
        "translation": "Still, the Buddha Tathāgata always abides without discriminating equanimity.",
        "source": "T11n0312_007:0720c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即是名如來語密。",
        "translation": "This is called the mystery of the Tathāgata's words.",
        "source": "T11n0312_007:0720c02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次寂慧！",
        "translation": "\"Furthermore, Silent Wisdom!",
        "source": "T11n0312_007:0720c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十三者，諸佛如來所有音聲無其分量。",
        "translation": "\"Sixty-three people, the sounds of the buddha-tathāgatas have no measure.",
        "source": "T11n0312_007:0720c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不見有世間一切天人魔梵、沙門婆羅門等，能知如來音聲邊際及分量者。",
        "translation": "I don't see any gods, humans, Māra, Brahmā, ascetics, priests, or others in the world who can know the limits and the proportion of the Tathāgata's voice.",
        "source": "T11n0312_007:0720c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T11n0312_007:0720c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念一時佛在王舍大城鷲峯山中，諸菩薩眾而共圍繞，宣說音聲輪清淨法門，廣為眾生顯明宣示。",
        "translation": "I recall a time when the Buddha was in Vulture Peak in the great city of Rājagṛha, surrounded by a multitude of bodhisattvas, expounding the pure dharma-gate of the vocal wheel and explaining it clearly for sentient beings.",
        "source": "T11n0312_007:0720c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後一時，以慈氏菩薩摩訶薩加持力故，尊者大目乾連即作是念：『如來音聲淨輪分量，幾何遠邪？』",
        "translation": "At the latter time, because of the empowering power of the Bodhisattva Mahāsattva Maitreya, the Venerable Mahāmaudgalyāyana had this thought, 'How far away is the Tathāgata's pure wheel of sound?'",
        "source": "T11n0312_007:0720c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，乃於本座隱而不現，以自神力即往須彌山頂，聽佛如來音聲遠近。",
        "translation": "After he had this thought, he remained hidden from view at his seat and used his psychic powers to go to the top of Mount Sumeru and listen to the Tathāgata's voice from afar.",
        "source": "T11n0312_007:0720c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復運神力遍往三千大千世界，又過須彌山西，復過四大洲界，又過鐵圍山大鐵圍山，乃至世界邊際，還住鐵圍山頂，審聽如來音聲分量，是聲平等無所增減。",
        "translation": "Again, he used his psychic powers to travel throughout the 3,000 great thousand worlds, past Mount Sumeru West, past the four continental realms, past Mount Tie-Wei and Mount Tai-Tie-Wei, up to the limit of the world, and remained at the top of Mount Tie-Wei to examine the sound of the Tathāgata's voice and hear its equal weight, which has no increase or decrease.",
        "source": "T11n0312_007:0720c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時世尊知其事已，即作是念：『大目乾連意欲度量我之音聲所有分量，我於今時宜攝神力。』",
        "translation": "\"Knowing this, the Bhagavān then had this thought, 'Mahāmaudgalyāyana wants to measure the measure of my voice, so it's appropriate for me to gather my psychic powers now.'",
        "source": "T11n0312_007:0720c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于是世尊攝神通已，大目乾連承佛威神所加持故，以自通力於此世界西之方分過九十九殑伽沙數佛剎土已，往一世界名光明幢，彼有如來號光明王，現住說法教化眾生。",
        "translation": "After the Bhagavān had collected his supernormal powers, Mahāmaudgalyāyana, because of the Buddha's authoritative power and support, used his supernormal abilities to go to one of the worlds known as the banner of light, where there's a Tathāgata named King of Light who now lives to teach sentient beings.",
        "source": "T11n0312_007:0720c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時尊者大目乾連到彼土已，審聽世尊釋迦牟尼如來音聲分量，譬如十肘地方分中，此聞彼人所說音聲。",
        "translation": "After he arrived in that land, Venerable Mahāmaudgalyāyana examined the sound of the Bhagavān, the Tathāgata Mūlasarvâstivāda, and heard the sound of that person's voice, which was like ten cubits in length.",
        "source": "T11n0312_007:0720c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大目乾連在彼世界聽佛音聲亦復如是，其聲平等無所增減。",
        "translation": "Thus did Mahāmaudgalyāyana hear the Buddha's voice in that world, which was equal in sound and had no increase or decrease.",
        "source": "T11n0312_007:0720c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼光明王如來所有身量高百由旬，諸菩薩身高五十由旬。",
        "translation": "That Tathāgata, the King of Light, has a body that measures a hundred leagues tall, and the bodhisattvas have bodies that measure fifty leagues tall.",
        "source": "T11n0312_007:0720c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時大目乾連以自神力，於彼諸菩薩眾所用鉢中循環而行。",
        "translation": "With his own supernormal powers, the Mahāmaudgalyāyana then walked around in the bowls used by that crowd of bodhisattvas.",
        "source": "T11n0312_007:0720c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩見是相已極生輕笑，即白佛言：『世尊！",
        "translation": "When those bodhisattvas saw this, they laughed heartily and said to the Buddha, 'Bhagavān!",
        "source": "T11n0312_007:0720c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今云何有如沙門相小蟲，來此鉢中循行？』",
        "translation": "Now, why is there a tiny worm like a monk walking around in this bowl?'",
        "source": "T11n0312_007:0721a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛告言：『諸善男子！",
        "translation": "The Buddha told them, 'Good sons!",
        "source": "T11n0312_007:0721a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等不應生輕慢心。",
        "translation": "You shouldn't become despising.",
        "source": "T11n0312_007:0721a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0312_007:0721a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此鉢中行者，是彼世尊釋迦牟尼如來上首聲聞弟子，於大聲聞眾中神通第一。』",
        "translation": "'Now, this practitioner in the alms bowl is the Bhagavān, the Śākyamuni Tathāgata's foremost śrāvaka disciple, and he has the greatest supernormal powers among the śrāvakas.'",
        "source": "T11n0312_007:0721a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時尊者大目乾連前詣光明王如來所，頭面禮足，右繞七匝住立佛前。",
        "translation": "\"Venerable Mahāmaudgalyāyana then went to the Tathāgata Mahāprajñāpāramitā, bowed his head and feet, circled to his right seven times, and stood in front of the Buddha.",
        "source": "T11n0312_007:0721a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛告言：『尊者大目乾連！",
        "translation": "The Buddha told him, 'Venerable Mahāmaudgalyāyana!",
        "source": "T11n0312_007:0721a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩有所輕笑，汝今宜應承彼世尊釋迦牟尼如來、應供、正等正覺所加持故，以自通力現諸神變。』",
        "translation": "These bodhisattvas have something to despise, so now you should accept the support of the Bhagavān, Śākyamuni, the Tathāgata, the Worthy One, and the Perfectly Enlightened One, and perform miraculous changes with your own powers.'",
        "source": "T11n0312_007:0721a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者大目乾連白彼佛言：『我今如佛教勅，加趺而坐，於此寶洲作變化事。』",
        "translation": "Venerable Mahāmaudgalyāyana said to the Buddha, 'Now, as the Buddha has commanded, I'm sitting cross-legged here on this precious island and performing miraculous acts.'",
        "source": "T11n0312_007:0721a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：『今正是時。』",
        "translation": "The Buddha said, 'Now is the right time.'",
        "source": "T11n0312_007:0721a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者大目乾連即時勇身空中高七俱胝多羅樹量，作變化事。",
        "translation": "Venerable Mahāmaudgalyāyana then rose into the air, measuring seven corpuscles high as a palm tree, and performed the transformation deed.",
        "source": "T11n0312_007:0721a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其坐中化現百千俱胝那庾多真珠瓔珞廣大莊嚴，而彼瓔珞各出百千俱胝光明，一一光明門皆生蓮花。",
        "translation": "In his seat, he conjured up a hundred thousand corpuscular, nayuta-jeweled diadem in vast splendor, and from each of those diadems emanated a hundred thousand corpuscular lights, each of which produced lotus flowers.",
        "source": "T11n0312_007:0721a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸蓮花臺中皆有世尊釋迦牟尼如來形像安處其上，彼如來像皆悉宣說妙音聲輪清淨正法。",
        "translation": "On each of those lotus flower daises was an image of the Bhagavān, the Tathāgata Mūṇi, sitting on top of it, and that Tathāgata image was all proclaiming the pure and correct teaching of the wheel of wonderful sound.",
        "source": "T11n0312_007:0721a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大目乾連白彼佛言：『世尊！",
        "translation": "Mahāmaudgalyāyana said to that Buddha, 'Bhagavān!",
        "source": "T11n0312_007:0721a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今加趺而坐，於此四大洲一切世界亦能作諸神通變化，乃至此小千世界、中千世界、三千大千世界，悉能作諸神通變化。』",
        "translation": "Now, while sitting cross-legged, I'm also capable of performing miraculous transformations in all the worlds of these four continents, up to the small thousand worlds, the medium thousand worlds, and the 3,000 great thousand worlds.'",
        "source": "T11n0312_007:0721a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛告言：『今正是時。』",
        "translation": "The Buddha told them, 'Now is the right time.'",
        "source": "T11n0312_007:0721a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時尊者大目乾連如其所應現神變已，收攝神力還住佛前。",
        "translation": "\"After he had performed the miraculous transformation just as he was supposed to, the Venerable Mahāmaudgalyāyana gathered his spiritual powers and returned to stay in front of the Buddha.",
        "source": "T11n0312_007:0721a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸菩薩眾咸生希有之心，前白佛言：『世尊！",
        "translation": "That crowd of bodhisattvas then had a rare moment of hope and said to the Buddha, 'Bhagavān!",
        "source": "T11n0312_007:0721a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此尊者大目乾連，其何所為到此世界？』",
        "translation": "What brings this venerable Mahāmaudgalyāyana to this world?'",
        "source": "T11n0312_007:0721a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛告言：『諸善男子！",
        "translation": "The Buddha told them, 'Good sons!",
        "source": "T11n0312_007:0721a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此大目乾連為欲度量彼世尊釋迦牟尼如來聲輪分量，故來至此。』",
        "translation": "That Mahāmaudgalyāyana came here because he wanted to measure the sound-wheel apprehension of the Bhagavān, the Śākyamuni Tathāgata.'",
        "source": "T11n0312_007:0721a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼世尊光明王如來告尊者大目乾連言：『汝自今而往，勿復再起是心欲度如來聲輪分量。",
        "translation": "\"The Bhagavān, the King of Radiance Tathāgata, then addressed Venerable Mahāmaudgalyāyana, saying, 'Now, don't go there again with the intention of measuring the Tathāgata's portion of the vocal cord.",
        "source": "T11n0312_007:0721a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂以如來清淨音聲無其分量，不可度量故。",
        "translation": "That's because the Tathāgata's pure voice has no measure, and it's immeasurable.",
        "source": "T11n0312_007:0721b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使以汝威勢神力，極西方分，經于殑伽沙數等劫，畢竟不能得彼世尊釋迦牟尼如來音聲妙輪分量邊際，以佛如來音聲妙輪無分量故。』",
        "translation": "Even if you were to go through sands of eons with your authority and superknowledge, you wouldn't be able to reach the limit of the Bhagavān Śākyamuni's marvelous wheel of sound and voice because the Tathāgata's marvelous wheel of sound and voice has no measure.'",
        "source": "T11n0312_007:0721b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如來不思議祕密大乘經卷第七",
        "translation": "Foshuo rulai busiyi mimi dasheng jing, vol. 7",
        "source": "T11n0312_007:0721b07_0",
        "is_bad_quality": false
    }
]