[
    {
        "source_sentence": "佛說普門品經",
        "translation": "Foshuo pumen pin pin jing",
        "source": "T11n0315b_001:0777b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉竺法護譯",
        "translation": "Translated by Dharmarakṣa of the Western Jìn Dynasty",
        "source": "T11n0315b_001:0777b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛遊王舍城靈鷲山，與大比丘眾比丘八百，菩薩四萬二千——得諸總持，神通已達，聖智弘暢，辯才無礙，三昧已定，無所不博。",
        "translation": "Thus I heard: One time, the Buddha traveled to Mount Vulture in Rājagṛha with a large assembly of monks, 800 monks, and 42,000 bodhisattvas who had attained the dhāraṇī, had mastered supernormal powers, had a wide range of noble wisdom, had unimpeded eloquence, and had concentrated on samādhi, and had no limit to what they could do.",
        "source": "T11n0315b_001:0777b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有菩薩名離垢藏，與九萬二千菩薩，從普華如來國——其世界名淨行——遊詣忍界靈鷲山。",
        "translation": "At the time, a bodhisattva named Vimalagarbha and 92,000 other bodhisattvas traveled from the land of the Universal Flower Tathāgata, a world called Pure Conduct, to Vulture Peak in the Forbearance Realm.",
        "source": "T11n0315b_001:0777b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊遙見離垢藏菩薩與無數千大士眷屬圍遶遊步虛空，佛心念曰：「斯離垢藏，間別由路，遠步諸國，宣普華如來、至真、等正覺命，來受普門品，今當聚會諸菩薩眾。」",
        "translation": "When the Bhagavān saw the bodhisattva Vimalagarbha and his retinue of countless thousands of great personages wandering around in the sky, the Buddha thought to himself, \"This Vimalagarbha, who has traveled far and wide to various countries by separate paths, has declared that the Puhua Tathāgata, the Zhizhen, and the Equally Perfectly Enlightened One have been ordained to come to receive the Chapter of the Universal Gate, and now he will gather a multitude of bodhisattvas.\"",
        "source": "T11n0315b_001:0777b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時大聖即如其像，顯揚言教示現感應，令無央數無限世界諸菩薩眾尋時悉來，至斯忍土，詣靈鷲山。",
        "translation": "The great sage then, just as he was portrayed, revealed his teaching and showed his vision, causing a multitude of bodhisattvas from measureless and infinite worlds to come to this land of tolerance and head for Vulture Peak.",
        "source": "T11n0315b_001:0777b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行到佛所，稽首足下，却住一面。",
        "translation": "When they arrived at the Buddha's place, they bowed their heads at his feet and withdrew to one side.",
        "source": "T11n0315b_001:0777b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "靈鷲山中諸菩薩眾，閑居宴者，悉來集會，禮畢却坐。",
        "translation": "The congregation of bodhisattvas on Vulture Mountain who were staying for a leisurely meal came together, paid homage, and withdrew to sit down.",
        "source": "T11n0315b_001:0777b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離垢藏菩薩，應時化作七寶蓮華，其葉有千，持詣能仁如來、至真、等正覺，稽首奉上。",
        "translation": "In response, the Vimalagarbha Bodhisattva transformed into a seven-jewel lotus with a thousand petals that he carried to the Tathāgata, the Supreme Truth, and the Completely Awakened One, prostrating himself and presenting it to them.",
        "source": "T11n0315b_001:0777b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "啟曰：「普華如來、至真、等正覺，淨行世界聖尊，敬問無量：『遊步康強，力勢輕履，起居安隱，多所救濟。』",
        "translation": "He revealed, \"The Samantabhadra, the Tathāgata, the Supreme Truth, and the Perfect Enlightenment, the noble one in the Pure Land, respectfully asks, 'Are you strong in your travels, light in your strengths and abilities, tranquil in your rising and setting, and helpful?'",
        "source": "T11n0315b_001:0777b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今見遣來，宣承敬詣，啟受普門不可思議清淨之品，為開士說。」",
        "translation": "Now, when I see him sent, I'll proclaim my respectful visit, reveal the unfathomably pure Chapter of the Universal Gate, and explain it to the Kaiji.\"",
        "source": "T11n0315b_001:0777c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時離垢藏菩薩大士問訊，問訊畢退，在虛空結跏趺坐，與諸開士坐寶蓮華。",
        "translation": "The Bodhisattva Licchaviṃśa then exchanged greetings with him, retired after his greetings, and sat cross-legged in the sky with the Kairos sitting on a jeweled lotus.",
        "source": "T11n0315b_001:0777c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時溥首童真於會中起，更整衣服，偏袒右肩，長跪叉手，而白佛言：「善哉，世尊！",
        "translation": "Pauṣṭhila then rose from the assembly, adjusted his robes, bared his right shoulder, knelt down long with his palms together, and said to the Buddha, \"Good, Bhagavān!",
        "source": "T11n0315b_001:0777c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願說普門不可思議道品法源，為諸菩薩分別演之！",
        "translation": "May I explain the unfathomable source of the universal path and explain it separately for the bodhisattvas!",
        "source": "T11n0315b_001:0777c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憶念往古過去久遠世時，從普門如來、至真、等正覺，聞斯經典，興立八十四萬百千億垓三昧，久逮七十七億百千諸垓總持門行。",
        "translation": "憶念往古過去久遠世時，從普門如來、至真、等正覺，聞斯經典，興立八十四萬百千億垓三昧，久逮七十七億百千諸垓總持門行。",
        "source": "T11n0315b_001:0777c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願，世尊！",
        "translation": "Long may it be, Bhagavān!",
        "source": "T11n0315b_001:0777c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愍諸菩薩，重宣揚之。」",
        "translation": "Pitying the bodhisattvas, I'll again proclaim it.\"",
        "source": "T11n0315b_001:0777c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告溥首童真：「諦聽！",
        "translation": "The Buddha told Puṣpadantī, \"Listen closely!",
        "source": "T11n0315b_001:0777c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！」",
        "translation": "Consider it well!\"",
        "source": "T11n0315b_001:0777c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「唯然，世尊！",
        "translation": "They replied, \"Yes, Bhagavān!",
        "source": "T11n0315b_001:0777c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T11n0315b_001:0777c14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溥首與諸菩薩受教而聽。",
        "translation": "Puṣpa and the other bodhisattvas accepted the teaching and listened.",
        "source": "T11n0315b_001:0777c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告溥首：「若有菩薩，欲學普門所入之法等意分別，遊入於色等意分別，遊入音聲等意分別，遊入臭香等意分別，遊入眾味等意分別，遊入細滑等意分別，遊入心性等意分別，遊入女人等意分別，遊入男子等意分別，遊入童女等意分別，遊入童子等意分別，遊入諸天等意分別，遊入諸龍等意分別，遊入鬼神等意分別，遊揵沓和等意分別，遊阿須倫等意分別，遊迦樓羅等意分別，遊真陀羅等意分別，遊摩休勒等意分別，遊入地獄等意分別，遊入餓鬼等意分別，遊入畜生等意分別，遊入貪婬等意分別，遊入瞋怒等意分別，遊入愚癡等意分別，遊諸不善等意分別，遊諸德本等意分別，遊諸有為等意分別，遊諸無為等意分別。",
        "translation": "佛告溥首：「若有菩薩，欲學普門所入之法等意分別，遊入於色等意分別，遊入音聲等意分別，遊入臭香等意分別，遊入眾味等意分別，遊入細滑等意分別，遊入心性等意分別，遊入女人等意分別，遊入男子等意分別，遊入童女等意分別，遊入童子等意分別，遊入諸天等意分別，遊入諸龍等意分別，遊入鬼神等意分別，遊揵沓和等意分別，遊阿須倫等意分別，遊迦樓羅等意分別，遊真陀羅等意分別，遊摩休勒等意分別，遊入地獄等意分別，遊入餓鬼等意分別，遊入畜生等意分別，遊入貪婬等意分別，遊入瞋怒等意分別，遊入愚癡等意分別，遊諸不善等意分別，遊諸德本等意分別，遊諸有為等意分別，遊諸無為等意分別。",
        "source": "T11n0315b_001:0777c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溥首！",
        "translation": "Puṣpa!",
        "source": "T11n0315b_001:0778a01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸開士所可周遊，一切悉備，遊居平等，具足至道，是為學入普門定法。」",
        "translation": "All the ways in which enlightened people can travel are fully available, and their travels and abodes are equal and complete in the ultimate way, which is the method of training and entering the universal gate of concentration.\"",
        "source": "T11n0315b_001:0778a01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告溥首童真：「何謂菩薩等意分別遊入於色？",
        "translation": "The Buddha told Puṣya Boyzin, \"What is meant by a bodhisattva's mind discriminatingly wandering into form?",
        "source": "T11n0315b_001:0778a03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了解色，如水之沫而不可得，不可護持，無有堅固，則為等意觀無有色；是謂菩薩等遊於色。」",
        "translation": "When they understand that form is like foam in water that's unobtainable, unguardable, and unstable, then they are mindfully observing the absence of form; this is called a bodhisattva's mind wandering equally into form.\"",
        "source": "T11n0315b_001:0778a04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入音聲？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's equal mind discerning that he's wandering into sound?",
        "source": "T11n0315b_001:0778a06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人呼聲，而有響應，尋即消滅，則無形像不知所生。",
        "translation": "Like a person calling out a sound and having it echo, which immediately disappears upon examination, they have no form and don't know what's produced.",
        "source": "T11n0315b_001:0778a07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切無有若干之事，而無差特，亦無有相，已了無相，人所言者虛無無實，已曉諸音，深山響報，則乃等觀；是為等觀遊入諸音聲。」",
        "translation": "There are not a number of things that don't differ, don't have characteristics, have been comprehended as formless and insubstantial, and have become acquainted with sounds and the echoes of deep mountains, which are then equally observed; this is equally observed as wandering into sounds.\"",
        "source": "T11n0315b_001:0778a08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入臭香？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's equal discernment of wandering into smelly odors?",
        "source": "T11n0315b_001:0778a11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "周遊往返百億劫數，鼻之所嗅而無有厭，如大海淵無有充滿，其香之像而不可獲，為虛偽法無有真諦，設求審誠無合會處，斯無所有而不可持。",
        "translation": "They travel around for ten billion eons, never tire of what their nose smells, like an ocean that's unfilled and whose fragrant images are unobtainable, because they're false and have no true truth, and if they seek to examine them honestly, there's no place for them to meet, so they lack substance and can't be held.",
        "source": "T11n0315b_001:0778a12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻處無實，慌惚若空，如幻士化，假使分明，則為等觀遊入嗅香。」",
        "translation": "The olfactory field is insubstantial, confused, and empty, like an illusion or a transformation, so even if it were clearly distinguished, it would be like contemplating wandering into and smelling an odor.\"",
        "source": "T11n0315b_001:0778a16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入眾味？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's equal discernment of wandering into various flavors?",
        "source": "T11n0315b_001:0778a17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於喉咽，不知醎味，亦無不味，從因緣別，其舌所甘，猶緣會合，曉覺無念，則為等觀遊入眾味。」",
        "translation": "As for the throat, it doesn't know what's pleasant or unpleasant, and it's distinguished by cause and condition from what's sweet to the tongue as if it were a conjunction of causes and conditions, and when it's aware and nonconceptual, it's equal in contemplation and travels into many flavors.\"",
        "source": "T11n0315b_001:0778a18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入細滑？",
        "translation": "Puṣpa also told him, \"What does it mean for a bodhisattva to wander into the subtle and smooth with equal discernment?",
        "source": "T11n0315b_001:0778a21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其細滑者，志有所存，緣求服之，其柔軟者而不可得。",
        "translation": "Its fine and smooth [Gog*ang] [Gog*kō] has a purpose, and the condition is to seek to subdue it, but its softness is unobtainable.",
        "source": "T11n0315b_001:0778a22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已覩斯緣，細滑[革*卬][革*亢]無所適住，計于細滑，則無有成，亦無所有所依。",
        "translation": "Having seen this condition, the fine and smooth [gey*ang][gey*kong] has no place to stay, and when it's considered fine and smooth, it has nothing to become and nothing to rely on.",
        "source": "T11n0315b_001:0778a23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因著被服乃有所倚，斯為等觀遊入細滑。」",
        "translation": "When there's something to lean on because of being clothed, this is called contemplating swimming into the subtle and slippery.\"",
        "source": "T11n0315b_001:0778a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入心法？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's mind wandering into mental factors with equal discernment?",
        "source": "T11n0315b_001:0778a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假三界人悉令集會，立在一處，使求執心，莫知所在。",
        "translation": "Suppose all people in the three realms were to assemble and stand in one place, causing the mind that seeks to attach to them not to know where they are.",
        "source": "T11n0315b_001:0778a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見形像，亦無猶豫，亦無合散，不知所住，現若干色，於內無處，處無所住，如幻士化，虛而不實，則為等觀遊入心法。」",
        "translation": "When they don't see an image, don't hesitate, don't come together or scatter, don't know where they live, and appear in various forms, there's no place inside, and nowhere to live, like an illusion or transformation, which is empty but not real, that's called equal observation of the method of wandering into the mind.\"",
        "source": "T11n0315b_001:0778a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入女人？",
        "translation": "Puṣpa also told him, \"What does it mean for a bodhisattva to wander into a woman with equal discernment?",
        "source": "T11n0315b_001:0778b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "察于四大，則無女人，識癡惑者，迷於愛欲，荒于虛無。",
        "translation": "\"Examining the four elements, there's no woman, and those deluded by consciousness are confused by craving and abandoned to nothingness.",
        "source": "T11n0315b_001:0778b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "計女人者，猶如幻士化現女像，因彼所行，從其所樂，女人如幻，起色欲意。",
        "translation": "They conceive of women as being like an illusionist who creates a female figure, and because of what they do and follow their pleasures, women are illusory and give rise to thoughts of form and desire.",
        "source": "T11n0315b_001:0778b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼無有女，癡者惑之。",
        "translation": "They don't have women, but delusions arise from delusion.",
        "source": "T11n0315b_001:0778b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能別如斯，諸女無相，解脫平等，而現女色，則為等觀遊入女人。」",
        "translation": "To be able to distinguish between such things, women who have no characteristics and whose liberation is equal and who appear as women, is to contemplate women equally and wander into them.\"",
        "source": "T11n0315b_001:0778b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入男子？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's equal discernment of wandering into a man?",
        "source": "T11n0315b_001:0778b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如令男子等自發意，吾為雄夫，興念斯為女人，欲心無色，無實可獲，不見女像，等惟諸色，發起女想。",
        "translation": "\"Suppose a man generates his own thought, 'I'm a man, and I think, 'This is a woman,' and his desire mind has no form, and there's nothing real to be gained from it, so he doesn't see a woman's image but rather form, which gives rise to thoughts of a woman.",
        "source": "T11n0315b_001:0778b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所思想，斯男斯女，等如野馬、水月，則無男女。",
        "translation": "Suppose that this thought, 'This man and this woman are like wild horses and the moon in the water,' and then there's no man or woman.",
        "source": "T11n0315b_001:0778b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了男無形，虛偽而立，已能平等，則能現女，則為等觀遊入男子。」",
        "translation": "Once they understand that men have no form and are established falsely, and that they're equal, then they can show women, which is equal to observing and wandering into men.\"",
        "source": "T11n0315b_001:0778b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入童男？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's equal intention to discern the wandering of a boy into a boy?",
        "source": "T11n0315b_001:0778b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如樹木，設無有芽則無根莖，設無根莖則無華實，設無女人則無童子。",
        "translation": "Suppose there's a tree, and if there are no sprouts, then there's no rootstock, and if there are no rootstocks, then there's no flowers, and if there's no woman, then there's no child.",
        "source": "T11n0315b_001:0778b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣號童子，想於無知，覺女無生，不有子性，解一切無，則為等觀遊入童子。」",
        "translation": "When a child is called a boy for that reason, he conceives of nescience, realizes that a woman is unborn and doesn't have the nature of a child, and understands that all are nonexistent, then he's a boy who wanders into the world with equal contemplation.\"",
        "source": "T11n0315b_001:0778b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入童女？",
        "translation": "Puṣpa also told him, \"What does it mean for a bodhisattva to wander into a young woman with equal intention?",
        "source": "T11n0315b_001:0778b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼拔樹，根終不生，其明智者不於求果，醜達別誼，曉發一切勇猛無想，枯竭眾流，斯為童女。",
        "translation": "Like that tree that uprooted itself and whose roots never grow, that wise person doesn't seek fruit, doesn't ugly understand different meanings, and discerns all courageous and thoughtless things that dry up the streams, and then they're a young woman.",
        "source": "T11n0315b_001:0778b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了女如此，所現平等，則為等觀遊入童女。」",
        "translation": "Knowing that a woman is thus equal in what she shows, she's a young woman who wanders into the world with equal contemplation.\"",
        "source": "T11n0315b_001:0778b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入諸天？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's equal-minded discernment of wandering into the heavens?",
        "source": "T11n0315b_001:0778b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天嚴淨，功德自然，其意鮮潔，宮殿綺飾，無造立者，心樹妙華，無下種者，福苶幻化，生無思議，淨光流離滅度淨，了天虛偽成立慌惚，勝說平等現諸天像，是為菩薩遊入諸天。」",
        "translation": "The gods are adorned and purified, their attributes are natural, their intentions are pure, their palaces are ornamented, there's no one who builds them, their minds are decorated with marvelous flowers, there are no under-seeds, their fortune is illusory and transformative, their births are inconceivable, their pure light flows off, their cessation is purified, their falsehoods are established in a trance, and their images are superior to the explanations that make them appear equally, which is the intention of the bodhisattvas to travel into the gods.\"",
        "source": "T11n0315b_001:0778b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何為菩薩等意分別遊入諸龍？",
        "translation": "Again, he told Puṣya, \"What is the bodhisattva's intention to wander into the dragons?",
        "source": "T11n0315b_001:0778b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見無求生，興雲七日，雨所霑潤，不在內外，遍閻浮提漸歸大海，所滿水所由來，眾生如是學若干緣，現種種罪福，自然眾生無所有，愚冥之人以虛為實，覩龍平等，是為菩薩等遊諸龍。」",
        "translation": "Seeing unsought-for sentient beings, rising clouds for seven days, being wet by rain that isn't internal or external, pervading Jambudvīpa and gradually returning to the ocean, and where the water that fills it comes from, sentient beings thus train in certain conditions, manifesting various kinds of sins and merits, and naturally sentient beings lacking possessions, and foolish people who mistake the unreal for the real and see dragons as equal are bodhisattvas and so forth who wander into the dragons.\"",
        "source": "T11n0315b_001:0778b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入鬼神？",
        "translation": "Puṣpa also told him, \"What do you mean by bodhisattvas and others having the intention to discern wandering into ghosts and spirits?",
        "source": "T11n0315b_001:0778c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心如門開，與色有像，其身高大，心為一類。",
        "translation": "The mind is like a door that opens, and it has an image of form that's tall and large, and the mind is the same type.",
        "source": "T11n0315b_001:0778c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心不可畏難，因會有恐懼，見法無有實，眾想不可議，無實為空，說平等寂，而現鬼像，是為菩薩等遊鬼神。」",
        "translation": "A mind that isn't intimidated and has fear as a result of association, sees that dharmas lack substance, has inconceivable ideas, is empty of substance, explains that equality is quiescent, and produces images of ghosts, is called a bodhisattva equal in number who wanders into the company of ghosts and spirits.\"",
        "source": "T11n0315b_001:0778c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入揵沓和？",
        "translation": "Puṣpa also told him, \"What is meant by bodhisattvas and others wandering into gandharvas with discriminated intent?",
        "source": "T11n0315b_001:0778c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其法無往，而音說往，曉無往來，等說揵沓和，是為菩薩等觀遊入揵沓和。」",
        "translation": "When the teaching has no going, the sound explains going, the understanding has no going or coming, and it's equally explained as gandharva, this is called a bodhisattva's equal contemplation wandering into gandharva.\"",
        "source": "T11n0315b_001:0778c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入阿須倫？",
        "translation": "He also told Puṣpa: \"What does it mean for bodhisattvas to wander into asura with discernment?",
        "source": "T11n0315b_001:0778c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以事因，阿須倫心等，無起、無滅、無生，而現平等，是為菩薩等觀遊入於阿須倫。」",
        "translation": "Not using phenomenal causes, such as the mind of asurêndra, which has no arising, no cessation, and no production and yet appears equal, is when bodhisattvas and others contemplate wandering into asurêndra.\"",
        "source": "T11n0315b_001:0778c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入迦留羅？",
        "translation": "Puṣpa also told him, \"What is meant by a bodhisattva's mind wandering into garuḍa with discrimination?",
        "source": "T11n0315b_001:0778c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造受無受，立辭名號，設無名色等觀迦留羅，是為菩薩遊入迦留羅。」",
        "translation": "To create feelings and no feelings, to assign names, and to contemplate a kaludala without names and forms is a bodhisattva wandering into a kaludala.\"",
        "source": "T11n0315b_001:0778c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入真陀羅？",
        "translation": "He also told Puṣpa: \"What do you mean by a bodhisattva's mind discriminatingly wandering into a true kaludra?",
        "source": "T11n0315b_001:0778c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法無作而作，則立真陀羅，分別無所生，平等真陀羅，是為菩薩等觀遊入於真陀羅。」",
        "translation": "When a thing is created without being created, it establishes the true dhāraṇī, discriminates nothing that is produced, and is the true dhāraṇī of equality, which is when bodhisattvas and others contemplate wandering into the true dhāraṇī.\"",
        "source": "T11n0315b_001:0778c18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入摩休勒？",
        "translation": "Puṣpa also told him, \"What does it mean for bodhisattvas to wander into the mahoraga with discernment?",
        "source": "T11n0315b_001:0778c20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其法所名，立若干人法，無有所相，為虛分別，諸想無想，自然說平等音現摩休勒，是為菩薩等觀遊入於摩休勒。」",
        "translation": "The name given to this teaching establishes certain human dharmas that have no characteristics and are false discriminations, ideas, and non-ideas that naturally explain the manifestation of the sound of equality as mahoraga, which is when bodhisattvas and others contemplate wandering into mahoraga.\"",
        "source": "T11n0315b_001:0778c21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入地獄？",
        "translation": "Puṣpa also told him, \"What do you mean by bodhisattvas and others mindfully discerning wandering into hell?",
        "source": "T11n0315b_001:0778c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄無主，空無造者，從己想，想無興，所有地獄清淨鮮潔無垢，智覺如幻，本無所有無相，無相無所有，別如虛空，平等寂然而現地獄，是為菩薩等遊地獄。」",
        "translation": "Hell has no owner, is empty of creators, is based on one's own conceptions, conceptions are unarisen, all hells are pure, clean, and undefiled, and cognition and awareness are illusory; originally, they lack existence and form; lacking form and form, they lack existence; being distinct like space; and appearing equally and calmly in hell is called a bodhisattva's journey to hell.\"",
        "source": "T11n0315b_001:0778c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入餓鬼？",
        "translation": "Puṣpa also told him, \"What do you mean by bodhisattvas and others having the intention to discriminate and travel into the hells of hungry ghosts?",
        "source": "T11n0315b_001:0778c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼無形、無名，本無處所，因慳致之，慳無所住，不解所有，計吾我人，知悉無本，了無餓鬼，是為菩薩等遊餓鬼。」",
        "translation": "A hungry ghost has no form and no name, has no place in the past, is caused by stinginess, has no place to live in stinginess, doesn't understand what exists, and considers us humans who know nothing about the origin and understand that there are no hungry ghosts, which are bodhisattvas and so forth who wander into the hungry ghosts.\"",
        "source": "T11n0315b_001:0778c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入畜生？",
        "translation": "Puṣpa also told him, \"What is meant by bodhisattvas and others having the intention to discriminate and wander into animals?",
        "source": "T11n0315b_001:0779a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如雲霧像，現若干色，彼則無貌，悉無所有，心思虛無，等如陰霧，種種色像，畜生志性，罪福如幻，迷惑虛妄而說畜形，等說寂聲，是為菩薩等遊畜生。」",
        "translation": "Like clouds and mist images that appear in various forms, they have no appearance, are completely nonexistent, are void of mental thought, are like clouds and mist, have various forms and images, have the aspirations of animals, have sins and merits that are illusory, are deluded and false, and are described as having the form of an animal and are described as having silent sounds, this is called a bodhisattva who travels around to animals.\"",
        "source": "T11n0315b_001:0779a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入貪婬？",
        "translation": "Puṣpa also told him, \"What's the meaning of bodhisattvas and others discriminating their thoughts and wandering into desire and lust?",
        "source": "T11n0315b_001:0779a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲從想起，所想無有、無實、無像、無貌、無住，處不可得，貪婬如空，愚癡顛倒思想塵勞，法無塵垢，欲虛如空，至於十方求不可見，貪婬無形，愚冥貪懼，不得安隱，無難懷懼。",
        "translation": "When they think of desire, they conceive of things as nonexistent, insubstantial, unimagined, unappearing, and unstaying; they are unable to find a place; they crave sex as empty; they are foolish and mistaken in their thoughts and labors; the Dharma is without dust; their desires are empty as space; they seek invisibility in the ten directions; they crave sex without form; they are foolish and greedy; they can't be at ease; and they have no difficulty or fear.",
        "source": "T11n0315b_001:0779a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如丈夫無獲懷懼，怖捨馳走，得無見空，一切皆空。",
        "translation": "Like a husband who has nothing to fear, fears abandonment, and runs away, he attains nothing, sees emptiness, and everything is empty.",
        "source": "T11n0315b_001:0779a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼無解脫，愚癡顛倒，反造逆想，闇冥不解，法如虛空，去來今佛，解諸貪欲，貪欲無脫，愛想悉空，其譏貪婬，則求脫欲，斯皆無本，本自然淨。",
        "translation": "They lack liberation, are foolish and confused, and create counterproductive thoughts, are dark and don't understand, and the Dharma is like space. The past, future, and present Buddhas have understood desires and cravings, and desires are not liberated; desires and thoughts of love are all empty; they criticize craving and seek to be liberated from desires, which have no basis and are naturally purified.",
        "source": "T11n0315b_001:0779a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見佛道場，平等無想，覩眾如者，彼慕離欲，所想虛危，乃離諸想，如所發念，僥脫貪婬，謂當度欲。",
        "translation": "Those who see the Buddha's enlightenment site as equal and without conceptions and those who see multitudes as they are long for freedom from desire and whose conceptions are empty and dangerous then become free of conceptions and, according to the thoughts that arise, are lucky to be free of desire and lust, which is to say that they will be freed from desire.",
        "source": "T11n0315b_001:0779a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "想無所求，不壞本際，貪欲無思，本淨如斯，則不想脫。",
        "translation": "When conceptions lack expectation and don't destroy their original state, desire lacks thought and is originally pure like this, then they don't want to be freed from them.",
        "source": "T11n0315b_001:0779a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假令度欲，則謂為淨，貪欲空無，計此無二，愚冥相二，行者深觀如幻，是則失句。",
        "translation": "Suppose someone wants to be saved, which is called pure, and desires are empty and nonexistent, and they're conceived as nondual, foolish and insubstantial, and the practitioner deeply observes them as illusory, which is a mistake.",
        "source": "T11n0315b_001:0779a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發諸想念，貪欲無起，假號愛欲，無染著名，諸名無礙，知欲無得，覩真究空，不懷貪欲，不知見脫，貪欲佛法等如泥洹，解貪欲陰，等離吾我，知貪欲寂，等御憺怕，平等欲陰，見如幻化，是為菩薩等遊貪婬。」",
        "translation": "To give rise to longing, desire for covetousness that arises from nothing, to love desire under false names, to be undefiled and well-known, to be unimpeded by names, to know that desire is unobtainable, to see true and investigated emptiness, not to harbor desire, not to know liberation, to desire the Buddha-dharma as nirvāṇa, to understand the aggregate of desire, to be equally free of self, to know that desire for cessation is tranquil, to be equally disciplined, to be equal in the aggregate of desire, and to see it as illusory is to be a bodhisattva who travels equally in desire and lust.\"",
        "source": "T11n0315b_001:0779a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入瞋恚？",
        "translation": "Puṣpa also told him, \"What is meant by a bodhisattva's mind wandering into anger?",
        "source": "T11n0315b_001:0779a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恚從對起，因緣生對，無我號我，立無量事。",
        "translation": "\"When anger arises from opposition, opposition arises from causes and conditions, and the absence of a self is called self, which creates measureless situations.",
        "source": "T11n0315b_001:0779a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如樹木生，結恨急毒，聲自然空，無想無有。",
        "translation": "Like a tree that gives rise to a hatred that's intense and venomous, the sound is naturally empty, without thought or existence.",
        "source": "T11n0315b_001:0779a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如閑居樹，相揩火然，因緣離散，火滅不現，虛無起身，麁聲亦爾。",
        "translation": "Like a tree living in seclusion that's set on fire, when the cause and condition are removed, the fire goes out and doesn't appear, and nothing arises from the body, so does the debilitating sound.",
        "source": "T11n0315b_001:0779b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因欲稱量，則不興恚。",
        "translation": "When someone desires to measure it, they don't become angry.",
        "source": "T11n0315b_001:0779b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不從聲起，不虛內身，亦不外來。",
        "translation": "It doesn't arise from sound, isn't a false internal body, and doesn't come from outside.",
        "source": "T11n0315b_001:0779b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所由因空，從他緣起，因對而立，各各分別，則無瞋恚。",
        "translation": "When the cause is empty, arises from other conditions, is established by opposition, and is discriminated from each, there's no anger.",
        "source": "T11n0315b_001:0779b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如風種過，有恨為慢，若知方便，因想立緣。",
        "translation": "As the wind grows faulty, hatred is conceited, and if one knows how to do it, the cause is perceived and the condition is established.",
        "source": "T11n0315b_001:0779b05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "穢聲如是，恚因空生，恚還自燒，而危其身，別瞋怒想，竟無形像，平等察聲，聽瞋怒音，恨本際等，無本無持，分別法界，則覩平等，是為菩薩等遊瞋怒。」",
        "translation": "Thus, defiled sound is like this: when anger arises from emptiness and returns to burn itself out, it endangers its body, discriminates anger as an idea, completely lacks form, examines sounds equally, listens to anger sounds, hates the original extent and so forth, has no origin and no support, discerns the Dharma realm, and sees equality, which is considered equal for bodhisattvas and others who wander about in anger.\"",
        "source": "T11n0315b_001:0779b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入愚癡？",
        "translation": "Puṣpa also told him, \"What is meant by bodhisattvas who wander into folly by discriminating their thoughts?",
        "source": "T11n0315b_001:0779b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚從無起，察癡無有，設無所有，狂無狂冥，人無蔽願無礙，求空方面，造愚為虛。",
        "translation": "Folly arises from nothing, perceives delusion as nonexistence, assumes nothing, goes crazy without being crazy, has no obstruction in human beings' seclusion or vows, and seeks aspects of emptiness, creating folly as nothing.",
        "source": "T11n0315b_001:0779b10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡人所行最行難獲，諸法無明，因想為塵。",
        "translation": "What a foolish man does is most difficult to attain, and ignorance of the qualities causes perception to become dust.",
        "source": "T11n0315b_001:0779b12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如丈夫欲度虛空，億劫不得，知空本末，愚亦如是。",
        "translation": "Like a man who wants to cross into space but isn't able to for a billion eons, he knows the beginning and end of space, and so does a fool.",
        "source": "T11n0315b_001:0779b13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本際無愚議，蔽冥不生塵，無所成滿，如度虛空不知方面，亦無具足，無能步度，如百千劫，習樂闇蔽，彼無厭足，不以飽滿。",
        "translation": "Without foolish conceptions of the beginning, it's obscured by dust that doesn't arise, and nothing is accomplished, just as when you cross the void and don't know its aspects, and you don't have enough, so you can't step over it, like a hundred thousand eons when habits and pleasures are darkened, and you don't tire of them, so you don't fill them up.",
        "source": "T11n0315b_001:0779b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如童子吹氣滿胞，旋解口，察無所有。",
        "translation": "It's like a child who blows air to fill his cell, then turns his mouth inside out and discerns that there's nothing there.",
        "source": "T11n0315b_001:0779b17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪福如空胞，而習於愚，求不可得，懷來欲謂愚無底，斷根無形，無根無住，故不可盡。",
        "translation": "Sins and merits are like empty cells, but they're accustomed to foolishness, and their pursuit is unobtainable; the mind wants to say that foolishness has no bottom, that it has no form when its faculties are severed, and that it has no abiding when its faculties are absent, so it's inexhaustible.",
        "source": "T11n0315b_001:0779b18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設愚難盡，斯不可得，猶是眾生，如幻不賜。",
        "translation": "If it's difficult to end foolishness, then it's unobtainable, just like sentient beings who are illusory and don't give birth.",
        "source": "T11n0315b_001:0779b20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有造喻，三界生類，日度一切，令得泥洹。",
        "translation": "Suppose there's a metaphor created to describe the three realms as a species of birth, and each day they're all saved and made to attain nirvāṇa.",
        "source": "T11n0315b_001:0779b21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛壽住世億劫難計，濟脫黎庶，人不可盡。",
        "translation": "It's difficult to calculate the billions of eons that a Buddha's life span will last, and it's impossible to exhaust the number of people who are liberated.",
        "source": "T11n0315b_001:0779b22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因愚立種，人界無想，癡冥如幻，是不可得。",
        "translation": "Because of the seeds of folly, the human realm is devoid of perception, and delusion is illusory; it's unobtainable.",
        "source": "T11n0315b_001:0779b23_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與愚等，觀斯無二，設能等觀，則能念道，癡慧一等，無諸蔽礙，眾生群萌，等無愚議，癡不可計，思念意跡，其心無念，無有邊際，愚冥無限，由是叵得。",
        "translation": "When the Buddha and foolish people contemplate this, they're not two, and if they can contemplate it equally, then they'll be able to mind the path, have delusion and wisdom of the same order, and have no obstructions; the masses of sentient beings are equally without delusion, and delusion is incalculable; their minds are without thought, and there's no limit to their delusion; thus, it's impossible to attain.",
        "source": "T11n0315b_001:0779b24_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "志性無明，何從有起，癡已不起，闇冥何類？",
        "translation": "How could there be an arising of ignorance of the will-nature, and after delusion has ceased, what kind of darkness is there?",
        "source": "T11n0315b_001:0779b28_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如癡無處，佛道亦爾，了無涯底，諸法無二。",
        "translation": "As there's no place for delusion, so is the Buddha Way, which has no limit and no duality among dharmas.",
        "source": "T11n0315b_001:0779b29_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別聲平等，等察癡響，了空一等，愚冥如雲，分別平等，則曉定意。",
        "translation": "Equally discerning the equality of distinct sounds, equally examining the sound of delusion, comprehending emptiness and equality, and being as ignorant as a cloud, they then understand the intention of concentration.",
        "source": "T11n0315b_001:0779c01_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩等遊愚癡。」",
        "translation": "This is the bodhisattva's equal excursion into delusion.\"",
        "source": "T11n0315b_001:0779c02_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入不善？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's mind wandering into unwholesomeness with equal discrimination?",
        "source": "T11n0315b_001:0779c03_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲行無形，瞋行無處，不行癡行，知眾平等，諸塵悉平，得解虛無，所有了淨。",
        "translation": "Their desire-laden behavior has no form, their anger-laden behavior has no place, they don't engage in deluded behavior, they know that all people are equal, and all the dust is leveled, and they come to understand emptiness and the purity of all that exists.",
        "source": "T11n0315b_001:0779c04_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是是為菩薩等意遊入於諸不善。」",
        "translation": "Such is the mind of a bodhisattva who wanders into what's unwholesome.\"",
        "source": "T11n0315b_001:0779c06_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意遊入諸善德本？",
        "translation": "Puṣpa also told him, \"What's meant by bodhisattvas' minds wandering into the roots of good qualities?",
        "source": "T11n0315b_001:0779c07_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生修善，心行若干，諸行一行，常了平等，已知平等，眾行如幻，別聲一等，則了語音。",
        "translation": "When sentient beings cultivate goodness, their mental actions are various, their actions and deeds are always equal, and when they know they're equal, their many actions are illusory, and they understand speech sounds when they're equal in distinct sounds.",
        "source": "T11n0315b_001:0779c08_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩等遊眾德。」",
        "translation": "This is the virtue of bodhisattvas who travel around in equal measure.\"",
        "source": "T11n0315b_001:0779c10_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入有為？",
        "translation": "Puṣpa also told him, \"What's meant by bodhisattvas' equal discernment of wandering into existence and becoming?",
        "source": "T11n0315b_001:0779c10_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有無有，計不可量，無量難計，常曉平等，了無央數，無行無像，解脫等寂，覩一切安。",
        "translation": "They are without existence, immeasurable, incalculable, and difficult to fathom, always know equality, comprehend incalculability, lack practice and form, are equally tranquil in their liberation, and see all peace.",
        "source": "T11n0315b_001:0779c11_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩等遊有為。」",
        "translation": "This is called a bodhisattva who travels around in the midst of creation.\"",
        "source": "T11n0315b_001:0779c13_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊入無為？",
        "translation": "He also told Puṣpa: \"What's meant by bodhisattvas who mindfully discern and wander into nonexistence?",
        "source": "T11n0315b_001:0779c14_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本淨法寂，亦無合會，無明假聲，等察音聲，無言無教，皆了無為，眾著言聲，等觀如是。",
        "translation": "The originally pure Dharma is quiescent, there's no conjunction, nescience is provisional, sounds are equally scrutinized, there are no words or teachings, they are all comprehended as being nothing, and the multitude of people attached to words and sounds are equally observed as such.",
        "source": "T11n0315b_001:0779c15_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩等遊無為。」",
        "translation": "This is called a bodhisattva's equal tour of nonconduct.\"",
        "source": "T11n0315b_001:0779c17_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告溥首：「何謂菩薩等意分別遊于平等？",
        "translation": "Puṣpa also told him, \"What's meant by a bodhisattva's mind wandering about equality with equal discrimination?",
        "source": "T11n0315b_001:0779c17_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不處有為，不住無為，諸行平等，如空無礙。",
        "translation": "Not abiding in existent form, not abiding in nonexistence, their conditioned activities are equal, like space without obstruction.",
        "source": "T11n0315b_001:0779c18_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三界無本，何求泥洹？",
        "translation": "When the three realms have no origin, how can one seek nirvāṇa?",
        "source": "T11n0315b_001:0779c19_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不出不入，乃至大安，度脫眾生，解不若干，法身如空，不合不散。",
        "translation": "They don't emerge or enter, up to great peace, liberate sentient beings, understand and don't count, and their Dharma body is like space, which doesn't fit or scatter.",
        "source": "T11n0315b_001:0779c20_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩等遊平等。」",
        "translation": "This is the equality of the bodhisattvas' equal excursions.\"",
        "source": "T11n0315b_001:0779c21_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊說斯章句之頌，順如應時，不可思議。",
        "translation": "The Bhagavān spoke this verse in prose, which follows the appropriate time and is inconceivable.",
        "source": "T11n0315b_001:0779c22_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九萬九千菩薩得不起法忍，七十二億百千天人皆發無上正真道意，三百六十萬比丘漏盡意解，六千比丘尼皆發無上正真道意。",
        "translation": "Ninety-nine thousand thousand bodhisattvas have attained the forbearance of not renouncing the Dharma, 7.2 billion of the 1,000,000 gods have arisen the unsurpassed true intention for the path, 3.6 million monks have their contaminants ended, and 6,000 nuns have arisen the unsurpassed true intention for the path.",
        "source": "T11n0315b_001:0779c23_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二千二百清信士、千八百清信女，皆發無上正真道意。",
        "translation": "Twenty-two hundred pure faithful men and eighteen hundred pure faithful women each arouse the will for the unsurpassed true path.",
        "source": "T11n0315b_001:0779c26_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時溥首童真，白世尊曰：「唯願，大聖！",
        "translation": "It was then that Puṣya Boyzin said to the Bhagavān, \"May it be, great sage!",
        "source": "T11n0315b_001:0779c27_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "演三昧號，菩薩由斯而致至德，諸根明了。",
        "translation": "\"Emitting the name of samādhi, the bodhisattva thus attains the supreme virtue and clarity of his faculties.",
        "source": "T11n0315b_001:0779c28_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是三昧所因名號，則當獲得一切法明靡不通達，而悉降伏一切迷惑邪見之眾。",
        "translation": "Hearing the name of the cause of this concentration, they'll attain a thorough understanding of all things and completely subdue all those who are confused and have mistaken views.",
        "source": "T11n0315b_001:0779c29_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂一文字，分別曉了一切諸文，以一切文而了一文，辯才之慧不可限量，為諸群生講說經法，分別曉了緣應法忍，以一切行入於一相，逮無量無限之義，曉了識義四分別辯。」",
        "translation": "They are fond of a single word, discern and comprehend all texts, understand a single text with all texts, have unlimited eloquence, expound the sūtras and teachings to various sentient beings, discern and comprehend the tolerance of conditions that arise, enter into a single aspect with all practices, acquire measureless and limitless meanings, and comprehend the fourfold discernment of the meaning of consciousness.\"",
        "source": "T11n0315b_001:0780a02_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊，告溥首童真：「諦聽！",
        "translation": "The Bhagavān then addressed Puṣpadantī, \"Listen closely!",
        "source": "T11n0315b_001:0780a06_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T11n0315b_001:0780a07_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當為仁分別本末。」",
        "translation": "Now, you will discern the beginning and end for the sake of kindness.\"",
        "source": "T11n0315b_001:0780a07_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「甚善！",
        "translation": "They replied, \"Very good!",
        "source": "T11n0315b_001:0780a08_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T11n0315b_001:0780a08_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有三昧名離無量垢，假使菩薩逮得斯定，普見一切諸色清淨。」",
        "translation": "The Buddha said, \"There's a samādhi called freedom from immeasurable pollution, and if a bodhisattva acquires this concentration, he'll see all forms clearly and universally.\"",
        "source": "T11n0315b_001:0780a08_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告溥首：「有三昧名懷若干，假使菩薩逮得斯定，智慧光明，覆蔽一切日月之明。",
        "translation": "The Buddha told Puṣya, \"There's a samādhi called wisdom in number, and if a bodhisattva acquires that concentration, the light of wisdom will cover the brightness of the sun and moon.",
        "source": "T11n0315b_001:0780a10_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名成具光明，假使菩薩逮得斯定，威耀覆蔽帝釋梵王，三界之冥悉蒙安隱，諸天光耀忽不復現。",
        "translation": "There's a samādhi called accomplished radiance, and if a bodhisattva acquires this concentration, its radiance will cover Indra, Brahmā, and the darkness of the three realms will be made secure, and the brilliance of the gods will suddenly not reappear.",
        "source": "T11n0315b_001:0780a12_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名捨界，假使菩薩逮得斯定，處於眾會蠲除一切婬怒癡病。",
        "translation": "There's a samādhi called equanimity, which, if the bodhisattva acquires this concentration, will remove all the diseases of lust, anger, and delusion while standing in numerous assemblies.",
        "source": "T11n0315b_001:0780a14_70",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名莫能當，假使菩薩逮得斯定，照明一切八方上下諸佛國土。",
        "translation": "There's a samādhi called ungraspable, which, if the bodhisattva acquires, will illuminate all the eight directions and up and down the lands of the buddhas.",
        "source": "T11n0315b_001:0780a16_71",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名諸法無所生，假使菩薩逮得斯定，總攬諸佛經語訓典，為眾會分別敷演。",
        "translation": "There's the samādhi called the nonarising of all dharmas, which, if the bodhisattva acquires this concentration, will summarize the scriptures and teachings of the buddhas and present them to the assembly.",
        "source": "T11n0315b_001:0780a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名念雷音，假使菩薩逮斯定者，言語音聲暢于梵天。",
        "translation": "There's the samādhi called mindfulness of the thundering voice, and if a bodhisattva acquires this concentration, his speech and voice will be heard in the Brahma heavens.",
        "source": "T11n0315b_001:0780a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名曉了一切應心所樂，假使菩薩逮斯定者，悅可眾生隨其所樂而令解脫。",
        "translation": "There's the samādhi called understanding all the desires of the mind, and if a bodhisattva acquires this concentration, he'll please sentient beings and cause them to be liberated according to their desires.",
        "source": "T11n0315b_001:0780a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名無會現悅精進，假使菩薩逮斯定者，現見無為，無有限數，終始之惑，所聞所見莫不通達。",
        "translation": "There's the samādhi called unassociated present-pleasing effort, which, if a bodhisattva acquires this concentration, will lead to the manifestation of views that are unconstrained, without finite limitations or terminal afflictions, and which are not comprehended by anything heard or seen.",
        "source": "T11n0315b_001:0780a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名無念寶德樂於世界，假使菩薩逮斯定者，放諸神足施化眾生。",
        "translation": "There's the samādhi called the nonconceptualization of the precious virtues that delight the world, and if a bodhisattva acquires this concentration, he releases his spiritual powers to teach sentient beings.",
        "source": "T11n0315b_001:0780a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名諸音緣會，假使菩薩逮斯定者，覺諸言音，以無數字了一文字，以一文字說無數字。",
        "translation": "There's the samādhi called the association of sounds, and if a bodhisattva acquires this concentration, he'll perceive the sounds of words, comprehend a single word with countless words, and speak countless words with a single word.",
        "source": "T11n0315b_001:0780a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名積眾善德，假使菩薩逮斯定者，分別罪福興顯平等，多所悅可一切眾生。",
        "translation": "There's a samādhi called accumulating many good qualities, and if a bodhisattva acquires this concentration, it discerns sins and merits, produces equality, and is pleasing to all sentient beings in many ways.",
        "source": "T11n0315b_001:0780a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便聞佛音、法音、眾音——聲聞音、緣覺音、菩薩音——度無極音，彼有所說亦無音聲。",
        "translation": "They can then hear the Buddha's voice, the Dharma's voice, and the voices of many voices - the voices of śrāvakas, pratyekbuddhas, and bodhisattvas - and achieve the infinite voice, which has no sound even when it's spoken.",
        "source": "T11n0315b_001:0780b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名起諸總持為一切王，假使菩薩逮得斯定，分別一切無量總持。",
        "translation": "There's a samādhi called 'generosity,' which is the king of them all, and if a bodhisattva acquires this concentration, he'll discern all the measureless generosities.",
        "source": "T11n0315b_001:0780b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三昧名淨諸辯才，假使菩薩逮斯定者，寂除一切音聲言說，皆無言教亦無響應，無言無教亦無所有。」",
        "translation": "There's a samādhi called purifying eloquence, and if a bodhisattva acquires this concentration, he'll be able to silence all sounds and words, which are without words or teachings, without echoes, and without words or teachings or anything.\"",
        "source": "T11n0315b_001:0780b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是溥首，白世尊曰：「唯然，大聖！",
        "translation": "Puṣya then said to the Bhagavān, \"Yes, great sage!",
        "source": "T11n0315b_001:0780b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄙身寧應講斯典之功德乎？」",
        "translation": "How could I possibly speak of the merits of this scripture?\"",
        "source": "T11n0315b_001:0780b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告曰：「宜講。」",
        "translation": "He said, \"It's appropriate to recite it.\"",
        "source": "T11n0315b_001:0780b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溥首白佛：「假使菩薩聞斯經典而不狐疑，發心受持而諷誦讀，其人現在得妙辯才，聰明辯、欣豫辯、深妙辯、無合會辯，常行慈心加諸眾生，無毀傷意。",
        "translation": "Puṣpa said to the Buddha, \"Suppose a bodhisattva hears this sūtra and doesn't doubt it, motivates it, accepts it, and recites it, that person will now attain marvelous eloquence, intelligent eloquence, joyful eloquence, profound and subtle eloquence, and uncommon eloquence, and will always act with kindness toward sentient beings without malice.",
        "source": "T11n0315b_001:0780b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0315b_001:0780b14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使憂念所作所趣，奉行智諦，隨身未曾捨離。」",
        "translation": "Suppose he were to become concerned about what he's doing and pursue the truth of wisdom, never abandoning it at all times.\"",
        "source": "T11n0315b_001:0780b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，讚溥首曰：「善哉，善哉！",
        "translation": "It was then that the Bhagavān praised Puṣya, \"Good, good!",
        "source": "T11n0315b_001:0780b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快說此言，誠如之意。",
        "translation": "\"Quickly speaking these words is true to their intent.",
        "source": "T11n0315b_001:0780b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如布施獲致大富而不虛假；持戒生天亦不虛假。",
        "translation": "It's like giving alms to attain great wealth that isn't false, and observing precepts to be born in heaven that isn't false.",
        "source": "T11n0315b_001:0780b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今斯經典亦復如茲，學致辯才，亦不虛設，悉得本志。",
        "translation": "So it is with this sūtra, for it's cultivated eloquence and eloquence aren't false; they all attain their original intent.",
        "source": "T11n0315b_001:0780b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如日光出照天下，眾冥悉除，斯經如是，諷誦學者，懷來辯才，靡不通達；喻如菩薩坐于道場，於佛樹下，逮得無上正真之道，成最正覺；菩薩如是，學誦斯經，必得辯才，除諸狐疑。",
        "translation": "It's like when sunlight shines under the heavens and all darkness is removed, and so it is with this sūtra that those who recite it will come to bear eloquence that's not baffling; it's like a bodhisattva sitting in the site of the path, under the Buddha's tree, who acquires the unsurpassed true path and becomes the most perfectly enlightened; bodhisattvas who thus recite this sūtra will surely attain eloquence and remove foxes and doubts.",
        "source": "T11n0315b_001:0780b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，溥首！",
        "translation": "Therefore, Puṣya!",
        "source": "T11n0315b_001:0780b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩現欲興辯，曉練諸法，聞斯經典心不猶豫，即當受持講說諷誦，為諸眾會廣演其誼。」",
        "translation": "Suppose a bodhisattva now wants to be eloquent and well versed in the teachings, and he hears this sūtra and doesn't hesitate, then he will accept it, recite it, and recite it, and explain its meaning to the congregation.\"",
        "source": "T11n0315b_001:0780b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是離垢藏菩薩，前白佛言：「佛滅度後，其有受持諷誦講說斯經法者，廣為眾會敷演其誼，鄙親當為寡解所歸，使不狐疑，疾得辯才。」",
        "translation": "The Vimalagarbha Bodhisattva then said to the Buddha, \"Suppose there's someone who accepts, recites, and lectures on the teachings of this sūtra after the Buddha's passing away and explains its meaning in detail to the congregation, then my dears will be the recipients of little understanding, so that they won't be in doubt and will quickly attain eloquence.\"",
        "source": "T11n0315b_001:0780b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時弊魔愁毒垂淚，來詣佛所，白世尊曰：「唯無建立於斯經也！",
        "translation": "Then, overcome with sorrow and tears, Māra came to the Buddha and said to the Bhagavān, \"Only this sūtra wasn't established!",
        "source": "T11n0315b_001:0780b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、至真、等正覺常懷大哀，其有苦患施以大安。",
        "translation": "The Tathāgata, the supremely true, and the perfectly enlightened always has great compassion for those who suffer and are afflicted, and he gives them great peace.",
        "source": "T11n0315b_001:0780c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉，大聖！",
        "translation": "Good, great sage!",
        "source": "T11n0315b_001:0780c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願除我慼，如昔世尊初坐樹下處于道場，今復重加說斯經典，我今憂欝心懷懊惱，甚於如來始得佛道，所投濟時，我之反側不能自勝。",
        "translation": "\"May my sorrow be removed, for as long ago as the Bhagavān first sat under a tree in the site of enlightenment and now he's again teaching this sūtra, my grief and distress are greater than when the Tathāgata first attained the Buddha Way and cast himself to the rescue, and I'm unable to overcome my own reverses.",
        "source": "T11n0315b_001:0780c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切皆當得不退轉，逮無上正真之道、成最正覺，其有黎庶耳聞斯經，聽音伏名，悉當得道至于滅度，空我境界，虛魔宮殿。",
        "translation": "All of them will attain irreversibility, acquire the unsurpassed true path, and become the most truly enlightened, and all of them who hear this sūtra and listen to its sounds and subdue its names will attain the path to complete extinction, the realm of the empty self, and the palace of Vermont.",
        "source": "T11n0315b_001:0780c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖撫育安住垂安，興建大悲唯見矜濟。」",
        "translation": "The great sage nurtures, abides in well-being, and builds great compassion, seeing only to rescue.\"",
        "source": "T11n0315b_001:0780c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告魔曰：「波旬！",
        "translation": "The Buddha told Māra, \"Pāpīyān!",
        "source": "T11n0315b_001:0780c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫恐，勿懷怖懼，一切眾生不悉滅度，如來亦不建立斯經。」",
        "translation": "Don't be afraid, don't harbor fear, for unless all sentient beings are destroyed, the Tathāgata won't establish this sūtra.\"",
        "source": "T11n0315b_001:0780c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔聞佛告，踊躍歡喜，善心生矣，忽然不現。",
        "translation": "When the Māras heard the Buddha's advice, they rejoiced and rejoiced, and their good intentions arose and suddenly didn't appear.",
        "source": "T11n0315b_001:0780c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溥首白佛：「何故為魔而說斷教？」",
        "translation": "Puṣpa said to the Buddha, \"Why did you explain the cutting off teaching for Māra?\"",
        "source": "T11n0315b_001:0780c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告溥首：「斯經典者，住無所住，是故為魔而說斯言：『吾不建立斯經典也！』",
        "translation": "The Buddha told Puṣpa: \"This is a scripture that abides in nothing, so he said this for Māra, 'I won't establish this scripture!'",
        "source": "T11n0315b_001:0780c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至誠不虛。",
        "translation": "\"Perfectly sincere, they're not false.",
        "source": "T11n0315b_001:0780c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法住無所住，不可逮得，無有言教，離於二事，本際平等，審諦無本，法界如稱，平若虛空，無適無莫，真正無異。",
        "translation": "All things that are abiding in dharmas have no abode, are ungraspable, have no verbal teaching, are free of two things, are equal in essence, have no basis in truth, are true as the dharmadhātu as it's called, are level as space, are inappropriate and inexpressible, and are truly not different.",
        "source": "T11n0315b_001:0780c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今經流布斯閻浮提，於此天下當有瑞應。」",
        "translation": "Now that the sūtra has spread throughout Jambudvīpa, there will be an auspicious response under the heavens.\"",
        "source": "T11n0315b_001:0780c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊適建誠諦之教，自然空中音普廣聞，誠如佛言，至誠不虛。",
        "translation": "The Bhagavān appropriately established the teaching of the truth, and naturally the sounds in the sky were heard everywhere, true to the Buddha's words, perfectly sincere, and not false.",
        "source": "T11n0315b_001:0780c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「受斯普門品經之要，持諷誦讀宣示同學。」",
        "translation": "The Buddha told Ānanda, \"Accept these essentials of the Samanta-mukha-parivarto sūtra, recite them, recite them, and proclaim them to your fellow students.\"",
        "source": "T11n0315b_001:0780c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言阿難：「八十萬四千法品之藏，計比斯經典，等無差特。",
        "translation": "He also told Ānanda, \"Out of a collection of eighty-four thousand categories of teachings, these scriptures are equal in number and have no distinctions.",
        "source": "T11n0315b_001:0780c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0315b_001:0780c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量之門法界諸要，如來分別曉了眾生，解斯經典而成佛道，然後講說八萬四千諸經品藏。",
        "translation": "There are countless approaches to the essentials of the Dharma realm, and the Tathāgata discerns and understands the scriptures of sentient beings who then become buddhas and explain the 84,000 categories of sūtras.",
        "source": "T11n0315b_001:0780c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T11n0315b_001:0780c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當受斯經消息，將順諦持諷誦，為眾人說。」",
        "translation": "You will accept this message from the sūtra, recite it with deference, and explain it to the people.\"",
        "source": "T11n0315b_001:0780c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此已，離垢藏菩薩、溥首童真，賢者阿難，諸天、世人、揵沓和、阿須倫，聞經歡喜，稽首而退。",
        "translation": "After the Buddha spoke this, the Vimalagarbha Bodhisattva, Pauṣṭhila, the good man Ānanda, the gods, humans, Gandharvas, and Asuras rejoiced when they heard the sūtra, bowed their heads, and withdrew.",
        "source": "T11n0315b_001:0780c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說普門品經",
        "translation": "Samanta-mukha-parivarto nāmâvalokitêśvara-vikurvaṇa-nirdeśa-sūtra",
        "source": "T11n0315b_001:0780c30_0",
        "is_bad_quality": false
    }
]