[
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第三",
        "translation": "Foshuo dasheng pusa zangzang zhengfa jing, vol. 3",
        "source": "T11n0316_035:0872b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T11n0316_035:0872b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏銀青光祿大夫",
        "translation": "Silver Blue Corona, Grand Master of the Tripiṭaka of the Western Translation of the Scriptures",
        "source": "T11n0316_035:0872b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "試光祿卿慈覺傳梵大師賜紫",
        "translation": "The Great Master Guangluqing Cikaku Chuanfan granted the purple [robe]",
        "source": "T11n0316_035:0872b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "Translated by imperial order by the monks, ministers, and others, Fahou",
        "source": "T11n0316_035:0872b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝慧波羅蜜多品第十一之三",
        "translation": "Eleventh and Third Categories of the Perfection of Wisdom",
        "source": "T11n0316_035:0872b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T11n0316_035:0872b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩獲得如是於諦善巧，由此了知五蘊是苦，若令五蘊苦相止息猶如虛空，是苦聖諦。",
        "translation": "The bodhisattva Mahāsattva has attained this skillfulness in regard to the truth, by which he knows that the five aggregates are painful, and if he causes the painful aspects of the five aggregates to cease as if they were empty space, this would be the noble truth of suffering.",
        "source": "T11n0316_035:0872b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此五蘊隨惑愛見，若令執取愛見等因不起合集，為集聖諦。",
        "translation": "Also, if these five aggregates are accompanied by delusion, craving, and views, and if such causes as clinging to craving and views don't arise in conjunction with their accumulation, this is the noble truth of accumulation.",
        "source": "T11n0316_035:0872b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此五蘊畢竟滅盡，若令前際不生、後際不起、現在不住，為滅聖諦。",
        "translation": "If these five aggregates are ultimately extinguished, and if it's caused that the prior end doesn't arise, the subsequent end doesn't arise, and the present doesn't abide, this is the noble truth of cessation.",
        "source": "T11n0316_035:0872b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於苦智、集智、滅智而能證達以智相續，能善調伏引趣正行，為道聖諦。",
        "translation": "If he can realize the continuity of cognition through the cognition of suffering, arising, and cessation and can skillfully regulate correct practices that lead to destinies, this is the noble truth of the path.",
        "source": "T11n0316_035:0872b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復於此諸諦現觀，而能尋伺遍盡觀察，是為菩薩摩訶薩於諦善巧。",
        "translation": "Also, to be able to discern and fully scrutinize the manifestation of these noble truths is a bodhisattva-mahāsattva's skillful knowledge of the truths.",
        "source": "T11n0316_035:0872b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復了知諸受是苦乃至受所引攝，諸決擇智，是為苦聖諦。",
        "translation": "Also, knowing that feelings are painful and that they are taken in by feelings and having discriminating wisdom is the noble truth of suffering.",
        "source": "T11n0316_035:0872c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若因於受引生於合集，如實了知，是為集聖諦。",
        "translation": "If it's the result of feelings that lead to co-production and is truly known, this is the noble truth of production.",
        "source": "T11n0316_035:0872c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若於受而得輕安則於受非受，而復觀察非受是滅獲證於滅，是為滅聖諦。",
        "translation": "Also, if he attains ease with feeling, then he experiences what's not feeling and observes that what's not feeling is cessation and realizes cessation, which is the noble truth of cessation.",
        "source": "T11n0316_035:0872c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若受所引道，如彼世間積集進求，非受非道令彼苦滅引趣正行，是為道聖諦。",
        "translation": "Also, if feeling leads to the path as the world accumulates and pursues accumulation, then what's not feeling and what's not the path causes them to undergo suffering and cessation and leads to right practice, this is the noble truth of the path.",
        "source": "T11n0316_035:0872c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見如是四諦平等畢竟無見，是為清淨，是名菩薩摩訶薩於諦善巧。",
        "translation": "If he sees that these four truths are equal and ultimately without perspective, this is pure, and it's called the bodhisattva-mahāsattva's skillfulness in regard to the truths.",
        "source": "T11n0316_035:0872c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復於滅而起現證，復能於苦不生觀察，是為苦智。",
        "translation": "Again, when he gives rise to the present realization of cessation, he can also observe suffering without arising, which is the knowledge of suffering.",
        "source": "T11n0316_035:0872c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有緣生於有離有，是為集智。",
        "translation": "If conditions arise that free existence from existence, this is the cognition of accumulation.",
        "source": "T11n0316_035:0872c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了知一切生本不生、滅無所滅，是為滅智。",
        "translation": "To know that all births originally don't arise and cease without ceasing is cognition of cessation.",
        "source": "T11n0316_035:0872c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於如是道隨其種類，尋求伺察令入其智，是為道智。",
        "translation": "To seek and examine such paths according to their type and cause them to enter their knowledge is knowledge of the path.",
        "source": "T11n0316_035:0872c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能安住如是諦智，說此是為菩薩摩訶薩於勝慧波羅蜜多之行獲諦善巧。",
        "translation": "If someone can abide in such knowledge of truth, this is said to be the skillful way in which a bodhisattva Mahāsattva attains the perfection of wisdom in the practice of the perfection of wisdom.",
        "source": "T11n0316_035:0872c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T11n0316_035:0872c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復菩薩摩訶薩獲得四種正知善巧。",
        "translation": "\"Furthermore, the bodhisattva Mahāsattva has attained four kinds of skillful means of correct knowledge.",
        "source": "T11n0316_035:0872c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T11n0316_035:0872c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者義正知，二者法正知，三者世間典籍正知，四者辯才正知。",
        "translation": "One is right knowledge of meaning, two is right knowledge of the teaching, three is right knowledge of worldly texts, and four is right knowledge of eloquence.",
        "source": "T11n0316_035:0872c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何義正知？",
        "translation": "What's right knowledge of meaning?",
        "source": "T11n0316_035:0872c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若於法諸勝義句，相續因智，緣智，集智，通達無邊智，入解緣起智，分別法界智，隨順入解真如智，不住實際智，如實法空智，伺察無相智，於願無願智，於行無行智，入一正理智，入解無我智，解無眾生智，了無壽者智，無補特伽羅勝義智，於過去世無障礙智，於未來世無限量智，於現在世遍一切處智，於蘊幻化智，於處決定空智，於界度量智，內身寂靜智，外無遍行智，出離塵境智，念無所住智，達無所入智，勝慧觀察智，通達四諦智，諸苦為有智，諸集為行智，諸滅無相智，諸道出離智，分別一切法句智，善解諸根智，諸力無能屈伏智，奢摩他加持智，毘鉢舍那光明智，於諸幻化起變滅智，於諸陽焰無迷亂智，於諸夢境無實見智，於諸谷響了緣生智，於諸影像無合集智，於種種相唯一相智，於正和合無所合智，於諸輕安無所得智，於聲聞乘達言音智，於緣覺乘解緣生智，於最上乘積集一切善根智。",
        "translation": "謂若於法諸勝義句，相續因智，緣智，集智，通達無邊智，入解緣起智，分別法界智，隨順入解真如智，不住實際智，如實法空智，伺察無相智，於願無願智，於行無行智，入一正理智，入解無我智，解無眾生智，了無壽者智，無補特伽羅勝義智，於過去世無障礙智，於未來世無限量智，於現在世遍一切處智，於蘊幻化智，於處決定空智，於界度量智，內身寂靜智，外無遍行智，出離塵境智，念無所住智，達無所入智，勝慧觀察智，通達四諦智，諸苦為有智，諸集為行智，諸滅無相智，諸道出離智，分別一切法句智，善解諸根智，諸力無能屈伏智，奢摩他加持智，毘鉢舍那光明智，於諸幻化起變滅智，於諸陽焰無迷亂智，於諸夢境無實見智，於諸谷響了緣生智，於諸影像無合集智，於種種相唯一相智，於正和合無所合智，於諸輕安無所得智，於聲聞乘達言音智，於緣覺乘解緣生智，於最上乘積集一切善根智。",
        "source": "T11n0316_035:0872c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說，是為菩薩於義正知。",
        "translation": "Thus explained, this is the bodhisattva's correct knowledge of meaning.",
        "source": "T11n0316_035:0873a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復義正知者，若於義隨順則諸法隨順，彼所隨義即諸法性。",
        "translation": "Furthermore, someone who correctly knows the meaning, if they conform to the meaning, then the dharmas conform, and the meaning they conform to is the nature of the dharmas.",
        "source": "T11n0316_035:0873a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0316_035:0873a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸法義畢竟如空。",
        "translation": "It's because the meanings of all dharmas are ultimately empty.",
        "source": "T11n0316_035:0873a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若義如空，則諸法義畢竟無相。",
        "translation": "If their meanings are like emptiness, then the meanings of the things are ultimately without marks.",
        "source": "T11n0316_035:0873a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若義無相，則諸法義畢竟無願。",
        "translation": "If their meanings lack characteristics, then the meanings of dharmas are ultimately without aspiration.",
        "source": "T11n0316_035:0873a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若義無願，則彼法義無所趣證。",
        "translation": "If their meanings lack vows, then the meanings of those things have no destination to be realized.",
        "source": "T11n0316_035:0873a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若義無所證，則一切法義畢竟無壽者、無補特伽羅。",
        "translation": "If their meanings have nothing to realize, then the meanings of all dharmas ultimately have no life span and no person in the pudgala.",
        "source": "T11n0316_035:0873a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若義無補特伽羅，則於是義通達法相。",
        "translation": "If there's no person or pudgala in their meanings, then they comprehend the characteristics of the Dharma in their meanings.",
        "source": "T11n0316_035:0873a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說於義無住無盡，於所說義而獲證知，諸佛世尊隨喜印可，於彼勝慧如實正知。",
        "translation": "If the meaning is explained to be unabiding and inexhaustible, and it's realized in the explained meaning, the buddhas approve of it with joy, and they truly and correctly know it with excellent wisdom.",
        "source": "T11n0316_035:0873a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於勝慧如實正知，則一切處無有過失，說此是為菩薩於義正知。",
        "translation": "If they truly and correctly know superior wisdom, then there's nothing wrong with it in any place, and this is said to be the bodhisattva's correct knowledge of the meaning.",
        "source": "T11n0316_035:0873a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名法正知？",
        "translation": "\"What's called right knowledge of the teaching?",
        "source": "T11n0316_035:0873a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於正法入解之智，若善不善、有過無過、有漏無漏、世間出世間、有為無為、染分淨分、輪回涅盤、法界智界，本自平等無所覺悟。",
        "translation": "This is the knowledge of the right Dharma's entry and understanding, whether good or unskillful, with or without faults, contaminated or uncontaminated, mundane or transmundane, acquired or unacquired, defiled or pure, transmigration or nirvāṇa, or the Dharma realm or the wisdom realm, which is inherently equal and has nothing to be awakened to.",
        "source": "T11n0316_035:0873a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此是為菩薩於法正知。",
        "translation": "This is said to be the bodhisattva's correct knowledge of the Dharma.",
        "source": "T11n0316_035:0873a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復法正知者，於彼貪行心能正知，所謂虛假貪行、堅固貪行、微細貪行、廣大貪行、過去貪行無邊觀察，現在貪行隨緣入解。",
        "translation": "\"Furthermore, someone who correctly knows the teaching can correctly know at heart the practice of greed, which is called the practice of false greed, the practice of resolute greed, the practice of subtle greed, the practice of extensive greed, the limitless observation of the practice of past greed, and the understanding of the practice of present greed in accordance with conditions.",
        "source": "T11n0316_035:0873a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復有情內貪而非外貪，或復外貪而非內貪，或復內貪亦外貪，或非內貪亦非外貪。",
        "translation": "Sometimes a sentient being craves internally but not externally, sometimes they crave externally but not internally, sometimes they crave internally and externally, or they crave internally or not externally.",
        "source": "T11n0316_035:0873a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復色貪非聲貪，聲貪非色貪，色貪亦聲貪，色聲俱非貪。",
        "translation": "Sometimes form greed is not sound greed, sound greed is not form greed, form greed is also sound greed, and both form and sound are not greed.",
        "source": "T11n0316_035:0873a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色貪非香貪，聲貪非香貪，香貪非味貪，味貪非觸貪，乃至綺互於色聲香味觸貪行等，如是非義利門，入解二萬一千貪行、二萬一千瞋行、二萬一千癡行。",
        "translation": "Whether it's form desire that's not fragrance desire, sound desire that's not fragrance desire, fragrance desire that's not taste desire, taste desire that's not touch desire, or even the mutual pursuit of form, sound, fragrance, touch, and so forth, such is the gate to right and wrong, which leads to the understanding of 21,000 actions of greed, 21,000 actions of anger, and 21,000 actions of delusion.",
        "source": "T11n0316_035:0873a29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是貪瞋癡二萬一千眾等分行。",
        "translation": "Thus, these 21,000 actions of greed, anger, and delusion are numerous and equal in number.",
        "source": "T11n0316_035:0873b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說，入解八萬四千心行之智、如其所說相應行相智、不增不減智、越百欲界智、殊勝法器智、真實言說智，說此是為菩薩於法正知。",
        "translation": "Such knowledge of 84,000 mental actions, knowledge of the associated defining activities as they're explained, knowledge that doesn't increase or decrease, knowledge that transcends the 100 desire realms, knowledge of the superior Dharma vessel, and knowledge of true speech are said to be the bodhisattva's correct knowledge of the teaching.",
        "source": "T11n0316_035:0873b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何世間典籍正知？",
        "translation": "\"What's right knowledge of worldly texts?",
        "source": "T11n0316_035:0873b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若入解一切聲智。",
        "translation": "\"Suppose someone enters into the knowledge of all sounds.",
        "source": "T11n0316_035:0873b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天聲、龍聲、夜叉聲、乾闥婆聲、阿脩羅聲、迦樓羅聲、緊那羅聲、摩睺羅伽聲、人聲非人聲而能入解。",
        "translation": "He'll be able to understand the sounds of gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and non-humans.",
        "source": "T11n0316_035:0873b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五趣有情麁細高下，說法連環相續不斷音聲文字。",
        "translation": "The five destinies of sentient beings, crude and fine, high and low, are taught a series of teachings that continue without break in sound and words.",
        "source": "T11n0316_035:0873b10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼或說一說二說多，男聲、女聲、非男非女聲，廣說略說，鄙陋說巧妙說，過去說未來說現在說，一字相應多字相應，皆悉了知。",
        "translation": "They might say one, say two, say many, say male, female, non-male, and non-female sounds, say something broad and brief, say something crude and clever, say something in the past and say something in the future and say something in the present, or say one word that's associated with multiple words, all of which are fully understood.",
        "source": "T11n0316_035:0873b11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此是為世間典籍正知。",
        "translation": "This is said to be accurate knowledge of worldly texts.",
        "source": "T11n0316_035:0873b14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復世間典籍正知者，成熟於文、明了於義，離諸恐畏復無過失。",
        "translation": "Furthermore, someone who has correct knowledge of worldly texts is ripe with the text and understands the meaning, free of fear and without error.",
        "source": "T11n0316_035:0873b15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於世俗、勝義，以自心知見，甚深巧妙種種莊嚴，令諸有情咸生歡喜，說此是為菩薩於世間典籍正知。",
        "translation": "This is said to be the bodhisattva's correct knowledge of worldly texts, which is based on his own mental knowledge and vision of the ultimate truth and is so profound and skillful in its various adornments that it causes sentient beings to rejoice.",
        "source": "T11n0316_035:0873b16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩辯才正知？",
        "translation": "\"What is the bodhisattva's accurate knowledge of eloquence?",
        "source": "T11n0316_035:0873b18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂言說無住無斷，真實記別迅速辯才、決定獲果辯才、如其所問辯才、無減失辯才、無斷滅辯才、無諍論辯才、樂善法辯才、住忍辯才、甚深辯才、善巧辯才、世俗勝義辯才、建立一切布施持戒忍辱精進禪定勝慧辯才、建立念處正斷神足根力覺支聖道奢摩他毘鉢舍那辯才、入解一切諦智定解脫三摩地三摩鉢底辯才、悟一切乘辯才、解一切有情心行辯才、無謇吃語言辯才、無生澁語言辯才、無雜亂語言辯才、潤澤語言辯才、清淨語言辯才、解脫語言辯才、無障語言辯才、尊重語言辯才、慈愛語言辯才、相應語言辯才、無缺漏語言辯才、甘美語言辯才、細滑語言辯才、無毀呰語言辯才、稱讚諸聖語言辯才，通達無邊剎土有情，能以妙梵音聲隨一詮表。",
        "translation": "所謂言說無住無斷，真實記別迅速辯才、決定獲果辯才、如其所問辯才、無減失辯才、無斷滅辯才、無諍論辯才、樂善法辯才、住忍辯才、甚深辯才、善巧辯才、世俗勝義辯才、建立一切布施持戒忍辱精進禪定勝慧辯才、建立念處正斷神足根力覺支聖道奢摩他毘鉢舍那辯才、入解一切諦智定解脫三摩地三摩鉢底辯才、悟一切乘辯才、解一切有情心行辯才、無謇吃語言辯才、無生澁語言辯才、無雜亂語言辯才、潤澤語言辯才、清淨語言辯才、解脫語言辯才、無障語言辯才、尊重語言辯才、慈愛語言辯才、相應語言辯才、無缺漏語言辯才、甘美語言辯才、細滑語言辯才、無毀呰語言辯才、稱讚諸聖語言辯才，通達無邊剎土有情，能以妙梵音聲隨一詮表。",
        "source": "T11n0316_035:0873b19_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是辯才，於他有情補特伽羅能善說法，佛乃印可。",
        "translation": "Such eloquence is approved by the Buddha if he can skillfully teach the Dharma to other sentient beings in Pudgala.",
        "source": "T11n0316_035:0873c05_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼若說法無出離者，云何能得盡諸苦際、成就正行？",
        "translation": "If he teaches the Dharma without escape, how can he end suffering and achieve correct practices?",
        "source": "T11n0316_035:0873c06_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T11n0316_035:0873c07_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此是為菩薩摩訶薩於勝慧波羅蜜多之行，而能獲得辯才善巧。",
        "translation": "It's said that this is the practice of the perfection of wisdom that enables the bodhisattva Mahāsattva to attain the skillfulness of eloquence.",
        "source": "T11n0316_035:0873c07_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩隨順善巧？",
        "translation": "\"How does the bodhisattva skillfully follow?",
        "source": "T11n0316_035:0873c09_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四種。",
        "translation": "\"There are four more kinds.",
        "source": "T11n0316_035:0873c09_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T11n0316_035:0873c10_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者隨義不隨於文，二者隨智不隨於識，三者隨了義經不隨不了義經，四者隨法不隨於人。",
        "translation": "One follows the meaning and not the words, two follows wisdom and not consciousness, three follows sutras that fully understand the meaning and not sutras that don't understand the meaning, and four follows the teaching and not people.",
        "source": "T11n0316_035:0873c10_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為義？",
        "translation": "What's the meaning?",
        "source": "T11n0316_035:0873c12_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為文？",
        "translation": "What is the text?",
        "source": "T11n0316_035:0873c12_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若入解出世法行，此說為義。",
        "translation": "\"If someone enters into the practice of understanding worldly dharmas, this is called the meaning.",
        "source": "T11n0316_035:0873c12_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "達世間法，此說為文。",
        "translation": "If they attain understanding of worldly dharmas, this is said to be the text.",
        "source": "T11n0316_035:0873c13_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於整肅施以妙樂，此說為義。",
        "translation": "If he gives sublime pleasure to the solemn, this is said to be the meaning.",
        "source": "T11n0316_035:0873c14_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無戲論調伏制止，此說為文。",
        "translation": "If they are disciplined and disciplined without conceptual elaborations, this is said to be the text.",
        "source": "T11n0316_035:0873c14_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於輪回遍能稱說，此說為義。",
        "translation": "If he were able to explain the gamut of transmigration, this would be explained as its meaning.",
        "source": "T11n0316_035:0873c15_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無所得廣大開示，此說為文。",
        "translation": "If it's a vast revelation of the unobtainable, this is said to be the text.",
        "source": "T11n0316_035:0873c16_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能普遍讚涅槃德，此說為義。",
        "translation": "If he could universally praise the virtue of nirvāṇa, this would be said to be its meaning.",
        "source": "T11n0316_035:0873c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於涅槃法體無分別，此說為文。",
        "translation": "If the essence of the teaching on nirvāṇa is undiscriminated, this is said to be the text.",
        "source": "T11n0316_035:0873c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於三乘分位如其開演，此說為義。",
        "translation": "If it's explained according to the delineation of the three vehicles, this is said to be its meaning.",
        "source": "T11n0316_035:0873c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智唯通達一種教理，此說為文。",
        "translation": "If he knew he could comprehend only one teaching, this would be explained as the text.",
        "source": "T11n0316_035:0873c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸有情開演布施，此說為義。",
        "translation": "Explaining generosity to sentient beings, this is said to be its meaning.",
        "source": "T11n0316_035:0873c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三輪清淨，此說為文。",
        "translation": "The three wheels are purified, and this is explained as the text.",
        "source": "T11n0316_035:0873c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能宣演三業威儀、積集一切頭陀功德，此說為義。",
        "translation": "If he can expound the manner of the three activities and accumulate all the virtues of the ascetic, this is said to be their meaning.",
        "source": "T11n0316_035:0873c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於身語意清淨勝行皆不可得，此說為文。",
        "translation": "The superior practices of purifying body, speech, and thought are unobtainable, and this is explained as the text.",
        "source": "T11n0316_035:0873c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能宣說堅固忍受忿恨惱嫉倨傲憍慢，此說為義。",
        "translation": "If he can teach the resolute endurance of anger, hate, jealousy, arrogance, and conceit, this is said to be its meaning.",
        "source": "T11n0316_035:0873c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得無生忍，此說為文。",
        "translation": "Attaining the patience of nonproduction, this is explained as the text.",
        "source": "T11n0316_035:0873c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能開演於諸善根踊躍精進，此說為義。",
        "translation": "If he can explain and expound the vigorous exertion of good roots, this is said to be its meaning.",
        "source": "T11n0316_035:0873c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼精進不入不住，此說為文。",
        "translation": "Not entering or abiding in that exertion, this is explained as the text.",
        "source": "T11n0316_035:0873c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能開演靜慮解脫等持等至，此說為義。",
        "translation": "If he can explain the equipoise of liberation through meditation, this is said to be its meaning.",
        "source": "T11n0316_035:0873c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅等至智，此說為文。",
        "translation": "knowledge of the equipoise of cessation, this is explained as the text.",
        "source": "T11n0316_035:0873c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸慧根多聞總持，此說為義。",
        "translation": "Being well-versed in the faculty of wisdom and maintaining it, this is said to be its meaning.",
        "source": "T11n0316_035:0873c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "義不可說，此說為文。",
        "translation": "The meaning is inexplicable, and this is explained as the text.",
        "source": "T11n0316_035:0873c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能開示三十七品菩提分法，此說為義。",
        "translation": "If he can reveal the thirty-seven factors of enlightenment, this is said to be their meaning.",
        "source": "T11n0316_035:0873c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩提分現證行果，此說為文。",
        "translation": "If the factors of enlightenment are the fruits of present realization and practice, this is said to be the text.",
        "source": "T11n0316_035:0874a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能開示苦集道諦，此說為義。",
        "translation": "If it can reveal the truth of the noble truths of suffering and arising, this is said to be their meaning.",
        "source": "T11n0316_035:0874a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現證滅諦，此說為文。",
        "translation": "To manifestly realize the truth of cessation, this is said to be the text.",
        "source": "T11n0316_035:0874a02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若正開示無明為先乃至老死，此說為義。",
        "translation": "If it correctly discloses that ignorance comes first and then goes on to old age and death, this is said to be its meaning.",
        "source": "T11n0316_035:0874a03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無明滅乃至老死滅，此說為文。",
        "translation": "If ignorance ceases ... and old age and death cease, this is said to be the text.",
        "source": "T11n0316_035:0874a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說積集止觀，此說為義。",
        "translation": "If he explains the accumulation of stillness and contemplation, this is explained as its meaning.",
        "source": "T11n0316_035:0874a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明解脫智，此說為文。",
        "translation": "To clarify the wisdom of liberation, this is said to be the text.",
        "source": "T11n0316_035:0874a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能分別貪瞋癡等分類行法，此說為義。",
        "translation": "If he can discriminate actions such as craving, ill-will, and delusion, this is said to be their meaning.",
        "source": "T11n0316_035:0874a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於解脫心無所動，此說為文。",
        "translation": "If his mind is unmoving in terms of liberation, this is said to be the text.",
        "source": "T11n0316_035:0874a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能開示諸障礙法，此說為義。",
        "translation": "If it can reveal the obstructing factors, this is said to be their meaning.",
        "source": "T11n0316_035:0874a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若證解脫無障礙智，此說為文。",
        "translation": "If he realizes liberation without obstructive cognition, this is said to be the text.",
        "source": "T11n0316_035:0874a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若正開示善能稱讚無量三寶，此說為義。",
        "translation": "If it correctly reveals that he's well able to praise the immeasurable Three Treasures, this is said to be its meaning.",
        "source": "T11n0316_035:0874a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離貪法性及無為功德，此說為文。",
        "translation": "If it's free of craving for the Dharma nature and the merit of nonbeing, this is said to be the text.",
        "source": "T11n0316_035:0874a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說菩薩最初發心習學功德乃至菩提道場，此說為義。",
        "translation": "If it explains the merits of a bodhisattva's initial aspiration and training up to the site of the enlightenment path, this is said to be its meaning.",
        "source": "T11n0316_035:0874a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一心相與一切智智無上正覺，乃至總略八萬四千法蘊相應，此說為文。",
        "translation": "If it's explained that the characteristics of a single mind are associated with the wisdom of omniscience, unsurpassed perfect enlightenment, and up to a summary of 84,000 Dharma aggregates, this is explained as the text.",
        "source": "T11n0316_035:0874a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若一切音聲語言文字乃至不可說義，俱說為義。",
        "translation": "It's also said to be the meaning of all sounds, words, and letters up to their ineffable meanings.",
        "source": "T11n0316_035:0874a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何不了義經？",
        "translation": "\"Why isn't there a fully explained meaning in the sūtras?",
        "source": "T11n0316_035:0874a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂所說文，如其所說廣大了知，此說是為不了義經。",
        "translation": "This is called a sūtra that doesn't understand the meaning of the text as it's explained and is vastly comprehensible.",
        "source": "T11n0316_035:0874a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何了義經？",
        "translation": "What is the fully explained meaning of a sutra?",
        "source": "T11n0316_035:0874a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂所說義，如其所說廣大通達，此說是為了義經。",
        "translation": "This is called a fully explained sūtra that explains the meaning as it is explained in detail and in great comprehension.",
        "source": "T11n0316_035:0874a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又說隨順補特伽羅無能出離，是不了義。",
        "translation": "It's also said that following the tutelary teachings can't lead to escape, which is not the full meaning.",
        "source": "T11n0316_035:0874a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如所說法即能出離，是為了義。",
        "translation": "Teaching that it's possible to escape just as it is taught is the fully understood meaning.",
        "source": "T11n0316_035:0874a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩於勝慧波羅蜜多之行得隨順善巧。",
        "translation": "Thus, the bodhisattva Mahāsattva attains the skillfulness of following the practice of the perfection of wisdom.",
        "source": "T11n0316_035:0874a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩文句善巧？",
        "translation": "\"What is the skillfulness of the bodhisattva's explanation of words?",
        "source": "T11n0316_035:0874a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩於此二法，善能修行勝慧波羅蜜多。",
        "translation": "These are the two things in which bodhisattvas well cultivate the perfection of wisdom.",
        "source": "T11n0316_035:0874a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何二法？",
        "translation": "What are these two things?",
        "source": "T11n0316_035:0874a22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者善識，二者善智。",
        "translation": "One is good consciousness, and the other is good knowledge.",
        "source": "T11n0316_035:0874a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為識？",
        "translation": "What's consciousness?",
        "source": "T11n0316_035:0874a22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依四種住。",
        "translation": "\"It relies on four kinds of abodes.",
        "source": "T11n0316_035:0874a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T11n0316_035:0874a23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者識依色住，二者識依受住，三者識依想住，四者識依行住，此說為識。",
        "translation": "One is the abode of consciousness depending on form, two is the abode of consciousness depending on sensation, three is the abode of consciousness depending on perception, and four is the abode of consciousness depending on volition, which is described as consciousness.",
        "source": "T11n0316_035:0874a23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為智？",
        "translation": "What's cognition?",
        "source": "T11n0316_035:0874a25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若了知所取五蘊，此說為智。",
        "translation": "\"If someone knows the five aggregates that are apprehended, this is called cognition.",
        "source": "T11n0316_035:0874a25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若了知地界水界火界風界，此說為識。",
        "translation": "Also, if someone knows the element of earth, element of water, element of fire, and element of wind, this is called consciousness.",
        "source": "T11n0316_035:0874a26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復安住四種法界，於其法界善能分別，此說為智。",
        "translation": "If someone also abides calmly in the four reality realms and is able to skillfully discern between them, this is called cognition.",
        "source": "T11n0316_035:0874a27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T11n0316_035:0874a28_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說於識，謂眼觀色為表，耳聞聲為表，鼻嗅香為表，舌了味為表，身覺觸為表，意知法為表，此說為識。",
        "translation": "\"Furthermore, when it comes to consciousness, the eye observes form as an expression, the ear hears sound as an expression, the nose smells fragrance as an expression, the tongue perceives taste as an expression, the body feels touch as an expression, and the mind knows things as an expression, which is called consciousness.",
        "source": "T11n0316_035:0874a28_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復內身寂靜外無遍行，智能隨順法無所取，此說為智。",
        "translation": "If there's also quiescence in the internal body and no pervasive activity outside, and intelligence follows principles without grasping them, this is called cognition.",
        "source": "T11n0316_035:0874b01_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若發起遍計執取，此說為識。",
        "translation": "If he gives rise to the pervasive clinging and grasping, this is called consciousness.",
        "source": "T11n0316_035:0874b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無執無取及表無瞋，此說為智。",
        "translation": "When there's no attachment, no grasping, and no expression of anger, this is called cognition.",
        "source": "T11n0316_035:0874b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復了知識住生滅有為行法，此說為識。",
        "translation": "Furthermore, when he understands that knowledge abides in arising and ceasing existent formations, this is called consciousness.",
        "source": "T11n0316_035:0874b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無為無有識遍行故，又智無為不住生滅，此說為智。",
        "translation": "Because there's no being and no consciousness that pervades conditioned phenomena, and because knowledge and nonbeing don't abide in arising and ceasing, this is called cognition.",
        "source": "T11n0316_035:0874b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何了義不了義經？",
        "translation": "\"What's a sutra that fully understands the meaning but doesn't understand the meaning?",
        "source": "T11n0316_035:0874b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若所說引趣於道，是不了義。",
        "translation": "If what's being taught leads to the path, it's not the meaning.",
        "source": "T11n0316_035:0874b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引趣於果，是為了義。",
        "translation": "If it leads to the result, this is the fully understood meaning.",
        "source": "T11n0316_035:0874b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說世俗行，是不了義。",
        "translation": "To teach worldly practices is incompletely explained.",
        "source": "T11n0316_035:0874b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宣說勝義，是為了義。",
        "translation": "To explain its ultimate goal is to fully understand its meaning.",
        "source": "T11n0316_035:0874b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引趣業行，是不了義。",
        "translation": "To be led to karmic action is incompletely explained.",
        "source": "T11n0316_035:0874b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盡業煩惱，是為了義。",
        "translation": "To exhaust the afflictions of karma is to fully understand their meaning.",
        "source": "T11n0316_035:0874b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復染分，是不了義。",
        "translation": "It's also the part that's defiled, which doesn't make sense.",
        "source": "T11n0316_035:0874b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說淨分，是為了義。",
        "translation": "If he explains the purifying aspect, this is the fully understood meaning.",
        "source": "T11n0316_035:0874b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼輪回而作厭離，是不了義。",
        "translation": "To become disillusioned with those rebirths doesn't make sense.",
        "source": "T11n0316_035:0874b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於輪回涅盤悟不二法，是為了義。",
        "translation": "To realize the principle of nonduality in the cycle of rebirth and nirvāṇa is to fully understand its meaning.",
        "source": "T11n0316_035:0874b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善巧文句，是不了義。",
        "translation": "To skillfully explain a phrase doesn't make sense.",
        "source": "T11n0316_035:0874b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深難解，是為了義。",
        "translation": "To be extremely difficult to understand is to fully understand the meaning.",
        "source": "T11n0316_035:0874b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸文句心喜樂欲，是不了義。",
        "translation": "Delighting in and desiring these texts and phrases is incomprehensible.",
        "source": "T11n0316_035:0874b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於少文句而生決定，是為了義。",
        "translation": "To become certain about a few words and phrases is to fully understand their meaning.",
        "source": "T11n0316_035:0874b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復我人士夫命者、意生儒童作者受者，種種語言，或有主宰及無主宰，是不了義。",
        "translation": "Furthermore, I'm a human being whose life, mind is born, a child, a writer, a recipient, and various languages may have a subject or no subject, which doesn't make sense.",
        "source": "T11n0316_035:0874b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於空無相無願三解脫門，不起我人士夫乃至補特伽羅，是為了義。",
        "translation": "In the gate of the three liberations of emptiness, signlessness, and wishlessness, it doesn't arise from self, human beings, or even the pudgala, which is the full understanding of the meaning.",
        "source": "T11n0316_035:0874b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何補特伽羅及法？",
        "translation": "What are pudgala and dharmas?",
        "source": "T11n0316_035:0874b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若於所有法安住補特伽羅見，由起彼見而復安住法智法界，此說是為補特伽羅及法。",
        "translation": "\"If someone abides in the view of pudgala with respect to all dharmas and further abides in the Dharma-realm of Dharma knowledge because of the arising of that view, this is said to be pudgala and dharma.",
        "source": "T11n0316_035:0874b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復補特伽羅者，謂異生補特伽羅、善異生補特伽羅、順信補特伽羅、順法補特伽羅、八輩補特伽羅、入流補特伽羅、一來補特伽羅、不還補特伽羅、應供補特伽羅、緣覺補特伽羅、菩薩補特伽羅。",
        "translation": "Further, the term \"furthermore,\" refers to an unborn person, a good unborn person, a faithful person, a faithful person, a faithful person, an eight-people person, a stream-entering person, a once-returner person, a nonreturner person, a worshipful person, a pratyekabuddha person, and a bodhisattva person.",
        "source": "T11n0316_035:0874b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一補特伽羅出現世間，猶能引生多種妙樂，於彼世間天人眾會極深憐慜作諸善利。",
        "translation": "If a single patriarch were to appear in the world, it would still be able to give rise to many wonderful pleasures and create good benefits for the profound compassion of gods and humans who meet in that world.",
        "source": "T11n0316_035:0874b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況如來、應供、正等正覺安住世俗，為一切補特伽羅，令諸有情依如來所說音聲入解義利。",
        "translation": "How much more so when the Tathāgata, Worthy of Offerings, and Completely Awakened One abide in the secular world and cause sentient beings to rely on the sounds and voices taught by the Tathāgata to enter into understanding and benefit.",
        "source": "T11n0316_035:0874b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言此說是為於法，各各隨順，樂欲引趣有情於義安住。",
        "translation": "The Buddha says that this teaching is a teaching that each conforms to the Dharma and is intended to lead sentient beings to abide in its meaning.",
        "source": "T11n0316_035:0874b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名法？",
        "translation": "What's called a dharma?",
        "source": "T11n0316_035:0874c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂無作無不作、無住無不住，於一切處本自平等悉同依止。",
        "translation": "It's called neither made, nor unmade, neither abiding, nor non-abiding, and all places are inherently equal and all rely on the same basis.",
        "source": "T11n0316_035:0874c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸法相自性本空，無有平等及不平等，離諸分別無所攀緣，而皆出離。",
        "translation": "Furthermore, all dharmas are inherently empty in nature, lacking equality and inequality, and free of discrimination and unattached attachments, they all escape.",
        "source": "T11n0316_035:0874c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說於其法性能隨順行得無退轉，是故於此正理法門而得入解一切法性。",
        "translation": "It's said that their Dharma nature can be approached and practiced without turning back, so through this correct principle and Dharma teaching, one can enter into the understanding of all Dharma natures.",
        "source": "T11n0316_035:0874c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說是為菩薩摩訶薩於勝慧波羅蜜多而得成就四種隨順善巧。",
        "translation": "This is said to be the four ways in which the bodhisattva Mahāsattva accomplishes the perfection of excellent wisdom and the skillful means of following it.",
        "source": "T11n0316_035:0874c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩福智善巧？",
        "translation": "\"What are the bodhisattva's skillful means of merit and wisdom?",
        "source": "T11n0316_035:0874c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩行門有其二種。",
        "translation": "There are two kinds of bodhisattva practices.",
        "source": "T11n0316_035:0874c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are the two?",
        "source": "T11n0316_035:0874c09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者福行，二者智行。",
        "translation": "One is the practice of merit, and the other is the practice of wisdom.",
        "source": "T11n0316_035:0874c09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何福行？",
        "translation": "What are the practices of merit?",
        "source": "T11n0316_035:0874c09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂布施福行、持戒福行、修觀福行。",
        "translation": "They are the meritorious practice of generosity, the meritorious practice of observing precepts, and the meritorious practice of cultivating contemplation.",
        "source": "T11n0316_035:0874c10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住等慈心大悲相應，令諸有情悔諸過咎，普令發起一切善根。",
        "translation": "These practices are associated with great compassion in a compassionate mind, cause sentient beings to repent of their faults, and universally cause them to develop all good roots.",
        "source": "T11n0316_035:0874c10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第三十五",
        "translation": "Foshuo dasheng pusa zangzheng fa jing, vol. 35",
        "source": "T11n0316_035:0874c13_0",
        "is_bad_quality": false
    }
]