[
    {
        "source_sentence": "大般涅槃經卷第二十三",
        "translation": "Mahāparinirvāṇa-sūtra, Volume 23",
        "source": "T12n0375_023:0754b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋代沙門慧嚴等依泥洹經加之",
        "translation": "Song Dynasty śramaṇa Huiyan and others added it based on the Nirvana Sutra",
        "source": "T12n0375_023:0754b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光明遍照高貴德王菩薩品之五",
        "translation": "V. Chapter Five of the Bodhisattva King of Noble Virtue, Whose Luminosity Is Universally Shining",
        "source": "T12n0375_023:0754b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0754b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩修大涅槃微妙經典具足成就第七功德？",
        "translation": "How does the bodhisattva Mahāsattva's cultivation of the subtle scripture of great nirvāṇa fully accomplish the seventh virtue?",
        "source": "T12n0375_023:0754b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0754b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃微妙經典，作是思惟：『何法能為大般涅槃而作近因？』",
        "translation": "The bodhisattva Mahāsattva cultivates the subtle scripture of great nirvāṇa and thinks, 'What can be a proximate cause of great extinction?'",
        "source": "T12n0375_023:0754b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即知有四種法為大涅槃而作近因。",
        "translation": "That's when a bodhisattva knows that there are four things that are the proximate causes of great nirvāṇa.",
        "source": "T12n0375_023:0754b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『勤修一切苦行是大涅槃近因緣。』",
        "translation": "If someone says, 'The diligent cultivation of all ascetic practices is a proximate cause and condition of great nirvāṇa,'",
        "source": "T12n0375_023:0754b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，是義不然。",
        "translation": "This doesn't make sense.",
        "source": "T12n0375_023:0754b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0754b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離四法得涅槃者，無有是處。",
        "translation": "If someone parts with these four things and attains nirvāṇa, there's no place for them.",
        "source": "T12n0375_023:0754b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為四？",
        "translation": "\"What are the four?",
        "source": "T12n0375_023:0754b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、親近善友，二者、專心聽法，三者、繫念思惟，四者、如法修行。",
        "translation": "1) become close to good friends, 2) concentrate your mind on listening to the teaching, 3) fix your thoughts on it, and 4) practice it according to the teaching.",
        "source": "T12n0375_023:0754b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0754b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人身遇眾病——若熱、若冷、虛勞、下瘧、眾邪、鬼毒——到良醫所，良醫即為隨病說藥。",
        "translation": "Suppose a person experiences a variety of illnesses -- whether fever, cold, fatigue, diarrhea, numerous evils, or demonic poison -- and goes to a good doctor who will prescribe medicine for them as they get sick.",
        "source": "T12n0375_023:0754b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人至心善受醫教，隨教合藥，如法服之。",
        "translation": "That person wholeheartedly and well accepts the doctor's teaching, combining the medicine according to that teaching and taking it according to the teaching.",
        "source": "T12n0375_023:0754b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "服已病愈，身得安樂。",
        "translation": "After taking it, he's cured of his illness and attains physical well-being.",
        "source": "T12n0375_023:0754b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有病之人，譬諸菩薩；大良醫者，譬善知識；良醫所說，譬方等經；善受醫教，譬善思惟方等經義；隨教合藥，譬如法修行三十七助道之法；病除愈者，譬滅煩惱；得安樂者，喻得涅槃，常、樂、我、淨。",
        "translation": "That person who's sick is like the bodhisattvas, and that person's great doctor is like a good teacher; what the good doctor teaches is like the vaipulya sūtras; that person's well-acquired medical teaching is like skillfully contemplating the meaning of the vaipulya sūtras; that person combines the medicine according to the teaching is like cultivating the thirty-seven factors that aid in the path according to the teaching; that person's healed is like the cessation of affliction; and that person's attainment of well-being is like attaining nirvāṇa, which is permanence, bliss, self, and purity.",
        "source": "T12n0375_023:0754b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0754b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有王欲如法治，令民安樂，諮諸智臣其法云何？",
        "translation": "Suppose there's a king who wants to rule accordingly and make his people happy, and he consults wise ministers about the teaching.",
        "source": "T12n0375_023:0754b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣即以先王舊法而為說之。",
        "translation": "The ministers then explained it to him using the previous king's old teaching.",
        "source": "T12n0375_023:0754b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王既聞已，至心信行，如法治國，無諸怨敵，是故令民安樂無患。",
        "translation": "After hearing it, the king wholeheartedly believed and practiced it, thus ruling the country as it was, without enmity, and causing the people to be comfortable and without danger.",
        "source": "T12n0375_023:0754b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0754c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王者，譬諸菩薩；諸智臣者，譬善知識；智臣為王所說治法，譬十二部經；王既聞已，至心信行，譬諸菩薩繫心思惟十二部經所有深義；如法治國，譬諸菩薩如法修行——所謂六波羅蜜——以能修習六波羅蜜故，無諸怨敵，譬諸菩薩已離諸結、煩惱惡賊；得安樂者，譬諸菩薩得大涅槃，常、樂、我、淨。",
        "translation": "\"The king, it means the bodhisattvas; the ministers of wisdom, it means good teachers; the ministers of wisdom who taught the king the way to heal, it means the twelve sutras; the king, having heard it, wholeheartedly believed and practiced it, it means the bodhisattvas focused their minds on contemplating all the profound meanings of the twelve sutras; the state is ruled according to law, it means the bodhisattvas cultivate the teaching according to law - the so-called six perfections - and because they can cultivate the six perfections, they have no enemies, it means the bodhisattvas have parted with the bonds and the bad thieves of affliction; and those who attain well-being, it means the bodhisattvas have attained great nirvāṇa, which is permanence, bliss, self, and purity.",
        "source": "T12n0375_023:0754c01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0754c08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人遇惡癩病，有善知識而語之言：『汝若能到須彌山邊，病可得差。",
        "translation": "Suppose a person experiences a bad scabies and a good teacher tells them, 'If you could go to the edge of Mount Sumeru, your illness would be healed.'",
        "source": "T12n0375_023:0754c08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0754c10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有良藥，味如甘露，若能服者，病無不愈。』",
        "translation": "There's a good medicine there that tastes like ambrosia; if he can take it, his illness won't go away.'",
        "source": "T12n0375_023:0754c10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人至心信是事已，即往彼山採服甘露，其病除愈，身得安樂。",
        "translation": "After that person wholeheartedly believes this, he goes to that mountain to gather the nectar, and his illness is healed, and he attains physical well-being.",
        "source": "T12n0375_023:0754c11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡癩病者，譬諸凡夫；善知識者，譬諸菩薩摩訶薩等；至心信受，譬四無量心；須彌山者，譬八聖道；甘露味者，譬於佛性；癩病除愈，譬滅煩惱；得安樂者，譬得涅槃，常、樂、我、淨。",
        "translation": "That person's malignant leprosy is likened to ordinary people; that person's good teacher is likened to bodhisattvas, mahāsattvas, and so forth; that person's whole-hearted faith in accepting it is likened to the four immeasurable states of mind; that person's Mount Sumeru is likened to the eight noble path; that person's taste of ambrosia is likened to the buddha-nature; that person's healed from leprosy is likened to the cessation of affliction; and that person's attainment of well-being is likened to the attainment of nirvāṇa, which is permanence, bliss, self, and purity.",
        "source": "T12n0375_023:0754c13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0754c17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人畜諸弟子聰明大智，是人晝夜常教不惓。",
        "translation": "\"It's like a person who has disciples who are intelligent and have great wisdom, and that person always teaches them day and night without tire.",
        "source": "T12n0375_023:0754c17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩等亦復如是，一切眾生——有信、不信——而常教化，無有疲厭。",
        "translation": "So too, bodhisattvas and others always teach and instruct all sentient beings - believing and non-believing - without tiring.",
        "source": "T12n0375_023:0754c18_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0754c20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者，所謂佛、菩薩、辟支佛、聲聞、人中信方等者。",
        "translation": "\"A good teacher is someone who's a Buddha, a bodhisattva, a pratyekabuddha, a direct disciple, or a human being who believes in people in many directions.",
        "source": "T12n0375_023:0754c20_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名為善知識耶？",
        "translation": "What's called a good teacher?",
        "source": "T12n0375_023:0754c21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者，能教眾生遠離十惡、修行十善。",
        "translation": "\"A good teacher is someone who can teach sentient beings to avoid the ten bad qualities and cultivate the ten good qualities.",
        "source": "T12n0375_023:0754c21_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "Because of this meaning, he's called a good teacher.",
        "source": "T12n0375_023:0754c22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善知識者，如法而說，如說而行。",
        "translation": "\"Furthermore, a good teacher explains things according to the teaching and practices them according to the teaching.",
        "source": "T12n0375_023:0754c23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為如法而說，如說而行？",
        "translation": "What do they call teaching according to the teaching and practicing according to the teaching?",
        "source": "T12n0375_023:0754c24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自不殺生，教人不殺，乃至自行正見，教人正見。",
        "translation": "He doesn't kill himself and teaches others not to kill, and he even conducts his own right view and teaches others to conduct right views.",
        "source": "T12n0375_023:0754c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是，則得名為真善知識。",
        "translation": "If they can do this, then they'll be called a truly good teacher.",
        "source": "T12n0375_023:0754c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自修菩提，亦能教人修行菩提。",
        "translation": "He cultivates enlightenment himself and can teach others to cultivate enlightenment.",
        "source": "T12n0375_023:0754c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "Because of this, he's called a good teacher.",
        "source": "T12n0375_023:0754c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自能修行信、戒、布施、多聞、智慧，亦能教人信、戒、布施、多聞、智慧。",
        "translation": "He himself cultivates faith, discipline, generosity, learning, and wisdom, and he can teach others faith, discipline, generosity, learning, and wisdom.",
        "source": "T12n0375_023:0754c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以是義，名善知識。",
        "translation": "Also, for this reason, he's called a good teacher.",
        "source": "T12n0375_023:0754c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善知識者，有善法故。",
        "translation": "\"A good teacher is someone who has good qualities.",
        "source": "T12n0375_023:0755a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等善法？",
        "translation": "What's a good dharma?",
        "source": "T12n0375_023:0755a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所作之事不求自樂，常為眾生而求安樂；見他有過不說其短，口常宣說純善之事。",
        "translation": "They don't seek their own happiness in what they do, but always seek the well-being of sentient beings; they see the faults of others and don't speak of their shortcomings, and they always proclaim purely wholesome things with their mouths.",
        "source": "T12n0375_023:0755a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "Because of this, he's called a good teacher.",
        "source": "T12n0375_023:0755a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如空中月，從初一日至十五日漸漸增長。",
        "translation": "\"Like the moon in the sky, it gradually grows from the first day to the fifteenth day.",
        "source": "T12n0375_023:0755a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者亦復如是，令諸學人漸遠惡法、增長善法。",
        "translation": "So too, a good teacher causes trainees to gradually distance themselves from bad qualities and increase good qualities.",
        "source": "T12n0375_023:0755a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有親近善知識者，本未有戒、定、慧、解脫、解脫知見即便有之，未具足者則得增廣。",
        "translation": "If someone approaches a good teacher, then even if they previously didn't have precepts, concentration, wisdom, liberation, or the knowledge and vision of liberation, they'll have them, and those who don't have them will have them increased.",
        "source": "T12n0375_023:0755a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0755a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以其親近善知識故。",
        "translation": "It's because they've become close to a good teacher.",
        "source": "T12n0375_023:0755a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因是親近，復得了達十二部經甚深之義。",
        "translation": "Because of this closeness, they'll also come to understand the profound meaning of the 12 sūtras.",
        "source": "T12n0375_023:0755a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能聽是十二部經甚深義者，名為聽法。",
        "translation": "If someone can listen to the profound meaning of these 12 sūtras, they're called someone who listens to the teaching.",
        "source": "T12n0375_023:0755a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「聽法者則是大乘方等經典，聽方等經名真聽法，真聽法者即是聽受《大涅槃經》。",
        "translation": "\"Someone who listens to the Dharma is a great vehicle scripture of the vaipulya classics, and listening to a scripture of the vaipulya classics is called truly listening to the Dharma, and truly listening to the Dharma is listening to and accepting the Mahāparinirvāṇa-sūtra.",
        "source": "T12n0375_023:0755a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《大涅槃》中聞有佛性、如來畢竟不般涅槃，是故名為專心聽法。",
        "translation": "In the Mahāparinirvāṇa Sutra, we hear that there's a buddha-nature and that the tathāgata is ultimately not parinirvāṇa, so this is called concentrating on listening to the teaching.",
        "source": "T12n0375_023:0755a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「專心聽法名八聖道，以八聖道能斷貪欲、瞋恚、愚癡，故名聽法。",
        "translation": "\"Concentrating on listening to the Dharma is called the eight noble paths, which are called listening to the Dharma because they can stop craving, anger, and foolishness.",
        "source": "T12n0375_023:0755a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「夫聽法者名十一空，以此諸空於一切法不作相貌。",
        "translation": "\"Whoever listens to the teaching is called the eleven kinds of emptiness, because these kinds of emptiness don't make appearances in all dharmas.",
        "source": "T12n0375_023:0755a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「夫聽法者，名初發心乃至究竟阿耨多羅三藐三菩提心，以因初心得大涅槃、不以聞故得大涅槃、以修習故得大涅槃。",
        "translation": "\"That person who listens to the teaching is called someone who first arouses the mind ... the ultimate anuttarasamyak-saṃbodhicitta mind because it's the result of first attaining great nirvāṇa, not because of hearing, and because of cultivating it.",
        "source": "T12n0375_023:0755a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如病人，雖聞醫教及藥名字不能愈病，要以服故乃得除差。",
        "translation": "\"It's like a sick person who can't be cured of an illness even though they've heard the doctor's teaching and the names of medicines, but only because they take them can they be freed from it.",
        "source": "T12n0375_023:0755a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖聽十二深因緣法不能斷滅一切煩惱，要以繫念善思惟故能得除斷，是名第三繫念思惟。",
        "translation": "Even though listening to 12 profound causes and conditions doesn't stop all afflictions, it's because of mindfulness and skillful contemplation that they can be stopped, which is called the third type of mindful contemplation.",
        "source": "T12n0375_023:0755a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復以何義名繫念思惟？",
        "translation": "\"Again, what does this mean to be mindful of contemplation?",
        "source": "T12n0375_023:0755a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂三三昧：空三昧、無相三昧、無作三昧。",
        "translation": "There are three so-called samādhis: samādhi of emptiness, samādhi of signlessness, and samādhi of noncontrivance.",
        "source": "T12n0375_023:0755a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空者，於二十五有不見一實；無作者，於二十五有不作願求；無相者，無有十相，所謂色相、聲相、香相、味相、觸相、生相、住相、滅相、男相、女相。",
        "translation": "Being empty, he doesn't see a single reality in 25 existences; being without author, he doesn't make aspirations in 25 existences; and being without marks, he doesn't have the 10 marks, which are called form, sound, odor, taste, touch, birth, abiding, cessation, male form, and female form.",
        "source": "T12n0375_023:0755a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修習如是三三昧者，是名菩薩繫念思惟。",
        "translation": "Someone who cultivates these three samādhis is called a bodhisattva who is fixated on contemplation.",
        "source": "T12n0375_023:0755a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為如法修行？",
        "translation": "\"What's called practicing according to the teaching?",
        "source": "T12n0375_023:0755b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如法修行即是修行檀波羅蜜乃至般若波羅蜜，知陰、入、界真實之相，亦知聲聞、緣覺、諸佛同於一道而般涅槃。",
        "translation": "To practice according to the teaching is to practice the perfection of giving and even the perfection of wisdom, knowing the true characteristics of aggregates, aggregates, and elements, and knowing that śrāvakas, pratyekbuddhas, and buddhas are all in the same unity and attain parinirvāṇa.",
        "source": "T12n0375_023:0755b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法者，即是常、樂、我、淨，不生、不老、不病、不死，不飢、不渴，不苦、不惱，不退、不沒。",
        "translation": "That dharma is permanence, bliss, self, and purity, not arising, not growing old, not getting sick, not dying, not starving, not thirsting, not suffering, not afflicting, and not regressing or falling apart.",
        "source": "T12n0375_023:0755b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0755b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解《大涅槃》甚深義者，則知諸佛終不畢竟入於涅槃。",
        "translation": "Those who understand the profundity of the Mahāparinirvāṇa will know that the buddhas never enter nirvāṇa after all.",
        "source": "T12n0375_023:0755b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一真實善知識者，所謂菩薩、諸佛世尊。",
        "translation": "\"The first true good friend is a bodhisattva, a world-honored one who is a Buddha.",
        "source": "T12n0375_023:0755b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0755b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常以三種善調御故。",
        "translation": "\"It's because they're always well-regulated in three ways.",
        "source": "T12n0375_023:0755b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T12n0375_023:0755b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、畢竟軟語，二者、畢竟呵責，三者、軟語呵責。",
        "translation": "One, they speak softly after all, two, they rebuke after all, and three, they rebuke softly.",
        "source": "T12n0375_023:0755b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，菩薩、諸佛即是真實善知識也。",
        "translation": "Because of this, bodhisattvas and buddhas are truly good teachers.",
        "source": "T12n0375_023:0755b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0755b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛及菩薩為大醫，故名善知識。",
        "translation": "The buddhas and bodhisattvas are great doctors, so they're called good teachers.",
        "source": "T12n0375_023:0755b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0755b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知病、知藥，應病授藥，故譬如良醫。",
        "translation": "He knows the disease and knows the medicine, and he gives the medicine in response to the disease, so he's like a good doctor.",
        "source": "T12n0375_023:0755b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善八種術，先觀病相。",
        "translation": "He's good at eight techniques, starting with observing the signs of illness.",
        "source": "T12n0375_023:0755b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相有三種。",
        "translation": "There are three kinds of signs.",
        "source": "T12n0375_023:0755b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T12n0375_023:0755b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂風、熱、水。",
        "translation": "It's called wind, fever, and water.",
        "source": "T12n0375_023:0755b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有風病者，授之酥油；熱病之人授之石蜜；水病之人授之薑湯。",
        "translation": "Those with wind trouble are given ghee, those with fever trouble are given rock honey, and those with water trouble are given ginger ale.",
        "source": "T12n0375_023:0755b16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以知病根，授藥得差，故名良醫。",
        "translation": "Because they know the root of the illness and can administer the right medicine, they're called good doctors.",
        "source": "T12n0375_023:0755b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛及菩薩亦復如是，知諸凡夫病有三種：一者、貪欲，二者、瞋恚，三者、愚癡。",
        "translation": "In the same way, the Buddha and the bodhisattvas know that there are three kinds of illnesses in mortal existence: one, desire, two, anger, and three, foolishness.",
        "source": "T12n0375_023:0755b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪欲病者，教觀骨相；瞋恚病者，觀慈悲相；愚癡病者，觀十二緣相。",
        "translation": "Those who are sick with desire are taught to observe the characteristic of bones; those who are sick with anger are taught to observe the characteristic of compassion; and those who are sick with delusion are taught to observe the twelve perceptual attributes.",
        "source": "T12n0375_023:0755b20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，諸佛、菩薩名善知識。",
        "translation": "Because of this, the buddhas and bodhisattvas are called good teachers.",
        "source": "T12n0375_023:0755b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755b22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如船師，善渡人故，名大船師。",
        "translation": "\"It's like a shipmaster who's good at ferrying people, so he's called a great shipmaster.",
        "source": "T12n0375_023:0755b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、菩薩亦復如是，度諸眾生生死大海。",
        "translation": "In the same way, the buddhas and bodhisattvas also cross the ocean of birth and death for all sentient beings.",
        "source": "T12n0375_023:0755b23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "For this reason, they're called good teachers.",
        "source": "T12n0375_023:0755b24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0755b25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因佛、菩薩令諸眾生具足修得善法根故。",
        "translation": "It's because the buddhas and bodhisattvas cause sentient beings to fully cultivate the roots of good qualities.",
        "source": "T12n0375_023:0755b25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755b26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如雪山乃是種種微妙上藥根本之處。",
        "translation": "\"It's like the snowy mountains that are the base of all the marvelous and superior medicines.",
        "source": "T12n0375_023:0755b26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛及菩薩亦復如是，悉是一切善根本處。",
        "translation": "So too are the buddhas and bodhisattvas, which are the fundamental locations of all goodness.",
        "source": "T12n0375_023:0755b27_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "For this reason, they're called good teachers.",
        "source": "T12n0375_023:0755b28_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755b29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雪山之中有上香藥名曰娑呵，有人見之得壽無量、無有病苦，雖有四毒不能中傷；若有觸者，增長壽命滿百二十；若有念者，得宿命智。",
        "translation": "There's a wonderful scent medicine called sahā in the snowy mountains that gives a person a limitless life span and no illness or pain, even though the four poisons can't harm them; if they touch it, their life expectancy will increase by 120 years; and if they think about it, they'll attain knowledge of past lives.",
        "source": "T12n0375_023:0755b29_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0755c03_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥勢力故。",
        "translation": "\"It's because of the power of medicine.",
        "source": "T12n0375_023:0755c03_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、菩薩亦復如是，若有見者，即得斷除一切煩惱，雖有四魔不能干亂；若有觸者，命不可夭，不生、不死，不退、不沒——所謂觸者，若在佛邊聽受妙法——若有念者，得阿耨多羅三藐三菩提。",
        "translation": "So it is with the buddhas and bodhisattvas, for if they see them, they'll be freed from all afflictions, even though the four demons can't interfere; if they touch them, their lives won't be cut short, they won't be born or die, they won't regress or fall - so-called touchers, if they're near a buddha and listen to the wonderful Dharma - and if they're mindful, they'll attain supreme, perfect enlightenment.",
        "source": "T12n0375_023:0755c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，諸佛、菩薩名善知識。",
        "translation": "For this reason, the buddhas and bodhisattvas are called good teachers.",
        "source": "T12n0375_023:0755c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如香山中有阿耨達池，由是池故，有四大河，所謂恒河、辛頭、私陀、博叉。",
        "translation": "On Mount Gandhāra, there's the Anavatapta Lake, and from that lake there are four large rivers called the Ganges, Ganges, Ganges, Ganges, Ganges, and Ganges.",
        "source": "T12n0375_023:0755c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間眾生常作是言：『若有罪者，浴此四河，眾罪得滅。』",
        "translation": "Often, sentient beings in the world say, 'If you're guilty, take a bath in these four rivers, and your sins will be stopped.'",
        "source": "T12n0375_023:0755c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此言虛妄不實。",
        "translation": "You should know that this talk is false and untrue.",
        "source": "T12n0375_023:0755c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除此已往，何等為實？",
        "translation": "After this, what's real?'",
        "source": "T12n0375_023:0755c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、菩薩是乃為實。",
        "translation": "\"These buddhas and bodhisattvas are real.",
        "source": "T12n0375_023:0755c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0755c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人親近，則得滅除一切眾罪。",
        "translation": "If someone approaches them, they'll be able to eradicate all sins.",
        "source": "T12n0375_023:0755c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "For this reason, he's called a good teacher.",
        "source": "T12n0375_023:0755c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0755c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大地，所有藥木、一切叢林、百穀、甘蔗、花菓之屬，值天炎旱將欲枯死，難陀龍王及婆難陀憐愍眾生，從大海出降澍甘雨，一切叢林、百穀、草木滋潤還生。",
        "translation": "It's like the great earth, where all the medicinal trees, all the groves, the hundred grains, the sugarcane, and the flowers and fruits are about to wither in the heat and drought of the gods, and when the Nandana-nāga-rāja and Pāṇḍaravādin have compassion on sentient beings, they send down a sweet rain from the ocean that nourishes all the groves, the hundred grains, and the grasses and trees and returns them to life.",
        "source": "T12n0375_023:0755c15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生亦復如是，所有善根將欲消滅，諸佛、菩薩生大慈悲，從智慧海降甘露雨，令諸眾生具足，還得十善之法。",
        "translation": "So it is with all sentient beings, whose good roots are about to perish, when the buddhas and bodhisattvas have great compassion and send down a sweet rain from the ocean of wisdom, making it possible for sentient beings to fully attain the ten good qualities again.",
        "source": "T12n0375_023:0755c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，諸佛、菩薩名善知識。",
        "translation": "For this reason, the buddhas and bodhisattvas are called good teachers.",
        "source": "T12n0375_023:0755c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0755c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如良醫善八種術，見諸病人，不觀種姓、端正、醜陋、錢財、寶貨，悉為治之，是故世稱為大良醫。",
        "translation": "Like a good doctor who's skilled in eight techniques and sees patients, he doesn't look at their caste, decency, ugliness, money, possessions, or valuables, but always treats them; therefore, he's called a great good doctor.",
        "source": "T12n0375_023:0755c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、菩薩亦復如是，見諸眾生有煩惱病，不觀種姓、端正、醜陋、錢財、寶貨，生慈愍心，悉為說法。",
        "translation": "So too, when the buddhas and bodhisattvas see that sentient beings are afflicted and sick, they don't look at their lineage, decency, ugliness, money, possessions, or treasures, but they become compassionate and teach them.",
        "source": "T12n0375_023:0755c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生聞已，煩惱病除。",
        "translation": "After the sentient beings hear this, their afflictive disorders are removed.",
        "source": "T12n0375_023:0755c27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，諸佛、菩薩名善知識。",
        "translation": "For this reason, the buddhas and bodhisattvas are called good friends.",
        "source": "T12n0375_023:0755c27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是親近善友因緣則得近於大般涅槃。",
        "translation": "Because of these causes and conditions of being close to a good friend, they can approach the great parinirvāṇa.",
        "source": "T12n0375_023:0755c28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩聽法因緣而得近於大般涅槃？",
        "translation": "\"How do the causes and conditions for a bodhisattva listening to the teaching bring him close to great parinirvāṇa?",
        "source": "T12n0375_023:0756a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生以聽法故則具信根，得信根故，樂行布施、戒、忍、精進、禪定、智慧，得須陀洹果乃至佛果。",
        "translation": "All sentient beings then possess the faculty of faith because they listen to the teaching, and because they attain the faculty of faith, they happily practice generosity, discipline, forbearance, effort, meditation, and wisdom, and attain the fruit of stream entry and even the fruit of Buddhahood.",
        "source": "T12n0375_023:0756a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知：得諸善法皆是聽法因緣勢力。",
        "translation": "Therefore, you should know that the attainment of good qualities is the result of the power of the causes and conditions for listening to the teaching.",
        "source": "T12n0375_023:0756a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0756a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如長者唯有一子，遣至他國市易所須，示其道路通塞之處，而復誡之：『若遇婬女，慎莫親愛。",
        "translation": "It's like an elder with only one son who goes to another country, markets what he needs, shows them where the roads are blocked, and admonishes them, 'If you meet a woman who's promiscuous, be careful not to get intimate with her.",
        "source": "T12n0375_023:0756a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若親愛者，喪身殞命及以財寶。",
        "translation": "If you do, you'll lose your life and property.",
        "source": "T12n0375_023:0756a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弊惡之人亦莫交遊。』",
        "translation": "Don't associate with a bad person, either.'",
        "source": "T12n0375_023:0756a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子敬順父之教勅，身心安隱，多獲寶貨。",
        "translation": "Respectfully obeying his father's instructions, his son was made secure in body and mind, and he often obtained valuable goods.",
        "source": "T12n0375_023:0756a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為諸眾生敷演法要亦復如是，示諸眾生及四部眾諸道通塞。",
        "translation": "So too does the bodhisattva Mahāsattva explain the essentials of the Dharma for sentient beings, showing them and the four groups of sentient beings that the path is well-versed.",
        "source": "T12n0375_023:0756a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾等以聞法故，遠離諸惡，具足善法。",
        "translation": "As a result of hearing the Dharma, these sentient beings are freed from evil and are supplied with good qualities.",
        "source": "T12n0375_023:0756a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this, the cause and conditions of hearing the Dharma will lead them to approach great parinirvāṇa.",
        "source": "T12n0375_023:0756a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0756a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如明鏡，照人面像無不明了。",
        "translation": "\"It's like a bright mirror that shines on a person's face, and there's nothing about it that isn't clearly understood.",
        "source": "T12n0375_023:0756a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽法明鏡亦復如是，有人照之則見善惡，明了無翳。",
        "translation": "So too is a mirror that heeds the teaching, and when someone illuminates it, they see good and evil with clarity and no obscuration.",
        "source": "T12n0375_023:0756a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this, the cause and conditions of listening to the teaching will bring one close to great parinirvāṇa.",
        "source": "T12n0375_023:0756a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0756a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如商人欲至寶渚，不知道路。",
        "translation": "It's like a merchant who wants to go to a jeweled islet but doesn't know the way.",
        "source": "T12n0375_023:0756a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人示之，其人隨語即至寶渚，多獲諸珍不可稱計。",
        "translation": "When someone shows him the way, he follows their words and arrives at the islet of treasures, acquiring an incalculable amount of treasures.",
        "source": "T12n0375_023:0756a17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生亦復如是，欲至善處採取道寶，不知其路通塞之相。",
        "translation": "All sentient beings are likewise, wanting to go to a good place to gather the treasures of the path, but they don't know the way through which it's blocked.",
        "source": "T12n0375_023:0756a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩示之，眾生隨已，得至善處獲得無上大涅槃寶。",
        "translation": "The bodhisattva shows them that sentient beings who follow him will reach a good place and obtain the unsurpassed great treasure of nirvāṇa.",
        "source": "T12n0375_023:0756a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this, the cause and conditions of listening to the teaching will bring them close to great parinirvāṇa.",
        "source": "T12n0375_023:0756a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0756a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如醉象，狂逸暴惡，多欲殺害。",
        "translation": "It's like a drunken elephant that's wild and violent and has a lot of desire to kill.",
        "source": "T12n0375_023:0756a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有調象師以大鐵鉤鉤斵其頂，即時調順，惡心都盡。",
        "translation": "An elephant trainer hooks and plucks its head with a large iron hook, immediately tames it, and all its bad thoughts are ended.",
        "source": "T12n0375_023:0756a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生亦復如是，貪欲、瞋恚、愚癡醉故，欲多造惡。",
        "translation": "All sentient beings are likewise, drunk with desire, anger, and foolishness, and they want to do lots of evil.",
        "source": "T12n0375_023:0756a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩等以聞法鉤斵之令住，更不得起造諸惡心。",
        "translation": "By hooking and tapping them with the teachings they hear, bodhisattvas are no longer allowed to generate bad thoughts.",
        "source": "T12n0375_023:0756a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this, the cause and conditions of listening to the Dharma will bring them close to the great parinirvāṇa.",
        "source": "T12n0375_023:0756a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故，我於處處經中說我弟子專心聽受十二部經則離五蓋、修七覺分。",
        "translation": "\"Therefore, I've said in various sūtras that when my disciples concentrate their minds on listening to and accepting 12 sūtras, they'll part with the five hindrances and cultivate the seven factors of awakening.",
        "source": "T12n0375_023:0756a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是修習七覺分故，則得近於大般涅槃。",
        "translation": "Because of this cultivation of the seven factors of awakening, then they'll attain near great parinirvāṇa.",
        "source": "T12n0375_023:0756b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以聽法故，須陀洹人離諸恐怖。",
        "translation": "\"As a result of listening to the teaching, a stream entrant is free of fear.",
        "source": "T12n0375_023:0756b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0756b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達長者身遭重病，心大愁怖，聞舍利弗說須陀洹有四功德、十種慰喻，聞是事已，恐怖即除。",
        "translation": "After hearing Śuddhâvāsa's explanation of the four virtues and ten comforting parables of stream entry, that man was seriously ill and greatly distressed when he heard this, and his fears were immediately removed.",
        "source": "T12n0375_023:0756b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this, the cause and conditions of listening to the teaching will bring him close to great parinirvāṇa.",
        "source": "T12n0375_023:0756b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0756b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開法眼故。",
        "translation": "\"It's because they've opened the Dharma eye.",
        "source": "T12n0375_023:0756b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世有三人：一者、無目，二者、一目，三者、二目。",
        "translation": "There are three people in the world: one who has no eyes, two who have one eye, and three who have two eyes.",
        "source": "T12n0375_023:0756b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無目者，常不聞法；一目之人，雖暫聞法，其心不住；二目之人專心聽受，如聞而行。",
        "translation": "They say the eyeless person always doesn't hear the teaching, the one-eyed person hears the teaching momentarily but doesn't stop his mind, and the two-eyed person focuses his mind on hearing and accepting it as he hears it.",
        "source": "T12n0375_023:0756b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以聽法故，得知世間如是三人。",
        "translation": "As a result of listening to the teaching, he learns that the world is like these three people.",
        "source": "T12n0375_023:0756b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this, the cause and conditions of listening to the teaching will bring them close to great parinirvāṇa.",
        "source": "T12n0375_023:0756b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0756b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我昔於拘尸那城，時舍利弗身遇病苦。",
        "translation": "It was like the time when I was in the city of Kuśinagara and Śāriputra was experiencing illness and suffering.",
        "source": "T12n0375_023:0756b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我時顧命阿難比丘廣為說法。",
        "translation": "I then instructed the monk Ānanda to teach the Dharma in detail.",
        "source": "T12n0375_023:0756b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗聞是事已，告四弟子：『汝舉我床往至佛所，我欲聽法。』",
        "translation": "After hearing this, Śāriputra addressed his four disciples, 'Lift my bed and take it to the Buddha's place, for I want to hear the teaching.'",
        "source": "T12n0375_023:0756b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時四弟子奉命舁往。",
        "translation": "The four disciples then were instructed to carry them there.",
        "source": "T12n0375_023:0756b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得聞法，聞法力故，所苦除差，身得安隱。",
        "translation": "Having heard the Dharma, and because of the power of hearing the Dharma, their sufferings were removed and their bodies were made comfortable.",
        "source": "T12n0375_023:0756b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this, the cause and conditions for listening to the Dharma will bring them close to great parinirvāṇa.",
        "source": "T12n0375_023:0756b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩思惟因緣而得近於大般涅槃？",
        "translation": "\"How does a bodhisattva contemplate the causes and conditions to attain nearness to great parinirvāṇa?",
        "source": "T12n0375_023:0756b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因是思惟，心得解脫。",
        "translation": "As a result of this reflection, their minds are liberated.",
        "source": "T12n0375_023:0756b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0756b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生常為五欲之所繫縛，以思惟故，悉得解脫。",
        "translation": "All sentient beings are constantly fettered by the five desires, and because of contemplation, they're all liberated.",
        "source": "T12n0375_023:0756b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this, contemplating the causes and conditions, one can approach great parinirvāṇa.",
        "source": "T12n0375_023:0756b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0756b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生常為常、樂、我、淨四法之所顛倒。",
        "translation": "\"All sentient beings are constantly confused by the four dharmas of permanence, happiness, self, and purity.",
        "source": "T12n0375_023:0756b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以思惟故，得見諸法無常、無樂、無我、無淨。",
        "translation": "As a result of contemplating them, they can see that all things are impermanent, unpleasing, selfless, and impure.",
        "source": "T12n0375_023:0756b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見已，四倒即斷。",
        "translation": "After thus seeing them, the four mistaken attachments are stopped.",
        "source": "T12n0375_023:0756b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this, contemplating the causes and conditions, it's possible to approach great parinirvāṇa.",
        "source": "T12n0375_023:0756b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0756b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法有四種相。",
        "translation": "\"All dharmas have four kinds of characteristics.",
        "source": "T12n0375_023:0756b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0375_023:0756b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、生相，二者、老相，三者、病相，四者、滅相。",
        "translation": "1. the characteristic of birth, 2. the characteristic of old age, 3. the characteristic of illness, and 4. the characteristic of cessation.",
        "source": "T12n0375_023:0756b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是四相，能令一切凡夫眾生至須陀洹生大苦惱。",
        "translation": "These four characteristics cause all ordinary sentient beings up to stream entry to experience great suffering and distress.",
        "source": "T12n0375_023:0756b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能繫念善思惟者，雖遇此四，不生眾苦。",
        "translation": "If someone can fix their thoughts and well contemplate them, these four encounters won't cause them to suffer.",
        "source": "T12n0375_023:0756b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this, contemplating the causes and conditions, they'll attain near great parinirvāṇa.",
        "source": "T12n0375_023:0756b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0756c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切善法無不因是思惟而得。",
        "translation": "\"There are no good qualities that don't result from this kind of contemplation.",
        "source": "T12n0375_023:0756c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0756c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人雖於無量無邊阿僧祇劫專心聽法，若不思惟，終不能得阿耨多羅三藐三菩提。",
        "translation": "Although someone focuses their mind on listening to the teaching for measureless and limitless incalculable eons, if they don't contemplate it, they'll never attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0375_023:0756c03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this, contemplating the causes and conditions brings them close to great parinirvāṇa.",
        "source": "T12n0375_023:0756c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0756c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生信佛、法、僧無有變易而生恭敬，當知皆是繫念思惟因緣力故，因得斷除一切煩惱。",
        "translation": "\"If sentient beings believe that the Buddha, Dharma, and Saṃgha are unchanging and become respectful, you should know that it's because of the power of fixing their thoughts on causes and conditions that they're able to end all afflictions.",
        "source": "T12n0375_023:0756c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this, contemplating the causes and conditions, one can approach great parinirvāṇa.",
        "source": "T12n0375_023:0756c08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩如法修行？",
        "translation": "\"How do bodhisattvas practice according to the teaching?",
        "source": "T12n0375_023:0756c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0756c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷諸惡法，修習善法，是名菩薩如法修行。",
        "translation": "Stopping bad qualities and cultivating good qualities is called a bodhisattva practicing according to the Dharma.",
        "source": "T12n0375_023:0756c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，云何如法修行？",
        "translation": "\"Furthermore, how do you cultivate the Dharma according to its teachings?",
        "source": "T12n0375_023:0756c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見一切法空無所有，無常、無樂、無我、無淨。",
        "translation": "They see that all things are empty and lacking in existence, and that they are impermanent, joyless, selfless, and impure.",
        "source": "T12n0375_023:0756c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是見故，寧捨身命不犯禁戒，是名菩薩如法修行。",
        "translation": "Because of this view, a person would rather sacrifice his life than violate the prohibited precepts, which is called a bodhisattva who practices according to the Dharma.",
        "source": "T12n0375_023:0756c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，云何如法修行？",
        "translation": "\"Furthermore, what is practicing according to the Dharma?",
        "source": "T12n0375_023:0756c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修有二種：一者、真實，二者、不實。",
        "translation": "There are two kinds of cultivation: one that's real and two that's unreal.",
        "source": "T12n0375_023:0756c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不實者，不知涅槃、佛性、如來、法、僧實相、虛空等相，是名不實。",
        "translation": "When someone doesn't know the true nature of nirvāṇa, the Buddha-nature, the Tathāgata, the Dharma, the real characteristics of the saṃgha, and space, this is called untrue.",
        "source": "T12n0375_023:0756c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何真實？",
        "translation": "What's real?",
        "source": "T12n0375_023:0756c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能知涅槃、佛性、如來、法、僧實相、虛空等相，是名真實。",
        "translation": "Being able to know the characteristics of nirvāṇa, Buddha-nature, the Tathāgata, the Dharma, the real characteristics of the saṃgha, and space is called real.",
        "source": "T12n0375_023:0756c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為知涅槃相？",
        "translation": "What's called knowing the characteristics of nirvāṇa?",
        "source": "T12n0375_023:0756c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃之相凡有八事。",
        "translation": "\"There are eight things that characterize nirvāṇa.",
        "source": "T12n0375_023:0756c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T12n0375_023:0756c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、盡，二、善性，三、實，四、真，五、常，六、樂，七、我，八、淨，是名涅槃。",
        "translation": "One, exhaustion, two, goodness, three, reality, four, truth, five, permanence, six, happiness, seven, self, and eight, purity, are called nirvāṇa.",
        "source": "T12n0375_023:0756c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八事。",
        "translation": "There are eight more things.",
        "source": "T12n0375_023:0756c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T12n0375_023:0756c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、解脫，二者、善性，三者、不實，四者、不真，五者、無常，六者、無樂，七者、無我，八者、無淨。",
        "translation": "The first is liberation, the second is goodness, the third is unreal, the fourth is untrue, the fifth is impermanent, the sixth is unpleasant, the seventh is without self, and the eighth is impure.",
        "source": "T12n0375_023:0756c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有六相：一者、解脫，二者、善性，三者、不實，四者、不真，五者、安樂，六者、清淨。",
        "translation": "There are also six characteristics: 1. liberation, 2. goodness, 3. insubstantiality, 4. untruthfulness, 5. well-being, and 6. purity.",
        "source": "T12n0375_023:0756c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生依世俗道斷煩惱者，如是涅槃則有八事解脫不實。",
        "translation": "If there are sentient beings who stop afflictions based on the conventional path, then such nirvāṇa has eight things that make liberation unreal.",
        "source": "T12n0375_023:0756c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0756c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不常故。",
        "translation": "It's because it's impermanent.",
        "source": "T12n0375_023:0756c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無常故，則無有實；無有實故，則無有真。",
        "translation": "Because it's impermanent, there's no reality, and because there's no reality, there's no truth.",
        "source": "T12n0375_023:0756c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖斷煩惱，以還起故，無常、無我、無樂、無淨。",
        "translation": "Even though the afflictions are stopped, they are impermanent, without self, without pleasure, and without purity because they are reborn.",
        "source": "T12n0375_023:0756c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名涅槃解脫八事。",
        "translation": "These are called the eight conditions of liberation from nirvāṇa.",
        "source": "T12n0375_023:0756c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何六相？",
        "translation": "\"What are the six characteristics?",
        "source": "T12n0375_023:0756c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、緣覺斷煩惱故，名為解脫；而未能得阿耨多羅三藐三菩提故，名為不實；以不實故，名為不真；未來之世當得阿耨多羅三藐三菩提，故名無常；以得無漏八聖道故，名為淨樂。",
        "translation": "It's called liberation because the afflictions of śrāvakas and pratyekbuddhas are ended, it's called insubstantial because they haven't attained the unsurpassed, it's called untrue because it's insubstantial, it's called impermanent because it'll attain the unsurpassed, samyak-saṃbodhi in a future life, and it's called pure bliss because it's possible to attain the uncontaminated eight noble paths.",
        "source": "T12n0375_023:0756c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0757a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是知，是知涅槃，不名佛性、如來、法、僧實相、虛空。",
        "translation": "If someone thus knows this, they know that nirvāṇa is not called the buddha-nature, tathāgata, dharmas, the real characteristics of saṃgha, or space.",
        "source": "T12n0375_023:0757a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩知於佛性？",
        "translation": "\"How do bodhisattvas know the buddha-nature?",
        "source": "T12n0375_023:0757a06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛性有六。",
        "translation": "\"There are six buddha-natures.",
        "source": "T12n0375_023:0757a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為六？",
        "translation": "What are the six?",
        "source": "T12n0375_023:0757a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、常，二、淨，三、實，四、善，五、當見，六、真。",
        "translation": "1. permanent, 2. pure, 3. real, 4. good, 5. to be seen, and 6. true.",
        "source": "T12n0375_023:0757a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有七事：一者、可證，餘六如上。",
        "translation": "There are seven more things: one, which can be realized, and the other six as above.",
        "source": "T12n0375_023:0757a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩知於佛性。",
        "translation": "This is called a bodhisattva knowing the buddha-nature.",
        "source": "T12n0375_023:0757a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩知如來相？",
        "translation": "\"How does a bodhisattva know the Tathāgata's characteristics?",
        "source": "T12n0375_023:0757a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來即是覺相、善相，常、樂、我、淨、解脫、真實，示道可見，是名菩薩知如來相。",
        "translation": "The Tathāgata is the characteristic of awakening, the good characteristic, permanence, bliss, self, purity, liberation, and reality, and it shows the way, which is called a bodhisattva knowing the characteristics of the Tathāgata.",
        "source": "T12n0375_023:0757a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩知於法相？",
        "translation": "\"How do bodhisattvas know the characteristics of the Dharma?",
        "source": "T12n0375_023:0757a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法者，若善、不善，若常、不常，若樂、不樂，若我、無我，若淨、不淨，若知、不知，若解、不解，若真、不真，若修、不修，若師、非師，若實、不實，是名菩薩知於法相。",
        "translation": "Whether a dharma is good or not good, permanent or not permanent, pleasant or not pleasant, self or not self, pure or not pure, known or not known, understood or not understood, true or not true, cultivated or not cultivated, a teacher or not a teacher, or real or not real, this is called a bodhisattva knowing the characteristics of the dharma.",
        "source": "T12n0375_023:0757a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩知於僧相？",
        "translation": "\"How does a bodhisattva know the characteristics of the saṃgha?",
        "source": "T12n0375_023:0757a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧者，若常、樂、我、淨，是弟子相、可見之相，善、真、不實。",
        "translation": "\"Monks, if permanence, happiness, self, and purity are the characteristics of a disciple and visible characteristics, they're good, true, and unreal.",
        "source": "T12n0375_023:0757a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0757a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切聲聞得佛道故。",
        "translation": "\"It's because all śrāvakas attain the Buddha Way.",
        "source": "T12n0375_023:0757a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名真？",
        "translation": "Why is it called true?",
        "source": "T12n0375_023:0757a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悟法性故。",
        "translation": "\"It's because they've realized the nature of the Dharma.",
        "source": "T12n0375_023:0757a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩知於僧相。",
        "translation": "This is called a bodhisattva knowing the characteristics of the saṃgha.",
        "source": "T12n0375_023:0757a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩知於實相？",
        "translation": "\"How does a bodhisattva know the true character?",
        "source": "T12n0375_023:0757a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實相者，若常、無常，若樂、無樂，若我、無我，若淨、無淨，若善、不善，若有、若無，若涅槃、非涅槃，若解脫、非解脫，若知、不知，若斷、不斷，若證、不證，若修、不修，若見、不見，是名實相，非是涅槃、佛性、如來、法、僧、虛空。",
        "translation": "\"The real characteristics are whether permanent or impermanent, pleasant or displeasing, self or selfless, pure or impure, good or unwholesome, existent or nonexistent, nirvāṇa or not-nirvāṇa, liberated or not-liberated, known or unknowing, stopped or unstopped, realized or unrealized, cultivated or not-cultivated, and seen or not-seen, which are called the real characteristics and not nirvāṇa, the Buddha-nature, the Tathāgata, the Dharma, Saṃgha, or space.",
        "source": "T12n0375_023:0757a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是名菩薩因修如是大涅槃故知於涅槃、佛性、如來、法、僧實相、虛空等法差別之相。",
        "translation": "\"This is called a bodhisattva who knows the distinctive characteristics of nirvāṇa, the Buddha-nature, the Tathāgata, the Dharma, Saṃgha, and space because he cultivates such great nirvāṇa.",
        "source": "T12n0375_023:0757a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0757a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃微妙經典不見虛空。",
        "translation": "The bodhisattvas, mahāsattvas, and practitioners of the subtle scripture of great nirvāṇa don't see space.",
        "source": "T12n0375_023:0757a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0757a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛及菩薩雖有五眼所不見故，唯有慧眼乃能見之。",
        "translation": "Although the Buddha and the bodhisattvas have five eyes that don't see them, only the eye of wisdom can see them.",
        "source": "T12n0375_023:0757a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧眼所見無法可見，故名為見。",
        "translation": "What the wisdom eye sees can't be seen, so it's called seeing.",
        "source": "T12n0375_023:0757a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見無物名虛空者，如是虛空乃名為實。",
        "translation": "If someone sees nothing and calls it space, then such space is called real.",
        "source": "T12n0375_023:0757a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是實故，則名常無；以常無故，無樂、我、淨。",
        "translation": "Because it's real, it's called eternal nonexistence, and because it's eternal nonexistence, there's no pleasure, self, or purity.",
        "source": "T12n0375_023:0757b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0757b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空名無法，無法名空。",
        "translation": "Emptiness is called nonexistence, and the absence of dharmas is called emptiness.",
        "source": "T12n0375_023:0757b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間，無物名空；虛空之性亦復如是，無所有故，名為虛空。",
        "translation": "For example, in the world, nothing is called empty, and so is the nature of space, which is called empty space because it has nothing.",
        "source": "T12n0375_023:0757b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0757b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生之性與虛空性俱無實性。",
        "translation": "\"The nature of sentient beings and the nature of space have no real nature at all.",
        "source": "T12n0375_023:0757b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0757b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人說言：『除滅有物，然後作空。』",
        "translation": "As someone said, 'Let's remove existence and then create emptiness.'",
        "source": "T12n0375_023:0757b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而是虛空實不可作。",
        "translation": "Rather, it's true that space can't be created.",
        "source": "T12n0375_023:0757b06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0757b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所有故。",
        "translation": "It's because there's nothing.",
        "source": "T12n0375_023:0757b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無有故，當知無空。",
        "translation": "Because it doesn't exist, you should know that it's empty.",
        "source": "T12n0375_023:0757b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是虛空性若可作者則名無常；若無常者，不名虛空。",
        "translation": "If the nature of this emptiness can be produced, then it's called impermanent; if it's impermanent, it's not called emptiness.",
        "source": "T12n0375_023:0757b07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0757b08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如世間人說言：『虛空無色、無礙，常、不變易。』",
        "translation": "As people in the world say, 'Space is formless, unobstructed, permanent, and unchanging.'",
        "source": "T12n0375_023:0757b09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故世稱虛空之法為第五大。",
        "translation": "That's why the world calls the dharma of space the fifth greatest.",
        "source": "T12n0375_023:0757b10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0757b10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而是虛空實無有性。",
        "translation": "Rather, space really has no nature.",
        "source": "T12n0375_023:0757b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以光明故，故名虛空，實無虛空。",
        "translation": "It's because of its light that it's called space, but it really doesn't have space.",
        "source": "T12n0375_023:0757b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如世諦實無其性，為眾生故，說有世諦。",
        "translation": "It's like the conventional truth really has no nature but is described as having a conventional truth for the sake of sentient beings.",
        "source": "T12n0375_023:0757b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0757b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃之體亦復如是，無有住處，直是諸佛斷煩惱處，故名涅槃。",
        "translation": "The essence of nirvāṇa is likewise. It has no abiding place and is directly the place where buddhas eliminate affliction, which is why it's called nirvāṇa.",
        "source": "T12n0375_023:0757b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃即是常、樂、我、淨。",
        "translation": "Nirvāṇa is permanence, bliss, self, and purity.",
        "source": "T12n0375_023:0757b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃雖樂，非是受樂，乃是上妙寂滅之樂。",
        "translation": "Although nirvāṇa is pleasant, it's not the feeling of pleasure, but the pleasure of ultimate tranquility.",
        "source": "T12n0375_023:0757b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來有二種樂：一、寂滅樂，二、覺知樂。",
        "translation": "Tathāgatas have two kinds of bliss: 1. the bliss of extinction and 2. the bliss of perception.",
        "source": "T12n0375_023:0757b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實相之體有三種樂：一者、受樂，二、寂滅樂，三、覺知樂。",
        "translation": "The essence of reality has three kinds of bliss: 1. the bliss of sensation, 2. the bliss of tranquility, and 3. the bliss of perception.",
        "source": "T12n0375_023:0757b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛性一樂，以當見故，得阿耨多羅三藐三菩提時名菩提樂。」",
        "translation": "The Buddha-nature is one kind of happiness, and because it should be seen, it's called the happiness of enlightenment when one attains supreme perfect enlightenment.\"",
        "source": "T12n0375_023:0757b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，光明遍照高貴德王菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Mahāsattva, the king of towering virtues whose light shines universally, said to the Buddha, \"Bhagavān!",
        "source": "T12n0375_023:0757b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若煩惱斷處是涅槃者，是事不然。",
        "translation": "If the place where afflictions cease is nirvāṇa, this is not the case.",
        "source": "T12n0375_023:0757b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0757b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來往昔初成佛道，至尼連禪河邊。",
        "translation": "In the past, the Tathāgata first achieved Buddhahood and went to the Nairañjāna River.",
        "source": "T12n0375_023:0757b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王與其眷屬到於佛所而作是言：『世尊！",
        "translation": "At the time, the demon king and his retinue came to the Buddha and said, 'Bhagavān!",
        "source": "T12n0375_023:0757b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃時到，何故不入？』",
        "translation": "Why won't you enter nirvāṇa when it's time?'",
        "source": "T12n0375_023:0757b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告魔王：『我今未有多聞弟子善持禁戒、聰明利智、能化眾生，是故不入。』",
        "translation": "The Buddha told Māra King, 'Now, I don't have well-versed disciples who well observe precepts, are intelligent and wise, and can teach sentient beings; therefore, they won't enter.'",
        "source": "T12n0375_023:0757b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言煩惱斷處是涅槃者，諸菩薩等於無量劫已斷煩惱，何故不得稱為涅槃？",
        "translation": "If it's said that the place where afflictions are stopped is nirvāṇa, then why can't bodhisattvas and others who have stopped afflictions for an immeasurable number of eons be called to nirvāṇa?",
        "source": "T12n0375_023:0757b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俱是斷處，何緣獨稱諸佛有之，菩薩無耶？",
        "translation": "Why is it that they alone are said to be present in the buddhas and absent in the bodhisattvas, since they are both places of elimination?",
        "source": "T12n0375_023:0757b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若斷煩惱非涅槃者，何故如來昔告生名婆羅門言：『我今此身即是涅槃。』",
        "translation": "If ending affliction isn't nirvāṇa, then why did the Tathāgata tell the birth-name Brāhmaṇa in the past, 'Now, this body of mine is nirvāṇa.'",
        "source": "T12n0375_023:0757b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來又時在毘舍離國，魔復啟請如來：『昔以未有弟子多聞、持戒、聰明利智、能化眾生，不入涅槃。",
        "translation": "Again, when the Tathāgata was in Vaiśālī, Māra again asked the Tathāgata, 'In the past, because there were no disciples who were well-versed, observed precepts, had intelligence and wisdom, and could teach sentient beings, they didn't enter nirvāṇa.",
        "source": "T12n0375_023:0757c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今已具足，何故不入？』",
        "translation": "Now that they've fulfilled them, why haven't they entered it?'",
        "source": "T12n0375_023:0757c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來爾時即告魔言：『汝今莫生悒遲之想，却後三月吾當涅槃。』",
        "translation": "The Tathāgata then addressed Māra, saying, 'Now, don't get the idea that you're going to be worried and delayed; I'll be in nirvāṇa in the next three months.'",
        "source": "T12n0375_023:0757c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0757c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使滅度非涅槃者，何故如來自期三月當般涅槃？",
        "translation": "If extinction were not nirvāṇa, why did the Tathāgata himself expect that he would attain nirvāṇa in three months?",
        "source": "T12n0375_023:0757c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0757c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若斷煩惱是涅槃者，如來往昔初在道場菩提樹下斷煩惱時便是涅槃。",
        "translation": "If ending affliction is nirvāṇa, then the Tathāgata was in nirvāṇa when he first ended affliction under the bodhi tree at the site of enlightenment in the past.",
        "source": "T12n0375_023:0757c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故復言：『却後三月當般涅槃。』",
        "translation": "Why did he again say, 'But in the following three months, it will be parinirvāṇa.'",
        "source": "T12n0375_023:0757c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0757c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使爾時是涅槃者，云何方為拘尸那城諸力士等說言：『後夜當般涅槃。』",
        "translation": "If this were nirvāṇa, then why did you say to the warriors in Kuśinagara, 'The latter part of the night will be parinirvāṇa.'",
        "source": "T12n0375_023:0757c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來誠實，云何發是虛妄之言？」",
        "translation": "How could the Tathāgata be so sincere as to say such a false thing?\"",
        "source": "T12n0375_023:0757c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告光明遍照高貴德王菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva, King of Noble Virtue, whose radiance was universally shining, saying, \"Good sons!",
        "source": "T12n0375_023:0757c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言如來得廣長舌，當知如來於無量劫已離妄語。",
        "translation": "\"If you say the Tathāgata has attained a broad and long tongue, you should know that the Tathāgata has been free of false speech for an immeasurable number of eons.",
        "source": "T12n0375_023:0757c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸佛及諸菩薩凡所發言誠諦無虛。",
        "translation": "Whatever the buddhas and bodhisattvas say, it's true and not false.",
        "source": "T12n0375_023:0757c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0757c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言，波旬往昔啟請於我入涅槃者，善男子！",
        "translation": "\"As you say, good sons, Pāpīyān invited me to enter nirvāṇa in the past.",
        "source": "T12n0375_023:0757c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而是魔王真實不知涅槃定相。",
        "translation": "Rather, it's that Māra King really doesn't know the determined character of nirvāṇa.",
        "source": "T12n0375_023:0757c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0757c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬意謂不化眾生、默然而住便是涅槃。",
        "translation": "Pāpīyān means that nirvāṇa is when he doesn't transform sentient beings and abides in silence.",
        "source": "T12n0375_023:0757c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0757c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世人，見人不言、無所造作，便謂是人如死無異。",
        "translation": "It's like the world that sees a person who doesn't speak and doesn't do anything, and they assume that person is as good as dead.",
        "source": "T12n0375_023:0757c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王波旬亦復如是，意謂如來不化眾生、默無所說，便謂如來入般涅槃。",
        "translation": "Similarly, Māra King Pāpīyān also thinks that the Tathāgata doesn't teach sentient beings and says nothing in silence, so he assumes that the Tathāgata has entered parinirvāṇa.",
        "source": "T12n0375_023:0757c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0757c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來不說佛、法、眾僧無差別相，唯說常住、清淨二法無差別耳。",
        "translation": "The Tathāgata doesn't say that buddhas, Dharma, and saṃgha have no distinctive characteristics, but only that the two things that are eternally abiding and pure have no distinctions.",
        "source": "T12n0375_023:0757c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0757c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦不說佛及佛性涅槃無差別相，唯說常、恒不變無差別耳。",
        "translation": "The Buddha also doesn't say that the Buddha and buddha-nature and nirvāṇa have no distinctive characteristics, but only that they are permanent, eternal, and unchanging without distinctions.",
        "source": "T12n0375_023:0757c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0757c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦不說涅槃、實相無差別相，唯說常有、實不變易無差別耳。",
        "translation": "The Buddha also doesn't teach that nirvāṇa and true form have no distinctive characteristics, but only that they are eternally existent and truly unchanging without distinction.",
        "source": "T12n0375_023:0757c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0757c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，我諸聲聞弟子生於諍訟。",
        "translation": "At the time, my disciples who are śrāvakas were engaged in a dispute.",
        "source": "T12n0375_023:0757c28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如拘睒彌諸惡比丘違反我教，多犯禁戒，受不淨物，貪求利養。",
        "translation": "Like those evil monks in Kauśāmbī who disobeyed my teaching, they often violated the prohibited precepts, accepted impure things, and sought profit.",
        "source": "T12n0375_023:0757c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "向諸白衣而自讚歎：『我得無漏，謂須陀洹果。』",
        "translation": "They praised themselves to the white monks, saying, 'I've attained the uncontaminated fruit called stream entry.'",
        "source": "T12n0375_023:0758a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至『我得阿羅漢果。』",
        "translation": "... 'I've attained the fruit of the arhat.'",
        "source": "T12n0375_023:0758a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毀辱他人，於佛、法、僧、戒律、和上不生恭敬。",
        "translation": "He disparages others and shows no respect for the Buddha, Dharma, Saṃgha, precepts, or superiors.",
        "source": "T12n0375_023:0758a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "公於我前言：『如是物佛所聽畜，如是等物佛不聽畜。』",
        "translation": "You said to me, 'Such things are heard by the Buddha as domestic animals, and such things are not heard by the Buddha as domestic animals.'",
        "source": "T12n0375_023:0758a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦語言：『如是等物我實不聽。』",
        "translation": "I also said, 'Such and such a thing I really don't listen to.'",
        "source": "T12n0375_023:0758a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復反我言：『如是等物實是佛聽。』",
        "translation": "Again, he said to me, 'Such-and-such things really are heard by the Buddha.'",
        "source": "T12n0375_023:0758a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是惡人不信我言，為是等故，我告波旬：『汝莫悒遲，却後三月當般涅槃。』",
        "translation": "Such a bad person doesn't believe my words, and for that reason, I told Pāpīyān, 'Don't be late; you'll [enter] parinirvāṇa three months from now.'",
        "source": "T12n0375_023:0758a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因如是等惡比丘故，令諸聲聞受學弟子不見我身、不聞我法，便言如來入於涅槃；唯諸菩薩能見我身、常聞我法，是故不言我入涅槃。",
        "translation": "Because of such bad monks, śrāvakas and student disciples who don't see my body and don't hear my teaching say that the Tathāgata has entered nirvāṇa; only bodhisattvas can see my body and always hear my teaching, so they don't say that I've entered nirvāṇa.",
        "source": "T12n0375_023:0758a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子雖復發言如來涅槃，而我實不入於涅槃。",
        "translation": "Although śrāvaka disciples still speak of the Tathāgata's nirvāṇa, I really haven't entered nirvāṇa.",
        "source": "T12n0375_023:0758a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我所有聲聞弟子說言如來入涅槃者，當知是人非我弟子，是魔伴黨、邪見惡人，非正見也。",
        "translation": "\"If any of my śrāvaka disciples say that the Tathāgata has entered nirvāṇa, you should know that person isn't a disciple of mine, and they're a demon's companion, a person of wrong view and evil, and not right view.",
        "source": "T12n0375_023:0758a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言如來不入涅槃，當知是人真我弟子、非魔伴黨、正見之人，非惡邪也。",
        "translation": "If someone says the Tathāgata doesn't enter nirvāṇa, you must know that person is really a disciple of mine, not a companion of Māra, a person of right view, and not evil or mistaken.",
        "source": "T12n0375_023:0758a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我初不見弟子之中有言：『如來不化眾生，默然而住，名般涅槃。』",
        "translation": "When I first met one of my disciples, it was said, 'The Tathāgata doesn't transform sentient beings; he stands silently and is called parinirvāṇa.'",
        "source": "T12n0375_023:0758a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "也。",
        "translation": "It's the same.",
        "source": "T12n0375_023:0758a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0758a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如長者，多有子息，捨至他方。",
        "translation": "\"It's like an elderly man who has many sons and daughters who abandon him for another place.",
        "source": "T12n0375_023:0758a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未得還頃，諸子咸謂父已長逝，而是長者實不終沒，諸子顛倒皆生沒想。",
        "translation": "Before they can return, the sons all say their father has died, but the elder really didn't end up dead, and the sons are mistaken and all give rise to the notion that he's gone.",
        "source": "T12n0375_023:0758a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子亦復如是，不見我故，便謂如來已於拘尸那城娑羅雙樹間而般涅槃，而我實不般涅槃也，聲聞弟子生涅槃想。",
        "translation": "śrāvaka disciples are likewise. Because they don't see me, they say the Tathāgata has already gone into parinirvāṇa among the śāla trees in Kuśinagara, but I really haven't gone into parinirvāṇa, and śrāvaka disciples give rise to the notion of parinirvāṇa.",
        "source": "T12n0375_023:0758a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758a24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如明燈，有人覆之，餘不知者謂燈已滅，而是明焰實亦不滅。",
        "translation": "\"It's like a bright lamp that's covered by someone who doesn't know that the lamp has gone out, but the bright flame really isn't going out either.",
        "source": "T12n0375_023:0758a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不知故，生於滅想。",
        "translation": "Because they don't know it, they give rise to the idea that it's ceasing.",
        "source": "T12n0375_023:0758a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子亦復如是，雖有慧眼，以煩惱覆令心顛倒，不見真身而便妄生滅度之想，而我實不畢竟滅度。",
        "translation": "śrāvaka disciples are likewise. Although they have the eye of wisdom, their minds are confused because they're hindered by afflictions, and they falsely conceptualize the idea of extinction when they don't see the true body, but I really haven't been extinguished after all.",
        "source": "T12n0375_023:0758a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如生盲人不見日、月，以不見故，不知晝夜、明闇之相；以不知故，便說無有日、月之實。",
        "translation": "\"Suppose a blind person arises who doesn't see the sun and moon; because they don't see them, they don't know the difference between day and night, light and darkness; and because they don't know them, they say there's no sun and moon in reality.",
        "source": "T12n0375_023:0758a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實有日、月，盲者不見；以不見故，而生倒想，言無日、月。",
        "translation": "The blind man doesn't see the sun and moon when they really exist; because he doesn't see them, he gives rise to the mistaken notion that there are no sun and moon.",
        "source": "T12n0375_023:0758b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子亦復如是，如彼生盲，不見如來便謂如來入於涅槃。",
        "translation": "śrāvaka disciples are likewise, like those who are blind and don't see the Tathāgata and then say that the Tathāgata has entered nirvāṇa.",
        "source": "T12n0375_023:0758b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來實不入於涅槃，以倒想故生如是心。",
        "translation": "The Tathāgata really doesn't enter nirvāṇa, but this kind of mind arises because of mistaken perceptions.",
        "source": "T12n0375_023:0758b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如雲霧覆蔽日、月，癡人便言無有日、月。",
        "translation": "It's like when a cloud obscures the sun and moon, a deluded person says there's no sun and moon.",
        "source": "T12n0375_023:0758b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日、月實有，直以覆故，眾生不見。",
        "translation": "The sun and moon really exist, but it's because they cover them that sentient beings can't see them.",
        "source": "T12n0375_023:0758b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子亦復如是，以諸煩惱覆智慧眼，不見如來，便言如來入於滅度。",
        "translation": "śrāvaka disciples are likewise, because their eyes of wisdom are covered by the afflictions, they don't see the Tathāgata and then say that the Tathāgata has entered into extinction.",
        "source": "T12n0375_023:0758b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0758b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直是如來現嬰兒行，非滅度也。",
        "translation": "It's simply the Tathāgata's present life's actions, not his cessation.",
        "source": "T12n0375_023:0758b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如閻浮提，日入之時眾生不見，以黑山障故，而是日性實無沒入。",
        "translation": "\"As in Jambudvīpa, sentient beings don't see the sun when it enters because of the black mountain hindrance, but the nature of the sun really isn't re-entrant.",
        "source": "T12n0375_023:0758b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生不見，生沒入想。",
        "translation": "Not seeing it, sentient beings give rise to the perception of non-entry.",
        "source": "T12n0375_023:0758b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子亦復如是，為諸煩惱山所障故，不見我身。",
        "translation": "śrāvaka disciples are likewise, because they're hindered by the mountains of affliction, they don't see themselves.",
        "source": "T12n0375_023:0758b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不見故，便於如來生滅度想，而我實不畢竟永滅。",
        "translation": "Because they don't see it, they give rise to the notion that the Tathāgata has ceased and been liberated, but I really haven't ended up permanently.",
        "source": "T12n0375_023:0758b14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，我於毘舍離國告波旬言：『却後三月我當涅槃。』",
        "translation": "Therefore, I told Pāpīyān in Vaiśālī, 'But in the next three months, I will attain nirvāṇa.'",
        "source": "T12n0375_023:0758b15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來玄見迦葉菩薩却後三月善根當熟；亦見香山須跋陀羅竟安居已，當至我所。",
        "translation": "The Tathāgata has seen that the good roots of Kāśyapa will ripen in the three months after he leaves, and he's also seen that Subhadra will come to me after he's finished settling down on Gandhamādan.",
        "source": "T12n0375_023:0758b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，我告魔王波旬：『却後三月當般涅槃。』",
        "translation": "Therefore, I told Māra King Pāpīyān, 'In the three months after passing away, he'll [enter] parinirvāṇa.'",
        "source": "T12n0375_023:0758b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758b20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸力士，其數五百，終竟三月亦當得發阿耨多羅三藐三菩提心。",
        "translation": "There are 500 strong men who will attain supreme perfect enlightenment even after three months.",
        "source": "T12n0375_023:0758b20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為是故，告波旬言：『却後三月當般涅槃。』",
        "translation": "For this reason, I told Pāpīyān, 'But in the next three months, they'll [enter] parinirvāṇa.'",
        "source": "T12n0375_023:0758b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如純陀等及五百梨車菴羅果女，却後三月無上道心善根成熟。",
        "translation": "\"Suppose there were Cunda and the other five hundred Licchaviṃśati women, and three months after they leave, their minds are ripe with the good roots of the unsurpassed path.",
        "source": "T12n0375_023:0758b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是等故，我告波旬：『却後三月當般涅槃。』",
        "translation": "For these reasons, I told Pāpīyān, 'In the three months following their departure, they'll [enter] parinirvāṇa.'",
        "source": "T12n0375_023:0758b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須那剎多親近外道尼乾子等，我為說法滿十二年。",
        "translation": "For 12 years, Soṇâcāra was close to a non-Buddhist named Nirgrantha, and I taught the Dharma for him.",
        "source": "T12n0375_023:0758b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人邪見，不信、不受。",
        "translation": "Those people have mistaken views and don't believe or accept them.",
        "source": "T12n0375_023:0758b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我知是人邪見根栽却後三月定可拔斷，我為是故告波旬言：『却後三月當般涅槃。』",
        "translation": "I know that person's root of wrong views will surely be removed three months after he's purged, so I told Pāpīyān, 'Three months after he's purged, he'll [enter] parinirvāṇa.'",
        "source": "T12n0375_023:0758b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣故，我於往昔尼連河邊告魔波旬：『我今未有多智弟子，是故不得入涅槃。』",
        "translation": "What were the reasons I told Māra Pāpīyān at the edge of the Naira River in the past, 'Now, I don't have many wise disciples, so I won't be able to enter nirvāṇa.'",
        "source": "T12n0375_023:0758b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者？",
        "translation": "Who is it?",
        "source": "T12n0375_023:0758c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我時欲為五比丘等於波羅[木*奈]轉法輪故，次復欲為五比丘等——所謂耶奢、富那、毘摩羅闍、憍梵波提、須婆睺——次復欲為郁伽長者等五十人，次復欲為摩伽陀國頻婆娑羅王等無量人天，次復欲為優樓頻螺迦葉門徒五百比丘，次復欲為那提迦葉、伽耶迦葉兄弟二人及五百弟子，次復欲為舍利弗、大目犍連等二百五十比丘轉妙法輪。",
        "translation": "I then wanted to turn the wheel of the Dharma for five monks and others at Bālā[mu*nai], and then I wanted to turn the wonderful wheel of the Dharma for five monks and others, namely, Yaśa, Pūrṇa, Vimalāja, Kauṇḍinya, and Subāhu, and then I wanted to turn the wheel of the Dharma for 50 of them, including Ugra, King Bimbisāra of Magadha, and countless others, including humans and gods, and then I wanted to turn the wheel of the Dharma for 500 monks who were disciples of Uruvilvā-Kāśyapa, two brothers and 500 disciples of Nadī-Kāśyapa and Gayā-Kāśyapa, and 250 monks, including Śāriputra and Mahāmaudgalyāyana.",
        "source": "T12n0375_023:0758c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，我告魔王波旬不般涅槃。",
        "translation": "Therefore, I've told Māra King Pāpīyān not to [enter] parinirvāṇa.",
        "source": "T12n0375_023:0758c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有名涅槃，非大涅槃。",
        "translation": "\"Nirvāṇa that has a name is not great nirvāṇa.",
        "source": "T12n0375_023:0758c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何涅槃非大涅槃？",
        "translation": "What is nirvāṇa that's not great nirvāṇa?",
        "source": "T12n0375_023:0758c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見佛性而斷煩惱，是名涅槃，非大涅槃。",
        "translation": "To stop affliction without seeing the buddha-nature is called nirvāṇa, not great nirvāṇa.",
        "source": "T12n0375_023:0758c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不見佛性故，無常、無我，唯有樂、淨。",
        "translation": "Because they don't see the buddha-nature, they lack permanence and self, and there's only pleasure and purity.",
        "source": "T12n0375_023:0758c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，雖斷煩惱，不得名為大般涅槃也。",
        "translation": "Because of this, although it stops afflictions, it can't be called great parinirvāṇa.",
        "source": "T12n0375_023:0758c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見佛性能斷煩惱，是則名為大般涅槃。",
        "translation": "If seeing the Buddha-nature stops afflictions, then it's called great parinirvāṇa.",
        "source": "T12n0375_023:0758c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以見佛性故，得名為常、樂、我、淨。",
        "translation": "Because they see the buddha nature, they can be called permanent, blissful, self, and pure.",
        "source": "T12n0375_023:0758c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，斷除煩惱亦得稱為大般涅槃。",
        "translation": "Because of this, ending afflictions can also be called great parinirvāṇa.",
        "source": "T12n0375_023:0758c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅者言不，槃者言滅，不滅之義名為涅槃。",
        "translation": "Nirvāṇa means not, and nirvāṇa means to cease, and the meaning of not ceasing is called nirvāṇa.",
        "source": "T12n0375_023:0758c18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃又言覆，不覆之義乃名涅槃。",
        "translation": "Nirvāṇa also speaks of covering, and the meaning of not covering is called nirvāṇa.",
        "source": "T12n0375_023:0758c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃言去、來，不去、不來乃名涅槃。",
        "translation": "Nirvāṇa speaks of going and coming, and the meaning of not going and not coming is called nirvāṇa.",
        "source": "T12n0375_023:0758c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃者言取，不取之義乃名涅槃。",
        "translation": "Nirvāṇa refers to taking, and the meaning of not taking is called nirvāṇa.",
        "source": "T12n0375_023:0758c20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃言不定，定無不定乃名涅槃。",
        "translation": "Nirvāṇa speaks of uncertainty, and to be determined and without uncertainty is called nirvāṇa.",
        "source": "T12n0375_023:0758c21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃言新故，無新故義乃名涅槃。",
        "translation": "Nirvāṇa speaks of new and old, and the absence of the meaning of new and old is called nirvāṇa.",
        "source": "T12n0375_023:0758c22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃言障礙，無障礙義乃名涅槃。",
        "translation": "Nirvāṇa speaks of obstruction, and the absence of the meaning of obstruction is called nirvāṇa.",
        "source": "T12n0375_023:0758c23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758c23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有優樓迦、迦毘羅弟子等言：『槃者名相，無相之義乃名涅槃。』",
        "translation": "Some of the Urukka and Kapila disciples said, 'Nirvāṇa is called [a form], and the meaning of no form is called nirvāṇa.'",
        "source": "T12n0375_023:0758c24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0758c25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃者言有，無有之義乃名涅槃。",
        "translation": "\"Pan\" is called existence, and the absence of the meaning of existence is called nirvāṇa.",
        "source": "T12n0375_023:0758c25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃名和合，無和合義乃名涅槃。",
        "translation": "Nirvāṇa is called union, and the absence of the meaning of union is called nirvāṇa.",
        "source": "T12n0375_023:0758c26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃者言苦，無苦之義乃名涅槃。",
        "translation": "Pan is called suffering, and the absence of the meaning of suffering is called nirvāṇa.",
        "source": "T12n0375_023:0758c27_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758c27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷煩惱者不名涅槃，不生煩惱乃名涅槃。",
        "translation": "Stopping affliction isn't called nirvāṇa, and not producing affliction is called nirvāṇa.",
        "source": "T12n0375_023:0758c28_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0758c29_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來煩惱不起，是名涅槃。",
        "translation": "\"When the afflictions of buddha-tathāgatas don't arise, that's called nirvāṇa.",
        "source": "T12n0375_023:0758c29_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有智慧於法無礙是為如來，如來非是凡夫、聲聞、緣覺、菩薩，是名佛性。",
        "translation": "Being unimpeded in regard to qualities and wisdom is called a tathāgata, and tathāgatas are not worldlings, śrāvakas, pratyekbuddhas, or bodhisattvas; this is called buddha-nature.",
        "source": "T12n0375_023:0759a01_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來身、心、智慧遍滿無量無邊阿僧祇土，無所障礙，是名虛空。",
        "translation": "The Tathāgata's body, mind, and wisdom pervade measureless and limitless incalculable lands without any obstructions, which is called space.",
        "source": "T12n0375_023:0759a02_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來常住，無有變易，名曰實相。",
        "translation": "The Tathāgata's eternal abiding and lack of change is called the true character.",
        "source": "T12n0375_023:0759a04_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，如來實不畢竟涅槃。",
        "translation": "Because of this, the Tathāgata really doesn't end up in nirvāṇa.",
        "source": "T12n0375_023:0759a05_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是名菩薩修大涅槃微妙經典具足成就第七功德。",
        "translation": "\"This is called the seventh virtue fully achieved by a bodhisattva who cultivates the subtle scripture of great nirvāṇa.",
        "source": "T12n0375_023:0759a05_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0759a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩修大涅槃微妙經典具足成就第八功德？",
        "translation": "\"How does the bodhisattva Mahāsattva's cultivation of the subtle scripture of great nirvāṇa fully accomplish the eighth virtue?",
        "source": "T12n0375_023:0759a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0759a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃，除斷五事、遠離五事、成就六事、修習五事、守護一事、親近四事、信順一實心、善解脫慧、善解脫。",
        "translation": "A bodhisattva Mahāsattva cultivates the great state of nirvāṇa by removing five things, secluding himself from five things, accomplishing six things, cultivating five things, guarding one thing, becoming intimate with four things, believing and obeying the single true mind, having well-restored wisdom, and being well-liberated.",
        "source": "T12n0375_023:0759a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0759a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩斷除五事？",
        "translation": "How do bodhisattvas eliminate five things?",
        "source": "T12n0375_023:0759a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂五陰：色、受、想、行、識。",
        "translation": "The five aggregates are called form, feeling, perception, volition, and consciousness.",
        "source": "T12n0375_023:0759a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所言陰者，其義何謂？",
        "translation": "\"What does it mean to refer to the aggregates?",
        "source": "T12n0375_023:0759a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能令眾生生死相續，不離重擔，分散聚合，三世所攝，求其實義了不可得。",
        "translation": "It causes sentient beings to be continuously born in death, not free from heavy burdens, scattered and aggregated, and included in the three worlds, the true meaning of which can't be grasped.",
        "source": "T12n0375_023:0759a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是諸義，故名為陰。",
        "translation": "Because of these various meanings, it's called the aggregate.",
        "source": "T12n0375_023:0759a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩雖見色陰，不見其相。",
        "translation": "\"Although the bodhisattva Mahāsattva sees the aggregate of form, he doesn't see its characteristics.",
        "source": "T12n0375_023:0759a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0759a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於十色中推求其性悉不可得，為世界故，說言為陰。",
        "translation": "When the nature of each of the ten forms is inferred, it's unknowable, and for the sake of the world, it's called the aggregate.",
        "source": "T12n0375_023:0759a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「受有百八，雖見受陰，初無受相。",
        "translation": "\"There are 108 sensations, and although we see the sensation aggregate, it doesn't have the characteristics of sensation in the first place.",
        "source": "T12n0375_023:0759a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0759a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受雖百八，理無定實，是故菩薩不見受陰；想、行、識等亦復如是。",
        "translation": "Although there are 108 sensations, the principle is indeterminate in its reality; therefore, the bodhisattva doesn't see the sensation aggregate; so too do perception, volition, consciousness, and so forth.",
        "source": "T12n0375_023:0759a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩深見五陰是生煩惱之根本也。",
        "translation": "\"The bodhisattva Mahāsattva deeply sees that the five aggregates are the root of the afflictions that arise.",
        "source": "T12n0375_023:0759a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，方便令斷。",
        "translation": "Because of this, they skillfully cause them to be eliminated.",
        "source": "T12n0375_023:0759a22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩遠離五事？",
        "translation": "\"How does a bodhisattva become free of the five things?",
        "source": "T12n0375_023:0759a22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂五見。",
        "translation": "There are five views.",
        "source": "T12n0375_023:0759a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T12n0375_023:0759a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、身見，二者、邊見，三者、邪見，四者、戒取，五者、見取。",
        "translation": "1. personal views, 2. extreme views, 3. mistaken views, 4. adherence to precepts, and 5. adherence to views.",
        "source": "T12n0375_023:0759a23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因是五見生六十二見，因是諸見生死不絕，是故菩薩防護不近。",
        "translation": "Because these five views give rise to the 62 views, and because birth and death don't end because of these views, the bodhisattva is therefore protected from them.",
        "source": "T12n0375_023:0759a25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩成就六事？",
        "translation": "\"How have the bodhisattvas accomplished the six things?",
        "source": "T12n0375_023:0759a26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂六念處。",
        "translation": "\"These are the six abodes of mindfulness.",
        "source": "T12n0375_023:0759a27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為六？",
        "translation": "What are the six?",
        "source": "T12n0375_023:0759a27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、念佛，二者、念法，三者、念僧，四者、念天，五者、念施，六者、念戒，是名菩薩成就六事。",
        "translation": "Mindfulness of the Buddha, mindfulness of the Dharma, mindfulness of the saṃgha, mindfulness of the gods, mindfulness of generosity, and mindfulness of morality are called the six things a bodhisattva accomplishes.",
        "source": "T12n0375_023:0759a27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩修習五事？",
        "translation": "\"How do bodhisattvas cultivate the five things?",
        "source": "T12n0375_023:0759a29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂五定：一者、知定，二者、寂定，三者、身心受快樂定，四者、無樂定，五者、首楞嚴定。",
        "translation": "There are five concentrations: 1) the concentration of knowing, 2) the concentration of stilling, 3) the concentration of feeling pleasure in body and mind, 4) the concentration of no pleasure, and 5) the concentration of śūraṃgama.",
        "source": "T12n0375_023:0759b01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修習如是五種定心則得近於大般涅槃，是故菩薩勤心修習。",
        "translation": "When they cultivate these five kinds of concentration, their minds can approach great parinirvāṇa, so bodhisattvas diligently cultivate them.",
        "source": "T12n0375_023:0759b02_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩守護一事？",
        "translation": "\"How does a bodhisattva guard one thing?",
        "source": "T12n0375_023:0759b04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂菩提心。",
        "translation": "\"This is called the mind of enlightenment.",
        "source": "T12n0375_023:0759b04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩常勤守護是菩提心，猶如世人守護一子、亦如瞎者護餘一目。",
        "translation": "The bodhisattva always diligently guards this mind of enlightenment, just as a person guards a son or a blind person guards the other eye.",
        "source": "T12n0375_023:0759b05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如行曠野守護導者，菩薩守護菩提之心亦復如是。",
        "translation": "As someone walking in the wilderness guards a guide, so too does a bodhisattva guard the mind of enlightenment.",
        "source": "T12n0375_023:0759b06_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因護如是菩提心故，得阿耨多羅三藐三菩提；因得阿耨多羅三藐三菩提故，常、樂、我、淨具足而有，即是無上大般涅槃。",
        "translation": "Because they guard the mind of enlightenment like this, they attain unsurpassed, perfect enlightenment, and because they attain unsurpassed, perfect enlightenment, which is the unsurpassed great extinction, contains permanence, bliss, self, and purity.",
        "source": "T12n0375_023:0759b08_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，菩薩守護一法。",
        "translation": "Therefore, the bodhisattva guards one dharma.",
        "source": "T12n0375_023:0759b10_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩親近四事？",
        "translation": "\"How are the four things that bodhisattvas draw near to?",
        "source": "T12n0375_023:0759b11_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂四無量心。",
        "translation": "They are the four immeasurable states of mind.",
        "source": "T12n0375_023:0759b11_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0375_023:0759b12_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、大慈，二者、大悲，三者、大喜，四者、大捨。",
        "translation": "The first is great kindness, the second is great compassion, the third is great joy, and the fourth is great equanimity.",
        "source": "T12n0375_023:0759b12_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因是四心能令無量無邊眾生發菩提心，是故菩薩繫心親近。",
        "translation": "Because these four states of mind can cause measureless and limitless sentient beings to give rise to the mind of enlightenment, bodhisattvas are bound to them and become intimate with them.",
        "source": "T12n0375_023:0759b13_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩信順一實？",
        "translation": "\"How do bodhisattvas believe in and follow the single truth?",
        "source": "T12n0375_023:0759b14_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩了知一切眾生皆歸一道，一道者謂大乘也。",
        "translation": "Bodhisattvas understand that all sentient beings return to the one path, which is called the great vehicle.",
        "source": "T12n0375_023:0759b15_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、菩薩為眾生故分之為三，是故菩薩信順不逆。",
        "translation": "The buddhas and bodhisattvas divide them into three for the sake of sentient beings, so the bodhisattvas believe and follow them, not disagree with them.",
        "source": "T12n0375_023:0759b16_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩心善解脫？",
        "translation": "\"How is the bodhisattva's mind well-liberated?",
        "source": "T12n0375_023:0759b17_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪、恚、癡心永斷滅故，是名菩薩心善解脫。",
        "translation": "Because greed, anger, and delusion are permanently eliminated, this is called the good liberation of the bodhisattva's mind.",
        "source": "T12n0375_023:0759b18_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩慧善解脫？",
        "translation": "\"What is the good liberation of the bodhisattva's wisdom?",
        "source": "T12n0375_023:0759b19_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩於一切法知無障礙，是名菩薩慧善解脫。",
        "translation": "When a bodhisattva knows all things without obstruction, this is called the bodhisattva's wise and skillful liberation.",
        "source": "T12n0375_023:0759b19_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因慧解脫，昔所不聞而今得聞、昔所不見而今得見、昔所不到而今得到。」",
        "translation": "Because they are liberated by wisdom, they now hear what they didn't hear in the past and see what they didn't see in the past and attain what they didn't attain in the present.\"",
        "source": "T12n0375_023:0759b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，光明遍照高貴德王菩薩摩訶薩言：「世尊！",
        "translation": "It was then that the Bodhisattva Mahāsattva, King of Noble Virtue whose light shines everywhere, said, \"Bhagavān!",
        "source": "T12n0375_023:0759b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說心解脫者，是義不然。",
        "translation": "\"If the Buddha teaches that the mind is liberated, this doesn't mean that.",
        "source": "T12n0375_023:0759b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0759b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心本無繫。",
        "translation": "\"The mind is originally unbound.",
        "source": "T12n0375_023:0759b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0759b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心本性不為貪欲、瞋恚、愚癡、諸結所縛。",
        "translation": "The mind's original nature is not bound by craving, anger, delusion, or other bonds.",
        "source": "T12n0375_023:0759b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若本無繫，云何而言心善解脫？",
        "translation": "If it's not originally bound, how can it be said that the mind is well liberated?",
        "source": "T12n0375_023:0759b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0759b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若心本性不為貪結之所繫者，何等因緣而能得繫？",
        "translation": "If the mind's original nature is not bound by the bond of desire, what causes and conditions would make it possible to be bound?",
        "source": "T12n0375_023:0759b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人[穀-禾+牛]角，本無乳相，雖加功力，乳無由出。",
        "translation": "\"Like a human [grain, grain, and cow] horn, there's originally no milk in it, and even though it exerts effort, there's no way for milk to come out.",
        "source": "T12n0375_023:0759b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "[穀-禾+牛]於乳者則不如是，加功雖少，乳則多出。",
        "translation": "That [grain - grain + cow] is not like that in terms of milk, for even though little effort is applied, much milk comes out.",
        "source": "T12n0375_023:0759b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心亦如是，本無貪者，今云何有？",
        "translation": "So too, the mind was originally lacking in craving, so why does it exist now?",
        "source": "T12n0375_023:0759c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若本無貪、後方有者，諸佛、菩薩本無貪相，今悉應有。",
        "translation": "If there was no craving in the past but there was later, then the buddhas and bodhisattvas originally had no characteristic of craving, but now they all should.",
        "source": "T12n0375_023:0759c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0759c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如石女，本無子相，雖加功力、無量因緣，子不可得；心亦如是，本無貪相，雖造眾緣，貪無由生。",
        "translation": "It's like a woman of stone who originally has no marks of a child, and even though she exerts effort and numerous causes and conditions, the child is unobtainable; so too is the mind, which originally has no marks of craving, and even though it creates numerous conditions, craving has no cause to arise.",
        "source": "T12n0375_023:0759c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0759c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如鑽濕木，火不可得；心亦如是，雖復鑽求，貪不可得。",
        "translation": "Like drilling into wet wood, fire is unobtainable; so too is the mind, although it still drills and seeks, greed is unobtainable.",
        "source": "T12n0375_023:0759c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何貪結能繫於心？",
        "translation": "How can the bond of desire bind the mind?",
        "source": "T12n0375_023:0759c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0759c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如壓沙，油不可得；心亦如是，雖復壓之，貪不可得。",
        "translation": "\"It's like crushing sand, for which oil is unobtainable, and mind, for which greed is unobtainable even though it's still crushed.",
        "source": "T12n0375_023:0759c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知：貪、心，二理各異，設復有之，何能污心？",
        "translation": "You should know that desire and mind are two different principles, and if they were to exist again, how could they defile the mind?",
        "source": "T12n0375_023:0759c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0759c10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人安橛於空，終不得住：安貪於心亦復如是，種種因緣不能令貪繫縛於心。",
        "translation": "\"It's like a person who sets his mind on a peg in emptiness and never gets to stay there: similarly, when he sets his mind on greed, the various causes and conditions don't allow greed to bind his mind.",
        "source": "T12n0375_023:0759c10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0759c13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若心無貪名解脫者，諸佛、菩薩何故不拔虛空中刺？",
        "translation": "If the mind's lack of craving is called liberation, why don't buddhas and bodhisattvas remove the thorns in the sky?",
        "source": "T12n0375_023:0759c13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0759c14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去世心不名解脫、未來世心亦無解脫、現在世心不與道共，何等世心名得解脫？",
        "translation": "When the mind of past lives is not called liberated, the mind of future lives is not liberated, and the mind of present lives is not shared with the path, what kind of worldly mind is called liberated?",
        "source": "T12n0375_023:0759c14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0759c16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如過去燈不能滅闇、未來世燈亦不滅闇、現在世燈復不滅闇。",
        "translation": "\"Just as a lamp of the past couldn't extinguish darkness, a lamp of a future life won't extinguish darkness, and a lamp of the present life won't extinguish darkness.",
        "source": "T12n0375_023:0759c16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0759c18_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明之與闇二不並故。",
        "translation": "\"It's because light and darkness are not two and the same.",
        "source": "T12n0375_023:0759c18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心亦如是，云何而言心得解脫？",
        "translation": "So is the mind, so how can we say that the mind is liberated?",
        "source": "T12n0375_023:0759c18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0759c19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪亦是有。",
        "translation": "'Desire is also existent.'",
        "source": "T12n0375_023:0759c19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若貪無者，見女相時不應生貪。",
        "translation": "If craving were nonexistent, it wouldn't arise when they see the marks of a woman.",
        "source": "T12n0375_023:0759c20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若因女相而得生者，當知是貪真實而有。",
        "translation": "If someone were to be born because of the shape of a woman, they would know that greed really exists.",
        "source": "T12n0375_023:0759c20_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以有貪故，墮三惡道。",
        "translation": "Because of craving, they'll fall into the three bad destinies.",
        "source": "T12n0375_023:0759c21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0759c22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人見畫女像亦復生貪，以生貪故得種種罪。",
        "translation": "\"It's like a person who sees a painted woman's image and becomes greedy because of that greed, which results in various kinds of crimes.",
        "source": "T12n0375_023:0759c22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若本無貪，云何見畫而生於貪？",
        "translation": "If they didn't have craving in the first place, why would they see a painting and become greedy?",
        "source": "T12n0375_023:0759c23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若心無貪，云何如來說言菩薩心得解脫？",
        "translation": "If the mind is free of craving, how does the Tathāgata say that a bodhisattva's mind is liberated?",
        "source": "T12n0375_023:0759c24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若心有貪，云何見相然後方生？",
        "translation": "If the mind has craving, how does it come about when it sees the marks and then gives rise to them?",
        "source": "T12n0375_023:0759c25_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見相者則不生耶？",
        "translation": "If someone doesn't see the marks, then they won't arise?",
        "source": "T12n0375_023:0759c26_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今現見有惡果報，當知有貪、瞋恚、愚癡亦復如是。",
        "translation": "Now that I've seen the results of evil, I should know that greed, anger, and foolishness are likewise.",
        "source": "T12n0375_023:0759c26_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0759c27_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如眾生有身無我，而諸凡夫橫計我想。",
        "translation": "\"It's like sentient beings who have a body and no self, and ordinary people imagine a self.",
        "source": "T12n0375_023:0759c28_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖有我想，不墮三趣。",
        "translation": "Even though they have a conception of self, they don't fall into the three destinies.",
        "source": "T12n0375_023:0759c29_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何貪者於無女相而起女想，墮三惡道？",
        "translation": "How does a desiring person conceive of a woman without her features and fall into the three evil destinies?",
        "source": "T12n0375_023:0759c29_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0760a01_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鑽木而生於火，然是火性眾緣中無，以何因緣而得生耶？",
        "translation": "It's like bore wood and fire arises from it, but what are the causes and conditions for its fire nature, which is absent from many conditions, to come into being?",
        "source": "T12n0375_023:0760a01_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0375_023:0760a03_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪亦如是，色中無貪，香、味、觸、法亦復無貪。",
        "translation": "\"So is greed. While there's no greed in form, there's also no greed in fragrance, taste, touch, or dharmas.",
        "source": "T12n0375_023:0760a03_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於色、香、味、觸、法而生貪耶？",
        "translation": "How does craving arise in form, odor, taste, touch, and dharmas?",
        "source": "T12n0375_023:0760a04_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眾緣中悉無貪者，云何眾生獨生於貪，諸佛、菩薩而不生耶？",
        "translation": "If craving is absent in all conditions, then how is it that craving arises in sentient beings alone and not in buddhas and bodhisattvas?",
        "source": "T12n0375_023:0760a05_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0375_023:0760a06_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心亦不定。",
        "translation": "\"The mind is also unsettled.",
        "source": "T12n0375_023:0760a06_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若心定者，無有貪欲、瞋恚、愚癡；若不定者，云何而言心得解脫？",
        "translation": "If the mind is concentrated, there's no desire, anger, or delusion; if it's unconfined, how can it be said that the mind is liberated?",
        "source": "T12n0375_023:0760a06_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪亦不定，若不定者，云何因之生三惡趣？",
        "translation": "Greed is also indeterminate, but if it's indeterminate, how will it cause birth in the three evil destinies?",
        "source": "T12n0375_023:0760a08_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪者、境界，二俱不定。",
        "translation": "Craving and the objective realm are both indeterminate.",
        "source": "T12n0375_023:0760a09_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0760a09_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俱緣一色，或生於貪、或生於瞋、或生愚癡，是故，貪者及與境界二俱不定。",
        "translation": "Conditioned on a single form, either greed, anger, or folly arises, so greed and the objective realm are both indeterminate.",
        "source": "T12n0375_023:0760a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若俱不定，何故如來說言：『菩薩修大涅槃，心得解脫。』」",
        "translation": "If they are both indeterminate, why does the Tathāgata say, 'A bodhisattva cultivates great nirvāṇa, and his mind is liberated.'\"",
        "source": "T12n0375_023:0760a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告光明遍照高貴德王菩薩摩訶薩言：「善哉，善哉。",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva, the king of towering virtue whose radiance is universally shining, saying, \"Good, good!",
        "source": "T12n0375_023:0760a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0760a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心亦不為貪結所繫、亦非不繫，非是解脫、非不解脫，非有、非無，非現在、非過去、非未來。",
        "translation": "The mind is not bound by the bond of desire, nor is it not bound, nor is it liberated, nor is it non-liberated, neither is it existent nor nonexistent, neither present, nor past, nor future.",
        "source": "T12n0375_023:0760a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0760a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0760a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法無自性故。",
        "translation": "It's because all dharmas lack their own nature.",
        "source": "T12n0375_023:0760a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸外道作如是言：『因緣和合則有果生。』",
        "translation": "Some non-Buddhists say this, 'When causes and conditions combine, then results are produced.'",
        "source": "T12n0375_023:0760a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眾緣中本無生性而能生者，虛空不生亦應生果。",
        "translation": "If the nature of production were inherent in conditions but could arise, then the result would arise even though space doesn't produce.",
        "source": "T12n0375_023:0760a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空不生非是因故，以眾緣中本有果性，是故合集而得生果。",
        "translation": "The fact that space doesn't arise isn't a cause; it's because the fruit nature is inherent in all conditions that the result can arise from their coming together.",
        "source": "T12n0375_023:0760a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0760a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如提婆達欲造牆壁則取泥土，不取彩色；欲造畫像則集彩色，不取草木；作衣取縷，不取泥木；作舍取泥，不取縷綖。",
        "translation": "\"Suppose Devadatta wants to build a wall and takes clay, not color; wants to paint an image and gathers color, not wood or grass; wants to make a robe and takes thread, not clay or wood; and wants to make a shelter and takes clay, not thread or tassel.",
        "source": "T12n0375_023:0760a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以人取故，當知是中各能生果；以能生果故，當知因中必先有性。",
        "translation": "Because people take, you should know that each of these can produce results, and because they can produce results, you should know that there must first be a nature in the cause.",
        "source": "T12n0375_023:0760a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無性者，一物之中應當出生一切諸物。",
        "translation": "If there were no nature, then from one thing all things would arise.",
        "source": "T12n0375_023:0760a26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是可取、可作、可出，當知是中必先有果。",
        "translation": "If they were desirable, workable, and producible, you would know that there must first be an effect in them.",
        "source": "T12n0375_023:0760a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無果者，人則不取、不作、不出，唯有虛空——無取、無作故——能出生一切萬物。",
        "translation": "If there were no effect, then a person wouldn't take, make, or produce anything, and only space-which has no taking and no making-could produce all things.",
        "source": "T12n0375_023:0760a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以有因故，如尼拘陀子住尼拘陀樹、乳有醍醐、縷中有布、泥中有瓶。",
        "translation": "It's because there's a cause, like the son of Nirgrantha abiding in the Nirgrantha tree, cream from milk, cloth from thread, or a vase from clay.",
        "source": "T12n0375_023:0760b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫無明所盲作是定說：『色有著義、心有貪性。』",
        "translation": "All mortals blinded by nescience make this concentration, saying, 'Form has the meaning of attachment, and the mind has the nature of craving.'",
        "source": "T12n0375_023:0760b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復言：『凡夫心有貪性、亦解脫性。",
        "translation": "Again, they say, 'The mind of ordinary people has the nature of greed, and it's also liberated.",
        "source": "T12n0375_023:0760b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遇貪因緣，心則生貪；若遇解脫，心則解脫。』",
        "translation": "When faced with the cause and condition of greed, the mind becomes greedy; when faced with liberation, the mind becomes liberated.'",
        "source": "T12n0375_023:0760b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖作此說，是義不然。",
        "translation": "Even though it's said this, it doesn't mean that.",
        "source": "T12n0375_023:0760b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有諸凡夫復作是言：『一切因中悉無有果。』",
        "translation": "\"Again, some worldlings say, 'In all causes, there's no result.'",
        "source": "T12n0375_023:0760b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因有二種：一者、微細，二者、麁大。",
        "translation": "There are two kinds of causes: the first is subtle, and the second is crude and large.",
        "source": "T12n0375_023:0760b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "細即是常，麁則無常。",
        "translation": "The subtle is permanent, and the crude is impermanent.",
        "source": "T12n0375_023:0760b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從微細因轉成麁因，從此麁因轉復成果。",
        "translation": "From subtle causes, crude causes are transformed into crude causes, and from these crude causes, the results are transformed back into results.",
        "source": "T12n0375_023:0760b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麁無常故，果亦無常。",
        "translation": "Because the debilitating aspect is impermanent, the result is also impermanent.",
        "source": "T12n0375_023:0760b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸凡夫復作是言：『心亦無因、貪亦無因，以時節故則生貪心。』",
        "translation": "Again, some ordinary people say, 'The mind also has no cause, and greed has no cause; it's because of moderation that greed arises.'",
        "source": "T12n0375_023:0760b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等輩以不能知心因緣故輪迴六",
        "translation": "Such a group is reborn through the six transmigration paths because they don't know the mind's causes and conditions.",
        "source": "T12n0375_023:0760b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "趣，具受生死。",
        "translation": "He'll go to the same destination, fully undergoing birth-and-death.",
        "source": "T12n0375_023:0760b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如枷犬繫之於柱，終日繞柱不能得離。",
        "translation": "They're like a dog tied to a pillar by a fetter, and they spend their whole day circling the pillar and can't get free.",
        "source": "T12n0375_023:0760b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫亦復如是，被無明枷繫生死柱，繞二十五有不能得離。",
        "translation": "All worldlings are likewise, bound by the fetters of ignorance to the pillars of birth-and-death, circling them for 25 lifetimes without being able to escape.",
        "source": "T12n0375_023:0760b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人墮於圊廁，既得出已而復還入；如人病差，還為病因；如人涉路值空曠處，既得過已而復還來；又如淨洗還塗泥土。",
        "translation": "It's like a person who falls into a toilet and then goes back into it after emerging, like a person who's ill and returns as the cause of their illness, like a person who wades through a road and finds an empty place and then comes back after getting past it, or like a pure wash that's smeared with mud.",
        "source": "T12n0375_023:0760b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫亦復如是，已得解脫無所有處，唯未得脫非非想處，而復還來至三惡趣。",
        "translation": "All ordinary people are likewise, having been liberated from the sphere of nothingness but not having been liberated from the sphere of neither perception, they return to the three bad destinies.",
        "source": "T12n0375_023:0760b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0760b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫唯觀於果，不觀因緣。",
        "translation": "All worldlings only look at the results, not the causes and conditions.",
        "source": "T12n0375_023:0760b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如犬逐塊，不逐於人。",
        "translation": "They're like a dog chasing a block, not a person.",
        "source": "T12n0375_023:0760b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫之人亦復如是，唯觀於果，不觀因緣。",
        "translation": "Similarly, ordinary people only look at the results and don't look at the causes and conditions.",
        "source": "T12n0375_023:0760b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不觀故，從非想退還三惡趣。",
        "translation": "Because they don't contemplate that, they regress from non-conception back to the three bad destinies.",
        "source": "T12n0375_023:0760b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、菩薩終不定說因中有果、因中無果，及有無果、非有非無果。",
        "translation": "\"All buddhas and bodhisattvas never say that there's an effect in a cause, no effect in a cause, or that there's both an effect and no effect, or that it's neither existent nor nonexistent.",
        "source": "T12n0375_023:0760b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言因中先定有果、及定無果、定有無果、定非有非無果，當知是等皆魔伴黨。",
        "translation": "If they say that there's certainly an effect in a cause, certainly no effect, certainly existent and nonexistent effects, and certainly neither existent nor nonexistent effects, you should know that these are the companions of Māra.",
        "source": "T12n0375_023:0760b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫屬於魔即是愛人，如是愛人不能永斷生死繫縛，不知心相及以貪相。",
        "translation": "A person bound to Māra is a lover, and such a lover can't permanently break the bonds of birth-and-death without knowing the characteristics of mind and the characteristics of desire.",
        "source": "T12n0375_023:0760b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛菩薩顯示中道。",
        "translation": "\"The buddhas and bodhisattvas reveal the middle way.",
        "source": "T12n0375_023:0760b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0760c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖說諸法非有、非無，而不決定。",
        "translation": "Although it's said that all dharmas are neither existent nor nonexistent, they aren't determined.",
        "source": "T12n0375_023:0760c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0760c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因眼、因色、因明、因心、因念，識則得生。",
        "translation": "It's because of the eye, form, light, mind, and thought that consciousness can arise.",
        "source": "T12n0375_023:0760c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是識決定不在眼中、色中、明中、心中、念中，亦非中間、非有、非無。",
        "translation": "This consciousness is definitely not in the eye, form, light, mind, or thought, and it's not intermediate, not existent, or not nonexistent.",
        "source": "T12n0375_023:0760c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從緣生故，名之為有；無自性故，名之為無。",
        "translation": "It's called existent because it arises from conditions, and it's called nonexistent because it has no self-nature.",
        "source": "T12n0375_023:0760c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，如來說言諸法非有、非無。",
        "translation": "Therefore, the Tathāgata says that all dharmas are neither existent nor nonexistent.",
        "source": "T12n0375_023:0760c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、菩薩終不定說心有淨性及不淨性，淨、不淨心無住處故。",
        "translation": "The buddhas and bodhisattvas never say that the mind has a pure and impure nature because the pure and impure minds have no abode.",
        "source": "T12n0375_023:0760c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從緣生貪，故說非無；本無貪性，故說非有。",
        "translation": "Since craving arises from conditions, it's said not to be nonexistent, and since the nature of craving doesn't exist in the first place, it's said not to exist.",
        "source": "T12n0375_023:0760c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從因緣故，心則生貪；從因緣故，心則解脫。",
        "translation": "It's because of causes and conditions that the mind becomes greedy, and it's because of causes and conditions that the mind becomes liberated.",
        "source": "T12n0375_023:0760c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0760c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣有二：一者、隨於生死，二者、隨大涅槃。",
        "translation": "There are two kinds of causes and conditions: one, following birth and death, and the other, following the great nirvāṇa.",
        "source": "T12n0375_023:0760c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0760c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有因緣故，心共貪生共貪俱滅、有共貪生不共貪滅、有不共貪生共貪俱滅、有不共貪生不共貪滅。",
        "translation": "There are causes and conditions that cause the mind to co-arise and co-extinguish craving, co-arise and non-co-arise, and non-co-arise and non-co-extinguish craving.",
        "source": "T12n0375_023:0760c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何心共貪生共貪俱滅？",
        "translation": "\"How does co-occurrence and co-extinction of craving arise in the mind?",
        "source": "T12n0375_023:0760c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0760c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有凡夫未斷貪心修習貪心，如是之人心共貪生心共貪滅。",
        "translation": "If there are ordinary people who haven't stopped craving and cultivate craving, such a person's mind shares craving for birth and disappearance of craving.",
        "source": "T12n0375_023:0760c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生不斷貪心，心共貪生心共貪滅。",
        "translation": "All sentient beings don't stop craving, and their minds co-generate craving and their minds cease craving.",
        "source": "T12n0375_023:0760c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如欲界眾生一切皆有初地味禪，若修、不修，常得成就，遇因緣故即便得之，言因緣者，謂火災也。",
        "translation": "All sentient beings in the desire realm have first-ground flavor meditation, which is always achieved if they cultivate it or don't cultivate it, and it's even achieved when they meet a cause or condition, which is the fire disaster.",
        "source": "T12n0375_023:0760c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫亦復如是，若修、不修，心共貪生心共貪滅。",
        "translation": "All ordinary people are likewise. If they cultivate or don't cultivate it, their minds will co-generate desire and their minds will co-cancel desire.",
        "source": "T12n0375_023:0760c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0375_023:0760c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不斷貪故。",
        "translation": "It's because they don't stop craving.",
        "source": "T12n0375_023:0760c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何心共貪生不共貪滅？",
        "translation": "\"How does the mind co-generate desire and doesn't co-cessate desire?",
        "source": "T12n0375_023:0760c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子有因緣故生於貪心，畏貪心故修白骨觀，是名心共貪生不共貪滅。",
        "translation": "A śrāvaka disciple has a cause and condition for becoming greedy and cultivates the contemplation of white bones because he's afraid of greed, which is called the mind sharing greed that arises and doesn't cease.",
        "source": "T12n0375_023:0760c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有心共貪生不共貪滅，如聲聞人未證四果，有因緣故生於貪心，證四果時貪心得滅，是名心共貪生不共貪滅。",
        "translation": "Again, there's mind that produces and doesn't cease from craving together, such as a śrāvaka who hasn't yet realized the four fruits but has causes and conditions for producing a mind of greed, and when he realizes the four fruits, his mind ceases from greed, which is called mind that produces and doesn't cease from craving together.",
        "source": "T12n0375_023:0760c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩得不動地時，心共貪生不共貪滅。",
        "translation": "When the bodhisattva Mahāsattva attains the ground of immovability, his mind shares the arising of greed and doesn't share the cessation of greed.",
        "source": "T12n0375_023:0760c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何不共貪生共貪俱滅？",
        "translation": "\"Why doesn't shared greed arise and shared greed cease?",
        "source": "T12n0375_023:0760c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩斷貪心已，為眾生故，示現有貪。",
        "translation": "\"Suppose a bodhisattva Mahāsattva stops craving and then shows for the sake of sentient beings that there's craving.",
        "source": "T12n0375_023:0760c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以示現故，能令無量無邊眾生諮受善法，具足成就，是名不共貪生共貪俱滅。",
        "translation": "\"To cause measureless and limitless sentient beings to consult good qualities and fully accomplish them because of this manifestation is called the mutual cessation of craving and the production of what's not shared with craving.",
        "source": "T12n0375_023:0760c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何不共貪生不共貪滅？",
        "translation": "\"Why doesn't shared greed arise and shared greed cease?",
        "source": "T12n0375_023:0761a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂阿羅漢、緣覺、諸佛——除不動地其餘菩薩——是名不共貪生不共貪滅。",
        "translation": "Arhats, pratyekbuddhas, and buddhas-except for the remaining bodhisattvas in the ground of immovability-are called buddhas who don't share craving for birth and don't share craving for cessation.",
        "source": "T12n0375_023:0761a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，諸佛、菩薩不決定說心性本淨、性本不淨。",
        "translation": "Because of this, the buddhas and bodhisattvas aren't certain to say that the mind's nature is inherently pure or inherently impure.",
        "source": "T12n0375_023:0761a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0761a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心不與貪結和合，亦復不與瞋、癡和合。",
        "translation": "This mind isn't combined with the bond of desire, and it's also not combined with anger and delusion.",
        "source": "T12n0375_023:0761a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0761a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日、月，雖為烟、塵、雲、霧、及阿修羅之所覆蔽，以是因緣，令諸眾生不能得見。",
        "translation": "\"It's like the sun and moon, although they are obscured by smoke, dust, clouds, fog, and asuras, which cause sentient beings to be unable to see them.",
        "source": "T12n0375_023:0761a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖不可見，日、月之性，終不與彼五翳和合。",
        "translation": "Even though they can't be seen, the nature of the sun and moon never merges with those five cataracts.",
        "source": "T12n0375_023:0761a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心亦如是，以因緣故生於貪結。",
        "translation": "So it is with the mind, which by cause and condition creates the bond of greed.",
        "source": "T12n0375_023:0761a10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生雖說心與貪合，而是心性實不與合。",
        "translation": "Although sentient beings say that the mind is united with greed, the nature of the mind is really not united with it.",
        "source": "T12n0375_023:0761a11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是貪心即是貪性；若是不貪，即不貪性。",
        "translation": "If a mind is greedy, then it's the nature of greed; if it's not greedy, then it's the nature of non-greed.",
        "source": "T12n0375_023:0761a12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不貪之心不能為貪，貪結之心不能不貪。",
        "translation": "A mind that doesn't crave can't be craving, and a mind that's tied up in craving can't be non-craving.",
        "source": "T12n0375_023:0761a13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0761a14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，貪欲之結不能污心。",
        "translation": "Because of this, the bond of desire can't defile the mind.",
        "source": "T12n0375_023:0761a14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛、菩薩永破貪結，是故說言心得解脫。",
        "translation": "\"The buddhas and bodhisattvas permanently break the bond of desire, which is why they say the mind is liberated by experience.",
        "source": "T12n0375_023:0761a15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生從因緣故，生於貪結；從因緣故，心得解脫。",
        "translation": "It's because of causes and conditions that all sentient beings are born in the bond of desire, and it's because of those causes and conditions that their minds are liberated.",
        "source": "T12n0375_023:0761a16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0761a17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如雪山懸峻之處，人與獼猴俱不能行；或復有處，獼猴能行、人不能行；或復有處，人與獼猴二俱能行。",
        "translation": "It's like a place on a precipitous snow-capped mountain where neither humans nor monkeys can travel; another place where monkeys can travel but humans can't; or another place where both humans and monkeys can travel.",
        "source": "T12n0375_023:0761a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0375_023:0761a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人與獼猴能行處者，如諸獵師純以黐膠置之案上用捕獼猴。",
        "translation": "\"Where a person and a monkey can travel, it's like a hunter who simply puts sticking glue on a table to catch a monkey.",
        "source": "T12n0375_023:0761a20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴癡故，往手觸之，觸已粘手；欲脫手故，以脚蹋之，脚復隨著；欲脫脚故，以口齧之，口復粘著。",
        "translation": "Because the monkey is deluded, he touches it with his hand and it sticks to his hand after touching it; because he wants to get rid of his hand, he steps on it with his foot and it follows him; because he wants to get rid of his foot, he scratches it with his mouth and it sticks to his mouth.",
        "source": "T12n0375_023:0761a21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是五處悉無得脫，於是獵師以杖貫之，負還歸家。",
        "translation": "Nothing could be done to free him from these five places, so the hunter stuck his staff through them, carried it back to his home, and returned.",
        "source": "T12n0375_023:0761a24_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雪山嶮處，譬佛、菩薩所得正道；獼猴者，譬諸凡夫；獵師者，喻魔波旬；黐膠者，譬貪欲結。",
        "translation": "The precipitous place in the snowy mountains is a metaphor for the right path obtained by buddhas and bodhisattvas; the monkey is a metaphor for ordinary people; the hunter is a metaphor for Māra Pāpīyān; and the sticky glue is a metaphor for the bond of desire.",
        "source": "T12n0375_023:0761a25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人與獼猴俱不行者，譬諸凡夫、魔王波旬俱不能行；獼猴能行人不能行者，譬諸外道有智慧者，諸惡魔等雖以五欲不能繫縛；人與獼猴俱能行者，一切凡夫及魔波旬常處生死，不能修行。",
        "translation": "When both humans and monkeys don't practice, it's a metaphor for mortals and Māra Pāpīyān who both can't practice; when monkeys can practice but can't practice, it's a metaphor for non-Buddhists who have wisdom and evil Māra who can't be bound by the five desires; when both humans and monkeys can practice, all mortals and Māra Pāpīyān are always in birth-and-death and can't practice.",
        "source": "T12n0375_023:0761a27_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫之人五欲所縛，令魔波旬自在將去，如彼獵師擒捕獼猴，負之歸家。",
        "translation": "Ordinary people bound by the five desires cause Māra Pāpīyān to freely depart, like a hunter who captures a monkey and carries it home.",
        "source": "T12n0375_023:0761b03_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0761b05_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如國王安住己界，身心安樂；若至他界則得眾苦。",
        "translation": "\"It's like a king who stands in his own realm and is comfortable in body and mind, but if he goes to another realm, he'll experience a multitude of sufferings.",
        "source": "T12n0375_023:0761b05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生亦復如是，若能自住於己境界則得安樂；若至他界則遇惡魔，受諸苦惱。",
        "translation": "So it is with all sentient beings, for if they can abide in their own realm, they'll attain well-being; if they go to another realm, they'll encounter harmful demons and experience suffering and distress.",
        "source": "T12n0375_023:0761b06_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自境界者，謂四念處；他境界者，謂五欲也。",
        "translation": "The term \"one's own objective realm\" refers to the four abodes of mindfulness, and the term \"other objective realms\" refers to the five desires.",
        "source": "T12n0375_023:0761b08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為繫屬於魔？",
        "translation": "\"What's the term 'tethered to Māra?'",
        "source": "T12n0375_023:0761b09_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸眾生無常見常、常見無常，苦見於樂、樂見於苦，不淨見淨、淨見不淨，無我見我、我見無我，非實解脫妄見解脫、真實解脫見非解脫，非乘見乘、乘見非乘，如是之人名繫屬魔。",
        "translation": "\"Sentient beings who are impermanent and see permanence and common impermanence, who are pained and see pleasure and see pain, who are impure and see purity and see impurity, who are without self and see no self, who aren't truly liberated and falsely see liberation and truly liberated and see what's not liberated, who aren't the vehicle and see the vehicle and see what's not the vehicle, such a person is called a fettered demon.",
        "source": "T12n0375_023:0761b10_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫屬魔者，心不清淨。",
        "translation": "A person tied to Māra doesn't purify their mind.",
        "source": "T12n0375_023:0761b14_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0761b14_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見諸法真實是有總別定相，當知是人若見色時便作色相，乃至見識亦作識相、見男男相、見女女相、見日日相、見月月相、見歲歲相、見陰陰相、見入入相、見界界相。",
        "translation": "\"If he sees that all things really do have a general and specific definition, then he should know that when he sees form, he creates the form characteristic, and when he sees consciousness, he also creates the consciousness characteristic, sees the male form of a man, sees the female form of a woman, sees the daily form, sees the monthly form, sees the yearly form, sees the aggregates and aggregates characteristic, sees the entry form, and sees the sectoral form.",
        "source": "T12n0375_023:0761b15_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見者，名繫屬魔；繫屬魔者，心不清淨。",
        "translation": "Such a view is called a fettered demon, and a fettered demon's mind isn't purified.",
        "source": "T12n0375_023:0761b19_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0375_023:0761b20_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見我是色、色中有我、我中有色、色屬於我，乃至見我是識、識中有我、我中有識、識屬於我，如是見者，繫屬於魔，非我弟子。",
        "translation": "If someone sees that I am form, there's a self in form, there's form in self, and form belongs to self, or if they see that I am consciousness, there's a self in consciousness, there's consciousness in self, and consciousness belongs to self, such a view is bound to Māra, who is not my disciple.",
        "source": "T12n0375_023:0761b20_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0761b23_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聲聞弟子遠離如來十二部經，修習種種外道典籍，不修出家寂滅之業，純營世俗在家之事。",
        "translation": "We śrāvaka disciples abandon the 12 scriptures of the Tathāgata and cultivate various non-Buddhist texts, don't cultivate tranquil behavior as renunciant monks, and simply engage in worldly and domestic activities.",
        "source": "T12n0375_023:0761b23_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為在家之事？",
        "translation": "What's called a householder's occupation?",
        "source": "T12n0375_023:0761b25_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受畜一切不淨之物，奴婢、田宅、象馬車乘、駞、驢、雞、犬、獼猴、猪、羊、種種穀麥，遠離師僧，親附白衣，違反聖教，向諸白衣作如是言：『佛聽比丘受畜種種不淨之物。』",
        "translation": "Accepting the storing of all impure things, such as slaves, servants, farmland, elephants, horses, carts, ricks, donkeys, chickens, dogs, monkeys, pigs, sheep, and various kinds of grain and barley, he secludes himself from his teachers and monks, becomes intimate with the white garments, violates the noble teaching, and says to the white garments, 'The Buddha has heard that monk accept the storing of various impure things.'",
        "source": "T12n0375_023:0761b26_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名修習在家之事。",
        "translation": "This is called cultivating householder behavior.",
        "source": "T12n0375_023:0761b29_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有諸弟子不為涅槃、但為利養，親近聽受十二部經，招提僧物及僧鬘物，衣著食噉如自己有，慳惜他家，及以稱譽親近國王及諸王子，卜筮吉凶、推步盈虛、圍碁、六博、摴蒱、投壺，親比丘尼及諸處女，畜二沙彌，常遊屠獵、酤酒之家及旃陀羅所住之處，種種販賣手自作食，受使隣國通致信命，如是之人當知即是魔之眷屬，非我弟子。",
        "translation": "\"Suppose there are disciples who don't seek nirvāṇa but only gain, who intimately listen to and accept 12 sūtras, who solicit the property of monks and their garments, who dress themselves in food and drink as if they had it, who are stingy with other families, who approach kings and princes with praise, who divine fortune and misfortune, who push and prognosticate, who wrestle, play six games, gamble, throw pots, who are intimate with monks and nuns and virgins, who keep two novices, who travel to slaughterhouses, wine merchants, and places where candra lives, who sell food from their own hands, and who accept orders from neighboring countries, such people should know that they're members of the devil's family and not my disciples.",
        "source": "T12n0375_023:0761c01_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以是因緣，心共貪生心共貪滅，乃至癡心共生共滅亦復如是。",
        "translation": "\"Because of this cause, mind and greed arise together, mind and greed cease together, and so does a deluded mind arise and cease together.",
        "source": "T12n0375_023:0761c09_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T12n0375_023:0761c10_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，心性不淨、亦非不淨。",
        "translation": "Because of these causes, the mind's nature is impure and not impure.",
        "source": "T12n0375_023:0761c11_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，我說心得解脫。",
        "translation": "Therefore, I say that the mind is liberated.",
        "source": "T12n0375_023:0761c11_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有不受、不畜一切不淨之物，為大涅槃受持、讀誦十二部經、書寫、解說，當知是等真我弟子，不行惡魔波旬境界，即是修習三十七品。",
        "translation": "\"If he doesn't accept or store anything impure, and if he accepts, recites, writes, and interprets the 12 sutras for the sake of the great nirvāṇa, you should know that this is truly a disciple of mine who doesn't practice the realm of Māra Pāpīyān, which is the cultivation of the 37 qualities.",
        "source": "T12n0375_023:0761c12_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以修習故，不共貪生、不共貪滅。",
        "translation": "Because of this cultivation, they don't share craving for birth and don't share craving for cessation.",
        "source": "T12n0375_023:0761c15_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩修大涅槃微妙經典具足成就第八功德。",
        "translation": "This is called the eighth virtue fully achieved by a bodhisattva's cultivation of the subtle scripture of the great nirvāṇa.",
        "source": "T12n0375_023:0761c16_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般涅槃經卷第二十三",
        "translation": "Mahāparinirvāṇa-sūtra, Vol. 23",
        "source": "T12n0375_023:0761c18_0",
        "is_bad_quality": false
    }
]