[
    {
        "source_sentence": "大悲經卷第一",
        "translation": "Great Compassion Sutra, Vol. 1",
        "source": "T12n0380_001:0945b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高齊天竺三藏那連提耶舍譯",
        "translation": "A Translation of the Sanskrit Tripiṭaka of Nālandī Yeshiva by Gaoqi Tianzang",
        "source": "T12n0380_001:0945b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天品第一",
        "translation": "Most Eminent of the Classes of Brahmā",
        "source": "T12n0380_001:0945b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在拘尸那城力士生地娑羅雙樹間。",
        "translation": "Thus I have heard: One time, the Buddha was standing between the twin śāla trees in the Luxuriant Birthplace of Kuśinagara.",
        "source": "T12n0380_001:0945b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊臨般涅槃，告慧命阿難言：「汝可於娑羅雙樹間安置敷具，如師子王右脇臥法，吾今後夜當般涅槃。",
        "translation": "When the Bhagavān was about to approach parinirvāṇa, he told Ānanda of Wisdom Life, \"You may lay out a cloth between the two śāla trees, as the lion king lies on his right side, for I will parinirvāṇa the night after tomorrow.",
        "source": "T12n0380_001:0945b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0380_001:0945b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已究竟涅槃，斷除一切有為言說。",
        "translation": "\"I've completely achieved nirvāṇa and ended all artificial speech.",
        "source": "T12n0380_001:0945b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已作佛事、已說甘露——無有窟宅、寂滅定甚深微妙，難見、難覺、難可測量——明智所知諸賢聖法。",
        "translation": "I've performed buddha-works and explained the nectar-that there's no cave, that the concentration of cessation is so profound and subtle that it's difficult to see, difficult to perceive, and difficult to measure-that I'm wise and know the noble principles of good men.",
        "source": "T12n0380_001:0945b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已三轉無上法輪，若有沙門、婆羅門、若天、若魔、若梵、若人，以世共法無能轉者。",
        "translation": "I've turned the unsurpassed Dharma wheel three times, and if there were ascetics, priests, gods, Māra, Brahmā, or humans, there would be no one who could turn it based on the common dharma of the world.",
        "source": "T12n0380_001:0945b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已擊法鼓、吹法蠡、建法幢、置法船、作法橋、降法雨。",
        "translation": "I've beaten the Dharma drum, blown the Dharma calabash, built the Dharma banner, placed the Dharma boat, made the Dharma bridge, and sent down the Dharma rain.",
        "source": "T12n0380_001:0945b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已光照三千大千世界，滅除大闇，開示眾生，解脫正道，充益天人，所應度者皆悉已度。",
        "translation": "I've shone a light that shines in 3,000 great thousand worlds, extinguished great darkness, revealed to sentient beings the right path to liberation, enriched gods and humans, and delivered all those who should be delivered.",
        "source": "T12n0380_001:0945b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已降伏一切外道及諸異論、動魔宮殿、摧魔勢力。",
        "translation": "I've subdued all the non-Buddhists, dissidents, moved Māra's palace, and destroyed Māra's power.",
        "source": "T12n0380_001:0945b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大師子吼作諸佛事，建丈夫業，滿本誓願，護持法眼，教大聲聞，授菩薩記，為於未來佛眼不斷故。",
        "translation": "The great lion's roar performed all these Buddha-works, built up my husband's karma, fulfilled my vows, protected the Dharma eye, taught the great śrāvakas, and granted the bodhisattva's imprimatur in order to keep the Buddha's eye open in the future.",
        "source": "T12n0380_001:0945b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0380_001:0945b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今於後更無所作，唯般涅槃。」",
        "translation": "Now, there's nothing I can do after this, except parinirvāṇa.\"",
        "source": "T12n0380_001:0945b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿難聞是語已，為憂箭所射，極大愁惱，悲泣流淚白佛言：「世尊！",
        "translation": "After hearing these words, Ānanda was shot by an arrow of grief and became extremely distressed, weeping with sorrow, and he said to the Buddha, \"Bhagavān!",
        "source": "T12n0380_001:0945b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆伽婆！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0945b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃太速。",
        "translation": "Nirvāṇa is too fast.",
        "source": "T12n0380_001:0945b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修伽陀！",
        "translation": "(Skt. sugata)!",
        "source": "T12n0380_001:0945b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃太速。",
        "translation": "Nirvāṇa is too rapid.",
        "source": "T12n0380_001:0945b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間眼滅、世間孤獨、世間無救，無有導師。」",
        "translation": "The world's eyes perish, the world is alone, the world is hopeless, and there's no teacher.\"",
        "source": "T12n0380_001:0945b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告慧命阿難：「止，莫憂悲。",
        "translation": "It was then that the Buddha addressed Ānanda with wisdom, \"Stop, don't be sad and compassionate.",
        "source": "T12n0380_001:0945b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0380_001:0945b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生法、有法、有為法、壞法若不滅者，無有是處。",
        "translation": "\"If it doesn't cease to be a thing that arises, exists, is created, or breaks down, there's no place for it.",
        "source": "T12n0380_001:0945b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔告汝，一切所愛、稱意等事，必有離散。",
        "translation": "I've told you in the past that all the things you love and desire will surely come to pass.",
        "source": "T12n0380_001:0945b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0380_001:0945c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已慈心、不二心、無惡心及與身業，孝養隨順而無限量侍養於我。",
        "translation": "With kindness, nonduality, absence of evil intent, and physical actions, you've been dutiful, obedient, and served me without limit.",
        "source": "T12n0380_001:0945c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0380_001:0945c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復天、人、阿修羅等，給侍供養聲聞、緣覺，若減一劫、若滿一劫，若復給侍供養如來於一念頃，其福多彼。",
        "translation": "\"If gods, humans, asuras, and others were to give offerings to śrāvakas and pratyekbuddhas, and if they were to subtract an eon or complete an eon, and if they were to give offerings to the Tathāgata in an instant of thought, their merits would be many and varied.",
        "source": "T12n0380_001:0945c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已供養大神通佛乃至般涅槃，當得大福、廣大功德。",
        "translation": "Once you've made offerings to the buddhas of great supernormal powers up to parinirvāṇa, you'll attain great fortune and vast merit.",
        "source": "T12n0380_001:0945c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如甘露——第一甘露、最後甘露——究竟涅槃。",
        "translation": "It's like the nectar-the first and last nectar-that is, final nirvāṇa.",
        "source": "T12n0380_001:0945c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T12n0380_001:0945c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝莫憂悲。」",
        "translation": "Don't be sad and pity.\"",
        "source": "T12n0380_001:0945c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿難憂悲抆淚，即為如來於雙樹間猶如師子右脇臥法安置敷具。",
        "translation": "At that point, Ānanda wept with sadness and pity, and he placed a cloth for the Tathāgata between two trees like a lion reclining on his right side.",
        "source": "T12n0380_001:0945c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時三千大千世界所有樹木、藥草、叢林皆向如來涅槃方所，有欲倒者、有傴僂者、有欲至地者、有躄地者。",
        "translation": "At that moment, all the trees, medicinal plants, and groves of the 3,000 great one-thousand worlds were headed toward the Tathāgata's place of nirvāṇa, and there were those who wished to fall down, those who were bent over, those who wished to reach the ground, and those who were crippled.",
        "source": "T12n0380_001:0945c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此三千大千世界所有眾流——大河、小河、泉池、陂湖——佛神力故，止不流動。",
        "translation": "All the streams of the 3,000 great one-thousand worlds - large rivers, small rivers, springs, ponds, and lakes - are stopped and don't flow because of the Buddha's supernormal power.",
        "source": "T12n0380_001:0945c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界所有禽獸，佛神力故，默然而住，不鳴、不食。",
        "translation": "All the animals of the 3,000 great one-thousand worlds that live in silence because of the Buddha's supernormal power don't squawk or eat.",
        "source": "T12n0380_001:0945c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界所有日、月、星宿、火光、明珠乃至熒火，佛神力故，皆不顯現，無有光明，不能照曜。",
        "translation": "All the suns, moons, stars, fires, pearls, and even glowing fires of the 3,000 great thousand worlds are unmanifest and lack light, and they don't shine because of the Buddha's supernormal power.",
        "source": "T12n0380_001:0945c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界所有猛火，佛神力故，皆悉止息，不然、不熱、不能燒炙。",
        "translation": "All the fierce fires in 3,000 great thousand worlds that are caused by the Buddha's supernormal power are calmed, or they don't burn, don't heat up, and can't be scorched.",
        "source": "T12n0380_001:0945c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界所有一切地獄猛火，佛神力故，皆悉清涼。",
        "translation": "All the fierce fires of the hells in the 3,000 great one-thousand worlds are cooled by the Buddha's spiritual power.",
        "source": "T12n0380_001:0945c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸地獄所有眾生於剎那頃，佛神力故，皆得安樂。",
        "translation": "For a moment, all the sentient beings in those hells will attain well-being because of the Buddha's supernormal power.",
        "source": "T12n0380_001:0945c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界所有畜生，一切皆起慈心、愍心，不相瞋惱、加害斷命；一切餓鬼皆不飢渴；一切眾生，佛神力故，身心踊悅，離苦得猗，具足稱意第一安樂。",
        "translation": "All of the animals in the 3,000 great one-thousand worlds are kind and compassionate, don't get angry with each other, and cut off their lives; all hungry ghosts don't starve or thirst; and all sentient beings, by the power of the Buddha's spirit, are delighted in body and spirit, partake of suffering, and attain freedom from it, and are perfectly satisfied with the first level of well-being.",
        "source": "T12n0380_001:0945c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於世尊右脇臥時，三千大千世界於中所有須彌山王、鐵圍山、大鐵圍山、目真隣陀山、香山、雪山及諸黑山、大地、大海，一切皆悉六種震動，所謂動、踊、起、震、吼、覺。",
        "translation": "When the Bhagavān was lying on his right side, all of Sumeru, Mt. Tiewei, Mt. Tai Tiewei, Mt. Maudgalyāyana, Mt. Xiang, Mt. Snow, the black mountains, the great earth, and the ocean in the 3,000 great one-thousand worlds were all shaken in six ways, which are called moving, rousing, rising, shaking, roaring, and awakening.",
        "source": "T12n0380_001:0945c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界一切風輪皆不鼓動。",
        "translation": "None of the three thousand great one-thousand worlds' wind-wheels are agitated.",
        "source": "T12n0380_001:0945c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生於剎那頃捨諸作業得猗而住，離於睡眠，心無散亂，欲作皆息，默然無聲。",
        "translation": "In a moment's time, all sentient beings abandon their activities and attain calm abiding, parting with drowsiness, with no distraction in their minds, and with their desires all calmed, and they are silent.",
        "source": "T12n0380_001:0945c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千世界所有天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽，梵天、釋天、護世王等，佛神力故，各見宮殿、床座、園林皆悉闇昧，無復威光，不生愛樂，彼等眷屬憂煩不樂。",
        "translation": "All the gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, Brahmā gods, Śakra gods, and world-protecting kings of the 3,000 great one-thousand worlds see that their palaces, seats, and groves are all darkened and lack radiance, and they don't take delight in them because of the Buddha's spiritual power, and their followers are sad and unhappy.",
        "source": "T12n0380_001:0946a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "千世界主梵天王、三千大千世界主大梵天王，高心自恃，作如是念、作如是解：「念此世界及諸眾生是我所作、是我所化。」",
        "translation": "The thousand worlds lord of Brahmā and the 3,000 great worlds lord of Brahmā became proud and had this thought and understanding, \"Mindful that this world and its sentient beings are mine to make and mine to transform.\"",
        "source": "T12n0380_001:0946a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼三千大千世界主大梵天王，佛神力故，見己宮殿及床座等闇昧無光，不生愛樂；摩醯首羅淨居天等亦復如是。",
        "translation": "Because of the Buddha's spiritual power, the king of Brahmā, lord of the 3,000 great worlds, didn't delight in seeing his palace and seats, which were dark and devoid of light, and so did Mahêśvara, the god of the pure abodes.",
        "source": "T12n0380_001:0946a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，三千大千世界主大梵天王作如是念：「是誰力故而現此相？",
        "translation": "At the time, the king of the Brahmā gods, lord of the 3,000 worlds, had this thought, \"Who is it that's showing this form by the power of the Buddha?",
        "source": "T12n0380_001:0946a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令我不樂宮殿、床座。」",
        "translation": "It makes me unhappy in my palace and seat.\"",
        "source": "T12n0380_001:0946a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，大梵天王遍觀於此三千大千世界中造作富貴大自在主——如來、應供、正遍知——今日後夜當般涅槃，是故現此神力變化、不可思議、未曾有事，此之神力正是如來入涅槃相。",
        "translation": "At the time, the king of the Brahmas was observing that the wealthy, powerful, and greatly sovereign lord Tathāgata, Worthy of Offerings, and Perfectly Omniscient One who had created this great chiliocosm in these 3,000 great one-thousand worlds would [enter] parinirvāṇa later today, and therefore was manifesting this unfathomable, unfathomable, and unprecedented miraculous power, which was precisely the Tathāgata's entry into parinirvāṇa.",
        "source": "T12n0380_001:0946a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大梵王作是念已，憂愁不樂，戰悚毛竪，極疾怱怱，梵眾圍遶，共詣佛所。",
        "translation": "After he had this thought, the king of the Brahmas became sad and unhappy, became frightened and had his hair stand on end, and hurried hurried hurried hurried hurried, and was surrounded by Brahmas who rushed to the Buddha's place.",
        "source": "T12n0380_001:0946a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其三千大千世界諸餘梵天，皆悉已曾信受聖法、安住聖法。",
        "translation": "All the other Brahmā gods of the 3,000 great one-thousand worlds had believed in the noble teaching and had abided in it for a long time.",
        "source": "T12n0380_001:0946a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，三千大千世界主大梵天王到佛所已，頭面作禮而白佛言：「唯願世尊教勅於我，云何而住？",
        "translation": "At the time, the ruler of the 3,000 great worlds, Brahma King, went to the Buddha, paid homage with his head and face, and said to him, \"May the Bhagavān teach and command me, how should I abide?",
        "source": "T12n0380_001:0946a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修行？」",
        "translation": "How do we practice?\"",
        "source": "T12n0380_001:0946a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，如來即問大梵王言：「梵天！",
        "translation": "After making this statement, the Tathāgata then asked King Brahmā, \"Brahmā!",
        "source": "T12n0380_001:0946a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今實作如是念言：『我是大梵天，我能勝他、他不如我，我是智者。",
        "translation": "'Now, you really think this thought, 'I'm a great brahma god, I'm superior to others and they're not like me; I'm wise.",
        "source": "T12n0380_001:0946a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是三千大千世界中大自在主，我造作眾生、化作眾生，我造作世界、化作世界。』",
        "translation": "I'm the great sovereign of the 3,000 great worlds, and I create and transform sentient beings, and I create and transform worlds.'",
        "source": "T12n0380_001:0946a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不？」",
        "translation": "No?\"",
        "source": "T12n0380_001:0946a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大梵天言：「如是，婆伽婆！",
        "translation": "The Mahābrahma gods said, \"So it is, Bhagavān!",
        "source": "T12n0380_001:0946a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，修伽陀！」",
        "translation": "Thus, *Sugata!\"",
        "source": "T12n0380_001:0946a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復為誰所作？",
        "translation": "For whom else did you do this?",
        "source": "T12n0380_001:0946a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為誰所化？」",
        "translation": "For whose sake was it created?\"",
        "source": "T12n0380_001:0946a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼梵天默然而住。",
        "translation": "The Brahma gods then stood silently.",
        "source": "T12n0380_001:0946a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見梵天默然住故，而復問言：「梵天！",
        "translation": "Seeing the Brahma gods standing silently, the Buddha again asked, \"Brahmā!",
        "source": "T12n0380_001:0946a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有時三千大千世界為劫火焚燒，炎熾洞然。",
        "translation": "There's a time when the 3,000 great one-thousand worlds are engulfed in a blazing eon of fire.",
        "source": "T12n0380_001:0946b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化耶？」",
        "translation": "Did you do it or did you make it?\"",
        "source": "T12n0380_001:0946b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大梵天而白佛言：「不也，世尊！」",
        "translation": "The Mahābrahma gods then said to the Buddha, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此，大地依水聚住、水依風住、風依虛空。",
        "translation": "Thus, the earth stands on a mass of water, the water stands on a breeze, and the breeze stands on space.",
        "source": "T12n0380_001:0946b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，大地厚六百八十萬由旬，不裂不散。",
        "translation": "Thus, the earth is 6.8 million leagues thick, doesn't split apart, and doesn't disintegrate.",
        "source": "T12n0380_001:0946b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化耶？」",
        "translation": "Did you do it or did you make it?\"",
        "source": "T12n0380_001:0946b06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三千大千世界百億日月流轉之時，梵天！",
        "translation": "When these ten billion suns and moons of the three thousand great one-thousand worlds are in flux, Brahmā!",
        "source": "T12n0380_001:0946b07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所化耶？」",
        "translation": "Is this what you've made it to be?\"",
        "source": "T12n0380_001:0946b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有時日月天子不在宮殿，宮殿空虛。",
        "translation": "There are times when the sun and moon gods are absent from their palaces, and their palaces are empty.",
        "source": "T12n0380_001:0946b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，春、秋、冬、夏時節，於意云何？",
        "translation": "\"Thus, what do you think about the spring, autumn, winter, and summer seasons?",
        "source": "T12n0380_001:0946b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，水、鏡、蘇油、摩尼、頗梨及餘淨器現諸色像——所謂大地、山河、樹林、園苑、宮殿、舍宅、聚落、城邑、駝、驢、象、馬、麞、鹿、鳥、獸、日、月、星宿、聲聞、緣覺、菩薩、如來、釋梵、護世、人非人等種種色像。",
        "translation": "Thus, the water, mirror, sesame oil, maṇi, pāri, and other pure things appear as various forms-namely, images of the earth, mountains, rivers, trees, forests, parks, palaces, mansions, settlements, cities, camels, donkeys, elephants, horses, deer, birds, animals, the sun, moon, stars, śrāvakas, pratyekbuddhas, bodhisattvas, tathāgatas, Brahmā, world protectors, humans and nonhumans, and so on.",
        "source": "T12n0380_001:0946b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，山崖、深谷、大小諸鼓、歌舞等戲、麞、鹿、鳥、獸、人、非人等所出音聲。",
        "translation": "\"So it is with the sounds that come from cliffs, deep valleys, large and small drums, singing and dancing, games, animals, deer, birds, beasts, humans, non-humans, and so forth.",
        "source": "T12n0380_001:0946b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946b22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946b22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸眾生於其夢中見種種色、聞種種聲、嗅種種香、甞種種味、覺種種觸、知種種法、作種種戲，種種啼哭、呻號、怖畏、苦樂等受。",
        "translation": "\"Suppose sentient beings in a dream see various forms, hear various sounds, smell various smells, taste various tastes, feel various sensations, know various dharmas, perform various actions, and experience various kinds of lamentations, groans, fears, pains, and pleasures.",
        "source": "T12n0380_001:0946b24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946b26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946b27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946b27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946b28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946b28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如四姓人端正、醜陋，貧窮、巨富，福德多少，善戒、惡戒，善慧、惡慧。",
        "translation": "They're like the four castes of people who are decent and ugly, poor and rich, more or less fortunate, who have good and bad morals, and who have good and bad wisdom.",
        "source": "T12n0380_001:0946b28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946c01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946c01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946c01_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946c02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946c02_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生所有怖畏、苦切、惱害——所謂水、火、刀、風、崖岸、毒藥、惡獸、怨讐、人非人畏及以種種加害，於他常有怖畏。",
        "translation": "\"All the fears, sufferings, and disturbances of sentient beings - called water, fire, sword, wind, cliffs, poison, wild animals, enemies, human and non-human fears, and various other kinds of harm - are always fearful to others.",
        "source": "T12n0380_001:0946c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所有種種疾病——所謂風、冷、熱病及諸雜病，時節代謝四大相違——若他所作、若先業報，所謂眼、耳、鼻、舌、身病，若復眾生種種心意熱惱等苦。",
        "translation": "\"All the various illnesses of sentient beings - called wind, cold, fever, and other diseases, the four major contradictions in the metabolism of seasons - are called diseases of the eyes, ears, nose, tongue, and body if they're caused by others or by the results of prior actions, and they're also suffering from the various mental agitations of sentient beings.",
        "source": "T12n0380_001:0946c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所有曠野嶮賊、水災等難，或復中劫刀兵、疫病及以飢饉，梵天！",
        "translation": "\"All the difficulties of sentient beings in the wilderness, such as pests and thieves, floods, and other disasters, or even eons, armies, epidemics, and famine, Brahmā!",
        "source": "T12n0380_001:0946c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所有愛別離苦——所謂父母、兄弟、姊妹、宗親、善友離別之苦。",
        "translation": "\"All sentient beings experience the pain of separation from what they love-the pain of separation from parents, brothers, sisters, relatives, and good friends.",
        "source": "T12n0380_001:0946c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946c18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所作種種惡業——所謂販賣生口、酒麴、紫礦、押油之具——若入大海曠野嶮處遊行諸方、若諸仙方術及餘種種斷事之法。",
        "translation": "The various bad actions that sentient beings do - selling raw mouths, alcohol, malt, purple ore, and implements for betting on oil - are like entering the ocean, wandering through wild places, wandering to different directions, performing conjuring techniques, and various other methods of eliminating things.",
        "source": "T12n0380_001:0946c18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946c21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946c21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946c22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946c22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0946c23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所作種種業道，以是業因受於地獄、畜生、餓鬼、人、天之報。",
        "translation": "The various karmic activities of sentient beings bring about the results of those activities in hell, the animal kingdom, hungry ghosts, humans, and gods.",
        "source": "T12n0380_001:0946c23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所有若身、口、意、善行、惡行及世間所有十惡業道，於諸眾生都無慈愍，作諸苦惱、不利益事，墮惡道因緣，所謂殺生、偷盜、邪婬、妄語、兩舌、惡口、綺語、貪瞋、邪見。",
        "translation": "Whether it's physical, verbal, mental, good or bad actions and the ten bad karmic destinies of the world, sentient beings lack compassion, do painful and unbeneficial things, and fall into the causes and conditions of bad destinies, which are killing, stealing, harmful sexual behavior, false speech, duplicity, harsh words, fancy speech, craving and anger, and wrong views.",
        "source": "T12n0380_001:0946c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0946c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0946c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0946c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0946c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所有種種苦事——所謂斬首、截其手足、刵劓耳鼻、節節支解、熱油所灌、火炙熬煑、刀劍鉾矟斫刺鞭打、繫閉牢獄、鬪諍言訟。",
        "translation": "\"All the various painful things that sentient beings experience-being beheaded, having their hands and feet amputated, having their ears and nose cut off, having their joints dismembered, being doused with hot oil, being scalded by fire, being lashed and whipped with swords and spears, being confined to prison, and being engaged in disputes and arguments-are painful.",
        "source": "T12n0380_001:0947a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所作婬欲邪行——或婬母女、姊妹、淨持戒者——及餘惡業。",
        "translation": "Sentient beings engage in sexual misconduct - or in the sexual misconduct of their mothers, daughters, sisters, or those who observe the precepts - and other bad actions.",
        "source": "T12n0380_001:0947a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所有種種殺害——厭蟲起屍、呪術方藥、鬼魅所著及餘種種惡業方便斷命因緣。",
        "translation": "All the various ways sentient beings are killed - by bugs, corpses, spells, prescriptions, demonic attachments, and other causes and conditions of bad karma that shorten life.",
        "source": "T12n0380_001:0947a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有生、老、病、死、憂、悲、苦惱、無常法、盡法、變易法，於四姓人無所忌難，能令一切所愛無厭、種種之物敗壞離散。",
        "translation": "\"All of the world's births, old age, illnesses, deaths, grief, sorrow, pain, vexations, impermanent things, ended things, and changing things are nothing to be afraid of for people of the four lineages, and they cause all their desires to be unwearying and all kinds of things to spoil and disintegrate.",
        "source": "T12n0380_001:0947a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所有貪、瞋、癡障結使纏縛，及餘種種苦惱所縛，以是因緣令諸眾生堅著瞋怒迷惑心故，造作無量種種業行。",
        "translation": "\"All the hindrances of greed, anger, and delusion that binding sentient beings to the bonds of these hindrances and the other kinds of suffering and distress cause sentient beings to persist in their anger and delusion, creating measureless varieties of karmic actions.",
        "source": "T12n0380_001:0947a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947a20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947a20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947a20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947a21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有三惡趣——地獄、畜生、餓鬼——其處眾生為種種事受諸苦惱。",
        "translation": "\"All beings in the three evil destinies-hell, animals, and hungry ghosts-where sentient beings experience suffering and distress for a variety of reasons.",
        "source": "T12n0380_001:0947a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切所有，若種子生、無種子生，樹木、藥草；若水陸生，華果、香樹，種種勝味——甘、苦、醎、辛、酸、澁之味——隨諸眾生所憙、不憙作損益者。",
        "translation": "\"All of them, whether produced from seeds or seedless seeds, trees, medicinal plants, whether produced on land or water, flowers and fruits, fragrant trees, and various excellent flavors - sweet, bitter, salty, pungent, sour, and tasty - are enjoyed by sentient beings according to their joys and don't cause harm to them.",
        "source": "T12n0380_001:0947a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，世尊！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五道流轉，生死成壞，所有眾生無明覆蓋與愛結相應，馳走流轉始終難知，及未來生死流轉不斷其處。",
        "translation": "\"As the five destinies of transmigration and the formation and decay of birth-and-death, all sentient beings are covered by ignorance and tied to the bond of craving, move about in a state of beginning and end that's difficult to know, and the transmigration of future birth-and-death doesn't stop there.",
        "source": "T12n0380_001:0947a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人、天，若魔、若梵、沙門、婆羅門，此等世間如亂絲纏縛，常馳流轉彼此往來，此諸眾生於流轉中不知求出。",
        "translation": "Like men and gods, Māra, Brahmā, ascetics, and priests, these worlds are tethered by tangled threads, constantly churning and moving back and forth with each other, and these sentient beings in their transmigration don't know how to escape.",
        "source": "T12n0380_001:0947b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0947b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是汝所作、是汝所化、是汝所加耶？」",
        "translation": "Did you do it, did you make it, did you add it?\"",
        "source": "T12n0380_001:0947b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不也，婆伽婆！」",
        "translation": "The Brahmans said, \"No, Bhagavān!\"",
        "source": "T12n0380_001:0947b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝從何因作是念言：『此諸眾生是我所作、是我所化、是我所加；所有世界是我所作、是我所化、是我所加。』",
        "translation": "What cause did you have for thinking this thought, 'These beings are mine to do, mine to make, and mine to add; all the worlds are mine to do, mine to make, and mine to add?'",
        "source": "T12n0380_001:0947b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶？」",
        "translation": "Yes?\"",
        "source": "T12n0380_001:0947b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「世尊！",
        "translation": "The Brahmans said, \"Bhagavān!",
        "source": "T12n0380_001:0947b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以無智邪見、未斷顛倒心故，常於如來所說正法不聽受故，我本曾作如是惡見、如是惡說：『此諸眾生是我所作、是我所化；所有世界是我所作、是我所化。』",
        "translation": "Because I lacked knowledge and mistaken views and hadn't yet stopped my mistaken mind, I often didn't listen to or accept the correct teaching given by the Tathāgata, and I had previously held such a bad view and such a bad teaching, 'I made these sentient beings and created them; I made all the worlds and created them.'",
        "source": "T12n0380_001:0947b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0947b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今還復問佛此義，所有世界是誰所作、是誰所化？",
        "translation": "Now, I would again like to ask the Buddha about this meaning: \"Who made all the worlds and who created them?",
        "source": "T12n0380_001:0947b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生是誰所作、是誰所化、是誰所加、是誰力生？」",
        "translation": "Who are the works of all sentient beings, who are they created by, who are they added to, and by whose power are they produced?\"",
        "source": "T12n0380_001:0947b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「梵天！",
        "translation": "The Buddha said, \"Brahmā!",
        "source": "T12n0380_001:0947b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有世界是業所作、是業所化；一切眾生是業所作、是業所化、業力所生。",
        "translation": "All the worlds are created by actions, which are created by actions, and all sentient beings are created by actions, which are created by actions, and which are produced by the power of actions.",
        "source": "T12n0380_001:0947b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0947b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明緣行、行緣識、識緣名色、名色緣六入、六入緣觸、觸緣受、受緣愛、愛緣取、取緣有、有緣生、生緣老、死、憂、悲、苦惱，故有如是大苦聚集。",
        "translation": "As nescience is conditioned by form, form is conditioned by consciousness, consciousness is conditioned by name-and-form, name-and-form is conditioned by the six sense-fields, the six sense-fields is conditioned by contact, contact is conditioned by feeling, feeling is conditioned by craving, craving is conditioned by grasping, grasping is conditioned by existence, existence is conditioned by birth, birth is conditioned by old age, death, grief, sorrow, pain, and vexation, there is thus a great aggregate of suffering.",
        "source": "T12n0380_001:0947b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明滅乃至憂、悲、苦惱滅，更無作者、使作者、安置者，唯有業、有法、和合因緣，故有眾生。",
        "translation": "When nescience ceases and grief, sorrow, and suffering and vexation cease, there's no author, agent, or settler, but only karma, dharmas, and the causes and conditions for their combination, which is why there are sentient beings.",
        "source": "T12n0380_001:0947b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能離此業、法、和合，當知是人則能遠離生死流轉。",
        "translation": "If someone can part with this combination of actions, dharmas, and causes, they should know that they're able to part with the transmigration of birth-and-death.",
        "source": "T12n0380_001:0947b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，世間業盡，煩惱盡、苦盡、苦息。",
        "translation": "Thus, worldly activity ends, affliction ends, suffering ends, and pain ceases.",
        "source": "T12n0380_001:0947b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是出離，是名得於寂定涅槃。",
        "translation": "Thus escaping, this is called attaining nirvāṇa of quiescent concentration.",
        "source": "T12n0380_001:0947b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵天！",
        "translation": "\"Brahmā!",
        "source": "T12n0380_001:0947b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼誰得涅槃？",
        "translation": "Who will attain nirvāṇa there?",
        "source": "T12n0380_001:0947b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若業是業盡、若煩惱是煩惱離、若苦是苦息，如是等法，以諸佛神力故，諸佛所加故有。",
        "translation": "If actions are ended, if afflictions are removed, and if suffering is stopped, such things exist because of the buddhas' spiritual powers and because they are imposed by the buddhas.",
        "source": "T12n0380_001:0947b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0947b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947b29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非諸佛出世顯說，則不聞有如是等法。",
        "translation": "Such a teaching wouldn't have been heard unless the buddhas had appeared in the world and revealed it.",
        "source": "T12n0380_001:0947b29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947c01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸佛、世尊出興世時，得有顯說如是寂定甚深難覺光明法門。",
        "translation": "\"When the buddhas and the Bhagavān appeared in the world, they could have explained this approach of calm concentration, profundity, and difficult-to-understand radiance.",
        "source": "T12n0380_001:0947c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生得聞生法，從生得解脫；得聞老、病、死、憂、悲、苦惱法，從彼老、病、死、憂、悲、苦惱法而得解脫。",
        "translation": "If sentient beings could hear the teaching of birth, they'd be liberated from birth; and if they could hear the teaching of old age, illness, death, grief, sorrow, pity, and suffering and vexation, they'd be liberated from that teaching of old age, illness, death, grief, pity, and suffering and vexation.",
        "source": "T12n0380_001:0947c03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0947c05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸佛現作是加。",
        "translation": "Therefore, the buddhas now make this addition.",
        "source": "T12n0380_001:0947c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵天！",
        "translation": "\"Brahmā!",
        "source": "T12n0380_001:0947c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛作是開示顯說，所謂諸行猶如光影，無常、動轉、不定、不究竟、盡法、變易法。",
        "translation": "Thus, the buddhas reveal and explain that conditioned phenomena are like light and shadow, which are impermanent, changing, inconclusive, incomplete, exhaustive, and liable to change.",
        "source": "T12n0380_001:0947c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使諸佛滅度之後，正法隱沒，亦復如是，示現所加，所謂諸行猶如光影。",
        "translation": "Even if the right Dharma were to disappear after the buddhas' deaths, it would likewise be like this, showing what's added, which is called practices like light and shadow.",
        "source": "T12n0380_001:0947c07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛不現，一切諸行於剎那頃如光影者，則不應說一切諸行猶如光影、如夢、如響。",
        "translation": "If the Buddha doesn't appear and all conditioned things are like light and shadow in a moment, then it shouldn't be said that all conditioned things are like light and shadow, like a dream, or like a resonance.",
        "source": "T12n0380_001:0947c09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵天！",
        "translation": "\"Brahmā!",
        "source": "T12n0380_001:0947c11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛以知一切諸行，猶如光影、如夢、如響、無常、動轉、盡法、變易法故，說言諸行猶如光影、如夢、如響。",
        "translation": "The buddhas say that all conditioned things are like light and shadow, like a dream, like a sound, impermanent, changing, and transient, because they know that they are like light and shadow, like a dream, like an enduring dharma, and like a sound.",
        "source": "T12n0380_001:0947c11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者於彼觀其相已，以其相、以其攀緣因緣義故，得知諸行無常、動轉、盡法、變易法，破壞離散、時節代謝。",
        "translation": "After observing their characteristics, wise people know that formations are impermanent, changing, exhaustive, and liable to change based on their characteristics and the meaning of their causal attachments, and that they are destroyed, scattered, and decayed in time.",
        "source": "T12n0380_001:0947c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於剎那頃乃至日、夜、半月，乃至一月、一歲，乃至百歲、一劫，乃至百劫一切盡壞。",
        "translation": "In a moment's time, it can last from day to night and half a month, from a month to a year, from a hundred years to an eon, and from a hundred eons to the end of everything.",
        "source": "T12n0380_001:0947c16_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有大火聚，然已還滅；有大水聚，流已還止；有大猛風，吹已還息。",
        "translation": "There's a great conflagration that goes out when it does, a great flood that flows and stops, and a great wind that blows and subsides.",
        "source": "T12n0380_001:0947c18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世界大地有已還無；有諸大山——所謂鐵圍山、大鐵圍山、須彌山及諸黑山等——有已還無；日、月、星宿及諸眷屬有已還無，不明、不照，而復墮落。",
        "translation": "After the world's great land exists, it's gone; after it exists, the great mountains - called Mount Telegraph, Mount Telegraph, Mount Sumeru, and the black mountains - are gone; after the sun, moon, stars, and their retinues exist, they are gone, unknown, unillumined, and fallen back.",
        "source": "T12n0380_001:0947c19_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天宮殿有已還滅；諸有王都、城邑、聚落、樹林、園池、可樂之事生已還滅；諸天人等生已還滅、滅已復生。",
        "translation": "The palaces of the gods return to extinction after existing, the capitals, cities, towns, villages, forests, parks, and pleasant things that exist return to extinction after being born, and the gods and humans return to extinction after being born, and they are born again after ceasing.",
        "source": "T12n0380_001:0947c22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸有智者見其相已，心生厭離，以此諸行無常、離壞變易盡故，以平等信心捨家出家，得知諸行猶如光影、如夢、如響。",
        "translation": "\"Seeing these things, intelligent people become disillusioned, and because these things are impermanent and free from decay and change, they abandon their homes and leave home with equal faith, realizing that these things are like light and shadow, like a dream, and like a sound.",
        "source": "T12n0380_001:0947c25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及見水中日、月、星宿等諸光影已，以彼相、以彼攀緣因緣義故得到菩提。",
        "translation": "After seeing the sun, moon, stars, and other lights and shadows in the water, he attains enlightenment based on those characteristics and on the meaning of those causal attachments.",
        "source": "T12n0380_001:0947c27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸智士蒙佛教勅及善友教授，或自思惟，得知諸行猶如光影、如夢、如響，生於信心捨家出家。",
        "translation": "Some wise men are commanded by the Buddha and taught by good friends, or they themselves reflect on it and learn that their actions are like light and shadow, like a dream, and like a sound, and they become confident enough to leave home and leave home.",
        "source": "T12n0380_001:0947c29_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有得證須陀洹果、斯陀含果、阿那含果、阿羅漢果；若大乘人或得初忍、或得第二、第三忍及能得到無上菩提。",
        "translation": "Some may realize the fruit of stream entry, the fruit of once-returning, the fruit of non-returning, or the fruit of the arhat, or some great vehicle person may attain first forbearance, second or third forbearance, and unsurpassed enlightenment.",
        "source": "T12n0380_001:0948a02_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使諸佛滅度之後，於世間中亦復如是說法流行。",
        "translation": "Suppose this is how the teaching spreads in the world after the buddhas have ceased to exist.",
        "source": "T12n0380_001:0948a05_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生得聞法已，於三乘得度——所謂聲聞、辟支佛乘、一切種智無上大乘。",
        "translation": "If sentient beings hear the teaching, they'll attain salvation in the three vehicles-the vehicle of the śrāvakas, the vehicle of the solitary buddhas, and the unsurpassed great vehicle of omniscience.",
        "source": "T12n0380_001:0948a06_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵天！",
        "translation": "\"Brahmā!",
        "source": "T12n0380_001:0948a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應當知此法次第亦是諸佛之所加也。",
        "translation": "You should know that this sequence of things is also imposed by the buddhas.",
        "source": "T12n0380_001:0948a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，智者見其相已，心生厭離，能知諸行是無常苦，動轉不定盡法、變易法，猶如光影、如夢、如響。",
        "translation": "Therefore, after seeing its characteristics, a wise person becomes disillusioned with it and can know that conditioned phenomena are impermanent and painful, and that things that move and change are inexhaustible and impermanent, just like light and shadow, like a dream, and like a sound.",
        "source": "T12n0380_001:0948a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵天！",
        "translation": "\"Brahmā!",
        "source": "T12n0380_001:0948a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等亦是諸佛境界、諸佛所加。",
        "translation": "\"These are also the objects of the buddhas and the marks placed on them by the buddhas.",
        "source": "T12n0380_001:0948a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸眾生已曾修行因成就者，得聞如是正法聲已，於如來所思念敬信：一切諸行無常壞滅，猶如光影、如夢、如響。",
        "translation": "After hearing the sound of the right teaching, sentient beings who have cultivated the cause and accomplished it before will consider and venerate the Tathāgata's presence, believing that all conditioned things are impermanent and decay like light and shadow, like a dream, and like a resonance.",
        "source": "T12n0380_001:0948a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸眾生於諸佛所曾修梵行者、或有在家受禁戒者，以是因緣解知如是一切諸行無常壞滅，猶如光影、如夢、如響；知已生信，捨家出家。",
        "translation": "If there are sentient beings who have practiced the religious practice of the buddhas or who are householders and have received the prohibited precepts, because of these causes and conditions they understand that all conditioned things are impermanent and decay like light and shadow, like a dream, and like a sound, and after knowing this, they become convinced and leave home.",
        "source": "T12n0380_001:0948a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊雖未出世，以有如是諸佛加故、以諸佛所種善根故，得到菩提。",
        "translation": "Even though the buddhas have yet to appear in the world, they've attained enlightenment because of the presence of such buddhas and the good roots they've planted.",
        "source": "T12n0380_001:0948a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵天！",
        "translation": "\"Brahmā!",
        "source": "T12n0380_001:0948a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是知，此等皆是諸佛境界、諸佛所加。",
        "translation": "You should thus know that these are all realms of the buddhas and imposed by the buddhas.",
        "source": "T12n0380_001:0948a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0948a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三千大千世界非梵剎土、亦非外道六師剎土，唯是我等諸佛剎土。",
        "translation": "These 3,000 great one-thousand worlds are not the land of Brahmā's buddhas or the buddhas of the six non-Buddhist teachers, but only our buddhas' buddha-lands.",
        "source": "T12n0380_001:0948a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵天！",
        "translation": "\"Brahmā!",
        "source": "T12n0380_001:0948a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔於此無量百千億那由他阿僧祇劫修菩薩行，無量阿僧祇諸如來所種無量阿僧祇善根、淨持禁戒、苦修梵行及修無量百千億那由他難行、苦行，攝此佛土，修治令淨。",
        "translation": "In the past, I cultivated the bodhisattva practice during measureless hundreds of billions of incalculable eons, planted measureless incalculable good roots by measureless incalculable tathāgatas, purified the observance of precepts, cultivated the ascetic practices, and cultivated measureless hundreds of billions of nayutas of difficult and painful practices to collect this Buddha-land and purify it.",
        "source": "T12n0380_001:0948a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸眾生所修善根，隨其所堪而清淨者、隨其時器應得度者，我於長夜以四攝事攝此眾生——所謂布施、愛語、利行、同事。",
        "translation": "As sentient beings cultivate good roots, purify them according to their ability, and attain salvation according to their ability at the right time, I've collected these sentient beings in four ways over the long haul-namely, generosity, loving words, beneficial actions, and coworkers.",
        "source": "T12n0380_001:0948a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等以我誓願力故，生此佛土、聞我說法即能信解，不復歸信梵、釋、護世、諸天王等。",
        "translation": "Because of the power of my vow, they're born in this Buddha land, hear my teachings, and are able to believe and understand them, and don't turn back to Brahmā, Śākyamuni, the world protectors, the gods, and so forth.",
        "source": "T12n0380_001:0948a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0948b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是知：此是佛土，非是梵、釋、護世剎土，亦非外道六師剎土。」",
        "translation": "You should thus know that this is the Buddha's land, not the land of Brahmā, Śākyamuni, or the protectors of the world, and not the land of the six masters from another religion.\"",
        "source": "T12n0380_001:0948b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，娑婆世界主大梵天王及百千梵眾現憂愁相，作如是言：「諸佛世尊通達希有勝妙之法。」",
        "translation": "At the time, the Brahma heavenly king, lord of the sahā world, and a hundred thousand Brahmā crowds appeared distressed and said, \"The Bhagavān comprehends rare and wonderful things.\"",
        "source": "T12n0380_001:0948b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是三千大千世界主大梵天王於如來所生希有心——諸佛希有乃有無量不可思議無盡境界。",
        "translation": "The king of Brahmā, lord of the 3,000 great one-thousand worlds, then gave rise to the Tathāgata's attitude of hope that the rare existence of the buddhas was an unfathomably great and inexhaustible state.",
        "source": "T12n0380_001:0948b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大梵天王即時歸依為佛弟子，於世尊所請求教勅，作如是言：「婆伽婆是我大師，修伽陀是我大師。",
        "translation": "The king of Brahmā then reverted to being a disciple of the Buddha, asked for instructions from the Bhagavān, and said, \"Bhagavān is my great teacher, and Sugata is my great teacher.",
        "source": "T12n0380_001:0948b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊教勅於我，云何而住？",
        "translation": "Please let the Bhagavān teach and command me, how should I stay?",
        "source": "T12n0380_001:0948b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修行？」",
        "translation": "How do we practice?\"",
        "source": "T12n0380_001:0948b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告梵天：「此三千大千世界是我佛土，我今以此付囑於汝。",
        "translation": "The Buddha told the Brahmakāyika gods, \"These 3,000 great thousand worlds are my Buddha-lands, and I'm entrusting this to you.",
        "source": "T12n0380_001:0948b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當順我，勿使真道善眼令有斷絕，無上佛眼、法眼、僧眼令有斷絕，莫作末後滅法人也。",
        "translation": "You must obey me and not allow the good eye of the true path to be cut off, or the unsurpassed Buddha-eye, Dharma-eye, or Saṃgha-eye to be cut off, so that you don't become a late-cessation extinct person.",
        "source": "T12n0380_001:0948b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0948b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當有長子童真彌勒菩薩摩訶薩從佛口生、從法化生，大悲憐愍為欲利益一切眾生、欲令得樂、欲令安隱。",
        "translation": "\"There will be the eldest child, the true Maitreya, who is born from the Buddha's mouth and transformed by the Dharma, and who has great compassion and pity for all sentient beings and wants to make them happy and comfortable.",
        "source": "T12n0380_001:0948b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼亦於此三千大千世界如法補處，如我居此等無有異。",
        "translation": "He's also here in this 3,000,000 worlds in a Dharma-supported place, just as I am, living here without any difference.",
        "source": "T12n0380_001:0948b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝既現在隨順我教，亦應順彼，勿令如是真道法母、佛眼、法眼、僧眼而有斷絕。",
        "translation": "Since you're currently following my teaching, you should also follow it, so that such a mother of the true path, the Buddha's eye, the Dharma eye, and the Saṃgha's eye won't be cut off.",
        "source": "T12n0380_001:0948b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0948b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0948b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至如是法母不斷者，隨其時節，佛眼、法眼、僧眼得不斷絕，釋梵天眼、人眼、解脫眼乃至涅槃眼得不斷絕。",
        "translation": "\"Even thus, when the mother of all dharmas doesn't stop, at each time and place, the Buddha's eye, the Dharma eye, and the Saṃgha's eye can be stopped without break, and the eyes of Brahmā, the human eye, the eye of liberation, and even the eye of nirvāṇa can be stopped without break.",
        "source": "T12n0380_001:0948b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0948b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，我今付囑於汝，我此佛土三千大千世界。",
        "translation": "Therefore, I now entrust you with this Buddha-land of mine, a world of 3,000 great one-thousand worlds.",
        "source": "T12n0380_001:0948b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0380_001:0948b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已教勅，汝應隨順，莫作末後滅法人也。」",
        "translation": "I've instructed you to follow my commands, so don't become a late-term extinct person.\"",
        "source": "T12n0380_001:0948b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，三千大千世界所有梵天、大梵天——彼等一切先於聖法已得正信——彼三千大千世界主大梵天王即時於聖法中深得正信。",
        "translation": "At that point, all the brahma gods and great brahma gods of the 3,000 great one-thousand worlds-all of whom had attained right faith in the noble teaching-that great brahma god king, lord of the 3,000 great one-thousand worlds, immediately attained deep right faith in the noble teaching.",
        "source": "T12n0380_001:0948b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大悲經商主品第二",
        "translation": "The Second Chapter of the Sutra of Great Compassion for the Lord of Commerce",
        "source": "T12n0380_001:0948b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有魔子名曰商主——已於佛所深得敬信——聞佛涅槃，心懷憂惱，戰悚毛竪，速詣佛所。",
        "translation": "It was then that a Māra named Lord Māra - who had deeply revered the Buddha - heard about the Buddha's nirvāṇa and rushed to the Buddha with a sad and troubled heart, trembling with fear and hair standing on end.",
        "source": "T12n0380_001:0948c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已頂禮，退住一面而白佛言：「唯願世尊憐愍眾生、安樂眾生、救護世間、憐愍利益諸天人故，住世一劫莫入涅槃。",
        "translation": "When he arrived, he paid homage, withdrew to one side, and said to the Buddha, \"May the Bhagavān have compassion on sentient beings, bring comfort to sentient beings, protect the world, and have compassion on the gods and humans so that they don't enter nirvāṇa for an eon.",
        "source": "T12n0380_001:0948c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦憐愍諸天人故，如是勸請。",
        "translation": "Because I have pity for the gods and humans, I also ask this.",
        "source": "T12n0380_001:0948c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0948c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿使眾生盲冥太速，無有說者、無導、無救、無依、無趣。」",
        "translation": "Don't cause sentient beings to become blind and obscure too quickly; there's no speaker, no guide, no help, no support, and no destination.\"",
        "source": "T12n0380_001:0948c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，商主作是語已，佛即告言：「商主！",
        "translation": "After the merchant made this statement, the Buddha then addressed him, \"Merchant!",
        "source": "T12n0380_001:0948c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝父波旬先已請我令入涅槃，作如是言：『婆伽婆！",
        "translation": "Your father Pāpīyān had previously asked me to let him enter nirvāṇa, saying, 'Bhagavān!",
        "source": "T12n0380_001:0948c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入般涅槃。",
        "translation": "Entering parinirvāṇa.",
        "source": "T12n0380_001:0948c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修伽陀！",
        "translation": "(Skt. sugata)!",
        "source": "T12n0380_001:0948c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入般涅槃。",
        "translation": "Entering parinirvāṇa.",
        "source": "T12n0380_001:0948c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆伽婆！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0948c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者正是入涅槃時。』",
        "translation": "Now is the right time to enter nirvāṇa.'",
        "source": "T12n0380_001:0948c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master merchant!",
        "source": "T12n0380_001:0948c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝父波旬如是請我，我隨彼意許入涅槃。",
        "translation": "Your father Pāpīyān thus invited me, and I granted him permission to enter nirvāṇa according to his wishes.",
        "source": "T12n0380_001:0948c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Prajāpati!",
        "source": "T12n0380_001:0948c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，我今時至，稱其所許，故入涅槃。」",
        "translation": "Because of these causes and conditions, I arrived at this moment and said that I would accept it, so I entered nirvāṇa.\"",
        "source": "T12n0380_001:0948c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主復言：「世尊！",
        "translation": "The merchant again said, \"Bhagavān!",
        "source": "T12n0380_001:0948c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是魔波旬非是我父、非我善友。",
        "translation": "\"That demon Pāpīyān is not my father or my good friend.",
        "source": "T12n0380_001:0948c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常求殺害，是我怨家、大惡知識；常欲令我不得樂事、和合安隱，但作毀壞、不欲利益。",
        "translation": "He always seeks to kill, is my enemy, and a great bad friend, and always wants to make me unhappy and uncomfortable, but only to destroy and not to benefit.",
        "source": "T12n0380_001:0948c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0948c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是魔於我極欲作惡、毀謗天人、作大怨讐，常於如是慧炬、慧光、大智明燈求欲滅之。",
        "translation": "That demon has a burning desire to do evil to me, disparage gods and humans, and create a great grudge against me, always seeking to extinguish it with such a torch of wisdom, light of wisdom, and great lamp of wisdom.",
        "source": "T12n0380_001:0948c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0948c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有正實語人作如是言：『諸天人中有一極毒惡人出於世者。』",
        "translation": "\"Suppose there's a person who speaks correctly and truly and says, 'Among gods and humans, there's a most venomous and evil person who appears in the world.'",
        "source": "T12n0380_001:0948c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知即是魔波旬也。",
        "translation": "You should know that he is Māra Pāpīyān.",
        "source": "T12n0380_001:0948c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0948c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有正實語人作如是言：『有人不為益己身故、不益他故、不益多眾生故而發心者。』",
        "translation": "\"Suppose there's a person who speaks correctly and says, 'Suppose there's someone who doesn't set out to benefit himself, doesn't benefit others, and doesn't benefit many sentient beings.'",
        "source": "T12n0380_001:0948c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知即是魔波旬也。",
        "translation": "You should know that he's Māra Pāpīyān.",
        "source": "T12n0380_001:0948c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0948c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有正實語人作如是言：『有人不為憐愍利益天、人、魔、梵、阿修羅、沙門、婆羅門一切世間故，又不欲令和合安隱故，欲令退落受苦惱故而發心者。』",
        "translation": "\"Again, if there's a person who speaks correctly and says this, 'Suppose there's someone who doesn't have the intention of pitying and benefiting gods, humans, Māra, Brahmā, asuras, ascetics, and priests in all the world, doesn't want to bring about harmony and peace, and wants to cause retreat and suffer hardship.'",
        "source": "T12n0380_001:0948c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知即是魔波旬也。",
        "translation": "You should know that he's Māra Pāpīyān.",
        "source": "T12n0380_001:0948c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0948c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我親從佛聞如是說，有二種人，一者、如法，二者、非法。",
        "translation": "I've personally heard the Buddha say this, \"There are two kinds of people, those who are according to the Dharma and those who are not.",
        "source": "T12n0380_001:0948c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知世尊所許波旬入涅槃者是不如法。",
        "translation": "You should know that the Bhagavān's approval of Pāpīyān's entry into nirvāṇa is not according to the Dharma.",
        "source": "T12n0380_001:0948c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊於此所許莫生堅著，但為憐愍、利益、安樂諸天人等一切眾生捨此所許，住世一劫。",
        "translation": "Please let the Bhagavān not become attached to this permission, but let him abandon it for the pity, benefit, and welfare of all sentient beings, including gods and humans, and abide in the world for an eon.",
        "source": "T12n0380_001:0948c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛久住，諸天人等利益、安樂，是故世尊莫速涅槃。」",
        "translation": "If the Buddha were to stay a long time, the gods and humans would benefit and be comfortable, so the Bhagavān mustn't quickly go into nirvāṇa.\"",
        "source": "T12n0380_001:0949a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告商主：「善哉善哉！",
        "translation": "The Buddha told the merchant, \"Good, good!",
        "source": "T12n0380_001:0949a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若令眾生得利益者，正應如是。",
        "translation": "This is precisely what should happen if it's to bring benefit to sentient beings.",
        "source": "T12n0380_001:0949a03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master merchant!",
        "source": "T12n0380_001:0949a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人供給灌頂登位剎利大王，或有供給王子、大臣，或有防護國土、城邑、聚落等者，是人從其剎利王所得大榮爵、受於福祿。",
        "translation": "\"If a person makes offerings to the consecration to ascend to the throne of a great king of bharis, or if they make offerings to princes or ministers, or if they guard a land, town, village, or so forth, that person will receive great honor and receive fortune from that king of bharis.",
        "source": "T12n0380_001:0949a04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其剎利王常於此人及其子孫、親友、眷屬，亦寵福祿，擁護蔭覆。",
        "translation": "That king always pets that person, his descendants, friends, relatives, and retinues with fortune and blessings, and he is protected and overshadowed by them.",
        "source": "T12n0380_001:0949a07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Prajāpati!",
        "source": "T12n0380_001:0949a08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今若於如來、應供、正遍知、無上法王所心生淨信，以淨信故，如來則當慰喻於汝、與汝福報。",
        "translation": "\"Now, if you give rise to pure faith in the mind of the Tathāgata, Worthy of Offerings, Perfectly Omniscient, and Unsurpassed King of the Dharma, and it's because of that pure faith that the Tathāgata will comfort and instruct you and give you the rewards of good fortune.",
        "source": "T12n0380_001:0949a08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今慰喻汝者，以汝佛所心生淨信、種善根故。",
        "translation": "I'm now comforting you because your Buddha has given rise to pure faith in your mind and planted good roots.",
        "source": "T12n0380_001:0949a10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是應知，商主！",
        "translation": "You should know it this way, monk!",
        "source": "T12n0380_001:0949a11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當以此淨信善根於我滅後未來世中作辟支佛，名曰悲愍商主。",
        "translation": "From this pure root of faith, you will become a pratyekabuddha in a future life after I cease, and you'll be called a compassionate merchant.",
        "source": "T12n0380_001:0949a12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我涅槃後正法滅已，是魔波旬得大喜悅；以喜悅故墜落魔宮，墮於阿鼻大地獄中，具受無量種種苦惱。",
        "translation": "\"After the cessation of the true teaching following my nirvāṇa, this Māra Pāpīyān attains great joy, and because of that joy, he falls into the Māra's palace and falls into the great hell of Abhidharma, where he experiences measureless kinds of suffering and distress.",
        "source": "T12n0380_001:0949a13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0949a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以魔波旬於是大勝慧燈、慧光隱滅之時生大喜故。",
        "translation": "It's because Māra Pāpīyān became very happy when this great lamp of superior wisdom and its wisdom light went out.",
        "source": "T12n0380_001:0949a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master merchant!",
        "source": "T12n0380_001:0949a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有正實語人作如是言：『有人為自害故、為自壞故、與己作惡故而發心者。』",
        "translation": "\"Suppose there's a person who speaks correctly and says this, 'Suppose someone sets their mind to doing harm to themselves, to destroying themselves, or to doing evil with themselves.'",
        "source": "T12n0380_001:0949a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知即是魔波旬也。",
        "translation": "You should know that he's Māra Pāpīyān.",
        "source": "T12n0380_001:0949a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0949a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master of Commerce!",
        "source": "T12n0380_001:0949a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我滅度後乃至有是正法住世，隨其時節是魔波旬得住魔宮；我法滅已，是魔極大喜踊欣慶、得大稱意，於剎那頃墜落魔宮、墮阿鼻地獄。",
        "translation": "From the time of my extinction until this right teaching lives in the world, this Māra Pāpīyān attains residence in the Māra's palace according to its timing, and after my teaching ceases, this Māra is overjoyed and rejoices greatly, attaining great felicity, and in a moment falls into the Māra's palace and into the avīci hell.",
        "source": "T12n0380_001:0949a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「商主！",
        "translation": "\"Master merchant!",
        "source": "T12n0380_001:0949a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人上於大樹，其樹花果悉以具足，是人取其稱意花果，既受用已，還復折其所住之枝。",
        "translation": "It's like a person who goes up into a large tree that's fully supplied with flowers and fruit, and that person takes the flowers and fruit that they desire and, after enjoying them, breaks off the branch on which they were standing.",
        "source": "T12n0380_001:0949a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "\"Master merchant!",
        "source": "T12n0380_001:0949a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T12n0380_001:0949a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人爾時住彼折枝得住樹不？",
        "translation": "Did this person then stand there and break off the branch and obtain a lodging in the tree?",
        "source": "T12n0380_001:0949a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於其樹受安樂已還折其枝，可名有智不？」",
        "translation": "Can you be called intelligent when you break off the branches of a tree after it has experienced well-being?\"",
        "source": "T12n0380_001:0949a26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主言：「不也，婆伽婆！",
        "translation": "The merchant said, \"No, Bhagavān!",
        "source": "T12n0380_001:0949a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不也，修伽陀！」",
        "translation": "No, Sugata!\"",
        "source": "T12n0380_001:0949a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「商主！",
        "translation": "The Buddha said, \"Master merchant!",
        "source": "T12n0380_001:0949a28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔亦如是，常希如來、應供、正遍知入涅槃故、常樂隱滅如來所說正法毘尼故。",
        "translation": "\"Māra is likewise, always longing for the Tathāgata, Worthy of Offerings, and Perfectly Omniscient to enter nirvāṇa, and always delighting in the invisibility of the Tathāgata's explanation of the right teaching.",
        "source": "T12n0380_001:0949a28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "\"Master merchant!",
        "source": "T12n0380_001:0949b01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至正法住世，是魔波旬於其時節得住魔宮；我法滅時，其魔波旬生大踊悅、喜慶稱意，故墜落魔宮、墮阿鼻地獄。",
        "translation": "Even when the right teaching was present in the world, this Māra Pāpīyān was able to stay at the Māra's palace during that time, and when my teaching ceased, that Māra Pāpīyān became so excited and joyous in praise that he fell down into the Māra's palace and fell into the avīci hell.",
        "source": "T12n0380_001:0949b01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「商主！",
        "translation": "\"Master merchant!",
        "source": "T12n0380_001:0949b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻如彼人於其樹上而自害故勤作是事；魔亦如是，為自害故、為害他故而勤發心。",
        "translation": "It's like that person up in that tree who diligently works to harm himself, and so Māra diligently sets his mind to harming himself and harming others.",
        "source": "T12n0380_001:0949b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master merchant!",
        "source": "T12n0380_001:0949b06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔於後時墮阿鼻地獄受大苦痛，如奪命苦。",
        "translation": "Māra then falls into the avīci hell and experiences great pain, such as life-threatening suffering.",
        "source": "T12n0380_001:0949b06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為苦觸已，當念：『我言如來、應供、正遍知是真語者、實語者、不異語者、不虛語者，如是善說：「善哉身律儀、善哉口律儀、善哉意律儀。",
        "translation": "After that painful contact, he should think, 'I say the Tathāgata, the Worthy One, and the Perfectly Omniscient One is a true, genuine, non-different, and not false speaker who thus well explains, \"Good conduct of body, good conduct of speech, and good conduct of mind.",
        "source": "T12n0380_001:0949b07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是身善行、是口善行、是意善行，獲得可樂、可欲、可愛、稱意果報；是身惡行、是口惡行、是意惡行，獲得不可樂、不可欲、不可愛、不稱意果報。」",
        "translation": "It's good conduct of body, good conduct of speech, and good conduct of mind that obtain the pleasant, desirable, lovable, and agreeable results, and it's bad conduct of body, bad conduct of speech, and bad conduct of mind that obtain the unpleasant, undesirable, unlovable, and unappreciated results.\"",
        "source": "T12n0380_001:0949b10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔與彼身惡行相應、口惡行相應、意惡行相應，以是業報今墮地獄，受如是等極痛、極切、極苦、極惱、極不可忍、如臨死之苦。』",
        "translation": "As a result of my karmic retribution for having been associated with that bad physical conduct, bad verbal conduct, and bad mental conduct, I've now fallen into hell and experienced such extreme pain, suffering, anguish, distress, intolerability, and suffering like that of approaching death.'",
        "source": "T12n0380_001:0949b13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是魔波旬當於爾時憶我所說，得淨信心；得淨信已，即時於彼地獄命終生三十三天。",
        "translation": "At that point, Māra Pāpīyān will remember what I've taught him and attain pure faith; after attaining pure faith, he'll immediately be born in the Trāyastriṃśa Heaven at the end of his life in that hell.",
        "source": "T12n0380_001:0949b16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0949b18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master of Commerce!",
        "source": "T12n0380_001:0949b18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其惡心於如來所作諸過失，身壞命終墮大地獄；若復慈心供養如來不求過者，身壞命終得生善道天人之中。",
        "translation": "If someone with a bad heart does wrongdoings with the Tathāgata, they'll fall into great hell when their body breaks up and their life ends; if they lovingly make offerings to the Tathāgata and don't seek wrongdoings, they'll be born among gods and humans on a good path when their body breaks up and their life ends.",
        "source": "T12n0380_001:0949b18_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼以善根得值諸佛；值諸佛已，復種善根；種善根已，次第當得無漏涅槃。",
        "translation": "Because of their good roots, they'll meet the buddhas; after meeting the buddhas, they'll plant good roots again; and after planting good roots, they'll attain untainted nirvāṇa in order.",
        "source": "T12n0380_001:0949b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「商主！",
        "translation": "\"Master merchant!",
        "source": "T12n0380_001:0949b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於如來、應供、正遍知心得淨信，以此善根，彌勒出世當得值遇。",
        "translation": "Attain pure faith in the Tathāgata, Worthy of Offerings, and Perfectly Omniscient Mind, and because of these good roots, you will meet Maitreya when he appears in the world.",
        "source": "T12n0380_001:0949b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "值彌勒已則能覺悟睡眠放逸諸眾生等，作如是言：『諸眾生輩應當勇猛勤作善業，如來、應供、正遍知出世甚難，如憂曇華時乃一現；如來亦爾，時乃一出無窟宅涅槃。』",
        "translation": "After meeting Maitreya, then you'll be able to awaken sleepy, careless sentient beings and so forth, saying, 'All sentient beings should courageously and diligently perform good deeds; it's very difficult for the Tathāgata, Worthy of Offerings, and Perfectly Omniscient to appear in the world, like the udumbara flower that appears only once in a while; so it is for the Tathāgata to emerge from the caveless abode of nirvāṇa once in a while.'",
        "source": "T12n0380_001:0949b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有說者：『人身難得、八難難離，得值佛世、生於中國亦復甚難。",
        "translation": "It was then said, 'The human person is difficult to obtain, the eight difficulties are difficult to escape, and it's also very difficult to attain the Buddhahood and be born in China.",
        "source": "T12n0380_001:0949b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等慎莫放逸，當勤修行，於後莫悔。』",
        "translation": "Therefore, you must be careful not to be careless, and you must diligently cultivate it so that you won't regret it later.'",
        "source": "T12n0380_001:0949b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「商主！",
        "translation": "\"Master merchant!",
        "source": "T12n0380_001:0949c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於彌勒佛所稟受法教，攝彼彌勒無上法王國土人民，常以慈心、無惡心、無怨讐心、愍心、樂心、普覆心護持養育，以此善根於魔宮殿次補魔處，具大富貴、為自在主。",
        "translation": "You have received the teaching of the Dharma from Maitreya Buddha, and you have collected the people of his land, the peerless Dharma King, and you have always protected and nurtured them with kindness, absence of evil, absence of enmity, kindness, joy, and pervasiveness, so that with these good roots you'll be able to supplement the demons in the demon's palace, become very wealthy and powerful, and be a sovereign lord.",
        "source": "T12n0380_001:0949c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Pravara!",
        "source": "T12n0380_001:0949c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生於如來所種諸善根，乃至得發一念淨心，彼等眾生以此善根得近甘露——第一甘露、最後甘露。",
        "translation": "If sentient beings plant good roots in the Tathāgata's possession, even to the point of generating a single pure thought, then those sentient beings will attain nearness to the ambrosia-the first and last ambrosia-through those good roots.",
        "source": "T12n0380_001:0949c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「商主！",
        "translation": "\"Master merchant!",
        "source": "T12n0380_001:0949c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝以善根於彼廣受人天報已，經八十劫於末後身作辟支佛，名曰悲愍。",
        "translation": "After you've received the rewards of those good roots from humans and gods in abundance, you'll become a pratyekabuddha in your final lifetime after 80 eons, which is called compassion.",
        "source": "T12n0380_001:0949c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0949c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master of Commerce!",
        "source": "T12n0380_001:0949c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以汝聞我涅槃聲已，便於我所生淨信心、於眾生所生悲愍心；為諸眾生得安樂故，求請我住不般涅槃；汝復於彼彌勒法中悲愍眾生，覺悟睡眠放逸眾生，令得憶念而不放逸，教以善法；以是因緣得辟支佛記。",
        "translation": "After you heard the sound of my nirvāṇa, you then developed pure faith in me and compassion for sentient beings; for the sake of the well-being of sentient beings, you asked me to abide in non-parinirvāṇa; furthermore, in that Maitreya teaching, you compassionately took care of sentient beings, awakened drowsy and careless sentient beings, made them remember and not careless, and taught them the good Dharma; as a result, you were able to obtain the predicate Buddha's prediction.",
        "source": "T12n0380_001:0949c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Prajñāpāramitā!",
        "source": "T12n0380_001:0949c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當與汝如是善報，應當深心喜悅稱意。",
        "translation": "I will give you such a good reward, which you should profoundly rejoice in and praise.",
        "source": "T12n0380_001:0949c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主！",
        "translation": "Master merchant!",
        "source": "T12n0380_001:0949c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等是汝勸請如來善根因緣，如來即以法施蔭覆報汝善根。」",
        "translation": "These are the causes and conditions for you to encourage the Tathāgata's good roots, and the Tathāgata will then reward your good roots with the shade of the Dharma gift.\"",
        "source": "T12n0380_001:0949c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，商主復白佛言：「世尊！",
        "translation": "It was then that the merchant again said to the Buddha, \"Bhagavān!",
        "source": "T12n0380_001:0949c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛不受我所勸請入涅槃者，願我從今乃至法住，離於五欲，專持孝道，不樂遊戲、不著異衣、不用華鬘、塗香、末香及不受用諸天勝報。",
        "translation": "\"If the Buddha doesn't accept my invitation to enter nirvāṇa, may I abide from now until the Dharma abides, seclude myself from the five desires, devote myself to filial piety, and refrain from enjoying play, wearing different clothing, using no flowers, perfumes, or incense, and not accepting the excellent rewards of the gods.",
        "source": "T12n0380_001:0949c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0949c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是世尊——眾生之寶——明當與我別離異處，更不合會、更不復有、畢竟不可見。",
        "translation": "Thus, the Bhagavān, the jewel of sentient beings, will clearly be separated from me and taken to a different place, never to be reunited, never to exist again, and never to be seen after all.",
        "source": "T12n0380_001:0949c21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0949c22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我有何樂？",
        "translation": "What pleasure do I have?",
        "source": "T12n0380_001:0949c23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何戲笑？",
        "translation": "What is there to laugh at?",
        "source": "T12n0380_001:0949c23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何可樂？",
        "translation": "What is there to enjoy?",
        "source": "T12n0380_001:0949c23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何稱意？",
        "translation": "What is the meaning?",
        "source": "T12n0380_001:0949c23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是最大慧炬、慧燈、大智光明若隱滅者，我當有何踊悅、稱意、喜慶等事？",
        "translation": "If this greatest torch of wisdom, lamp of wisdom, or great wisdom light were to disappear, what would I do to rejoice, praise, and be glad?",
        "source": "T12n0380_001:0949c24_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大智日有無量百千光炎眷屬滅除無明大黑闇者、作大智明者，如是滅沒，我當有何踊悅稱意？",
        "translation": "\"What joyous acclaim shall I give to this great wisdom sun that has measureless hundreds of thousands of shining members who extinguish the great darkness of ignorance and become the great wisdom and insight that thus vanishes?",
        "source": "T12n0380_001:0949c25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何可樂？",
        "translation": "What is there to enjoy?",
        "source": "T12n0380_001:0949c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何戲笑？",
        "translation": "What is there to laugh at?",
        "source": "T12n0380_001:0949c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於如是眾生之寶有別離故——測量眾生、不缺減眾生、與明眾生、無罪眾生、無癡眾生、無上眾生、最上眾生、無似眾生、無等眾生、無等等眾生、能救一切眾生、眾生妙眾生、眾生所供眾生、共乘眾生；調伏眾生者、憐愍眾生者、真語者、實語者、時語者、應時語者、不異語者；如說修行者、住大慈悲者、於諸眾生心無罣礙者、於諸眾生平等心者；無戲論者、無我我所者、無積聚者、無窟宅者、無依倚者、無荒嶮者、無垢者；救濟者、引導者、化度者、預備者、解縛者、養育者；令眾生憶念者、令惺悟者、教誨者、於戰鬪勝者、拔鏃者、醫王治心者、施大良藥者、究竟度苦者、說法者；商主將去者、示淺處者、持梢尾者、持炬者、作明者、作光者、照曜者、施目者、示導者；令到安隱國土者、遠離一切荒嶮垢者、無渴愛者、離諸使者、離諸結者、離貪瞋癡者、離諸煩惱者、離憍慢怒者；如是大丈夫、妙丈夫、極丈夫、健丈夫、猛丈夫、蓮華丈夫、芬陀利丈夫、龍丈夫、師龍丈夫、師子丈夫、上首丈夫、兇丈夫、雄丈夫、象丈夫、無上丈夫、無上調御丈夫；共乘者、具一切力者、具十力者、得四無所畏者、具十八不共法者、得大福智力者、滿足無量法藏者；無嫉妬者、悅豫一切眾生者、無上大施主、最勝施主、心無嫌恨者；得大禪定者、得諸禪三昧三摩跋提境界者、無量慧者、無障慧者、得無等慧境界者；摧魔幢者、渡淤泥者、到彼岸者、住彼岸者、到無畏處者、除一切眾生怖畏者、安慰一切眾生者、大眾生堅固者——於今後夜當有別離，更不可見。",
        "translation": "我於如是眾生之寶有別離故——測量眾生、不缺減眾生、與明眾生、無罪眾生、無癡眾生、無上眾生、最上眾生、無似眾生、無等眾生、無等等眾生、能救一切眾生、眾生妙眾生、眾生所供眾生、共乘眾生；調伏眾生者、憐愍眾生者、真語者、實語者、時語者、應時語者、不異語者；如說修行者、住大慈悲者、於諸眾生心無罣礙者、於諸眾生平等心者；無戲論者、無我我所者、無積聚者、無窟宅者、無依倚者、無荒嶮者、無垢者；救濟者、引導者、化度者、預備者、解縛者、養育者；令眾生憶念者、令惺悟者、教誨者、於戰鬪勝者、拔鏃者、醫王治心者、施大良藥者、究竟度苦者、說法者；商主將去者、示淺處者、持梢尾者、持炬者、作明者、作光者、照曜者、施目者、示導者；令到安隱國土者、遠離一切荒嶮垢者、無渴愛者、離諸使者、離諸結者、離貪瞋癡者、離諸煩惱者、離憍慢怒者；如是大丈夫、妙丈夫、極丈夫、健丈夫、猛丈夫、蓮華丈夫、芬陀利丈夫、龍丈夫、師龍丈夫、師子丈夫、上首丈夫、兇丈夫、雄丈夫、象丈夫、無上丈夫、無上調御丈夫；共乘者、具一切力者、具十力者、得四無所畏者、具十八不共法者、得大福智力者、滿足無量法藏者；無嫉妬者、悅豫一切眾生者、無上大施主、最勝施主、心無嫌恨者；得大禪定者、得諸禪三昧三摩跋提境界者、無量慧者、無障慧者、得無等慧境界者；摧魔幢者、渡淤泥者、到彼岸者、住彼岸者、到無畏處者、除一切眾生怖畏者、安慰一切眾生者、大眾生堅固者——於今後夜當有別離，更不可見。",
        "source": "T12n0380_001:0949c28_2",
        "is_bad_quality": true
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0950a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來常於諸大眾中正師子吼更不得聞，我當有何踊悅稱意？",
        "translation": "\"Tathāgata is always the first among the masses to hear the correct lion's roar, so what do I have to say in joyful anticipation?",
        "source": "T12n0380_001:0950a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0380_001:0950b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人於其灌頂剎利王所得福祿者，王命終後生大憂苦——知王恩養、念王恩養、賞王恩養——彼諸眾生為其王故專持孝道，或一日、二日乃至七日，若半月乃至一月憶念流淚。",
        "translation": "\"Suppose there's a person who consecrates a Śāriputra king and obtains fortune and rewards, and after his life ends, he becomes very sad and miserable - knowing the king's kindness, remembering the king's kindness, and appreciating the king's kindness - and those sentient beings devote themselves to filial piety for the sake of their king, whether for one day, two days, or even seven days, or for half a month or even a month, remembering and weeping.",
        "source": "T12n0380_001:0950b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0950b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，如來滅後乃至正法住世，隨其時節捨離五欲，專持孝道，不樂戲笑、不著異衣、不用華鬘、塗香、末香及不受用諸天果報。」",
        "translation": "Thus, after the Tathāgata's death and even after the true teaching remains in the world, I will abandon the five desires according to their timing, devote myself to filial piety, abstain from playful banter, refrain from wearing different clothing, refrain from using flower garlands, daubs of incense, and morsels of fragrance, and refrain from enjoying the rewards of the gods.\"",
        "source": "T12n0380_001:0950b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大悲經帝釋品第三",
        "translation": "The Third Chapter of the Taishi Chapter of the Sutra of Great Compassion",
        "source": "T12n0380_001:0950b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，釋提桓因往詣佛所，到已頂禮，退住一面而白佛言：「唯願世尊教勅於我，云何修行？",
        "translation": "Śakrodevānām Indra then went to the Buddha, paid homage when he arrived, withdrew to one side, and said to the Buddha, \"May the Bhagavān teach me what to cultivate?",
        "source": "T12n0380_001:0950b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0950b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔於一時，四大阿修羅王嚴駕著鎧，將諸眷屬來詣三十三天所欲共鬪戰。",
        "translation": "There was a time when four great asura kings, resplendent in armor, brought their retinues to the Trāyastriṃśa Heaven to fight together.",
        "source": "T12n0380_001:0950b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於爾時，聖者目連仍住在世。",
        "translation": "At the time, the Sacred Maitreya was still living in the world.",
        "source": "T12n0380_001:0950b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸天共阿修羅對陣之時，聖者目連到四阿修羅所以如法伏之。",
        "translation": "When the gods were fighting with the asuras, the noble Maudgalyāyana went to the four asuras and thus subdued them according to the Dharma.",
        "source": "T12n0380_001:0950b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸天及諸阿修羅悉得安隱，無復鬪戰之苦、共相違反、毀呰諍論。",
        "translation": "Thus, the gods and asuras are all made secure, and there's no more suffering from fighting, mutual conflict, or disparaging arguments.",
        "source": "T12n0380_001:0950b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0950b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大目連既已滅度，如來今復欲般涅槃，我等如是於後數數當復鬪戰、共相違反。",
        "translation": "Now that Mahāmaudgalyāyana has been extinguished and the Tathāgata is again about to [enter] parinirvāṇa, we'll fight again in the future, and we'll both violate each other.",
        "source": "T12n0380_001:0950b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂教勅，若四阿修羅王與我戰時，我於彼等作何方計？」",
        "translation": "May I ask you to instruct him, \"When the four asura kings fight with me, what do I think they'll do?\"",
        "source": "T12n0380_001:0950b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告釋提桓因言：「憍尸迦！",
        "translation": "The Buddha told Śakrodevānām Indra, \"Kauśika!",
        "source": "T12n0380_001:0950b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止，莫憂悲、莫愁、莫慮。",
        "translation": "\"Stop, and don't be sad and pity, don't be troubled, and don't worry.",
        "source": "T12n0380_001:0950b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若持戒者所願必成，唯淨戒者成，非不淨戒；梵行者非不梵行、離欲者非不離欲、離瞋者非不離瞋、離癡者非不離癡、智慧者非不智慧而得成也。",
        "translation": "If someone who observes the precepts certainly accomplishes what they desire, only the pure precepts will accomplish it, not the impure precepts; the religious practice will accomplish it, not the lack of religious practice; those who are free of desire will accomplish it, not the lack of desire; those who are free of anger will accomplish it, not the lack of anger; those who are free of delusion will accomplish it, not the lack of delusion; and those who are wise will accomplish it, not the lack of wisdom.",
        "source": "T12n0380_001:0950b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T12n0380_001:0950b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今後當作加被。",
        "translation": "\"I will give this precept from now on.",
        "source": "T12n0380_001:0950b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T12n0380_001:0950b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至我之正法未滅，若有諸天、阿修羅等共相鬪戰，隨其時節稱我名故諸天得勝。」",
        "translation": "Even before my true teaching ceases, if gods and asuras fight each other, the gods will prevail because they call me by my name according to their timing.\"",
        "source": "T12n0380_001:0950b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，四大阿修羅王聞佛說是加護聲已，其心忿恨，毛竪怖畏，來詣佛所。",
        "translation": "After hearing this protective voice from the Buddha, the four major asura kings became angry and fearful, and they rushed to the Buddha.",
        "source": "T12n0380_001:0950b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已頂禮，却住一面白佛言：「世尊！",
        "translation": "When they arrived, they paid homage, withdrew to one side, and said to the Buddha, \"Bhagavān!",
        "source": "T12n0380_001:0950c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故如來作是加護？」",
        "translation": "Why does the Tathāgata give this kind of protection?\"",
        "source": "T12n0380_001:0950c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告四大阿修羅言：「汝等莫憂、莫慮。",
        "translation": "The Buddha told the four major asuras, \"Don't be sad and don't worry about it.",
        "source": "T12n0380_001:0950c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有時汝等得大自在，過彼三十三天，無復鬪戰、無諍、無競、無相違反。",
        "translation": "One day, you'll attain great freedom and pass beyond the Trāyastriṃśa Heaven without ever again fighting, disputing, competing, or contradicting each other.",
        "source": "T12n0380_001:0950c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，汝等慎莫鬪戰、莫相毀呰、莫相諍論、勿作違反心；當作慈心、愍心，得眾欲具足。",
        "translation": "Therefore, be careful not to fight, not to disparage each other, not to engage in arguments, and not to act contrary to each other; be kind and compassionate, and attain the fulfillment of all desires.",
        "source": "T12n0380_001:0950c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "Gentlemen!",
        "source": "T12n0380_001:0950c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命不久停，為自在主亦復無常。",
        "translation": "\"Life doesn't stop long, and being a master of one's own accord is also impermanent.",
        "source": "T12n0380_001:0950c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "Gentlemen!",
        "source": "T12n0380_001:0950c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有具足合會必歸離散。",
        "translation": "All the world's complete combinations will surely come to a close.",
        "source": "T12n0380_001:0950c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "Gentlemen!",
        "source": "T12n0380_001:0950c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當觀如來窮無常際，於諸眾生無所怨讐、無違、無競，常為和合。",
        "translation": "\"You should observe that the Tathāgata, at the limit of his impermanence, holds no enmity toward sentient beings, is not at odds, has no rivalry, and always works in harmony.",
        "source": "T12n0380_001:0950c09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生平等發心，何況汝等薄少善根、彼此迭相樂鬪諍者？",
        "translation": "All sentient beings are equally motivated, so why wouldn't you, with few good roots, fight each other repeatedly and happily?",
        "source": "T12n0380_001:0950c10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "you!",
        "source": "T12n0380_001:0950c12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有發心惱害他者，是人長夜還得惱害。",
        "translation": "If someone has the intention to harm others, that person will continue to be harmed for a long time.",
        "source": "T12n0380_001:0950c12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "Gentlemen!",
        "source": "T12n0380_001:0950c13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人喜殺，是人還得短壽之報；若憙鬪諍，是人常有怖畏死報、不具大眷屬、無大勢力。",
        "translation": "If a person is attracted to killing, that person will be rewarded with a short life span, and if they fight, that person will always experience the fear of death, not have great dependents, and not have great power.",
        "source": "T12n0380_001:0950c13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "Gentlemen!",
        "source": "T12n0380_001:0950c15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善、惡二業終不敗亡。",
        "translation": "The two kinds of good and bad actions never fail.",
        "source": "T12n0380_001:0950c15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等從今已後各住慈心——住身業慈、口業慈、意業慈——莫鬪、莫競、莫相毀呰。",
        "translation": "Therefore, from now on, you each abide in a compassionate state of mind - abiding in kindness in physical actions, kindness in verbal actions, and kindness in mental actions - and don't fight, don't compete, and don't disparage each other.",
        "source": "T12n0380_001:0950c16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，汝等長夜得利益安樂，後則不悔。」",
        "translation": "Because of these causes, you'll attain benefit and happiness for a long time, and then you won't regret it.\"",
        "source": "T12n0380_001:0950c17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，四阿修羅王白佛言：「世尊！",
        "translation": "After making these remarks, the four asura kings said to the Buddha, \"Bhagavān!",
        "source": "T12n0380_001:0950c18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，婆伽婆！",
        "translation": "So it is, Bhagavān!",
        "source": "T12n0380_001:0950c19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，修伽陀！",
        "translation": "So it is, Sugata!",
        "source": "T12n0380_001:0950c20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等如是依如來教，如是修、如是住。",
        "translation": "We thus rely on the Tathāgata's teaching, thus cultivate it, and thus abide in it.",
        "source": "T12n0380_001:0950c20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0950c21_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今後一切當捨鬪戰之具，各修慈心。」",
        "translation": "From now on, I will abandon all the weapons of war and cultivate a compassionate mind.\"",
        "source": "T12n0380_001:0950c21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，釋提桓因聞佛涅槃，為憂箭所射，極大愁惱，悲泣流淚而白佛言：「世尊！",
        "translation": "Śakrodevānām Indra then heard about the Buddha's nirvāṇa and was shot by an arrow of grief, became extremely distressed, wept, and said to the Buddha, \"Bhagavān!",
        "source": "T12n0380_001:0950c22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至法住，不受五欲、不入內宮、不著異衣。",
        "translation": "From this day until I abide in the Dharma, I won't be given the five desires, won't enter the inner palace, and won't wear different clothing.",
        "source": "T12n0380_001:0950c23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德婆伽婆！",
        "translation": "Venerable Bhagavān!",
        "source": "T12n0380_001:0950c25_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如家長喪亡，是人知識得恩養者，心生苦惱，憶念舊恩，念恩養故悲泣流淚、專持孝道。",
        "translation": "It's like a person who knows someone who's been supported by kindness when their parents die, becomes distressed, remembers old kindnesses, weeps tears of pity because of those kindnesses, and focuses on the path of filial piety.",
        "source": "T12n0380_001:0950c25_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0380_001:0950c27_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，乃至法住隨其時節悲泣流淚、專持孝道，不行五欲、不入內宮、不著異衣。",
        "translation": "\"So it was with me up to my Dharma abode, when I wept and sobbed according to the occasion and devoted myself to filial piety, refraining from the five desires, not entering the inner sanctum, and not wearing different clothing.",
        "source": "T12n0380_001:0950c27_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0380_001:0950c29_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無上導師明當別離，不可得見，更不合會。」",
        "translation": "The unsurpassed teacher clearly will be separated, and he can't be seen or associated with him.\"",
        "source": "T12n0380_001:0950c29_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因作是語已，即便伏面啼哭而住。",
        "translation": "After Śakrodevānām Indra said this, he even crouched down with his face and wept.",
        "source": "T12n0380_001:0951a01_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大悲經卷第一",
        "translation": "*Mahāmegha-sūtra, Vol. 1",
        "source": "T12n0380_001:0951a03_0",
        "is_bad_quality": false
    }
]