[
    {
        "source_sentence": "佛說太子刷護經一卷",
        "translation": "Foshuo taizi shuahu jing in one volume",
        "source": "T12n0343_001:0153c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉三藏竺法護譯",
        "translation": "Translated by Dharmarakṣa of the Western Jin Dynasty",
        "source": "T12n0343_001:0153c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在羅閱祇耆闍崛山中時，與千二百比丘，菩薩萬二千人，優婆塞、優婆夷，諸天王梵釋，及無央數人民、鬼神、龍皆來俱會。",
        "translation": "When the Buddha was present on Mount Gṛdhrakūṭa, he was joined by twelve hundred monks, twelve thousand bodhisattvas, laymen, laywomen, gods, Brahmā, and countless other people, spirits, and dragons.",
        "source": "T12n0343_001:0153c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿闍世王太子，名為刷護，從國中與群臣長者子五百人，各持黃金華蓋，出羅閱國相隨出至佛所，持黃金華蓋上佛已，却叉手持，頭面著地為佛作禮訖竟，皆叉手住。",
        "translation": "The king of Ajātaśatru, a prince named Padmaśrī, left the country with 500 ministers and elders, each carrying a gold floral canopy, followed them out of Rājagṛha and went to the Buddha, and when they had risen to the Buddha with the gold floral canopy, they saluted him with their palms together, bowing with their heads on the ground, and then they all stood with their palms together.",
        "source": "T12n0343_001:0153c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿闍世王太子刷護白佛言：「願欲問事，如佛肯說者當問，不肯者不敢問。」",
        "translation": "The king of Ajātaśatru, the prince of Brushhook, said to the Buddha, \"I would like to ask about something, but if the Buddha is willing to discuss it, you will ask, and if he's not, I won't dare to ask.\"",
        "source": "T12n0343_001:0153c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「在所問事。」",
        "translation": "The Buddha said, \"It's about the matter that you want to ask about.\"",
        "source": "T12n0343_001:0153c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子白佛言：「菩薩何因緣得顏頰端正？",
        "translation": "The prince said to the Buddha, \"What are the causes for a bodhisattva's upright face and cheeks?",
        "source": "T12n0343_001:0153c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣不入女人腹中，於蓮華中化生？",
        "translation": "What were the reasons for not entering a woman's womb and being born in a lotus flower?",
        "source": "T12n0343_001:0153c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣能自知前世宿命之事？",
        "translation": "What causes and conditions enable one to know for oneself the events of past lives and past lives?",
        "source": "T12n0343_001:0153c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛大恩當為我曹說之。」",
        "translation": "May the Buddha be so kind as to explain this to my lord.\"",
        "source": "T12n0343_001:0153c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「能忍辱不怒者，後生即為人姝好；不淫泆，不與女人交通，若壽欲終時，人生一歲一月及七日者，後世生，便自知宿命無數世以來之事。」",
        "translation": "The Buddha told the prince, \"Those who can tolerate humiliation and don't become angry will be born later as handsome human beings who don't engage in lust or sexual intercourse with women, and if, when their life expectancy ends, they are born for a year, a month, or seven days, they'll be born in a later life and then know for themselves the events of their past lives that go back uncountable generations.\"",
        "source": "T12n0343_001:0153c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子白佛言：「菩薩何因緣，身有三十二相？",
        "translation": "The prince said to the Buddha, \"What are the causes and conditions for a bodhisattva's body to have thirty-two marks?",
        "source": "T12n0343_001:0154a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣有八十種好？",
        "translation": "What are the eighty good causes and conditions?",
        "source": "T12n0343_001:0154a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣人民有見佛身者視之無厭極？」",
        "translation": "For what reason do people who see the Buddha's body regard it as unwearying?\"",
        "source": "T12n0343_001:0154a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「本為菩薩時，好憙布施種種雜物，與諸佛菩薩及師父母人民，在所來索，用是故得三十二相。",
        "translation": "The Buddha told the prince, \"When I was a bodhisattva, I was fond of giving various sundry goods to buddhas, bodhisattvas, teachers, parents, and people who came and asked for them, and it was because of this that I attained the thirty-two major characteristics.",
        "source": "T12n0343_001:0154a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩當有慈心，哀念十方人民及蜎飛蠕動之類，如視赤子皆欲令度脫，用是故得八十種好。",
        "translation": "A bodhisattva should have a compassionate mind and think compassionately about the people and wriggling things in the ten directions, as if he were looking at a child and wanting to set him free, and it's because of this that he attains the eighty kinds of good looks.",
        "source": "T12n0343_001:0154a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見怨家、父母，心適等無有異，用是故人民見佛視之無厭極。」",
        "translation": "When bodhisattvas see their enemies and parents, their minds are appropriate and not different, and it's because of this that people see the Buddha and look at him without tire.\"",
        "source": "T12n0343_001:0154a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何所因緣，知深經智慧及陀羅尼行？",
        "translation": "The prince then said to the Buddha, \"What are the causes for a bodhisattva to know the profound wisdom of the scriptures and the practice of the dhāraṇī?",
        "source": "T12n0343_001:0154a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣知三昧定意得安隱？",
        "translation": "What are the causes and conditions for knowing that samādhi concentration is attained with equanimity?",
        "source": "T12n0343_001:0154a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣佛所說皆快善？",
        "translation": "What causes and conditions make the Buddha's teachings fast and good?",
        "source": "T12n0343_001:0154a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有聞者皆歡喜信受？」",
        "translation": "Do all those who hear it rejoice and believe it?\"",
        "source": "T12n0343_001:0154a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩憙書信受諷誦學，用是故知深經智慧，得陀羅尼行；菩薩常憙專心正意，用是故得三昧安隱；菩薩所說皆至誠不欺，用是故所語人民皆信向，聞者莫不歡喜者。」",
        "translation": "The Buddha told the prince, \"A bodhisattva's jealousy is based on his faith in writing, accepting chants, and studying; it's because of this that he knows the profound wisdom of the sūtras and attains the practice of the dhāraṇī; it's because a bodhisattva always focuses his mind and correct intention that he attains samādhi and peace; and it's because a bodhisattva's teachings are sincere and not deceptive that the people are convinced and orient themselves to what he says, and no one who hears them is denied joy.\"",
        "source": "T12n0343_001:0154a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何因緣學經聞佛語人民皆信？",
        "translation": "The prince then said to the Buddha, \"What are the causes for the bodhisattvas to study the sūtras and hear the Buddha's words and for the people to believe in them?",
        "source": "T12n0343_001:0154a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣知經律儀法？",
        "translation": "What are the causes and conditions for knowing the scriptures, rules, and methods?",
        "source": "T12n0343_001:0154a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣孝順隨佛教不犯？」",
        "translation": "For what reason is it not a violation to follow Buddhism in filial piety?\"",
        "source": "T12n0343_001:0154a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩世世不諛諂，用是故學經聞佛語悉知不忘；菩薩入深經不恐不怖，用是故得經律便知儀法；菩薩世世敬佛敬經敬師敬父母，用是故得智慧。」",
        "translation": "The Buddha told the prince, \"A bodhisattva doesn't flatter from generation to generation; it's because of this that a bodhisattva trains in the scriptures and hears the Buddha's words and fully knows them and doesn't forget them; it's because of this that a bodhisattva enters deep scriptures and isn't afraid or frightened; it's because of this that he attains the sutras and vinaya and then knows the rules and methods; and it's because of this that a bodhisattva honors the Buddha, honors the scriptures, honors teachers, and honors parents from generation to generation that he attains wisdom.\"",
        "source": "T12n0343_001:0154a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何因緣世世生佛邊？",
        "translation": "The prince then said to the Buddha, \"What are the causes and conditions for a bodhisattva to be born by the side of the Buddha from generation to generation?",
        "source": "T12n0343_001:0154a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣問佛歎經曉知中慧？」",
        "translation": "What are the reasons for asking the Buddha to praise the scriptures and knowing the wisdom of the middle way?\"",
        "source": "T12n0343_001:0154a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩世世見人說經，不中壞亂，不呵之，用是故得生佛邊；菩薩數歎深經，用是故知中慧。」",
        "translation": "The Buddha told the prince, \"It's the way a bodhisattva sees people teach sūtras from time to time, doesn't muddle them or ridicule them, and it's the way a bodhisattva praises profound sūtras and knows middling wisdom.\"",
        "source": "T12n0343_001:0154a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「何因緣不生惡處？",
        "translation": "The prince then said to the Buddha, \"What are the causes for not being born in a bad place?",
        "source": "T12n0343_001:0154a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣生天上？",
        "translation": "What are the causes and conditions for birth in the heavens?",
        "source": "T12n0343_001:0154a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣不貪愛欲？」",
        "translation": "What are the reasons for not craving and desire?\"",
        "source": "T12n0343_001:0154a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩世世信佛信經信比丘僧，用是故不生八惡處；菩薩持戒不缺，用是故生天上；菩薩知經法本空，用是故不貪愛欲。」",
        "translation": "The Buddha told the prince, \"It's because a bodhisattva has always believed in the Buddha, believed in the sūtras, and believed in the monks and nuns that he doesn't give rise to the eight bad places; it's because a bodhisattva observes the precepts and isn't deficient that he's born up in heaven; and it's because a bodhisattva knows that the sutras and Dharma are inherently empty that he doesn't crave or desire them.\"",
        "source": "T12n0343_001:0154a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何因緣身所行、口所言、心所念皆淨潔？",
        "translation": "The prince then said to the Buddha, \"What are the causes that purify what a bodhisattva does with his body, what he says with his mouth, and what he thinks with his mind?",
        "source": "T12n0343_001:0154b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣魔不能得其便？",
        "translation": "What is the reason why the demons cannot get an advantage over us?",
        "source": "T12n0343_001:0154b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣不敢誹謗佛？",
        "translation": "For what reason do you not dare to denigrate the Buddha?",
        "source": "T12n0343_001:0154b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不敢誹謗經？",
        "translation": "Do you dare not denigrate the scriptures?",
        "source": "T12n0343_001:0154b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不敢誹謗比丘僧？」",
        "translation": "Dare you not denigrate the saṃgha of the monks?\"",
        "source": "T12n0343_001:0154b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩侍佛憙學經愛比丘僧，用是故得淨潔；菩薩晝夜行道精進不懈，用是故魔不能得其便；菩薩所語皆至誠，用是故眾人不敢誹謗佛，不敢誹謗經道，不敢誹謗比丘僧。」",
        "translation": "The Buddha told the prince, \"The bodhisattva serves the Buddha, studies sūtras with fervor, and loves the monks; it's because of this that he attains purity; the bodhisattva's tireless day and night practice of the path; it's because of this that Māra can't get an advantage over him; and the bodhisattva's words are perfectly sincere; it's because of this that people don't dare to denigrate the Buddha, the sūtras, or the monks.\"",
        "source": "T12n0343_001:0154b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何因緣，好高聲如梵天聲？",
        "translation": "The prince then said to the Buddha, \"What is the reason the bodhisattva likes to raise his voice like the voice of Brahmā?",
        "source": "T12n0343_001:0154b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣有八種音？",
        "translation": "What are the causes and conditions for the eight kinds of sounds?",
        "source": "T12n0343_001:0154b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣知眾人所念皆悉能報？」",
        "translation": "What are the causes and conditions for knowing that what many people think is fully capable of retribution?\"",
        "source": "T12n0343_001:0154b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩世世至誠不欺，用是故好高聲如梵天聲；菩薩世世不惡口，用是故得八種音；菩薩世世不兩舌、不妄語，用是故眾人所念悉能報故。」",
        "translation": "The Buddha told the prince, \"Bodhisattvas are always sincere and not deceptive; it's because of this that they have a beautiful, loud voice like the voice of Brahmā; it's because of this that they don't speak harshly; it's because of this that they attain eight kinds of sounds; and it's because of this that they don't duplicate words or speak falsely that they are able to respond to the thoughts of many people.\"",
        "source": "T12n0343_001:0154b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「何因緣得壽命長？",
        "translation": "The prince then said to the Buddha, \"What are the reasons for attaining a long life?",
        "source": "T12n0343_001:0154b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣身得無疾病？",
        "translation": "What are the causes and conditions for attaining a body without disease?",
        "source": "T12n0343_001:0154b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣家室和順相愛，不令他人別離？」",
        "translation": "What are the reasons why families love each other in harmony and don't let others part from them?\"",
        "source": "T12n0343_001:0154b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「不殺生者，用是故後生為人師壽命長；不持刀杖擊人，用是故後生為人得無疾病；見人有變鬪憙行和解令歡喜，用是故後生為人他人不能得別離。」",
        "translation": "The Buddha told the prince, \"A person who doesn't kill has a long life as a mentor, doesn't hit people with a sword or stick as a way to prevent illness in people born later, and sees people engaged in fights and behaviors and makes them rejoice as a way to prevent others from being separated from them in people born later.\"",
        "source": "T12n0343_001:0154b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何因緣，多得財物珍寶有不離？",
        "translation": "The prince then said to the Buddha, \"What are the causes for a bodhisattva's having so much wealth and treasure that he can't part with it?",
        "source": "T12n0343_001:0154b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣不亡財物？",
        "translation": "What are the causes and conditions for not losing one's possessions?",
        "source": "T12n0343_001:0154b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為人所劫盜？",
        "translation": "Not to be robbed by men?",
        "source": "T12n0343_001:0154b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣得尊者得高？」",
        "translation": "What causes did the venerable attain greatness?\"",
        "source": "T12n0343_001:0154b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「不貪他人財物者，用是故後生為人得富樂，憙布施不慳貪，用是故不亡財物，物益增多；見人富樂得錢財，心不嫉妬，不自貢高，用是故後生得高尊。」",
        "translation": "The Buddha told the prince, \"Someone who doesn't crave another person's wealth and possessions uses it to become wealthy and happy for others in later life, gives joyfully and generously, doesn't be stingy and greedy, and uses it not to lose their possessions and gain more of them; someone who sees someone's wealth and happiness and obtains money and possessions isn't jealous at heart and doesn't flatter themselves, and it's because of this that they'll be highly honored in later life.\"",
        "source": "T12n0343_001:0154b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「何因緣能得天眼洞視？",
        "translation": "The prince then said to the Buddha, \"What are the causes that make it possible to see clearly through the divine eye?",
        "source": "T12n0343_001:0154b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣得天耳徹聽？",
        "translation": "What were the causes and conditions for attaining the divine ear to hear them thoroughly?",
        "source": "T12n0343_001:0154b27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣能知世間人民死生之事？」",
        "translation": "What are the causes and conditions that make it possible to know about the affairs of the people of the world who die and are reborn?\"",
        "source": "T12n0343_001:0154b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「用好憙然燈於佛前，以是故後生為人得天眼洞視；好憙持倡伎樂於佛寺前，用是故後生為人得天耳徹聽；菩薩憙定意入三昧得禪，用是故知世間死生之變。」",
        "translation": "The Buddha told the prince, \"Jogging a lamp in front of the Buddha gives humans who are born later the divine eye that sees clearly; Jogging a musician in front of a Buddhist temple gives humans who are born later the divine ear that hears thoroughly; Jogging a bodhisattva's concentration, entering samādhi, and attaining meditation gives humans who are born later the knowledge of the transformations of the world's death and birth.\"",
        "source": "T12n0343_001:0154b28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何因緣得飛行四神足？",
        "translation": "The prince then said to the Buddha, \"What are the causes for the bodhisattva attaining the four miraculous powers of flight?",
        "source": "T12n0343_001:0154c03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩何因緣念知前世無數劫以來之事？",
        "translation": "What are the causes and conditions for a bodhisattva's mindfulness of the events of uncountable eons in previous lives?",
        "source": "T12n0343_001:0154c04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩何因緣得三活佛便般泥洹？」",
        "translation": "What are the causes and conditions for a bodhisattva to attain the three living buddhas and then [enter] parinirvāṇa?\"",
        "source": "T12n0343_001:0154c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩好憙布施，常持車馬驢騾象駱駝履屣及水船，與諸佛比丘僧及與人民，用是故得飛行四神足。",
        "translation": "The Buddha told the prince, \"A bodhisattva who is fond of generosity always carries chariots, horses, donkeys, mules, elephants, camels, sandals, and boats on water with the buddhas, monks, and people, and it's because of this that he attains the four miraculous powers of flight.",
        "source": "T12n0343_001:0154c06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩常專心念諸佛，三昧從學憙行教人，用是故得念前世無數劫以來之事。",
        "translation": "Always intently mindful of the buddhas, the bodhisattva samādhifully trains and Jogs practices to teach others, and as a result, he attains mindfulness of the things that happened in previous lives for countless eons.",
        "source": "T12n0343_001:0154c08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩得阿維越致道，以念無所復著，用是故能斷死生之根，得佛道便般泥洹。」",
        "translation": "Because of this mindfulness, the bodhisattva attains the path of nonretrogression, and with this mindfulness he can cut off the root of death and birth and attain parinirvāṇa after the Buddha's path.\"",
        "source": "T12n0343_001:0154c10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復白佛言：「菩薩何因緣預治國？",
        "translation": "The prince then said to the Buddha, \"What are the causes and conditions for the bodhisattva to rule the country in advance?",
        "source": "T12n0343_001:0154c12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣預會比丘僧？",
        "translation": "What are the causes and conditions for the prior assembly of monks?",
        "source": "T12n0343_001:0154c13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣光明照十方？」",
        "translation": "What causes and conditions illuminate the ten directions?\"",
        "source": "T12n0343_001:0154c13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告太子：「菩薩本求大願，用是故預得佛國；菩薩好憙布施乞匃與人，憙教人民為六波羅蜜，是故後得比丘僧；菩薩憙持七寶作華蓋用上佛，用是故得光明遍照十方。」",
        "translation": "The Buddha told the prince, \"The bodhisattva originally sought the great vow, and it was because of this that he had first attained the Buddha's kingdom; the bodhisattva was so fond of giving alms, begging people, and teaching the people the six perfections that he later attained the monastery; the bodhisattva held seven treasures in his hand and made them into a lotus canopy for use on top of the Buddha, and it was because of this that he attained a brightness that radiated throughout the ten directions.\"",
        "source": "T12n0343_001:0154c14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為太子分別說是事，太子歡喜，及五百長者子皆大歡喜。",
        "translation": "The Buddha discerned these things for the prince, and the prince rejoiced and the five hundred sons of elders rejoiced greatly.",
        "source": "T12n0343_001:0154c18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子刷護復白佛言：「願使我後世生者，佛所說，令我悉受得，悉奉行之，皆令如願。」",
        "translation": "The crown prince, Brushhook, then said to the Buddha, \"May I be born in a later life in which all the things the Buddha teaches are acceptable to me and all of them are practiced, so that they will be as I wish.\"",
        "source": "T12n0343_001:0154c19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛便大笑，口中五色光出。",
        "translation": "The Buddha then laughed loudly, and a five-colored light came out of his mouth.",
        "source": "T12n0343_001:0154c21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彌勒菩薩言：「聽我說之，太子刷護菩薩及長者子，前世皆供養百八億佛、皆行菩薩道，乃前世提和迦羅佛時，是五百人皆是佛弟子，是我所教，後世悉當共會，六億佛却後一劫，摩訶波羅會一劫中，五百人前後作佛，皆同一名若那伎頭陀耶。",
        "translation": "The Buddha told Maitreya Bodhisattva, \"Listen to what I've told you, Prince Brushguard Bodhisattva and the eldest son, in previous lives they all supported 18 billion buddhas and practiced the bodhisattva path, and in a previous life when Mahāprajñāpāramitā was born, these 500 people were all disciples of the Buddha and were taught by me, and in a later life they'll all meet together.",
        "source": "T12n0343_001:0154c21_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後作佛時，當如阿彌陀佛其國，亦當如阿彌陀時等無異，國中菩薩往來者飛行者，皆如阿彌陀佛國。",
        "translation": "When they later become buddhas, they'll be like Amitâbha's country, and they'll be just like Amitâbha's time, with no difference between those bodhisattvas in the country who travel to and from it and those who fly and travel to it.",
        "source": "T12n0343_001:0154c27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人民聞是經信喜者，皆當生阿彌陀國。」",
        "translation": "If the people hear this sūtra and believe and rejoice, they will all be born in Amitâbha's land.\"",
        "source": "T12n0343_001:0154c29_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是已，太子刷護及五百長者子，諸比丘僧、比丘尼、優婆塞、優婆夷，諸天、人民、鬼神、龍，皆大歡喜，前為佛作禮而去。",
        "translation": "After the Buddha said this, the prince Padmaśrī, the five hundred sons of elders, the monks, nuns, laymen, and laywomen, the gods, the people, the spirits, and the dragons were all overjoyed, paid homage to the Buddha, and departed.",
        "source": "T12n0343_001:0155a01_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子刷護經",
        "translation": "Sutra of the Crown Prince Vasubandhu",
        "source": "T12n0343_001:0155a05_0",
        "is_bad_quality": false
    }
]