[
    {
        "source_sentence": "佛說當來變經",
        "translation": "Sutra on the Future Transformation of the Buddha's Teaching",
        "source": "T12n0395_001:1118a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, Tripiṭaka of the Yuezhi State, Western Jin Dynasty",
        "source": "T12n0395_001:1118a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園，與大比丘眾俱，比丘五百及諸菩薩。",
        "translation": "Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī with a large assembly of monks, 500 monks, and bodhisattvas.",
        "source": "T12n0395_001:1118a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「將來之世，當有比丘，因有一法不從法化，令法毀滅，不得長益。",
        "translation": "It was then that the Bhagavān addressed the monks, \"In a future age, there will be monks who, because of one thing they don't teach from the Dharma, cause the Dharma to be destroyed and don't receive any long-term benefit.",
        "source": "T12n0395_001:1118a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為一？",
        "translation": "What's meant by one?",
        "source": "T12n0395_001:1118a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不護禁戒，不能守心，不修智慧，放逸其意，唯求善名不順道教，不肯勤慕度世之業。",
        "translation": "They don't guard the precepts, fail to guard their minds, don't cultivate wisdom, and abandon their thoughts, seeking only good reputation and not following the teachings of the path, and refusing to diligently pursue the task of saving the world.",
        "source": "T12n0395_001:1118a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為一事，令法毀滅。」",
        "translation": "This is the one thing that causes the Dharma to perish.\"",
        "source": "T12n0395_001:1118a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「復有二事，令法毀滅。",
        "translation": "The Buddha told the monks, \"There are two more things that cause the Dharma to perish.",
        "source": "T12n0395_001:1118a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are the two?",
        "source": "T12n0395_001:1118a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、不護禁戒，不攝其心，不修智慧，畜妻養子放心恣意，賈作治生以共相活。",
        "translation": "1. someone who doesn't guard the precepts, doesn't control their mind, doesn't cultivate wisdom, keeps wives and children with confidence and abandonment, and makes a living together by taming people.",
        "source": "T12n0395_001:1118a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二、伴黨相著憎奉法者，欲令陷墮故為言義，謂之諛諂；內犯惡行外佯清白。",
        "translation": "2. those who are companions, are attached to and hate the Dharma, and want to cause them to fall into what's called flattery, which is an internal violation of bad behavior and an external pretence of innocence.",
        "source": "T12n0395_001:1118a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為二事，令法毀滅。」",
        "translation": "These are the two things that cause the destruction of the Dharma.\"",
        "source": "T12n0395_001:1118a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復有三事，令法毀滅。",
        "translation": "The Buddha told the monks, \"There are three more things that cause the disruption of the Dharma.",
        "source": "T12n0395_001:1118a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為三？",
        "translation": "What are the three?",
        "source": "T12n0395_001:1118a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、既不護禁戒，不能攝心，不修智慧。",
        "translation": "1. He doesn't guard the precepts, doesn't concentrate his mind, and doesn't cultivate wisdom.",
        "source": "T12n0395_001:1118a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二、自讀文字不識句逗，以上著下、以下著上，頭尾顛倒，不能解了義之所歸，自以為是。",
        "translation": "2. He reads the text himself and doesn't recognize the words and phrases, clings to the above and below, confuses head and tail, and doesn't understand the meaning of what's meant, thinking himself to be right.",
        "source": "T12n0395_001:1118a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三、明者呵之不從其教，反懷瞋恨，謂相嫉妬。",
        "translation": "3. those of insight criticize them and don't follow their teaching, but instead harbor hatred, which is called jealousy.",
        "source": "T12n0395_001:1118a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識義者少，多不別理咸云為是。",
        "translation": "Those who know the meaning are few, and many don't distinguish between principle and say this.",
        "source": "T12n0395_001:1118a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為三事，令法毀滅。」",
        "translation": "These are the three things that cause the destruction of the Dharma.\"",
        "source": "T12n0395_001:1118a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復有四事，令法毀滅。",
        "translation": "The Buddha told the monks, \"There are four more things that cause the destruction of the Dharma.",
        "source": "T12n0395_001:1118a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are the four?",
        "source": "T12n0395_001:1118a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、將來比丘，已捨家業在空閑處，不修道業。",
        "translation": "1. A monk in the future will abandon his family business and go to a lonely place, not cultivating it.",
        "source": "T12n0395_001:1118b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二、憙遊人間憒閙之中，行來談言，求好袈裟五色之服。",
        "translation": "2. he wanders about in the midst of the hustle and bustle of the world, walking around talking about it and seeking a nice robe and five-colored clothing.",
        "source": "T12n0395_001:1118b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三、高聽遠視以為綺雅，自以高德無能及者，以雜碎智比日月之明——畜已！",
        "translation": "3. he thinks he's elegant when he listens loudly and looks far away, assumes his high virtue is unsurpassed, and compares his knowledge of debris to the brightness of the sun and moon - having done so!",
        "source": "T12n0395_001:1118b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四、不攝三事，不護根門，行婦女間，宣文飾辭多言合偶，以動人心，使清變濁；身行荒亂，正法廢遲。",
        "translation": "Fourth, they don't include three things, don't guard their faculties, walk among women, proclaim ornaments, talk a lot, and match words in order to move people's minds and cause purity to become turbid, and their physical conduct is so desolate that the right teaching is retarded.",
        "source": "T12n0395_001:1118b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四事，令法毀滅。」",
        "translation": "These are the four things that cause the disintegration of the Dharma.\"",
        "source": "T12n0395_001:1118b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「復有五事，令法毀滅。",
        "translation": "The Buddha told the monks, \"There are five more things that cause the disruption of the Dharma.",
        "source": "T12n0395_001:1118b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為五？",
        "translation": "What are the five?",
        "source": "T12n0395_001:1118b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、或有比丘，本以法故出家修道，廢深經教十二因緣、三十七品，方等深妙玄虛之慧、智度無極、善權方便、空無相願至化之節。",
        "translation": "1. Some monks originally left home and cultivated for the sake of the Dharma, but they abandoned the profound sūtras that teach the twelve causes and conditions, the thirty-seven factors, the profound and mysterious wisdom of equality, the infinitude of wisdom and liberty, the skillful means of expediency, and the section on emptiness, signlessness, and the vow to reach transformation.",
        "source": "T12n0395_001:1118b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二、反習雜句淺末小經，世俗行故。",
        "translation": "Second, he opposes the practice of miscellaneous phrases, superficial minor scriptures, and worldly practices.",
        "source": "T12n0395_001:1118b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王者經典，亂道之原，好講此業，易解世事，趣得人心令其歡喜，因致名聞。",
        "translation": "The king's scriptures are the origin of the troubled path, and they're well-versed in this business, easily understand worldly affairs, and aim to please the people and cause them to rejoice, which is why they're well-known.",
        "source": "T12n0395_001:1118b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三、新聞法人、淺解之士，意用妙快；深達之士，不用為佳。",
        "translation": "3. For journalists and people of shallow understanding, their intentions are subtle and quick; for those of profound understanding, it's better not to use them.",
        "source": "T12n0395_001:1118b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四、天龍鬼神不以為喜，心懷悒慼口發斯言：『大法欲滅，故使其然。』",
        "translation": "4. gods, dragons, and spirits don't take delight in this, but they become sad and say, 'The great teaching wants to cease, so I will make it so.'",
        "source": "T12n0395_001:1118b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨妙法化，反宣雜句。",
        "translation": "They abandon the teaching of the wondrous Dharma and instead proclaim various phrases.",
        "source": "T12n0395_001:1118b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天流淚，速逝而去。",
        "translation": "Shedding tears, the gods quickly departed.",
        "source": "T12n0395_001:1118b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五、由是正法稍稍見捨，無精修者。",
        "translation": "5. Because of this slight disregard for the right teaching, there's no one who diligently cultivates it.",
        "source": "T12n0395_001:1118b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為五事，令法毀滅。」",
        "translation": "These are the five things that cause the Dharma to perish.\"",
        "source": "T12n0395_001:1118b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「吾滅度後，有此邪事十五之亂，令法毀滅，一何痛哉！",
        "translation": "The Buddha told the monks, \"How painful it is to have these fifteen wrong actions and fifteen disruptions that cause the Dharma to crumble after I die out!",
        "source": "T12n0395_001:1118b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘欲諦學道，棄捐綺飾、不求名聞、質朴守真、宣傳正經。",
        "translation": "\"If there are monks who want to truly train on the path, they must discard frills, stop seeking fame, keep to the basics, and promote the right sūtras.",
        "source": "T12n0395_001:1118b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛之雅典深法之化不用多言，案本說經不捨正句，希言屢中不失佛意。",
        "translation": "There's no need to explain the Buddha's elegant scriptures and profound teaching, but the basic sūtras don't disregard the correct phrases, and the Buddha's intention isn't lost in his eloquent speech.",
        "source": "T12n0395_001:1118b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麁衣趣食，得美不甘；得麁不惡。",
        "translation": "\"Debilitating clothing and food are not pleasant when obtained beautifully, and they're not bad when obtained crudely.",
        "source": "T12n0395_001:1118b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣食好醜，隨施者意，不以瞋喜。",
        "translation": "They follow the donor's wishes regarding the clothing and food that's good and ugly, and they don't take delight in anger.",
        "source": "T12n0395_001:1118b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝身、口、意守諸根門，不違佛教。",
        "translation": "He guards his faculties by controlling body, speech, and thought, and doesn't act contrary to Buddhism.",
        "source": "T12n0395_001:1118b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念命甚短，恍惚以過，如夢所見，覺不知處。",
        "translation": "Mindful that life is short, he passes through in a trance, like seeing in a dream and not knowing where he is.",
        "source": "T12n0395_001:1118b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三塗之難，不可稱計，勤修佛法猶救頭然。",
        "translation": "The difficulty of the three destinies is incalculable, but diligently cultivating the Buddha's teachings is like saving the head.",
        "source": "T12n0395_001:1118b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五戒、十善、六度無極，四等、四恩、智慧、善權咸可精行。",
        "translation": "The five precepts, ten good qualities, and six perfections are limitless, and the four equals, four kinds of kindness, wisdom, and good authority can all be practiced with energy.",
        "source": "T12n0395_001:1118b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖不值佛世，出家為道，學不唐捐，平其本心，愍念一切，十方蒙恩。」",
        "translation": "Even though they weren't born in the Buddha's lifetime, they left home to follow the path, didn't make a huge sacrifice in their training, and leveled their original minds in sympathy for all people, which was gratefully received in ten directions.\"",
        "source": "T12n0395_001:1118b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是，諸比丘悲喜前自歸佛，作禮而去。",
        "translation": "When the Buddha said this, the monks rejoiced with joy and compassion, returned to the Buddha, paid homage, and departed.",
        "source": "T12n0395_001:1118c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說當來變經",
        "translation": "Foshuo donglichang jing",
        "source": "T12n0395_001:1118c04_0",
        "is_bad_quality": false
    }
]