[
    {
        "source_sentence": "佛說大乘入諸佛境界智光明莊",
        "translation": "Foshuo dasheng yezhang yezhang wangjin baizhao",
        "source": "T12n0359_003:0258b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嚴經卷第三",
        "translation": "Yanjing roll 3",
        "source": "T12n0359_003:0258b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試光祿卿",
        "translation": "Tripiṭaka of the Western Translation of the Sutra, Chaozan Dashi, and Guangluqing",
        "source": "T12n0359_003:0258b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳梵大師賜紫沙門臣法護等奉詔譯",
        "translation": "Translated by imperial order from the purple monk, ministers Hōshō and others, given by the master Chuanfan",
        "source": "T12n0359_003:0258b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，妙吉祥！",
        "translation": "\"Again, excellent and auspicious!",
        "source": "T12n0359_003:0258b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生相狀有下中上故，乃謂虛空有下中上。",
        "translation": "Because the characteristics of sentient beings are inferior, middling, and superior, it's called space that has inferior, middling, and superior characteristics.",
        "source": "T12n0359_003:0258b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應供、正等正覺亦復如是，一切處平等無差別分別，無生無滅，非過去、未來、現在，無色相、無戲論，無表示、無施設，無覺觸、無繫著，無稱量過諸稱量，無比喻超越比喻，無住、無取，超眼境界、離心意識，無狀貌、無文字、無音聲、無作意，無出無入，無高無下、超言境界，於一切處隨知隨入，但為眾生有下中上性，故見如來有下中上。",
        "translation": "The Tathāgata, Worthy of Offerings, and Completely Awakened One are likewise, equal in every place, without distinctions, without arising or ceasing, not past, future, or present, without form or form, without conceptualization, without representation or designation, without feeling or contact, without attachment, without measurement beyond all measurement, without metaphor or transcendence of metaphor, without abiding or grasping, beyond the realm of the eye, free of mental consciousness, without appearance, without words, without sound, without intent, without emanation or entry, without height or height, beyond the realm of language, and with knowledge and entry in all places, but only because sentient beings have lower, middle, and higher natures, which is why we see that the Tathāgata has lower, middle, and higher natures.",
        "source": "T12n0359_003:0258b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T12n0359_003:0258b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦不作是念：『今此一類下品信解眾生，我當為現下品身相；此之一類中品信解眾生，我當為現中品身相；此之一類上品信解眾生，我當為現上品身相。』",
        "translation": "The Tathāgata also doesn't think, 'Now, for this type of lower-ranked believing sentient beings, I will present the lower-ranked body image; for this type of middle-ranked believing sentient beings, I will present the middle-ranked body image; and for this type of higher-ranked believing sentient beings, I will present the upper-ranked body image.'",
        "source": "T12n0359_003:0258b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來說法亦復如是，但以一音為眾生說，隨眾生類各得解了。",
        "translation": "The Tathāgata likewise explains the teaching, but he explains it to sentient beings with a single voice, and each type of sentient being understands it.",
        "source": "T12n0359_003:0258b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來又復不作是念：『此類眾生下品信解，我當為說聲聞乘法；此類眾生中品信解，我當為說緣覺乘法；此類眾生上品信解，我當為說菩薩乘法。』",
        "translation": "Again, the Tathāgata doesn't think, 'For the lower-ranked believing sentient beings of this type, I'll explain the śrāvaka vehicle teaching; for the middle-ranked believing sentient beings of this type, I'll explain the pratyekabuddha vehicle teaching; and for the higher-ranked believing sentient beings of this type, I'll explain the bodhisattva vehicle teaching.'",
        "source": "T12n0359_003:0258b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來又復不作是念：『此類眾生信解布施，我當為說布施波羅蜜多法；此類眾生信解持戒、忍辱、精進、禪定、智慧，我當為說彼等諸波羅蜜多法。』",
        "translation": "Again, the Tathāgata doesn't think, 'When these kinds of sentient beings believe and understand generosity, I'll explain the perfection of generosity; when these kinds of sentient beings believe and understand observance of precepts, tolerance, effort, meditation, and wisdom, I'll explain their perfections.'",
        "source": "T12n0359_003:0258c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來於諸法中不生分別。",
        "translation": "The Tathāgata doesn't discriminate among the various dharmas.",
        "source": "T12n0359_003:0258c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0258c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來法身畢竟無生，如來以無生故，不以名色宣說隨識而轉，如來於剎那間暫無分別，如來具無盡相，盡際實際皆決定故，是即一切法平等際。",
        "translation": "The Tathāgata's Dharma body is ultimately unborn, the Tathāgata explains that it's because of the lack of birth that it doesn't develop according to consciousness by using name and form, that the Tathāgata momentarily has no discrimination, that the Tathāgata has inexhaustible characteristics, and that the totality of reality is determined, which is the extent of the equality of all dharmas.",
        "source": "T12n0359_003:0258c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應供、正等正覺一切處平等，無下中上差別分別；一切法平等，無下中上差別分別，亦復如是。",
        "translation": "Just as the Tathāgata, Worthy of Offerings, and Completely Awakened One are equal in all places and have no inferior, middling, or superior distinctions, so are all things equal and have no inferior, middling, or superior distinctions.",
        "source": "T12n0359_003:0258c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0258c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法無所得故。",
        "translation": "It's because all dharmas are unobtainable.",
        "source": "T12n0359_003:0258c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "\"Wonderful and auspicious!",
        "source": "T12n0359_003:0258c13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切法無所得即一切法平等，若法平等即法常住，若常住即無動，若無動即無依，若一切法無所依止即心無所住，心無住故即無生而生。",
        "translation": "If all things are unobtainable, then all things are equal; if things are equal, then they are eternally abiding; if they are eternally abiding, then there's no movement; if there's no movement, then there's no support; if all things have no support, then the mind has nothing to stand on; and because the mind has no support, then there's no birth and birth.",
        "source": "T12n0359_003:0258c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是觀即心心所轉而不顛倒，彼不顛倒心即如說而得，若如說而得即無戲論，若無戲論即無所行，若無所行即無流散，若無流散即無聚集，若法無流散即法性無違，若法性無違即一切處而悉隨順，若一切處隨順即法自性無動，若法自性無動即法自性乃有所得，若法自性有所得者即無有少法而可決擇。",
        "translation": "If he thus observes it, then his mind is transformed by mind and isn't mistaken, and if it's not mistaken, then it's attained as explained, and if it's attained as explained, then there's no conceptual elaboration, and if there's no conceptual elaboration, then there's no practice, and if there's no practice, then there's no dissipation, and if there's no dissipation, then there's no gathering, and if there's no dissipation of things, then the nature of things is not contradicted, and if the nature of things is not contradicted, then all places are conformed, and if all places are conformed, then the self-nature of things is not moving, and if the self-nature of things is not moving, then the self-nature of things has attained something, and if the self-nature of things has attained something, then there are no few things that can be discriminated.",
        "source": "T12n0359_003:0258c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0258c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知因緣所生性故。",
        "translation": "You should know that this is because of the nature of things that arise from causes and conditions.",
        "source": "T12n0359_003:0258c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若因緣生性即畢竟無生，若畢竟無生即得寂靜，若得寂靜即一切法作意悉同無依，若一切法作意悉同無依即都無依止，若無依止即無得無非得，若無得無非得即得法常住，若得法常住即深固法相應，若深固法相應即無有少法可住亦無佛法。",
        "translation": "If the nature of causes and conditions being produced is ultimately unproduced, and if there's ultimately no production, then there's quiescence, and if there's quiescence, then all things contemplated are equally without support; if all things contemplated are equally without support, then there's no support; if there's no support, then there's nothing attained or not attained; if there's nothing attained or not attained, then the teaching becomes eternally abiding; if the teaching becomes eternally abiding, then it's deeply resolute and associated with the teaching; if it's deeply resolute and associated with the teaching, then there's no little teaching to abide in and no Buddha teaching.",
        "source": "T12n0359_003:0258c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0259a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覺了空性故。",
        "translation": "\"It's because they've realized emptiness.",
        "source": "T12n0359_003:0259a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若覺了空性，即是菩提。",
        "translation": "If someone perceives the nature of emptiness, that's enlightenment.",
        "source": "T12n0359_003:0259a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是空、無相、無願、無造作，無著、無生、無取、無依，悉覺了故，即是菩提。",
        "translation": "Thus, because they are empty, formless, wishless, uncreated, unattached, unarisen, unacquired, and unfounded, they are fully realized, which is bodhi.",
        "source": "T12n0359_003:0259a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提者與深固法相應，相應之名由是建立，是故無高無下法相應，無作非無作相應，無縛無解相應，無一性無多性相應，無來無去相應，是即深固法相應。",
        "translation": "Bodhi is associated with profoundly solid dharmas, and the name associated with them is established from this; therefore, the association of dharmas that are neither higher nor lower, that are neither made nor unmade, that are neither fettered nor liberated, that are neither unitary nor numerous, and that are neither coming nor going is the association of profoundly solid dharmas.",
        "source": "T12n0359_003:0259a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若深固法相應，彼即無所相應，亦無所斷、復無果證。",
        "translation": "If these things are associated with profoundly entrenched qualities, then they are not associated with anything, are not eliminated, and do not have fruit realization.",
        "source": "T12n0359_003:0259a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0259a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心法本來自性明亮，但為客塵煩惱之所坌污，而實不能染污自性。",
        "translation": "The mind and dharmas are originally bright in their own nature, but they're defiled by the dust of objective afflictions, which really can't defile their own nature.",
        "source": "T12n0359_003:0259a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若自性明亮即無煩惱，若無煩惱即無對治，謂以對治煩惱皆悉斷故。",
        "translation": "If the self-nature is bright, then there are no afflictions, and if there are no afflictions, then there are no antidotes, which means that the afflictions are all stopped because of antidotes.",
        "source": "T12n0359_003:0259a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0259a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無已淨、無當淨，不離清淨本來如是。",
        "translation": "Nothing that has been purified and nothing that will be purified are not free from purity as they originally are.",
        "source": "T12n0359_003:0259a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若清淨即無生，若無生即無動，若無動即斷諸喜悅，一切所愛皆亦斷滅。",
        "translation": "If it's pure, then there's no arising, and if there's no arising, then there's no movement, and if there's no movement, then the joy and pleasure are stopped, and all cravings are stopped.",
        "source": "T12n0359_003:0259a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸愛滅彼即無生，若法無生即是菩提，若菩提即平等，若平等即真如。",
        "translation": "If those cravings cease, then there's no arising, and if things are unarisen, then it's enlightenment, and if enlightenment is equality, then equality is true thusness.",
        "source": "T12n0359_003:0259a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如即一切有為、無為法而悉無住，若真如中無彼有為及無為法即無二施設，若有為、無為法無二施設彼即真如。",
        "translation": "If the true thusness is all existent and inactive things that are completely unabiding, if there are no such existent or inactive things in the true thusness, then there are no two assumptions, and if there are no two assumptions for existent and inactive things, then that's the true thusness.",
        "source": "T12n0359_003:0259a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼真如即無異真如，若無異真如即無種類真如，若無種類真如即無來真如，若無來真如即無去真如，若無去真如即如所說真如，若如所說真如即無生真如，若無生真如即無染、無淨，若無染、無淨即無生、無滅，若無生、無滅即涅槃平等，若涅槃平等即無生死亦無涅槃，若無生死亦無涅槃，即無過去、未來、現在，若無過去、未來、現在，即無下、中、上法，若無下、中、上法，彼即是真如，真如之名由是建立。",
        "translation": "若彼真如即無異真如，若無異真如即無種類真如，若無種類真如即無來真如，若無來真如即無去真如，若無去真如即如所說真如，若如所說真如即無生真如，若無生真如即無染、無淨，若無染、無淨即無生、無滅，若無生、無滅即涅槃平等，若涅槃平等即無生死亦無涅槃，若無生死亦無涅槃，即無過去、未來、現在，若無過去、未來、現在，即無下、中、上法，若無下、中、上法，彼即是真如，真如之名由是建立。",
        "source": "T12n0359_003:0259a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說真如亦名實性，此說實性亦名如性，此說如性亦即真如。",
        "translation": "This is called the true nature also being called the nature of reality, this is called the nature of reality also being called the nature of thusness, and this is called the nature of thusness also being the true nature.",
        "source": "T12n0359_003:0259a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如與我而本無二亦無種類，無二義者即是菩提，菩提者覺了義。",
        "translation": "The true thusness and the self are originally nondual and without type, the meaning of nondual is bodhi, and bodhi is the meaning of awakening and comprehension.",
        "source": "T12n0359_003:0259a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此所說義，即是證入三解脫門之智，宣說一切法智，解入一切法三世平等，一切法無破壞義。",
        "translation": "The meaning explained here is the knowledge of realizing the gate to the three liberations, the knowledge of proclaiming all things, the understanding of realizing the equality of the three times for all things, and the meaning of no disintegration of all things.",
        "source": "T12n0359_003:0259b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此所說義即是無義，無音聲、無記說，無詮表及詮表所起，此說名智，所謂：義隨知智、識隨知智。",
        "translation": "This explained meaning is the meaninglessness, the absence of sounds and indeterminate speech, and the absence of explanations and expressions that are derived from explanations, which is called cognition, which is called the cognition of following meanings and the cognition of following consciousnesses.",
        "source": "T12n0359_003:0259b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說智義即是如性智義、識隨知智義，如是勝義即是法性，彼法性義即是義隨知智、識隨知智、勝義隨知智。",
        "translation": "The meaning of this explained cognition is the meaning of cognition of thusness and the meaning of cognition following consciousness, and as such, the ultimate meaning is the nature of reality, and the meaning of that nature is cognition following meaning, cognition following consciousness, and cognition following ultimate meaning.",
        "source": "T12n0359_003:0259b06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其法性即如其義，若法性即法住性，法寂靜性，彼法寂靜即無所轉，若法無轉即文與義而悉平等，若文義平等即無二之義平等，若彼義平等義識亦平等，此即是為入無二門平等之智。",
        "translation": "If the nature of that Dharma is thus its meaning, if the nature of that Dharma is the abiding nature of that Dharma and the quiescence of that Dharma, if the Dharma is quiescent, then nothing is transformed, if the Dharma is untransformed, then the text and meaning are all equal, if the text and meaning are equal, then the meaning of nonduality is equal, and if the meaning is equal, then the consciousness is also equal, which is the cognition of equality that enters the gate of nonduality.",
        "source": "T12n0359_003:0259b09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是世俗、勝義而悉平等，世俗義平等故即空義平等性平等，若空性義平等故即補特伽羅平等性平等，若補特伽羅平等故即法平等性平等，若法平等故即信解平等性平等，若信解平等彼覺了故即是菩提。",
        "translation": "As a result, the conventional and ultimate meanings are all equal, and if the conventional meaning is equal, then the meaning of emptiness is equal in nature, and if the meaning of emptiness is equal, then the equality of pudgala is equal in nature, and if pudgala is equal, then the equality of qualities is equal in nature, and if belief and understanding are equal and they are realized, then that's bodhi.",
        "source": "T12n0359_003:0259b13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "\"Wonderful and auspicious!",
        "source": "T12n0359_003:0259b18_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於色平等性有著有礙者，即於眼有礙，以色及眼自性智無所礙故；若於諸見有著有礙者，即於身有礙，以諸見趣身中自性空智無所礙故；若於不深固作意有著有礙者，即於法光明有礙，以深固作意伺察諸法自性空智無所礙故；若於疑惑垢染有著有礙者，即於解脫有礙，以信解解脫如實之智無所礙故；若於懈怠垢染有著有礙者，即於現證堅固精進有礙，以如所說法覺了之性無所礙故；若於諸障有著有礙者，即於七覺支法有礙，以無障解脫智無所礙故。",
        "translation": "若於色平等性有著有礙者，即於眼有礙，以色及眼自性智無所礙故；若於諸見有著有礙者，即於身有礙，以諸見趣身中自性空智無所礙故；若於不深固作意有著有礙者，即於法光明有礙，以深固作意伺察諸法自性空智無所礙故；若於疑惑垢染有著有礙者，即於解脫有礙，以信解解脫如實之智無所礙故；若於懈怠垢染有著有礙者，即於現證堅固精進有礙，以如所說法覺了之性無所礙故；若於諸障有著有礙者，即於七覺支法有礙，以無障解脫智無所礙故。",
        "source": "T12n0359_003:0259b18_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知一切法自性清淨，但由因緣和合而轉。",
        "translation": "You should know that all things are pure in their own nature but are produced by the conjunction of causes and conditions.",
        "source": "T12n0359_003:0259b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而諸菩薩當善了知一切法中染因、淨因，若染因、若淨因皆清淨已即無所住，謂我所起及見所起是染因，入無我法忍辱是淨因；我我所見是染因，於內寂靜外無所行是淨因；欲瞋害尋是染因，慈悲喜捨、入伺察法忍辱是淨因；四顛倒是染因，四念處是淨因；五蓋是染因，五根是淨因；六處是染因，六念是淨因；七不正法是染因，七覺支法是淨因；八邪法是染因，八正法是淨因；九惱處是染因，九次第定是淨因；十不善業道是染因，十善業道是淨因。",
        "translation": "而諸菩薩當善了知一切法中染因、淨因，若染因、若淨因皆清淨已即無所住，謂我所起及見所起是染因，入無我法忍辱是淨因；我我所見是染因，於內寂靜外無所行是淨因；欲瞋害尋是染因，慈悲喜捨、入伺察法忍辱是淨因；四顛倒是染因，四念處是淨因；五蓋是染因，五根是淨因；六處是染因，六念是淨因；七不正法是染因，七覺支法是淨因；八邪法是染因，八正法是淨因；九惱處是染因，九次第定是淨因；十不善業道是染因，十善業道是淨因。",
        "source": "T12n0359_003:0259c01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總要而言，一切不善作意皆是染因；一切善作意皆是淨因。",
        "translation": "In summary, all unwholesome intent is a defiling cause, and all wholesome intent is a purifying cause.",
        "source": "T12n0359_003:0259c11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若染因、若淨因，彼一切法自性皆空，無眾生、無壽者、無養者、無補特伽羅、無主宰、無攝受、無所作，如幻無相內心寂靜。",
        "translation": "Whether they are defiled causes or pure causes, the self-natures of all those things are empty, and there are no sentient beings, no living beings, no nurturers, no pudgalas, no lords, no collectors, and no doers, and their minds are as illusory and markless as internal quiescence.",
        "source": "T12n0359_003:0259c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若內寂靜是即遍寂，若遍寂即自性，若法自性即無所得，若無所得即無依止，若無依止即如虛空。",
        "translation": "If there's internal quiescence, that's pervasive quiescence, and if there's pervasive quiescence, that's the self-nature, and if the self-nature of dharmas is unobtainable, if there's no gain, that's no support, and if there's no support, that's like space.",
        "source": "T12n0359_003:0259c15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知染、淨彼一切法與虛空等，然彼虛空亦不壞法性。",
        "translation": "You should know that all those things that are defiled and purified are the same as space, but space doesn't destroy the nature of things.",
        "source": "T12n0359_003:0259c18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0259c19_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Wonderful and auspicious!",
        "source": "T12n0359_003:0259c19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中無有少法可得若生若滅。」",
        "translation": "There's not a single thing in there that can be produced or ceased.\"",
        "source": "T12n0359_003:0259c19_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥白佛言：「世尊！",
        "translation": "Miaojixiang said to the Buddha, \"Bhagavān!",
        "source": "T12n0359_003:0259c20_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾者，如來取證菩提，皆謂何乎？」",
        "translation": "If so, what does it mean when a tathāgata attains enlightenment?\"",
        "source": "T12n0359_003:0259c20_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「妙吉祥！",
        "translation": "The Buddha said, \"Wonderful and auspicious!",
        "source": "T12n0359_003:0259c21_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來以無根本無住故得菩提。」",
        "translation": "It's because the Tathāgata has no root and no abode that he attains enlightenment.\"",
        "source": "T12n0359_003:0259c21_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥言：「何名根本？",
        "translation": "Miaojixiang said, \"What's called the root?",
        "source": "T12n0359_003:0259c22_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復何名住？」",
        "translation": "What is the name of this abode?\"",
        "source": "T12n0359_003:0259c23_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「妙吉祥！",
        "translation": "The Buddha said, \"Wonderful and auspicious!",
        "source": "T12n0359_003:0259c23_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有身為根本，依虛妄分別而住。",
        "translation": "\"The existence of a body is fundamental, and it's based on false discrimination and abiding.",
        "source": "T12n0359_003:0259c23_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來以菩提平等故，即是一切法平等智，是故說名無根本、無住，如來以如是故現成正覺。",
        "translation": "Because buddha-tathāgatas are equal in bodhi, which is the wisdom that all things are equal, they therefore are called fundamentally nonabiding, and it's because of this that tathāgatas now achieve perfect enlightenment.",
        "source": "T12n0359_003:0259c24_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T12n0359_003:0259c26_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知諸法寂靜、近寂。",
        "translation": "You should know that all dharmas are quiescent and nearly quiescent.",
        "source": "T12n0359_003:0259c26_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名寂靜？",
        "translation": "What's called quiescence?",
        "source": "T12n0359_003:0259c27_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名近寂？",
        "translation": "What is called near extinction?",
        "source": "T12n0359_003:0259c27_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內謂寂靜、外謂近寂。",
        "translation": "It's called quiescent on the inside and nearly quiescent on the outside.",
        "source": "T12n0359_003:0259c27_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0259c28_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眼空故，我我所自性亦空，此名寂靜；知眼空已，色無所取，此名近寂。",
        "translation": "Because the eye is empty, the self-nature of self and what belongs to self is also empty, which is called quiescent; after knowing that the eye is empty, form is grasped by nothing, which is called nearly quiescent.",
        "source": "T12n0359_003:0259c28_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以耳空故，我我所自性亦空，此名寂靜；知耳空已，聲無所取，此名近寂。",
        "translation": "Because the ear is empty, the self-nature of I and mine is also empty, which is called quiescence; after knowing that the ear is empty, sound is grasped by nothing, which is called near quiescence.",
        "source": "T12n0359_003:0259c29_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以鼻空故，我我所自性亦空，此名寂靜；知鼻空已，香無所取，此名近寂。",
        "translation": "Because the nose is empty, the self-nature of I and mine is also empty, which is called quiescent; after knowing that the nose is empty, fragrance is taken away, which is called near quiescence.",
        "source": "T12n0359_003:0260a02_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以舌空故，我我所自性亦空，此名寂靜；知舌空已，味無所取，此名近寂。",
        "translation": "Because the tongue is empty, the self-nature of I and mine is also empty, which is called quiescent; after knowing that the tongue is empty, taste is grasped by nothing, which is called near quiescence.",
        "source": "T12n0359_003:0260a04_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以身空故，我我所自性亦空，此名寂靜；知身空已，觸無所取，此名近寂。",
        "translation": "Because the body is empty, the self-nature of self and what belongs to self is also empty, which is called quiescent; after knowing that the body is empty, touch is acquired by nothing, which is called near quiescence.",
        "source": "T12n0359_003:0260a05_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以意空故，我我所自性亦空，此名寂靜；知意空已，法無所取，此名近寂。",
        "translation": "Because the mind is empty, the self-nature of self and what belongs to self is also empty, which is called quiescent; after knowing that the mind is empty, dharmas are not grasped, which is called near quiescence.",
        "source": "T12n0359_003:0260a07_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "\"Wonderful and auspicious!",
        "source": "T12n0359_003:0260a08_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提自性明亮，心自性明亮。",
        "translation": "Bodhi's own nature is bright, and the mind's own nature is bright.",
        "source": "T12n0359_003:0260a09_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因故說自性明亮？",
        "translation": "For what reason is it said to have a bright self-nature?",
        "source": "T12n0359_003:0260a09_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂即自性無染污故、與虛空等，虛空自性而悉周遍，如虛空性，畢竟自性本明亮故。",
        "translation": "It means that it's the same as space because its own nature is undefiled, and it's completely pervaded by the own nature of space like the nature of space, so its ultimate nature is originally bright.",
        "source": "T12n0359_003:0260a10_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"And that's wonderful and auspicious!",
        "source": "T12n0359_003:0260a12_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提無入、無出。",
        "translation": "\"Bodhi has no entry and no exit.",
        "source": "T12n0359_003:0260a12_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名無入、無出？",
        "translation": "What do they mean by no entry and no exit?",
        "source": "T12n0359_003:0260a12_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無攝取，故名無入；謂無棄捨，故名無出。",
        "translation": "It means there's no taking in, so it's called no entering, and it means there's no discarding, so it's called no leaving.",
        "source": "T12n0359_003:0260a13_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來證解無入、無出，如所證解即同真如，無此無彼，以一切法離彼此故，是故如來現成正覺。",
        "translation": "The Tathāgata realizes that there's no entry and no exit, and as realized, they're the same as true reality, without here or there, because all things are free of each other; therefore, the Tathāgata has now become perfectly enlightened.",
        "source": "T12n0359_003:0260a14_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"Again, excellent and auspicious!",
        "source": "T12n0359_003:0260a16_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提無相亦無所緣。",
        "translation": "\"Bodhi has no marks and no perceptual objects.",
        "source": "T12n0359_003:0260a16_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名無相及無所緣？",
        "translation": "What do they mean by having no marks and having no perceptual objects?",
        "source": "T12n0359_003:0260a16_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂眼識無所得，此名無相；色無所觀，此名無所緣。",
        "translation": "The eye consciousness is unobtained, which is called signless, and form is unobserved, which is called signless.",
        "source": "T12n0359_003:0260a17_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳識無所得，此名無相；聲無所聞，此名無所緣。",
        "translation": "The ear consciousness is unobtained, which is called signless, and sound is unheard, which is called signless.",
        "source": "T12n0359_003:0260a18_70",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻識無所得，此名無相；香無所嗅，此名無所緣。",
        "translation": "The nasal consciousness is unobtained, which is called signless, and fragrance is unavailable for smelling, which is called signless.",
        "source": "T12n0359_003:0260a19_71",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌識無所得，此名無相；味無所甞，此名無所緣。",
        "translation": "The tongue consciousness is unobtained, which is called signless, and taste is unacquired, which is called signless cognition.",
        "source": "T12n0359_003:0260a20_72",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身識無所得，此名無相；觸無所覺，此名無所緣。",
        "translation": "The body consciousness is unobtained, which is called signless, and touch is felt by nothing, which is called no perceptual object.",
        "source": "T12n0359_003:0260a21_73",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意識無所得，此名無相；法無所分別，此名無所緣。",
        "translation": "The mental consciousness is unobtained, which is called signless, and the dharmas are undiscriminated, which is called signless.",
        "source": "T12n0359_003:0260a22_74",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Wonderful and auspicious!",
        "source": "T12n0359_003:0260a23_75",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等皆是諸聖境界，所有三界非聖境界，由是應行聖境界故。",
        "translation": "These are all noble realms, and all three realms are not noble realms because they should be practiced as noble realms.",
        "source": "T12n0359_003:0260a24_76",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"Again, wonderful and auspicious!",
        "source": "T12n0359_003:0260a25_77",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提非過去、未來、現在，三世平等故，三輪斷故。",
        "translation": "\"Enlightenment is not past, future, or present; it's because the three times are equal and because the three wheels are stopped.",
        "source": "T12n0359_003:0260a25_78",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三輪者，謂過去心不轉，未來識無取，現在意無動。",
        "translation": "The three wheels are a past mind that doesn't turn, a future consciousness that doesn't grasp, and a present mind that doesn't move.",
        "source": "T12n0359_003:0260a26_79",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心意識設有所住，而無分別不離分別，無計度不離計度，無過去已作、無未來領納、無現在戲論。",
        "translation": "Assuming there's an abode for that mind and consciousness, it's without discrimination and not free of discrimination, without calculation and not free of calculation, and without past actions, without future appropriation, and without present conceptualization.",
        "source": "T12n0359_003:0260a27_80",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"And it's wonderful and auspicious!",
        "source": "T12n0359_003:0260b01_81",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提非身得，無所為故。",
        "translation": "\"Bodhi is not personally attained because there's nothing to be done.",
        "source": "T12n0359_003:0260b01_82",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非身得者，謂即眼識無所了知，耳、鼻、舌、身、意識無所了知，以非心意識所了知故，即是無為。",
        "translation": "Not acquired by the body, it means that the visual consciousness has nothing to perceive, and the ear, nose, tongue, body, and consciousness have nothing to perceive because they aren't perceived by the mental consciousness, which is nonproductivity.",
        "source": "T12n0359_003:0260b01_83",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說無為，謂即無生、無住、無滅三輪清淨。",
        "translation": "This is called 'nonproductivity,' which means the three wheels of nonarising, nonabiding, and noncessation are purified.",
        "source": "T12n0359_003:0260b03_84",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其無為，於有為法應如是知。",
        "translation": "If they are so, then they should be known in this way with respect to existent things.",
        "source": "T12n0359_003:0260b04_85",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0260b05_86",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法無自性故。",
        "translation": "It's because all dharmas lack self-nature.",
        "source": "T12n0359_003:0260b05_87",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以法無自性，即法無有二。",
        "translation": "Because dharmas lack self-nature, that means there are no two dharmas.",
        "source": "T12n0359_003:0260b06_88",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"Again, excellent and auspicious!",
        "source": "T12n0359_003:0260b06_89",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提是無差別句。",
        "translation": "\"Bodhi is a statement without distinctions.",
        "source": "T12n0359_003:0260b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名無差別？",
        "translation": "What's called nondistinction?",
        "source": "T12n0359_003:0260b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復何名句？",
        "translation": "What are the other famous phrases?",
        "source": "T12n0359_003:0260b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無想是無差別；真如是句。",
        "translation": "\"It means that without ideation, there's no distinction, and true thusness is the phrase.",
        "source": "T12n0359_003:0260b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無住是無差別；法界是句。",
        "translation": "'Non-abiding' is without distinction, and 'reality' is the phrase.",
        "source": "T12n0359_003:0260b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無種種性是無差別；實際是句。",
        "translation": "'The absence of various seed natures is nondistinct; actuality is the phrase.'",
        "source": "T12n0359_003:0260b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所緣是無差別；無動是句。",
        "translation": "No perceptual objects is without distinction, and no movement is the phrase.",
        "source": "T12n0359_003:0260b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空是無差別；無相是句。",
        "translation": "Emptiness is nondistinct; signlessness is the phrase.",
        "source": "T12n0359_003:0260b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無尋伺是無差別；無想是句。",
        "translation": "No discursive reasoning is without distinction, and no ideation is the phrase.",
        "source": "T12n0359_003:0260b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無求願是無差別；無眾生是句。",
        "translation": "No seeking and vowing is without distinction; no sentient beings is the phrase.",
        "source": "T12n0359_003:0260b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生無自性是無差別；虛空是句。",
        "translation": "'The absence of self-nature of sentient beings is without distinction;' and 'emptiness' is the phrase.",
        "source": "T12n0359_003:0260b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所得是無差別；無生是句。",
        "translation": "'Nothing to be attained' is without distinction; 'Nothing to be produced' is the phrase.",
        "source": "T12n0359_003:0260b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無滅是無差別；無為是句。",
        "translation": "Nothing to cease is without distinction, and 'nothing to do' is the phrase.",
        "source": "T12n0359_003:0260b13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所行是無差別；菩提是句。",
        "translation": "Acting without something is without distinction; enlightenment is the phrase.",
        "source": "T12n0359_003:0260b14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂止是無差別；涅槃是句。",
        "translation": "Tranquility is without distinction; nirvāṇa is the phrase.",
        "source": "T12n0359_003:0260b15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所取是無差別；無生是句。",
        "translation": "To have nothing to grasp is without distinction, and to have no birth is the sentence.",
        "source": "T12n0359_003:0260b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"Again, this is wonderful and auspicious!",
        "source": "T12n0359_003:0260b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提者非身可證。",
        "translation": "\"Bodhi is not something that can be realized in person.",
        "source": "T12n0359_003:0260b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0260b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身雖有生，無思、無動，如草木瓦礫，其心如幻，空虛不實無所造作。",
        "translation": "Although his body is produced, it's without thought or movement, like grass, wood, or debris, and his mind is illusory, empty, insubstantial, and uncreated.",
        "source": "T12n0359_003:0260b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Wonderful and auspicious!",
        "source": "T12n0359_003:0260b18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於身心如實覺了，即是菩提。",
        "translation": "If you truly perceive body and mind, that's enlightenment.",
        "source": "T12n0359_003:0260b18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世俗所行非勝義諦。",
        "translation": "What's practiced in the conventional world is not the ultimate truth.",
        "source": "T12n0359_003:0260b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0260b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝義諦中無身無心、無法無非法，無實無不實，無真無妄，無語言無非語言。",
        "translation": "In the ultimate truth, there's no body, no mind, nothing that's impossible, and nothing that's not, nothing real and nothing unreal, nothing true and nothing false, and nothing spoken and nothing not spoken.",
        "source": "T12n0359_003:0260b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法是菩提。",
        "translation": "All dharmas are bodhi.",
        "source": "T12n0359_003:0260b21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0260b22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提無處所，非語言詮表，猶如虛空無處所故，亦無造作、無生、無滅，非語言詮表。",
        "translation": "\"Bodhi has no place and isn't expressed in words, just as space has no place and is uncreated, unarisen, and unceasing, and isn't expressed in words.",
        "source": "T12n0359_003:0260b22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來以菩提無處所，無造作、無生滅，無詮表故，如實如理審伺察時，彼一切法悉無言說。",
        "translation": "When the Tathāgata truly and rationally examines bodhi because it has no place, creates nothing, arises and ceases nothing, and is not expressed in words, all those things are completely without words.",
        "source": "T12n0359_003:0260b24_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提亦復如是，如實伺察時亦無言說。",
        "translation": "Bodhi is likewise, and when it's truly examined, it's also inexpressible.",
        "source": "T12n0359_003:0260b26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0260b27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語言無實故，無生滅故。",
        "translation": "Words are insubstantial, and there's no arising or ceasing.",
        "source": "T12n0359_003:0260b27_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"And that's wonderful and auspicious!",
        "source": "T12n0359_003:0260b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提無所取、無含藏。",
        "translation": "\"Bodhi has nothing to grasp and nothing to store.",
        "source": "T12n0359_003:0260b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名無所取？",
        "translation": "What's called ungrasped?",
        "source": "T12n0359_003:0260b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名無含藏？",
        "translation": "What is called non-returning?",
        "source": "T12n0359_003:0260b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了知眼故名無所取；色無所得名無含藏。",
        "translation": "He perceives the eye and is called ungrasped, and he perceives form and nothing at all and is called uncontained.",
        "source": "T12n0359_003:0260b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了知耳故名無所取；聲無所得名無含藏。",
        "translation": "He perceives the ear and is therefore called having nothing to grasp, and he perceives that sound has nothing to grasp and is called having nothing to store.",
        "source": "T12n0359_003:0260c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了知鼻故名無所取；香無所得名無含藏。",
        "translation": "He knows the nose and is called 'grasping nothing' because it knows the nose, and he's called 'non-returner' because he knows the fragrance that's obtained.",
        "source": "T12n0359_003:0260c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了知舌故名無所取；味無所得名無含藏。",
        "translation": "To know the tongue is called nothing taken, and to know that taste is nothing obtained is called nothing contained.",
        "source": "T12n0359_003:0260c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了知身故名無所取；觸無所得名無含藏。",
        "translation": "To know the body is called nothing taken, and to know that touch is nothing obtained is called nothing contained.",
        "source": "T12n0359_003:0260c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了知意故名無所取；法無所得名無含藏。",
        "translation": "Knowing the mind, it's called apprehension of nothing, and knowing that dharmas are apprehended by nothing is called non-returning.",
        "source": "T12n0359_003:0260c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來以是無所取、無含藏故，現證菩提。",
        "translation": "It's because the Tathāgata thus has nothing to grasp and nothing to store that he now realizes enlightenment.",
        "source": "T12n0359_003:0260c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證菩提已，於眼無所取、色無所得、眼識無住；耳無所取、聲無所得、耳識無住；鼻無所取、香無所得、鼻識無住；舌無所取、味無所得、舌識無住；身無所取、觸無所得、身識無住；意無所取、法無所得、意識無住；以識無住故，乃名如來、應供、正等正覺。",
        "translation": "After realizing enlightenment, the eye apprehends nothing, form apprehends nothing, and the eye consciousness has no abiding; the ear apprehends nothing, sound apprehends nothing, and the ear consciousness has no abiding; the nose apprehends nothing, fragrance apprehends nothing, and the nose consciousness has no abiding; the tongue apprehends nothing, taste apprehends nothing, and the tongue consciousness has no abiding; the body apprehends nothing, touch apprehends nothing, and the body consciousness has no abiding; the mind apprehends nothing, dharmas apprehends nothing, and the consciousness has no abiding; and it's because consciousness has no abiding that they're called the Tathāgata, Worthy of Offerings, and Completely Awakened One.",
        "source": "T12n0359_003:0260c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又妙吉祥！",
        "translation": "\"And that's wonderful and auspicious!",
        "source": "T12n0359_003:0260c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知眾生有四種法而住於心。",
        "translation": "You should know that there are four kinds of things that sentient beings do while abiding in their minds.",
        "source": "T12n0359_003:0260c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0359_003:0260c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色、受、想、行，一切眾生而住其心。",
        "translation": "\"It means that all sentient beings abide in their minds with respect to form, feeling, perception, and volition.",
        "source": "T12n0359_003:0260c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂以眾生於四法中心有住故，如來乃說不生、不滅、無所了知，建立菩提名之為空。",
        "translation": "It's because sentient beings abide in the mind of these four things that the Tathāgata teaches that they don't arise, don't cease, and don't have any understanding, and he establishes bodhi and calls it emptiness.",
        "source": "T12n0359_003:0260c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩提空故，即一切法空，如來亦空，以是空故現成正覺。",
        "translation": "Because bodhi is empty, that means all things are empty, and the Tathāgata is also empty, and it's because of this emptiness that he's now become perfectly enlightened.",
        "source": "T12n0359_003:0260c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T12n0359_003:0260c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非為空故取證菩提亦空，當知法中有一理智，所謂空性。",
        "translation": "\"It's not because of emptiness that they realize that bodhi is also empty, but they should know that there's a single principle and wisdom in things, which is called emptiness.",
        "source": "T12n0359_003:0260c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩提不空故即菩提無二，是故菩提及空悉無種類。",
        "translation": "Because enlightenment isn't empty, that means enlightenment is nondual; therefore, enlightenment and emptiness are both without type.",
        "source": "T12n0359_003:0260c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0359_003:0260c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一切法本無二故，無狀貌、無種類，無名無相、離心意識，無生無滅、無行無不行，亦無積集、無文字、無忘失，由如是故，乃說諸法空無所取，此中所說非勝義諦，謂勝義諦中無法可得乃說名空。",
        "translation": "Because all those things are originally without two, they have no form and no kind, have no name and no form, are free of mind and consciousness, are neither produced nor ceased, have no form nor function, and have no accumulation, no words, and no forgetfulness, it's because of this that it's said that all things are empty and ungraspable, and what's being said here is not the ultimate truth, which is to say that in the ultimate truth there's nothing to be grasped and that's why it's called empty.",
        "source": "T12n0359_003:0260c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "\"Wonderful and auspicious!",
        "source": "T12n0359_003:0260c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空故，此說虛空者，謂無言故名為虛空。",
        "translation": "\"It's like space; this expression space means it's called space because there are no words.",
        "source": "T12n0359_003:0260c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T12n0359_003:0260c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空亦復如是，此所說空，謂無言故名之為空。",
        "translation": "\"Emptiness is likewise what's called emptiness, which is to say that it's empty because there are no words.",
        "source": "T12n0359_003:0260c26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是解入即一切法無名，以無名故彼一切法假名施設。",
        "translation": "If someone thus understands and enters it, then all things are nameless, and it's because they're nameless that they're all nominally designated.",
        "source": "T12n0359_003:0260c27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T12n0359_003:0260c28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名者不在方不離方，如名不在方不離方故，於法名字乃有所說，其所說法亦不在方不離方，彼一切法亦復如是。",
        "translation": "\"Names don't lie in directions and don't separate from directions, and just as names don't lie in directions and don't separate from directions, so are the names of qualities that are explained, and the explanations they give are not in directions or separate from directions, and so are all those qualities.",
        "source": "T12n0359_003:0260c28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來了知本來如是，不生不滅、無起無相，離心意識、無文字、無音聲，如所了知亦然解脫。",
        "translation": "The Tathāgata understands that it's originally thus, that it doesn't arise or cease, that it has no arising or marks, that it's free of mind and consciousness, that it has no words, and that it has no sounds, and that it's liberated even as it's understood.",
        "source": "T12n0359_003:0261a02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T12n0359_003:0261a04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知一切法無縛、無解。」",
        "translation": "You should know that all dharmas are unfettered and unresolved.\"",
        "source": "T12n0359_003:0261a04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說大乘入諸佛境界智光明莊嚴經卷第三",
        "translation": "Foshuo dasheng yezhong yezhong wangming zhuangyan jing, vol. 3",
        "source": "T12n0359_003:0261a05_0",
        "is_bad_quality": false
    }
]