[
    {
        "source_sentence": "佛說護國尊者所問經卷第二",
        "translation": "Foshuo huguo zunzhe suowen jing roll 2",
        "source": "T12n0321_002:0005a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚卿",
        "translation": "Tripiṭaka of the Western Translation of the Scriptures, Tathāgata, Minister of the Chaoshan dynasty",
        "source": "T12n0321_002:0005a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳法大師臣施護奉　詔譯",
        "translation": "Translated by imperial decree by the Minister of the Transmission of the Dharma, Shihu",
        "source": "T12n0321_002:0005a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告尊者護國言：「有四種法，於諸菩薩而為縛法。",
        "translation": "It was then that the Bhagavān addressed Venerable Hōkoku, saying, \"There are four things that bind bodhisattvas to the Dharma.",
        "source": "T12n0321_002:0005a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等四法？",
        "translation": "\"What are these four things?",
        "source": "T12n0321_002:0005a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、輕慢他人，二者、於世間事方便趣求，三者、散亂用心如行嶮難，四者、於其眷屬一心貪著。",
        "translation": "1. they despise others, 2. they seek worldly things conveniently, 3. they distract their mind like walking through a dangerous path, and 4. they are single-mindedly attached to their retinue.",
        "source": "T12n0321_002:0005a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是四法為菩薩縛。」",
        "translation": "Such are the four things that bind a bodhisattva.\"",
        "source": "T12n0321_002:0005a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說頌曰：「若行輕慢於他人、　　方便唯求世間事、　散亂如行嶮道中，　　如象陷身深泥裏；　於自眷屬生愛著，　　常懷貪戀如迷醉，　如是種種被纏縛，　　增長愚癡覆大智。",
        "translation": "Again, he spoke the verse, \"Suppose someone conducts themselves with contempt for others, skillfully seeks only worldly things, distracts themselves as they walk through a dangerous path, like an elephant stuck in deep mud, becomes attached to their dependents, always longs for them as if they were drunk, and is bound in these ways, which increases foolishness and hinders great cognition.",
        "source": "T12n0321_002:0005a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人怖苦厭生死，　　求出沈淪趣解脫，　捨於輕慢世間等，　　是名菩薩所行道。",
        "translation": "If someone fears suffering and grows weary of birth and death, seeks escape from sinking into liberation, and abandons such things as conceit in the world, this is called the path practiced by bodhisattvas.",
        "source": "T12n0321_002:0005a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　滅盡無邊諸苦已、　　及彼煩惱諸眷屬，　究竟安樂無所求，　　圓滿菩提寂靜道。",
        "translation": "After ending limitless suffering and the retinue of those afflictions, they attain well-being and seek nothing, and they complete the tranquil path of enlightenment.",
        "source": "T12n0321_002:0005a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所行六種波羅蜜、　　三身、五智、十力等，　一切功德悉具足，　　如是永離無邊苦。",
        "translation": "The six perfections, three bodies, five kinds of wisdom, ten powers, and so forth that are practiced are all fully replete with all merits, and thus they are permanently freed from limitless suffering.",
        "source": "T12n0321_002:0005a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去修行無量劫，　　為眾生故求菩提，　一切眾善悉皆修，　　遠離諸惡眷屬等。",
        "translation": "They've cultivated countless eons in the past, seeking enlightenment for the sake of sentient beings, cultivating all the many good qualities, and keeping far away from bad associates and so forth.",
        "source": "T12n0321_002:0005a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恒樂深山寂靜處，　　遠離聲色想真空，　如是精進不間修，　　獲大丈夫圓滿慧。",
        "translation": "Always enjoying the quietude of deep mountains, far removed from sound and form, perceptions of the vacuum, and uninterrupted cultivation of such effort, they attain the perfect wisdom of a great man.",
        "source": "T12n0321_002:0005a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見彼世間眾生行，　　五趣輪迴無有窮，　我於過去發慈心，　　捨自身命及妻子、　國城、大地及珍寶，　　如是求佛無數劫。",
        "translation": "Seeing the course of sentient beings in the world, whose cycle of the five destinies knows no limit, I aroused a compassionate heart in the past and gave up my life, my wife, my country, my land, and my treasures to seek the Buddha in this way for measureless eons.",
        "source": "T12n0321_002:0005b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔居山行忍辱，　　花菓池沼悉清淨，　歌利王來截手足，　　心生慈忍無瞋恚。",
        "translation": "I used to live on a mountain and practice forbearance, purifying all the flowers and fruits in the pond, and when King Kali came and cut off my hands and feet, my mind developed compassion and tolerance without anger.",
        "source": "T12n0321_002:0005b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔住深山名闍摩，　　我為仙人婆囉多，　時有天子射我身，　　亦無瞋恨生其惡，　不惜身命如頑石，　　志求菩提心不退。",
        "translation": "Once I lived deep in a mountain named Jātmā, and I was a Brahmā, an immortal, when a god shot me in the body, yet I didn't hate or become mean. I didn't spare my life like a stubborn stone, and my resolve to pursue bodhi didn't falter.",
        "source": "T12n0321_002:0005b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔曾為薩埵時，　　見彼餓虎欲食子，　投崖捨命濟彼飢，　　天人稱讚大精進，　常樂布施救眾生，　　不悋身命及財寶。",
        "translation": "Once, when I was a sattva, I saw a hungry tiger trying to feed its child, so I threw myself over a cliff and sacrificed my life to help it starve. Gods and people praised my great effort, which was always glad to give to save sentient beings and didn't spare body, life, or treasure.",
        "source": "T12n0321_002:0005b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔曾為摩曩縛，　　廣行布施盡寶海，　捨大摩尼令富他，　　如是求證菩提果。",
        "translation": "I once was a man who gave generously to Mahānābhava, exhausting the ocean of treasures, giving up a great maṇi to enrich others, and thus seeking to realize the fruit of enlightenment.",
        "source": "T12n0321_002:0005b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　往昔作大蘇摩王，　　名稱普聞我修行，　爾時入縛為他人，　　於彼百王得解脫。",
        "translation": "In the past, I was the great Soma King whose name was widely heard of my practice, and at the time I entered into bondage for others and attained liberation from those 100 kings.",
        "source": "T12n0321_002:0005b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔曾為能捨王，　　一切所求皆充足，　乃至身命及珍財，　　令他大富離貧苦。",
        "translation": "Once, I was the king who could abandon all that he sought, even his life and valuables, so that others might become very rich and escape poverty.",
        "source": "T12n0321_002:0005b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔有飛鴿來投我，　　即割身肉濟彼命，　如是持刀割肉時，　　無驚無怖心安隱。",
        "translation": "Once, a flying dove came to me and cut off my flesh to save their lives. When I held the knife and cut off their flesh, I wasn't frightened or afraid, and my mind was peaceful.",
        "source": "T12n0321_002:0005b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦於過去捨王位，　　盡世行彼波羅蜜，　復自化身為妙藥，　　捨己身命濟群品。",
        "translation": "In the past, he also abandoned his position as king, spent his whole life practicing the perfection of being, and then transformed himself into a wonderful medicine, sacrificing his own life to save the lives of his people.",
        "source": "T12n0321_002:0005b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為師子王，　　常為世間行利樂，　棄捨王位及眷屬，　　一心志求無上道。",
        "translation": "Once upon a time, he was the lion king who always worked for the world's benefit and joy, abandoned his position as king and his retinue, and single-mindedly pursued the unsurpassed path.",
        "source": "T12n0321_002:0005b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為妙牙王，　　當時獲壽於千歲，　八十四年修苦行，　　發大精進施珍財，　於佛塔前燃己身，　　志心恭敬作供養。",
        "translation": "Once upon a time, he was the king of the fine tooth, who attained a life span of 1,000 years, cultivated austerities for 84 years, made great efforts to give treasures, set himself on fire in front of a Buddha stūpa, and made offerings with respect and resolve.",
        "source": "T12n0321_002:0005b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為無垢王，　　時有惡眼婆羅門，　來詣深宮乞我頭，　　即便捨頭而施與。",
        "translation": "Once upon a time, he was the king of stainless steel when a malevolent-eyed brāhmaṇa came to the deep palace to ask for my head, and he gave it up as a gift.",
        "source": "T12n0321_002:0005b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為月光王，　　普救眾生作善利，　一切城隍聚落中，　　四衢道路施良藥。",
        "translation": "Once upon a time, he was the King of Moonlight, who saved all sentient beings for the good of others and gave good medicine in all the cities and towns and on the roads of the four quadrants.",
        "source": "T12n0321_002:0005b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　千女端嚴妙色相，　　金寶、真珠廣莊嚴，　捨彼千女自修行，　　如是所作福無等。",
        "translation": "A thousand women were of beautiful appearance, adorned with gold jewelry and real pearls, and they cultivated their own practice by abandoning those thousand women, so their merit was unequalled.",
        "source": "T12n0321_002:0005c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為輸婆王，　　所戴寶冠世希有，　香花、眾寶共莊嚴，　　捨施他人無所悋。",
        "translation": "Once upon a time, he was the Śubha King, wearing a jeweled crown that was rare in the world, adorned with flowers and jewels, and giving to others without any stinginess.",
        "source": "T12n0321_002:0005c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為寶髻王，　　手足柔軟如兜羅，　細滑微妙色如蓮，　　捨自手足利眾生。",
        "translation": "Once upon a time, he was the King of the Jeweled Topknot, whose hands and feet were as soft as tulas and as fine and delicate as lotuses, and he gave up his own hands and feet to benefit sentient beings.",
        "source": "T12n0321_002:0005c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為安意王，　　時有商主名星賀，　領諸商客泛海中，　　忽然漂墮羅剎國。",
        "translation": "Once upon a time, he was the king of the aspirations, and there was a merchant named Singha who led his merchants out to sea and suddenly fell into the land of Rājagṛha.",
        "source": "T12n0321_002:0005c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼有百千夜叉女，　　無慚大惡唯食人，　商客不識夜叉女，　　見此端正生愛心，　五百商旅將被食，　　我親救度俱脫難。",
        "translation": "There were a hundred thousand yakṣa women there, who were conscienceless and did nothing but eat people. The merchants didn't know the yakṣa women, but they saw this upright woman and became fond of her. Five hundred merchants were about to be eaten, but I personally saved them all from that difficulty.",
        "source": "T12n0321_002:0005c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為妙眼王，　　四兆女人常圍繞，　端正殊妙如天女，　　捨彼出家求佛道。",
        "translation": "Once upon a time, he was the king of the wonderful eye, surrounded by four trillion women, correct and beautiful like a goddess, who left home and sought the Buddha's path.",
        "source": "T12n0321_002:0005c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為福光王，　　無垢清淨黃金色，　手指纖長世所希，　　捨此手指利群品。",
        "translation": "Once upon a time, he was the king of blessed radiance, a golden color that's spotless and pure, with long, slender fingers that are unmatched in the world, and he gave up those fingers to benefit a multitude of people.",
        "source": "T12n0321_002:0005c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為法財王，　　紺目清淨如青蓮，　於身所愛最難捨，　　人來求者亦與之。",
        "translation": "Once upon a time, he was the king of the Dharma treasure, whose deep eyes were pure like a blue lotus, and whose craving for his body was most difficult to abandon, so even people who sought him gave him up.",
        "source": "T12n0321_002:0005c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為蓮目王，　　愍見眾生在苦惱，　時有女人懷憂病，　　我行悲愍令解脫。",
        "translation": "Once upon a time, he was the lotus-eyed king who had compassion for sentient beings in distress and suffering, and there was a woman who was overcome with grief and illness, and I acted with compassion to bring about her liberation.",
        "source": "T12n0321_002:0005c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為大醫王，　　常救病苦諸眾生，　或出身血、及髓、腦，　　救療疾病令除愈，　如是勇猛精進心，　　未曾暫捨於情物。",
        "translation": "Once upon a time, he was the great king of doctors, always saving the lives of sick and suffering sentient beings, whether they were born from blood, marrow, or brains, curing illnesses and healing them with such a vigorous and energetic mind that he never temporarily abandoned the things of men.",
        "source": "T12n0321_002:0005c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為成利王，　　以自所愛如蓮目，　施諸眾生療彼疾，　　一心為求無上道。",
        "translation": "Once upon a time, he was King Narêndra, and because he loved something like the lotus eye, he gave it to sentient beings to heal their illnesses, single-mindedly seeking the unsurpassed path.",
        "source": "T12n0321_002:0005c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔為王名普現，　　慈愍有情行救度，　爾時捨彼四大洲、　　國土、人民及眾寶、　乃至割身血肉等，　　施與眾生心歡喜。",
        "translation": "Once upon a time, he was a king named Pūrṇa, who had compassion for sentient beings and performed acts of salvation when he gave up the four continents, lands, people, and treasures, even cutting off his own flesh and blood, to give to sentient beings with joy in his heart.",
        "source": "T12n0321_002:0005c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又為王女稱大智，　　身嚴金色體柔軟，　時有一女名色相，　　此是商人所生女，　飢羸困苦無飲食，　　我捨雙乳濟彼命。",
        "translation": "\"Also, the king's daughter was called Great Wisdom, and her body was adorned with gold and supple, when there was a woman named Form, born to a merchant, who was hungry, weary, and suffering without food or drink, and I gave up both my breasts to save her life.",
        "source": "T12n0321_002:0005c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔為王號多聞，　　所有珍寶、妙衣服、　象、馬、車乘、財帛等，　　如是布施無有數。",
        "translation": "In the past, the king called her well-versed in the treasures, fine clothing, elephants, horses, carriages, and valuables that he owned, so he gave them away like this, which are incalculable.",
        "source": "T12n0321_002:0006a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復見商人漂海浪，　　我於海內救得彼，　背恩復乞我眼睛，　　我亦施之無瞋恚。",
        "translation": "I once saw a merchant adrift in the ocean, and I rescued him from the sea.",
        "source": "T12n0321_002:0006a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　棄捨大地諸眷屬，　　觀彼不著如蟻子，　如是往昔濟群生，　　心無退動生疲苦。",
        "translation": "Abandoning my retinue on the earth, I observed that they weren't attached to me like an ant child, and thus I had helped people in the past without faltering or becoming weary.",
        "source": "T12n0321_002:0006a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復覩孤老貧窮人，　　給足所須而承事，　恒行敬愛無慢心，　　亦無慚赧、無人我。",
        "translation": "He also saw an elderly or poor person who had everything they needed and served them, always honoring and loving them without conceit, and lacking shame or selfishness.",
        "source": "T12n0321_002:0006a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾作猿猴身，　　與彼同類共遊行，　時遇獵師縛彼身，　　我即替他令脫命。",
        "translation": "Once, I was once an ape in body and traveled with one of their kind, and when I met a hunter who bound their body, I freed it for them.",
        "source": "T12n0321_002:0006a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是以我奉國王，　　王令後宮縻繫我，　思念父母年孤老，　　所有飲饌無心食，　如是忍苦懷慈孝，　　是故得脫王宮難。",
        "translation": "Thus, I served the king, and the king tied me to his palace. I thought of my parents as elderly and thought nothing of the food I ate. Thus, I endured suffering and kindness, and I was freed from the difficulty of the king's palace.",
        "source": "T12n0321_002:0006a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾作大熊身，　　常處深山行慈忍，　忽逢樵士遭大雨，　　引彼山巖令迴避。",
        "translation": "Once upon a time, he was a great bear who used to go deep into the mountains to practice kindness and patience.",
        "source": "T12n0321_002:0006a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過是七日至天晴，　　告彼樵人：『莫說我。』",
        "translation": "After seven days, the sky cleared, and he told the woodcutter, 'Don't talk about me.'",
        "source": "T12n0321_002:0006a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時樵士安隱歸，　　招引獵師來殺害，　如是背恩殺我身，　　亦無瞋恨生慈忍。",
        "translation": "The woodcutter then returned in peace and invited the hunter to kill him. Such a breach of kindness killed me, but I developed compassion and tolerance without anger.",
        "source": "T12n0321_002:0006a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為白象王，　　求佛菩提行十善，　時有獵師射我身，　　我即捨牙心歡喜。",
        "translation": "Once, when I was the white elephant king and sought the Buddha's enlightenment and performed the ten good deeds, a hunter shot me in the body, and I rejoiced at heart when I gave up my tusks.",
        "source": "T12n0321_002:0006a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔有惡人帝哩子，　　以火焚燒大山野，　我見此火運慈心，　　天雨香花火自滅。",
        "translation": "Once, there was a bad man, Driṣṭhila, who burned a great mountain range with fire, but when I saw that fire, I had compassion, and the sky rained down fragrant flowers and the fire went out on its own.",
        "source": "T12n0321_002:0006a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾為大鹿王，　　金寶莊嚴體殊妙，　入彼河中救溺人，　　令得安隱全身命。",
        "translation": "Once, I was a great deer king with a marvelous body adorned with gold jewelry who went into that river to rescue a drowning man and made him live in safety.",
        "source": "T12n0321_002:0006a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　告言：『勿說我居山，　　恐彼惡人來獵我。』",
        "translation": "He told them, 'Don't tell them I live on a mountain, for fear that some bad man will hunt me down.'",
        "source": "T12n0321_002:0006a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時彼溺人背其恩，　　指告國王令採捕，　指已兩手俱墮地，　　我時無有少瞋恚。",
        "translation": "When that submerged man disregards his kindness and tells the king to pick him up, he falls to the ground with both hands after pointing, and I don't feel a little anger at the time.",
        "source": "T12n0321_002:0006a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔有五百商人眾，　　為求珍寶泛海中，　商主所有資糧竭，　　商眾飢羸無飲食。",
        "translation": "Once, there were 500 merchants who sailed the ocean in search of precious treasures, and the merchant owner's provisions were exhausted, and the merchants were hungry and exhausted without food or drink.",
        "source": "T12n0321_002:0006b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是時我作大龜王，　　捨身濟彼商人命，　以我慈心利他故，　　俱得安然到海岸。",
        "translation": "I then became the great turtle king and sacrificed myself to save the merchants' lives. Because I was compassionate and beneficial to others, they all made it to the shore in safety.",
        "source": "T12n0321_002:0006b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔變身為藥蟲，　　此蟲名曰俱蘇摩，　一切疾病食我身，　　俱獲安隱無諸患。",
        "translation": "In the past, I transformed myself into a medicine bug named Kusuma, and all the diseases that ate my body were made secure and trouble-free for everyone.",
        "source": "T12n0321_002:0006b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔復為師子王，　　大力無畏行慈愍，　有大獵師射我身，　　亦無瞋恨、無忿怒。",
        "translation": "I was once a lion king, so powerful and fearless that I acted with kindness, and a great hunter shot me in the body, but I didn't hate or become angry.",
        "source": "T12n0321_002:0006b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔亦作白馬王，　　常行菩薩慈悲行，　救彼商人羅剎難，　　擔負眾人出海中。",
        "translation": "I also used to be the king of white horses, a bodhisattva who always performed compassionate actions, saved that merchant Rāṣṭrapāla from difficulty, and carried many people out of the ocean.",
        "source": "T12n0321_002:0006b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔作飛鳥軍拏羅，　　遠離色欲無散亂，　令彼同類眾飛禽，　　亦復而行清淨行。",
        "translation": "In the past, I was a flying bird named Junnarā, which was free of desire for form and undisturbed, and caused many flying creatures of my kind to also conduct pure activities.",
        "source": "T12n0321_002:0006b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔因中作兔王，　　與諸群兔宣法行，　見一仙人飢無食，　　即捨自身濟彼命。",
        "translation": "Once, he was the king of rabbits among causes, and he taught the Dharma to a group of rabbits. When he saw a sage who was hungry and had nothing to eat, he gave himself up to save his life.",
        "source": "T12n0321_002:0006b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔曾作鸚鵡身，　　常居花菓樹林中，　時有惡人毀此林，　　以我力故復繁盛。",
        "translation": "Once, I was a parrot, and I used to live in a grove of flowering fruit trees.",
        "source": "T12n0321_002:0006b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔復作獼猴王，　　與眾獼猴而遊行，　時有國王來採捕，　　我救彼難現王前。",
        "translation": "Once upon a time, I was the king of monkeys, and I paraded around with a troop of monkeys when a king came to get them, and I saved them from being trapped.",
        "source": "T12n0321_002:0006b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又昔復為鸚鵡身，　　父母俱老無力飛，　我於田中銜稻穀，　　養育二親行孝敬。",
        "translation": "Once upon a time, I was a parrot whose parents were both old and unable to fly, so I gathered rice from the fields and raised my two parents to be dutiful.",
        "source": "T12n0321_002:0006b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於是田主懷瞋怒，　　捉彼鸚鵡而訶責：『云何偷於我稻穀？",
        "translation": "Then the owner of the field became angry, caught that parrot, and reprimanded it, 'Why did you steal my rice?'",
        "source": "T12n0321_002:0006b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此時須見汝捨命。』",
        "translation": "'This is the time to see you give up your life.'",
        "source": "T12n0321_002:0006b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鸚鵡告彼田主言：　　『汝所種田濟一切，　我持少分供二親。",
        "translation": "The parrot told the farmer, 'That field you've planted helps everything, and I'll take a small portion of it for my two relatives.",
        "source": "T12n0321_002:0006b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝何言我為偷盜？』",
        "translation": "Why do you say that I stole it?'",
        "source": "T12n0321_002:0006b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時田主聞是語，　　倍與稻穀生歡喜：『我作禽類汝為人，　　如是孝養未曾有。』",
        "translation": "When the farmer heard this, he gave more rice and rejoiced, 'I was a bird, and you're a human being; such filial support has never existed before.'",
        "source": "T12n0321_002:0006b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　往昔所行菩薩行，　　經歷無數微塵劫，　求趣佛果大菩提，　　未有少時生疲倦。",
        "translation": "The bodhisattva practices he practiced in the past had lasted for countless, tiny eons, and he sought the great enlightenment that is the fruit of Buddhahood, but never once did he grow weary.",
        "source": "T12n0321_002:0006b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是捨施內外財、　　國城、妻子及珠珍、　頭、目、髓、腦及身命，　　持戒、忍辱、精進、禪、　智慧方便願力等，　　如是諸度廣修習，　未曾暫廢菩薩行，　　一切眾善悉無遺。",
        "translation": "Thus bestowing internal and external possessions, a country, a wife, and a jewel, a head, eyes, marrow, brain, and body, observing precepts, patience, effort, meditation, wisdom, skillful means, and vows, thus cultivating these perfections, they never temporarily abandoned the bodhisattva practice, and all of their good qualities were completely gone.",
        "source": "T12n0321_002:0006b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如佛所說頭陀行，　　彼行亦為趣佛因，　如是一一盡修習，　　精進而行無缺犯。",
        "translation": "As the Buddha has described the ascetic practice, that practice is also the cause for attaining Buddhahood, and thus they are all cultivated in their entirety, carried out with energy and without fail.",
        "source": "T12n0321_002:0006c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於後末世諸眾生，　　雖作苾芻無僧行，　常生我慢、懈怠心，　　貪著聲色及財利，　聞此大行勝妙因，　　返生誹謗不信受，　輕笑言教告諸人：　　『此之所說非佛教。』",
        "translation": "In later generations, sentient beings who become bhikṣus without engaging in the saṃgha's practice, always become proud and lazy, and become addicted to fame, materiality, and wealth hear about the surpassing and wonderful causes of this great practice, then denigrate and disbelieve them.",
        "source": "T12n0321_002:0006c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我聞過去有一人，　　多聞學識立名海，　聞佛所說不信受，　　以此法言問本師。",
        "translation": "I've heard of a person in the past who had heard much, studied consciousness, and established an ocean of fame, heard what the Buddha taught but didn't believe it, and asked his teacher about it using these words.",
        "source": "T12n0321_002:0006c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼師耆年亦多聞，　　於此佛言亦不信，　展轉如是告他人：　　『無我、無人、無眾生，　此法非為真實教。",
        "translation": "That teacher, who was elderly and well-versed, didn't believe what the Buddha said either, and he repeatedly told others, 'There's no self, no person, and no sentient beings, and this teaching is not the true teaching.",
        "source": "T12n0321_002:0006c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　虛受勤勞求出離，　設爾持戒學威儀，　　如是修習何所為？",
        "translation": "What would be the point of vainly accepting diligence and seeking escape, assuming you observe precepts and train in deportment, and thus cultivate them?'",
        "source": "T12n0321_002:0006c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既無眾生、無我、人，　　父母、宗親亦不有，　此是邪見外道言，　　非是真實解脫法。』",
        "translation": "'Since there are no sentient beings, no self, and no person, and parents and relatives don't exist, this is the talk of non-Buddhists with wrong views, not the true and real teaching of liberation.'",
        "source": "T12n0321_002:0006c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復次末世諸苾芻，　　而造諸過無慚愧，　我慢、貢高心散亂，　　憎嫉、貪愛如火燒。",
        "translation": "Furthermore, in the latter days, those monks create faults without conscience, become distracted by pride and arrogance, and hate and craving burn like fire.",
        "source": "T12n0321_002:0006c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三衣不整垂手行，　　拖拽袈裟入聚落，　縱情放逸而飲酒，　　種種而行麁惡行。",
        "translation": "They don't wear their three robes properly and walk with their hands hanging down, drag their robes into the villages, indulge in debauchery and drinking, and engage in various crude and unwholesome behaviors.",
        "source": "T12n0321_002:0006c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身被法服為佛使，　　不依戒律近王侯，　馳騁書信往四方，　　恃官勢力求財利，　退失如來功德林，　　墮彼三塗諸惡趣。",
        "translation": "They are clothed in the Dharma robe and serve as the Buddha's envoy, don't follow the precepts and approach kings and princes, chase letters to all directions, rely on their position and power, and strive for wealth and profit, lose sight of the Tathāgata's forest of merit, and fall into the three miserable destinies.",
        "source": "T12n0321_002:0006c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或有經營於市肆、　　或有耕種住村坊，　佛言：『此類非沙門，　　清淨苾芻勿同事。』",
        "translation": "Some may run a marketplace or farm a village, but the Buddha says, 'Such are not ascetics; pure monks should not associate with them.'",
        "source": "T12n0321_002:0006c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常住供養財物等，　　如己所有非法用，　見有具德諸苾芻，　　而起慢心行誹謗，　罔昧賢善破律儀，　　密於俗舍染邪行，　畜養妻男種種為，　　恣行麁惡俗無異。",
        "translation": "They always maintain offerings of property and so forth, using it as they own it and not as they would if it were unlawful, and then they see some well-established monk and act with conceit and denigrate him, ignoring goodness and goodness and breaking the rules, secretly defiling wrong behavior in secular homes, keeping wives and sons for various purposes, and wantonly acting in a crude and ungodly manner.",
        "source": "T12n0321_002:0006c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是廣造惡業因，　　非是沙門出家行，　當墮三塗惡趣中，　　永劫沈淪受眾苦。",
        "translation": "Such extensive creation of bad causes of action is not the religious practice of renunciant monks, and they'll fall into the three miserable destinies and be submerged in numerous sufferings for an eternity.",
        "source": "T12n0321_002:0007a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於自諸根不調伏，　　貪著飲食及色欲，　常被他人生輕賤，　　所學徒弟亦復然。",
        "translation": "Unable to control their own faculties, they crave food and drink and the lust of form, and are often despised by others, even as the disciples they study with do the same.",
        "source": "T12n0321_002:0007a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　未曾誨示修行法，　　亦無師資恭敬心，　人前談己為慈悲，　　非要學徒行承事。",
        "translation": "He's never been shown the way to practice, has no respect for teachers, talks about himself as compassionate, and doesn't ask his apprentices to serve him.",
        "source": "T12n0321_002:0007a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或有風瘨及癩病、　　六根不具醜惡人，　如是攝受令出家，　　亦非沙門佛弟子。",
        "translation": "If someone with dementia or leprosy or an ugly person who doesn't have the six faculties is thus taken in and made to leave home, they're not an ascetic or disciple of the Buddha.",
        "source": "T12n0321_002:0007a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無戒、無行、無其德，　　彼等非俗、非沙門，　譬如負柴燒臭屍，　　清淨之者宜遠離。",
        "translation": "Without precepts, without practice, and without virtue, they're neither secular nor ascetic, like carrying firewood to burn a smelly corpse, which a pure person should avoid.",
        "source": "T12n0321_002:0007a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　性本囂浮多散亂，　　亦如狂象失調伏，　設處深山心不寧，　　貪火焚燒無暫住。",
        "translation": "They're arrogant and disorganized by nature, like a crazed elephant out of control, whose mind is restless if it's placed deep in a mountain, and whose desire for firewood burns it without a moment's respite.",
        "source": "T12n0321_002:0007a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　忘失一切佛功德、　　方便、智慧、頭陀行，　如是諸善悉不行，　　墮大阿鼻無有出。",
        "translation": "Forgetting all the Buddha's attributes, skillful means, wisdom, and the ascetic practices, they all fail to do such good deeds and fall into the great Abhidharma, from which there's no escape.",
        "source": "T12n0321_002:0007a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常談國城聚落中，　　官事、賊事、眷屬事，　如是晝夜恒思惟，　　未曾時暫行三昧。",
        "translation": "He always talks about the affairs of officials, thieves, and their retinues in the country's cities and villages, and he constantly reflects on them day and night like this, practicing samādhi for a while beforehand.",
        "source": "T12n0321_002:0007a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復於精舍起貪心，　　廣修院宇及房屋，　全無持誦及焚修，　　但為眷屬兼徒弟。",
        "translation": "Also, he becomes greedy in his monastery, extensively building a courtyard and a house, without any chanting or burning, but only for his retinue and disciples.",
        "source": "T12n0321_002:0007a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有苾芻依附我，　　我即與汝同居止；　若欲持戒奉律儀，　　非我所為須遠離。",
        "translation": "If a monk were to cling to me, I would live and stay with you; if you want to observe precepts and follow discipline, you must avoid what's not mine to do.",
        "source": "T12n0321_002:0007a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有臥具、床榻等、　　什物受用及飲食，　藏隱深房映蔽之，　　言：『無所有。』",
        "translation": "He hides his bedding, his bed and so forth, his necessities, his food and drink in a deep room, and conceals them, saying, 'I don't have any.'",
        "source": "T12n0321_002:0007a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令他去，　如是末世愚癡人，　　令佛教法不久滅。",
        "translation": "Letting others go, such foolish people in this late age will cause the Buddhist teachings to cease soon.",
        "source": "T12n0321_002:0007a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪求利養斷善根，　　此等苾芻極甚多，　若有清淨智慧者，　　遠離彼等住深山。",
        "translation": "There are so many such monks who crave gain and cut off their good roots, and if there's someone pure and wise, they'll stay far away from them and live deep in the mountains.",
        "source": "T12n0321_002:0007a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　末法苾芻無戒德，　　不樂深山寂靜居，　常處王城聚落中，　　唯務是非及鬪諍，　反為王法所禁制、　　叱訶、驅擯、受慚恥；　諸佛法教功德海，　　因此破戒悉枯竭。",
        "translation": "In later times, these ignorant monks lack the virtue of precepts, don't enjoy quiet abiding deep in the mountains, and often end up in the villages of royal cities, where they only pursue right and wrong and fight, but are instead restrained by the king's laws, reprimanded, expelled, and made to feel ashamed; thus, the ocean of merit of the Buddha's teaching of the Dharma is completely dried up by breaking the precepts.",
        "source": "T12n0321_002:0007a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如寶海水清淨，　　或被淤泥而渾濁；　亦如蓮花滿池開，　　或被狂風而摧壞；　如是末法破戒人，　　損減佛教亦如是。",
        "translation": "Like the pure water of a jeweled ocean that might be muddied and turbid, or a lotus blossom in full bloom in a pond that might be destroyed by a raging wind, so too will a person who breaks the precepts in these late times be undermined or diminished by Buddhism.",
        "source": "T12n0321_002:0007b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有淨修梵行者，　　逢斯惡友常遠離，　彼人命盡墮阿鼻，　　受苦百千無數劫。",
        "translation": "If someone who's purified and cultivated the religious practice meets such a bad friend and always turns away, that person's life will end and they'll fall into avīci, suffering a hundred thousand incalculable eons.",
        "source": "T12n0321_002:0007b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從此地獄受罪已，　　或生畜趣或為人，　貧窮、下賤及聾、啞、　　眇目、矬陋、多疾病、　手足諸根不完具，　　見者悉皆生驚怖。",
        "translation": "After suffering the sins of this hell, he'll be born in the animal or human rebirths, become poor, humble, deaf, dumb, blind, stumpy, sick, and whose hands and feet are not completely endowed with the faculties, and they'll all become frightened when they see them.",
        "source": "T12n0321_002:0007b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無信、無行、無善根，　　晝夜飢寒常憂苦，　復被眾人生瞋恨，　　以其瓦石而捶打。",
        "translation": "Without faith, without practice, and without good roots, they suffer from hunger and cold by day and night, and are angered by multitudes who beat them with tiles and stones.",
        "source": "T12n0321_002:0007b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是三苦常纏縛，　　一切罪業應遠離，　常須親近佛、法、僧，　　淨持戒律、頭陀行。",
        "translation": "Thus, bound by these three constant sufferings, they should be free of all wrong actions, always draw near to the Buddha, Dharma, and Saṃgha, and purify their moral discipline and ascetic practices.",
        "source": "T12n0321_002:0007b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是名利并眷屬，　　如幻、如化、如影像，　有為之法暫時間，　　不久乖離即散壞。",
        "translation": "Thus, fame and profit, along with their retinues, are illusory, miraculous, and image-like, and for a while the teachings of existents are transient, soon parting and disintegrating.",
        "source": "T12n0321_002:0007b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯有無上佛菩提，　　妙地十力波羅蜜，　堅固修習勿生疑，　　未來究竟大安樂。」",
        "translation": "Only unsurpassed buddhahood and enlightenment, the marvelous ten powers and perfections, are firmly cultivated without doubt, and the future is ultimately great and peaceful.\"",
        "source": "T12n0321_002:0007b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎爾時，世尊說此頌已，告尊者護國言：「若有補特伽羅於菩薩乘不依法行，有是過失者當得不依法者而來敬愛，懈怠者得懈怠人敬愛、無智者得無智人敬愛。",
        "translation": "After speaking this verse, the Bhagavān addressed Venerable Hōkoku, saying, \"If a person in the pudgala doesn't practice according to the principles of the bodhisattva vehicle and has this fault, he'll be honored by someone who doesn't follow the principles, and a lazy person will be honored by a lazy person, and an unwise person will be honored by an unwise person.",
        "source": "T12n0321_002:0007b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，互相敬愛、貪著利養、嫉妬貴族、懈怠狂亂、綺語兩舌、諂佞他人、虛誑父母及自師長。",
        "translation": "Thus, they love each other, cling to material gain, become jealous of noble people, become lazy and crazy, speak fancy and double-talk, flatter others, and lie to their parents and teachers.",
        "source": "T12n0321_002:0007b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或入王城及諸聚落，不為利益眾生化諸群品，一向妄言：『我是大智，多聞博識。』",
        "translation": "\"Perhaps they enter a king's city or a village, and instead of benefiting the many people and the various social classes, they say once and for all falsely, 'I'm greatly intelligent and well-versed.'",
        "source": "T12n0321_002:0007b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誑惑有情，唯求財利，輕棄善法都無所獲，猶如破器無堪貯用。",
        "translation": "They deceive sentient beings who seek only wealth and profit and despise good qualities that obtain nothing, like a broken vessel that's useless for storage.",
        "source": "T12n0321_002:0007b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼眾人多生怨惡，聽信邪言，虛妄推度，是法說非、非法說是，於佛正法無心愛樂。",
        "translation": "They often become hostile toward those people, listen to false speech, falsely impute, teach what's right and teach what's wrong, and have no intention of rejoicing in the Buddha's right teaching.",
        "source": "T12n0321_002:0007b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生於下族貧賤之家，為見少利來投佛法，希求出家及得為僧，行非梵行，於佛法教全無所成，何況大智？」",
        "translation": "Born into a poor family, they come to the Buddha's teaching because they see little profit, wish to leave home and become a monk, and engage in conduct that's not the religious practice, so they've accomplished nothing in the Buddha's teaching, let alone great wisdom.\"",
        "source": "T12n0321_002:0007b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告尊者：「如是補特伽羅不應說法。",
        "translation": "The Buddha told the Venerable, \"Such a person as Pudgala shouldn't preach.",
        "source": "T12n0321_002:0007c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人天之善尚不能續，何況菩提而得成就？」",
        "translation": "How could bodhi be accomplished when the goodness of humans and gods can't even be continued?\"",
        "source": "T12n0321_002:0007c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復告尊者護國言：「有八種補特伽羅遠離菩提，不得為說殊妙之法。」",
        "translation": "It was then that the Bhagavān again addressed Venerable Protectorate, \"There are eight kinds of personages who are so far removed from enlightenment that they can't teach the marvelous Dharma for them.\"",
        "source": "T12n0321_002:0007c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護國白言：「何等八種補特伽羅？",
        "translation": "Hoguk said, \"What are the eight kinds of pudgalas?",
        "source": "T12n0321_002:0007c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願說之。」",
        "translation": "Please let him teach it.\"",
        "source": "T12n0321_002:0007c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「一者、蔑戾車處於彼受生；二者、貧窮之家於彼受生；三者、下賤之家於彼受生；四者、縱得人身，醜陋、癡鈍；五者、具足蓋纏，身心憂慼；六者、棄背賢善、親近惡友；七者、長有疾病，身體尫羸；八者、眾苦逼迫，直至命終。",
        "translation": "The Buddha said, \"One, a man in a violent chariot is born there; two, a poor man's house is born there; three, a poor man's house is born there; four, even though he has attained a human body, he's ugly and dull; five, he's fully encumbered with hindrances and is sad in body and mind; six, he abandons goodness and becomes close to bad friends; seven, he has a long illness and is physically weak; eight, he's subject to numerous hardships until the end of his life.",
        "source": "T12n0321_002:0007c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是八種補特伽羅遠離菩提，不得說法。」",
        "translation": "Such are the eight ways in which a person in the religious community is removed from enlightenment and unable to preach.\"",
        "source": "T12n0321_002:0007c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是護國復白佛言：「不應說法更有何義？」",
        "translation": "Hoku then again said to the Buddha, \"What's the point of not teaching the Dharma?\"",
        "source": "T12n0321_002:0007c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「護國！",
        "translation": "The Buddha said, \"Protect the country!",
        "source": "T12n0321_002:0007c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有補特伽羅無決定者，我不說菩提；於虛妄者，我不說清淨行；於懈怠者，我不說菩薩行；於慳悋者，我不說供佛行；於我慢者，我不說波羅蜜清淨；於無慧者，我不說斷疑法；於嫉妬者，我不說心清淨；於無信根者，我不說總持法；於無德者，我不說善逝法；於貪親愛者，我不說身清淨；於不善律儀者，我不說謗佛有過失法；於妄言者，我不說語清淨；於我慢者，我不說恭敬法；於無識者，我不說修學法；於為身命者，我不說求於道法。",
        "translation": "若有補特伽羅無決定者，我不說菩提；於虛妄者，我不說清淨行；於懈怠者，我不說菩薩行；於慳悋者，我不說供佛行；於我慢者，我不說波羅蜜清淨；於無慧者，我不說斷疑法；於嫉妬者，我不說心清淨；於無信根者，我不說總持法；於無德者，我不說善逝法；於貪親愛者，我不說身清淨；於不善律儀者，我不說謗佛有過失法；於妄言者，我不說語清淨；於我慢者，我不說恭敬法；於無識者，我不說修學法；於為身命者，我不說求於道法。",
        "source": "T12n0321_002:0007c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是補特伽羅不應說法。」",
        "translation": "Thus, a person of the pudgala's lineage shouldn't preach.\"",
        "source": "T12n0321_002:0007c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時護國白言：「於意云何？」",
        "translation": "Guguo then said, \"What do you think?\"",
        "source": "T12n0321_002:0007c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「護國！",
        "translation": "The Buddha said, \"Protect the country!",
        "source": "T12n0321_002:0007c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為此有情愚癡迷惑、心識顛倒、虛妄分別、不依法教，乃至天上人間不應為說。」",
        "translation": "It's because these sentient beings are foolish, confused, have mistaken mental consciousnesses, falsely discriminate, and don't follow the teaching of the Dharma that they shouldn't be taught up in heaven or among humans.\"",
        "source": "T12n0321_002:0007c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說頌曰：「不定諸有情，　　補特伽羅等，　我慢自貢高，　　貪著於利養，　恒行不律儀，　　深著於五欲，　增長諸煩惱，　　遠離佛菩提。",
        "translation": "It was then that the Bhagavān spoke this verse, \"Indeterminate beings like the pudgala are conceited and arrogant, addicted to material gain, constantly behaving without restraint, deeply addicted to the five desires, which increase afflictions and distance themselves from the Buddha's enlightenment.",
        "source": "T12n0321_002:0007c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　退失於善法，　　懈怠不修習，　猶豫多散亂，　　於其戒法言，　而不生信受。",
        "translation": "They lose sight of the good Dharma, become lazy and undisciplined, hesitate and become disorganized, and don't give rise to faith in the teachings of those precepts.",
        "source": "T12n0321_002:0008a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　因為貧窮逼，　方便求出家，　　設得作苾芻，　輕捨於道法，　　如棄金寶擔，　荷負於麻擔。",
        "translation": "Because they're forced by poverty, they conveniently seek to leave home, even if they could become a monk, but they lightly abandon the path and teachings, like discarding a gold bag and carrying a hemp load.",
        "source": "T12n0321_002:0008a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雖欲入深山，　到彼寂靜處，　　無意樂修禪，　邪思而散亂，　　障礙於辯才，　沈沒大智慧，　　墜墮惡趣中。",
        "translation": "Even though I want to go deep into the mountains and reach their place of quiescence, I have no intention of cultivating meditation, my mistaken thoughts are distracted, my eloquence is hindered, and I sink into great wisdom and fall into a bad destiny.",
        "source": "T12n0321_002:0008a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設復得人身，　　醜陋不具足，　懈怠性愚癡，　　不行眾善法。",
        "translation": "Even if he were to attain personal possessions, he'd be ugly and incomplete, lazy and foolish, and unable to apply many good qualities.",
        "source": "T12n0321_002:0008a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸根常暗鈍，　　墮大嶮難中，　經彼俱胝劫，　　迷沒不解脫。",
        "translation": "Their faculties are always dull, they fall into great difficulty, and after many eons of delusion and confusion, they aren't liberated.",
        "source": "T12n0321_002:0008a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若行邪利濟，　　得證佛菩提，　調達不正知，　　應成善逝果。",
        "translation": "If someone practices wrong forms of relief, they'll realize buddha's enlightenment, and they'll attain the fruit of a good death after perfecting incorrect knowledge.",
        "source": "T12n0321_002:0008a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人貪利養，　　墜墮於眾生，　如空大風力，　　能墮諸飛鳥，　邪福勢盡時，　　其義亦如是。",
        "translation": "If someone craves profit and possessions and falls into the category of sentient beings, like the force of a great wind in the sky that can fall on flying birds, when the power of wrong merit is exhausted, this is likewise its meaning.",
        "source": "T12n0321_002:0008a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無信破戒者，　　見善如盲人，　譬如焚屍柴，　　不吉人嫌棄。",
        "translation": "A person who lacks faith and breaks the precepts sees goodness like a blind man, like wood for a corpse that burns, which is unlucky and disliked by others.",
        "source": "T12n0321_002:0008a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖復發善心，　　無彼廣大智，　謗法不信故，　　解脫非究竟。",
        "translation": "Even though they still arouse good intentions, they don't have that vast knowledge, and because they denigrate the Dharma and don't believe in it, their liberation isn't complete.",
        "source": "T12n0321_002:0008a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如畫無膠，　　莊嚴色不久，　我慢自貢高，　　其義亦如是。",
        "translation": "It's like painting a picture without plastic, adorned with a color that's not long in coming, and I'm conceited and proud of myself, for which the meaning is likewise.",
        "source": "T12n0321_002:0008a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若求佛菩提，　　不惜於身命，　於法甚深言，　　勇猛勤習學。",
        "translation": "If someone seeks buddhahood and enlightenment, they don't spare their life, and they diligently study the profound teachings.",
        "source": "T12n0321_002:0008a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨善行非法，　　所行增過失，　墮於大火坑。",
        "translation": "They abandon what's good and practice what's not, which increases their faults and leads them to fall into a great fiery pit.",
        "source": "T12n0321_002:0008b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若聞如是法，　依法而受行、　　斷除貪愛心、　修植眾德本，　　乃至於一句，　通達悉明了，　　如是積功德，　成就最上道，　　永離於愚盲。」",
        "translation": "If someone hears such a teaching, accepts and practices it in accordance with the teaching, stops craving, cultivates the roots of virtue, and fully comprehends even a single phrase, they'll accumulate merit in this way, achieve the supreme path, and forever escape from ignorance.\"",
        "source": "T12n0321_002:0008b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此頌已，告尊者護國言：「我於過去無量無邊不可說不可說阿僧祇劫，時有佛出世，號曰成義意如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "After speaking this verse, the Bhagavān addressed Venerable Hōkoku, saying, \"Back in the past, there was a Buddha who appeared in the world, who was called the Tathāgata Śrī Yaśas, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed, Trainer, Teacher of Gods and People, Buddha, and World Honored.",
        "source": "T12n0321_002:0008b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，有大國王名曰發光，主閻浮提，其地廣闊一萬六千由旬，其中州城數滿二萬。",
        "translation": "\"At the time, there was a great king named Bhāviveka, ruler of Jambudvīpa, whose land was 16,000 leagues wide and whose number of cities and states was 20,000.",
        "source": "T12n0321_002:0008b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其發光王所居城邑名曰寶光，其城東西長十二由旬，南北闊七由旬，城有七重七寶所作。",
        "translation": "The city where that king Radiant lived was called Jewel Light, and it was 12 leagues long from east to west and seven leagues wide from north to south, and it had seven layers of seven jewels built into it.",
        "source": "T12n0321_002:0008b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王善行八正之道，種族豪盛有千俱胝，其國人民壽十俱胝歲。",
        "translation": "The king well practices the eightfold correct path, his people are distinguished by a thousand koṭīs, and the people of his country live to be ten koṭīs long.",
        "source": "T12n0321_002:0008b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王有太子名曰福光，諸根具足，色相端嚴，殊妙第一。",
        "translation": "\"The king has a crown prince named Blessed Light, whose faculties are perfected and whose appearance is dignified and marvelous.",
        "source": "T12n0321_002:0008b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子生時，有千寶藏從地涌出——內有一藏現王殿前，滿中七寶，高七人量——復令一切眾生所作如意，乃至禁縛之者俱得解脫。",
        "translation": "When the prince is born, a thousand treasure treasures spring out of the ground - a single treasure house inside that appears in front of the king's palace, filled with seven treasures seven people high - and causes all sentient beings to do as they wish, even those who are bound to them to be freed.",
        "source": "T12n0321_002:0008b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又，彼大子生得七日，一切伎藝、工巧、算術皆悉明了，乃至世、出世間一切事業無不通解。",
        "translation": "Furthermore, when that great son is born for seven days, he fully understands all arts, crafts, and arithmetic, and he doesn't fail to comprehend all worldly and transmundane tasks.",
        "source": "T12n0321_002:0008b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於夜分中有淨光天子來為說法，告太子言：『福光諦聽！",
        "translation": "\"During the nighttime hours, a celestial of pure light comes to preach to the prince and tells him, 'Blessed be your radiance and listen closely!'",
        "source": "T12n0321_002:0008b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝須息心，不應散亂，於諸塵境常當遠離。",
        "translation": "'Calm your mind, don't be distracted, and always keep clear of the objective realm.",
        "source": "T12n0321_002:0008b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晝夜思惟有為之法，當觀無常、壽命盡時誰是救者，於諸非法而生怖畏。』",
        "translation": "Contemplate the things that exist day and night, observe impermanence and who will be the savior when your life span is up, and become fearful of the things that are not law.'",
        "source": "T12n0321_002:0008b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說護國尊者所問大乘經卷第二",
        "translation": "Foshuo huguo zunzhe suowen dasheng jing, vol. 2",
        "source": "T12n0321_002:0008b27_0",
        "is_bad_quality": false
    }
]