[
    {
        "source_sentence": "佛說大乘無量壽莊嚴經卷上",
        "translation": "Foshuo dasheng wuliangshou zhuangyan jing, vol. 1",
        "source": "T12n0363_001:0318a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試光祿卿",
        "translation": "Tripiṭaka of the Western Translation of the Sutra, Chaozan Dashi, and Guangluqing",
        "source": "T12n0363_001:0318a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao dashi ministers, Faxian, in accordance with the imperial edict, translated",
        "source": "T12n0363_001:0318a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在王舍城鷲峯山中，與大苾芻眾三萬二千人俱，皆得阿羅漢，具大神通。",
        "translation": "Thus I have heard: One time, the Buddha was in Vulture Peak in Rājagṛha with a large congregation of 32,000 people, all of whom had attained arhatship and possessed great supernormal powers.",
        "source": "T12n0363_001:0318a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰：尊者阿若憍陳如、尊者馬勝、尊者麼瑟比拏、尊者大名、尊者跋多婆、尊者稱天、尊者離垢、尊者妙臂、尊者布闌拏枳曩、尊者憍梵波提、尊者優樓頻螺迦葉、尊者那提迦葉、尊者舍利子、尊者大目乾連、尊者摩訶迦栴延、尊者摩訶俱絺羅、尊者劫賓那、尊者摩訶[利-禾+尊]那、尊者彌多羅尼子、尊者阿那律、尊者喜、尊者緊鼻哩拏、尊者須菩提、尊者哩嚩帝、尊者佉禰囉嚩儞枳曩、尊者摩賀囉倪、尊者波囉野尼枳曩、尊者嚩拘隷曩、尊者阿難陀、尊者羅睺羅、尊者善來，如是等三萬二千人俱。",
        "translation": "其名曰：尊者阿若憍陳如、尊者馬勝、尊者麼瑟比拏、尊者大名、尊者跋多婆、尊者稱天、尊者離垢、尊者妙臂、尊者布闌拏枳曩、尊者憍梵波提、尊者優樓頻螺迦葉、尊者那提迦葉、尊者舍利子、尊者大目乾連、尊者摩訶迦栴延、尊者摩訶俱絺羅、尊者劫賓那、尊者摩訶[利-禾+尊]那、尊者彌多羅尼子、尊者阿那律、尊者喜、尊者緊鼻哩拏、尊者須菩提、尊者哩嚩帝、尊者佉禰囉嚩儞枳曩、尊者摩賀囉倪、尊者波囉野尼枳曩、尊者嚩拘隷曩、尊者阿難陀、尊者羅睺羅、尊者善來，如是等三萬二千人俱。",
        "source": "T12n0363_001:0318a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，尊者阿難即從座起，偏袒右肩，右膝著地，合掌頂禮，白佛言：「世尊！",
        "translation": "Venerable Ānanda then rose from his seat, bared his right shoulder, knelt on his right knee, saluted with his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T12n0363_001:0318a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正等覺諸根清淨、面色圓滿、寶剎莊嚴，如是功德得未曾有。",
        "translation": "\"The Tathāgata, Worthy, and Completely Enlightened One has pure faculties, a perfectly proportioned countenance, and adorned jeweled bases, and such attributes have never been attained before.",
        "source": "T12n0363_001:0318a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何所行廣大妙行？",
        "translation": "How are these vast and marvelous activities carried out?",
        "source": "T12n0363_001:0318a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及過去、未來諸佛所行？",
        "translation": "and what have the buddhas of the past and future done?",
        "source": "T12n0363_001:0318a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為宣說。」",
        "translation": "Please explain it for us.\"",
        "source": "T12n0363_001:0318a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「善哉，善哉！",
        "translation": "The Buddha told Ānanda, \"Good, good!",
        "source": "T12n0363_001:0318a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝為利益一切眾生，懷慈愍心，能問如來微妙之義。",
        "translation": "With kindness and compassion for the benefit of all sentient beings, you were able to ask the Tathāgata about his subtle meaning.",
        "source": "T12n0363_001:0318a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今諦聽！",
        "translation": "Now, listen closely!",
        "source": "T12n0363_001:0318a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T12n0363_001:0318a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應供、正遍知今為汝說。」",
        "translation": "The Tathāgata, Worthy of Offerings, and Perfectly Enlightened One will now explain this for you.\"",
        "source": "T12n0363_001:0318a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「如過去無量無邊不可思議阿僧祇劫，爾時有佛世尊出現於世，名曰然燈如來、應、正等覺。",
        "translation": "The Buddha told Ānanda, \"It was a time in the past of measureless, unfathomable, and incalculable eons when a world-honored Buddha appeared in the world named Rājñāta Tathāgata, Worthy of Offerings, and Perfectly Enlightened.",
        "source": "T12n0363_001:0318a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼然燈佛前，復有世尊出現世間，名鉢囉多波野輸如來。",
        "translation": "Another world-honored one who appeared in the world before that Rāntō Buddha was called the Tathāgata Paranirmita-vaśavartin.",
        "source": "T12n0363_001:0318b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名發光如來。",
        "translation": "Another Buddha who appeared in the world before that Buddha was called the Radiant Tathāgata.",
        "source": "T12n0363_001:0318b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名贊那曩誐囉護如來。",
        "translation": "There's another Buddha who appears in the world named Tathāgata Ratnaguhārāhu.",
        "source": "T12n0363_001:0318b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名須彌劫如來。",
        "translation": "Another Buddha who appeared in the world was called Sumeru Kālāma Tathāgata.",
        "source": "T12n0363_001:0318b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名月面如來。",
        "translation": "Also, there's a Buddha who appears in the world named Moon-face Tathāgata.",
        "source": "T12n0363_001:0318b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名無垢面如來。",
        "translation": "Also, there's a Buddha who appears in the world named the Tathāgata with the Vimalakīrti Face.",
        "source": "T12n0363_001:0318b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名無著如來。",
        "translation": "There's another Buddha who arises in the world named the Tathāgata Without Attachment.",
        "source": "T12n0363_001:0318b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名龍主如來。",
        "translation": "There's another Buddha who arises in the world named Dragon Master Tathāgata.",
        "source": "T12n0363_001:0318b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名日面如來。",
        "translation": "There's another Buddha who arises in the world named Sun-Faced Tathāgata.",
        "source": "T12n0363_001:0318b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名山響音王如來。",
        "translation": "There's another Buddha who arises in the world named Tathāgata Mountain Sound King.",
        "source": "T12n0363_001:0318b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名須彌峯如來。",
        "translation": "There's another Buddha who appears in the world named Sumeru Peak Tathāgata.",
        "source": "T12n0363_001:0318b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名金藏如來。",
        "translation": "Also, there's a Buddha who appears in the world named Golden Store Tathāgata.",
        "source": "T12n0363_001:0318b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名火光如來。",
        "translation": "There's another Buddha who appears in the world named Firelight Tathāgata.",
        "source": "T12n0363_001:0318b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名不動地如來。",
        "translation": "There's another Buddha who arises in the world named Akṣobhya Tathāgata.",
        "source": "T12n0363_001:0318b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名瑠璃光如來。",
        "translation": "There's another Buddha who appears in the world called the Lapis Lazuli Tathāgata.",
        "source": "T12n0363_001:0318b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名月王如來。",
        "translation": "There's another Buddha who arises in the world named Moon King Tathāgata.",
        "source": "T12n0363_001:0318b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名日音如來。",
        "translation": "There's another Buddha who arises in the world named Sun-Sound Tathāgata.",
        "source": "T12n0363_001:0318b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名散華莊嚴如來。",
        "translation": "There's another Buddha who appears in the world named Scattered Flower Adornment Tathāgata.",
        "source": "T12n0363_001:0318b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名吉祥峯如來。",
        "translation": "There's also a Buddha who appears in the world named Auspicious Peak Tathāgata.",
        "source": "T12n0363_001:0318b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名持海慧自在通王如來。",
        "translation": "There's another Buddha who appears in the world named Tathāgata Holding Ocean Wisdom Freely Penetrating King.",
        "source": "T12n0363_001:0318b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名施光如來。",
        "translation": "There's also a Buddha who appears in the world named Tathāgata of Almsgiving Light.",
        "source": "T12n0363_001:0318b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名大香象光如來。",
        "translation": "There's another Buddha who appears in the world named Tathāgata of Great Fragrant Elephant Light.",
        "source": "T12n0363_001:0318b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名離一切垢如來。",
        "translation": "Also, there's a Buddha who appears in the world named Tathāgata Free From All Stain.",
        "source": "T12n0363_001:0318b21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名勇猛峯如來。",
        "translation": "There's another Buddha who arises in the world named Tathāgata of Courageous Prong.",
        "source": "T12n0363_001:0318b22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名寶光如來。",
        "translation": "There's another Buddha who arises in the world named Jewel Light Tathāgata.",
        "source": "T12n0363_001:0318b22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名持多德得通如來。",
        "translation": "There's another Buddha who appears in the world named Tathāgata Who Holds Much Virtue and Attains Supernormal Power.",
        "source": "T12n0363_001:0318b23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名過日月光如來。",
        "translation": "There's another Buddha who appears in the world named Tathāgata of Superlative Sun and Moon Light.",
        "source": "T12n0363_001:0318b24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名最上瑠璃光如來。",
        "translation": "There's another Buddha who arises in the world named Tathāgata of Supreme Lapis Light.",
        "source": "T12n0363_001:0318b25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名慧花開心行出生如來。",
        "translation": "There's another Buddha who arises in the world named Tathāgata Wish-Flower, Happy-Flowing, and Producing Tathāgata.",
        "source": "T12n0363_001:0318b26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名大華林通王如來。",
        "translation": "There's another Buddha who appears in the world named Tathāgata Flower Grove King of Access.",
        "source": "T12n0363_001:0318b27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名一月光如來。",
        "translation": "There's another Buddha who arises in the world named Tathāgata of the Light of the Single Moon.",
        "source": "T12n0363_001:0318b28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名破無明黑暗如來。",
        "translation": "Also, there's a Buddha who appears in the world named Tathāgata Who Refutes the Darkness of Ignorance.",
        "source": "T12n0363_001:0318b29_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名真珠珊瑚蓋如來。",
        "translation": "Also, there's a Buddha who appears in the world named Tathāgata Coral Canopy of True Jewels.",
        "source": "T12n0363_001:0318c01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名三乘法自在王如來。",
        "translation": "There's another Buddha who appears in the world named Tathāgata, the Dharma-universal King of the Three Vehicles.",
        "source": "T12n0363_001:0318c02_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名師子海峯自在王如來。",
        "translation": "There's another Buddha who arises in the world named Tathāgata Saṃbhavatī-rāja, the Self-arising King of the Shizi Sea.",
        "source": "T12n0363_001:0318c03_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名梵音聲自在王如來。",
        "translation": "There's another Buddha who arises in the world named Tathāgata, the Self-accomplishing King of the Sound of Brahmā.",
        "source": "T12n0363_001:0318c04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼佛前有佛出世，名世自在王如來、應、正等覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "Also, there was a Buddha who appeared in the world named Tathāgata, Completely Awakened One, Completely Awakened One, Well Gone, Understander of the World, Unsurpassed One, Trainer, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T12n0363_001:0318c05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而於法中，有一苾芻，名曰作法，信解第一、明記第一、修行第一、精進第一、智慧第一、大乘第一。",
        "translation": "Among those teachings, there's a monk named Zuofa who's the best in faith and understanding, the best in knowledge and understanding, the best in practice, the best in effort, the best in wisdom, and the best in the great vehicle.",
        "source": "T12n0363_001:0318c07_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，苾芻離自本處來詣佛前，頭面禮足，於一面立。",
        "translation": "The monk then left his original place, went to the Buddha, paid homage with his head and feet, and stood to one side.",
        "source": "T12n0363_001:0318c09_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以伽他嘆佛，面色端嚴；復發廣大誓願，頌曰：「『如來微妙色端嚴，　　一切世間無有等；　　光明無量照十方，　　日、月、火珠皆暱曜。",
        "translation": "He then praised the Buddha with his gata and praised his facial expression, and he made a great vow, saying, \"The Tathāgata's subtle form is endowed with dignity, which has no equal in the whole world; his light is immeasurable and shines in ten directions, and the sun, moon, and sparkling pearl are all brilliant.",
        "source": "T12n0363_001:0318c10_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　願我得佛清淨聲，　　法音普及無邊界，　　宣揚戒、定、精進門，　　通達甚深微妙法。",
        "translation": "May I attain the pure voice of the Buddha, whose Dharma voice spreads throughout the limitless realm, proclaiming the precepts, meditation, and method of effort, and penetrating the profound and subtle Dharma.",
        "source": "T12n0363_001:0318c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　智慧廣大深如海，　　內心清淨絕塵勞，　　超過無邊惡趣門，　　速到菩提究竟岸。",
        "translation": "My wisdom is vast and deep like the ocean, my inner mind is pure and free of worldly trouble, I transcend the gate of limitless bad destinies and quickly reach the final shore of enlightenment.",
        "source": "T12n0363_001:0318c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　亦如過去無量佛，　　威光普照眾生界，　　為彼群生大導師，　　度脫老死令安隱。",
        "translation": "They're like measureless buddhas of the past whose radiance universally illuminated the realm of sentient beings, serving as great mentors to those sentient beings, liberating them from old age and death, and making them comfortable.",
        "source": "T12n0363_001:0318c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　常行布施及戒、忍，　　精進、定、慧六波羅，　　未度有情令得度，　　已度之者使成佛。",
        "translation": "He always practices generosity, precepts, and forbearance, and he makes the six perfections of effort, concentration, and wisdom, so that sentient beings who have yet to be saved may be saved and those who have already been saved may become buddhas.",
        "source": "T12n0363_001:0318c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我以一切伸供養，　　百千俱胝那由他，　　恒河沙數佛世尊，　　令我成就寂滅果。",
        "translation": "With all my offerings, I've made hundreds of thousands of corpuscles and nayutas, and the world-honored buddhas of the Ganges River Sands have made me realize the fruit of extinction.",
        "source": "T12n0363_001:0318c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　復有十方諸佛剎，　　恒放光明照一切，　　殊勝莊嚴無等倫，　　願我成就利群品。",
        "translation": "\"Furthermore, there are buddha bases in ten directions that constantly radiate their light and shine universally, with unsurpassed splendor and adornment, so that I might achieve the qualities that benefit all people.",
        "source": "T12n0363_001:0318c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所有無邊世界中，　　輪迴諸趣眾生類，　　速生我剎受快樂，　　不久俱成無上道。",
        "translation": "Of all the sentient beings in the infinite worlds who are in transition, they'll quickly be born in my buddha's bases and experience happiness, and soon they'll all achieve the unsurpassed path.",
        "source": "T12n0363_001:0318c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　願我精進恒決定，　　常運慈心拔有情，　　度盡阿鼻苦眾生，　　所發弘誓永不斷。』」",
        "translation": "May my zeal be constant and determined, my compassionate mind uplifting sentient beings, my noble vow to end the suffering of sentient beings in Abhijit never ending.'\"",
        "source": "T12n0363_001:0318c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告阿難言：「彼作法苾芻說是偈已，白世自在王如來：『我今發阿耨多羅三藐三菩提心，樂求無上正等正覺。",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"After he spoke this verse, that religious practitioner said to the Tathāgata, the Freely Yourself King, 'Now, I have aroused the mind of unsurpassed, correct, and complete enlightenment, and I'm eager to pursue it.",
        "source": "T12n0363_001:0319a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，說諸佛剎功德莊嚴。",
        "translation": "May it please the Bhagavān to explain the merits and adornments of the buddha bases.",
        "source": "T12n0363_001:0319a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我得聞，恒自修持嚴土之行。』",
        "translation": "If I were to hear them, I would always cultivate the practice of adorning the land myself.'",
        "source": "T12n0363_001:0319a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世自在王如來告作法苾芻言：『汝自思惟，修何方便，而能成就佛剎莊嚴？』",
        "translation": "It was then that the World Honored King Tathāgata addressed the teaching monk, 'Consider for yourself, what method of cultivation can accomplish the adornment of the buddha bases?'",
        "source": "T12n0363_001:0319a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻白言：『我智慧微淺，不能了知嚴剎之行。",
        "translation": "The monk said, 'My wisdom is so shallow that I can't understand the conduct of the adorned bases.",
        "source": "T12n0363_001:0319a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正遍知，願為宣說諸佛剎土莊嚴之事。』",
        "translation": "Tathāgata, Worthy of Offerings, and Perfectly Omniscient, may you explain the adornment of the buddha bases.'",
        "source": "T12n0363_001:0319a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時世自在王如來，即為宣說八十四百千俱胝那由佛剎功德莊嚴廣大圓滿之相，經於一劫方可究竟。」",
        "translation": "The Tathāgata, the King of Worldly Ability, then declared for him the vast and complete semblance of 84,000 koṭīnayus of the Buddha's bases that are adorned with merits and can only be completed after one eon.\"",
        "source": "T12n0363_001:0319a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難聞是事已，白佛言：「世尊！",
        "translation": "After hearing this, Ānanda said to the Buddha, \"Bhagavān!",
        "source": "T12n0363_001:0319a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼世自在王佛壽量長短，云何說土經於一劫？」",
        "translation": "What is the length of life of that Lokêśvararāja Buddha, and how does he explain the land after one eon?\"",
        "source": "T12n0363_001:0319a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「彼佛壽命滿四十劫。",
        "translation": "The Buddha told Ānanda, \"That Buddha's life span is 40 eons.",
        "source": "T12n0363_001:0319a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0363_001:0319a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作法苾芻，聞佛所說八十四百千俱胝那由他佛剎功德莊嚴之事，明了通達如一佛剎。",
        "translation": "That religious monk who hears the Buddha's teaching about the 84,000 koṭīs of the merits and adornments of those buddhas clearly comprehends them as a single buddha-body.",
        "source": "T12n0363_001:0319a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時會中頭面禮足，辭佛而退。",
        "translation": "Immediately, he paid homage to the Buddha with his head and feet, excused himself, and withdrew.",
        "source": "T12n0363_001:0319a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往一靜處獨坐思惟，修習功德莊嚴佛剎，發大誓願經於五劫。",
        "translation": "He went to a quiet place, sat alone, contemplated, cultivated the merits of the Buddha's buddha temple, and made a great vow to pass through five eons.",
        "source": "T12n0363_001:0319a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時作法苾芻，復詣世自在王如來所；五體投地禮世尊足，禮已合掌，白佛言：『世尊！",
        "translation": "At that point, the monk who was cultivating the Dharma again went to the Tathāgata Śubhavyūha and bowed his five bodies at the feet of the Bhagavān, put his palms together after saluting him, and said to the Buddha, 'Bhagavān!",
        "source": "T12n0363_001:0319a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是八十四百千俱胝那由他佛剎，功德莊嚴所行行願，我今成就。』",
        "translation": "Thus, I've accomplished the vows of 84,000 koṭīnayutpāla buddhas and practices that adorn their virtues.'",
        "source": "T12n0363_001:0319a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時世自在王如來告苾芻言：『善哉，善哉！",
        "translation": "The World-Acquainted King Tathāgata then addressed the monk, saying, 'Good, good!",
        "source": "T12n0363_001:0319a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之行願思惟究竟，今正是時為眾解說。",
        "translation": "Now is the right time to explain your practice and vow to the people and contemplate its completion.",
        "source": "T12n0363_001:0319a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸菩薩，聞是法已得大善利，能於佛剎修習莊嚴。』",
        "translation": "The bodhisattvas who then hear this teaching will attain great good benefits and will be able to cultivate adornment at the buddha bases.'",
        "source": "T12n0363_001:0319a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，作法苾芻聞佛聖旨；偏袒右肩，右膝著地，合掌向佛即為宣說：『世尊！",
        "translation": "\"Hearing the Buddha's noble teaching, the religious monk bared his right shoulder, knelt on his right knee, put his palms together, and declared to the Buddha, 'Bhagavān!",
        "source": "T12n0363_001:0319a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我發誓言：願如世尊證得阿耨多羅三藐三菩提；所居佛剎，具足無量不可思議功德莊嚴。",
        "translation": "I vow: May the Bhagavān realize unsurpassed, correct enlightenment and live in a buddha-base replete with unfathomable merit and adornment.",
        "source": "T12n0363_001:0319a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有一切眾生，及焰摩羅界，三惡道中地獄、餓鬼、畜生，皆生我剎受我法化，不久悉成阿耨多羅三藐三菩提，一切皆得身真金色。",
        "translation": "All sentient beings and sentient beings in the Yamântara realm and in the hells, hungry ghosts, and animals of the three evil destinies will be born in my buddha-stage and accept my teaching, and soon they'll all achieve unsurpassed, correct enlightenment, and all will attain true gold bodies.",
        "source": "T12n0363_001:0319a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，十方世界所有眾生，令生我剎如諸佛土。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all the sentient beings in the world in the ten directions will be born in my banner as in the lands of the buddhas.",
        "source": "T12n0363_001:0319b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人天之眾，遠離分別諸根寂靜；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "All the people of humans and gods will be freed from discrimination and have their faculties quiescent, and they'll all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0319b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，十方世界所有眾生，令生我剎得大神通，經一念中，周遍巡歷百千俱胝那由他佛剎，供養諸佛深植善本；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain bodhi and become perfectly enlightened, all the sentient beings in the world in the ten directions will be born in my buddha and attain great supernormal powers, and in a single moment of thought, they'll travel around to one hundred thousand koṭīs of those buddhas and make offerings to the buddhas and plant good roots deep within them; they'll all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0319b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，一切皆得宿命通，能善觀察百千俱胝那由他劫過去之事；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be born in my banner, and they'll all attain the power of the knowledge of past lives and be able to skillfully examine the events of a hundred thousand koṭīs of those eons in the past; they'll all attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，一切皆得清淨天眼，能見百千俱胝那由他世界麁細色相；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be born in my banner, and they'll all attain the pure divine eye, which can see the crude and subtle forms of a hundred thousand koṭīs of the nayuta world; they'll all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0319b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，一切皆得他心通，善能了知百千俱胝那由他眾心心所法；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be born in my banner, and they'll all attain the ability to understand the minds and mental factors of hundreds of thousands of nayutas; they'll all attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，一切皆得住正信位，離顛倒想堅固修習；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be born in my banner, and they'll all be able to abide in the stage of correct faith, free of mistaken conceptions and resolute in their cultivation; they'll all attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，所修正行善根無量，遍圓寂界而無間斷；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain bodhi and become perfectly enlightened, all sentient beings will be allowed to be born in my banner, and the good roots of their correct practices will be limitless, pervading the sphere of perfect tranquility without interruption; they will all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0319b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，雖住聲聞緣覺之位，往百千俱胝那由他寶剎之內，遍作佛事；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, I will cause all sentient beings to be born in my buddha, even though they're staying at the rank of śrāvakas and pratyekbuddhas, and I'll go to one hundred thousand koṭīnayutas of precious buddhahood and perform Buddha-works everywhere; I'll cause them all to attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，一切皆得無邊光明，而能照曜百千俱胝那由他諸佛剎土；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be allowed to be born in my buddha's bases, and they'll all attain an infinite light that will shine in a hundred thousand corpuscles of those buddha-lands; they'll all attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，命不中夭，壽百千俱胝那由他劫；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be born in my banner, won't die in their lifetime, and will live a hundred thousand koṭīs of nayutas; they will all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0319c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，無不善名，聞無量無數諸佛剎土，無名、無號、無相、無形，無所稱讚，而無疑謗身心不動；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be allowed to be born in my buddha's bases, and none of them will be unkindly named and heard of measureless and countless buddha bases that have no name, no name, no form, and no shape, that have nothing to praise, and that are free from doubts and accusations that their bodies and minds are unmoving; they will all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0319c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生求生我剎，念吾名號發志誠心堅固不退，彼命終時，我令無數苾芻現前圍繞來迎彼人，經須臾間得生我剎；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all the sentient beings who seek to be born at my blaze and remember my name will become resolute and not retrogress, and when their lives end, I cause countless multitudes of my nuns to come around and welcome them, and in a moment's time they'll be born at my blaze; they'll all attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319c10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有十方無量無邊，無數世界一切眾生，聞吾名號發菩提心，種諸善根隨意求生，諸佛剎土無不得生；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all the sentient beings in measureless and limitless worlds in the ten directions who hear my name will arouse the aspiration for enlightenment, plant good roots, and seek birth as they wish, and none of the buddha-lands will be unborn; they will all attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319c14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，皆具三十二種大丈夫相；一生令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be born in my banner, each with the thirty-two characteristics of a great personage, and will attain supreme perfect enlightenment in their lifetime.",
        "source": "T12n0363_001:0319c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，若有大願未欲成佛為菩薩者，我以威力，令彼教化一切眾生，皆發信心，修菩提行、普賢行、寂滅行、淨梵行、最勝行，及一切善行；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I have attained enlightenment and become perfectly awakened, I will cause all sentient beings to be born in my banner, and if they have a great desire yet to become buddhas or bodhisattvas, I will use my authority to cause them to teach all sentient beings to have faith and cultivate the practices of enlightenment, the practice of Samantabhadra, the practice of tranquility, the pure and pure practices, the most excellent practices, and all good practices; they will all attain supreme, perfect enlightenment.",
        "source": "T12n0363_001:0319c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生令生我剎，於一切處承事供養無量百千俱胝那由他諸佛，種諸善根，隨意所求無不滿願；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all sentient beings will be allowed to be born in my buddha, serve and make offerings to measureless hundreds of thousands of nayutas in all places, plant good roots, and pursue whatever they want without unsatisfactory vows; they will all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0319c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0319c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我剎土中所有菩薩，皆得成就一切智慧，善談諸法祕要之義；不久速成阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all the bodhisattvas in my land will attain all wisdom and will skillfully discuss the esoteric meaning of all dharmas, and they will soon achieve supreme perfect enlightenment.",
        "source": "T12n0363_001:0319c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我居寶剎所有菩薩，發勇猛心運大神通，往無量無邊無數世界諸佛剎中，以真珠、瓔珞、寶蓋、幢幡、衣服、臥具、飲食、湯藥、香華、伎樂，供養承事迴求菩提；速得成就阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all the bodhisattvas at my jeweled buddha residence will summon the courageous resolve and great supernormal powers to go to those buddha buddhas in measureless, limitless, and incalculable worlds and make offerings with real pearls, jewelry, jeweled canopies, banners, clothing, bedding, food, medicine, flowers, and music to serve and seek enlightenment; they will quickly achieve supreme, perfect enlightenment.",
        "source": "T12n0363_001:0320a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我居寶剎所有菩薩，發大道心，欲以真珠、瓔珞、寶蓋、幢幡、衣服、臥具、飲食、湯藥、香華、伎樂，承事供養他方世界無量無邊諸佛世尊，而不能往，我於爾時以宿願力，令彼他方諸佛世尊，各舒手臂至我剎中受是供養；令彼速成阿耨多羅三藐三菩提。",
        "translation": "After I attained enlightenment and became perfectly awakened, all the bodhisattvas at my jeweled buddha residence had the great intention of making offerings to the measureless and limitless buddha-world honored ones in other worlds with genuine pearls, jewelry, jeweled canopies, banners, banners, clothing, bedding, food, medicine, flowers, and music, but they couldn't go there.",
        "source": "T12n0363_001:0320a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我居寶剎所有菩薩，隨自意樂不離此界，欲以真珠、瓔珞、寶蓋、幢幡、衣服、臥具、飲食、湯藥、香華、伎樂，供養他方無量諸佛。",
        "translation": "After I attained enlightenment and became perfectly awakened, all the bodhisattvas in my jeweled temple wanted to make offerings to measureless buddhas in other directions with genuine pearls, jewelry, jeweled canopies, banners, clothing, bedding, food, medicine, flowers, and music, according to their own wishes and intentions.",
        "source": "T12n0363_001:0320a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復思惟：「如佛展臂至此受供，劬勞諸佛令我無益。」",
        "translation": "Again, I thought, \"If the Buddha spreads his arms and comes here to accept offerings, I'd be thankful to the buddhas for making them us useless.\"",
        "source": "T12n0363_001:0320a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念時，我以神力，令此供具自至他方諸佛面前，一一供養。",
        "translation": "When I thought this, I used my supernormal powers to cause these offerings to come to the buddhas in other directions and make offerings to each one of them.",
        "source": "T12n0363_001:0320a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩，不久悉成阿耨多羅三藐三菩提。",
        "translation": "At that point, the bodhisattvas will soon all achieve supreme perfect enlightenment.",
        "source": "T12n0363_001:0320a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我居寶剎所有菩薩，身長十六由旬，得那羅延力，身相端嚴光明照曜，善根具足；成就阿耨多羅三藐三菩提。",
        "translation": "After I attained enlightenment and became perfectly enlightened, all the bodhisattvas at my jeweled temple had bodies 16 leagues long, attained the strength of a nārāyaṇa, had dignified bodies that shone brightly, and were replete with good roots; they had accomplished supreme perfect enlightenment.",
        "source": "T12n0363_001:0320a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我居寶剎所有菩薩，為諸眾生通達法藏，安立無邊一切智慧，斷盡諸結；悉得證成阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all the bodhisattvas in my jeweled buddha abode will penetrate the treasury of the Dharma for sentient beings, establish infinite and omnipresent wisdom, and end the bonds; they'll all realize supreme, perfect enlightenment.",
        "source": "T12n0363_001:0320a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我居寶剎所有菩薩，以百千俱胝那由他種種珍寶造作香爐，下從地際上至空界，常以無價栴檀之香，普薰供養十方諸佛；令得速成阿耨多羅三藐三菩提。",
        "translation": "After I attained enlightenment and became perfectly enlightened, all the bodhisattvas in my jeweled temple made scent burners from a hundred thousand cornelian nayutas of various treasures, from the ground up to the sky realm, and always perfumed them with the fragrance of priceless sandalwood to offer to the buddhas in the ten directions; that way, they would quickly achieve supreme perfect enlightenment.",
        "source": "T12n0363_001:0320a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所居佛剎廣博嚴淨光瑩如鏡，悉能照見無量無邊一切佛剎，眾生覩者生希有心；不久速成阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, the buddha-stele in which I live will be as vast, brilliant, and clear as a mirror, capable of illuminating measureless and limitless buddha-stelets, and the eyes of sentient beings will give rise to a sense of hope; they'll quickly achieve supreme, perfect enlightenment in the near future.",
        "source": "T12n0363_001:0320b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，我居寶剎所有菩薩，晝、夜六時恒受快樂，過於諸天，入平等總持門，身光普照無邊世界；不久得成阿耨多羅三藐三菩提。",
        "translation": "After I attain bodhi and become perfectly enlightened, all the bodhisattvas in my jeweled temple will experience constant happiness during the six hours of the day and night, surpassing the gods, entering the gate of the universal preserving of equality, and their bodies will shine universally in the infinite world; they'll soon achieve supreme perfect enlightenment.",
        "source": "T12n0363_001:0320b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有十方無量無邊無數世界一切女人，若有厭離女身者，聞我名號發清淨心歸依頂禮，彼人命終即生我剎成男子身；悉皆令得阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, if all the women in the numberless, limitless, and incalculable worlds in the ten directions who are disillusioned with the female body hear my name and summon up a pure heart, venerate them, and are born in my banner at the end of their lives and become men, they will all attain supreme perfect enlightenment.",
        "source": "T12n0363_001:0320b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有十方無量無邊無數佛剎聲聞、緣覺，聞我名號修持淨戒，堅固不退速坐道場；成就阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly enlightened, all the śrāvakas and pratyekbuddhas in the ten directions who hear my name cultivate pure morality, become resolute and nonretrogress, and quickly sit on the site of enlightenment; they accomplish unsurpassed, correct enlightenment.",
        "source": "T12n0363_001:0320b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有十方無量無邊不可思議無等佛剎一切菩薩，聞我名號五體投地禮拜歸命，復得天上人間一切有情，尊重恭敬親近侍奉增益功德；成就阿耨多羅三藐三菩提。",
        "translation": "After I attain enlightenment and become perfectly awakened, all the bodhisattvas in the unfathomable, unfathomable, and peerless buddha-temples in the ten directions who hear my name will bow down with their five bodies and venerate me, and all the sentient beings up in heaven and among humans will respect, venerate, and serve me intimately to enhance my virtue and achieve supreme, perfect enlightenment.",
        "source": "T12n0363_001:0320b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "\"'Bhagavān!",
        "source": "T12n0363_001:0320b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得菩提成正覺已，所有眾生發淨信心，為諸沙門、婆羅門，染衣、洗衣、裁衣、縫衣、修作僧服，或自手作或使人作，作已迴向；是人所感，八十一生得最上衣隨身豐足，於最後身來生我剎；成就阿耨多羅三藐三菩提。』",
        "translation": "After I attained enlightenment and became perfectly enlightened, all sentient beings aroused pure faith and dyed, washed, cut, sewed, and repaired monk's clothing for ascetics and priests, either by their own hands or by having it made by others, and returned to them after making it; this person was rewarded with 81 births in which they attained the highest garments with an abundance of possessions, and in their final body they were born in my buddha; they accomplished unsurpassed, correct enlightenment.'",
        "source": "T12n0363_001:0320b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說大乘無量壽莊嚴經卷上",
        "translation": "Foshuo dasheng wuliangshou zhuangyan jing, vol. 1",
        "source": "T12n0363_001:0320b26_0",
        "is_bad_quality": false
    }
]