[
    {
        "source_sentence": "勝鬘師子吼一乘大方便方廣經",
        "translation": "Śrīmālā Sūtra on the Great Skillful Means of the One Vehicle",
        "source": "T12n0353_001:0217a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋中印度三藏求那跋陀羅譯",
        "translation": "Song Translation of the Tripiṭaka of Central India, Kunabhadra",
        "source": "T12n0353_001:0217a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來真實義功德章第一",
        "translation": "Tathāgata's True Meaning: Chapter 1 on Merit",
        "source": "T12n0353_001:0217a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T12n0353_001:0217a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，波斯匿王及末利夫人信法未久，共相謂言：「勝鬘夫人是我之女，聰慧利根，通敏易悟，若見佛者必速解法，心得無疑。",
        "translation": "When King Prasenajit and Lady Mallik hadn't believed in the Dharma for a long time, they said to each other, \"Lady Śrīmālā is my daughter, a clever and intelligent woman with sharp faculties who's perceptive and easy to understand.",
        "source": "T12n0353_001:0217a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜時遣信，發其道意。」",
        "translation": "It's time to send her faith and arouse her intention for the path.\"",
        "source": "T12n0353_001:0217a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人白言：「今正是時。」",
        "translation": "The madam said, \"Now is the right time.\"",
        "source": "T12n0353_001:0217a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王及夫人與勝鬘書，略讚如來無量功德，即遣內人名旃提羅，使人奉書至阿踰闍國，入其宮內敬授勝鬘。",
        "translation": "The king and his wife gave Śrīmālā a book and praised the Tathāgata's immeasurable merits. They then sent a man named Candra to bring the book to Ayodhyā and enter his palace to present it to Śrīmālā.",
        "source": "T12n0353_001:0217a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘得書歡喜頂受，讀誦受持，生希有心，向旃提羅而說偈言：「我聞佛音聲，　　世所未曾有；　所言真實者，　　應當修供養。",
        "translation": "She joyfully accepted the book, read it, memorized it, memorized it, became rare, and spoke to Candra in verse, saying, \"I've heard the Buddha's voice like nothing else in the world, and I think I should cultivate offerings to those whose words are true.",
        "source": "T12n0353_001:0217a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仰惟佛世尊！",
        "translation": "I look up to the Bhagavān!",
        "source": "T12n0353_001:0217a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　普為世間出；　亦應垂哀愍，　　必令我得見。」",
        "translation": "\"He who universally produces for the world should also have compassion on us and surely allow me to see him.\"",
        "source": "T12n0353_001:0217a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即生此念時，　　佛於空中現；　普放淨光明，　　顯示無比身。",
        "translation": "When this thought arises, the Buddha appears in the sky, radiating a brilliant, pure light that reveals his peerless body.",
        "source": "T12n0353_001:0217a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勝鬘及眷屬，　　頭面接足禮；　咸以清淨心，　　歎佛實功德：「如來妙色身，　　世間無與等；　無比不思議，　　是故今敬禮。",
        "translation": "Śrīmālā and her retinue bowed with their heads and feet, and with pure hearts, they praised the Buddha's true merit, \"The Tathāgata's marvelously colored body is unequaled in the world; it's incomparable and inconceivable; therefore, I now venerate it.",
        "source": "T12n0353_001:0217a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來色無盡，　　智慧亦復然；　一切法常住，　　是故我歸依。",
        "translation": "The Tathāgata's form is inexhaustible, so is his wisdom; all dharmas are eternally abiding, so I take refuge in him.",
        "source": "T12n0353_001:0217a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　降伏心過惡，　　及與身四種，　已到難伏地，　　是故禮法王。",
        "translation": "He has subdued the mind's faults and the four physical types, and has reached the stage of difficult submission; therefore, he venerates the king of the Dharma.",
        "source": "T12n0353_001:0217a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知一切爾焰，　　智慧身自在，　攝持一切法，　　是故今敬禮。",
        "translation": "He knows all the irises, has mastery over the body of wisdom, and maintains all dharmas; therefore, he venerates them now.",
        "source": "T12n0353_001:0217b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　敬禮過稱量，　　敬禮無譬類，　敬禮無邊法，　　敬禮難思議。",
        "translation": "I venerate those beyond measure, those without analogy, those without limit, and those whose rewards are unfathomable.",
        "source": "T12n0353_001:0217b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　哀愍覆護我，　　令法種增長；　此世及後生，　　願佛常攝受。」",
        "translation": "Pity covers me and causes the seed of the Dharma to grow, and may the Buddha always take me in in this world and in future lives.\"",
        "source": "T12n0353_001:0217b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我久安立汝，　　前世已開覺；　今復攝受汝，　　未來生亦然。」",
        "translation": "\"I long ago established you, having been enlightened in a previous life, and I'll take you in now, and so will I be in future lives.\"",
        "source": "T12n0353_001:0217b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我已作功德，　　現在及餘世；　如是眾善本，　　唯願見攝受。」",
        "translation": "\"I've already made merits, both in the present and in other lives, such as these many good roots, that I wish to see and receive.\"",
        "source": "T12n0353_001:0217b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，勝鬘及諸眷屬，頭面禮佛，佛於眾中即為受記：「汝歎如來真實功德，以此善根，當於無量阿僧祇劫天人之中為自在王，一切生處常得見我，現前讚歎如今無異。",
        "translation": "At that point, Śrīmālā and her retinue bowed their heads to the Buddha, and the Buddha gave them this assurance: \"You praise the true merits of the Tathāgata, and because of these good roots, you will become a sovereign king among gods and humans for measureless incalculably long eons, always seeing me in all places of birth, and praising me now is no different from what I've done.",
        "source": "T12n0353_001:0217b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當復供養無量阿僧祇佛，過二萬阿僧祇劫當得作佛，號普光如來、應、正遍知。",
        "translation": "I'll also make offerings to measureless incalculable buddhas, and after 20,000 incalculable eons I'll become a buddha called the Tathāgata of Universal Light, Worthy of Offerings, and Perfectly Omniscient.",
        "source": "T12n0353_001:0217b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛國土，無諸惡趣、老病衰惱不適意苦，亦無不善惡業道名；彼國眾生色力壽命、五欲眾具，皆悉快樂，勝於他化自在諸天；彼諸眾生純一大乘，諸有修習善根眾生皆集於彼。」",
        "translation": "In that Buddha's land, there are no bad destinies, old age, illness, decay, discomfort, or discomfort, and there's no reputation for unwholesome or bad karmic paths; the sentient beings there are all happy in form, strength, and longevity, and they have all the five desires and implements, which are superior to those in the paranirmita-vaipulya heavens; their sentient beings are purely unitary in the great vehicle, and sentient beings who cultivate good roots all gather there.\"",
        "source": "T12n0353_001:0217b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘夫人得受記時，無量眾生、諸天及人願生彼國，世尊悉記皆當往生。",
        "translation": "When Lady Śrīmālā received assurance of ordination, measureless sentient beings, gods, and humans who wished to be born in that country were memorized by the Bhagavān as deserving of rebirth there.",
        "source": "T12n0353_001:0217b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十受章第二",
        "translation": "Ten Understandings, Chapter 2",
        "source": "T12n0353_001:0217b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，勝鬘聞受記已，恭敬而立受十大受：「世尊！",
        "translation": "After hearing about the prediction, Śrīmālā then respectfully stood up and accepted the ten major predictions, \"Bhagavān!",
        "source": "T12n0353_001:0217b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，於所受戒不起犯心。",
        "translation": "From this day until I attain enlightenment, I won't think of violating the precepts I've received.",
        "source": "T12n0353_001:0217b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，於諸尊長不起慢心。",
        "translation": "From this day until my enlightenment, I won't become proud of the venerables.",
        "source": "T12n0353_001:0217b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，於諸眾生不起恚心。",
        "translation": "From today until I attain enlightenment, I won't become hostile toward sentient beings.",
        "source": "T12n0353_001:0217b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，於他身色及外眾具不起疾心。",
        "translation": "From today until I attain enlightenment, I won't become critical of the physical appearance of others or their external requisites.",
        "source": "T12n0353_001:0217b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，於內外法不起慳心。",
        "translation": "From this day until I attain enlightenment, I won't be stingy with internal or external things.",
        "source": "T12n0353_001:0217c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，不自為己受畜財物，凡有所受悉為成熟貧苦眾生。",
        "translation": "From this day until I attain enlightenment, I won't accept wealth or property for myself; whatever I accept will be for the benefit of poor sentient beings.",
        "source": "T12n0353_001:0217c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，不自為己行四攝法，為一切眾生故，以不愛染心、無厭足心、無罣礙心，攝受眾生。",
        "translation": "From today until I attain enlightenment, I won't practice the four methods of collecting sentient beings for myself, but I will collect sentient beings for the sake of all sentient beings with a mind that's not tainted, a mind that's not weary, and a mind that's not obstructed.",
        "source": "T12n0353_001:0217c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217c06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，若見孤獨幽繫疾病，種種厄難困苦眾生，終不暫捨，必欲安隱，以義饒益令脫眾苦，然後乃捨。",
        "translation": "From today until I attain enlightenment, if I see orphaned, isolated, or sick people in various kinds of trouble and distress, I'll never abandon them for a moment; I'll want to be comfortable and free them from suffering with meaningful benefits, and then I'll abandon them.",
        "source": "T12n0353_001:0217c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，若見捕養眾惡律儀及諸犯戒終不棄捨。",
        "translation": "From this day until I attain enlightenment, if I see many bad forms of discipline and violations of the precepts, I'll never abandon them.",
        "source": "T12n0353_001:0217c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得力時，於彼彼處見此眾生，應折伏者而折伏之；應攝受者而攝受之。",
        "translation": "When I attain power, I'll see this sentient being in another place and subdue him or her, and I'll take him or her in when he or she deserves it.",
        "source": "T12n0353_001:0217c11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0217c12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以折伏、攝受故令法久住。",
        "translation": "It's because they are subdued and collected that the teaching will last a long time.",
        "source": "T12n0353_001:0217c13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法久住者，天人充滿，惡道減少，能於如來所轉法輪而得隨轉，見是利故救攝不捨。",
        "translation": "When the Dharma is long-lasting, gods and humans will be filled, and bad destinies will be diminished, and they'll be able to follow the Tathāgata's turning of the Dharma wheel, and seeing this benefit, they'll be rescued and not abandoned.",
        "source": "T12n0353_001:0217c13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0217c15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日乃至菩提，攝受正法終不忘失。",
        "translation": "From today until I attain enlightenment, I'll gather in the right teaching and never lose it.",
        "source": "T12n0353_001:0217c15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0217c16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忘失法者則忘大乘，忘大乘者則忘波羅蜜，忘波羅蜜者則不欲大乘。",
        "translation": "When they forget the Dharma, they forget the great vehicle, and when they forget the great vehicle, they forget the perfection, and when they forget the perfection, they don't want the great vehicle.",
        "source": "T12n0353_001:0217c17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩不決定大乘者，則不能得攝受正法欲，隨所樂入，永不堪任越凡夫地。",
        "translation": "If a bodhisattva isn't certain about the great vehicle, then he won't be able to gather the desire for the right Dharma, enter it as he pleases, and never transcend the level of the unenlightened worldling.",
        "source": "T12n0353_001:0217c18_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見如是無量大過，又見未來攝受正法菩薩摩訶薩無量福利，故受此大受。",
        "translation": "Seeing such measureless great faults, and seeing the measureless welfare of future bodhisattvas and mahāsattvas who will take in the right teaching, I've accepted this great acceptance.",
        "source": "T12n0353_001:0217c20_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「法主世尊！",
        "translation": "\"Bhagavān, lord of the Dharma!",
        "source": "T12n0353_001:0217c22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現為我證，唯佛世尊現前證知。",
        "translation": "\"I now realize that the Bhagavān alone knows it beforehand.",
        "source": "T12n0353_001:0217c22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而諸眾生善根微薄或起疑網，以十大受極難度故；彼或長夜非義饒益，不得安樂。",
        "translation": "However, because the good roots of sentient beings are weak or they may raise a web of doubt, and because the ten great sensations are extremely difficult to cross over, or because they spend long nights being unjustly benefited, they can't attain well-being.",
        "source": "T12n0353_001:0217c23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為安彼故，今於佛前說誠實誓。",
        "translation": "To reassure them, I now tell them before the Buddha of my true vow.",
        "source": "T12n0353_001:0217c25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我受此十大受，如說行者，以此誓故，於大眾中當雨天花，出天妙音。」",
        "translation": "'I will accept these ten major feelings as I've described them in practice, and because of this vow, I will rain smallpox and produce a marvelous divine voice in the midst of the masses.'\"",
        "source": "T12n0353_001:0217c26_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，於虛空中，雨眾天花出妙聲言：「如是如是！",
        "translation": "When he spoke these words, numerous puffballs rained down in the sky, producing a marvelous sound that said, \"So it is, so it is!",
        "source": "T12n0353_001:0217c28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說，真實無異。」",
        "translation": "As you say, there's really no difference.\"",
        "source": "T12n0353_001:0217c29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見妙花及聞音聲，一切眾會疑惑悉除，喜踊無量而發願言：「恒與勝鬘常共俱會，同其所行。」",
        "translation": "Seeing the marvelous flowers and hearing the sounds, they removed all doubts and confusions from the entire assembly, rejoiced and roused measurelessly, and vowed, \"Always meet with the Śrīmālā always together, sharing the same practices.\"",
        "source": "T12n0353_001:0217c29_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊悉記一切大眾如其所願。",
        "translation": "The Bhagavān then fully remembers that all the people did as he had wished.",
        "source": "T12n0353_001:0218a03_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三願章第三",
        "translation": "The Third Chapter of the Three Vows",
        "source": "T12n0353_001:0218a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時勝鬘復於佛前發三大願，而作是言：「以此實願安隱無量無邊眾生，以此善根於一切生得正法智，是名第一大願。",
        "translation": "Śrīmālā then again made three great vows before the Buddha and said, \"This is the first great vow, which is to secure measureless and limitless sentient beings with this true vow and to attain knowledge of the true teaching for all sentient beings with these good roots.",
        "source": "T12n0353_001:0218a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得正法智已，以無厭心為眾生說，是名第二大願。",
        "translation": "After I attain knowledge of the right teaching, I'll explain it to sentient beings with an untiring mind, which is called the second great vow.",
        "source": "T12n0353_001:0218a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於攝受正法，捨身、命、財，護持正法，是名第三大願。」",
        "translation": "When I gather in the true teaching, I give up my body, life, and possessions to safeguard the true teaching, which is called the third great vow.\"",
        "source": "T12n0353_001:0218a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即記勝鬘三大誓願，如一切色悉入空界。",
        "translation": "At that point, the Bhagavān then recorded the Śrīmālā's three great vows, which are to enter the realm of emptiness like all forms.",
        "source": "T12n0353_001:0218a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩恒沙諸願，皆悉入此三大願中，此三願者真實廣大。",
        "translation": "Thus, the bodhisattvas' myriad vows all enter into these three great vows, which are truly vast.",
        "source": "T12n0353_001:0218a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受章第四",
        "translation": "The Fourth Chapter of the Compendium of the Great Vows",
        "source": "T12n0353_001:0218a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，勝鬘白佛言：「我今當復承佛威神，說調伏大願真實無異。」",
        "translation": "It was then that Śrīmālā said to the Buddha, \"Now, I will again accept the Buddha's authority and tell you that the great vow to tame people is true and not different.\"",
        "source": "T12n0353_001:0218a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告勝鬘：「恣聽汝說。」",
        "translation": "The Buddha told Śrīmālā, \"Listen freely to what you say.\"",
        "source": "T12n0353_001:0218a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘白佛：「菩薩所有恒沙諸願，一切皆入一大願中，所謂攝受正法。",
        "translation": "Śrīmālā said to the Buddha, \"All of the bodhisattvas' vows that are numerous and limitless all enter into the one great vow, which is called gathering in the right dharma.",
        "source": "T12n0353_001:0218a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法，真為大願。」",
        "translation": "To collect the right dharma is really a great vow.\"",
        "source": "T12n0353_001:0218a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛讚勝鬘：「善哉善哉！",
        "translation": "The Buddha praised Śrīmālā, \"Good, good!",
        "source": "T12n0353_001:0218a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧方便甚深微妙，汝已長夜殖諸善本，來世眾生久種善根者，乃能解汝所說。",
        "translation": "\"The depth and subtlety of your wisdom and skillful means are such that you've cultivated good roots over the long haul, and sentient beings in the future will be able to understand what you've taught when they've long planted good roots.",
        "source": "T12n0353_001:0218a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之所說攝受正法，皆是過去、未來、現在諸佛已說、今說、當說。",
        "translation": "What you've taught about the right Dharma of taking in are all things that have been taught, are being taught, and will be taught by the buddhas of the past, future, and present.",
        "source": "T12n0353_001:0218a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今得無上菩提，亦常說此攝受正法，如是我說：『攝受正法所有功德不得邊際，如來智慧辯才亦無邊際。",
        "translation": "Now that I've attained unsurpassed enlightenment, I'll always explain this right method of taking in, and thus I'll say, 'The merits of taking in the right method cannot be limited, nor can the Tathāgata's wisdom and eloquence be limited.'",
        "source": "T12n0353_001:0218a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0218a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是攝受正法有大功德有大利益。』」",
        "translation": "This is great merit and great benefit that comes from taking in the right teaching.'\"",
        "source": "T12n0353_001:0218a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘白佛：「我當承佛神力，更復演說攝受正法廣大之義。」",
        "translation": "Śrīmālā said to the Buddha, \"I will accept the Buddha's spiritual power and explain again the vast meaning of taking in the true teaching.\"",
        "source": "T12n0353_001:0218a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「便說。」",
        "translation": "The Buddha said, \"Go ahead and explain it.\"",
        "source": "T12n0353_001:0218a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘白佛：「攝受正法廣大義者，則是無量，得一切佛法，攝八萬四千法門。",
        "translation": "Śrīmālā said to the Buddha, \"The meaning of gathering in the vast expanse of the right Dharma is immeasurable, attaining all the Buddha's teachings and gathering in 84,000 Dharma entries.",
        "source": "T12n0353_001:0218a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如劫初成時，普興大雲，雨眾色雨及種種寶。",
        "translation": "It's like when an eon first forms and a great cloud rises everywhere, raining down colors and various treasures.",
        "source": "T12n0353_001:0218a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是攝受正法，雨無量福報及無量善根之雨。",
        "translation": "Thus taking in the right teaching rains down measureless rewards of merit and measureless rains of good roots.",
        "source": "T12n0353_001:0218b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0218b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如劫初成時，有大水聚，出生三千大千界藏及四百億種種類洲。",
        "translation": "\"It's also like the first time an eon is formed, when there's a great heap of water that gives rise to a collection of 3,000 great thousand worlds and 40 billion continents of various kinds.",
        "source": "T12n0353_001:0218b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是攝受正法，出生大乘無量界藏：一切菩薩神通之力；一切世間安隱快樂；一切世間如意自在；及出世間安樂劫成，乃至天人本所未得，皆於中出。",
        "translation": "Thus, when the right Dharma is collected, there arises an immeasurable store of elements in the great vehicle: all the bodhisattvas' supernormal powers, all the world's peace and happiness, all the world's wishful mastery, and the kalpas of supramundane well-being, even those previously unobtained by gods and humans, all emerge from them.",
        "source": "T12n0353_001:0218b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如大地持四重擔。",
        "translation": "\"They're also like the great earth carrying four heavy burdens.",
        "source": "T12n0353_001:0218b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0353_001:0218b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者大海，二者諸山，三者草木，四者眾生。",
        "translation": "There's the ocean, the mountains, the trees, and the living beings.",
        "source": "T12n0353_001:0218b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是攝受正法善男子善女人，建立大地，堪能荷負四種重任，喻彼大地。",
        "translation": "Thus, a good man or woman who takes in the right teaching establishes an earth that's capable of carrying four kinds of heavy burdens, which are likened to that earth.",
        "source": "T12n0353_001:0218b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0353_001:0218b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂離善知識、無聞非法眾生，以人天善根而成熟之；求聲聞者授聲聞乘；求緣覺者授緣覺乘；求大乘者授以大乘。",
        "translation": "They are those who part with good friends, unheard, and unlawful sentient beings, ripening them with the good roots of humans and gods, teaching the śrāvaka vehicle to those who seek the śrāvaka, the pratyekabuddha vehicle to those who seek the pratyekabuddha, and the great vehicle to those who seek the great vehicle.",
        "source": "T12n0353_001:0218b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名攝受正法善男子善女人建立大地，堪能荷負四種重任。",
        "translation": "These are called good men and good women who gather in the right teaching and build a great earth that's capable of shouldering four kinds of heavy burdens.",
        "source": "T12n0353_001:0218b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0218b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是攝受正法善男子善女人建立大地，堪能荷負四種重任，普為眾生作不請之友，大悲安慰哀愍眾生，為世法母。",
        "translation": "Such a good man or woman who takes in the right teaching establishes an earth that's capable of shouldering four kinds of heavy burdens, serves sentient beings as an unrequested friend, has great compassion and sympathy for sentient beings, and is the Dharma mother of the world.",
        "source": "T12n0353_001:0218b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如大地有四種寶藏。",
        "translation": "\"Also, as the great earth has four kinds of treasures, what are the four?",
        "source": "T12n0353_001:0218b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0353_001:0218b19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者無價，二者上價，三者中價，四者下價，是名大地四種寶藏。",
        "translation": "The one that's priceless, the other that's of high value, the third that's of medium value, and the fourth that's of low value are called the four kinds of treasures of the great earth.",
        "source": "T12n0353_001:0218b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是攝受正法善男子善女人建立大地，得眾生四種最上大寶。",
        "translation": "Thus, a good man or woman who takes in the right teaching and builds the great earth will attain four kinds of the greatest treasures for sentient beings.",
        "source": "T12n0353_001:0218b20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0353_001:0218b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法善男子善女人，無聞非法眾生，以人天功德善根而授與之；求聲聞者授聲聞乘；求緣覺者授緣覺乘；求大乘者授以大乘。",
        "translation": "\"Good men and good women who collect the right teaching and unheard and unenlightened sentient beings are given the good roots of human and divine merit; those who seek the śrāvaka are given the śrāvaka vehicle; those who seek the pratyekabuddha are given the pratyekabuddha vehicle; and those who seek the great vehicle are given the great vehicle.",
        "source": "T12n0353_001:0218b22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是得大寶眾生，皆由攝受正法善男子善女人得此奇特希有功德。",
        "translation": "Thus, they all attain the great treasures of sentient beings because they are good men and good women who have collected the right teaching and attained this extraordinary and rare merit.",
        "source": "T12n0353_001:0218b25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0218b27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大寶藏者，即是攝受正法。",
        "translation": "\"The great treasury is that which gathers in the true teaching.",
        "source": "T12n0353_001:0218b27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0218b28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法，攝受正法者，無異正法，無異攝受正法，正法即是攝受正法。",
        "translation": "He who takes in the right teaching and takes in the right teaching is no different from the right teaching, no different from taking in the right teaching, and the right teaching is taking in the right teaching.",
        "source": "T12n0353_001:0218b28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0218c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無異波羅蜜，無異攝受正法，攝受正法即是波羅蜜。",
        "translation": "There's no difference between the perfection and taking in the right teaching, and taking in the right teaching is the perfection.",
        "source": "T12n0353_001:0218c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0218c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法善男子善女人，應以施成熟者以施成熟，乃至捨身支節將護彼意而成熟之。",
        "translation": "\"Good men and good women who take in the right teaching should ripen it with gifts, even to the point of sacrificing the limbs of their bodies and ripening their minds by guarding them.",
        "source": "T12n0353_001:0218c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所成熟眾生建立正法，是名檀波羅蜜。",
        "translation": "That ripening of sentient beings to establish the right teaching is called the perfection of giving.",
        "source": "T12n0353_001:0218c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「應以戒成熟者，以守護六根，淨身口意業，乃至正四威儀，將護彼意而成熟之。",
        "translation": "\"Those who mature with precepts should mature them by guarding the six faculties, purifying physical, verbal, and mental actions, and even correcting the four comportments, which will protect their minds and mature them.",
        "source": "T12n0353_001:0218c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所成熟眾生建立正法，是名尸波羅蜜。",
        "translation": "Ripening sentient beings for them to establish the right dharma is called the perfection of morality.",
        "source": "T12n0353_001:0218c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「應以忍成熟者，若彼眾生罵詈、毀辱、誹謗、恐怖，以無恚心、饒益心，第一忍力乃至顏色無變，將護彼意而成熟之。",
        "translation": "\"Those who should be ripened by forbearance will guard their intentions and ripen them with a mind that's without anger, a mind that's beneficial, and the first power of forbearance, even when their color doesn't change, if they ridicule, disparage, slander, and terrorize sentient beings.",
        "source": "T12n0353_001:0218c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所成熟眾生建立正法，是名羼提波羅蜜。",
        "translation": "That maturing of sentient beings to establish the right Dharma is called the perfection of kṣatriya.",
        "source": "T12n0353_001:0218c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「應以精進成熟者，於彼眾生不起懈心，生大欲心第一精進，乃至若四威儀，將護彼意而成熟之。",
        "translation": "\"Someone who matures sentient beings with effort won't become lazy, and they'll produce the first effort with great desire, even if it's the four comportments, which will guard their intentions and mature them.",
        "source": "T12n0353_001:0218c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所成熟眾生建立正法，是名毘梨耶波羅蜜。",
        "translation": "Ripening those sentient beings to establish the right teaching is called the perfection of vīrya.",
        "source": "T12n0353_001:0218c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「應以禪成熟者，於彼眾生以不亂心、不外向心，第一正念乃至久時所作、久時所說終不忘失，將護彼意而成熟之。",
        "translation": "\"Someone who matures sentient beings with meditation will guard their intentions and mature them with a mind that's not distracted, a mind that's not directed outward, and the first right mindfulness, even when what's done and what's been said for a long time is never forgotten.",
        "source": "T12n0353_001:0218c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所成熟眾生建立正法，是名禪波羅蜜。",
        "translation": "That maturing of sentient beings who establish the right teaching is called the perfection of meditation.",
        "source": "T12n0353_001:0218c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「應以智慧成熟者，彼諸眾生問一切義，以無畏心而為演說，一切論、一切工巧，究竟明處，乃至種種工巧諸事，將護彼意而成熟之。",
        "translation": "\"Those [sentient beings] who should be ripened by wisdom will be defended and their minds ripened by those sentient beings who ask about all doctrines, speak fearlessly about them, and explain all the treatises, all the techniques, the ultimate place of knowledge, and various skillful things.",
        "source": "T12n0353_001:0218c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所成熟眾生建立正法，是名般若波羅蜜。",
        "translation": "That maturing of sentient beings to establish the right teaching is called prajñā-pāramitā.",
        "source": "T12n0353_001:0218c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故世尊！",
        "translation": "\"Therefore, Bhagavān!",
        "source": "T12n0353_001:0218c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無異波羅蜜，無異攝受正法，攝受正法即是波羅蜜。",
        "translation": "There's no difference between the perfection and taking in the right teaching, and taking in the right teaching is the perfection.",
        "source": "T12n0353_001:0218c23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0218c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今承佛威神，更說大義。」",
        "translation": "Now, in response to the Buddha's authoritative power, I'll explain the great meaning.\"",
        "source": "T12n0353_001:0218c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「便說。」",
        "translation": "The Buddha said, \"Go ahead and explain it.\"",
        "source": "T12n0353_001:0218c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘白佛：「攝受正法攝受正法者，無異攝受正法，無異攝受正法者。",
        "translation": "Śrīmālā said to the Buddha, \"He who takes in the right Dharma and takes in the right Dharma is no different from someone who takes in the right Dharma, and there's no difference between someone who takes in the right Dharma and someone who takes in the right Dharma.",
        "source": "T12n0353_001:0218c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法善男子善女人，即是攝受正法。",
        "translation": "A good man and good woman who collect the right Dharma are those who collect the right Dharma.",
        "source": "T12n0353_001:0218c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0218c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若攝受正法善男子善女人，為攝受正法，捨三種分。",
        "translation": "\"If good men and good women take in the right teaching, they abandon three parts of it in order to take in the right teaching.",
        "source": "T12n0353_001:0218c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T12n0353_001:0219a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：身、命、財。",
        "translation": "\"This refers to body, life, and possessions.",
        "source": "T12n0353_001:0219a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子善女人捨身者，生死後際等，離老病死，得不壞常住、無有變易、不可思議功德如來法身。",
        "translation": "Good sons and good women who abandon the body, including after birth and death, become free of old age, illness, and death, and attain the Tathāgata's Dharma body, which is indestructible, eternal, unchanging, and of inconceivable merit.",
        "source": "T12n0353_001:0219a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨命者，生死後際等，畢竟離死，得無邊常住不可思議功德，通達一切甚深佛法。",
        "translation": "Those who renounce life will eventually part with death, including after birth and death, and attain limitless, eternal, inconceivable virtue and comprehension of all profound Buddha qualities.",
        "source": "T12n0353_001:0219a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨財者，生死後際等，得不共一切眾生、無盡無減、畢竟常住、不可思議具足功德，得一切眾生殊勝供養。",
        "translation": "Renouncing possessions, he'll reach the end of birth and death and so forth, attain inexhaustible, undiminished, ultimately eternal, inconceivable, and complete merit that's not shared by all sentient beings, and obtain excellent offerings from all sentient beings.",
        "source": "T12n0353_001:0219a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0219a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是捨三分善男子善女人，攝受正法，常為一切諸佛所記，一切眾生之所瞻仰。",
        "translation": "Thus, good men and good women who abandon the three parts of their lives and embrace the right teaching are always remembered by all the buddhas and venerated by all sentient beings.",
        "source": "T12n0353_001:0219a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0219a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又善男子善女人攝受正法者，法欲滅時，比丘、比丘尼、優婆塞、優婆夷，朋黨諍訟，破壞離散。",
        "translation": "\"Also, good men and good women who take in the right teaching are those whose monks, nuns, laymen, and laywomen are in conflict with each other and are disrupted and scattered when the teaching is about to cease.",
        "source": "T12n0353_001:0219a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不諂曲、不欺誑、不幻偽，愛樂正法，攝受正法入法朋中。",
        "translation": "Because they don't lie, don't deceive, and don't pretend, they delight in the right teaching and accept the right teaching as a friend of the Dharma.",
        "source": "T12n0353_001:0219a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入法朋者，必為諸佛之所授記。",
        "translation": "Those who enter the company of the Dharma will surely be marked by the buddhas.",
        "source": "T12n0353_001:0219a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0219a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見攝受正法如是大力，佛為實眼實智，為法根本、為通達法、為正法依，亦悉知見。」",
        "translation": "I've seen such great effort to collect the right Dharma, and I've seen the Buddha as the true eye and true knowledge, the root of the Dharma, the well-understood Dharma, and the basis of the right Dharma.\"",
        "source": "T12n0353_001:0219a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊於勝鬘所說攝受正法大精進力，起隨喜心：「如是勝鬘！",
        "translation": "It was then that the Bhagavān became delighted with what Śrīmālā said about the great power of effort to collect the right teaching, \"So it is, Śrīmālā!",
        "source": "T12n0353_001:0219a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's just as you said.",
        "source": "T12n0353_001:0219a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法大精進力，如大力士少觸身分，生大苦痛。",
        "translation": "'Take in the right teaching with great energy, and like a great man who touches his body a little, it produces great pain.'",
        "source": "T12n0353_001:0219a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勝鬘！",
        "translation": "Thus, Śrīmālā!",
        "source": "T12n0353_001:0219a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少攝受正法，令魔苦惱；我不見餘一善法令魔憂苦，如少攝受正法。",
        "translation": "\"A little taking in of the right Dharma causes Māra to suffer, but I don't see another good root that causes Māra to grieve and suffer, such as a little taking in of the right Dharma.",
        "source": "T12n0353_001:0219a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如牛王形色無比，勝一切牛；如是大乘少攝受正法，勝於一切二乘善根，以廣大故。",
        "translation": "Also, like the king of cattle, whose form is beyond compare, is superior to all cattle; thus, the great vehicle's little taking in of the right Dharma is superior to all the two vehicles' good roots because it's vast.",
        "source": "T12n0353_001:0219a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如須彌山王端嚴殊特，勝於眾山；如是大乘捨身、命、財以攝取心攝受正法，勝不捨身、命、財初住大乘一切善根，何況二乘？",
        "translation": "Also, like Mount Sumeru, which is so dignified and extraordinary that it's superior to many mountains, such is the great vehicle that takes in the right teaching with an attitude of taking in body, life, and possessions, which is superior to all the good roots of the first great vehicle that don't take in body, life, and possessions, so why wouldn't it be the second vehicle?",
        "source": "T12n0353_001:0219a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以廣大故。",
        "translation": "Because it's so vast.",
        "source": "T12n0353_001:0219a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故勝鬘！",
        "translation": "Therefore, Śrīmālā!",
        "source": "T12n0353_001:0219a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以攝受正法，開示眾生、教化眾生、建立眾生。",
        "translation": "By taking in the right teaching, they'll reveal it to sentient beings, teach them, and establish them.",
        "source": "T12n0353_001:0219a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勝鬘！",
        "translation": "Thus, Śrīmālā!",
        "source": "T12n0353_001:0219a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法如是大利、如是大福、如是大果。",
        "translation": "It's such a great benefit, such a great merit, and such a great result when you gather in the right teaching.",
        "source": "T12n0353_001:0219a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘！",
        "translation": "Śrīmālā!",
        "source": "T12n0353_001:0219b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於阿僧祇阿僧祇劫說：『攝受正法功德義利，不得邊際。』",
        "translation": "For incalculably long eons, I've said, 'The merits and benefits of taking in the right teaching can't be limited.'",
        "source": "T12n0353_001:0219b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故攝受正法，有無量無邊功德。」",
        "translation": "Therefore, taking in the right teaching has measureless and limitless merits.\"",
        "source": "T12n0353_001:0219b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一乘章第五",
        "translation": "The Fifth Chapter of the One Vehicle",
        "source": "T12n0353_001:0219b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告勝鬘：「汝今更說一切諸佛所說攝受正法！」",
        "translation": "The Buddha addressed Śrīmālā, \"Now, you must further explain all the correct dharmas that the buddhas have taught to us!\"",
        "source": "T12n0353_001:0219b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘白佛：「善哉世尊！",
        "translation": "Śrīmālā said to the Buddha, \"Good, Bhagavān!",
        "source": "T12n0353_001:0219b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然受教。」",
        "translation": "I'm sure I'll accept your teaching.\"",
        "source": "T12n0353_001:0219b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即白佛言：「世尊！",
        "translation": "He then said to the Buddha, \"Bhagavān!",
        "source": "T12n0353_001:0219b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝受正法者是摩訶衍。",
        "translation": "\"The one who takes in the right teaching is Mahāyāna.",
        "source": "T12n0353_001:0219b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0219b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶衍者，出生一切聲聞、緣覺、世間、出世間善法。",
        "translation": "\"Mahāyāna, he produces all śrāvakas, pratyekbuddhas, worldly and transmundane good qualities.",
        "source": "T12n0353_001:0219b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0219b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如阿耨大池出八大河。",
        "translation": "\"It's like the eight great rivers that emerge from the Anavatapta River.",
        "source": "T12n0353_001:0219b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是摩訶衍，出生一切聲聞、緣覺、世間、出世間善法。",
        "translation": "Thus, Mahāyāna gives rise to all the good qualities of śrāvakas, pratyekbuddhas, and worldly and transmundane dharmas.",
        "source": "T12n0353_001:0219b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0219b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如一切種子皆依於地而得生長。",
        "translation": "\"Also, just as all seeds grow depending on the ground, so do all śrāvakas, pratyekbuddhas, and worldly and transmundane good dharmas depend on the earth.",
        "source": "T12n0353_001:0219b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切聲聞、緣覺、世間、出世間善法，依於大乘而得增長。",
        "translation": "Thus, all śrāvakas, pratyekbuddhas, worldly and transmundane good dharmas rely on the great vehicle to grow.",
        "source": "T12n0353_001:0219b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故世尊！",
        "translation": "Therefore, Bhagavān!",
        "source": "T12n0353_001:0219b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住於大乘攝受大乘，即是住於二乘攝受二乘、一切世間、出世間善法。",
        "translation": "Abiding in the great vehicle and taking in the great vehicle means abiding in the two vehicles and taking in the two vehicles, all worldly and transmundane good qualities.",
        "source": "T12n0353_001:0219b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如世尊說六處。",
        "translation": "\"Suppose the Bhagavān explains the six abodes.",
        "source": "T12n0353_001:0219b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為六？",
        "translation": "What are the six?",
        "source": "T12n0353_001:0219b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：正法住、正法滅、波羅提木叉、比尼、出家、受具足。",
        "translation": "They are: abiding in the right Dharma, ceasing in the right Dharma, being a prātimokṣa, a nun, leaving home, and being fully ordained.",
        "source": "T12n0353_001:0219b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為大乘故說此六處。",
        "translation": "These six abodes are explained for the sake of the great vehicle.",
        "source": "T12n0353_001:0219b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0219b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法住者，為大乘故，說大乘住者即正法住。",
        "translation": "\"Abiding in the true dharma is for the sake of the great vehicle, and it's said that abiding in the great vehicle is abiding in the true dharma.",
        "source": "T12n0353_001:0219b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法滅者，為大乘故，說大乘滅者即正法滅。",
        "translation": "\"Cessation of the right Dharma\" means that it's for the sake of the great vehicle, and he teaches that the cessation of the great vehicle is the cessation of the right Dharma.",
        "source": "T12n0353_001:0219b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波羅提木叉、比尼此二法者，義一名異，比尼者即大乘學。",
        "translation": "The two dharmas of prātimokṣa and vinaya have different meanings, and vinaya is the training of the great vehicle.",
        "source": "T12n0353_001:0219b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0219b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以依佛出家而受具足，是故說大乘威儀戒是比尼、是出家、是受具足。",
        "translation": "Because he relies on the Buddha's renunciation and full ordination, it's because of this that the great vehicle's authoritative precepts are said to be for nuns, renunciant monks, and full ordination.",
        "source": "T12n0353_001:0219b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故阿羅漢無出家受具足。",
        "translation": "Therefore, there are no arhats who are renunciant practitioners and fully ordained.",
        "source": "T12n0353_001:0219b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0219b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢依如來出家受具足故。",
        "translation": "It's because an arhat relies on the Tathāgata to leave home and become fully ordained.",
        "source": "T12n0353_001:0219b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢歸依於佛，阿羅漢有恐怖。",
        "translation": "An arhat takes refuge in the Buddha, and the arhat has fear.",
        "source": "T12n0353_001:0219b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0219b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢於一切無行怖畏想住，如人執劍欲來害己，是故阿羅漢無究竟樂。",
        "translation": "\"When an arhat abides in the fearful contemplation that he's doing nothing, he's like a person holding a sword and wanting to harm himself; therefore, the arhat has no ultimate happiness.",
        "source": "T12n0353_001:0219b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0219b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0219b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依不求依。",
        "translation": "\"They rely on and don't seek refuge.",
        "source": "T12n0353_001:0219b27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如眾生無依，彼彼恐怖，以恐怖故則求歸依。",
        "translation": "Just as sentient beings lack support, they are afraid, and because of that fear, they seek refuge.",
        "source": "T12n0353_001:0219b27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如阿羅漢有怖畏，以怖畏故依於如來。",
        "translation": "Just as an arhat has fear, he relies on the Tathāgata because of that fear.",
        "source": "T12n0353_001:0219b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0219c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢、辟支佛有怖畏，是故阿羅漢、辟支佛，有餘生法不盡，故有生；有餘梵行不成，故不純；事不究竟，故當有所作；不度彼故，當有所斷。",
        "translation": "\"Arhats and pratyekabuddhas have fears; therefore, arhats and pratyekabuddhas have birth because there's a remainder of birth that's not exhausted, a remainder of the religious practice that's not carried out that's not pure, a task that's not accomplished that's to be done, and a task that's to be stopped because they haven't crossed over.",
        "source": "T12n0353_001:0219c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不斷故，去涅槃界遠。",
        "translation": "Because they don't stop, they'll be far removed from the realm of nirvāṇa.",
        "source": "T12n0353_001:0219c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0219c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有如來、應、正等覺得般涅槃，成就一切功德。",
        "translation": "Only tathāgatas, arhats, and pratyekabuddhas achieve all merits when they realize parinirvāṇa.",
        "source": "T12n0353_001:0219c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故阿羅漢、辟支佛，不成就一切功德。",
        "translation": "Therefore, arhats and pratyekabuddhas don't attain all merits.",
        "source": "T12n0353_001:0219c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言得涅槃者，是佛方便。",
        "translation": "He says he's attained nirvāṇa because it's the Buddha's method.",
        "source": "T12n0353_001:0219c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有如來得般涅槃，成就無量功德。",
        "translation": "Only the Tathāgata attains parinirvāṇa and accomplishes measureless merits.",
        "source": "T12n0353_001:0219c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故阿羅漢、辟支佛成就有量功德，言得涅槃者，是佛方便。",
        "translation": "Therefore, arhats and pratyekabuddhas achieve measureable merit, and they say they've attained nirvāṇa because it's a method of the Buddha.",
        "source": "T12n0353_001:0219c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有如來得般涅槃，成就不可思議功德。",
        "translation": "Only the Tathāgata attains parinirvāṇa and accomplishes unfathomable virtue.",
        "source": "T12n0353_001:0219c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故阿羅漢、辟支佛成就思議功德，言得涅槃者，是佛方便。",
        "translation": "Therefore, arhats and pratyekabuddhas achieve conceivable merit and say they've attained nirvāṇa, which is a method of the Buddha.",
        "source": "T12n0353_001:0219c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有如來得般涅槃，一切所應斷過，皆悉斷滅，成就第一清淨。",
        "translation": "Only the Tathāgata attains parinirvāṇa, which completely ends all the faults that should be stopped and accomplishes the first purity.",
        "source": "T12n0353_001:0219c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢、辟支佛有餘過，非第一清淨，言得涅槃者，是佛方便。",
        "translation": "Arhats and pratyekabuddhas have other faults that aren't the first purity, and they say that attaining nirvāṇa is a skillful means for the Buddha.",
        "source": "T12n0353_001:0219c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有如來得般涅槃，為一切眾生之所瞻仰，出過阿羅漢、辟支佛、菩薩境界。",
        "translation": "Only the Tathāgata attains parinirvāṇa and is admired by all sentient beings, surpassing the state of arhats, pratyekabuddhas, and bodhisattvas.",
        "source": "T12n0353_001:0219c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故阿羅漢、辟支佛去涅槃界遠，言阿羅漢、辟支佛觀察解脫四智究竟得蘇息處者，亦是如來方便有餘不了義說。",
        "translation": "Therefore, it's also the Tathāgata's method to say that arhats and pratyekabuddhas go far from the realm of nirvāṇa and that arhats and pratyekabuddhas observe the four kinds of wisdom of liberation and ultimately attain a place of rest, which has no further meaning than the Tathāgata's method.",
        "source": "T12n0353_001:0219c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T12n0353_001:0219c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二種死。",
        "translation": "\"There are two kinds of death.",
        "source": "T12n0353_001:0219c20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are the two?",
        "source": "T12n0353_001:0219c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：分段死、不思議變易死。",
        "translation": "It's called compartmentalized death and inconceivable death by transformation.",
        "source": "T12n0353_001:0219c20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分段死者，謂虛偽眾生。",
        "translation": "Partial deaths are defined as the deaths of falsely imagined sentient beings.",
        "source": "T12n0353_001:0219c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不思議變易死者，謂：阿羅漢、辟支佛、大力菩薩意生身，乃至究竟無上菩提。",
        "translation": "Those who die inconceivably changing are arhats, pratyekabuddhas, and powerful bodhisattvas whose minds are born, up to the point of perfect unsurpassed enlightenment.",
        "source": "T12n0353_001:0219c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二種死中，以分段死故，說阿羅漢、辟支佛智，我生已盡；得有餘果證故，說梵行已立；凡夫、人天所不能辦，七種學人先所未作，虛偽煩惱斷故，說所作已辦；阿羅漢、辟支佛所斷煩惱，更不能受後有故，說不受後有。",
        "translation": "Of the two kinds of death, it's said that the arhat's or pratyekabuddha's knowledge of self-birth has ended because of segmental death; it's said that the religious practice has been established because he has realized the fruit of remainder; it's said that the task has been accomplished because it's something mortals and humans and gods can't do, and it's said that the hypocritical afflictions of the seven kinds of trainees have ended because they hadn't done it before; and it's said that there's no subsequent existence because the afflictions stopped by the arhat or pratyekabuddha can't be subject to a subsequent existence.",
        "source": "T12n0353_001:0219c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非盡一切煩惱，亦非盡一切受生，故說不受後有。",
        "translation": "It's not the end of all afflictions or of all sensation of birth, so it's said not to receive subsequent existences.",
        "source": "T12n0353_001:0219c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0220a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有煩惱是阿羅漢、辟支佛所不能斷。",
        "translation": "\"There are afflictions that arhats and pratyekabuddhas can't eliminate.",
        "source": "T12n0353_001:0220a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「煩惱有二種。",
        "translation": "\"There are two kinds of afflictions.",
        "source": "T12n0353_001:0220a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are the two?",
        "source": "T12n0353_001:0220a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：住地煩惱及起煩惱。",
        "translation": "\"This refers to entrenched afflictions and arisen afflictions.",
        "source": "T12n0353_001:0220a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住地有四種。",
        "translation": "There are four kinds of entrenchments.",
        "source": "T12n0353_001:0220a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T12n0353_001:0220a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：見一處住地、欲愛住地、色愛住地、有愛住地。",
        "translation": "These are: the entrenchment of views of a single place, the entrenchment of desire, the entrenchment of craving for form, and the entrenchment of craving for existence.",
        "source": "T12n0353_001:0220a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四種住地，生一切起煩惱。",
        "translation": "These four entrenchments give rise to all the afflictions that arise.",
        "source": "T12n0353_001:0220a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起者剎那心剎那相應。",
        "translation": "What arises is momentarily associated with momentary mind.",
        "source": "T12n0353_001:0220a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0220a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心不相應無始無明住地。",
        "translation": "\"The mind doesn't associate with the beginningless entrenchment of ignorance.",
        "source": "T12n0353_001:0220a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0220a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四住地力，一切上煩惱依種，比無明住地，算數譬喻所不能及。",
        "translation": "These four entrenchments are more powerful than the entrenchment of ignorance and are beyond the power of mathematical metaphors to match the seeds of all the higher afflictions.",
        "source": "T12n0353_001:0220a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無明住地力，於有愛數四住地，無明住地其力最大。",
        "translation": "\"Thus, among the four entrenchments of attachment to existence, the power of the entrenchment of nescience is the greatest.",
        "source": "T12n0353_001:0220a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如惡魔波旬於他化自在天，色、力、壽命、眷屬、眾具、自在殊勝。",
        "translation": "It's like when Māra Pāpīyān lives in the Paranirmitavaśavartin Heaven, his form, strength, longevity, retinue, and multitude of possessions are outstandingly comfortable.",
        "source": "T12n0353_001:0220a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無明住地力，於有愛數四住地，其力最勝，恒沙等數上煩惱依，亦令四種煩惱久住。",
        "translation": "Thus, the power of the entrenchment of nescience is greatest in the four entrenchments of attachment to existence, and it causes the four kinds of afflictions to persist even as the number of afflictions increases.",
        "source": "T12n0353_001:0220a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢、辟支佛智所不能斷，唯如來菩提智之所能斷。",
        "translation": "It's not something that an arhat or pratyekabuddha's knowledge can stop, but only the Tathāgata's enlightening knowledge can stop it.",
        "source": "T12n0353_001:0220a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是世尊！",
        "translation": "Thus, Bhagavān!",
        "source": "T12n0353_001:0220a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明住地最為大力。",
        "translation": "The entrenchment of nescience is most powerful.",
        "source": "T12n0353_001:0220a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如取，緣有漏業因而生三有。",
        "translation": "\"Also like grasping, the three existences arise depending on the causes of contaminated actions.",
        "source": "T12n0353_001:0220a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無明住地，緣無漏業因，生阿羅漢、辟支佛、大力菩薩三種意生身。",
        "translation": "Thus, the three kinds of mind-made bodies of arhats, pratyekabuddhas, and powerful bodhisattvas arise from the causes of uncontaminated actions in the entrenchment of nescience.",
        "source": "T12n0353_001:0220a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三地，彼三種意生身生及無漏業生，依無明住地，有緣非無緣。",
        "translation": "In these three stages, those three kinds of mind-made bodies and uncontaminated actions arise depending on the entrenchment of nescience, with and without conditions.",
        "source": "T12n0353_001:0220a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故三種意生及無漏業，緣無明住地。",
        "translation": "Therefore, the three kinds of mind-made bodies and uncontaminated actions arise depending on the entrenchment of nescience.",
        "source": "T12n0353_001:0220a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0220a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是有愛住地數四住地，不與無明住地業同，無明住地異，離四住地。",
        "translation": "Thus, the four entrenchments of the entrenchment of craving are not the same as the entrenchment of nescience, but the entrenchment of nescience is different, and it's free of the four entrenchments.",
        "source": "T12n0353_001:0220a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛地所斷，佛菩提智所斷。",
        "translation": "It's stopped by the buddha-stage and stopped by the Buddha's enlightened wisdom.",
        "source": "T12n0353_001:0220a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0220a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢、辟支佛，斷四種住地，無漏不盡，不得自在力，亦不作證。",
        "translation": "Arhats and pratyekabuddhas who have ended the four entrenchments, whose contaminants haven't ended, don't attain unimpeded power, and don't realize it.",
        "source": "T12n0353_001:0220a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏不盡者，即是無明住地。",
        "translation": "Being uncontaminated and inexhaustible is the entrenchment of ignorance.",
        "source": "T12n0353_001:0220a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220a25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢、辟支佛、最後身菩薩，為無明住地之所覆障故，於彼彼法不知不覺。",
        "translation": "Because they're hindered by the entrenchment of ignorance, arhats, pratyekbuddhas, and last-body bodhisattvas don't know or perceive these things.",
        "source": "T12n0353_001:0220a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不知見故，所應斷者不斷、不究竟。",
        "translation": "Because they don't know and see them, what should be stopped doesn't persist or reach the end.",
        "source": "T12n0353_001:0220a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不斷故，名有餘過解脫，非離一切過解脫；名有餘清淨，非一切清淨；名成就有餘功德，非一切功德。",
        "translation": "Because it doesn't stop, it's called liberation with remainder and not liberation from all faults, purity with remainder and not all purity, and the accomplishment of merit with remainder and not all merit.",
        "source": "T12n0353_001:0220a28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以成就有餘解脫、有餘清淨、有餘功德故，知有餘苦、斷有餘集、證有餘滅、修有餘道，是名得少分涅槃。",
        "translation": "Because they achieve liberation with remainder, purity with remainder, and merit with remainder, knowing suffering with remainder, ending [suffering] with remainder, realizing cessation with remainder, and cultivating the path with remainder is called attaining partial nirvāṇa.",
        "source": "T12n0353_001:0220b02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得少分涅槃者，名向涅槃界。",
        "translation": "Attaining a modicum of nirvāṇa is called heading toward the nirvāṇa realm.",
        "source": "T12n0353_001:0220b04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知一切苦、斷一切集、證一切滅、修一切道，於無常壞世間、無常病世間，得常住涅槃；於無覆護世間、無依世間，為護為依。",
        "translation": "If someone knows all suffering, ends all collections, realizes all cessation, and cultivates all paths, they'll attain nirvāṇa of permanent abiding in the impermanent decay world and the impermanent sickness world, and they'll be protected and supported in the unhindered protection world and the non-support world.",
        "source": "T12n0353_001:0220b05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0220b08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法無優劣故得涅槃；智慧等故得涅槃；解脫等故得涅槃；清淨等故得涅槃。",
        "translation": "Nirvāṇa is attained because dharmas are without superiority or inferiority, nirvāṇa is attained because wisdom and so forth, nirvāṇa is attained because liberation and so forth, and nirvāṇa is attained because purity and so forth.",
        "source": "T12n0353_001:0220b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故涅槃一味等味，謂解脫味。",
        "translation": "Therefore, the single taste of nirvāṇa is equal in taste, which is the taste of liberation.",
        "source": "T12n0353_001:0220b10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220b11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無明住地，不斷不究竟者，不得一味等味，謂明解脫味。",
        "translation": "If someone is stuck in the entrenchment of ignorance and doesn't stop and finish, they won't get a taste like that, which is the taste of insight and liberation.",
        "source": "T12n0353_001:0220b11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0220b12_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明住地不斷、不究竟者，過恒沙等所應斷法，不斷、不究竟，過恒沙等所應斷法不斷故，過恒沙等法應得不得、應證不證。",
        "translation": "\"When the entrenchment of nescience doesn't persist and doesn't reach the ultimate, it's because the things that should be stopped past the sands and so forth don't persist and don't reach the ultimate, and the things that should be stopped past the sands and so forth are unobtainable and unrealized.",
        "source": "T12n0353_001:0220b12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故無明住地積聚，生一切修道斷煩惱、上煩惱。",
        "translation": "As a result, nescience accumulates in the entrenchment of ignorance, producing all the afflictions of cultivation, which are the afflictions of ending and the higher afflictions.",
        "source": "T12n0353_001:0220b15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼生心上煩惱、止上煩惱、觀上煩惱、禪上煩惱、正受上煩惱、方便上煩惱、智上煩惱、果上煩惱、得上煩惱、力上煩惱、無畏上煩惱，如是過恒沙等上煩惱，如來菩提智所斷。",
        "translation": "They give rise to mental afflictions, calming afflictions, observational afflictions, meditation afflictions, correct feeling afflictions, skillful means afflictions, knowledge afflictions, fruition afflictions, attainment afflictions, power afflictions, fearlessness afflictions, and so on, which are more than a constant stream of higher afflictions that the Tathāgata's enlightened knowledge stops.",
        "source": "T12n0353_001:0220b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切皆依無明住地之所建立，一切上煩惱起，皆因無明住地，緣無明住地。",
        "translation": "All of them are founded on the entrenchment of nescience, and all of the higher afflictions that arise are caused by the entrenchment of nescience and have their conditions in the entrenchment of nescience.",
        "source": "T12n0353_001:0220b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0220b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此起煩惱，剎那心剎那相應；世尊！",
        "translation": "Here afflictions arise, which are associated with momentary states of mind and momentary periods of time; Bhagavān!",
        "source": "T12n0353_001:0220b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心不相應無始無明住地。",
        "translation": "\"The mind doesn't associate with the beginningless entrenchment of ignorance.",
        "source": "T12n0353_001:0220b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復過於恒沙如來菩提智所應斷法，一切皆是無明住地所持所建立。",
        "translation": "\"If it's more than what should be stopped by the bodhi-knowledge of a Tathāgata who remains in the sands, everything is built by maintaining the ground of nescience.",
        "source": "T12n0353_001:0220b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如一切種子皆依地生，建立、增長，若地壞者彼亦隨壞。",
        "translation": "It's like how all seeds are produced, built, and grown based on the ground, and if the ground breaks down, they also break down along with it.",
        "source": "T12n0353_001:0220b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是過恒沙等如來菩提智所應斷法，一切皆依無明住地生，建立增長；若無明住地斷者，過恒沙等如來菩提智所應斷法，皆亦隨斷。",
        "translation": "Thus, more than an infinite number of things that should be stopped by the Tathāgata's enlightened cognition all arise from the ground that's the abode of nescience, build, and grow, and if the ground that's the abode of nescience is stopped, more than an infinite number of things that should be stopped by the Tathāgata's enlightened cognition are stopped along with it.",
        "source": "T12n0353_001:0220b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切煩惱、上煩惱斷，過恒沙等如來所得一切諸法，通達無礙一切知見，離一切過惡，得一切功德。",
        "translation": "Thus, when all afflictions and higher afflictions are stopped, the Tathāgata attains access to all things that transcend the sands, has unhindered knowledge and vision of all things, is free of all faults and evils, and attains all merits.",
        "source": "T12n0353_001:0220c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法王法主，而得自在，登一切法自在之地。",
        "translation": "He becomes the Dharma king and Dharma lord and attains mastery, ascending to the stage of mastery over all dharmas.",
        "source": "T12n0353_001:0220c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、等正覺正師子吼：『我生已盡，梵行已立，所作已辦，不受後有。』",
        "translation": "The Tathāgata, Worthy, and Completely Enlightened One is correctly shouting, 'My births have been ended, the religious practice has been established, the task has been accomplished, and I won't be subject to a later existence.'",
        "source": "T12n0353_001:0220c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故世尊以師子吼依於了義，一向記說。",
        "translation": "Therefore, the Bhagavān uses the lion's roar as a basis for fully understanding its meaning, and he always remembers it.",
        "source": "T12n0353_001:0220c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不受後有智有二種。",
        "translation": "There are two kinds of knowledge that doesn't lead to later existence.",
        "source": "T12n0353_001:0220c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：如來以無上調御降伏四魔，出一切世間，為一切眾生之所瞻仰，得不思議法身。",
        "translation": "That is, the Tathāgata subdues the four Māras with unsurpassed control, transcends the whole world, is admired by all sentient beings, and attains the inconceivable Dharma body.",
        "source": "T12n0353_001:0220c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切爾焰地得無礙法自在，於上更無所作。",
        "translation": "He attains unobstructed Dharma mastery in the land of all burning things, and there's nothing more he can do.",
        "source": "T12n0353_001:0220c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所得地十力勇猛，昇於第一無上無畏之地，一切爾炎無礙智觀不由於他，不受後有智師子吼。",
        "translation": "With ten powers and boldness in the ungraspable ground, he rises to the first, unsurpassed, and fearless ground, observes all the eruptive powers of unhindered wisdom without relying on others, and doesn't receive the lion's roar of wisdom from late-arising sentient beings.",
        "source": "T12n0353_001:0220c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢、辟支佛度生死畏，次第得解脫樂，作是念：『我離生死恐怖，不受生死苦。』",
        "translation": "An arhat or pratyekabuddha who has crossed the fear of birth-and-death and attained the happiness of liberation in turn thinks, 'I'm free of the fear of birth-and-death and won't suffer birth-and-death.'",
        "source": "T12n0353_001:0220c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0220c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢、辟支佛觀察時，得不受後有，觀第一蘇息處涅槃地。",
        "translation": "When arhats and pratyekabuddhas investigate, they attain the stage of nirvāṇa, which is the first place of respite, without sensation of subsequent existence.",
        "source": "T12n0353_001:0220c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0220c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼先所得地，不愚於法、不由於他，亦自知得有餘地，必當得阿耨多羅三藐三菩提。",
        "translation": "That person's previously attained stage is not fooled by the teaching or by others, and they know on their own that they've attained some other stage and will surely attain supreme perfect enlightenment.",
        "source": "T12n0353_001:0220c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0220c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、緣覺乘皆入大乘，大乘者即是佛乘，是故三乘即是一乘。",
        "translation": "The vehicle of the direct disciples and the vehicle of the solitary realizers all enter the great vehicle, which is the vehicle of the Buddha; therefore, the three vehicles are the one vehicle.",
        "source": "T12n0353_001:0220c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得一乘者得阿耨多羅三藐三菩提，阿耨多羅三藐三菩提者即是涅槃界，涅槃界者即是如來法身，得究竟法身者則究竟一乘，無異如來、無異法身，如來即法身；得究竟法身者，則究竟一乘，究竟者即是無邊不斷。",
        "translation": "Attaining the One Vehicle, one attains supreme perfect enlightenment, and supreme perfect enlightenment is the realm of nirvāṇa, and the realm of nirvāṇa is the Tathāgata's Dharma body; attaining the ultimate Dharma body is the ultimate One Vehicle, which is not different from the Tathāgata or Dharma body, and the Tathāgata is the Dharma body; attaining the ultimate Dharma body is the ultimate One Vehicle, and the ultimate is limitless and unceasing.",
        "source": "T12n0353_001:0220c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0220c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來無有限齊時住，如來、應、等正覺後際等住。",
        "translation": "The Tathāgata has no finite number of equal stages, and the Tathāgata, Arhat, and Completely Awakened One have equal stages at the end.",
        "source": "T12n0353_001:0220c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來無限齊大悲，亦無限齊安慰世間。",
        "translation": "The Tathāgata's infinite equal great compassion also infinitely equal comforts the world.",
        "source": "T12n0353_001:0220c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無限大悲、無限安慰世間，作是說者是名善說如來。",
        "translation": "This is called a well-explained tathāgata who infinitely comforts the world with infinite great compassion and infinite consolation and who says this.",
        "source": "T12n0353_001:0220c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復說言無盡法、常住法，一切世間之所歸依者，亦名善說如來。",
        "translation": "If someone also explains that inexhaustible dharmas and eternally abiding dharmas are the basis of all the world, that's also called a well-explained tathāgata.",
        "source": "T12n0353_001:0221a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故於未度世間、無依世間，與後際等，作無盡歸依、常住歸依者，謂如來、應、等正覺也。",
        "translation": "Therefore, someone who makes an inexhaustible refuge or an eternally abiding refuge in a world that's not yet liberated, a world without support, or the future is the Tathāgata, Arhat, and Completely Awakened One.",
        "source": "T12n0353_001:0221a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「法者即是說一乘道，僧者是三乘眾。",
        "translation": "\"That's the Dharma that explains the One Vehicle path, and that's the saṃgha that represents the Three Vehicle community.",
        "source": "T12n0353_001:0221a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二歸依非究竟歸依，名少分歸依。",
        "translation": "These two kinds of refuge are not the ultimate refuge, but are called the partial refuge.",
        "source": "T12n0353_001:0221a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一乘道法，得究竟法身，於上更無說一乘法身。",
        "translation": "They say the Dharma of the One Vehicle is the path to attaining the ultimate Dharma body, and there's nothing above that that explains the Dharma body of the One Vehicle.",
        "source": "T12n0353_001:0221a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三乘眾者有恐怖，歸依如來，求出修學向阿耨多羅三藐三菩提，是故二依非究竟依，是有限依。",
        "translation": "All sentient beings of the three vehicles have fear, rely on the Tathāgata, and seek to escape cultivation and head for unsurpassed, correct enlightenment; therefore, the two kinds of reliance are not ultimate reliance but limited reliance.",
        "source": "T12n0353_001:0221a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有眾生，如來調伏，歸依如來得法津澤，生信樂心歸依法、僧，是二歸依；非此二歸依，是歸依如來。",
        "translation": "\"If sentient beings are disciplined by the Tathāgata, they rely on the Tathāgata to obtain the Dharma's blessings and give rise to faith and happiness, and they take refuge in the Dharma and Saṃgha, these are the two kinds of refuge; anything other than these two kinds of refuge is refuge in the Tathāgata.",
        "source": "T12n0353_001:0221a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歸依第一義者是歸依如來。",
        "translation": "Those who take refuge in the supreme truth take refuge in the Tathāgata.",
        "source": "T12n0353_001:0221a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二歸依第一義，是究竟歸依如來。",
        "translation": "These two kinds of relying on the supreme truth are the ultimate relying on the Tathāgata.",
        "source": "T12n0353_001:0221a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無異如來，無異二歸依。",
        "translation": "Nothing is different from the Tathāgata, and nothing is different from the two refuges.",
        "source": "T12n0353_001:0221a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來即三歸依。",
        "translation": "The Tathāgata is the three refuges.",
        "source": "T12n0353_001:0221a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一乘道。",
        "translation": "\"He teaches about the One Vehicle path.",
        "source": "T12n0353_001:0221a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來四無畏成就師子吼說，若如來隨彼所欲而方便說，即是大乘，無有三乘。",
        "translation": "The Tathāgata accomplishes the lion's roar with the four fearlessnesses, saying that if the Tathāgata explains it skillfully according to their desires, it's the great vehicle and there are no three vehicles.",
        "source": "T12n0353_001:0221a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三乘者入於一乘，一乘者即第一義乘。",
        "translation": "The three-vehicle vehicle enters the One Vehicle, and the One Vehicle is the supreme vehicle.",
        "source": "T12n0353_001:0221a17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊聖諦章第六",
        "translation": "The Sixth Chapter of the Infinite Noble Truths",
        "source": "T12n0353_001:0221a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0221a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、緣覺初觀聖諦，以一智斷諸住地；以一智四斷、知、功德、作證，亦善知此四法義。",
        "translation": "śrāvakas and pratyekbuddhas first contemplate the noble truths with a single knowledge that ends the entrenchments, and they well know the meaning of these four things with a single knowledge that ends, knows, merits, and accomplishes them.",
        "source": "T12n0353_001:0221a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有出世間上上智、四智漸至及四緣漸至，無漸至法是出世間上上智。",
        "translation": "There's no supramundane cognition, four gradual attainments of knowledge, or four gradual attainments of conditions, and the absence of gradual attainments is supramundane cognition.",
        "source": "T12n0353_001:0221a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0221a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛喻者是第一義智。",
        "translation": "\"The vajra metaphor is cognition of the ultimate truth.",
        "source": "T12n0353_001:0221a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非聲聞、緣覺不斷無明住地，初聖諦智是第一義智。",
        "translation": "Not a śrāvaka or pratyekabuddha who doesn't continuously abide in ignorance, knowledge of the first noble truth is cognition of the ultimate truth.",
        "source": "T12n0353_001:0221a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無二聖諦智斷諸住地。",
        "translation": "\"He stops the entrenchments with the knowledge of the noble truth of nonduality.",
        "source": "T12n0353_001:0221a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、等正覺，非一切聲聞、緣覺境界。",
        "translation": "The Tathāgata, Arhat, and Completely Enlightened One are not the realms of all śrāvakas and pratyekbuddhas.",
        "source": "T12n0353_001:0221a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不思議空智，斷一切煩惱藏。",
        "translation": "He has inconceivable wisdom of emptiness that ends the store of all afflictions.",
        "source": "T12n0353_001:0221a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若壞一切煩惱藏究竟智，是名第一義智。",
        "translation": "If the ultimate knowledge of the store of all afflictions is destroyed, this is called the cognition of the ultimate truth.",
        "source": "T12n0353_001:0221a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初聖諦智非究竟智，向阿耨多羅三藐三菩提智。",
        "translation": "This cognition of the first noble truth isn't ultimate cognition, but cognition that leads to unsurpassed, correct enlightenment.",
        "source": "T12n0353_001:0221a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0221b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖義者，非一切聲聞、緣覺，聲聞、緣覺成就有量功德，聲聞、緣覺成就少分功德，故名之為聖。",
        "translation": "\"The meaning of sage is not that all śrāvakas and pratyekbuddhas accomplish measureable merit, but that śrāvakas and pratyekbuddhas accomplish a modicum of merit, which is why they're called sage.",
        "source": "T12n0353_001:0221b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖諦者，非聲聞、緣覺諦；亦非聲聞、緣覺功德。",
        "translation": "The noble truth is not the truth of śrāvakas and pratyekbuddhas, and it's not the merit of śrāvakas and pratyekbuddhas.",
        "source": "T12n0353_001:0221b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諦如來、應、等正覺初始覺知，然後為無明[穀-禾+卵]藏世間開現演說，是故名聖諦。",
        "translation": "This truth is initially perceived by the Tathāgata, the Worthy One, and the Completely Awakened One, and then it's revealed and explained for the world of the store of nescience [grain - grain + egg]; therefore, it's called the noble truth.",
        "source": "T12n0353_001:0221b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏章第七",
        "translation": "The Tathāgatagarbha Chapter 7",
        "source": "T12n0353_001:0221b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「聖諦者，說甚深義，微細難知，非思量境界。",
        "translation": "\"The noble truth is a teaching of a profound meaning that's subtle and difficult to know and doesn't fit the conceptual realm.",
        "source": "T12n0353_001:0221b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是智者所知，一切世間所不能信。",
        "translation": "It's known by wise people and is not believed by the whole world.",
        "source": "T12n0353_001:0221b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此說甚深如來之藏。",
        "translation": "This is called the treasury of the very profound Tathāgata.",
        "source": "T12n0353_001:0221b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏者，是如來境界，非一切聲聞、緣覺所知。",
        "translation": "The tathāgatagarbha is the Tathāgata's sphere, which is not known by all śrāvakas and pratyekbuddhas.",
        "source": "T12n0353_001:0221b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏處，說聖諦義。",
        "translation": "The Tathāgatagarbha is the place where the meaning of the noble truth is explained.",
        "source": "T12n0353_001:0221b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏處甚深故，說聖諦亦甚深，微細難知，非思量境界，是智者所知，一切世間所不能信。",
        "translation": "Because the Tathāgatagarbha's storehouse is so profound, the noble truths are also profound, subtle and difficult to know, and beyond the realm of conceptualization, which are known to wise people and cannot be trusted by the whole world.",
        "source": "T12n0353_001:0221b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法身章第八",
        "translation": "Dharma Body, Chapter 8",
        "source": "T12n0353_001:0221b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若於無量煩惱藏所纏如來藏不疑惑者，於出無量煩惱藏法身亦無疑惑。",
        "translation": "\"If someone doesn't have doubts about the Tathāgatagarbha that's tethered by the store of measureless afflictions, they also won't have doubts about the Dharma body that comes out of the store of measureless afflictions.",
        "source": "T12n0353_001:0221b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於說如來藏、如來法身、不思議佛境界及方便說，心得決定者，此則信解說二聖諦。",
        "translation": "When the Tathāgatagarbha, the Tathāgata's Dharma body, the Buddha's objective realm, and skillful means are explained without contemplating them, this is called a confident understanding of the explanation of the two noble truths.",
        "source": "T12n0353_001:0221b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是難知難解者，謂說二聖諦義。",
        "translation": "Someone who thus has difficulty knowing and understanding what's meant by teaching the two noble truths.",
        "source": "T12n0353_001:0221b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為說二聖諦義？",
        "translation": "What is the meaning of explaining the two noble truths?",
        "source": "T12n0353_001:0221b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂說作聖諦義、說無作聖諦義。",
        "translation": "It's called speaking the meaning of the noble truth of doing and speaking the meaning of the noble truth of not doing.",
        "source": "T12n0353_001:0221b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說作聖諦義者，是說有量四聖諦。",
        "translation": "He who teaches the meaning of the noble truths that are created is teaching the four noble truths that are measured.",
        "source": "T12n0353_001:0221b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非因他能知一切苦斷、一切集證、一切滅修、一切道。",
        "translation": "It's not because he can know all suffering, all arising, all cessation, and all paths.",
        "source": "T12n0353_001:0221b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故世尊！",
        "translation": "Therefore, Bhagavān!",
        "source": "T12n0353_001:0221b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有有為生死、無為生死。",
        "translation": "\"There's birth-and-death with and without effort.",
        "source": "T12n0353_001:0221b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃亦如是，有餘及無餘。",
        "translation": "So too is nirvāṇa, with and without remainder.",
        "source": "T12n0353_001:0221b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說無作聖諦義者，說無量四聖諦義。",
        "translation": "Someone who explains the meaning of the unconstructed noble truths will explain the meaning of the immeasurable four noble truths.",
        "source": "T12n0353_001:0221b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能以自力知一切受苦斷、一切受集證、一切受滅修、一切受滅道。",
        "translation": "They can know by their own power that all feelings are ended by suffering, all feelings are collected by realization, all feelings are ceased by cultivation, and all feelings are ceased by the path.",
        "source": "T12n0353_001:0221b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是八聖諦，如來說四聖諦。",
        "translation": "Thus, with respect to the eight noble truths, the Tathāgata teaches the four noble truths.",
        "source": "T12n0353_001:0221b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是四無作聖諦義，唯如來、應、等正覺事究竟，非阿羅漢、辟支佛事究竟。",
        "translation": "Such is the meaning of the four unconstructed noble truths, which are only the work of the Tathāgata, Arhat, and Fully Awakened One, not the work of arhats and pratyekabuddhas.",
        "source": "T12n0353_001:0221b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非下、中、上法得涅槃。",
        "translation": "It's not the lower, middle, or higher dharmas that attain nirvāṇa.",
        "source": "T12n0353_001:0221c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、等正覺，於無作四聖諦義事究竟，以一切如來、應、等正覺，知一切未來苦、斷一切煩惱上煩惱所攝受一切集、滅一切意生身、除一切苦滅作證。",
        "translation": "\"The Tathāgata, Arhat, and Completely Awakened One perceives all future suffering, ends all afflictions, experiences all collections of afflictions, ceases all mind-made bodies, and realizes the cessation of all suffering with all Tathāgatas, Arhats, and Completely Awakened Ones.",
        "source": "T12n0353_001:0221c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0221c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非壞法故，名為苦滅。",
        "translation": "Because it's not a destructive dharma, it's called the cessation of suffering.",
        "source": "T12n0353_001:0221c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言苦滅者，名無始無作、無起無盡、離盡常住、自性清淨，離一切煩惱藏。",
        "translation": "What's called the cessation of suffering is called beginningless, uncreated, unarisen, and inexhaustible, eternally abiding, pure in its own nature, and free of the store of all afflictions.",
        "source": "T12n0353_001:0221c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過於恒沙不離、不脫、不異、不思議佛法成就，說如來法身。",
        "translation": "After passing through sands that are not separate from, not separate from, not different from, and not conceivable from the accomplishment of the Buddha's teaching, he explains the Tathāgata's Dharma body.",
        "source": "T12n0353_001:0221c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來法身不離煩惱藏，名如來藏。",
        "translation": "Thus, the Tathāgata's Dharma body isn't free from the store of afflictions, which is called the Tathāgata's store.",
        "source": "T12n0353_001:0221c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空義隱覆真實章第九",
        "translation": "The Meaning of Emptiness Conceals the Real Truth, Chapter 9",
        "source": "T12n0353_001:0221c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0221c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏智是如來空智。",
        "translation": "The wisdom of the Tathāgatagarbha is the wisdom of the Tathāgata's emptiness.",
        "source": "T12n0353_001:0221c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏者，一切阿羅漢、辟支佛、大力菩薩，本所不見，本所不得。",
        "translation": "\"The tathāgatagarbha is the store of all arhats, pratyekabuddhas, and powerful bodhisattvas who have never seen anything before and have never attained it before.",
        "source": "T12n0353_001:0221c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0221c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二種如來藏空智。",
        "translation": "\"There are two kinds of cognition of the emptiness of the tathāgatagarbha.",
        "source": "T12n0353_001:0221c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空如來藏，若離、若脫、若異一切煩惱藏。",
        "translation": "\"The tathāgatagarbha store is empty, whether it's free of, liberated from, or different from the store of all afflictions.",
        "source": "T12n0353_001:0221c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不空如來藏，過於恒沙不離、不脫、不異、不思議佛法。",
        "translation": "The nonempty tathāgatagarbha is more than a constant sands that isn't free from, doesn't separate from, doesn't differ from, and doesn't conceive of the Buddha's teaching.",
        "source": "T12n0353_001:0221c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0221c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二空智，諸大聲聞能信如來。",
        "translation": "\"These are the two kinds of knowledge of emptiness that great śrāvakas can trust in the Tathāgata.",
        "source": "T12n0353_001:0221c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切阿羅漢、辟支佛空智，於四不顛倒境界轉。",
        "translation": "The cognition of emptiness of all arhats and pratyekabuddhas turns in four realms that aren't mistaken.",
        "source": "T12n0353_001:0221c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故一切阿羅漢、辟支佛，本所不見、本所不得。",
        "translation": "Therefore, all arhats and pratyekabuddhas have never seen anything in the past, and they haven't attained anything in the past.",
        "source": "T12n0353_001:0221c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切苦滅，唯佛得證，壞一切煩惱藏，修一切滅苦道。",
        "translation": "Only the Buddha can realize the cessation of all suffering, destroy all stores of affliction, and cultivate all paths to the cessation of suffering.",
        "source": "T12n0353_001:0221c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一諦章第十",
        "translation": "Chapter 10 of the One Truth",
        "source": "T12n0353_001:0221c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0221c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四聖諦，三是無常，一是常。",
        "translation": "Of these four noble truths, three are impermanent and one is permanent.",
        "source": "T12n0353_001:0221c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0221c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三諦入有為相，入有為相者是無常。",
        "translation": "The three truths enter into the mark of being, and what enters into the mark of being is impermanent.",
        "source": "T12n0353_001:0221c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無常者是虛妄法。",
        "translation": "What's impermanent is a false dharma.",
        "source": "T12n0353_001:0221c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛妄法者，非諦、非常、非依。",
        "translation": "A false dharma is not a truth, not an impermanence, and not a basis.",
        "source": "T12n0353_001:0221c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故苦諦、集諦、道諦，非第一義諦，非常、非依。",
        "translation": "Therefore, the truths of suffering, arising, and the path are not the truths of the ultimate truth, and they are neither permanent nor dependent.",
        "source": "T12n0353_001:0221c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一依章第十一",
        "translation": "Chapter 11 of the One Dependent Truth",
        "source": "T12n0353_001:0221c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一苦滅諦，離有為相，離有為相者是常。",
        "translation": "\"The single truth of suffering's cessation is free of the marks of being, and that which is free of the marks of being is permanent.",
        "source": "T12n0353_001:0222a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常者非虛妄法。",
        "translation": "What's permanent is not a false dharma.",
        "source": "T12n0353_001:0222a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非虛妄法者，是諦、是常、是依。",
        "translation": "What's not a false dharma is the truth, the permanence, and the support.",
        "source": "T12n0353_001:0222a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故滅諦，是第一義。",
        "translation": "Therefore, the truth of cessation is the ultimate truth.",
        "source": "T12n0353_001:0222a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顛倒真實章第十二",
        "translation": "Twelfth Chapter on the True and False Truths",
        "source": "T12n0353_001:0222a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不思議是滅諦，過一切眾生心識所緣，亦非一切阿羅漢、辟支佛智慧境界。",
        "translation": "\"This inconceivable truth of cessation transcends all the objects of the mind and consciousness of sentient beings, and it's not the realm of the wisdom of all arhats and pratyekabuddhas.",
        "source": "T12n0353_001:0222a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如生盲不見眾色，七日嬰兒不見日輪。",
        "translation": "It's like being born blind and not seeing all forms, or a seven-day-old baby not seeing the sun-wheel.",
        "source": "T12n0353_001:0222a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦滅諦者，亦復如是！",
        "translation": "So it is with the noble truth of the cessation of suffering!",
        "source": "T12n0353_001:0222a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非一切凡夫心識所緣，亦非二乘智慧境界。",
        "translation": "They aren't the objects of all mortal minds and consciousnesses, and they aren't the realm of two-vehicle wisdom.",
        "source": "T12n0353_001:0222a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫識者二見顛倒；一切阿羅漢、辟支佛智者，則是清淨。",
        "translation": "Ordinary consciousnesses are mistaken in their two views, but the wisdom of all arhats and pratyekabuddhas is pure.",
        "source": "T12n0353_001:0222a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邊見者，凡夫於五受陰，我見、妄想、計著，生二見，是名邊見，所謂常見、斷見。",
        "translation": "A mistaken view of the extremes, in which a mortal's view of the five acquired aggregates, which are view of self, deluded perception, and attachment, gives rise to two views, is called a mistaken view, which is called a common view and a stop view.",
        "source": "T12n0353_001:0222a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸行無常，是斷見非正見；見涅槃常，是常見非正見。",
        "translation": "Seeing the formations as impermanent is nihilism, which is nihilism and not right view, and seeing nirvāṇa as permanent is common and not right view.",
        "source": "T12n0353_001:0222a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄想見故，作如是見。",
        "translation": "Because of this deluded conceptual view, they come to this view.",
        "source": "T12n0353_001:0222a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於身諸根分別思惟，現法見壞，於有相續不見，起於斷見，妄想見故；於心相續愚闇，不解不知，剎那間意識境界，起於常見，妄想見故。",
        "translation": "When the faculties in his body discriminate and contemplate, the present world is destroyed, and he doesn't see the continuity of existence, which gives rise to a view of stopping and a deluded conceptual view; when the continuity of the mind is obscured, he doesn't understand and doesn't know, and the momentary objects of consciousness become commonplace, which is a deluded conceptual view.",
        "source": "T12n0353_001:0222a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此妄想見，於彼義若過若不及，作異想分別，若斷若常。",
        "translation": "From this deluded conceptual view, whether it's excessive or deficient in its meaning, they create different conceptualizations and discriminations, whether they're cut off or constant.",
        "source": "T12n0353_001:0222a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顛倒眾生，於五受陰，無常常想、苦有樂想、無我我想、不淨淨想。",
        "translation": "In the five acquired aggregates, mistaken sentient beings conceive of impermanence, painful existence, pleasure, the absence of self, and impurity and purity.",
        "source": "T12n0353_001:0222a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切阿羅漢、辟支佛淨智者，於一切智境界及如來法身，本所不見。",
        "translation": "All arhats and pratyekabuddhas with pure cognition don't see the realm of omniscience or the Tathāgata's Dharma body in the past.",
        "source": "T12n0353_001:0222a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或有眾生，信佛語故，起常想、樂想、我想、淨想，非顛倒見，是名正見。",
        "translation": "\"Perhaps there are sentient beings who believe the Buddha's words and give rise to perceptions of permanence, happiness, self, and purity that are not mistaken views, which are called right views.",
        "source": "T12n0353_001:0222a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0222a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來法身是常波羅蜜、樂波羅蜜、我波羅蜜、淨波羅蜜。",
        "translation": "The Tathāgata's Dharma body is the perfection of constancy, the perfection of pleasure, the perfection of self, and the perfection of purity.",
        "source": "T12n0353_001:0222a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於佛法身，作是見者，是名正見。",
        "translation": "Anyone who thus sees the Buddha's Dharma body is called someone who has right view.",
        "source": "T12n0353_001:0222a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正見者，是佛真子，從佛口生、從正法生、從法化生，得法餘財。",
        "translation": "A person with right view is a true son of the Buddha who arises from the Buddha's mouth, from the right teaching, and from the teaching of the teaching, and who attains the residual wealth of the teaching.",
        "source": "T12n0353_001:0222a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0222a26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨智者，一切阿羅漢、辟支佛智波羅蜜，此淨智者雖曰淨智，於彼滅諦，尚非境界，況四依智？",
        "translation": "Although this pure cognition is called pure cognition, it's still not a realm in that noble truth of cessation, so why wouldn't it be the four dependent cognitions?",
        "source": "T12n0353_001:0222a27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0222a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三乘初業，不愚於法。",
        "translation": "\"The first karma of the three vehicles is not fooled by the teaching.",
        "source": "T12n0353_001:0222a29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼義當覺當得，為彼故，世尊說四依。",
        "translation": "Their meaning will be realized and obtained, and for that reason, the Bhagavān explains the four supports.",
        "source": "T12n0353_001:0222a29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四依者，是世間法。",
        "translation": "These four supports are mundane dharmas.",
        "source": "T12n0353_001:0222b01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一依者，一切依止，出世間上上第一義依，所謂滅諦。",
        "translation": "\"One basis is the basis for all things, the supreme, supreme ground of supreme truth that transcends the world, which is called the truth of cessation.",
        "source": "T12n0353_001:0222b02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自性清淨章第十三",
        "translation": "Chapter 13, \"The Purity of the Self-nature",
        "source": "T12n0353_001:0222b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0222b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生死者依如來藏，以如來藏故，說本際不可知。",
        "translation": "Birth-and-death depends on the tathāgatagarbha, and it's because of the tathāgatagarbha that the original state is said to be unknowable.",
        "source": "T12n0353_001:0222b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如來藏故說生死，是名善說。",
        "translation": "To say that birth-and-death exists because of the tathāgatagarbha is called a good teaching.",
        "source": "T12n0353_001:0222b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生死，生死者，諸受根沒，次第不受根起，是名生死。",
        "translation": "Birth-and-death, birth-and-death, the absence of sensory faculties and the arising of sequential un-sensitive faculties are called birth-and-death.",
        "source": "T12n0353_001:0222b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "死生者，此二法是如來藏。",
        "translation": "\"Birth by death, these two things are the tathāgatagarbha.",
        "source": "T12n0353_001:0222b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間言說故，有死有生，死者謂根壞，生者新諸根起，非如來藏有生有死。",
        "translation": "Because the world says so, there's death and birth, and death is the destruction of the faculties, while birth is the arising of new faculties, not that the Tathāgatagarbha has birth and death.",
        "source": "T12n0353_001:0222b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏者離有為相，如來藏常住不變。",
        "translation": "The Tathāgatagarbha is free of the marks of being, and the Tathāgatagarbha is always abiding and unchanging.",
        "source": "T12n0353_001:0222b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故如來藏，是依、是持、是建立。",
        "translation": "Therefore, the tathāgatagarbha is relied upon, maintained, and established.",
        "source": "T12n0353_001:0222b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不離、不斷、不脫、不異、不思議佛法。",
        "translation": "They don't part from, don't stop, don't separate from, don't differ from, and don't conceive of the Buddha's teaching.",
        "source": "T12n0353_001:0222b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷脫異外有為法依持、建立者，是如來藏。",
        "translation": "The one who secludes himself from the support and establishment of different external existences is the Tathāgatagarbha.",
        "source": "T12n0353_001:0222b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0222b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無如來藏者，不得厭苦樂求涅槃。",
        "translation": "If someone doesn't have the tathāgatagarbha, they can't tire of suffering and happiness and seek nirvāṇa.",
        "source": "T12n0353_001:0222b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0222b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此六識及心法智，此七法剎那不住、不種眾苦，不得厭苦、樂求涅槃。",
        "translation": "Regarding these six consciousnesses and the cognition of mind and phenomena, these seven things momentarily don't abide, don't cause suffering, and don't lead to disillusionment with suffering or the happy pursuit of nirvāṇa.",
        "source": "T12n0353_001:0222b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏者，無前際，不起不滅法，種諸苦，得厭苦、樂求涅槃。",
        "translation": "\"The tathāgatagarbha has no prior limit, doesn't arise from unceasing dharmas, and attains the kind of suffering that makes him weary of suffering and happy in the pursuit of nirvāṇa.",
        "source": "T12n0353_001:0222b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0222b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏者，非我、非眾生、非命、非人。",
        "translation": "\"The tathāgatagarbha is not self, not sentient beings, not life, and not person.",
        "source": "T12n0353_001:0222b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏者，墮身見眾生、顛倒眾生、空亂意眾生，非其境界。",
        "translation": "The tathāgatagarbha is not the realm of sentient beings who fall into the view of the body, sentient beings who are mistaken, or sentient beings whose minds are confused by emptiness.",
        "source": "T12n0353_001:0222b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0353_001:0222b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏者，是法界藏、法身藏、出世間上上藏、自性清淨藏。",
        "translation": "\"The tathāgatagarbha is the store of the Dharma realm, the store of the Dharma body, the supreme store of the transmundane world, and the pure store of its own nature.",
        "source": "T12n0353_001:0222b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此性清淨如來藏，而客塵煩惱、上煩惱所染，不思議如來境界。",
        "translation": "This nature is pure as the Tathāgata's store, but it's stained by adventitious afflictions and higher afflictions, so it doesn't conceive of the Tathāgata's realm.",
        "source": "T12n0353_001:0222b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0353_001:0222b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎那善心非煩惱所染；剎那不善心亦非煩惱所染。",
        "translation": "\"A momentarily good mind isn't stained by afflictions, and a momentarily unskillful mind isn't stained by afflictions.",
        "source": "T12n0353_001:0222b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "煩惱不觸心，心不觸煩惱，云何不觸法，而能得染心？",
        "translation": "When the afflictions don't touch the mind and the mind doesn't touch the afflictions, why doesn't it touch things and then attain a defiled mind?",
        "source": "T12n0353_001:0222b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0353_001:0222b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然有煩惱，有煩惱染心，自性清淨心而有染者，難可了知。",
        "translation": "\"Still, it's difficult to understand whether there are afflictions, an afflicted and defiled mind, or a self-natured and pure mind that's defiled.",
        "source": "T12n0353_001:0222b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛世尊！",
        "translation": "Only the Bhagavān!",
        "source": "T12n0353_001:0222b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實眼實智，為法根本、為通達法、為正法依，如實知見。」",
        "translation": "True vision and true knowledge are the root of the Dharma, the principle of understanding the Dharma, and the basis of the right Dharma, as they are truly known and seen.\"",
        "source": "T12n0353_001:0222b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘夫人說是難解之法問於佛時，佛即隨喜：「如是如是！",
        "translation": "When Lady Śrīmālā asked the Buddha about this difficult teaching, the Buddha rejoiced, \"So it is!",
        "source": "T12n0353_001:0222c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自性清淨心而有染污，難可了知。",
        "translation": "\"It's difficult to know when a mind that's intrinsically pure is defiled.",
        "source": "T12n0353_001:0222c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二法難可了知，謂自性清淨心難可了知，彼心為煩惱所染亦難了知。",
        "translation": "There are two things that are difficult to know, namely, that it's difficult to know the mind that's intrinsically pure, and that it's difficult to know the mind that's stained by afflictions.",
        "source": "T12n0353_001:0222c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此二法，汝及成就大法菩薩摩訶薩乃能聽受，諸餘聲聞，唯信佛語。",
        "translation": "These two things can be heard and accepted by you and the bodhisattvas and mahāsattvas who have accomplished the great teaching, while other śrāvakas believe only in the Buddha's words.",
        "source": "T12n0353_001:0222c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真子章第十四",
        "translation": "Chapter 14 of the True Son's Commentary",
        "source": "T12n0353_001:0222c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若我弟子隨信增上者，依明信已隨順法智，而得究竟。",
        "translation": "\"If my disciple follows faith to its highest level, he'll follow the knowledge of the teaching after he has clear faith and attain its ultimate realization.",
        "source": "T12n0353_001:0222c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨順法智者，觀察施設根意解境界；觀察業報；觀察阿羅漢眼；觀察心自在樂禪樂；觀察阿羅漢、辟支佛、大力菩薩聖自在通。",
        "translation": "Those who follow the knowledge of the teaching will observe the objective realm of the designation faculty's mental freedom, observe the results of actions, observe the arhat's eye, observe the mind's unimpeded enjoyment and meditative bliss, and observe the noble and unimpeded abilities of arhats, pratyekabuddhas, and powerful bodhisattvas.",
        "source": "T12n0353_001:0222c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此五種巧便觀成就。",
        "translation": "These five kinds of skillful contemplation are accomplished.",
        "source": "T12n0353_001:0222c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我滅後未來世中，我弟子隨信增上，依於明信隨順法智，自性清淨心彼為煩惱染污而得究竟，是究竟者入大乘道因。",
        "translation": "In the future after I cease, my disciple will increase in faith and rely on clear faith and follow the wisdom of the teaching, and he'll attain the ultimate in a mind that's pure in its own nature and not defiled by afflictions, which is the cause for entering the great vehicle path as an ultimate.",
        "source": "T12n0353_001:0222c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信如來者，有是大利益，不謗深義。」",
        "translation": "This is the great benefit of believing in the Tathāgata, and it doesn't denigrate the profound meaning.\"",
        "source": "T12n0353_001:0222c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，勝鬘白佛言：「更有餘大利益，我當承佛威神復說斯義。」",
        "translation": "It was then that Śrīmālā said to the Buddha, \"There are other great benefits, and I will again explain their meaning in response to the Buddha's authoritative power.\"",
        "source": "T12n0353_001:0222c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「更說。」",
        "translation": "The Buddha said, \"Tell me more.\"",
        "source": "T12n0353_001:0222c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘白佛言：「三種善男子善女人，於甚深義離自毀傷，生大功德、入大乘道。",
        "translation": "Śrīmālā said to the Buddha, \"Three kinds of good sons and good women part with their profound meaning, free from self-mortification, produce great merit, and enter the great vehicle path.",
        "source": "T12n0353_001:0222c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T12n0353_001:0222c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：若善男子善女人自成就甚深法智。",
        "translation": "\"That is, if good sons and good women achieve profound knowledge of the teaching on their own.",
        "source": "T12n0353_001:0222c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子善女人成就隨順法智。",
        "translation": "If good sons and good women accomplish the knowledge of compliant dharmas.",
        "source": "T12n0353_001:0222c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子善女人於諸深法不自了知，仰惟世尊，非我境界，唯佛所知。",
        "translation": "If good sons and good women don't know these profound dharmas for themselves, they look up to the Bhagavān and say, 'This is not my objective realm; it's only known to the Buddha.'",
        "source": "T12n0353_001:0222c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名善男子善女人仰惟如來。",
        "translation": "This is called a good man and a good woman who look up to the Tathāgata.",
        "source": "T12n0353_001:0222c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「除此諸善男子善女人已。",
        "translation": "\"After removing these good men and good women, they'll look up to the Bhagavān, which is not my objective realm but only the Buddha's.",
        "source": "T12n0353_001:0222c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘章第十五",
        "translation": "Śrīmālā Chapter 15",
        "source": "T12n0353_001:0222c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸餘眾生，於諸甚深法，堅著妄說，違背正法，習諸外道腐敗種子者，當以王力及天、龍、鬼神力而調伏之。」",
        "translation": "\"All the other sentient beings who cling to false teachings about the profound Dharma, deviate from the right Dharma, and cultivate the rotten seeds of non-Buddhists will be tamed by the power of the king and the power of gods, dragons, and ghosts.\"",
        "source": "T12n0353_001:0222c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，勝鬘與諸眷屬頂禮佛足。",
        "translation": "At the time, Śrīmālā and her retinue bowed their heads at the Buddha's feet.",
        "source": "T12n0353_001:0223a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉善哉。",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T12n0353_001:0223a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘！",
        "translation": "Śrīmālā!",
        "source": "T12n0353_001:0223a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深法方便守護，降伏非法善得其宜，汝已親近百千億佛，能說此義。」",
        "translation": "You have become intimate with a hundred billion buddhas who are able to explain this meaning after skillfully guarding the profound Dharma and skillfully subduing what's not the Dharma.\"",
        "source": "T12n0353_001:0223a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊放勝光明普照大眾，身昇虛空高七多羅樹，足步虛空還舍衛國。",
        "translation": "The Bhagavān then radiated a brilliant light that shone universally on the great multitude, raised himself up into the sky, reaching seven tāla trees high, and returned to Śrāvastī with his feet in the sky.",
        "source": "T12n0353_001:0223a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，勝鬘夫人與諸眷屬，合掌向佛觀無厭足，目不暫捨。",
        "translation": "At the time, Lady Śrīmālā and her retinue joined their palms together and looked at the Buddha without tire, not letting go of their eyes for a moment.",
        "source": "T12n0353_001:0223a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過眼境已踊躍歡喜，各各稱歎如來功德，具足念佛，還入城中，向友稱王稱歎大乘。",
        "translation": "They rejoiced when they passed beyond the eye's perception, each praised the Tathāgata's merits, fully recollected the Buddha, returned to the city, and praised the great vehicle to their friend, the king.",
        "source": "T12n0353_001:0223a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中女人七歲已上，化以大乘。",
        "translation": "The woman in the city, who was seven years old or older, was transformed into a great vehicle.",
        "source": "T12n0353_001:0223a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "友稱大王亦以大乘化諸男子，七歲已上舉國人民皆向大乘。",
        "translation": "King Youshō also converted the men to the great vehicle, and from the age of seven upward, all the people of the country turned to the great vehicle.",
        "source": "T12n0353_001:0223a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊入祇桓林，告長老阿難及念天帝釋，應時帝釋與諸眷屬忽然而至，住於佛前。",
        "translation": "At the time, the Bhagavān entered the Jetavana Grove and told the elder Ānanda and Nandika Tissa that Tissa and her retinue had suddenly arrived and stayed in front of the Buddha.",
        "source": "T12n0353_001:0223a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊向天帝釋及長老阿難，廣說此經。",
        "translation": "The Bhagavān then spoke extensively about this sūtra to Śakra and Ānanda the Elder.",
        "source": "T12n0353_001:0223a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說已告帝釋言：「汝當受持讀誦此經。",
        "translation": "After speaking, he told Śākyamuni, \"You must retain and recite this sūtra.",
        "source": "T12n0353_001:0223a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T12n0353_001:0223a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子善女人於恒沙劫修菩提行，行六波羅蜜。",
        "translation": "\"Good sons and good women cultivate the practice of enlightenment and perform the six perfections throughout an eon.",
        "source": "T12n0353_001:0223a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復善男子善女人聽受讀誦乃至執持經卷，福多於彼，何況廣為人說？",
        "translation": "If good sons and good women listen, accept, recite, and even hold onto those scrolls, their merit is greater than theirs, so why wouldn't they explain them to others in detail?",
        "source": "T12n0353_001:0223a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故憍尸迦！",
        "translation": "Therefore, Kauśika!",
        "source": "T12n0353_001:0223a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當讀誦此經，為三十三天分別廣說。」",
        "translation": "You must recite this sūtra and explain it in detail for the Trāyastriṃśa gods.\"",
        "source": "T12n0353_001:0223a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告阿難：「汝亦受持讀誦，為四眾廣說。」",
        "translation": "Again, he told Ānanda, \"You must also memorize it, recite it, and explain it in detail to the four groups of people.\"",
        "source": "T12n0353_001:0223a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋白佛言：「世尊！",
        "translation": "Śāriputra then said to the Buddha, \"Bhagavān!",
        "source": "T12n0353_001:0223a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當何名斯經？",
        "translation": "What will be the name of this scripture?",
        "source": "T12n0353_001:0223a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you uphold it?\"",
        "source": "T12n0353_001:0223a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告帝釋：「此經成就無量無邊功德，一切聲聞、緣覺不能究竟觀察知見。",
        "translation": "The Buddha told Śākyamuni, \"This sūtra accomplishes measureless and limitless merit that all śrāvakas and pratyekbuddhas can't completely observe and see.",
        "source": "T12n0353_001:0223a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T12n0353_001:0223a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此經甚深微妙大功德聚，今當為汝略說其名，諦聽諦聽善思念之。」",
        "translation": "You should know that this sūtra is a profound, subtle, and greatly meritorious cluster; now I will explain its title for you in brief; listen closely and well consider it.\"",
        "source": "T12n0353_001:0223a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋及長老阿難白佛言：「善哉世尊！",
        "translation": "Śakra Devānām-Indra and Ānanda the Elder then said to the Buddha, \"Good, Bhagavān!",
        "source": "T12n0353_001:0223a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然受教。」",
        "translation": "Please accept the teaching.\"",
        "source": "T12n0353_001:0223a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此經『歎如來真實第一義功德』，如是受持。",
        "translation": "The Buddha said, \"This sūtra 'praises the true and ultimate merit of the Tathāgata,' and thus accepts it.",
        "source": "T12n0353_001:0223a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『不思議大受』，如是受持。",
        "translation": "'The inconceivable great reception' is thus received and upheld.",
        "source": "T12n0353_001:0223a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『一切願攝大願』，如是受持。",
        "translation": "'The great vow to gather in all wishes' is thus accepted.",
        "source": "T12n0353_001:0223a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說不思議攝受正法』，如是受持。",
        "translation": "'Explains the inconceivable taking in of the right teaching' and thus accepts it.",
        "source": "T12n0353_001:0223b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說入一乘』，如是受持。",
        "translation": "'Explaining entry into the One Vehicle' is thus received and upheld.",
        "source": "T12n0353_001:0223b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說無邊聖諦』，如是受持。",
        "translation": "'Explaining the limitless noble truths' is thus received and upheld.",
        "source": "T12n0353_001:0223b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說如來藏』，如是受持。",
        "translation": "'Explaining the tathāgatagarbha,' and it's thus upheld.",
        "source": "T12n0353_001:0223b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說法身』，如是受持。",
        "translation": "'Explaining the Dharma body' and thus receiving and upholding it.",
        "source": "T12n0353_001:0223b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說空義隱覆真實』，如是受持。",
        "translation": "'Explaining the meaning of emptiness and concealing reality' and thus receive and uphold it.",
        "source": "T12n0353_001:0223b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說一諦』，如是受持。",
        "translation": "'Explaining the single truth' is thus received and upheld.",
        "source": "T12n0353_001:0223b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說常住安隱一依』，如是受持。",
        "translation": "'Speaking of the eternally abiding, peaceful, and single basis,' and it is thus upheld.",
        "source": "T12n0353_001:0223b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說顛倒真實』，如是受持。",
        "translation": "'Speaking of the reality of error,' and it's thus upheld.",
        "source": "T12n0353_001:0223b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說自性清淨心隱覆』，如是受持。",
        "translation": "'It's called the concealment of the naturally pure mind,' and it's thus upheld.",
        "source": "T12n0353_001:0223b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說如來真子』，如是受持。",
        "translation": "'It's called the true son of the Tathāgata,' and it's thus received and upheld.",
        "source": "T12n0353_001:0223b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『說勝鬘夫人師子吼』，如是受持。",
        "translation": "'He spoke of the Śrīmālā-svara's lion's roar,' and thus received it.",
        "source": "T12n0353_001:0223b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T12n0353_001:0223b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經所說斷一切疑，決定了義入一乘道。",
        "translation": "This sūtra explains that it ends all doubt and enters the One Vehicle path with certainty of its meaning.",
        "source": "T12n0353_001:0223b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T12n0353_001:0223b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今以此說勝鬘夫人師子吼經付囑於汝，乃至法住，受持讀誦，廣分別說。」",
        "translation": "I hereby entrust this sutra on the Śrīmālādevī's lion's roar to you, up to the abiding of the Dharma, to memorize it, recite it, and explain it in detail.\"",
        "source": "T12n0353_001:0223b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝釋白佛言：「善哉世尊！",
        "translation": "Tīrṣa said to the Buddha, \"Good, Bhagavān!",
        "source": "T12n0353_001:0223b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頂受尊教。」",
        "translation": "Take your hat off to the top of your head and accept the venerable teaching.\"",
        "source": "T12n0353_001:0223b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋、長老阿難，及諸大會，天、人、阿修羅、乾闥婆等，聞佛所說，歡喜奉行。",
        "translation": "When the god Śakra, the elder Ānanda, and the various assemblies of gods, humans, asuras, and gandharvas heard what the Buddha taught, they rejoiced and handed it down.",
        "source": "T12n0353_001:0223b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘師子吼一乘大方便方廣經",
        "translation": "Śrīmālā Shizihao yisheng dafangguang jing",
        "source": "T12n0353_001:0223b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(茨田、宿禰、安麻呂，七世父母、現在父母、六親眷屬，一切無邊法界眾生，誓願仕奉。",
        "translation": "(Tsuda, the archives of his predecessors, Anmaru, his seven parents, his present parents, his sixth blood relative, and all the sentient beings of the limitless Dharma realm, vow to serve them.",
        "source": "T12n0353_001:0223b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": ")",
        "translation": ")",
        "source": "T12n0353_001:0223b17_1",
        "is_bad_quality": false
    }
]