[
    {
        "source_sentence": "大般涅槃經卷第二",
        "translation": "Mahāparinirvāṇa-sūtra, Vol. 2",
        "source": "T12n0374_002:0371c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Translated by the Tripiṭaka of Northern Liang and India, Dharmakṣema",
        "source": "T12n0374_002:0371c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽命品第一之二",
        "translation": "Second of the First Class of Life",
        "source": "T12n0374_002:0371c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中有優婆塞，是拘尸那城工巧之子，名曰純陀，與其同類十五人俱。",
        "translation": "At the time, there was an upāsaka, an artisan son of Kuśinagara named Cunda, who was with fifteen others of his kind.",
        "source": "T12n0374_002:0371c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令世間得善果故，捨身威儀，從座而起，偏袒右肩，右膝著地，合掌向佛，悲泣墮淚，頂禮佛足，而白佛言：「唯願世尊及比丘僧，哀受我等最後供養，為度無量諸眾生故。",
        "translation": "In order to bring about good results in the world, he abandoned his body and deportment, got up from his seat, bared his right shoulder, knelt on his right knee, put his palms together and bowed his head to the Buddha's feet with tears of pity, and said to the Buddha, \"Please accept our final offerings, Bhagavān and the monks, for the sake of liberating measureless sentient beings.",
        "source": "T12n0374_002:0371c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0371c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等從今無主、無親、無救、無護、無歸、無趣、貧窮飢困，欲從如來求將來食，唯願哀愍，受我微供，然後乃入於般涅槃。",
        "translation": "From now on, we have no lord, no relatives, no rescue, no protection, no refuge, no destination, and are poor and hungry, and we want to seek future food from the Tathāgata, so please have mercy on us and accept my humble offerings before we enter parinirvāṇa.",
        "source": "T12n0374_002:0371c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0371c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如剎利、若婆羅門、毘舍、首陀，以貧窮故，遠至他國，役力農作，得好調牛，良田平正，無諸沙鹵、惡草、株杌，唯悕天雨。",
        "translation": "It's like a warrior, a brāhmaṇa, a piśāca, or a śūdra who, because of poverty, travels to another country, works hard at farming, attains well-adjusted oxen, and their fertile fields are level, free of chaff, bad grass, and stubble, and they only hope for rain from heaven.",
        "source": "T12n0374_002:0371c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言調牛者，喻身口七。",
        "translation": "The expression \"well-trained oxen\" refers to seven physical and verbal metaphors.",
        "source": "T12n0374_002:0371c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "良田平正，喻於智慧。",
        "translation": "The good fields are level and correct, which is a metaphor for wisdom.",
        "source": "T12n0374_002:0371c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除去沙鹵、惡草、株杌，喻除煩惱。",
        "translation": "Removing sand, marsh, bad grass, and stumps is a metaphor for removing afflictions.",
        "source": "T12n0374_002:0371c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0371c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今身有調牛、良田、除去株杌，唯悕如來甘露法雨。",
        "translation": "Now, I have a cow, a fertile field, and a stump to remove, but I only need the Tathāgata's nectar and Dharma rain.",
        "source": "T12n0374_002:0371c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貧四姓者，即我身是，貧於無上法之財寶。",
        "translation": "The poor four families, which are myself, are poor in the unsurpassed treasures of the Dharma.",
        "source": "T12n0374_002:0371c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願哀愍，除斷我等貧窮困苦，拯及無量苦惱眾生。",
        "translation": "Please have compassion on them, remove our poverty and hardship, and save measureless suffering sentient beings.",
        "source": "T12n0374_002:0371c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今所供，雖復微少，冀得充足如來大眾。",
        "translation": "Although my present offering is modest, I hope it will suffice for the Tathāgata's great multitude.",
        "source": "T12n0374_002:0372a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今無主、無親、無歸，願垂矜愍，如羅睺羅。」",
        "translation": "Now, I have no lord, no relatives, and no refuge, so please have compassion on me, like Rāhula.\"",
        "source": "T12n0374_002:0372a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊、一切種智、無上調御，告純陀曰：「善哉，善哉！",
        "translation": "It was then that the Bhagavān, possessor of omniscience and unsurpassed controller, addressed Cunda, \"Good, good!",
        "source": "T12n0374_002:0372a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今為汝除斷貧窮，無上法雨雨汝身田，令生法芽。",
        "translation": "Now, I'll remove poverty for you and rain the unsurpassed Dharma down on your physical field, causing the sprouts of the Dharma to arise.",
        "source": "T12n0374_002:0372a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今於我，欲求壽命、色力、安、辯，我當施汝常命、色力、安、無礙辯。",
        "translation": "Now, if you want life, form, strength, peace, and eloquence from me, I will give you everlasting life, form, strength, peace, and unhindered eloquence.",
        "source": "T12n0374_002:0372a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0372a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀！",
        "translation": "Sundarī!",
        "source": "T12n0374_002:0372a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施食有二，果報無差。",
        "translation": "There are two kinds of food giving, and the results are not different.",
        "source": "T12n0374_002:0372a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are the two?",
        "source": "T12n0374_002:0372a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者受已，得阿耨多羅三藐三菩提；二者受已，入於涅槃。",
        "translation": "One, after accepting it, you'll attain supreme perfect enlightenment; the other, after accepting it, you'll enter nirvāṇa.",
        "source": "T12n0374_002:0372a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今受汝最後供養，令汝具足檀波羅蜜。」",
        "translation": "Now, I'll accept your final offering so that you'll fully attain the perfection of the perfection of giving.\"",
        "source": "T12n0374_002:0372a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀即白佛言：「如佛所說，二施果報無差別者，是義不然。",
        "translation": "It was then that Cunda said to the Buddha, \"Just as the Buddha said, 'There's no difference between the rewards of two kinds of generosity,' but that doesn't mean that.",
        "source": "T12n0374_002:0372a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0372a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先受施者，煩惱未盡，未得成就一切種智，亦未能令眾生具足檀波羅蜜；後受施者，煩惱已盡，已得成就一切種智，能令眾生普得具足檀波羅蜜。",
        "translation": "When someone first receives alms, their afflictions have not yet ended, they haven't yet attained omniscience, and they haven't been able to cause sentient beings to fully possess the perfection of the perfection of giving; when someone later receives alms, their afflictions have ended, they've attained omniscience, and they can cause sentient beings to fully possess the perfection of the perfection of giving.",
        "source": "T12n0374_002:0372a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先受施者，直是眾生；後受施者，是天中天。",
        "translation": "The person who first receives the gift is simply a sentient being, and the person who later receives the gift is a god of gods.",
        "source": "T12n0374_002:0372a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先受施者，是雜食身、煩惱之身、是後邊身、是無常身；後受施者，無煩惱身、金剛之身、法身、常身、無邊之身。",
        "translation": "Those who first receive alms are the body of mixed food, the body of affliction, the body of the latter end, and the body of impermanence, while those who later receive alms are the body without affliction, the adamantine body, the Dharma body, the permanent body, and the body of the infinite.",
        "source": "T12n0374_002:0372a16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何而言，二施果報等無差別？",
        "translation": "How are the rewards of these two kinds of generosity equally and without distinction?",
        "source": "T12n0374_002:0372a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先受施者，未能具足檀波羅蜜乃至般若波羅蜜，唯得肉眼，未得佛眼乃至慧眼；後受施者，已得具足檀波羅蜜乃至般若波羅蜜，具足佛眼乃至慧眼。",
        "translation": "Someone who first receives an offering hasn't fully attained the perfection of the perfection of giving or the perfection of wisdom, and has only attained the physical eye but not the Buddha's eye or even the eye of wisdom; someone who later receives an offering has fully attained the perfection of the perfection of giving or the perfection of wisdom and the perfection of the Buddha's eye or even the eye of wisdom.",
        "source": "T12n0374_002:0372a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何而言二施果報等無差別？",
        "translation": "How can it be said that the rewards of these two kinds of generosity are equally without distinction?",
        "source": "T12n0374_002:0372a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0372a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先受施者，受已食噉，入腹消化，得命、得色、得力、得安、得無礙辯；後受施者，不食、不消、無五事果；云何而言二施果報等無差別？」",
        "translation": "When a person first receives an offering, they eat and bite it, digest it in their belly, and attain life, form, strength, security, and unobstructed discernment; when a person later receives an offering, they don't eat, don't consume, and don't have the five effects; how can you say that the results of these two kinds of giving are equally without distinction?\"",
        "source": "T12n0374_002:0372a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T12n0374_002:0372a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來已於無量無邊阿僧祇劫，無有食身、煩惱之身，無後邊身，常身、法身、金剛之身。",
        "translation": "For an incalculably long and unlimited number of incalculably long eons, the Tathāgata has had no body of food, no body of affliction, no subsequent body, and a body that's permanent, Dharma body, and adamantine body.",
        "source": "T12n0374_002:0372a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子，未見佛性者，名煩惱身、雜食之身，是後邊身。",
        "translation": "Good sons, someone who has yet to see the buddha-nature is called the body of affliction and the body of mixed food, which is the latter part of the body.",
        "source": "T12n0374_002:0372a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時受飲食已，入金剛三昧，此食消已，即見佛性，得阿耨多羅三藐三菩提，是故我言，二施果報等無差別。",
        "translation": "After receiving food and drink, the bodhisattva then enters adamantine concentration, and once this food has gone, he sees the buddha-nature and attains unsurpassed, correct enlightenment.",
        "source": "T12n0374_002:0372b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時破壞四魔，今入涅槃，亦破四魔，是故我言二施果報等無差別。",
        "translation": "At the time, the bodhisattva had destroyed the four Māras, and now that he's entered nirvāṇa, he's also destroyed the four Māras; therefore, I say that there's no difference between the two rewards of generosity.",
        "source": "T12n0374_002:0372b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時雖不廣說十二部經，先已通達，今入涅槃，廣為眾生分別演說，是故我言二施果報等無差別。",
        "translation": "Although the bodhisattva didn't explain the 12 sutras in detail at the time, he had already comprehended them and now that he's entered nirvāṇa, he explains them in detail for sentient beings, so I say that there's no distinction between the two rewards of generosity.",
        "source": "T12n0374_002:0372b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_002:0372b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來之身，已於無量阿僧祇劫不受飲食。",
        "translation": "The Tathāgata himself hadn't eaten or dined for measureless incalculable eons.",
        "source": "T12n0374_002:0372b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸聲聞說言，先受難陀、難陀波羅二牧牛女所奉乳糜，然後乃得阿耨多羅三藐三菩提；我實不食。",
        "translation": "He said for the śrāvakas, 'First, I accepted the offerings of milk from the cowherd girls Nandha and Nandapāla, and then I attained unsurpassed, correct enlightenment; I really didn't eat.",
        "source": "T12n0374_002:0372b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今為於此會大眾，是故受汝最後所奉；實亦不食。」",
        "translation": "Now, for the sake of this assembly, I therefore accept your last offering; indeed, I won't eat it either.\"",
        "source": "T12n0374_002:0372b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾聞佛世尊，普為大會受於純陀最後供養，歡喜踊躍同聲讚言：「善哉，善哉！",
        "translation": "When the people then heard that the Bhagavān had accepted Cunda's final offering for the entire assembly, they rejoiced and jumped for joy, saying with one voice, \"Good, good!",
        "source": "T12n0374_002:0372b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有純陀！",
        "translation": "I wish there were a Cunda!",
        "source": "T12n0374_002:0372b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今立字，名不虛稱。",
        "translation": "Now, you've created a name, and it's not a false one.",
        "source": "T12n0374_002:0372b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言純陀者，名解妙義。",
        "translation": "He who says pūrṇa is called 'understanding the marvelous meaning.'",
        "source": "T12n0374_002:0372b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今建立如是大義，是故依實從義立名，故名純陀。",
        "translation": "Now that you've established such a great meaning, you've based your name on its true meaning, and therefore you've called it Cunda.",
        "source": "T12n0374_002:0372b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今現世得大名利，德願滿足。",
        "translation": "Now, in the present life, you've attained great fame and fortune, and your virtues and vows have been fulfilled.",
        "source": "T12n0374_002:0372b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚奇純陀！",
        "translation": "How marvelous, Cunda!",
        "source": "T12n0374_002:0372b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生在人中，復得難得無上之利。",
        "translation": "\"Born among humans, it's again difficult to attain unsurpassed benefit.",
        "source": "T12n0374_002:0372b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉純陀！",
        "translation": "Good, Cunda!",
        "source": "T12n0374_002:0372b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如優曇花世間希有，佛出於世亦復甚難，值佛生信聞法復難，佛臨涅槃最後供養，能辦是事復難於是。",
        "translation": "Like the udumbara flower, which is rare in the world, it's also very difficult for a Buddha to appear in the world, difficult to meet a Buddha who gives rise to faith and hears the teaching, and difficult to perform this final offering as the Buddha approaches nirvāṇa.",
        "source": "T12n0374_002:0372b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南無純陀，南無純陀！",
        "translation": "Homage to Cunda, homage to Cunda!",
        "source": "T12n0374_002:0372b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今已具檀波羅蜜，猶如秋月，十五日夜，清淨圓滿，無諸雲翳，一切眾生無不瞻仰；汝亦如是，而為我等之所瞻仰。",
        "translation": "\"Now that you've perfected the perfection of giving, you're like the autumn moon, which is pure and full on the fifteenth day and night, without clouds or obscuration, and which all sentient beings don't fail to look up to; so you are, too, and you're looked up to by us.",
        "source": "T12n0374_002:0372b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛已受汝最後供養，令汝具足檀波羅蜜。",
        "translation": "The Buddha has accepted your final offerings and made them complete in the perfection of the perfection of giving.",
        "source": "T12n0374_002:0372b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南無純陀！",
        "translation": "Homage to Cunda!",
        "source": "T12n0374_002:0372b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說汝如月盛滿，一切眾生無不瞻仰。",
        "translation": "Therefore, you're said to be like the full moon, which all sentient beings look up to.",
        "source": "T12n0374_002:0372b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南無純陀！",
        "translation": "Homage to Cunda!",
        "source": "T12n0374_002:0372b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖受人身，心如佛心。",
        "translation": "Although I've received a human body, my mind is like a Buddha's mind.",
        "source": "T12n0374_002:0372b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今純陀，真是佛子，如羅睺羅，等無有異。」",
        "translation": "Now, you, Cunda, are truly a son of the Buddha, just like Rāhula, and there's nothing different about you.\"",
        "source": "T12n0374_002:0372b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾即說偈言：「汝雖生人道，　　已超第六天，　我及一切眾，　　今故稽首請。",
        "translation": "It was then that the crowd spoke the verse, saying, \"Although you were born on the path and have surpassed the sixth heaven, we and all the others now bow our heads and invite you to come.",
        "source": "T12n0374_002:0372b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人中最勝尊，　　今當入涅槃，　汝應愍我等，　　唯願速請佛，　久住於世間，　　利益無量眾，　演說智所讚，　　無上甘露法。",
        "translation": "Most honored among men, you will now enter nirvāṇa, so you should pity us and ask the Buddha to quickly abide in the world for a long time, benefit measureless multitudes, and teach the Dharma of unsurpassed nectar that's praised by wisdom.",
        "source": "T12n0374_002:0372c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝若不請佛，　　我命將不全，　是故應見為，　　稽請調御師。」",
        "translation": "If you don't invite the Buddha, my life will be incomplete; therefore, you should see fit to invite the tamer.\"",
        "source": "T12n0374_002:0372c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀歡喜踊躍，譬如有人，父母卒喪忽然還活，純陀歡喜亦復如是，復起禮佛，而說偈言：「快哉獲己利，　　善得於人身，　蠲除貪恚等，　　永離三惡道。",
        "translation": "It was then that Cunda rejoiced and jumped up and down like a person whose parents had died and suddenly returned to life. Cunda was likewise delighted, rising again to pay homage to the Buddha and speaking in verse, \"It's wonderful to have gained my own benefit, to have well attained my person, to have freed myself from craving and ill-will, and to have permanently escaped the three bad destinies.",
        "source": "T12n0374_002:0372c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　快哉獲己利，　　遇得金寶聚，　值遇調御師，　　不懼墮畜生。",
        "translation": "It's wonderful to gain my own benefit, to meet a heap of gold and treasure, to meet a master who tames me, and not to fear falling into the animal kingdom.",
        "source": "T12n0374_002:0372c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛如優曇花，　　值遇生信難，　遇已種善根，　　永離餓鬼苦，　亦復能損減，　　阿修羅種類。",
        "translation": "The Buddha is like the udumbara flower, which is difficult to encounter and gives rise to faith, plants good roots after encountering it, permanently escapes the suffering of hungry ghosts, and also diminishes the type of asuras.",
        "source": "T12n0374_002:0372c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　芥子投針鋒，　　佛出難於是，　我以具足檀，　　度人天生死。",
        "translation": "A mustard seed throws a needle into the blade, but it's difficult for the Buddha to escape, so I use the perfect sandalwood to save humans and gods from birth and death.",
        "source": "T12n0374_002:0372c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛不染世法，　　如蓮花處水，　善斷有頂種，　　永度生死流。",
        "translation": "The Buddha is undefiled by worldly phenomena, like a lotus flower in water, and he skillfully ends the topsy-turvy seeds and permanently saves the flow of birth-and-death.",
        "source": "T12n0374_002:0372c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生世為人難，　　值佛世亦難，　猶如大海中，　　盲龜遇浮孔。",
        "translation": "It's difficult to be born into the world as a human being, and it's also difficult to meet a buddha in the world, like a blind turtle in the ocean that meets a floating hole.",
        "source": "T12n0374_002:0372c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今所奉食，　　願得無上報，　一切煩惱結，　　摧破不堅牢。",
        "translation": "Now, I've offered food, wishing to attain the unsurpassed reward, and all the bonds of affliction are broken down and not firmly held.",
        "source": "T12n0374_002:0372c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今於此處，　　不求天人身，　設使得之者，　　心亦不甘樂。",
        "translation": "Now, I'm here, not seeking a heavenly existence, but even if I could get one, my heart wouldn't be happy.",
        "source": "T12n0374_002:0372c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來受我供，　　歡喜無有量，　猶如伊蘭花，　　出於栴檀香。",
        "translation": "The Tathāgata accepts my offerings, and his joy is immeasurable, like the flower of the elysian orchid that produces the fragrance of sandalwood.",
        "source": "T12n0374_002:0372c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我身如伊蘭，　　如來受我供，　如出栴檀香，　　是故我歡喜。",
        "translation": "My body is like an elysia, and the Tathāgata accepts my offerings like the fragrance of sandalwood that comes forth; therefore, I rejoice.",
        "source": "T12n0374_002:0373a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今得現報，　　最勝上妙處，　釋梵諸天等，　　悉來供養我。",
        "translation": "Now I've attained a present reward, the most excellent and marvelous place, and the gods of Indra and Brahmā have all come to pay their respects to me.",
        "source": "T12n0374_002:0373a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸世間，　　悉生諸苦惱，　以知佛世尊，　　欲入於涅槃。",
        "translation": "All the worlds are filled with suffering and distress, knowing that the Bhagavān wishes to enter nirvāṇa.",
        "source": "T12n0374_002:0373a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　高聲唱是言，　　世間無調御，　不應捨眾生，　　應視如一子。",
        "translation": "He shouts this saying, \"The world is not disciplined, so don't abandon sentient beings; consider them as a single child.",
        "source": "T12n0374_002:0373a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來在僧中，　　演說無上法，　如須彌寶山，　　安處于大海。",
        "translation": "The Tathāgata is among the saṃgha, expounding the unsurpassed Dharma like Sumeru's jeweled mountain, sitting comfortably in the ocean.",
        "source": "T12n0374_002:0373a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛智能善斷，　　我等無明闇，　猶如虛空中，　　起雲得清涼。",
        "translation": "The Buddha's wisdom skillfully ends the darkness of our ignorance, just like clouds in the sky that arise and become cool.",
        "source": "T12n0374_002:0373a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來能善除，　　一切諸煩惱，　猶如日出時，　　除雲光普照。",
        "translation": "The Tathāgata skillfully removes all afflictions like when the sun rises and removes clouds of light that shine everywhere.",
        "source": "T12n0374_002:0373a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是諸眾生等，　　啼泣面目腫，　悉皆為生死，　　苦水之所漂。",
        "translation": "All these sentient beings, weeping and with swollen faces, are all born and die and drift in the waters of suffering.",
        "source": "T12n0374_002:0373a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以是故世尊，　　應長眾生信，　為斷生死苦，　　久住於世間。」",
        "translation": "Therefore, the Bhagavān should nurture the faith of sentient beings and make them abide in the world for a long time in order to end the suffering of birth-and-death.\"",
        "source": "T12n0374_002:0373a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告純陀：「如是如是，如汝所說。",
        "translation": "The Buddha told Cunda, \"So it is, just as you've said.",
        "source": "T12n0374_002:0373a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛出世難如優曇花，值佛生信亦復甚難，佛臨涅槃最後施食，能具足檀復倍甚難。",
        "translation": "The Buddha's appearance in the world is as difficult as the udumbara flower, and it's even more difficult to meet the Buddha and give him faith, and it's even more difficult to complete the offering of alms at the end of his nirvāṇa.",
        "source": "T12n0374_002:0373a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今純陀！",
        "translation": "Now, you, Cunda!",
        "source": "T12n0374_002:0373a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫大愁苦，應生踊躍，喜自慶幸，得值最後供養如來，成就具足檀波羅蜜，不應請佛久住於世。",
        "translation": "Don't be so sad and distressed that you should rise up and rejoice, rejoicing in the happiness of having met the Tathāgata as your final offering and having accomplished the perfection of the perfection of giving, that you shouldn't ask the Buddha to stay in the world for a long time.",
        "source": "T12n0374_002:0373a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當觀諸佛境界，悉皆無常，諸行性相，亦復如是。",
        "translation": "Now, you should examine the buddha-realms, which are all impermanent, and the nature and characteristics of all conditioned things, which are likewise.",
        "source": "T12n0374_002:0373a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即為純陀而說偈言：「一切諸世間，　　生者皆歸死，　壽命雖無量，　　要必當有盡。",
        "translation": "He spoke a verse for Cunda, saying, \"All worlds in which people are born all return to death, and although their lifespan is limitless, it will surely come to an end.",
        "source": "T12n0374_002:0373a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　夫盛必有衰，　　合會有別離，　壯年不久停，　　盛色病所侵，　命為死所吞，　　無有法常者。",
        "translation": "When someone is prosperous, there's decay, union is separated, prime years soon stop, prosperity is attacked by illness, and life is swallowed up by death; there's no such thing as permanence.",
        "source": "T12n0374_002:0373a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸王得自在，　　勢力無等雙，　一切皆遷動，　　壽命亦如是。",
        "translation": "Kings attain mastery over their power, have unequalled strength, and all things move, so does their life span.",
        "source": "T12n0374_002:0373b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾苦輪無際，　　流轉無休息，　三界皆無常，　　諸有無有樂。",
        "translation": "The wheel of suffering knows no limit, it transmigrates without rest, the three realms are all impermanent, and there's no happiness in all existence.",
        "source": "T12n0374_002:0373b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有道本性相，　　一切皆空無，　可壞法流轉，　　常有憂患等。",
        "translation": "The original nature and characteristics of the path are empty and nonexistent, the Dharma is corruptible, transmigration is continuous, and there's always sorrow and trouble.",
        "source": "T12n0374_002:0373b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恐怖諸過惡，　　老病死衰惱，　是諸無有邊，　　易壞怨所侵。",
        "translation": "Fears of evil, old age, illness, death, and decay are limitless, and are easily destroyed by enemies.",
        "source": "T12n0374_002:0373b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　煩惱所纏裹，　　猶如蠶處繭，　何有智慧者，　　而當樂是處？",
        "translation": "Entangled by affliction, they're like a silkworm's cocoon, so why should a wise person be happy in this place?",
        "source": "T12n0374_002:0373b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此身苦所集，　　一切皆不淨，　扼縛癰瘡等，　　根本無義利。",
        "translation": "This body is a collection of suffering, all of which are impure, such as fetters and abscesses, and so forth, which have no meaning at all.",
        "source": "T12n0374_002:0373b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　上至諸天身，　　皆亦復如是，　諸欲皆無常，　　故我不貪著。",
        "translation": "Up to the bodies of the gods, they're all likewise, and all desires are impermanent, so I don't cling to them.",
        "source": "T12n0374_002:0373b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離欲善思惟，　　而證於真實，　究竟斷有者，　　今日當涅槃。",
        "translation": "I'm free of desire and well-considered, and I've realized the truth, that I've completely ended existence and will attain nirvāṇa today.",
        "source": "T12n0374_002:0373b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我度有彼岸，　　已得過諸苦，　是故於今者，　　純受上妙樂。",
        "translation": "Having crossed to the other side of existence, I've already surpassed suffering, so now I'll simply experience the highest, most sublime happiness.",
        "source": "T12n0374_002:0373b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以是因緣故，　　證無戲論邊，　永斷諸纏縛，　　今日入涅槃。",
        "translation": "Because of this cause and condition, I've realized the limit of no conceptualization, permanently ended all fetters, and today I'll enter nirvāṇa.",
        "source": "T12n0374_002:0373b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我無老病死，　　壽命不可盡，　我今入涅槃，　　猶如大火滅。",
        "translation": "I have no old age, illness, or death, and my life span is inexhaustible; my entry into nirvāṇa now is like the extinction of a great fire.",
        "source": "T12n0374_002:0373b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　純陀汝不應，　　思量如來義，　當觀如來住，　　猶如須彌山。",
        "translation": "\"Cunda, you shouldn't contemplate the meaning of the Tathāgata, for you should observe that the Tathāgata abides just like Mount Sumeru.",
        "source": "T12n0374_002:0373b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今入涅槃，　　受於第一樂，　諸佛法如是，　　不應復啼哭。」",
        "translation": "Now that I've entered nirvāṇa, I'll experience the highest bliss, for thus are the teachings of the buddhas, and I shouldn't again lament.\"",
        "source": "T12n0374_002:0373b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀白佛言：「世尊！",
        "translation": "It was then that Cunda said to the Buddha, \"Bhagavān!",
        "source": "T12n0374_002:0373b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，誠如聖教。",
        "translation": "\"So it is, just like the noble teaching.",
        "source": "T12n0374_002:0373b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今所有智慧微淺猶如蚊虻，何能思議如來涅槃深奧之義？",
        "translation": "Now, my wisdom is as shallow as a gnat, so how could I possibly contemplate the profound meaning of the Tathāgata's nirvāṇa?",
        "source": "T12n0374_002:0373b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0373c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今已與諸大龍象菩薩摩訶薩，斷諸結漏文殊師利法王子等。",
        "translation": "\"Now, I've been with the great dragon-elephant bodhisattvas and mahāsattvas, the Dharma Prince Mañjuśrī, and so forth, who have ended the bonds and contaminants.",
        "source": "T12n0374_002:0373c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0373c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如幼年初得出家，雖未受具即墮僧數。",
        "translation": "\"It's like a young person who first leaves home, though he's not yet ordained, and then he falls into the saṃgha category.",
        "source": "T12n0374_002:0373c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，以佛菩薩神通力故，得在如是大菩薩數。",
        "translation": "I, too, have attained such a large number of bodhisattvas because of the Buddha's and bodhisattva's supernormal powers.",
        "source": "T12n0374_002:0373c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我今，欲令如來，久住於世，不入涅槃。",
        "translation": "Now, therefore, I want the Tathāgata to remain in the world for a long time and not enter nirvāṇa.",
        "source": "T12n0374_002:0373c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如飢人，終無變吐；願使世尊亦復如是，常住於世，不入涅槃。」",
        "translation": "Like a hungry person who never vomits, may the Bhagavān likewise remain in the world and not enter nirvāṇa.\"",
        "source": "T12n0374_002:0373c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利法王子告純陀言：「純陀！",
        "translation": "It was then that Mañjuśrī, the Dharma Prince, addressed Cunda and said, \"Cunda!",
        "source": "T12n0374_002:0373c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今不應發如是言，欲使如來常住於世，不般涅槃，如彼飢人無所變吐。",
        "translation": "Now, you shouldn't say, 'Do you want the Tathāgata to remain in the world and not [enter] parinirvāṇa, like a starving man who has nothing to change?'",
        "source": "T12n0374_002:0373c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當觀諸行性相，如是觀行具空三昧，欲求正法應如是學。」",
        "translation": "Now, you must examine the nature and characteristics of conditioned phenomena, thus observe the practice of the concentration of emptiness, and thus train if you want to pursue the right teaching.\"",
        "source": "T12n0374_002:0373c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀問言：「文殊師利！",
        "translation": "Cunda asked, \"Mañjuśrī!",
        "source": "T12n0374_002:0373c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫如來者，天上人中最尊最勝，如是如來，豈是行耶？",
        "translation": "\"Is the Tathāgata, the most honored and most excellent among men in heaven, such a Tathāgata, a practitioner?",
        "source": "T12n0374_002:0373c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是行者，為生滅法。",
        "translation": "\"If this is the practice, it's the law of arising and ceasing.",
        "source": "T12n0374_002:0373c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如水泡，速起速滅，往來流轉，猶如車輪，一切諸行亦復如是。",
        "translation": "Like a water bubble that quickly arises and ceases and flows back and forth like a chariot wheel, so too do all conditioned things.",
        "source": "T12n0374_002:0373c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞諸天，壽命極長，云何世尊是天中天，壽命更促不滿百年？",
        "translation": "I've heard that the lifespan of gods is extremely long, but how is it that the Bhagavān is a god of gods whose lifespan isn't longer than a hundred years?",
        "source": "T12n0374_002:0373c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如聚落主，勢得自在，以自在力，能制他人，是人福盡，其後貧賤，人所輕蔑，為他策使。",
        "translation": "Suppose a village elder attains mastery over his power and is able to restrain others with his mastery; this person's fortune is ended, and he later becomes poor and disadvantaged, is despised by people, and is subject to the guidance of others.",
        "source": "T12n0374_002:0373c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0373c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "失勢力故。",
        "translation": "That's because they've lost their momentum.",
        "source": "T12n0374_002:0373c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊亦爾，同於諸行，同諸行者，則不得稱為天中天。",
        "translation": "Similarly, the Bhagavān, those who share the same practices and those who share the same actions can't be called gods of gods.",
        "source": "T12n0374_002:0373c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0373c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸行即是生死法故。",
        "translation": "\"Actions are therefore the law of birth-and-death.",
        "source": "T12n0374_002:0373c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故文殊！",
        "translation": "Therefore, Mañjuśrī!",
        "source": "T12n0374_002:0373c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿觀如來同於諸行。",
        "translation": "\"Don't observe that the Tathāgata is the same as all the others in terms of practice.",
        "source": "T12n0374_002:0373c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次文殊！",
        "translation": "\"Furthermore, Mañjuśrī!",
        "source": "T12n0374_002:0373c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為知而說、不知而說，而言如來同於諸行？",
        "translation": "Does the Tathāgata speak knowingly and without knowing, saying that the Tathāgata is the same as all the practices?",
        "source": "T12n0374_002:0373c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使如來同諸行者，則不得言於三界中，為天中天、自在法王。",
        "translation": "Suppose the Tathāgata shared these practices, then he wouldn't be able to say that he's a god of gods or a sovereign king of the Dharma in the three realms.",
        "source": "T12n0374_002:0373c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如人王，有大力士，其力當千，更無有能降伏之者，故稱此人一人當千。",
        "translation": "Suppose there's a great man, a king of men, whose strength is equal to a thousand, and there's no one else who can subdue him, so he's called a man who's equal to a thousand.",
        "source": "T12n0374_002:0373c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是力士，王所愛念，偏賜爵祿，封賞自然。",
        "translation": "Such a strong man is beloved by the king, who favors him with titles and rewards that come naturally.",
        "source": "T12n0374_002:0373c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以得稱當千人者，是人未必力敵於千，但以種種伎藝所能能勝千故，故稱當千。",
        "translation": "That's why they're called a man who's equal to a thousand people because he might not necessarily be equal to a thousand in strength, but he's called equal to a thousand because of the various techniques he's capable of performing that are superior to a thousand.",
        "source": "T12n0374_002:0373c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾，降煩惱魔、陰魔、天魔、死魔，是故如來名三界尊，如彼力士一人當千。",
        "translation": "So too, the Tathāgata subdues the demons of affliction, the demons of the aggregates, the demons of heaven, and the demons of death; therefore, the Tathāgata is called the honored one of the three realms, like that one strong man who's equal to a thousand.",
        "source": "T12n0374_002:0373c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，成就具足種種無量真實功德，故稱如來、應、正遍知。",
        "translation": "Because of these causes and conditions, he has attained the full range of measureless and true virtues, and therefore is called the Tathāgata, Worthy, and Perfectly Omniscient.",
        "source": "T12n0374_002:0374a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今不應憶想分別，以如來法同於諸行。",
        "translation": "Now, you shouldn't remember, conceive, or discriminate, because the Tathāgata's teaching is the same as all the practices.",
        "source": "T12n0374_002:0374a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如巨富長者生子，相師占之有短壽相。",
        "translation": "It's like when a wealthy man gives birth to a son and a fortune teller divines that he has a short life expectancy.",
        "source": "T12n0374_002:0374a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母聞已，知其不任紹繼家嗣，不復愛重，視如芻草。",
        "translation": "When his parents hear this, they know he won't be able to carry on the family's legacy, so they don't respect him anymore and treat him like regurgitated grass.",
        "source": "T12n0374_002:0374a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫短壽者，不為沙門、婆羅門等男女大小之所敬念。",
        "translation": "Someone with a short life expectancy won't be respected by ascetics, priests, or other men and women of large or small size.",
        "source": "T12n0374_002:0374a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使如來同諸行者，亦復不為一切世間人天眾生之所奉敬，如來所說不變、不異、真實之法亦無受者。",
        "translation": "If the Tathāgata shared those practices, he wouldn't be worshipped by all worldly beings, and there would be no one to accept the Tathāgata's teaching that's unchanging, non-different, and true.",
        "source": "T12n0374_002:0374a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故文殊！",
        "translation": "Therefore, Mañjuśrī!",
        "source": "T12n0374_002:0374a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應說言如來同於一切諸行。",
        "translation": "You shouldn't say that the Tathāgata is the same as all things that are practiced.",
        "source": "T12n0374_002:0374a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次文殊！",
        "translation": "\"Furthermore, Mañjuśrī!",
        "source": "T12n0374_002:0374a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如貧女，無有居家救護之者，加復病苦飢渴所逼，遊行乞丐，止他客舍，寄生一子，是客舍主驅逐令去。",
        "translation": "Suppose a poor woman with no home to help her is forced by illness and hunger to wander among beggars and stops at a guest house to give birth to a son, and the owner of that guest house expels her and makes her leave.",
        "source": "T12n0374_002:0374a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其產未久，携抱是兒，欲至他國。",
        "translation": "She hadn't long given birth, but she took her son in her arms and wanted to go to another country.",
        "source": "T12n0374_002:0374a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其中路，遇惡風雨，寒苦並至，多為蚊虻、蜂螫、毒蟲之所唼食，經由恒河，抱兒而度，其水漂疾而不放捨，於是母子遂共俱沒。",
        "translation": "On their way there, they encounter bad winds and rain, cold and hardship, and are often eaten by mosquitoes, stinging bees, and poisonous insects.",
        "source": "T12n0374_002:0374a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是女人慈念功德，命終之後，生於梵天。",
        "translation": "Because of this woman's merit of being compassionate, she's born in the Brahma Heaven when her life ends.",
        "source": "T12n0374_002:0374a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子欲護正法，勿說如來同於諸行、不同諸行！",
        "translation": "If there are good sons who want to protect the true teaching, don't say that the Tathāgata is the same as all practices and different from all practices!",
        "source": "T12n0374_002:0374a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯當自責，我今愚癡，未有慧眼，如來正法不可思議。",
        "translation": "I should only reproach myself for my foolishness and lack of insight, for thinking that the Tathāgata's right teaching is inconceivable.",
        "source": "T12n0374_002:0374a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不應宣說，如來定是有為、定是無為。",
        "translation": "Therefore, I shouldn't say that the Tathāgata is definitely existent and definitely nonexistent.",
        "source": "T12n0374_002:0374a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若正見者，應說如來定是無為。",
        "translation": "If someone has right view, they should say that the Tathāgata is definitely nonexistent.",
        "source": "T12n0374_002:0374a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0374a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能為眾生生善法故、生憐愍故。",
        "translation": "It's because it produces good qualities and kindness for sentient beings.",
        "source": "T12n0374_002:0374a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼貧女在於恒河，為愛念子而捨身命。",
        "translation": "It's like that poor woman in the Ganges River who sacrifices her life for the love of her son.",
        "source": "T12n0374_002:0374a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_002:0374a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護法菩薩亦應如是，寧捨身命，不說如來同於有為，當言如來同於無為。",
        "translation": "\"So too should Dharma-protecting bodhisattvas who prefer to sacrifice their lives and not say that the Tathāgata is the same as existent activity say that the Tathāgata is the same as nonexistent activity.",
        "source": "T12n0374_002:0374a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以說如來同無為故，得阿耨多羅三藐三菩提，如彼女人得生梵天。",
        "translation": "It's because they say the Tathāgata is the same as nothing that they attain supreme perfect enlightenment, just like that woman who's born in the Brahma Heaven.",
        "source": "T12n0374_002:0374a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0374a28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以護法故。",
        "translation": "\"It's because they protect the Dharma.",
        "source": "T12n0374_002:0374a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何護法？",
        "translation": "What is the protection of the Dharma?",
        "source": "T12n0374_002:0374a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂說言如來同於無為。",
        "translation": "It's called saying that the Tathāgata is the same as doing nothing.",
        "source": "T12n0374_002:0374a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_002:0374b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之人雖不求解脫，解脫自至；如彼貧女，不求梵天，梵天自至。",
        "translation": "Such a person doesn't seek liberation, but liberation comes naturally, like the poor woman who doesn't seek Brahman, but Brahman comes naturally.",
        "source": "T12n0374_002:0374b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人遠行，中路疲極，寄止他舍，臥寐之中，其室忽然大火卒起，即時驚寤，尋自思惟：『我於今者定死不疑。』",
        "translation": "Like a person who's traveling far and is tired from the road and has stopped at another house while lying asleep, and a fire suddenly starts in his room, he awakens immediately and reflects to himself, 'Now, I'm sure to die without a doubt.'",
        "source": "T12n0374_002:0374b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具慚愧故，以衣纏身，即便命終，生忉利天。",
        "translation": "Being conscience, he wrapped a robe around his body, and even at the end of his life, he was born in the Heaven of Thirty-three.",
        "source": "T12n0374_002:0374b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是已後，滿八十返作大梵王，滿百千世生於人中為轉輪王，是人不復生三惡趣，展轉常生安樂之處。",
        "translation": "After that, he'll go back to being a great brahma king for 80 lifetimes or be born among humans as a wheel-turning king for a hundred thousand lifetimes, where he'll no longer be born in the three bad destinies but will always be reborn in a place of comfort.",
        "source": "T12n0374_002:0374b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，文殊師利！",
        "translation": "For this reason, Mañjuśrī!",
        "source": "T12n0374_002:0374b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子有慚愧者，不應觀佛同於諸行。",
        "translation": "If good sons have a sense of shame, they shouldn't observe the Buddha in the same way as all his practices.",
        "source": "T12n0374_002:0374b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道邪見可說如來同於有為，持戒比丘不應如是，於如來所生有為想。",
        "translation": "Outsiders with wrong views might say that the Tathāgata is the same as being existential, but a monk who upholds the precepts shouldn't thus give rise to existential notions about the Tathāgata.",
        "source": "T12n0374_002:0374b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言如來是有為者，即是妄語；當知是人死入地獄，如人自處於己舍宅。",
        "translation": "If he says the Tathāgata is existential, that's a false statement; he should know that this person dies and goes to hell, like a person living in his own house.",
        "source": "T12n0374_002:0374b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374b13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來真實是無為法，不應復言是有為也。",
        "translation": "The Tathāgata is truly the Dharma of no-existence, and it shouldn't be said again that it's the Dharma of existence.",
        "source": "T12n0374_002:0374b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝從今日於生死中，應捨無智，求於正智，當知如來即是無為。",
        "translation": "From now on, in the midst of birth-and-death, you should abandon ignorance and seek right knowledge, knowing that the Tathāgata is nothing.",
        "source": "T12n0374_002:0374b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是觀如來者，具足當得三十二相，速疾成就阿耨多羅三藐三菩提。」",
        "translation": "If you can thus observe the Tathāgata, you'll fully attain the thirty-two marks and quickly accomplish unsurpassed, correct enlightenment.\"",
        "source": "T12n0374_002:0374b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利法王子讚純陀言：「善哉，善哉！",
        "translation": "It was then that Mañjuśrī, the Dharma prince, praised Cunda, saying, \"Good, good!",
        "source": "T12n0374_002:0374b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_002:0374b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今已作長壽因緣，能知如來是常住法、不變異法、無為之法。",
        "translation": "Now that you've created the causes and conditions for a long life, you can know that the Tathāgata is an eternally abiding dharma, an unchanging and dissimilar dharma, and a dharma that does not work.",
        "source": "T12n0374_002:0374b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今如是善覆如來有為之相，如彼火人，為慚愧故以衣覆身，以是善心生忉利天，復為梵王、轉輪聖王，不至惡趣，常受安樂。",
        "translation": "Now, you thus well cover the Tathāgata's marks of existence like that firebrand who covers his body with clothing out of modesty and with that good intention is born in the Heaven of Thirty-three, where he'll again be the king of Brahmā and the wheel-turning sage king, won't go to bad destinies, and will always enjoy well-being.",
        "source": "T12n0374_002:0374b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝亦如是，善覆如來有為相故，於未來世必定當得三十二相、八十種好、十八不共法、無量壽命，不在生死、常受安樂，不久得成應、正遍知。",
        "translation": "In the future, you too will surely attain the thirty-two marks, eighty kinds of beauty, eighteen distinctive qualities, and measureless life expectancy, not be subject to birth-and-death, always enjoy well-being, and soon become worthy of perfect knowledge because you well covered the tathāgata's artificial features.",
        "source": "T12n0374_002:0374b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀！",
        "translation": "Cunda!",
        "source": "T12n0374_002:0374b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來次後自當廣說，我之與汝，俱亦當覆如來有為。",
        "translation": "As the Tathāgata will explain in detail later, I and you will both be covered by the Tathāgata's existential acts.",
        "source": "T12n0374_002:0374b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有為、無為且共置之，汝可隨時速施飯食，如是施者，諸施中最。",
        "translation": "Placing both the existent and the inactive together, you can quickly give food and drink at any time, and such a gift is the best of all gifts.",
        "source": "T12n0374_002:0374b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘、比丘尼、優婆塞、優婆夷，遠行疲極，所須之物，應當清淨，隨時給與。",
        "translation": "If monks, nuns, laymen, or laywomen are weary from their travels, they should purify what they need and give it at any time.",
        "source": "T12n0374_002:0374b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是速施，即是具足檀波羅蜜根本種子。",
        "translation": "Such prompt giving is the fulfillment of the fundamental seed of the perfection of the perfection of giving.",
        "source": "T12n0374_002:0374c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀！",
        "translation": "Cunda!",
        "source": "T12n0374_002:0374c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有最後施佛及僧，若多、若少、若足、不足，宜速及時，如來正爾當般涅槃。」",
        "translation": "If there's a final gift to the Buddha and Saṃgha, whether large, small, sufficient, or insufficient, it's appropriate to give it quickly and on time, for the Tathāgata will surely attain parinirvāṇa.\"",
        "source": "T12n0374_002:0374c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀答言：「文殊師利！",
        "translation": "Cunda replied, \"Mañjuśrī!",
        "source": "T12n0374_002:0374c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今何故，貪為此食，而言多少、足與不足，令我時施？",
        "translation": "Why do you now crave this food, saying how much of it is enough and how little of it is enough, so that I will give it to you at a certain time?",
        "source": "T12n0374_002:0374c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來昔日苦行六年，尚自支持，況於今日須臾間耶？",
        "translation": "In the past, the Tathāgata practiced austerities for six years and still supported himself, so why wouldn't he do so in a moment's time today?",
        "source": "T12n0374_002:0374c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今實謂如來正覺受斯食耶？",
        "translation": "Do you really now say that the Tathāgata is properly enlightened and accepts this kind of food?",
        "source": "T12n0374_002:0374c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我定知，如來身者，即是法身，非為食身。」",
        "translation": "Still, I know for certain that the Tathāgata's body is the Dharma body, not the food body.\"",
        "source": "T12n0374_002:0374c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告文殊師利：「如是如是，如純陀言。",
        "translation": "It was then that the Buddha addressed Mañjuśrī, \"So and so, just as Cunda said.",
        "source": "T12n0374_002:0374c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉，純陀！",
        "translation": "Good, Cunda!",
        "source": "T12n0374_002:0374c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已成就微妙大智，善入甚深大乘經典。」",
        "translation": "You've accomplished subtle and great wisdom, and you've well entered the very profound great vehicle sūtras.\"",
        "source": "T12n0374_002:0374c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利語純陀言：「汝謂如來是無為者，如來之身即是長壽；若作是知，佛所悅可。」",
        "translation": "Mañjuśrī said to Cunda, \"You say the Tathāgata is inactive, and the Tathāgata's body is long-lived; if you know this, the Buddha pleases you.\"",
        "source": "T12n0374_002:0374c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀答言：「如來非獨悅可於我，亦復悅可一切眾生。」",
        "translation": "Cunda replied, \"The Tathāgata doesn't please me alone; he also pleases all sentient beings.\"",
        "source": "T12n0374_002:0374c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言：「如來於汝及以於我、一切眾生皆悉悅可。」",
        "translation": "Mañjuśrī said, \"The Tathāgata pleases you, pleases me, and pleases all sentient beings.\"",
        "source": "T12n0374_002:0374c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀答言：「汝不應言如來悅可。",
        "translation": "Cunda replied, \"You shouldn't say the Tathāgata pleases you.",
        "source": "T12n0374_002:0374c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫悅可者，則是倒想。",
        "translation": "Someone who pleases is mistakenly thinking about it.",
        "source": "T12n0374_002:0374c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有倒想，則是生死。",
        "translation": "If there's mistaken conception, then it's birth-and-death.",
        "source": "T12n0374_002:0374c17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有生死者，即有為法。",
        "translation": "When there's birth-and-death, it's a condition of being.",
        "source": "T12n0374_002:0374c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故文殊！",
        "translation": "Therefore, Mañjuśrī!",
        "source": "T12n0374_002:0374c18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿謂如來是有為也。",
        "translation": "\"Don't say the Tathāgata is existential.",
        "source": "T12n0374_002:0374c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言如來是有為者，我與仁者俱行顛倒。",
        "translation": "If we say the Tathāgata is existential, then we and you will both be acting mistakenly.",
        "source": "T12n0374_002:0374c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來無有愛念之想。",
        "translation": "\"The Tathāgata has no notion of longing for his child.",
        "source": "T12n0374_002:0374c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫愛念者，如彼母牛愛念其子，雖復飢渴行求水草，若足、不足，忽然還歸。",
        "translation": "That kind of longing is like a mother cow longing for her son, and even though she's hungry and thirsty and walks around seeking water and grass, if it's enough or not enough, she suddenly returns.",
        "source": "T12n0374_002:0374c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊無有是念，等視一切如羅睺羅。",
        "translation": "The buddhas and world-honored ones have no such longing and regard all equally, like Rāhula.",
        "source": "T12n0374_002:0374c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是念者，即是諸佛智慧境界。",
        "translation": "Such mindfulness is the realm of the buddhas' wisdom.",
        "source": "T12n0374_002:0374c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如國王，調御駕駟，欲令驢車而及之者，無有是處。",
        "translation": "\"It's like a king who regulates his driving vehicle and wants to make his donkey chariot reach it, but there's no place for it.",
        "source": "T12n0374_002:0374c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我與仁者亦復如是，欲盡如來微密深奧，亦無是處。",
        "translation": "Similarly, there's no place for me and you people to go when you want to exhaust the Tathāgata's subtleties and profundities.",
        "source": "T12n0374_002:0374c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0374_002:0374c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如金翅鳥飛昇虛空無量由旬，下觀大海悉見水性魚鼈、黿鼉、龜龍之屬，及見己影，如於明鏡見諸色像。",
        "translation": "Like a garuḍa flying up into the sky for measureless leagues, he looks down at the ocean and sees fish, beasts, turtle, and dragons in the water, and sees his own reflection, just as he sees forms and images in a bright mirror.",
        "source": "T12n0374_002:0374c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫少智，不能籌量如是所見，我與仁者亦復如是，不能籌量如來智慧。」",
        "translation": "Ordinary people with little wisdom can't gauge such views, and so are we and you, my friend, who can't gauge the Tathāgata's wisdom.\"",
        "source": "T12n0374_002:0374c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利語純陀言：「如是如是，如汝所說。",
        "translation": "Mañjuśrī said to Cunda, \"So and so, just as you said.",
        "source": "T12n0374_002:0375a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於此事，非為不達，直欲試汝諸菩薩事。」",
        "translation": "It's not that I don't understand this, but I just want to test you on the works of the bodhisattvas.\"",
        "source": "T12n0374_002:0375a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從其面門出種種光，其光明曜，照文殊身。",
        "translation": "It was then that the Bhagavān emitted a variety of lights from his face, and their brilliance shone brightly, illuminating Mañjuśrī's body.",
        "source": "T12n0374_002:0375a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利遇斯光已，即知是事，尋告純陀：「如來今者現是瑞相，不久必當入於涅槃。",
        "translation": "After he saw this light, Mañjuśrī knew this and told Cunda, \"Now that the Tathāgata is showing this auspicious sign, he will surely enter nirvāṇa soon.",
        "source": "T12n0374_002:0375a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝先所設最後供養，宜時奉獻佛及大眾。",
        "translation": "It's time to make the final offerings you previously made to the Buddha and the public.",
        "source": "T12n0374_002:0375a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀當知，如來放是種種光明，非無因緣。」",
        "translation": "You should know, Cunda, that the Tathāgata doesn't emit these kinds of light without a cause.\"",
        "source": "T12n0374_002:0375a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀聞已，情塞默然。",
        "translation": "After hearing this, Cunda was overcome with emotion and silence.",
        "source": "T12n0374_002:0375a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告純陀：「汝所奉施佛及大眾，今正是時，如來正爾當般涅槃。」",
        "translation": "The Buddha told Cunda, \"Now is the right time to make your offerings to the Buddha and the great assembly, for the Tathāgata is just then about to [enter] parinirvāṇa.\"",
        "source": "T12n0374_002:0375a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二、第三亦復如是。",
        "translation": "So it was with the second and third.",
        "source": "T12n0374_002:0375a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀聞佛語已，舉聲啼哭，悲咽而言：「苦哉，苦哉，世間空虛。」",
        "translation": "After hearing the Buddha's words, Cunda lifted his voice and wept, sobbing with pity, and said, \"Suffering, suffering, the world is empty.\"",
        "source": "T12n0374_002:0375a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白大眾：「我等今者一切當共五體投地，同聲勸佛莫般涅槃。」",
        "translation": "Again, he said to the crowd, \"Now, we must all throw our five bodies to the ground with one voice and urge the Buddha not to [enter] parinirvāṇa.\"",
        "source": "T12n0374_002:0375a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復告純陀：「莫大啼哭，令心顦悴。",
        "translation": "The Bhagavān then again addressed Cunda, \"Don't lament so much that you'll be distressed.",
        "source": "T12n0374_002:0375a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當觀是身，猶如芭蕉、熱時之炎、水泡、幻化、乾闥婆城、坏器、電光，亦如畫水、臨死之囚、熟果段肉，如織經盡，如碓上下，當觀諸行，猶雜毒食，有為之法，多諸過患。」",
        "translation": "You should observe this body as being like a plantain, a scorching hot time, a water bubble, an illusion, a city of Gandharvas, a broken vessel, a flash of lightning, like drawing water, a dying prisoner, a piece of ripe fruit and flesh, like weaving a scripture that's been exhausted, like a pestle that goes up and down, and you should observe that all conditioned things are like a mixed diet of poison, and that the things that exist are full of faults.\"",
        "source": "T12n0374_002:0375a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是純陀復白佛言：「如來不欲久住於世，我當云何而不啼泣？",
        "translation": "Then Cunda again said to the Buddha, \"The Tathāgata doesn't want to stay in the world for a long time, so how will I stop weeping?",
        "source": "T12n0374_002:0375a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉，苦哉，世間空虛。",
        "translation": "'Suffering, suffering, the world is empty.",
        "source": "T12n0374_002:0375a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，憐愍我等及諸眾生，久住於世，勿般涅槃。」",
        "translation": "Please, Bhagavān, have pity on us and all sentient beings, so that we can live in the world for a long time and not attain parinirvāṇa.\"",
        "source": "T12n0374_002:0375a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告純陀：「汝今不應發如是言，憐愍我故，久住於世。",
        "translation": "The Buddha told Cunda, \"You shouldn't say this now, 'Have pity on me and therefore abide in the world for a long time.'",
        "source": "T12n0374_002:0375a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以憐愍汝及一切，是故今欲入於涅槃。",
        "translation": "Because I have pity for you and all of them, I now want to enter nirvāṇa.",
        "source": "T12n0374_002:0375a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0375a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛法爾，有為亦然。",
        "translation": "As is true for all buddhas, so is it true for all existent things.",
        "source": "T12n0374_002:0375a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故諸佛而說偈言：「『有為之法，　　其性無常。",
        "translation": "That's why the buddhas spoke in verse, saying, \"The nature of existent things is impermanent.",
        "source": "T12n0374_002:0375a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　生已不住，　　寂滅為樂。』",
        "translation": "After birth, it doesn't stop, and cessation is bliss.'",
        "source": "T12n0374_002:0375a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「純陀！",
        "translation": "\"Cunda!",
        "source": "T12n0374_002:0375a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當觀一切行雜諸法，無我、無常、不住，此身多有無量過患，猶如水泡，是故汝今不應啼泣。」",
        "translation": "Now, you should examine all the various things that go bump in the road, which are without self, impermanent, or unabiding, and this body is full of measureless faults like a water bubble; therefore, you shouldn't weep now.\"",
        "source": "T12n0374_002:0375a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀復白佛言：「如是如是，誠如尊教。",
        "translation": "It was then that Cunda again said to the Buddha, \"So, so, so, it's just as you've been taught.",
        "source": "T12n0374_002:0375b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖知如來方便示現入於涅槃，而我不能不懷苦惱，覆自思惟，復生慶悅。」",
        "translation": "Even though I know the Tathāgata skillfully shows me that I've entered nirvāṇa, I can't stop harboring misery and reflecting on myself, and I'll become happy again.\"",
        "source": "T12n0374_002:0375b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛讚純陀：「善哉，善哉！",
        "translation": "The Buddha praised Cunda, \"Good, good!",
        "source": "T12n0374_002:0375b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能知如來示同眾生，方便涅槃。",
        "translation": "\"He knows that the Tathāgata shows sentient beings that he's with them and facilitates nirvāṇa.",
        "source": "T12n0374_002:0375b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀！",
        "translation": "Cunda!",
        "source": "T12n0374_002:0375b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當聽，如娑羅娑鳥，春陽之月皆共集彼阿耨達池。",
        "translation": "\"Now, listen, just like the sārasa bird, the moon of the spring sunlight all gathers together at Anavatapta's pond.",
        "source": "T12n0374_002:0375b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛亦爾，皆至是處。",
        "translation": "So it is with the buddhas, who all arrive at that place.",
        "source": "T12n0374_002:0375b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀！",
        "translation": "Cunda!",
        "source": "T12n0374_002:0375b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今不應思惟諸佛長壽短壽，一切諸法皆如幻相，如來在中以方便力無所染著。",
        "translation": "\"Now, you shouldn't think about the long and short lives of the buddhas, how all things are illusory, and how the Tathāgata is present in them with the power of skillful means and has no defiled attachment.",
        "source": "T12n0374_002:0375b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0375b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛法爾。",
        "translation": "\"So it is with all buddhas.",
        "source": "T12n0374_002:0375b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀！",
        "translation": "Cunda!",
        "source": "T12n0374_002:0375b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今受汝所獻供養，為欲令汝度於生死諸有流故。",
        "translation": "I've accepted your offerings now because I want you to escape the flow of birth-and-death existence.",
        "source": "T12n0374_002:0375b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸人、天於此最後供養我者，悉皆當得不動果報，常受安樂。",
        "translation": "If humans and gods make these final offerings to me, they will all attain the immovable fruit of their lives and always experience well-being.",
        "source": "T12n0374_002:0375b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0375b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是眾生良福田故。",
        "translation": "I'm a good field of merit for sentient beings.",
        "source": "T12n0374_002:0375b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若復欲為諸眾生作福田者，速辦所施，不宜久停。」",
        "translation": "If you also want to make a field of merit for sentient beings, quickly complete the gift you've given, rather than stopping for a long time.\"",
        "source": "T12n0374_002:0375b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀，為諸眾生得度脫故，低頭飲淚而白佛言：「善哉，世尊！",
        "translation": "At that point, Cunda, in order to liberate sentient beings, bowed his head, drank tears, and said to the Buddha, \"Good, Bhagavān!",
        "source": "T12n0374_002:0375b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若堪任為福田時，則能了知如來涅槃及非涅槃。",
        "translation": "When I'm capable of being a field of merit, then I'll be able to know the Tathāgata's nirvāṇa and non-nirvāṇa.",
        "source": "T12n0374_002:0375b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者及諸聲聞、緣覺智慧猶如蚊蟻，實不能量如來涅槃及非涅槃。」",
        "translation": "Now, we and the wisdom of śrāvakas and pratyekbuddhas are like mosquitoes and ants, and we really can't know the Tathāgata's nirvāṇa or non-nirvāṇa.\"",
        "source": "T12n0374_002:0375b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀及其眷屬，愁憂啼泣，圍遶如來，燒香散花，盡心敬奉。",
        "translation": "At the time, Cunda and his retinue were sad and lamented, surrounded the Tathāgata, burned incense and scattered flowers, and paid their utmost respects.",
        "source": "T12n0374_002:0375b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋與文殊從座而去，供辦食具。",
        "translation": "They then departed with Mañjuśrī from his seat and provided him with food.",
        "source": "T12n0374_002:0375b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其去未久，是時此地六種震動，乃至梵世亦復如是。",
        "translation": "Not long after he left, six kinds of earthquakes shook this place, and so did the Brahma world.",
        "source": "T12n0374_002:0375b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地動有二，或有地動，或大地動。",
        "translation": "There are two kinds of earthquakes: those that occur when the ground moves and those that occur when the earth moves.",
        "source": "T12n0374_002:0375b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小動者名為地動，大動者名大地動。",
        "translation": "A small movement is called an earth tremor, and a large movement is called a great earth tremor.",
        "source": "T12n0374_002:0375b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有小聲者名曰地動，有大聲者名大地動。",
        "translation": "The one with a small sound is called an earthquake, and the one with a large sound is called an earthquake of the earth.",
        "source": "T12n0374_002:0375b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨地動者名曰地動，山河樹木及大海水一切動者，名大地動。",
        "translation": "When the ground alone moves, it's called the earth moving, and when mountains, rivers, trees, and the ocean water all move, it's called the great earth moving.",
        "source": "T12n0374_002:0375b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一向動者名曰地動，周迴旋轉名大地動。",
        "translation": "When someone moves in one direction, it's called the earth moving, and when it circles around, it's called great earth movement.",
        "source": "T12n0374_002:0375b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "動名地動，動時能令眾生心動名大地動。",
        "translation": "When it moves, it's called the earth moving, and when it moves, it causes the minds of sentient beings to be moved, which is called great earth movement.",
        "source": "T12n0374_002:0375b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩初從兜率天下閻浮提時名大地動，從初生、出家、成阿耨多羅三藐三菩提、轉於法輪及般涅槃名大地動。",
        "translation": "It's called the great earth moving when a bodhisattva first descends from Tuṣita Heaven to Jambudvīpa, and it's called the great earth moving when a bodhisattva is first born, leaves home, attains unsurpassed, samyak-saṃbodhi, turns the Dharma wheel, and attains parinirvāṇa.",
        "source": "T12n0374_002:0375b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日如來將入涅槃，是故此地如是大動。",
        "translation": "Today, the Tathāgata is about to enter nirvāṇa, and therefore this place is greatly agitated like this.",
        "source": "T12n0374_002:0375b29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸天、龍、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人及非人，聞是語已，身毛皆豎，同聲哀泣，而說偈言：「稽首禮調御，　　我等今勸請，　違離於人仙，　　永無有救護。",
        "translation": "When the gods, dragons, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans and nonhumans heard those words, their hair stood on end, and they wept with one voice as they spoke, saying, \"Bowing our heads in homage to the tamer, we now urge him to abandon the sages and humans, for there's no protection forever.",
        "source": "T12n0374_002:0375c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今見佛涅槃，　　我等沒苦海，　愁憂懷悲惱，　　猶如犢失母。",
        "translation": "Now that we've seen the Buddha's nirvāṇa, we've been submerged in an ocean of suffering, beset with grief and sorrow, just like a calf that has lost its mother.",
        "source": "T12n0374_002:0375c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貧窮無救護，　　猶如困病人，　無醫隨自心，　　食所不應食。",
        "translation": "Poverty and helplessness are like being stranded and sick, with no doctor to follow our hearts and no food to eat that shouldn't be eaten.",
        "source": "T12n0374_002:0375c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生煩惱病，　　常為諸見害，　遠離法醫師，　　服食邪毒藥，　是故佛世尊，　　不應見捨離。",
        "translation": "The afflictive illnesses of sentient beings are always the result of views that are harmful, and they're far removed from doctors of the Dharma and feed on wrong poisons.",
        "source": "T12n0374_002:0375c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如國無君主，　　人民皆飢餓，　我等亦如是，　　失蔭及法味。",
        "translation": "Just as a country has no ruler and its people are starving, so are we, who have lost the shade and taste of the Dharma.",
        "source": "T12n0374_002:0375c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今聞佛涅槃，　　我等心迷亂，　如彼大地動，　　迷失於諸方。",
        "translation": "Now, when we hear of the Buddha's nirvāṇa, our minds are distracted, like the great earth shaking, and we're lost in various directions.",
        "source": "T12n0374_002:0375c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大仙入涅槃，　　佛日墜於地，　法水悉枯涸，　　我等定當死，　如來般涅槃，　　眾生極苦惱，　譬如長者子，　　新喪於父母。",
        "translation": "When the great sage enters nirvāṇa, the Buddha's sun falls to the ground, the Dharma water all dries up, and we're all certain to die, so the Tathāgata's parinirvāṇa causes sentient beings great suffering, like an elderly son newly bereaved by his parents.",
        "source": "T12n0374_002:0375c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來入涅槃，　　如其不還者，　我等及眾生，　　悉無有救護。",
        "translation": "When the Tathāgata enters nirvāṇa, if he doesn't return, there's no protection for us or for sentient beings.",
        "source": "T12n0374_002:0375c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來入涅槃，　　乃至諸畜生，　一切皆愁怖，　　苦惱焦其心。",
        "translation": "Even animals that enter nirvāṇa as the Tathāgata does are all sad and frightened, and their minds are scorched by suffering.",
        "source": "T12n0374_002:0375c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等於今日，　　云何不愁惱？",
        "translation": "Today, why aren't we worried?",
        "source": "T12n0374_002:0375c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來見放捨，　　猶如棄涕唾。",
        "translation": "The Tathāgata sees abandonment, just as he discards tears and spittle.",
        "source": "T12n0374_002:0375c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如日初出，　　光明甚暉炎，　既能還自照，　　亦滅一切闇。",
        "translation": "It's like when the sun first rises and shines brightly, and since it can shine back on itself, it also extinguishes all darkness.",
        "source": "T12n0374_002:0375c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來神通光，　　能除我苦惱，　處在大眾中，　　譬如須彌山。",
        "translation": "The Tathāgata's supernormal light removes my suffering and distress, and he stands among the masses like Mount Sumeru.",
        "source": "T12n0374_002:0376a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0374_002:0376a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如國王，生育諸子，形貌端正，心常愛念，先教伎藝，悉令通利，然後將付魁膾令殺。",
        "translation": "Suppose a king gives birth to sons who are well-appearing and whose hearts are always fond of them and first teaches them tricks and techniques, making them all proficient, and then he sends them to the leaders to be killed.",
        "source": "T12n0374_002:0376a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今日為法王子，蒙佛教誨，以具正見，願莫放捨；如其放捨，則同王子。",
        "translation": "Today, we're princes of the Dharma who have been taught by the Buddha to have right views and who wish not to abandon them; if they abandon them, then they're like princes.",
        "source": "T12n0374_002:0376a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願久住，不入涅槃。",
        "translation": "We only wish to stay a long time and not enter nirvāṇa.",
        "source": "T12n0374_002:0376a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，善學諸論，復於此論，而生怖畏。",
        "translation": "\"It's like a person who well learns the treatises and becomes frightened by them again.",
        "source": "T12n0374_002:0376a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾，通達諸法，而於諸法，復生怖畏。",
        "translation": "So too, the Tathāgata fully understands all things and becomes frightened of them again.",
        "source": "T12n0374_002:0376a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使如來久住於世，說甘露味，充足一切，如是眾生則不復畏墮於地獄。",
        "translation": "If the Tathāgata were to stay in the world for a long time and explain the taste of ambrosia, which fills everything, then sentient beings wouldn't be afraid to fall into hell again.",
        "source": "T12n0374_002:0376a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，初學作務，為官所收，閉之囹圄。",
        "translation": "It's like a person who's first learned to do a task, but they're taken in by the government and put behind bars.",
        "source": "T12n0374_002:0376a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人問之：『汝受何事？』",
        "translation": "Someone asks him, 'What have you been subjected to?'",
        "source": "T12n0374_002:0376a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『我今受大憂苦，若其得脫，則得安樂。』",
        "translation": "He answered, 'Now I'm suffering great sorrow, but if I were freed, I'd be at peace.'",
        "source": "T12n0374_002:0376a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊亦爾，為我等故，修諸苦行，我等今者，猶未得免生死苦惱，云何如來得受安樂？",
        "translation": "So, too, is the Bhagavān cultivating all these ascetic practices for our sake, for we have yet to be freed from the suffering of birth-and-death, so how could we then attain well-being?",
        "source": "T12n0374_002:0376a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如醫王，善解方藥，偏以祕方教授其子，不教其餘外受學者。",
        "translation": "It's like a doctor king who well understands prescriptions and medicine but teaches his son the secret formulas and doesn't teach others who are trained outside the school.",
        "source": "T12n0374_002:0376a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾，獨以甚深祕密之藏，偏教文殊，遺棄我等，不見顧愍。",
        "translation": "So too, the Tathāgata alone teaches the profound and esoteric canon to Mañjuśrī alone, abandoning us without seeing our compassion.",
        "source": "T12n0374_002:0376a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來於法應無慳悋，如彼醫王偏教其子，不教外來諸受學者。",
        "translation": "The Tathāgata should not be stingy with the Dharma, just as that doctor king who partially teaches his sons and doesn't teach those who receive instruction from outside.",
        "source": "T12n0374_002:0376a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼醫所以不能普教，情存勝負，故有祕惜。",
        "translation": "That doctor's inability to teach universally is due to his feelings about winning and losing, so he keeps secrets and cherishes them.",
        "source": "T12n0374_002:0376a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來之心，終無勝負，何故如是，不見教誨？",
        "translation": "The Tathāgata's mind is never superior or inferior, so why is it that he doesn't see the teaching?",
        "source": "T12n0374_002:0376a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願久住，莫般涅槃。",
        "translation": "Only wish to stay a long time, not to attain nirvāṇa.",
        "source": "T12n0374_002:0376a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如老少、病苦之人，離於善徑，行於險路，路險澁難，多受苦惱。",
        "translation": "It's like an elderly or young person who's sick and suffering and departs from a good path and travels on a dangerous road that's rough and difficult, and they often experience suffering and distress.",
        "source": "T12n0374_002:0376a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更有異人，見之憐愍，即便示以平坦好道。",
        "translation": "An unusual person sees that person and takes pity on them, so they show them a smooth and good path.",
        "source": "T12n0374_002:0376a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，所謂少者喻未增長法身之人，老者喻重煩惱，病者喻未脫生死，險路者喻二十五有。",
        "translation": "So too, I think the young person is a metaphor for someone who hasn't yet grown the Dharma body, the old person is a metaphor for heavy affliction, the sick person is a metaphor for someone who hasn't yet escaped birth and death, and the dangerous path is a metaphor for 25 existences.",
        "source": "T12n0374_002:0376a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來，示導我等甘露正道，久住於世，勿入涅槃。」",
        "translation": "May the Tathāgata please show us the right path of ambrosia, which will last a long time in the world and prevent us from entering nirvāṇa.\"",
        "source": "T12n0374_002:0376a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告諸比丘：「汝等比丘，莫如凡夫、諸天人等，愁憂啼哭；當勤精進，繫心正念。」",
        "translation": "It was then that the Bhagavān addressed the monks, \"You monks, don't be like ordinary people or gods and humans who grieve and lament; instead, make diligent effort and fix your minds on right concentration.\"",
        "source": "T12n0374_002:0376a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸天人、阿修羅等，聞佛所說，止不啼哭。",
        "translation": "When the gods, humans, asuras, and others heard what the Buddha taught, they stopped lamenting and didn't cry.",
        "source": "T12n0374_002:0376b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如有人，殯喪子已止不啼哭。",
        "translation": "They were like a person who stops weeping and wailing after burying a child.",
        "source": "T12n0374_002:0376b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為諸大眾，說是偈言：「汝等當開意，　　不應大愁苦，　諸佛法皆爾，　　是故當默然。",
        "translation": "The Bhagavān then spoke this verse for the large crowd, saying, \"All of you should open your minds and not be greatly distressed; all the Buddha's teachings are like that; therefore, you should be silent.",
        "source": "T12n0374_002:0376b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂不放逸行，　　守心正憶念，　遠離諸非法，　　慰意受歡樂。",
        "translation": "Enjoying nonfrivolous behavior and keeping correct mindfulness, you'll be free of unlawful things and be comforted and encouraged by their intentions.",
        "source": "T12n0374_002:0376b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T12n0374_002:0376b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有疑念，今皆當問。",
        "translation": "\"If you have any doubts, you should ask them all now.",
        "source": "T12n0374_002:0376b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若空、不空，若常、無常，若苦、不苦，若依、非依，若去、不去，若歸、非歸，若恒、非恒，若斷、若常，若眾生、非眾生，若有、若無，若實、不實，若真、不真，若滅、不滅，若密、不密，若二、不二，如是等種種法中有所疑者，今應諮問，我當隨順為汝斷之，亦當為汝先說甘露，然後乃當入於涅槃。",
        "translation": "If there's doubt about what's empty and what's not empty, what's permanent and what's impermanent, what's painful and what's not painful, what's basis and what's not basis, what's departing and what's not departing, what's returning and what's not returning, what's constant and what's not constant, what's stopped and what's permanent, what's sentient and what's not sentient, what's real and what's not real, what's true and what's not true, what's ceasing and what's not ceasing, what's esoteric and what's not esoteric, what's two and what's not two, and all these things, you should ask them now, and I will end them for you accordingly, and I will first explain the nectar for you, and then you will enter nirvāṇa.",
        "source": "T12n0374_002:0376b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T12n0374_002:0376b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛出世難，人身難得，值佛生信是事亦難，能忍難忍是亦復難，成就禁戒具足無缺、得阿羅漢果是事亦難，如求金沙優曇鉢花。",
        "translation": "It's difficult for a buddha to appear in the world, difficult for a person to obtain, difficult to become a believer in a buddha, difficult to tolerate intolerance, and difficult to achieve the full and unblemished observance of the precepts and attain the fruit of the arhat, just as it is to seek the golden sand lotus flower.",
        "source": "T12n0374_002:0376b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0376b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離於八難得人身難，汝等遇我不應空過。",
        "translation": "It's difficult to escape the eight difficulties in attaining a human life, so you shouldn't be in vain when you meet me.",
        "source": "T12n0374_002:0376b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於往昔種種苦行，今得如是無上方便，為汝等故，無量劫中捨身、手足、頭目、髓腦，是故汝等不應放逸。",
        "translation": "Because of my various ascetic practices in the past, I've now attained this unsurpassed method of giving up my body, hands, feet, head, eyes, and marrow and brains for you people for measureless eons; therefore, you shouldn't be careless.",
        "source": "T12n0374_002:0376b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0376b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何莊嚴正法寶城，具足種種功德珍寶，戒、定、智慧、以為牆塹埤堄？",
        "translation": "\"How do you adorn the jeweled city of the true Dharma, replete with the treasures of various attributes, morality, meditation, and wisdom, which serve as the moat and parapet of its walls?",
        "source": "T12n0374_002:0376b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今遇是佛法寶城，不應取此虛偽之物，譬如商主遇真寶城，取諸瓦礫而便還家。",
        "translation": "Now, when you encounter this jeweled city of the Buddha's teaching, you shouldn't take these false goods, like a merchant who encounters a truly jeweled city and takes the rubble and then returns home.",
        "source": "T12n0374_002:0376b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝亦如是，值遇寶城取虛偽物。",
        "translation": "You, too, have come across a jeweled city and taken false goods.",
        "source": "T12n0374_002:0376b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0376b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿以下心，而生知足。",
        "translation": "\"Don't go down in thought and become satisfied.",
        "source": "T12n0374_002:0376b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今者雖得出家，於此大乘不生貪慕。",
        "translation": "Even though you have left home, you won't become desirous of this great vehicle.",
        "source": "T12n0374_002:0376b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0376b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身雖得服袈裟染衣，其心猶未得染大乘清淨之法。",
        "translation": "Even though his body may be clothed in the robe's dyed garments, his mind has yet to become dyed in the pure dharma of the great vehicle.",
        "source": "T12n0374_002:0376b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0376c01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖行乞食，經歷多處，初未曾乞大乘法食。",
        "translation": "Even though they've traveled to many places begging for food, they've never begged for food from the great vehicle teaching in the first place.",
        "source": "T12n0374_002:0376c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0376c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖除鬚髮，未為正法除諸結使。",
        "translation": "Even though it removes your hair, it doesn't remove the bonds and tendencies of the right teaching.",
        "source": "T12n0374_002:0376c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0376c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當真實教勅汝等，我今現在大眾和合，如來法性真實不倒，是故汝等應當精進，攝心勇猛摧諸結使，十力慧日既滅沒已，汝等當為無明所覆。",
        "translation": "\"Now, I will truly teach and instruct you that I am now uniting the great masses, and that the Tathāgata's true nature doesn't fail; therefore, you should make effort, collect your thoughts, and work boldly to destroy the bonds and tendencies, and once the sun of the ten powers and wisdom has gone out, you will be covered by ignorance.",
        "source": "T12n0374_002:0376c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "\"Monks!",
        "source": "T12n0374_002:0376c06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大地、諸山、藥草為眾生用，我法亦爾，出生妙善甘露法味，而為眾生種種煩惱病之良藥。",
        "translation": "Just as the earth, mountains, and medicinal plants are used by sentient beings, so too does my teaching produce the taste of the wonderful ambrosia dharma, which serves as a good medicine for the various afflictive ailments of sentient beings.",
        "source": "T12n0374_002:0376c07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當令一切眾生，及以我子四部之眾，悉皆安住祕密藏中，我亦復當安住是中，入於涅槃。",
        "translation": "Now, I will cause all sentient beings and the four groups of my children to abide in the secret store, and I will also abide in it and enter nirvāṇa.",
        "source": "T12n0374_002:0376c09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為祕密之藏？",
        "translation": "What's called the secret store?",
        "source": "T12n0374_002:0376c11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如伊字三點，若並則不成伊，縱亦不成；如摩醯首羅面上三目，乃得成伊三點，若別亦不得成。",
        "translation": "\"It's like the letter i with three dots, which wouldn't be i if they were combined, or even if they weren't, like the three eyes on Mahêśvara's face that make it possible to form the three dots of i, which couldn't be formed otherwise.",
        "source": "T12n0374_002:0376c11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，解脫之法亦非涅槃，如來之身亦非涅槃，摩訶般若亦非涅槃，三法各異亦非涅槃。",
        "translation": "In the same way, I know that the teaching of liberation is not nirvāṇa, the Tathāgata's body is not nirvāṇa, Mahāprajñāpāramitā is not nirvāṇa, and the differences among the three teachings are not nirvāṇa.",
        "source": "T12n0374_002:0376c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今安住如是三法，為眾生故，名入涅槃，如世伊字。」",
        "translation": "Now, I'll abide in these three things, and for the sake of sentient beings, I'll call it entering nirvāṇa, just like the Sanskrit phoneme ī.\"",
        "source": "T12n0374_002:0376c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘聞佛世尊定當涅槃，皆悉憂愁，身毛為豎，涕淚盈目，稽首佛足，遶無量匝，白佛言：「世尊！",
        "translation": "When the monks heard that the Bhagavān was certain to enter nirvāṇa, they were all sad and troubled, their hair standing on end, tears filling their eyes, bowing their heads at the Buddha's feet, circling him measurelessly, and saying to him, \"Bhagavān!",
        "source": "T12n0374_002:0376c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快說無常、苦、空、無我。",
        "translation": "\"Quickly explain that it's impermanent, painful, empty, and without self.",
        "source": "T12n0374_002:0376c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如一切眾生跡中，象跡為上，是無常想亦復如是，於諸想中最為第一。",
        "translation": "Just as the elephant's tracks are the highest of all the traces of sentient beings, so is this perception of impermanence, which is the highest of all perceptions.",
        "source": "T12n0374_002:0376c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有精勤修習之者，能除一切欲界欲愛、色無色愛、無明憍慢及無常想。",
        "translation": "If someone diligently cultivates it, they'll be able to remove all desire in the desire realm, form and formless desire, ignorance and pride, and the perception of impermanence.",
        "source": "T12n0374_002:0376c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來若離無常想者，今則不應入於涅槃。",
        "translation": "\"If the Tathāgata were to part with the contemplation of impermanence, he wouldn't be entering nirvāṇa now.",
        "source": "T12n0374_002:0376c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不離者，云何說言修無常想，離三界愛、無明、憍慢及無常想？",
        "translation": "If he didn't part with them, then how did he say he cultivated the perception of impermanence and parted with the perceptions of craving, ignorance, pride, and impermanence in the three realms?",
        "source": "T12n0374_002:0376c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如農夫，秋月之時，深耕其地，能除穢草。",
        "translation": "Like a farmer who plows his field deeply in the autumn months, it removes dirty grass.",
        "source": "T12n0374_002:0376c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是無常想亦復如是，能除一切欲界欲愛、色無色愛、無明憍慢及無常想。",
        "translation": "*So too is this perception of impermanence, which removes all desire in the desire realm, form and formless desire, ignorance and pride, and perception of impermanence.",
        "source": "T12n0374_002:0376c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0376c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如耕田，秋耕為勝。",
        "translation": "\"It's like plowing a field; autumn plowing is superior.",
        "source": "T12n0374_002:0376c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸跡中，象跡為勝。",
        "translation": "Of all the tracks, the elephant tracks are superior.",
        "source": "T12n0374_002:0376c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸想中，無常想為勝。",
        "translation": "Of all the concepts, the concept of impermanence is superior.",
        "source": "T12n0374_002:0377a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如帝王，知命將終，恩赦天下，獄囚繫閉，悉令得脫，然後捨命。",
        "translation": "It's like an emperor who, knowing that his life is about to end, graciously pardons the whole world and makes all those imprisoned and fettered obtain liberation before he leaves his life.",
        "source": "T12n0374_002:0377a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來今者，亦應如是，度諸眾生，一切無知、無明、繫閉，皆令解脫，然後乃入於般涅槃。",
        "translation": "The Tathāgata should likewise now save all sentient beings who are free of ignorance, nescience, and fetters and then enter parinirvāṇa.",
        "source": "T12n0374_002:0377a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者皆未得度，云何如來便欲放捨，入於涅槃？",
        "translation": "Now, none of us have yet been saved, so why would the Tathāgata want to abandon them and enter nirvāṇa?",
        "source": "T12n0374_002:0377a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，為鬼所持，遇良呪師，以呪力故，便得除差。",
        "translation": "\"It's like a person who's held by a demon and meets a good spell master who, by the power of the spell, removes the difference.",
        "source": "T12n0374_002:0377a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾，為諸聲聞除無明鬼，令得安住摩訶般若解脫等法，如世伊字。",
        "translation": "So too, the Tathāgata removes the ghosts of ignorance for the śrāvakas and makes them abide in such things as the liberation of Mahāprajñāpāramitā, just like the Sanskrit phoneme.",
        "source": "T12n0374_002:0377a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如香象，為人所縛，雖有良師，不能禁制，[去*頁]絕羈鎖，自恣而去。",
        "translation": "It's like a fragrant elephant that's tied up by someone, but even though it has a good teacher, he can't restrain it, [snaps*page] cuts off its chains, and leaves at will.",
        "source": "T12n0374_002:0377a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我未如是脫五十七煩惱繫縛，云何如來便欲放捨，入於涅槃？",
        "translation": "Before I was thus freed from the fetters of the fifty-seven afflictions, how did I then want to abandon them and enter nirvāṇa?",
        "source": "T12n0374_002:0377a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人病瘧，值遇良醫，所苦得除。",
        "translation": "\"Suppose a person is sick and has a fever, and they meet a good doctor who removes what's painful.",
        "source": "T12n0374_002:0377a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，多諸患苦，邪命熱病，雖遇如來，病未除愈，未得無上安隱常樂。",
        "translation": "I'm likewise, suffering from many hardships and a fever of wrong livelihood, and even though I meet the Tathāgata, my illness isn't healed, and I haven't yet attained unsurpassed peace and permanence.",
        "source": "T12n0374_002:0377a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來便欲放捨，入於涅槃？",
        "translation": "How does the Tathāgata then want to abandon them and enter nirvāṇa?",
        "source": "T12n0374_002:0377a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如醉人，不自覺知，不識親踈、母女、姊妹，迷荒婬亂，言語放逸，臥糞穢中。",
        "translation": "They're like a drunken person who doesn't know themselves, doesn't recognize family, mother, daughter, or sister, is deluded and disorderly, speaks freely, and lies down in a filthy dung heap.",
        "source": "T12n0374_002:0377a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有良師，與藥令服，服已吐酒，還自憶識，心懷慚愧，深自剋責，酒為不善諸惡根本，若能除斷，則遠眾罪。",
        "translation": "A good teacher then gives him medicine to take, and after taking it, he spits out the wine, recalls it himself, feels conscience, and deeply rebukes himself for recognizing that wine is the root of unwholesome evils; if he could stop it, he'd be free of many sins.",
        "source": "T12n0374_002:0377a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，往昔已來，輪轉生死，情色所醉，貪嗜五欲，非母母想、非姊姊想、非女女想，於非眾生生眾生想，是故輪轉受生死苦，如彼醉人臥糞穢中。",
        "translation": "\"Thus, I too have been in the past, transmigrating through birth and death, drunk with sensual desires, addicted to the five desires, thinking of something other than mother, sister, or daughter, and conceiving of sentient beings other than sentient beings, so I've transmigrated and suffered the pain of birth and death like a drunken man lying in filth.",
        "source": "T12n0374_002:0377a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來今當施我法藥，令我還吐煩惱惡酒，而我未得醒寤之心，云何如來便欲放捨，入於涅槃？",
        "translation": "Now, the Tathāgata will give me the Dharma medicine to return to the bad alcohol of affliction, but I haven't yet attained the mental state of awakening, so why then would I want to abandon myself and enter nirvāṇa?",
        "source": "T12n0374_002:0377a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，歎芭蕉樹以為堅實，無有是處。",
        "translation": "\"It's like a person who praises a plantain tree as being sturdy, thinking there's no place for it.",
        "source": "T12n0374_002:0377a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生亦爾，若歎我、人、眾生、壽命、養育、知見、作者、受者，是真實者，亦無是處，我等如是修無我想。",
        "translation": "\"So it is with sentient beings. If they praise self, person, sentient beings, life, nurturing, knowing, seeing, author, or recipient as true, there's no place for them, and we thus cultivate the notion of selflessness.",
        "source": "T12n0374_002:0377a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如漿滓，無所復用；是身亦爾，無我、無主。",
        "translation": "It's like dregs that have no further use; so is this body, which has no self and no owner.",
        "source": "T12n0374_002:0377a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如七葉花無有香氣；是身亦爾，無我、無主，我等如是，心常修習無我之想。",
        "translation": "Like the seven-leaf flower that has no fragrance, so too is this body without self or owner, and so are we, always cultivating the idea of selflessness in our minds.",
        "source": "T12n0374_002:0377b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說：『一切諸法無我、我所，汝諸比丘應當修習，如是修已，則除我慢，離我慢已，便入涅槃。』",
        "translation": "As the Buddha said, 'You monks should cultivate the idea that all things lack self and self-possession, and after thus cultivating it, you'll rid yourselves of self-conceit; after parting with self-conceit, you'll enter nirvāṇa.'",
        "source": "T12n0374_002:0377b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鳥跡，空中現者，無有是處。",
        "translation": "It's like a bird's tracks that appear in the sky, but there's no place for them.",
        "source": "T12n0374_002:0377b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有能修習無我想者，而有諸見，亦無是處。」",
        "translation": "Nor is there a place for someone who cultivates the notion of selflessness and has views that are not like that.\"",
        "source": "T12n0374_002:0377b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊讚諸比丘：「善哉，善哉！",
        "translation": "It was then that the Bhagavān praised the monks, \"Good, good!",
        "source": "T12n0374_002:0377b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等善能修無我想。」",
        "translation": "You're well able to cultivate the notion of selflessness.\"",
        "source": "T12n0374_002:0377b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘即白佛言：「世尊！",
        "translation": "The monks then said to the Buddha, \"Bhagavān!",
        "source": "T12n0374_002:0377b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等不但修無我想，亦更修習其餘諸想，所謂苦想、無常想、無我想。",
        "translation": "Not only do we cultivate the notion of selflessness, but we also cultivate the other notions, which are called the notions of suffering, impermanence, and selflessness.",
        "source": "T12n0374_002:0377b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如人醉，其心愐眩，見諸山河、石壁、草木、宮殿、屋舍、日月星辰，皆悉迴轉。",
        "translation": "Like a person who's drunk and whose mind is dazed, they see mountains, rivers, rock walls, trees, palaces, mansions, the sun, moon, and stars all turning around.",
        "source": "T12n0374_002:0377b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有不修苦、無常想、無我等想，如是之人不名為聖，多諸放逸，流轉生死。",
        "translation": "If someone doesn't cultivate perceptions of suffering, impermanence, and selflessness, such a person isn't called noble, has much dissipation, and wanders through birth and death.",
        "source": "T12n0374_002:0377b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_002:0377b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，我等善修如是諸想。」",
        "translation": "For this reason, we well cultivate such concepts.\"",
        "source": "T12n0374_002:0377b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸比丘：「諦聽，諦聽。",
        "translation": "It was then that the Buddha addressed the monks, \"Listen closely, listen closely!",
        "source": "T12n0374_002:0377b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝向所引醉人喻者，但知文字，未達其義。",
        "translation": "The parable of the drunkard you've cited only knows the words, but you haven't understood their meaning.",
        "source": "T12n0374_002:0377b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為義？",
        "translation": "What's its meaning?",
        "source": "T12n0374_002:0377b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼醉人，見上日月，實非迴轉，生迴轉想。",
        "translation": "Like a drunken person who sees the sun and moon above them, they really aren't turning around, and they give rise to the idea of turning around.",
        "source": "T12n0374_002:0377b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生亦爾，為諸煩惱無明所覆，生顛倒心，我計無我、常計無常、淨計不淨、樂計為苦，以為煩惱之所覆故。",
        "translation": "Similarly, sentient beings are hindered by the afflictions and ignorance, and they give rise to a mistaken mind that imagines self as selfless, permanence as impermanent, purity as impurity, and pleasure as suffering because they're hindered by the afflictions.",
        "source": "T12n0374_002:0377b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖生此想，不達其義，如彼醉人於非轉處，而生轉想。",
        "translation": "Although they give rise to this conception, they don't understand its meaning, like a drunken person who gives rise to the conception of change in a place that's not change.",
        "source": "T12n0374_002:0377b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我者即是佛義，常者是法身義，樂者是涅槃義，淨者是法義。",
        "translation": "'I' is the meaning of Buddha, 'permanent' is the meaning of the Dharma body, 'pleasant' is the meaning of nirvāṇa, and 'pure' is the meaning of the Dharma.",
        "source": "T12n0374_002:0377b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T12n0374_002:0377b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何而言有我想者，憍慢貢高流轉生死？",
        "translation": "\"How does it mean that someone with the conception of self is proud and arrogant, and that it carries on birth and death?",
        "source": "T12n0374_002:0377b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等若言，我亦修習無常、苦、無我等想，是三種修，無有實義。",
        "translation": "\"If you say that I also cultivate perceptions of impermanence, suffering, and selflessness, these are three cultivations that have no real meaning.",
        "source": "T12n0374_002:0377b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當說勝三修法，苦者計樂、樂者計苦，是顛倒法。",
        "translation": "Now, I will explain the three superior cultivations, which are mistakenly imagined when someone who's painful imagines what's pleasant and someone who's pleasant imagines what's painful.",
        "source": "T12n0374_002:0377b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無常計常、常計無常，是顛倒法。",
        "translation": "Impermanent imputes permanence and permanent imputes impermanence, which is a mistaken dharma.",
        "source": "T12n0374_002:0377b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無我計我、我計無我，是顛倒法。",
        "translation": "It's a mistaken state to impute selflessness as self and to impute selflessness as self.",
        "source": "T12n0374_002:0377b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不淨計淨、淨計不淨，是顛倒法。",
        "translation": "To impute impurity as pure and impute impurity as pure is a mistaken dharma.",
        "source": "T12n0374_002:0377b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如是等四顛倒法，是人不知正修諸法。",
        "translation": "With these four mistaken concepts, a person doesn't know the correct cultivation of dharmas.",
        "source": "T12n0374_002:0377b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝諸比丘，於苦法中生於樂想，於無常中生於常想，於無我中生於我想，於不淨中生於淨想。",
        "translation": "\"You monks, in the midst of suffering there arises the idea of happiness, in the midst of impermanence there arises the idea of permanence, in the midst of selflessness there arises the idea of self, and in the midst of impurity there arises the idea of purity.",
        "source": "T12n0374_002:0377b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間亦有常樂我淨，出世亦有常樂我淨。",
        "translation": "There's also permanence, happiness, self, and purity in the mundane world, and there's permanence, happiness, self, and purity in the supramundane world.",
        "source": "T12n0374_002:0377c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間法者有字無義，出世間者有字有義。",
        "translation": "Worldly dharmas have words and no meaning, but transmundane dharmas have words and meaning.",
        "source": "T12n0374_002:0377c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0377c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間之法有四顛倒，故不知義。",
        "translation": "The world's dharmas have four mistaken attachments, so they don't know their meaning.",
        "source": "T12n0374_002:0377c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0377c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有想顛倒、心倒、見倒。",
        "translation": "\"There's mistaken perception, mistaken mind, and mistaken views.",
        "source": "T12n0374_002:0377c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以三倒故，世間之人，樂中見苦、常見無常、我見無我、淨見不淨，是名顛倒。",
        "translation": "Because of these three errors, worldly people see suffering in pleasure, common impermanence, self as selfless, and purity as impure, which is called being mistaken.",
        "source": "T12n0374_002:0377c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以顛倒故，世間知字而不知義。",
        "translation": "Because of their mistakenness, the world knows the words but doesn't know their meaning.",
        "source": "T12n0374_002:0377c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為義？",
        "translation": "What's the meaning?",
        "source": "T12n0374_002:0377c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無我者名為生死，我者名為如來；無常者聲聞緣覺，常者如來法身；苦者一切外道，樂者即是涅槃；不淨者即有為法，淨者諸佛菩薩所有正法；是名不顛倒。",
        "translation": "What's without self is called birth and death, and what's self is called the Tathāgata; what's impermanent is the śrāvakas and pratyekbuddhas, and what's constant is the Tathāgata's Dharma body; what's painful is all the non-Buddhists, and what's pleasant is nirvāṇa; what's impure is the property of being, and what's pure is all the right dharmas of the buddhas and bodhisattvas; this is called not mistaken.",
        "source": "T12n0374_002:0377c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不倒故，知字知義。",
        "translation": "Because they aren't mistaken, they know the words and understand their meaning.",
        "source": "T12n0374_002:0377c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲遠離四顛倒者，應知如是常、樂、我、淨。」",
        "translation": "Those who want to avoid the four mistaken attachments should know that they are thus permanent, pleasant, self, and pure.\"",
        "source": "T12n0374_002:0377c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘白佛言：「世尊！",
        "translation": "The monks then said to the Buddha, \"Bhagavān!",
        "source": "T12n0374_002:0377c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說離四倒者，則得了知常、樂、我、淨。",
        "translation": "\"When someone parts with the four errors as the Buddha taught, then they'll attain knowledge of permanence, happiness, self, and purity.",
        "source": "T12n0374_002:0377c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來今者永無四倒，則已了知常樂我淨。",
        "translation": "Now, the Tathāgata is never in possession of the four errors, so he has already known permanence, bliss, self, and purity.",
        "source": "T12n0374_002:0377c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若已了知常樂我淨，何故不住一劫半劫，教導我等，令離四倒，而見放捨，欲入涅槃？",
        "translation": "If he had already known permanence, bliss, self, and purity, why didn't he stop teaching us for an eon or so, causing us to part with the four errors, see abandonment, and want to enter nirvāṇa?",
        "source": "T12n0374_002:0377c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來若見顧念教勅，我當至心頂受修習。",
        "translation": "\"If the Tathāgata sees and pays close attention to my instructions, I will wholeheartedly accept and cultivate them.",
        "source": "T12n0374_002:0377c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來若入於涅槃者，我等云何與是毒身同共止住，修於梵行？",
        "translation": "If the Tathāgata enters nirvāṇa, how will we abide together with this poisonous body and cultivate the religious practice?",
        "source": "T12n0374_002:0377c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等亦當隨佛世尊，入於涅槃。」",
        "translation": "We will also follow the Bhagavān into nirvāṇa.\"",
        "source": "T12n0374_002:0377c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸比丘：「汝等不應作如是語，我今所有無上正法，悉以付囑摩訶迦葉。",
        "translation": "It was then that the Buddha addressed the monks, \"You shouldn't say such a thing; now, I've entrusted all of my unsurpassed right teachings to Mahākāśyapa.",
        "source": "T12n0374_002:0377c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迦葉者，當為汝等作大依止，猶如如來為諸眾生作依止處，摩訶迦葉亦復如是，當為汝等作依止處。",
        "translation": "This is Kāśyapa who will be a great support for you, just as the Tathāgata makes a support for sentient beings, so too will Mahākāśyapa make a support for you.",
        "source": "T12n0374_002:0377c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大王，多所統領，若遊巡時，悉以國事付囑大臣。",
        "translation": "It's like a great king who has many commanders and, when he travels around, entrusts his ministers with the affairs of the country.",
        "source": "T12n0374_002:0377c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾，所有正法，亦以付囑摩訶迦葉。",
        "translation": "So too, the Tathāgata entrusts Mahākāśyapa with all the right principles.",
        "source": "T12n0374_002:0377c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知，先所修習無常、苦想，非是真實。",
        "translation": "You should know that the previously cultivated notions of impermanence and suffering aren't real.",
        "source": "T12n0374_002:0377c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如春時，有諸人等，在大池浴乘船遊戲，失琉璃寶，沒深水中。",
        "translation": "It's like when some people were swimming in a boat in a large lake in spring and lost their beryl jewels, which plunged into deep water.",
        "source": "T12n0374_002:0377c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸人，悉共入水，求覓是寶，競捉瓦石、草木、沙礫，各各自謂得琉璃珠，歡喜持出，乃知非真。",
        "translation": "Those people all went into the water together, searched for that treasure, and competed for tiles, rocks, wood, sand, and gravel, each claiming to have found a lapis lazuli pearl and joyfully carrying it out, only to realize it wasn't real.",
        "source": "T12n0374_002:0378a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時寶珠猶在水中，以珠力故，水皆澄清。",
        "translation": "While the precious pearl was still in the water, the water was cleared by the power of the pearl.",
        "source": "T12n0374_002:0378a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是大眾乃見寶珠故在水下，猶如仰觀虛空月形。",
        "translation": "The whole crowd then saw that the precious pearl was therefore underwater, just like looking up and observing the shape of the moon in space.",
        "source": "T12n0374_002:0378a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時眾中有一智人，以方便力，安徐入水，即便得珠。",
        "translation": "Then, there was a wise man among the crowd who, with the power of skillful means, quietly entered the water and even obtained the pearl.",
        "source": "T12n0374_002:0378a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘，不應如是修習無常、苦、無我想、不淨想等，以為實義，如彼諸人，各以瓦石、草木、沙礫而為寶珠。",
        "translation": "You monks shouldn't thus cultivate concepts of impermanence, suffering, selflessness, and impurity for their true meaning, like those people who each use tiles and stones, grass and wood, and sand and gravel as precious pearls.",
        "source": "T12n0374_002:0378a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應當善學方便，在在處處常修我想、常、樂、淨想。",
        "translation": "You should skillfully train the skillful means to always cultivate the conceptions of self, permanence, happiness, and purity in every place.",
        "source": "T12n0374_002:0378a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復應當知，先所修習四法相貌，悉是顛倒。",
        "translation": "You should also know that the appearance of the four qualities you previously cultivated was mistaken.",
        "source": "T12n0374_002:0378a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲得真實修諸想者，如彼智人巧出寶珠，所謂我想、常、樂、淨想。」",
        "translation": "Those who want to truly cultivate these concepts are like that wise man who skillfully produces the precious pearl called the concepts of self, permanence, happiness, and purity.\"",
        "source": "T12n0374_002:0378a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘白佛言：「世尊！",
        "translation": "It was then that the monks said to the Buddha, \"Bhagavān!",
        "source": "T12n0374_002:0378a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛先說，諸法無我，汝當修學。",
        "translation": "As the Buddha first said, \"All things are without self, so you should train in them.",
        "source": "T12n0374_002:0378a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修學是已，則離我想。",
        "translation": "After cultivating this, you'll be free of the conception of self.",
        "source": "T12n0374_002:0378a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離我想者，則離憍慢。",
        "translation": "When you're free of the conception of self, you'll be free of conceit.",
        "source": "T12n0374_002:0378a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離憍慢者，得入涅槃。",
        "translation": "Being free of conceit, you'll enter nirvāṇa.",
        "source": "T12n0374_002:0378a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是義云何？」",
        "translation": "What does this mean?\"",
        "source": "T12n0374_002:0378a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「善哉，善哉！",
        "translation": "The Buddha addressed the monks, \"Good, good!",
        "source": "T12n0374_002:0378a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今善能諮問是義，為自斷疑。",
        "translation": "Now, you can well consult this meaning for yourself, so you can end your doubts.",
        "source": "T12n0374_002:0378a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如國王，闇鈍少智，有一醫師，性復頑嚚，而王不別，厚賜俸祿，療治眾病純以乳藥，亦復不知病起根原，雖知乳藥復不善解，或有風病、冷病、熱病、一切諸病，悉教服乳。",
        "translation": "Suppose there's a physician who's stubborn and insincere, but the king doesn't discriminate, gives him a generous salary, treats numerous illnesses simply with milk medicine, doesn't know the origin of the illnesses, doesn't understand well even though he knows the milk medicine, and teaches him to take milk for every illness, whether it's a windstorm, a cold illness, a feverish illness, or any other illness.",
        "source": "T12n0374_002:0378a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是王不別，是醫知乳好醜、善惡。",
        "translation": "The king doesn't distinguish between a doctor who knows that milk is good and ugly, good and bad.",
        "source": "T12n0374_002:0378a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有明醫曉八種術，善療眾病，知諸方藥，從遠方來。",
        "translation": "There's another learned doctor who knows eight techniques, treats many illnesses well, and knows prescriptions and medicines that come from far away.",
        "source": "T12n0374_002:0378a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時舊醫不知諮受，反生貢高輕慢之心。",
        "translation": "That old doctor didn't know how to consult them, but instead he became arrogant and despised them.",
        "source": "T12n0374_002:0378a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時明醫，即便依附，請以為師，諮受醫方祕奧之法，語舊醫言：『我今請仁以為師範，唯願為我宣暢解說。』",
        "translation": "Even then, the learned doctor relied on him, asked to be his teacher, consulted him on the mysterious ways of healing, and said to the old doctor, 'Now, I'd like to ask you to serve as my teacher and example; please explain it to me.'",
        "source": "T12n0374_002:0378a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊醫答言：『卿今若能為我給使四十八年，然後乃當教汝醫法。』",
        "translation": "The old doctor answered, 'If you could be my servant for 48 years, then I'll teach you the way to heal.'",
        "source": "T12n0374_002:0378a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼明醫即受其教：『我當如是，我當如是，隨我所能，當給走使。』",
        "translation": "The bright doctor then accepted his teaching, 'Thus will I be, thus will I be, and as I am able, I will give aid to those who go.'",
        "source": "T12n0374_002:0378a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時舊醫，即將客醫共入見王。",
        "translation": "The old physician then brought the visiting physician in to see the king.",
        "source": "T12n0374_002:0378b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時客醫，即為王說種種醫方及餘伎藝：『大王當知，應善分別，此法如是，可以治國；此法如是，可以療病。』",
        "translation": "The visiting doctor then explained the various prescriptions and other techniques to the king, 'You should know, Great King, that you should well discern that this is the way to heal the country and this is the way to treat illness.'",
        "source": "T12n0374_002:0378b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國王聞是語已，方知舊醫癡騃無智，即便驅逐，令出國界，然後倍復恭敬客醫。",
        "translation": "After hearing these words, the king realized that the old doctor was deluded and had no wisdom, so he expelled him and made him leave the country's borders.",
        "source": "T12n0374_002:0378b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時客醫作是念言：『欲教王者，今正是時。』",
        "translation": "The visiting doctor then had this thought, 'Now is the time to teach the king.'",
        "source": "T12n0374_002:0378b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語王言：『大王於我實愛念者，當求一願。』",
        "translation": "He then said to the king, 'Your majesty, you really love me, so you must ask for one vow.'",
        "source": "T12n0374_002:0378b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即答言：『從此右臂及餘身分，隨意所求，一切相與。』",
        "translation": "The king then answered, 'From this right arm and the rest of my body, I'll grant whatever you wish.'",
        "source": "T12n0374_002:0378b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼客醫言：『王雖許我一切身分，然我不敢多有所求。",
        "translation": "The guest doctor said, 'Although the king has granted me all my positions, I dare not ask for more.",
        "source": "T12n0374_002:0378b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今所求者，願王宣令，一切國內，從今已往，不得復服舊醫乳藥。",
        "translation": "May the king declare that whatever you ask for now, you mustn't take the old doctor's milk medicine again from now on within the country.",
        "source": "T12n0374_002:0378b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_002:0378b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是藥毒害，多傷損故。",
        "translation": "This medicine is poisonous and harmful, and it often causes injury.",
        "source": "T12n0374_002:0378b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若故服者當斬其首。",
        "translation": "If someone takes it for this reason, they'll be beheaded.",
        "source": "T12n0374_002:0378b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷乳藥已，終更無有橫死之人，常處安樂，故求是願。』",
        "translation": "After cutting off the medicine for breast milk, there will never be another person who dies horribly and will always be in well-being; therefore, I ask for this vow.'",
        "source": "T12n0374_002:0378b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王答言：『汝之所求，蓋不足言。』",
        "translation": "The king then answered, 'What you're asking for is hardly worth saying.'",
        "source": "T12n0374_002:0378b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋為宣令：『一切國內，有病之人，皆悉不聽以乳為藥，若為藥者，當斬其首。』",
        "translation": "He then declared, 'None of the sick people in the country will be allowed to use milk as medicine, and if they do, their heads will be chopped off.'",
        "source": "T12n0374_002:0378b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時客醫以種種味和合眾藥，謂辛、苦、醎、甜、醋等味，以療眾病，無不得差。",
        "translation": "It was then that the visiting physician combined various flavors of medicine, namely, pungent, bitter, salty, sweet, and vinegary, to treat various illnesses, without fail.",
        "source": "T12n0374_002:0378b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後不久，王復得病，即命是醫：『我今病重，困苦欲死，當云何治？』",
        "translation": "Not long after that, the king again became ill and ordered this doctor, 'Now that I'm seriously ill and am about to die from suffering, what treatment will I get?'",
        "source": "T12n0374_002:0378b18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醫占王病，應用乳藥，尋白王言：『如王所患，應當服乳。",
        "translation": "The doctor who had divined the king's illness and applied the milk medicine found out and said to the king, 'As the king is suffering, he should take milk.",
        "source": "T12n0374_002:0378b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於先時，所斷乳藥，是大妄語。",
        "translation": "The medicine I had previously stopped using for milk was a big lie.",
        "source": "T12n0374_002:0378b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今若服者，最能除病，王今患熱，正應服乳。』",
        "translation": "If I were to take it now, it would be most effective in removing the illness, and now that the king has fever, he should take the milk.'",
        "source": "T12n0374_002:0378b21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王語醫：『汝今狂耶？",
        "translation": "The king then said to the doctor, 'Are you crazy now?'",
        "source": "T12n0374_002:0378b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為熱病乎？",
        "translation": "Is it because of fever?",
        "source": "T12n0374_002:0378b23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而言服乳，能除此病。",
        "translation": "He said that taking milk would remove this illness.",
        "source": "T12n0374_002:0378b23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝先言毒，今云何服？",
        "translation": "You first said it was poisonous, so why are you taking it now?",
        "source": "T12n0374_002:0378b23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲欺我耶？",
        "translation": "Do you want to deceive me?",
        "source": "T12n0374_002:0378b24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先醫所讚，汝言是毒，令我驅遣。",
        "translation": "Praised by previous doctors, you said it was poisonous and caused me to expel it.",
        "source": "T12n0374_002:0378b24_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今復言好，最能除病。",
        "translation": "Now, you again say it's good, and it's most effective in removing illness.",
        "source": "T12n0374_002:0378b25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言，我本舊醫，定為勝汝。』",
        "translation": "As you say, I was once an old doctor, and I'm sure I'll surpass you.'",
        "source": "T12n0374_002:0378b25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時客醫復語王言：『王今不應作如是語，如虫食木，有成字者，此虫不知是字非字；智人見之，終不唱言是虫解字，亦不驚怪。",
        "translation": "The visiting doctor then again said to the king, 'Now, the king shouldn't say such a thing. Suppose a worm eats wood and forms a word, but that worm doesn't know whether it's a word or not; when a wise person sees it, they never say, 'That worm understands words, and they aren't surprised.'",
        "source": "T12n0374_002:0378b26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王當知，舊醫亦爾，不別諸病，悉與乳藥，如彼虫道，偶成於字。",
        "translation": "You should know, Your Majesty, that the old doctors, too, didn't discriminate between illnesses and gave milk and medicine, just like that worm's path, which occasionally formed words.",
        "source": "T12n0374_002:0378b29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是先舊醫，不解乳藥好醜、善惡。』",
        "translation": "This is an old doctor who didn't understand the good and ugly, good and bad aspects of milk and medicine.'",
        "source": "T12n0374_002:0378c01_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王問言：『云何不解？』",
        "translation": "The king then asked, 'Why didn't you understand it?'",
        "source": "T12n0374_002:0378c02_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客醫答王：『是乳藥者，亦是毒害，亦是甘露。",
        "translation": "The guest doctor answered the king, 'This is milk as medicine, which is also poisonous and also nectar.",
        "source": "T12n0374_002:0378c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是乳復名甘露？",
        "translation": "How is this milk again called ambrosia?'",
        "source": "T12n0374_002:0378c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是牸牛，不食酒糟、滑草、麥[麥*弋]，其犢調善，放牧之處不在高原，亦不下濕，飲以清流，不令馳走，不與特牛同共一群，飲餧調適，行住得所。",
        "translation": "\"Suppose a cow doesn't eat lees, smooth grass, or wheat [barley*eggs], its calves are well-adjusted, it grazes on a plateau that's not high, it doesn't get wet, it drinks from a clean stream, it doesn't run away, it doesn't share a herd with special cows, it's fed and watered properly, and it has a proper place to walk and stay.",
        "source": "T12n0374_002:0378c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乳者，能除諸病，是則名為甘露妙藥。",
        "translation": "Such milk removes illnesses, and it's called the wonderful medicine of ambrosia.",
        "source": "T12n0374_002:0378c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除是乳已，其餘一切皆名毒害。』",
        "translation": "After removing this kind of milk, all the others are called poisonous.'",
        "source": "T12n0374_002:0378c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大王聞是語已，讚言大醫：『善哉，善哉！",
        "translation": "After hearing these words, the king praised the doctor, saying, 'Good, good!",
        "source": "T12n0374_002:0378c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日，始知乳藥善惡、好醜。』",
        "translation": "From this day on, I've come to know that milk medicine is good, bad, and good and ugly.'",
        "source": "T12n0374_002:0378c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便服之，病得除愈。",
        "translation": "He then took it and was cured of his illness.",
        "source": "T12n0374_002:0378c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋時宣令一切國內，從今已往當服乳藥。",
        "translation": "He then ordered all the country to take the milk medicine from now on.",
        "source": "T12n0374_002:0378c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國人聞之皆生瞋恨，咸相謂言：『大王今者為鬼所持，為狂顛耶？",
        "translation": "When the people there heard about it, they all became angry and said to each other, 'Is the king being held by a ghost or is he crazy?'",
        "source": "T12n0374_002:0378c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而誑我等，復令服乳。』",
        "translation": "They deceived us and made us drink milk again.'",
        "source": "T12n0374_002:0378c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切人民，皆懷瞋恨，悉集王所。",
        "translation": "All the people were angry and gathered at the king's place.",
        "source": "T12n0374_002:0378c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『汝等不應於我而生瞋恨，而此乳藥服與不服，悉是醫教，非是我咎。』",
        "translation": "The king said, 'You shouldn't become angry with me, and whether you take or don't take this milk and medicine is the doctor's teaching, not mine.'",
        "source": "T12n0374_002:0378c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大王及諸人民，踊躍歡喜，倍共恭敬，供養是醫。",
        "translation": "The king and his people then rejoiced and rejoiced, and they all paid homage to this doctor.",
        "source": "T12n0374_002:0378c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切病者皆服乳藥，病悉除愈。",
        "translation": "All the sick took the milk medicine, and their illnesses were all healed.",
        "source": "T12n0374_002:0378c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘！",
        "translation": "\"You monks!",
        "source": "T12n0374_002:0378c18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，亦復如是，為大醫王，出現於世，降伏一切外道邪醫，諸王眾中唱如是言：『我為醫王。』",
        "translation": "You should know that the Tathāgata, the Worthy, the Perfectly Omniscient, the Perfectly Practiced, the Well Gone, the Understander, the Unsurpassed One, the Trainer, the Teacher of Gods and People, the Buddha, and the World Honored One are likewise great healing kings who appear in the world and subdue all the mistaken doctors of non-Buddhists, and who sing among the kings, saying, 'I am the healing king.'",
        "source": "T12n0374_002:0378c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲伏外道，故唱是言：『無我、無人、眾生、壽命、養育、知見、作者、受者。』",
        "translation": "Desiring to subdue the non-Buddhists, he said, 'There's no self, no person, sentient beings, life span, nurturing, knowledge, views, author, or recipient.'",
        "source": "T12n0374_002:0378c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當知，是諸外道所言我者，如虫食木，偶成字耳。",
        "translation": "Monks, you should know that what these non-Buddhists call self is like a bug eating wood and occasionally forming words.",
        "source": "T12n0374_002:0378c23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故如來於佛法中，唱言無我，為調眾生故、為知時故，說是無我。",
        "translation": "That's why the Tathāgata teaches that selflessness is proclaimed in the Buddha's teaching, which is explained as selfless for the sake of disciplining sentient beings and for the sake of knowing the time.",
        "source": "T12n0374_002:0378c24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有因緣故，亦說有我。",
        "translation": "Because there are causes and conditions, it's also said that there's a self.",
        "source": "T12n0374_002:0378c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼良醫，善知於乳是藥非藥，非如凡夫所計吾我。",
        "translation": "Like a good doctor who well knows that milk is medicine and not medicine, he doesn't think of self as ordinary people think of self.",
        "source": "T12n0374_002:0378c26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫愚人所計我者，或言大如拇指、或如芥子、或如微塵；如來說我悉不如是，是故說言，諸法無我，實非無我。",
        "translation": "Ordinary foolish people conceptualize self, saying that it's as big as a thumb, or as small as a mustard seed, or as tiny as a particle of dust; the Tathāgata says that none of them are like this, so he says that things are without self, but they really aren't without self.",
        "source": "T12n0374_002:0378c27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是我？",
        "translation": "What's a self?",
        "source": "T12n0374_002:0379a01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法是實、是真、是常、是主、是依、性不變易者，是名為我。",
        "translation": "\"If things are real, true, permanent, principal, and dependent, and their nature doesn't change, this is called the self.",
        "source": "T12n0374_002:0379a01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼大醫善解乳藥，如來亦爾，為眾生故，說諸法中真實有我。",
        "translation": "Like that great doctor who well understands the medicine of milk, so too does the Tathāgata explain for the sake of sentient beings that there really is a self in all dharmas.",
        "source": "T12n0374_002:0379a03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等四眾，應當如是修習是法。」",
        "translation": "You four people should thus cultivate this teaching.\"",
        "source": "T12n0374_002:0379a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般涅槃經卷第二",
        "translation": "Mahāparinirvāṇa-sūtra, Volume 2",
        "source": "T12n0374_002:0379a06_0",
        "is_bad_quality": false
    }
]