[
    {
        "source_sentence": "毘耶娑問經卷下",
        "translation": "Second Fascicle of the Sutra of Vaiśravaṇa",
        "source": "T12n0354_002:0228c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏婆羅門瞿曇般若流支譯",
        "translation": "Yuan Wei Bhramun Gautama Prajñāruci Translation",
        "source": "T12n0354_002:0228c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Again, great sage!",
        "source": "T12n0354_002:0228c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四大天王生退之相，復應當知。",
        "translation": "\"Again, you should know the four heavenly kings' appearances as they arise and retreat.",
        "source": "T12n0354_002:0228c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "Thus, great sage!",
        "source": "T12n0354_002:0228c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於貧人、若於病人生憐愍心，若衣、若食、病患因緣所須醫藥隨時給施，為除寒苦。",
        "translation": "If he has compassion for the poor and the sick, he gives them clothing, food, and medicines needed for their conditions at any time to remove cold and suffering.",
        "source": "T12n0354_002:0228c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道巷殖樹，行人坐息。",
        "translation": "They plant trees in the roads and lanes, so pedestrians can sit and rest there.",
        "source": "T12n0354_002:0228c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造立池、井、溝渠、水槽，給施一切。",
        "translation": "They build ponds, wells, ditches, and water troughs, and they give alms to all of them.",
        "source": "T12n0354_002:0228c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是信心、喜心施與彼人。",
        "translation": "Thus, he gives them to others with faith and joy.",
        "source": "T12n0354_002:0228c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是善業因緣，臨欲死時，身無垢穢亦不羸瘦，身色不變，不膩、不爛，一切身分不受苦惱、聲不破壞，諸親眷屬悉皆聚集。",
        "translation": "As a result of such good actions, when they're about to die, their bodies are undefiled and not emaciated, their appearance remains unchanged, they aren't greasy or rotten, their whole identity isn't subject to suffering and distress, their voice doesn't break, and their relatives and dependents are all gathered together.",
        "source": "T12n0354_002:0228c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無分散者，故不憂惱、不患飢渴、腳不申縮、不受苦惱、不失便利。",
        "translation": "Because they aren't distracted, they aren't sad and troubled, don't suffer hunger and thirst, don't have their legs shrunken, don't experience pain and discomfort, and don't lose their convenience.",
        "source": "T12n0354_002:0229a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "境界不礙，故不愁苦、諸根不壞。",
        "translation": "Because the objective realm isn't obstructed, he isn't sad and distressed, and his faculties aren't destroyed.",
        "source": "T12n0354_002:0229a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是一切樂足，不苦惱死。",
        "translation": "Thus, he has all the pleasures and satisfactions, and he doesn't suffer painful death.",
        "source": "T12n0354_002:0229a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若捨身時，識心歡喜，見四天王、諸天之眾在樹林中戲樂之處。",
        "translation": "\"If his conscious mind rejoices when he gives up his body, he sees the four heavenly kings and the multitude of gods in a forest where they play and enjoy themselves.",
        "source": "T12n0354_002:0229a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見天眾已，死屍面色如生蓮花，口出好香——其香猶如阿娑婆香——種種花香隨風熏屍。",
        "translation": "After seeing the host of gods, the dead corpse's face is colored like a lotus growing, and a nice fragrance comes out of its mouth - a fragrance like the fragrance of an asaru - and the fragrance of various flowers perfumes the corpse with the wind.",
        "source": "T12n0354_002:0229a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼死人識。",
        "translation": "That dead person's consciousness.",
        "source": "T12n0354_002:0229a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見四大王天中生處父母相近。",
        "translation": "He sees the proximity of his father and mother at birth in the four great king heavens.",
        "source": "T12n0354_002:0229a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，天中彼父天子在戲樂處遊行嬉戲，欲心起發，右手摩觸天女臍下。",
        "translation": "\"At the time, that father god in the heavens was promenading and playing in a place of play, and his desire arose, so he touched the goddess's lower navel with his right hand.",
        "source": "T12n0354_002:0229a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以摩觸故，識託懷中，至滿七日乃有頭髮具足莊嚴，天童子生。",
        "translation": "As a result of that touch, his consciousness is entrusted to his bosom, and when seven days have passed, there's a young god child with full hair and adornment who's born.",
        "source": "T12n0354_002:0229a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生即知欲，戲笑、歌舞一切皆能。",
        "translation": "Immediately after birth, he knows what he wants, and he's capable of playing, laughing, singing, and dancing.",
        "source": "T12n0354_002:0229a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼四大王諸天住處，所有宮殿純金為地，種種莊嚴、種種綵色、彫飾分明，百千天女在天宮殿，有百千樹妙莊嚴枝，有隨意風觸身受樂。",
        "translation": "Those four great kings of the gods reside in palaces and halls made of pure gold, adorned with various decorations and colors, and clearly decorated with carvings, with a hundred thousand goddesses in their palaces and halls, and with a hundred thousand trees with marvelously adorned branches, and with a breeze at will that touches their bodies and produces pleasure.",
        "source": "T12n0354_002:0229a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼四大王天眾住處，城隍平正，其城四方，縱廣八萬四千由旬。",
        "translation": "\"The four great celestial kings reside in a city that's flat and square, and its circumference is 84,000 leagues wide.",
        "source": "T12n0354_002:0229a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，於彼林中有天寶珠以為燈明，踈妙繒綵以衣樹身，懸幡枝上。",
        "translation": "You should know, great sage, that in that forest there are celestial jewels that serve as lamps, and there's a wonderful silken fabric that covers the tree's body and hangs from its banners.",
        "source": "T12n0354_002:0229a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹極柔軟，諸天見之心生愛樂，於彼林中吹笛、拍手、琵琶、鼓等，和合樂聲在彼窟中。",
        "translation": "The tree is so flexible that the gods' hearts are delighted to see it, and in that forest they blow flutes, clap their hands, play lutes, and play drums, combining them with musical sounds in that cave.",
        "source": "T12n0354_002:0229a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天童子種種食力，所謂揣食天飯善香，能生天力，香、色、味等功德具足。",
        "translation": "That celestial boy has various powers of food, which are described as the good smell of rice that's eaten by people in the sky, which produces celestial powers and is replete with the qualities of fragrance, color, and taste.",
        "source": "T12n0354_002:0229a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有天粳米名蓮華光，自然而熟，甜如甘露，種種色味具足相應。",
        "translation": "There's celestial millet called lotus-bright rice that naturally matures, is sweet like sweet dew, and is replete with various forms and flavors.",
        "source": "T12n0354_002:0229a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二食盤，一是金盤、一是寶盤，隨彼天子所須飯食何者何等、如是如是，彼彼飲食皆盤中生。",
        "translation": "There are two plates of food, one gold and the other jeweled, and whatever food that god requires to feed him, such and such, that food is produced in those plates.",
        "source": "T12n0354_002:0229a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天爾時牟佉離汁生彼盤中即變為花，名阿娑婆。",
        "translation": "At that point in time, the goddess Mokṣadri's juice is born in his dish and transforms into a flower called asaiva.",
        "source": "T12n0354_002:0229a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有善香，其汁清冷，飲則涼樂。",
        "translation": "It has a nice fragrance, and its juice is cool and refreshing when drunk.",
        "source": "T12n0354_002:0229b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復彼香令天童子醉樂怡適。",
        "translation": "Again, that fragrance makes the celestial boy drunk and happy.",
        "source": "T12n0354_002:0229b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼四大王子[阿-可+聶]宮殿，周匝常有妙好華蔓，多饒妙花莊嚴殿柱，以如是柱莊嚴宮殿、金寶、金剛。",
        "translation": "The palace of those four great princes [a-ko+nip] is always surrounded by a wonderful, flowery vine that produces many wonderful flowers to adorn the pillars of the palace, and such pillars adorn the palace, the gold treasure, and the vajra.",
        "source": "T12n0354_002:0229b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有勝天樹，娑羅翅蔓上攀樹枝。",
        "translation": "There's a pre-eminent celestial tree with branches climbing up from the saffron vines.",
        "source": "T12n0354_002:0229b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有百千柱床臥敷具莊嚴宮殿。",
        "translation": "There are a hundred thousand pillar beds and bedding adorning the palace.",
        "source": "T12n0354_002:0229b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六萬天女在中行坐，令彼宮殿端嚴勝妙。",
        "translation": "Sixty thousand goddesses walk and sit in them, making their palace ornamented and marvelous.",
        "source": "T12n0354_002:0229b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女殊勝身相、舉動皆可觀瞻，天衣光明莊嚴其身，妙聲、環釧以姿其媚，善香妙色，欲心相應，身極軟弱。",
        "translation": "Their excellent physical appearance and movements are all visible, and they are adorned by the radiance of their heavenly robes, the beauty of their fine voice and rings and bracelets, and their fine fragrance and form are associated with desire and mind, and their bodies are extremely weak.",
        "source": "T12n0354_002:0229b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歌舞、戲笑恒常不絕，多有姿媚，兩兩共合出美妙聲與笛一音。",
        "translation": "Their singing, dancing, and laughter are always incessant, and they have lots of grace and beauty as they combine two and two to produce a beautiful sound and the same sound of a flute.",
        "source": "T12n0354_002:0229b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天宮殿如是具足。",
        "translation": "Their celestial palace is thus replete.",
        "source": "T12n0354_002:0229b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天宮柱金寶間錯，懸以繒幡，處處垂下。",
        "translation": "Their celestial palace pillars are interspersed with gold and jewelry, and they hang silken banners everywhere.",
        "source": "T12n0354_002:0229b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼四大王受勝欲樂。",
        "translation": "\"Those four great kings experience superior desires and pleasures.",
        "source": "T12n0354_002:0229b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提頭賴吒、毘樓勒叉、毘樓博叉、拘毘樓等，彼四大王在宮殿中，喜笑、歌舞、嘯咏等聲，天食充飽，諸根喜樂，善愛意生。",
        "translation": "Those four great kings, Dhṛtarāṣṭra, Virūḍhaka, Virūpākṣa, and Kubilu, are in their palaces, delighting in laughter, singing and dancing, chanting and other sounds, filling up on heavenly food, delighting in their faculties, and generating good feelings of love.",
        "source": "T12n0354_002:0229b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處勝樂皆悉具足。",
        "translation": "They're fully endowed with excellent happiness.",
        "source": "T12n0354_002:0229b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼四大王天眾之中，諸天童子長臂洪直，不麁、不細，行如醉象，具丈夫力，柔軟之身具足天相。",
        "translation": "Among the four great kings of the heavens, those celestial boys have long, straight arms, are neither crude nor fine, walk like drunken elephants, have the strength of a strong man, and have a supple body complete with the characteristics of a god.",
        "source": "T12n0354_002:0229b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天行時，則有勝香熏一由旬。",
        "translation": "When those gods walk, they have a wonderful fragrance that smells for a leap of faith.",
        "source": "T12n0354_002:0229b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0229b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼壽天年五百歲命，無中夭傷。",
        "translation": "Their life span is 500 years, and they don't suffer a death in the interim.",
        "source": "T12n0354_002:0229b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處勝樂一切具受，開眼看視有喜愛相。",
        "translation": "They are endowed with all the pleasures of that place, and they open their eyes and look at them with joy and delight.",
        "source": "T12n0354_002:0229b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天眾多有戲處——謂蘇婆伽荼迦之處、迦曇婆迦及毘摩羅、光明莊嚴林王之處、闍那迦等勝戲樂處，有如是等第一香處——受用心喜。",
        "translation": "Those gods have many places of play - places like Subhakataka, Kadambaka and Vimala, the forest king of Radiant Adornment, and Jinagar - that are places of great pleasure, such as these first places of fragrance - and they experience mindful delight.",
        "source": "T12n0354_002:0229b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天子行彼處已，花、珠、金、寶間錯階陛。",
        "translation": "After they walk there, the sons of gods interlaced their steps with flowers, pearls, gold, and jewelry.",
        "source": "T12n0354_002:0229b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其階方正，勝妙莊嚴，名寶珠階。",
        "translation": "Their steps are square and perfectly ornamented, and they're called the jeweled steps.",
        "source": "T12n0354_002:0229b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百千天女妙聲歌咏，珠寶、樂器自然出聲，多受欲樂。",
        "translation": "A hundred thousand goddesses sing with exquisite voices, and jewelry and musical instruments naturally produce sounds that are often enjoyed with desire and pleasure.",
        "source": "T12n0354_002:0229b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「福盡命終則有相現：初則失影，不聞花香，迦陵、頻伽、天女妙聲耳不復聞。",
        "translation": "\"When their fortune ends and their life ends, there are appearances: at first, they lose their shadows, don't hear the scent of flowers, and their ears don't hear the marvelous sounds of Kali, Vṛji, and the goddesses anymore.",
        "source": "T12n0354_002:0229b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，又天眾中彼天童子。",
        "translation": "\"Great men, you should know that there's another celestial boy in the heavenly assembly.",
        "source": "T12n0354_002:0229c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於天宮殿眾集之處，至日不往彼宮殿中。",
        "translation": "Where there's a multitude of people gathered in the palace of Heaven, he doesn't go to that palace until sunrise.",
        "source": "T12n0354_002:0229c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百千天女，樹生瓔珞有妙勝花，俱翅羅聲、欲鳥之聲林中具有，心不生樂，在地旋轉。",
        "translation": "A hundred thousand goddesses with jeweled trees and marvelous flowers and the sounds of kumbhīra and birds of desire in the forest don't give rise to happiness in their minds, and they spin on the ground.",
        "source": "T12n0354_002:0229c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣裳垢膩，其身極熱，悲苦看視，地上旋轉。",
        "translation": "Their robes are soiled and their bodies are extremely hot, and they look sad and distressed as they spin around on the ground.",
        "source": "T12n0354_002:0229c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於花帳處心不憙樂，身中汗出。",
        "translation": "Their minds aren't happy in the place of a flower tent, and sweat breaks out from their bodies.",
        "source": "T12n0354_002:0229c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼目常開，今則眄瞬。",
        "translation": "Their eyes are always open, but now they glance away.",
        "source": "T12n0354_002:0229c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處動轉，如魚出水，為日所暴，翻覆迴轉，獨在地住。",
        "translation": "They move about like a fish out of water, are exposed to the sun, roll over, and turn around, and stand alone on the ground.",
        "source": "T12n0354_002:0229c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天女見已皆來圍遶，詳共悲哀，同聲啼哭，如是說言：『何期愛人欲向何處？",
        "translation": "\"When the goddesses see this, they all come around, share their sadness, and weep with one voice, saying, 'Where does your beloved wish to go?'",
        "source": "T12n0354_002:0229c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何期第一種種莊嚴柔軟之身——異異無垢，胸膺寬博，兩肩可憙——平正之身、柔軟之身？",
        "translation": "What will be the first of many kinds of adorned, supple bodies-unusual and undefiled, with a broad chest and two jolly shoulders-that are even and correct and supple?",
        "source": "T12n0354_002:0229c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何期戲處、遊戲常樂種種處行，今忽捨我、復捨天宮，欲向何處？』",
        "translation": "Where did he expect to find play and play in various places of constant pleasure, but now he's suddenly abandoned me and left the palace of heaven, where do he want to go?'",
        "source": "T12n0354_002:0229c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女既傷歎已，復說偈言：「『種種善心作，　　天樹妙莊嚴，　　此四大王處，　　多饒飲食樂。",
        "translation": "After the goddesses praised them, they also spoke in verse, saying, \"These are the various works of good intentions, the marvelous adornment of the celestial trees, and the abodes of these four great kings, where there's plenty of food and pleasure.",
        "source": "T12n0354_002:0229c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　有四柱相應，　　福德天勝處，　　多饒天女愛，　　豐華善心喜。",
        "translation": "Accompanied by the four pillars, it's a place of heavenly excellence, a place beloved by goddesses, and a place where flowers abound and good hearts rejoice.",
        "source": "T12n0354_002:0229c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何忽惡無常，　　令捨此而去？』",
        "translation": "Why is it that evil and impermanence suddenly cause them to abandon this place and depart?'",
        "source": "T12n0354_002:0229c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼諸天女如是圍遶，大聲號哭，涎出聲壞，並啼並言，可憐可愍。",
        "translation": "\"The goddesses thus surrounded them, cried out with a loud voice, broke their mouths, and cried out, saying, 'Pity and kindness!'",
        "source": "T12n0354_002:0229c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女作如是言，離而遠住，復申右臂取花散之，作如是言：『生善道去，君善道去。",
        "translation": "Those goddesses said this, withdrew, stayed far away, took a flower with their right arm, and scattered it, saying, 'Go away from here on the good road of birth, and go away on the good road of the ruler.",
        "source": "T12n0354_002:0229c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "向人界去，生福處地，信心犁之。』",
        "translation": "Go to the human realm, be born in a place of merit, and plow it with faith.'",
        "source": "T12n0354_002:0229c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知，彼天如是之身，彼欲死天既聞此已，如是思惟，自知身死。",
        "translation": "You should know that after hearing this, that god of desire for death thus reflects on it and knows for himself that he's dead.",
        "source": "T12n0354_002:0229c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極大愁苦，舉體烝熱。",
        "translation": "He's extremely distressed and distressed, and he raises his body to a feverish pitch.",
        "source": "T12n0354_002:0229c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以烝熱故，身則消洋猶如蘇渧，於彼死處墓田之中消洋盡壞，身體萎蔫。",
        "translation": "As a result of that fever, his body disappears like a drop of water, and in the grave field where he died, his ocean disappears and disintegrates, and his body withers.",
        "source": "T12n0354_002:0229c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有掃風來，吹彼天身作一千分，碎末散去遍在虛空。",
        "translation": "A sweeping wind blows that god's body into a thousand parts, and the fragments disintegrate and spread throughout space.",
        "source": "T12n0354_002:0229c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於彼處退欲受人身，見閻浮提父母和合。",
        "translation": "\"Retreating from that place, they want to accept their body and see Jambudvīpa's parents united.",
        "source": "T12n0354_002:0229c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼既見已，歡喜愛樂，即彼處生。",
        "translation": "After they see that, they rejoice and are delighted, and that's where they'll be born.",
        "source": "T12n0354_002:0229c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初受生已，其母相出，所謂喜笑，欲得勝食、不憙食肉，憙著赤衣、光明之衣，樂見人眾聚會之處，於兄弟等生勝愛心。",
        "translation": "After first being born, their mother's features emerge, which are described as joyful and smiling, desiring to obtain excellent food and not jealous of eating meat, jealous of wearing red robes and shining robes, happy to see where people gather, and they give rise to superior feelings of love for brothers and so forth.",
        "source": "T12n0354_002:0230a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藏內、脇中不受苦惱，無有涎唾、又不惡心、無有身病。",
        "translation": "He'll experience no suffering inside his hiding place or in his underarms, have no saliva, have no bad thoughts, and have no physical illness.",
        "source": "T12n0354_002:0230a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在彼藏中善具足、手，然後出生。",
        "translation": "They are well endowed with legs and hands in their hiding place, and then they are born.",
        "source": "T12n0354_002:0230a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼既生已，端正好色，見者愛念。",
        "translation": "\"Once they're born, they're well-appointed and well-appointed, and those who see them adore them.",
        "source": "T12n0354_002:0230a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼若增長，聞四王天心則歡喜。",
        "translation": "If they grow, their hearts rejoice when they hear about the four heavenly kings.",
        "source": "T12n0354_002:0230a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行施戒，飲酒不醉，心常惺悟，身則肥鮮，恒以眾香莊嚴其身。",
        "translation": "They cultivate generosity and morality, don't get drunk on alcohol, and their minds are always clear and awake, while their bodies are plump and fresh, and they are always adorned with many fragrances.",
        "source": "T12n0354_002:0230a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛林戲處、心多欲染，自身諸根樂近婦女，數數飲食，樂好美饍。",
        "translation": "They love woods and playgrounds, have much desire and defilement in their mind, delight in women with their own faculties, eat and drink repeatedly, and enjoy good food.",
        "source": "T12n0354_002:0230a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常修歌樂，身體膩潤，不黑、不白，其眼猶如青毘琉璃。",
        "translation": "He always cultivates song and music, and his body is exquisite, not black or white, and his eyes are like blue-violian lapis lazuli.",
        "source": "T12n0354_002:0230a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，四大王天退生人中本性如是，四大王處所熏相續有如是相。",
        "translation": "You should know, great sage, that the four great kings of gods retreat from the original nature of humans like this, and the four great kings' sense-fields continue to have this kind of appearance.",
        "source": "T12n0354_002:0230a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0230a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生捨離殺生、信心清淨、修行布施、離偷盜已，以佉陀尼、蒲闍尼、食梨、何朱沙、餘所須物衣裳、財物、寶珠、金等捨以布施，信樂心喜，以諸花等而為供養、禮拜塔寺，奉施供養。",
        "translation": "\"Suppose there's a sentient being who abandons killing, has pure faith, cultivates generosity, and abandons stealing, then gives Khadāna, Baojāni, food li, Hejusha, and other necessary things like clothing, possessions, precious beads, and gold as alms, is faithful and happy, makes offerings with flowers and so forth, venerates stūpas and temples, and makes offerings.",
        "source": "T12n0354_002:0230a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命終之時身不壞爛，膩垢、便利、臭穢皆無，心生歡喜，自憶念身所作善根。",
        "translation": "At the time of his death, his body doesn't rot, and his greasy, convenient, and smelly bodies are all gone.",
        "source": "T12n0354_002:0230a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨欲死時則有相現，面如金色，鼻正不曲，心不動亂，咽不杼氣，亦不咳[口*數]及上氣等，身不蒸熱，根不破壞，節脈不斷，身不苦惱，在於臥處身不迴轉，語聲不破。",
        "translation": "When he's about to die, his features appear, his face is golden, his nose is straight and not bent, his mind isn't disturbed, his throat doesn't loosen, he doesn't cough [his mouth*count], he doesn't have any upper breath, his body doesn't get hot and steamy, his faculties don't break down, his arteries don't stop, his body isn't distressed, he doesn't revert while lying down, and his speech isn't broken.",
        "source": "T12n0354_002:0230a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0230a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生或熱病死、或中毒死、或貪華果而上樹上墮樹而死、或食好食不消故死。",
        "translation": "Such a sentient being might die of a fever, die from poison, fall up a tree because they're craving flowers and fruits, or die from a good meal that doesn't last.",
        "source": "T12n0354_002:0230a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼欲捨陰內識往見三十三天宮殿莊嚴，有珠、金寶及金剛等於分分處種種間雜，作金魚形、摩伽羅形莊嚴殿門。",
        "translation": "They want to abandon the internal consciousness of the aggregates and go to see the palace and halls of the Trāyastriṃśa Heaven adorned with beads, gold jewelry, and adamantine things in various parts of the world that are made in the shape of goldfish or mahallas to adorn the entrance to the palace.",
        "source": "T12n0354_002:0230a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門上金幢有種種樂，迭相打觸出美好聲，能令心喜。",
        "translation": "On the golden banner above the gate are various kinds of music that repeatedly touch each other to produce a beautiful sound that causes the mind to rejoice.",
        "source": "T12n0354_002:0230a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "饒種種枝相應好樹莊嚴林中，謂憂荼、迦娑羅、栴檀。",
        "translation": "There are many kinds of branches that are associated with nice trees that adorn the forest, including the udumbara, kāṣāla, and sandalwood.",
        "source": "T12n0354_002:0230a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香汁作泥以塗地處，金色綵畫、白真珠帶遍懸樹下。",
        "translation": "The ground is coated with scented sap and painted with golden paint and ribbons of white real beads that are hung everywhere under the trees.",
        "source": "T12n0354_002:0230b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地皆柔軟，常有莊嚴，一切時淨。",
        "translation": "The ground is soft and supple, always adorned, and always purified.",
        "source": "T12n0354_002:0230b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有好金沙遍布其地，遶天珠焰以為燈鬘。",
        "translation": "There's fine gold sand spread all over the ground, and it's surrounded by the flames of heavenly pearls that serve as a lantern.",
        "source": "T12n0354_002:0230b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多有天女，天所分處光明莊嚴，常作天歌、美妙音聲，肘後莊嚴，胸有瓔珞、咽半瓔珞、臂釧、指環及耳璩等，種種莊嚴端正天女。",
        "translation": "There are many goddesses whose parts of the heavens are resplendent and adorned with light, who always sing divine songs and make beautiful sounds, are adorned behind their elbows, have diadems on their chests, half diadems on their throats, armlets, finger rings, earrings, and so forth, and are all kinds of adorned and correct goddesses.",
        "source": "T12n0354_002:0230b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，三十三天諸天之眾彼處天子，當於爾時遊戲受樂、受諸欲行，彼於戲處樹林中行，心生愛善。",
        "translation": "\"Great sage, you should know that the Trāyastriṃśa gods and godchildren of that place will play and enjoy pleasures and enjoy desirable activities at that time, and they'll walk through a forest in a playground and become fond of them.",
        "source": "T12n0354_002:0230b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼福德識見彼天上天子、天女同一處坐，心喜愛樂，速生彼處——如綖穿珠，牽綖珠走——不生異道。",
        "translation": "When their blessed consciousness sees the sons and daughters of that heaven sitting in the same place, their hearts are delighted and pleased, and they are quickly born there - like a thread thread putting through a pearl, pulling the thread and pearl along - and aren't born in another path.",
        "source": "T12n0354_002:0230b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於生時，彼天婦女手中花生。",
        "translation": "At the time of their birth, the peanuts are growing in the hands of that celestial woman.",
        "source": "T12n0354_002:0230b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女見已，自知有兒，即以此花授與夫言：『君今得子，可生歡喜。』",
        "translation": "When she sees it, she knows she has a child, so she gives this flower to her husband and says, 'Now that you've got a son, you can rejoice.'",
        "source": "T12n0354_002:0230b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天見之喜心增上，必知其妻得天童子。",
        "translation": "When that god sees that, his joy increases, and he surely knows that his wife has found a child in the heavens.",
        "source": "T12n0354_002:0230b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，二天心生喜悅。",
        "translation": "Thus, the hearts of the two gods are delighted.",
        "source": "T12n0354_002:0230b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，童子七日滿已，長髮旋動，清淨無垢，天衣具足。",
        "translation": "Thus, when the boy's seven days are up, his long hair swivels, he's pure and spotless, and he's fully clothed with heavenly robes.",
        "source": "T12n0354_002:0230b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼天未生，七日之中如是憶念：『我某處退，生此天中，某我父母，我作善業。』",
        "translation": "\"Before he was born in that heaven, he spent seven days thus remembering, 'Some place in which I regressed was born in this heaven, and some of my parents did good deeds for me.'",
        "source": "T12n0354_002:0230b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是思惟極生喜心，喜心生已，生則欲發，有欲即癡。",
        "translation": "Such reflection gives rise to a joyful mind, and when that joyful mind arises, desire arises, and having desire makes them deluded.",
        "source": "T12n0354_002:0230b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼樂欲者，遙見宮殿天戲樂處。",
        "translation": "That delightful desire is a distant view of the palace gods' playgrounds.",
        "source": "T12n0354_002:0230b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見已，悕望欲得，即便行往詣彼戲處，如醉象行。",
        "translation": "After seeing it that way, he desires to attain it, and even then he travels to that place of play like a drunken elephant.",
        "source": "T12n0354_002:0230b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臂如象手，洪圓纖長，胸則平正，臂如金色，上下身麁，中身則細。",
        "translation": "Their arms are like an elephant's hands, which are round and long, while their chests are flat and square, and their arms are golden, with the upper and lower body coarse and the middle body small.",
        "source": "T12n0354_002:0230b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行則詳審，深心勇健。",
        "translation": "His actions are detailed and deliberate, and his mind is deep and courageous.",
        "source": "T12n0354_002:0230b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "腰如弓弝，背骨平直，兩髀洪滿，如芭蕉樹，善知天法，髭鬢斷細。",
        "translation": "His waist is like a bow, his backbone is flat and straight, his thighs are full and resemble plantain trees, he well knows the teachings of heaven, and his beard is cut off and thin.",
        "source": "T12n0354_002:0230b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天香甚香，瓜甲赤薄，身體香潔，無主莊嚴取以嚴身。",
        "translation": "Their heavenly fragrance is fragrant, their armor is red and thin, and their body is fragrant and clean, with no lordly adornment taken to adorn their bodies.",
        "source": "T12n0354_002:0230b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天無病苦，身有善香，著妙天衣，色相殊妙，天華嚴身，於宮殿中次第漸行。",
        "translation": "The gods have no illness or pain, their bodies are well-permeated with fragrance, they're clothed in fine celestial robes, their appearance is marvelous, and their bodies are adorned with celestial flowers as they walk step-by-step through the palace.",
        "source": "T12n0354_002:0230b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼處見有無主天女，見天童子，一切悉來圍遶而住，作如是言：『聖子！",
        "translation": "\"There, they see a lordless goddess who sees a child of the gods, and they all come and surround him, saying, 'Noble son!",
        "source": "T12n0354_002:0230b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來。",
        "translation": "Come well.",
        "source": "T12n0354_002:0230b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來，聖子！",
        "translation": "Come well, noble son!",
        "source": "T12n0354_002:0230b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此汝宮殿，我無夫主，久離夫主，獨有童子。",
        "translation": "\"Here in your palace, I have no husband or mistress, and I've been alone with a child after a long absence from my husband or mistress.",
        "source": "T12n0354_002:0230b29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今色少，妙色具足，應相供養，乳若金瓶，面如蓮花開敷之色。",
        "translation": "Now, I'm young in appearance, full of marvelous colors, worthy of offerings, with breasts like a golden vase and a face the color of a lotus blossom in bloom.",
        "source": "T12n0354_002:0230c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我身猶如雲中電行，端正可憙。",
        "translation": "My body is like a lightning bolt moving through the clouds, which is correct and jolly.",
        "source": "T12n0354_002:0230c03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是天女，今相供養奉給走使。",
        "translation": "I'm a goddess who now makes offerings to messengers on the road.",
        "source": "T12n0354_002:0230c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此戲樂處，波離耶多、俱枳陀邏、俱邏婆迦多有枝心，柔軟可喜而為莊嚴。",
        "translation": "At this place of play, Parīyata, Kukkuṭalā, and Kuklôvaka have branches of mind that are supple, pleasant, and adorned.",
        "source": "T12n0354_002:0230c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六萬天女娛樂此處，今相娛樂奉給聖子，餘宮殿處皆悉不空。』",
        "translation": "Sixty thousand goddesses entertain this place and now make offerings to the noble son, and the rest of the palace is not empty.'",
        "source": "T12n0354_002:0230c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有琵琶、鼓、笛……等樂，種種音聲天敷莊嚴，師子座處自然出生。",
        "translation": "There's music such as a pipa, drum, flute, and so forth, and the gods are adorned by the various sounds, and the lion's seat is naturally produced.",
        "source": "T12n0354_002:0230c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼天既見種種莊嚴、妙好幡蓋，如王受位坐師子座，彼天童子亦復如是坐師子座。",
        "translation": "\"After the gods see the various ornaments and the wonderfully beautiful banners and shrouds, as the king is enthroned and sits on the lion's throne, that celestial boy also thus sits on the lion's throne.",
        "source": "T12n0354_002:0230c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼既坐已，諸樂器中出可愛聲，普一切相唱聲說言：『此善眾生於閻浮提造福德業，而來生此天宮殿中。』",
        "translation": "After he sits there, a lovely sound arises from the instruments, and they all sing, saying, 'This good sentient being created merit in Jambudvīpa and came to be born here in the palace of the gods.'",
        "source": "T12n0354_002:0230c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語天女言：『汝來，汝來。",
        "translation": "They said to the goddess, 'Come, you!",
        "source": "T12n0354_002:0230c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "速近此處，可為戲樂、善作歌舞樂此天子——此於人中作善根者。』",
        "translation": "Quickly approach this place, and you can play and dance for the benefit of this god, who has created good roots among humans.'",
        "source": "T12n0354_002:0230c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此聲出已，六萬天女彼樹林中兩手取花，善香莊嚴。",
        "translation": "After that sound, 60,000 goddesses picked up flowers with their two hands in that forest, adorned with a nice fragrance.",
        "source": "T12n0354_002:0230c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一天衣名頭居羅，彼衣輕踈，勝上珠寶以為腳釧，釧有妙聲。",
        "translation": "The first celestial is wearing a garment called a dhāraṇī, which is light and pale, and it's made into a leg bracelet with superior jewelry and a wonderful sound.",
        "source": "T12n0354_002:0230c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是婦女而來近之，奉給供養。",
        "translation": "Such a woman approaches him and offers her support.",
        "source": "T12n0354_002:0230c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女端正可憙，猶如初月；面如蓮花，其香猶如阿娑婆花。",
        "translation": "Their goddesses are beautiful and pretty, like the first moon, and their faces are like lotus flowers, and their fragrance is like an asaflower.",
        "source": "T12n0354_002:0230c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是婦女來近童子，作如是言：『如是，聖子！",
        "translation": "Such a woman approaches the boy and says, 'So it is, noble son!'",
        "source": "T12n0354_002:0230c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以一切所須之物供養供給，隨彼所用。』",
        "translation": "I'll make offerings of whatever's necessary for their use.'",
        "source": "T12n0354_002:0230c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是童子自善根力和集所得、自福所攝，於今在此受天欲樂。",
        "translation": "This is the boy's own accumulation of good roots and merit, and now he's here enjoying the pleasures of heaven.",
        "source": "T12n0354_002:0230c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，大仙！",
        "translation": "\"So it is, great sage!",
        "source": "T12n0354_002:0230c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天童子天女相隨，三十三天歡喜園林眾雜林中，白衣石上有勝光明、娑卑都林、佉羅佉囉、陀陀羅迦、池泉流水、阿吒婆迦、妙色好花、波離耶多，俱枳陀羅，在如是等戲樂之處第一涼樂，彼處無有大力惡風。",
        "translation": "\"In the Trāyastriṃśa Heaven, in the joyful grove of the gods accompanied by children and goddesses, there's a white clothed rock with a brilliant light, a sapiṭaka forest, a khaṭṭaka, a dhātaraka, a spring with a running current, an āṭavaka, a flower of wonderful color, a pārijāta, and a kukkuṭaka, which is the coolest and most pleasant place for such play, and there's no strong, bad wind there.",
        "source": "T12n0354_002:0230c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處彼處林中多有若干妙聲眾鳥、多有天花、亦饒天果，皆有妙香。",
        "translation": "There, in that forest, there are many wonderful-sounding birds, many smallpoxes, and the fruit of the gods, all of which have wonderful fragrances.",
        "source": "T12n0354_002:0230c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘琉璃珠、牟娑羅珠及馬瑙等，種種寶珠以為燈明。",
        "translation": "There are beryl beads, musāra beads, cornelian beads, and other precious beads of various kinds that serve as lamps.",
        "source": "T12n0354_002:0231a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有眾蜂及諸欲醉俱翅羅等，種種諸鳥有美妙聲，有他眷鳥、有金翅鳥，此鳥青咽以妙珠寶間錯其身，毘琉璃[口*(隹/乃)]長而嚴妙，有種種聲、娑陀離多美妙歌聲。",
        "translation": "There are also multitudes of bee beings, desire-drunk kukkuṭas, and other birds with beautiful sounds, including the bird of another family and the gold-winged bird with a blue throat and a body interlaced with marvelous jewelry, and a long, elegant vaiḍūrya [mouth*(short-tailed/nai)] with various sounds and the beautiful song of Sādṛta.",
        "source": "T12n0354_002:0231a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼林中有種種花，雜色間錯莊嚴其地。",
        "translation": "In that forest, there are various flowers of various colors interspersed throughout the grounds.",
        "source": "T12n0354_002:0231a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天童子在如是處受諸欲樂。",
        "translation": "That celestial boy enjoys desires and pleasures in such a place.",
        "source": "T12n0354_002:0231a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0231a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天宮殿地處有妙池水，清冷如月，八分具足，清而無垢。",
        "translation": "On the grounds of the palace of the Trāyastriṃśa Heaven there's a marvelous pond, as cool as the moon and replete with eight parts, that's clear and spotless.",
        "source": "T12n0354_002:0231a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有勝妙百葉蓮花開敷鮮榮，其池岸邊寶樹莊嚴，花落在地。",
        "translation": "There are also marvelous hundred-leaf lotus blossoms in full bloom, and the shore of that pond is adorned with jeweled trees, which fall to the ground.",
        "source": "T12n0354_002:0231a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是功德微妙之水，天子、天女於彼池中相隨戲樂，彼於戲處如心稱意。",
        "translation": "Such are the merits of this marvelous water, and the sons and daughters of gods play together in that pond, enjoying themselves as they wish in their place of play.",
        "source": "T12n0354_002:0231a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若須食者，有種種寶間錯槃生，隨其所須皆悉具足。",
        "translation": "If they need food, they'll be supplied with a variety of treasures that are interspersed with mistaken birth, just as they need them.",
        "source": "T12n0354_002:0231a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食色香白，如君陀花、拘物陀花，如雪等色，色香具足。",
        "translation": "The food is white in color and fragrance, like the junda flower or the kuṇḍa flower, or snow and other colors, and it's perfectly proportioned in color and fragrance.",
        "source": "T12n0354_002:0231a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天女斟張奉天童子，食足安樂，尋即消化，離辛、澁、苦三種食過。",
        "translation": "The goddesses present the food to the celestial boy with sufficient comfort, and they immediately digest it, free of the three kinds of food that are pungent, harsh, and painful.",
        "source": "T12n0354_002:0231a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是食者，天力無上——名曰蘇陀——在彼槃中揣而食之，如業所得。",
        "translation": "When he thus eats, the god of unsurpassed power - called sudhā - puts it in his hand and eats it in his vana, just as karma would have it.",
        "source": "T12n0354_002:0231a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，若人施時垢心布施，得報亦爾，同一槃食，食揣色異，有赤揣者、有黃揣者、有異揣者。",
        "translation": "You should know, great sage, that if someone is defiled in their mind when giving, they'll also attain the same reward when they eat from the same vana, but the food they eat is of different colors, whether it's red, yellow, or different.",
        "source": "T12n0354_002:0231a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身服一種、成就一色，而槃中食異異不同。",
        "translation": "One kind of body suit accomplishes the same color, but the food in the vajra varies from one kind to another.",
        "source": "T12n0354_002:0231a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "Thus, great sage!",
        "source": "T12n0354_002:0231a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人施已心生悔熱，彼業得報食色則劣。",
        "translation": "If a person's mind becomes feverish with regret after giving, the result of their actions will be a poorer quality of food.",
        "source": "T12n0354_002:0231a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0231a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天有戲樂處，彼處名為尸利沙紺，有種種樹枝花嚴好，種種天樹百千和合，地處清淨猶如頗梨，無垢柔軟。",
        "translation": "\"In the Trāyastriṃśa Heaven there's a paradise called Śirīṣa, where there are various trees with branches and flowers that are beautiful, and a hundred thousand of the various celestial trees are united, and the ground is pure like a pāri, spotless and flexible.",
        "source": "T12n0354_002:0231a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有天樹，花果具足。",
        "translation": "There's also a celestial tree that's replete with flowers and fruit.",
        "source": "T12n0354_002:0231a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是處者，非欲者住尸利沙迦清淨之處，天女不住如是勝妙尸利沙紺戲樂之處。",
        "translation": "Such is the place where someone who doesn't desire it lives in the purity of Śirīṣaka and where goddesses don't dwell in the playground of such a wonderful Śirīṣaka.",
        "source": "T12n0354_002:0231a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切樹林常有好花，如是花林常有諸天在下語說。",
        "translation": "All the trees in the forest always have good flowers, and such a forest of flowers always has the gods talking down to it.",
        "source": "T12n0354_002:0231a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，我之所有聲聞之人、諸弟子中最為勝者，所謂長老伽婆波帝，於婆羅門種姓中生，遊心禪思、慈心、悲心，三昧眼開住慈三昧，於七日中息不出入。",
        "translation": "\"Great sage, you should know that the most distinguished of all my śrāvakas and disciples is the elder Gavāṃpati, who was born among the Brāhmaṇa family, travels around with a mind of meditation, a mind of kindness, and a mind of pity, opens his samādhi eye, and abides in the samādhi of kindness for seven days, and doesn't leave or enter during that time.",
        "source": "T12n0354_002:0231a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，彼時既入慈三昧已，心若須風則有風吹、若其不須則無風吹。",
        "translation": "You should know, great sage, that once he enters the concentration of kindness, a breeze blows if his mind needs it, and no breeze blows if it doesn't need it.",
        "source": "T12n0354_002:0231b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劫盡燒時地為一焰，彼身乃至如芥子許亦不能燒。",
        "translation": "When the eon is ended and burned, the ground becomes a single flame, and his body isn't even like a mustard seed that's small enough to burn.",
        "source": "T12n0354_002:0231b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若須彌山墮其身分，於節節上即令停住，不能令動。",
        "translation": "If Mount Sumeru falls into its proper place, it'll be stopped at a junction and won't be able to budge.",
        "source": "T12n0354_002:0231b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復難陀、憂波難陀二惡龍王毒力熾盛，彼惡力毒，若以氣噓能動須彌，如是毒力四大海水能令味醎。",
        "translation": "If the poisonous power of the two evil dragon kings Pūrṇa and Upananda is overpowering, that evil power is so venomous that it could move Sumeru with a puff of breath, and such poisonous power in the four seas could cause a sour taste.",
        "source": "T12n0354_002:0231b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，如是大力惡毒龍王，伽婆波帝三昧力故能令無毒。",
        "translation": "You should know, great sage, that such a powerful, malevolent dragon king can be made nonpoisonous by the power of Gavāṃpati's samādhi.",
        "source": "T12n0354_002:0231b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "\"Again, great sage!",
        "source": "T12n0354_002:0231b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時長老伽婆波帝尸梨沙紺戲樂處行。",
        "translation": "\"At the time, the elder Gavāṃpati Sirīṣa was walking around in a playful place.",
        "source": "T12n0354_002:0231b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女染欲心強，或因遊戲至於彼處，若見長老伽婆波帝生愛信心，能以天中曼陀羅花、居世賒迦如是等花散而供養，合掌禮敬。",
        "translation": "Those goddesses with strong, defiled desires or who come to that place because of play, if they see eldest Gavāṃpati and develop a desire for and faith in him, they can scatter offerings of flowers such as the maṇḍala flower or the kushika flower from the gods, put their hands together, and venerate him.",
        "source": "T12n0354_002:0231b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復彼處三十三天諸天子等，圍遶供養如是長老伽婆波帝，奉以天飯、天甘露汁施令飽足，於日日中如是供養。",
        "translation": "Again, the Trāyastriṃśa gods and their descendants surround him and make offerings to the elder Gavāṃpati, offering him rice and the juice of divine nectar from the gods to satisfy him and making offerings like this day after day.",
        "source": "T12n0354_002:0231b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽婆波帝於彼林處樹枝搖動深處遊行，為彼天子敷演伽他、憂陀那、尼陀那、伊帝毘利多、迦闍多迦、裴不略、阿浮多、達摩、毘尼、修多羅、憂波提舍、阿波提舍，令彼天子聞已生信心喜悅樂，故在彼處天妙宮殿，坐禪、讀誦、遊行、止住，亦復遊彼尸梨沙迦戲樂之處。",
        "translation": "Gavāṃpati then marched through that forest with its branches shaking and deep inside, and he prepared for those gods a recitation of a speech by Gatha, udāna, Nidāna, Ītivṛttā, Kājātaka, Prabhūtaratna, Ābhūta, Dharma, Vinaya, Śubhūtaratna, Śubhūtiṣya, and Ābhūtiṣya, which caused the gods to rejoice and be delighted when they heard it, so they sat in that marvelous palace, meditated, chanted, marched, stopped, and traveled to that place where Sirīṣaka was enjoying himself.",
        "source": "T12n0354_002:0231b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0231b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天有善法堂，天眾集處。",
        "translation": "\"In the Trāyastriṃśa Heaven, there's the Hall of the Good Dharma, where the gods gather.",
        "source": "T12n0354_002:0231b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，善法堂柱八萬四千，彼柱皆是金寶、金剛、若牟娑羅及迦羅婆、若馬瑙等，勝栴檀椽並比在上，鈴鬘妙聲，金沙覆地。",
        "translation": "You should know, great sages, that 84,000 pillars of the hall of the good Dharma are made of golden treasures, vajra, jhā musāra, karabha, and jhā manau, and they're surpassed by sandalwood rafters on top, with the wonderful sound of bells and golden sand covering the ground.",
        "source": "T12n0354_002:0231b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，彼善法堂垂天繒幡，竪立寶幢，懸幡在上。",
        "translation": "You should know, great sage, that hall of the fine dharma is draped with silk banners and has a jeweled banner suspended from it.",
        "source": "T12n0354_002:0231b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有樂聲，琵琶、箏、笛、大鼓、小鼓、拍手、吹貝、簫嘯美音。",
        "translation": "There's also the sound of music, such as a pipa, a zither, a flute, a large drum, a small drum, clapping hands, blowing a conch, and a beautiful sound of a bamboo flute.",
        "source": "T12n0354_002:0231b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子、天女手如妙花，柔軟之狀如樹枝心，迭相執手，心生愛喜，口常含笑。",
        "translation": "The gods' sons and goddesses have hands like marvelous flowers with a soft shape like the heart of a tree branch, and they repeatedly hold each other's hands, rejoicing in their hearts and always smiling with their mouths.",
        "source": "T12n0354_002:0231c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天童子、彼天婦女如是受樂。",
        "translation": "That celestial boy or goddess thus experiences joy.",
        "source": "T12n0354_002:0231c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，彼善法堂多天集處，種種珠寶間錯其地。",
        "translation": "\"Great sages, you should know that that hall of the good Dharma is where many gods gather, and various kinds of jewelry are interspersed on its ground.",
        "source": "T12n0354_002:0231c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地青膩如毘琉璃，滑而無垢猶如淨鏡，多饒天花、種種香末，遠離風、日、青虫、蚊、虻如是等過，無有眠睡、懈怠、頻申。",
        "translation": "Its ground is as green and exquisite as vaiḍūrya, smooth and spotless like a pure mirror, teeming with flowers and various kinds of fragrant residue, and far removed from such faults as wind, sun, blue insects, mosquitoes, and gadflies, with no drowsiness, laziness, or recollection.",
        "source": "T12n0354_002:0231c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善法堂樂觸風窓、重樓、屋壁，種種莊嚴間錯之文，形如半月，狀似牛眼，天網縵覆。",
        "translation": "That hall of the fine dharma enjoys contact with wind-wind windows, heavy buildings, and house walls, and its various ornaments are interlaced and shaped like a half-moon, resembling the eye of a bull, and covered by a web of heavenly beams.",
        "source": "T12n0354_002:0231c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鵄尾妙門寬大廣博，有樂觸風，寶鬘莊嚴，遍散妙花，善香馨馥。",
        "translation": "The wonderful gate of the śrāvaka was wide and extensive, with a breeze that was pleasant to touch, adorned with jeweled garlands, and scattered with wonderful flowers and a fragrant odor.",
        "source": "T12n0354_002:0231c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多饒無量百千天女，欲心戲笑，無有嫉心、鬪諍等過，迭相染欲，愛心堅固，頰淨無垢如月鏡輪。",
        "translation": "They are filled with measureless hundreds of thousands of celestial women who have playful desires, are free of jealousy, fight, and other faults, repeatedly have defiled desires, and have a strong sense of attachment, and their cheeks are pure and spotless like the moon and mirror.",
        "source": "T12n0354_002:0231c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天女之法以香綵色用點頰額以莊嚴面，天女咏聲共相娛樂。",
        "translation": "The celestials' maidens decorate their faces with caramels and dots on their cheeks and foreheads, and they entertain each other with chants and sounds.",
        "source": "T12n0354_002:0231c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，彼善法堂四方四角，四廂寬博，多有樹林，邃密雲闇，有種種花。",
        "translation": "\"Great sages, you should know that that hall of the good Dharma has four quadrants and four wide compartments, and there are many trees and a forest of deep, dense clouds and darkness with a variety of flowers.",
        "source": "T12n0354_002:0231c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戲樂之處如是樹林廣百由旬，分分處處種種端嚴，有金蓮花，復有散花遍布其地，復有種種微妙歌聲，有種種樹，其樹名為居迦那陀、波利耶多、拘毘陀羅，如是等樹處處多有，以為莊嚴。",
        "translation": "Where there's play and pleasure, such a forest is a hundred leagues wide and has various forms of adornment in different places, with golden lotus flowers and scattered flowers all over the ground, various kinds of exquisite singing, and various trees named Kukkana, Parītta, and Kubitra, and such trees are abundant everywhere and are used for adornment.",
        "source": "T12n0354_002:0231c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0231c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善法堂一切所須金寶、金剛、若牟娑羅及迦羅婆，復有白珠、毘琉璃等，各有大聚，無主、無護，多饒財物金寶之藏。",
        "translation": "\"In that hall of the good Dharma, there are all the necessary gold treasures, vajras, jhā musāra and karabha, and also white pearls and beryl, each of which has a large collection that has no owner or protector and is full of wealth and gold treasures.",
        "source": "T12n0354_002:0231c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一切物、一切寶聚，皆悉莊嚴善法堂處，彼諸寶聚有種種色以為莊嚴。",
        "translation": "All of those things and all of those clusters of treasure adorn the site of the hall of the good Dharma, and those clusters of treasure are adorned with various colors.",
        "source": "T12n0354_002:0231c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善法堂周圍復有百千戲處以為莊嚴，無熱、無惱，種種衣服嚴飾其處。",
        "translation": "Around that hall of the good Dharma are another hundred thousand playgrounds adorned with no heat or distress, and their various kinds of clothing adorn their location.",
        "source": "T12n0354_002:0231c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0231c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天於戲樂處喜戲樂行，一切皆來集善法堂娛樂喜樂。",
        "translation": "The Trāyastriṃśa gods delight in the playgrounds, and they all come to the halls of the good Dharma to be entertained and delighted.",
        "source": "T12n0354_002:0231c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0232a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天善見宮殿淨如月鏡，多有香花垂鬘莊嚴。",
        "translation": "The Trāyastriṃśa Heaven's palace is as pure as a moon-glass and adorned with an abundance of fragrant flowers draped in garlands.",
        "source": "T12n0354_002:0232a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有千天女嚴飾微妙，遊戲娛樂，媚眼眄視，奮動眉面猶如亂波，行虛空中，以種種花莊嚴其身。",
        "translation": "There are a thousand celestial women who are exquisitely adorned, playfully entertain themselves, charmingly gaze out, and move their brows and faces like turbulent waves as they walk through the sky, adorning themselves with a variety of flowers.",
        "source": "T12n0354_002:0232a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善見宮殿莊嚴如是，多有珠瓶在宮殿中，鈴網簾障出微妙聲以為莊嚴。",
        "translation": "The well-visited palace is adorned like this, with many bejeweled vases in the palace and a web of bells and curtains that produce a subtle sound to adorn them.",
        "source": "T12n0354_002:0232a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若馬、若象行在宮殿，腳足傷地則起金塵。",
        "translation": "If a horse or elephant walks through the palace, gold dust rises when its feet touch the ground.",
        "source": "T12n0354_002:0232a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處多有端正天女，身著寶珠赤色光明，若鳴、若抱、若捉衣裳，令彼戲處殊勝奇妙。",
        "translation": "There are many upright celestial women wearing jewels and red-colored lights that sound, embrace, or hold robes, making their playgrounds marvelous.",
        "source": "T12n0354_002:0232a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0232a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善見宮殿有六萬柱，彼柱皆是天妙金寶，以毘琉璃及金剛寶為柱頭，間種種雜寶間錯其柱。",
        "translation": "\"The palace of Sunbeam has 60,000 pillars, all of which are made of the gods' marvelous gold jewelry, with beryl and adamantine jewels as their pillar heads, and various other kinds of jewelry interspersed among their pillars.",
        "source": "T12n0354_002:0232a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼宮殿中汁香、葉香、沈水等香種種香熏，復有種種善香勝熏。",
        "translation": "In that palace are various fragrances of sap, leaf, and sunken water, and there's another excellent fragrance of various good odors.",
        "source": "T12n0354_002:0232a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝釋天王在彼勝處，百千天女之所圍遶，帝釋王手執金剛牙，在寶殿上娛樂戲樂。",
        "translation": "Surrounded by a hundred thousand goddesses, Indra the king of gods is holding a vajra tooth in his hand as he entertains himself in that jeweled palace.",
        "source": "T12n0354_002:0232a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0232a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天因陀羅王九千龍力，帝釋王臂如天象手，身色如金，鮮淨無垢，形體平正，身中則細，上下分麁，骨節不現，體實不虛，髮毛旋動，清淨無垢，身有光明，衣則舒長。",
        "translation": "Trāyastriṃśa Indra, king of the 9,000 dragons, has arms like the hands of a celestial elephant, a body the color of gold, pure and undefiled, a correct body shape, a body that's small in the middle and crude at the top and bottom, bones that don't show, a body that's substantial and not false, hair that swirls and moves, a body that's pure and undefiled, a body with radiance, and a robe that's long and comfortable.",
        "source": "T12n0354_002:0232a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知因陀羅所作釋論能破諍論，多有無量百千天子常隨親近，天林宮殿及遊戲處隨逐遊行。",
        "translation": "He knows that Indra's explanations and treatises are able to dispel arguments, and that there are measureless hundreds of thousands of celestials who always follow him and parade him around the palace and playgrounds of the celestial forest.",
        "source": "T12n0354_002:0232a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金繩絡身，天妙瓔珞、若半瓔珞莊嚴其胸。",
        "translation": "Their bodies are wrapped in gold cords, and their chests are adorned with the finest jewels and half-jewels in the heavens.",
        "source": "T12n0354_002:0232a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其身勝妙，不細、不麁，中腰則細，二髀平等。",
        "translation": "His body is marvelous, not too fine or coarse, but small at the midriff, and his two thighs are equal.",
        "source": "T12n0354_002:0232a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常以白飯、甘露汁食，百千天女目鬘視之，肩頰端正。",
        "translation": "He always feeds on white rice and nectar, and a hundred thousand goddesses look at him with garlands on their eyes and upright shoulders and cheeks.",
        "source": "T12n0354_002:0232a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有醉象耳扇生風，風聲美妙。",
        "translation": "He has a drunken elephant whose ear flaps generate a breeze, and the breeze sounds wonderful.",
        "source": "T12n0354_002:0232a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0232a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大天王因陀羅主身脈不現，香氣勝妙如善華香，彼大天王軟美音聲。",
        "translation": "\"That great celestial king Indra, whose personal vein doesn't appear, has a wonderful fragrance like the fragrance of good flowers, and that great celestial king has a soft, beautiful voice.",
        "source": "T12n0354_002:0232a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，彼大天王自身善香，若天白象欲發極醉，聞王身香即時醒解。",
        "translation": "You should know, great sage, that great celestial king has a nice fragrance of his own, and if a celestial white elephant wants to get extremely drunk and hears the king's body fragrance, he'll instantly awaken and be liberated.",
        "source": "T12n0354_002:0232a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0232b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因陀羅王身量高下，與餘諸天乘馬之量高下平等。",
        "translation": "King Indra's body is equal in stature to the stature of the other gods' horses.",
        "source": "T12n0354_002:0232b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因陀羅王身色勝妙，見王身者金像不現。」",
        "translation": "King Indra's body is so beautiful that a golden image of the king won't appear when you see his body.\"",
        "source": "T12n0354_002:0232b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘耶娑大仙白佛言：「世尊！",
        "translation": "At that point, Vaiśravaṇa replied to the Buddha, \"Bhagavān!",
        "source": "T12n0354_002:0232b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有。",
        "translation": "Rarely does it exist.",
        "source": "T12n0354_002:0232b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0354_002:0232b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼帝釋王大因陀羅甚為勝妙，實如世尊——聖法具足——所說不異。」",
        "translation": "That Indra of Indra the Indra King is quite wonderful, just as the Bhagavān - complete with the noble teaching - has said.\"",
        "source": "T12n0354_002:0232b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, \"Great sage!",
        "source": "T12n0354_002:0232b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝以何義如是美歎此無常身大因陀羅，而言希有，心生驚怪？",
        "translation": "What do you mean by thus praising this great Indra, who has an impermanent body, as rare and whose mind is astonished?",
        "source": "T12n0354_002:0232b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如伎兒，巧以泥團造作種種人、畜等形，又縛葉等、插華在外，以諸彩色畫為軍眾。",
        "translation": "\"It's like a skilful man who makes a ball of clay in the form of various people and animals, binds leaves and so forth, inserts flowers outside, and paints an army of people with various colors.",
        "source": "T12n0354_002:0232b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "木為機關，彩畫彫飾，如樹生花，畫飾莊嚴，不過少時花則萎蔫。",
        "translation": "The wood is made into a mechanism, and it's decorated with colorful carvings, like a tree that produces flowers that are decorated with ornamentation, but only rarely do the flowers wither.",
        "source": "T12n0354_002:0232b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如以燈炷置於爐中，以火燒之則有光明；帝釋王身亦復如是。",
        "translation": "Like putting a lamp burner in a censer and setting it on fire, there's a bright light, and so is the body of Indra and King Indra.",
        "source": "T12n0354_002:0232b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，阿泥樓大父母所生，其身力大。",
        "translation": "\"Great sages, you should know that Aniruddha's body is powerful when born from large parents.",
        "source": "T12n0354_002:0232b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，因陀羅王所有身力，阿泥樓大父母所生，身力為大。",
        "translation": "You should know, great sage, that King Indra's body is powerful, and Aniruddha's body is powerful when born from his parents.",
        "source": "T12n0354_002:0232b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0232b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今且觀阿泥樓大神通身力。」",
        "translation": "Now, you may observe the power of Aniruddha's great superknowledge body.\"",
        "source": "T12n0354_002:0232b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是說時，阿泥樓大心即憶念：「如來加我。」",
        "translation": "When he said that, Aniruddha's mind then recollected, \"The Tathāgata has empowered me.\"",
        "source": "T12n0354_002:0232b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是念已，即入三昧。",
        "translation": "After such a thought, he then entered samādhi.",
        "source": "T12n0354_002:0232b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入三昧已，身如金色，即有天王新勝金冠——如洋金色——在其頭上，寶珠垂下，傍面連肩，動搖相摩。",
        "translation": "After he entered samādhi, his body was golden, and there was the god king's new crown of brilliant gold-as golden as the ocean-on his head, with a jeweled pearl hanging down and his face and shoulders shaking and touching each other.",
        "source": "T12n0354_002:0232b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "珠髻、青髮，身體色潤有勝光明，目如天上勝毘琉璃，其色紺青。",
        "translation": "With a topknot of jewelry and blue hair, his body is moistened with a brilliant radiance, and his eyes are like the heavenly, brilliant vaiḍūrya, which are vaguely blue in color.",
        "source": "T12n0354_002:0232b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有珠寶、牟娑羅寶、迦羅婆寶、日珠等寶莊嚴身臂。",
        "translation": "His body and arms are also adorned with jewels, musāra treasures, karabha treasures, and sun-jewels.",
        "source": "T12n0354_002:0232b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼以化力令身如是。",
        "translation": "He causes his body to be like this by the power of transformation.",
        "source": "T12n0354_002:0232b22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復出天香遍諸大眾，一切普熏。",
        "translation": "Again, a heavenly fragrance spreads out over the whole crowd, perfuming them all.",
        "source": "T12n0354_002:0232b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼毘耶娑見其身已，心則變動，從座而起，合掌恭敬，生希有心，高聲唱言：「子子善哉！",
        "translation": "When he sees his body, his mind changes, he rises from his seat, joins his palms in respect, gives rise to a rarefied thought, and shouts, \"Good for you, my son!",
        "source": "T12n0354_002:0232b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何何快哉！",
        "translation": "What a joy!",
        "source": "T12n0354_002:0232b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得人身，有果不空。",
        "translation": "'I've attained a human being whose existence and fruition are not empty.",
        "source": "T12n0354_002:0232b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者到如來所，如來今者作一切智相應語說，令我今者得見如是未曾有法。」",
        "translation": "Now, when I go to the Tathāgata, the Tathāgata will now explain the relevance of omniscience, so that I can now see such unprecedented things.\"",
        "source": "T12n0354_002:0232b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊語毘耶娑大仙人言：「汝意云何？",
        "translation": "It was then that the Bhagavān said to the great sage Vaiśravaṇa, \"What do you think?",
        "source": "T12n0354_002:0232b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若因陀羅帝釋王身、阿泥樓大長老之身，如是二身何者為勝？」",
        "translation": "Which of these two bodies is superior, Indra's body as Indra the Indra, or Aniruddha's body as a great elder?\"",
        "source": "T12n0354_002:0232b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘耶娑大仙白佛言：「世尊！",
        "translation": "At that point, Vaiśravaṇa replied to the Buddha, \"Bhagavān!",
        "source": "T12n0354_002:0232c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因陀羅王身比阿泥樓大身，百分之中不及其一，於千分中亦不及一，阿泥樓大身色具足。」",
        "translation": "King Indra's body is comparable to Aniruddha's great body, in that it's not one in a hundred, nor is it one in a thousand, and Aniruddha's great body is fully proportioned.\"",
        "source": "T12n0354_002:0232c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來語言：「如是，大仙！",
        "translation": "The Tathāgata said, \"So it is, great sage!",
        "source": "T12n0354_002:0232c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿生歡喜，以作福德發如是願，故得彼身。」",
        "translation": "Don't be delighted; make this vow for merit, and thus obtain that body.\"",
        "source": "T12n0354_002:0232c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大仙毘耶娑眾歡喜心開，白佛言：「世尊！",
        "translation": "At that point, the joyous multitude of Vaiśravaṇa, the great sage, said to the Buddha, \"Bhagavān!",
        "source": "T12n0354_002:0232c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊更為我說三十三天。」",
        "translation": "Please let the Bhagavān further explain the Trāyastriṃśa Heaven for me.\"",
        "source": "T12n0354_002:0232c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, \"Great sage!",
        "source": "T12n0354_002:0232c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天帝釋天王第一天后名曰舍支。",
        "translation": "The first queen of the Trāyastriṃśa Heaven Indra's celestial king was named Śākya.",
        "source": "T12n0354_002:0232c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百千天女住歡喜林，有種種花開發光明集在其身，頰如蓮花、脣色猶如金頻婆果，第一光明微細衣服。",
        "translation": "One hundred thousand goddesses live in the Jubilant Forest, where they have a variety of flowers that produce radiant light gathered around their bodies, cheeks like lotus blossoms, lips the color of a golden vibhāga fruit, and the first finely shining garments.",
        "source": "T12n0354_002:0232c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "林間戲處安行遨遊，以天莊嚴善莊嚴耳，寶釧、天珂莊嚴手臂，以好瓔珞及半瓔珞莊嚴其身，腳著寶釧，釧有妙聲、種種音樂。",
        "translation": "They roam the woods in play, adorn their ears with the adornment of gods, adorn their arms with jeweled coats and godkins, adorn their bodies with fine jewelry and half-ornaments, and carry at their feet jeweled coats that have wonderful sounds and various kinds of music.",
        "source": "T12n0354_002:0232c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歡喜林中如是遊行，頰分寬博，妙花散地，在上而行。",
        "translation": "They parade like this through the joyful forest, their cheeks are broad, and marvelous flowers scatter across the ground as they walk upward.",
        "source": "T12n0354_002:0232c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臍下陰上有細毛文，妙寶跨衣，行則聲出。",
        "translation": "There are fine hairy letters on the upper part of his lower navel and a wonderful jeweled hemp robe, and sounds emanate from it as he walks.",
        "source": "T12n0354_002:0232c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目青而寬，開而有媚，髮青長黑，一一毛旋，鼻隆而直。",
        "translation": "Their eyes are blue and wide, open and flattering, their hair is blue and long, black, and swirling with each hair, and their nose is long and straight.",
        "source": "T12n0354_002:0232c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離瞋、嫉、鬪諍等過，瞋怒、皺面、波奮、動亂皆悉遠離，身無藏過。",
        "translation": "They're far removed from such faults as anger, jealousy, and fighting, and they're free of anger, wrinkled skin, agitation, and agitation, and they have no faults hidden in their bodies.",
        "source": "T12n0354_002:0232c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，舍支天后有喜欲力勝彌樓山第一勝處。",
        "translation": "\"Great sages, you should know that the place behind Śākyamuni Heaven is the most outstanding place on Mount Mīlū where the power of joy and desire prevails.",
        "source": "T12n0354_002:0232c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處廣長，多有樹林，其樹饒枝映障之處。",
        "translation": "It's a long, broad forest with many trees whose branches reflect the obstructions.",
        "source": "T12n0354_002:0232c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心生愛樂，微風吹花，動散出香，復觸其身。",
        "translation": "When the mind becomes delighted, a gentle breeze blows flowers that scatter fragrance and touch their bodies.",
        "source": "T12n0354_002:0232c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍支身形，不長、不短，不麁、不細，其面嚴好如開蓮花，口出妙香，善巧語說增長佛種。",
        "translation": "The body of Śākyamuni is neither long nor short, neither crude nor fine, with a face as beautiful as a blossoming lotus flower and a mouth that produces a wonderful fragrance, and he speaks skillfully to increase the seed of Buddhahood.",
        "source": "T12n0354_002:0232c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，三十三天一切天眾身體皆香，無有病患，於遊戲處、若於宮殿，如是遊行。",
        "translation": "\"Great sage, you should know that all the gods of the Trāyastriṃśa Heaven have fragrant bodies, are without illness, and thus promenade through places of play or palaces.",
        "source": "T12n0354_002:0232c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大仙！",
        "translation": "\"Furthermore, great sage!",
        "source": "T12n0354_002:0232c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天壽命千歲。",
        "translation": "\"The Trāyastriṃśa Heaven has a lifespan of 1,000 years.",
        "source": "T12n0354_002:0232c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天彼處如是行已至命盡時，彼天宮殿本未曾有五種相出，應如是知。",
        "translation": "When they reach the end of their lives after thus practicing in that heaven or place, there are five ways that have never existed in the palace of that god before that should be known.",
        "source": "T12n0354_002:0232c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T12n0354_002:0232c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地有清水猶如頗梨，冷而有文、有樂觸風。",
        "translation": "\"The ground has clear water like a pāri, which is cold, well-textured, and has a pleasant breeze to touch.",
        "source": "T12n0354_002:0232c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處多有種種枝花，既入池已油膩汗出。",
        "translation": "There are many different kinds of branches and flowers there, and after entering the pond, they become greasy and sweat.",
        "source": "T12n0354_002:0233a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既見如是油膩汗已，心生疑慮，即便出水走向樹林。",
        "translation": "After seeing such grease and sweat, their minds become suspicious, and they even get out of the water and walk toward the trees.",
        "source": "T12n0354_002:0233a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼既速行，天女見之順後急行，與共相隨。",
        "translation": "As they quickly walked, the goddess saw them hurrying along behind them and followed them.",
        "source": "T12n0354_002:0233a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既到一樹即便住坐。",
        "translation": "Once they reached a tree, they stood and sat down.",
        "source": "T12n0354_002:0233a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既住坐已，天女憂悲發聲歎息，咽中聲破，如是問言：『聖子！",
        "translation": "Once they had stood and sat down, the goddess sorrowfully raised her voice in sorrow, broke her voice in her throat, and asked, 'Noble son!",
        "source": "T12n0354_002:0233a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者何故捨我，獨在樹下？",
        "translation": "Why has he abandoned me and stayed under the tree alone?",
        "source": "T12n0354_002:0233a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有何樂？』",
        "translation": "What is the pleasure of this?'",
        "source": "T12n0354_002:0233a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是說已，彼天童子以憂歎聲語天女言：『我頭額上從本以來未有膩出。』",
        "translation": "After speaking thus, the young god child spoke to the goddess with a sad voice, saying, 'Since the beginning, there's been no grease on my forehead.'",
        "source": "T12n0354_002:0233a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是說已，於兩腋下即有汗出。",
        "translation": "After speaking thus, sweat immediately escaped from his armpits.",
        "source": "T12n0354_002:0233a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼天女見汗出已，捨離遠去。",
        "translation": "After she saw the sweat coming out, the goddess left and went away.",
        "source": "T12n0354_002:0233a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見天女遠離身已，心生憂懼，出入氣麁。",
        "translation": "After he saw the goddess leave him, his mind became frightened, and he exhaled with debilitating breath.",
        "source": "T12n0354_002:0233a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "氣麁出已，其心發熱。",
        "translation": "After the debilitating breath escapes, his mind becomes hot.",
        "source": "T12n0354_002:0233a11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心既熱故，頭上妙鬘本未曾萎今者則蔫。",
        "translation": "As a result of this mental fever, the wonderful garland on his head, which had never withered before, now wilts.",
        "source": "T12n0354_002:0233a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬘既蔫已，衣未曾垢今則垢出。",
        "translation": "Once the garland has wilted, the dirt on his robe that was never soiled now comes out.",
        "source": "T12n0354_002:0233a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天敷臥處不樂不樂。",
        "translation": "The gods spread out their sleeping places and aren't happy or delighted.",
        "source": "T12n0354_002:0233a13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼諸天女見如是相，心即思念：『此天童子死相已出，將欲破壞。』",
        "translation": "\"When those goddesses see such a sign, they think, 'This celestial boy's death has appeared, and I want to destroy it.'",
        "source": "T12n0354_002:0233a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知其必死，聞其氣臭不可堪耐，即爾遠之，圍遶而住。",
        "translation": "Knowing that he's bound to die, they hear his unbearable odor, so they distance themselves from him and surround him.",
        "source": "T12n0354_002:0233a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以聞其臭憐愍悲歎，咽喉聲破，口不能正，作如是言：『何期第一柔軟身天，在戲樂處林中行者——此三天處如是池水有鴛鴦鳥，善法堂處歡喜之林，鵝王、鴛鴦、曼陀耆泥池水香潔，多有樹林，樹名象塵、波利耶多俱、耆多羅，在彼戲處多有蜜蜂在雜林中以為莊嚴——常此處行，今忽捨我，去向何處？",
        "translation": "Because of the pity and sorrow he hears, his throat breaks and he can't straighten his mouth, so he says, 'What would happen to the first soft-bodied heavenly being who walks in a woodland of pleasure - a three-day place like this one with a pond and a bird in it, a joyful forest in a good dharma hall, a king goose, a mandarin duck, a clean pond, and a forest of trees named Elephant Dust, Pariah Togs, and Gṛdhrakūṭa, where there are many bees in a mixed forest that decorate it - that used to walk here, but now they've suddenly abandoned me, so where are they going?'",
        "source": "T12n0354_002:0233a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五相既現，壞破欲去。』",
        "translation": "Once the five characteristics are present, their desires are destroyed and they depart.'",
        "source": "T12n0354_002:0233a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女如是啼哭，復更啼哭。",
        "translation": "Those goddesses thus wail and wail again.",
        "source": "T12n0354_002:0233a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見啼哭，心則破壞，生大怖畏。",
        "translation": "When they see them weeping, their minds are destroyed, and great fear arises.",
        "source": "T12n0354_002:0233a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其身發熱，眼目亂視，如行道路失伴之人、亦如商人海行船沒、亦如遺失如意珠者心懊惱躄地。",
        "translation": "Their body becomes feverish, and their eyes are distracted, like a person who travels on a road and loses their companion, like a merchant whose boat sinks in the ocean, or like a person who loses a wish-jewel and is distressed and crippled to the ground.",
        "source": "T12n0354_002:0233a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大力風能墮山角，無常大風令天子墮亦復如是。",
        "translation": "Like a mighty wind that plunges a mountain cape, so does a great impermanent wind cause a god to plunge.",
        "source": "T12n0354_002:0233a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼身極熱，在地旋轉——如伽樓羅所捉龍子——生大怖畏，舉身戰動，兩手合掌向天女言：『我今患熱，汝來汝來，可以手掌摩我令冷。』",
        "translation": "\"When he's extremely hot and spins around on the ground - like a dragon cub caught by a garuḍa - he becomes terrified, raises his body in battle, and joins his palms together with his hands and says to the goddess, 'Now, I'm burning up, so come here, you, put your palms on me and make me cool.'",
        "source": "T12n0354_002:0233a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是心急，身熱欲然，如是身心俱受苦惱。",
        "translation": "Thus, his heart rushes, his body heats up, and he experiences pain and suffering both physically and mentally.",
        "source": "T12n0354_002:0233b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女憂悲燒心，住在遠處，心生憐愍，憂悲苦惱，身不能近、不摩、不觸。",
        "translation": "Burned with grief and pity, those goddesses live far away, feeling compassionate, sad, and distressed, and they can't approach, touch, or feel anything.",
        "source": "T12n0354_002:0233b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於樹林中取枝花葉，舒手遙置天子心上，作如是言：『童子今者天福德盡，願汝速生閻浮提處。』",
        "translation": "They took a branch of a flower or leaf from a forest, stretched their hands far above the gods' hearts, and said, 'Now, boy, since the merits of gods have ended, may you be quickly born in Jambudvīpa.'",
        "source": "T12n0354_002:0233b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天聞已知必定死，高聲唱言：『何期苦哉！",
        "translation": "When the god heard that he was certain to die, he raised his voice and said, 'What a long time to be miserable!'",
        "source": "T12n0354_002:0233b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何期苦哉！",
        "translation": "What a long time of suffering!",
        "source": "T12n0354_002:0233b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三十三天處乃是惡處。",
        "translation": "\"This place in the Trāyastriṃśa Heaven is a bad place.",
        "source": "T12n0354_002:0233b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是種種具足莊嚴戲樂之處、第一宮殿受諸戲樂、多有天女種種愛染繫縛心已，忽於今者趣於死道，住在遠處如是說言：「願汝死已，生閻浮提。」』",
        "translation": "It's a place full of such adornments and pleasures, the first palace where they enjoy pleasures, and many goddesses who are fettered by various desires and thoughts, and then suddenly they're headed for the path of death and live far away, saying, 'May you be born in Jambudvīpa after death.'",
        "source": "T12n0354_002:0233b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天如是數思惟已、聞彼語已，舉身欲起，極生悲苦，啼哭而言：『何期苦哉，歡喜樹林、種雜樹林、白衣石上、遊戲坐處。",
        "translation": "After thinking about it this many times and hearing those words, the god lifted himself up, wanted to get up, became extremely sad and distressed, and cried out, saying, 'What a long time to be miserable in a forest of joyful trees, a forest of various trees, a white-robed rock, or a place to play and sit.",
        "source": "T12n0354_002:0233b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何其善法，彼留沙迦、波利耶多、此毘婆闍、曼陀耆尼、大波流沙迦。",
        "translation": "What's so good about that, that Rāṣṭrapāla, Parītta, this Vibhajā, Maṇḍajī, and Mahāpārūṣaka?'",
        "source": "T12n0354_002:0233b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是宮殿——第一宮殿——堅固門扇一切和集，我今忽捨此天宮殿，不得自在而便退此。』",
        "translation": "Now, I suddenly abandon this celestial palace-the first palace-where all the solid doors and fans are assembled, and I don't have the freedom to retreat from it.\"",
        "source": "T12n0354_002:0233b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「三十三天命欲盡故，於自宮殿不能復見，唯見天女低面向下，以手拭眼，引氣破面。",
        "translation": "\"Because the Trāyastriṃśa gods want to end their lives, they can't see their palace again except to see the goddess face down, wipe her eyes with her hand, and draw breath to break her face.",
        "source": "T12n0354_002:0233b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼欲退天復作如是言：『我於今者欲行死道，何期汝等退我所愛、不共我語？",
        "translation": "The god desiring to retire then again said, 'Now, I want to walk the path to death, so why would you retire what I love and not speak with me?'",
        "source": "T12n0354_002:0233b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲行生死長道，愛人可來急抱我咽。",
        "translation": "\"Now, I want to travel the long road of birth and death, so my beloved may come and hasten to embrace me and swallow my throat.",
        "source": "T12n0354_002:0233b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今已不復見汝，汝亦如是不復見我。",
        "translation": "Now, I won't see you again, and so you won't see me again.",
        "source": "T12n0354_002:0233b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是天處何期甚惡，業果盡已，闇無所見。",
        "translation": "How could such a heavenly existence be so long and so hard that, after the results of actions are ended, there's nothing to see in the dark?",
        "source": "T12n0354_002:0233b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此處三十三天，欲退之時皆悉空耶？",
        "translation": "How is this place, the Trāyastriṃśa Heaven, completely empty when you want to retire?",
        "source": "T12n0354_002:0233b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此處三十三天，豈無琴樂、拍手等耶？",
        "translation": "How come there's no music or clapping hands in the Trāyastriṃśa Heaven?",
        "source": "T12n0354_002:0233b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我今者不復聞聲。",
        "translation": "\"Now, I don't hear that sound anymore.",
        "source": "T12n0354_002:0233b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何期此處三十三天——第一可愛天——乾闥婆天色莊嚴，金剛堅地，如是千眼帝釋天王，復有何等福德眾生和集往彼而得見耶？",
        "translation": "Why is it that the Trāyastriṃśa Heaven-the most desirable heaven-the Ganymede Heaven-is so resplendent in appearance and adamantine in its ground that such a thousand-eyed Indra the king of gods, what other virtuous sentient beings would assemble there and be able to see it?",
        "source": "T12n0354_002:0233b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波利耶多、俱枳陀羅、諸樹花鬘在我頭上，何期萎蔫？』",
        "translation": "When will the flowers of the parietal and the kukkuṭa trees wither on my head?'",
        "source": "T12n0354_002:0233c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼欲退天如是號喚，三十三天聞彼聲已，一切愁憂，取種種花以自莊嚴，清淨鬚髮。",
        "translation": "\"When the Trāyastriṃśa gods hear this call, they are overcome with grief and take various flowers to adorn themselves and cleanse their hair.",
        "source": "T12n0354_002:0233c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝釋天王百千天眾而為圍遶，天后舍支、天女圍遶，那羅達離、支多伽大、般遮尸棄、敦扶盧等，天乾闥婆天樂歌聲、美妙音聲，而來向彼欲趣死道五相出者。",
        "translation": "Surrounded by a hundred thousand gods, surrounded by the queen goddess Śākya and the goddesses, surrounded by Nāradaṇa, Cetagada, Pañcāśikas, Dundubhū, and others, the god Ganymede sings with music and makes beautiful sounds, and comes to him with the five phases of those who want to go to the path of death and escape.",
        "source": "T12n0354_002:0233c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既近見已，一切如是生憐愍心，同聲唱言：『何期苦哉！",
        "translation": "After they got close enough to see him, they all thus became compassionate and sang with one voice, saying, 'What a long time to be miserable!'",
        "source": "T12n0354_002:0233c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此惡無常，無有悲心。』",
        "translation": "This evil is impermanent, and there's no compassion.'",
        "source": "T12n0354_002:0233c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「帝釋天王見彼如是欲退天已，梵聲說言：『我等一切法皆如是，莫生愛著，當斷愛心。",
        "translation": "\"After the Indra Deva king saw that person's desire to retire from heaven, Brahmā said, 'All of our things are like this; don't become attached to them; you must stop loving them.",
        "source": "T12n0354_002:0233c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不斷愛則生惡道。』",
        "translation": "If you don't stop loving, then you'll be born in a bad path.'",
        "source": "T12n0354_002:0233c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸餘天子亦復如是，一切同聲如是說言：『君善道去，生於人中，一切眾生造善業之地。』",
        "translation": "Similarly, the other gods, all speaking with one voice, said, 'You will depart on a good path and be born among humans, a place where all sentient beings create good actions.'",
        "source": "T12n0354_002:0233c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是說已，彼欲退天心即念言：『我今實退。』",
        "translation": "\"After they said this, the gods who wanted to retire then mentally thought, 'Now, I've really retired.'",
        "source": "T12n0354_002:0233c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時合掌向彼天眾如是說言：『三十三天一切天子！",
        "translation": "Immediately, he joined his palms together and addressed the crowd of gods, saying, 'All the gods of the Trāyastriṃśa Heaven!",
        "source": "T12n0354_002:0233c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願忍我，我退時至。』",
        "translation": "'Please bear with me, for the time will come when I retire.'",
        "source": "T12n0354_002:0233c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時天子引氣直視，有二相出：蓮花葉眼、一切莊嚴皆悉失沒。",
        "translation": "As the gods drew their breath and looked straight ahead, two things emerged: the eyes of the lotus leaves and all their adornment were all lost.",
        "source": "T12n0354_002:0233c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼諸天子見欲退天離莊嚴已，取曼羅婆、居世舍耶、居迦那大如是等花遙散其身。",
        "translation": "\"When those celestials see the gods' desire to retire and part with their adornment, they take a flower like the mango, the kushīśaya, or the kukāna and scatter it far and wide.",
        "source": "T12n0354_002:0233c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即作天樂，琵琶、鼓、笛種種音聲而以樂之。",
        "translation": "They then create celestial music, playing a pipa, drum, and flute with a variety of sounds.",
        "source": "T12n0354_002:0233c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼見如是供養身已，雖退天處心生歡喜，於閻浮提心生悕望。",
        "translation": "\"After they see such an offering body, their hearts rejoice even though they've retreated to a heavenly place, and their minds yearn for Yambudvīpa.",
        "source": "T12n0354_002:0233c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼中淚出，其聲則麁：『有因時、業法集，相應盡命。』",
        "translation": "Tears well up in their eyes, and their voice is crude: 'When there's a cause, the collection of karma will be matched by the end of life.'",
        "source": "T12n0354_002:0233c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命盡死已，伽阿那風吹彼死天。",
        "translation": "After his life ends and he dies, the Gaṇḍavyāna wind blows that death heaven.",
        "source": "T12n0354_002:0233c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼風善香，吹之令散。",
        "translation": "That wind has a nice fragrance, and when it blows, it causes it to disperse.",
        "source": "T12n0354_002:0233c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是散已，即時遠離三十三天，不知所在、無有處所，不能生他若想、若知。",
        "translation": "After it disperses like this, they immediately leave the Trāyastriṃśa Heaven, not knowing where they are or where there is no place, and they can't conceptualize or know about others.",
        "source": "T12n0354_002:0233c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼既退已，生於人間。",
        "translation": "\"After they retire, they're born among humans.",
        "source": "T12n0354_002:0233c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在胎藏中，母則相現，憙笑歌舞，心憙染欲，心常歡喜，憙樂花、果、樹林之處，樂著種種雜色衣服，常憙飲食。",
        "translation": "While in the womb, their mother's features appear, they laugh, sing, dance, become defiled in their minds, and are always joyous at heart, delighting in flowers, fruits, and woods, gladly wearing various kinds of clothing, and always drinking.",
        "source": "T12n0354_002:0233c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖住藏內，母脇不苦，不樂邪欲，心喜善香、花鬘莊嚴，臥則善夢，非顛倒見。",
        "translation": "Even though they live in the store, their mothers aren't bitter, they don't delight in wrong desires, their minds are delighted with good fragrances and the adornment of flowers, and they dream well when they lie down, so they don't see things mistakenly.",
        "source": "T12n0354_002:0234a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，三十三天退生此時，住母藏中有如是相。",
        "translation": "Great sage, you should know that when the Trāyastriṃśa gods regress and are born here, they have this kind of appearance when they live in their mother's storehouse.",
        "source": "T12n0354_002:0234a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大仙當知，其母爾時一切藏過皆悉遠離，後則出生。",
        "translation": "\"Great sage, you should know that at the time, his mother was free of all the faults in her store and was later born.",
        "source": "T12n0354_002:0234a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，彼時童子既出生已，身分平正，掌文成就，可憙柔軟，腰細齒密，身體柔軟。",
        "translation": "Great sage, you should know that once he's born, that boy has a correct body, perfectly proportioned palms, a supple and flexible waist, and a supple body with fine teeth.",
        "source": "T12n0354_002:0234a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其心愛樂勝功德欲，性愛欲事、心愛細衣，樂林戲處。",
        "translation": "His mind is delighted with the desire for superior qualities, his nature loves desirable things, his mind loves fine clothing, and he enjoys playing in the woods.",
        "source": "T12n0354_002:0234a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身有勝香，大富豐財，金寶具足，大姓種族，常行施、戒；欲心多者則生貧家。",
        "translation": "Their body has a superior fragrance, they're rich and wealthy, replete with gold and jewelry, and of a large family, and they always practice generosity and morality; those with many desires will be born into a poor family.",
        "source": "T12n0354_002:0234a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心憙布施，不黑、不白，手足齊平，一切見者皆悉愛敬。",
        "translation": "With a mind agitated with generosity, he's neither black nor white, and his hands and feet are even, so all who see him are fond of him and respect him.",
        "source": "T12n0354_002:0234a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性愛論義，其心柔軟，少於瞋心、樂行他妻，於自妻妾不生愛樂，於諸親舊、兄弟、眷屬心不愛戀。",
        "translation": "Their nature is loving, their mind is gentle, they have little anger, are happy with other wives, don't have cravings for their own wives and concubines, and don't have cravings for their relatives or old friends, brothers, or retinues.",
        "source": "T12n0354_002:0234a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大仙當知，三十三天退生人中，本性如是。」",
        "translation": "You should know, great sage, that the Trāyastriṃśa gods are retired among humans and are originally like this.\"",
        "source": "T12n0354_002:0234a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊說已，毘耶娑仙、一切仙眾心生歡喜，歎言：「善哉。」",
        "translation": "After the Bhagavān spoke, the sage Vaiśravaṇa and all the sages rejoiced and praised him, saying, \"Good!\"",
        "source": "T12n0354_002:0234a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘耶娑問經卷下",
        "translation": "Vaiśravaṇa Question Sutra, Volume 2",
        "source": "T12n0354_002:0234a17_0",
        "is_bad_quality": false
    }
]