[
    {
        "source_sentence": "佛垂般涅槃略說教誡經(亦名遺教經)後秦龜茲國三藏鳩摩羅什奉　詔譯釋迦牟尼佛初轉法輪，度阿若憍陳如，最後說法度須跋陀羅，所應度者皆已度訖，於娑羅雙樹間將入涅槃。",
        "translation": "Fochui banniepan lüeshuo jiaojie jing (also called yijiao jing) was translated by imperial order of the Tripiṭaka Kumārajīva of Kucha in the Later Qin dynasty into Chinese by Kumārajīva, after the Buddha had first turned the wheel of the Dharma, had delivered Ājñāta-kauṇḍinya, and had finally delivered the Dharma to Subhadra, who was about to enter nirvāṇa among the two śāla trees after having delivered all those who should be delivered.",
        "source": "T12n0389_001:1110c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時中夜寂然無聲，為諸弟子略說法要：「汝等比丘，於我滅後，當尊重珍敬波羅提木叉。",
        "translation": "At the time, the middle of the night was silent, and he spoke briefly to his disciples about the essentials of the Dharma, \"You monks, after I cease, you must honor and cherish Prātimokṣa.",
        "source": "T12n0389_001:1110c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如闇遇明、貧人得寶，當知此則是汝大師，若我住世無異此也。",
        "translation": "Just as when darkness meets light and a poor man finds a treasure, you should know that this is your great teacher, and it wouldn't be different from this if I were to live in the world.",
        "source": "T12n0389_001:1110c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持淨戒者，不得販賣貿易、安置田宅、畜養人民奴婢畜生，一切種殖及諸財寶，皆當遠離如避火坑。",
        "translation": "Those who uphold the precepts mustn't sell or trade, build homes, or keep people as slaves or animals, and all their seeds and treasures must be kept away from them like avoiding a fire pit.",
        "source": "T12n0389_001:1110c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不得斬伐草木、墾土掘地，合和湯藥、占相吉凶、仰觀星宿推步盈虛曆數算計，皆所不應。",
        "translation": "They mustn't cut down grass or trees, dig up land, combine hot water and medicine, divine fortune and misfortune, or look up at the stars and constellations and project calendrical calculations into the sky.",
        "source": "T12n0389_001:1110c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "節身時食清淨自活，不得參預世事通致使命，呪術仙藥、結好貴人親厚媟嫚，皆不應作。",
        "translation": "They mustn't get involved in worldly affairs, share their fortune, perform magic, administer medicines, or befriend noble people and have affection for them.",
        "source": "T12n0389_001:1110c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當自端心正念求度，不得苞藏瑕疵、顯異惑眾。",
        "translation": "They must correctly concentrate their minds and seek salvation, and they mustn't hide imperfections or reveal differences to confuse the crowd.",
        "source": "T12n0389_001:1110c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於四供養知量知足，趣得供事不應稸積，此則略說持戒之相。",
        "translation": "Knowing the amount and adequacy of the four offerings and aiming to make offerings should not be accumulated prudently, and this is a brief explanation of the observance of precepts.",
        "source": "T12n0389_001:1111a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒是正順解脫之本，故名波羅提木叉。",
        "translation": "The precepts are the basis of right ascetic liberation, which is why they're called prātimokṣa.",
        "source": "T12n0389_001:1111a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依因此戒，得生諸禪定及滅苦智慧。",
        "translation": "Because of these precepts, meditation and the wisdom to end suffering can arise.",
        "source": "T12n0389_001:1111a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故比丘，當持淨戒勿令毀犯。",
        "translation": "Therefore, monks, you must observe the pure precepts and not violate them.",
        "source": "T12n0389_001:1111a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人能持淨戒，是則能有善法。",
        "translation": "If a person can observe the pure precepts, then he'll be able to have good qualities.",
        "source": "T12n0389_001:1111a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無淨戒，諸善功德皆不得生。",
        "translation": "Without the pure precepts, none of the good qualities can arise.",
        "source": "T12n0389_001:1111a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是以當知，戒為第一安隱功德之所住處。",
        "translation": "Therefore, you should know that the precepts are the first place where peaceful virtues reside.",
        "source": "T12n0389_001:1111a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，已能住戒當制五根，勿令放逸入於五欲。",
        "translation": "\"Monks, once you've been able to observe the precepts, you should restrain your five faculties and not allow them to wander off into the five desires.",
        "source": "T12n0389_001:1111a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如牧牛之人執杖視之，不令縱逸犯人苗稼；若縱五根，非唯五欲將無崖畔不可制也，亦如惡馬不以轡制，將當牽人墜於坑陷，如被劫害苦止一世；五根賊禍殃及累世，為害甚重，不可不慎。",
        "translation": "They're like a cowherd who guards them with a staff and doesn't allow negligence to offend the crops; if they neglect the five faculties, not only will the five desires be unchecked without a cliff, but they'll also be like a bad horse that isn't restrained by its handle and will lead a person into a pit or sink, like being damaged by an eon that's painful for only one life; the misfortune of the five faculties being robbed will have consequences for generations to come, and the harm it causes is so serious that it mustn't be avoided.",
        "source": "T12n0389_001:1111a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故智者制而不隨，持之如賊不令縱逸；假令縱之，皆亦不久見其磨滅。",
        "translation": "Therefore, a wise person restrains them and doesn't follow them, holding them like thieves and not allowing them to escape; even if they are connived at, they'll soon see them decay.",
        "source": "T12n0389_001:1111a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此五根者，心為其主。",
        "translation": "Of these five faculties, the mind is their master.",
        "source": "T12n0389_001:1111a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等當好制心，心之可畏，甚於毒蛇、惡獸怨賊、大火越逸，未足喻也，動轉輕躁，但觀於蜜不見深坑，譬如狂象無鈎，猿猴得樹騰躍跳躑，難可禁制，當急挫之無令放逸。",
        "translation": "Therefore, you must well control the mind, which is more frightening than a poisonous snake, a vicious animal, a thief, or a great fire that escapes, or which is not sufficient to describe, and which is agitated and uncontrolled but only observes honey and doesn't see a deep pit, like a mad elephant without hooks or a monkey that leaps and jumps up from a tree, which is difficult to restrain.",
        "source": "T12n0389_001:1111a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縱此心者喪人善事，制之一處無事不辦。",
        "translation": "Even though this mind deprives people of good works, there's nothing that can't be done when it's restrained.",
        "source": "T12n0389_001:1111a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故比丘，當勤精進折伏其心。",
        "translation": "Therefore, monks, you must work hard to subdue that mind.",
        "source": "T12n0389_001:1111a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，受諸飲食當如服藥，於好於惡勿生增減，趣得支身以除飢渴。",
        "translation": "\"You monks, take your food and drink as you would medicine, so that you don't add or subtract from what's good and what's bad, and you attain a support body to remove hunger and thirst.",
        "source": "T12n0389_001:1111a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如蜂採花，但取其味不損色香。",
        "translation": "Like a bee picking a flower, it only takes its taste and doesn't harm its color or fragrance.",
        "source": "T12n0389_001:1111a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘亦爾，受人供養取自除惱，無得多求壞其善心。",
        "translation": "Similarly, a monk who accepts an offering from someone takes it for himself to remove his own anxiety and doesn't get to seek more than that to damage his good intentions.",
        "source": "T12n0389_001:1111a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如智者籌量牛力所堪多少，不令過分以竭其力。",
        "translation": "He's like a wise man who gauges how much strength an ox can exert and doesn't let too much of it exhaust his strength.",
        "source": "T12n0389_001:1111a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，晝則勤心修習善法無令失時，初夜後夜亦勿有廢，中夜誦經以自消息，無以睡眠因緣令一生空過無所得也。",
        "translation": "\"You monks, diligently cultivate good qualities during the day without letting them be lost, don't neglect them during the first and second nights, and recite the sūtras during the middle of the night to inform yourselves, so that you don't let the causes of sleep make your whole life empty and unprofitable.",
        "source": "T12n0389_001:1111a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當念無常之火燒諸世間，早求自度勿睡眠也。",
        "translation": "He should be mindful of the fires of impermanence that burn the world, and seek his own deliverance early so that he doesn't fall asleep.",
        "source": "T12n0389_001:1111a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸煩惱賊常伺殺人，甚於怨家，安可睡眠不自驚寤？",
        "translation": "Those afflicted thieves are always searching for someone to kill, even more so than enemies, so how can they sleep and not awaken themselves?",
        "source": "T12n0389_001:1111b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "煩惱毒蛇睡在汝心，譬如黑蚖在汝室睡，當以持戒之鉤早摒除之。",
        "translation": "\"The viper of affliction sleeping in your mind is like a black adder sleeping in your room; you must remove it early with the hook of the precepts.",
        "source": "T12n0389_001:1111b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "睡蛇既出乃可安眠，不出而眠是無慚人也。",
        "translation": "Once the sleeping snake is out, then you can sleep peacefully; sleeping without it is a person without conscience.",
        "source": "T12n0389_001:1111b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慚恥之服，於諸莊嚴最為第一，慚如鐵鉤，能制人非法。",
        "translation": "The garment of conscience and shame is the most distinguished of the adornments, and conscience is like an iron hook that restrains people from doing what's unlawful.",
        "source": "T12n0389_001:1111b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故比丘，常當慚恥，無得暫替，若離慚恥則失諸功德。",
        "translation": "Therefore, monks should always be conscientious and ashamed, for there's no substitute, and if they part with conscience and shame, they'll lose their virtues.",
        "source": "T12n0389_001:1111b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有愧之人則有善法；若無愧者，與諸禽獸無相異也。",
        "translation": "A person with modesty then has good qualities, but if he lacks modesty, he's no different from animals.",
        "source": "T12n0389_001:1111b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，若有人來節節支解，當自攝心無令瞋恨，亦當護口勿出惡言，若縱恚心則自妨道、失功德利。",
        "translation": "\"You monks, if someone comes to you with moderation and understanding, you must control your thoughts and not become angry, and you must guard your mouth from harsh words; if you harbor anger, you'll hinder your own path and lose the benefits of your virtue.",
        "source": "T12n0389_001:1111b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忍之為德，持戒苦行所不能及。",
        "translation": "The virtue of patience is beyond the ability to observe precepts and engage in austerities.",
        "source": "T12n0389_001:1111b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能行忍者乃可名為有力大人；若其不能歡喜忍受惡罵之毒如飲甘露者，不名入道智慧人也。",
        "translation": "If someone can practice ninjutsu, they can be called a powerful man; if they can't joyfully endure the poison of harsh words like drinking nectar, they aren't called a person of wisdom who has entered the path.",
        "source": "T12n0389_001:1111b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0389_001:1111b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋恚之害能破諸善法、壞好名聞，今世後世人不憙見。",
        "translation": "The harmful effects of anger can destroy good qualities and good reputation, and people in the present and future generations won't see it with joy.",
        "source": "T12n0389_001:1111b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知瞋心甚於猛火，常當防護無令得入，劫功德賊無過瞋恚。",
        "translation": "You should know that anger is worse than a fierce fire, so you should always guard against it and prevent it from entering, and the robber of kalpic merit is no worse than anger.",
        "source": "T12n0389_001:1111b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白衣受欲非行道人，無法自制，瞋猶可恕；出家行道無欲之人，而懷瞋恚，甚不可也。",
        "translation": "A person in white clothing who accepts desires and doesn't practice the path can't control it, so anger is still forgivable; a person who leaves home and practices the path without desires and harbors anger is quite unacceptable.",
        "source": "T12n0389_001:1111b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如清冷雲中霹靂起火，非所應也。",
        "translation": "It's like a thunderbolt starting a fire in a clear, cold cloud, which is not desirable.",
        "source": "T12n0389_001:1111b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，當自摩頭，已捨飾好著壞色衣，執持應器以乞自活，自見如是，若起憍慢當疾滅之。",
        "translation": "\"You monks, after you've adjusted your heads, put away your adornments, put on clothing of bad color, and carry a suitable container to beg for your own living, seeing for yourselves that this is the case, you must quickly extinguish pride if it arises.",
        "source": "T12n0389_001:1111b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂長憍慢尚非世俗白衣所宜，何況出家入道之人，為解脫故自降其心而行乞耶？",
        "translation": "It's not appropriate for a secular white man to grow proud, so why would a renunciant entering the path lower his own mind to begging for his own liberation?",
        "source": "T12n0389_001:1111b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，諂曲之心與道相違，是故宜應質直其心。",
        "translation": "\"You monks, flattery is contrary to the path, so it's appropriate to straighten your hearts.",
        "source": "T12n0389_001:1111b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知諂曲但為欺誑，入道之人則無是處。",
        "translation": "You should know that flattery is merely deceptive, but there's no place for someone who enters the path.",
        "source": "T12n0389_001:1111b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等，宜應端心以質直為本。",
        "translation": "It's therefore appropriate for you to center your minds on quality and straightness.",
        "source": "T12n0389_001:1111b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，當知多欲之人多求利故，苦惱亦多；少欲之人無求無欲，則無此患。",
        "translation": "\"You monks, know that a person with many desires seeks much profit, so he has many sufferings and distress, but a person with few desires has no desires and no wants, so he has no such sufferings.",
        "source": "T12n0389_001:1111b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直爾少欲尚應修習，何況少欲能生諸善功德！",
        "translation": "It's straightforward to cultivate few desires, so how much more so when few desires can produce good qualities!",
        "source": "T12n0389_001:1111b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少欲之人則無諂曲以求人意，亦復不為諸根所牽。",
        "translation": "When someone has few desires, they aren't flattered by the desire to win people over, and they aren't pulled by the faculties.",
        "source": "T12n0389_001:1111c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行少欲者，心則坦然無所憂畏，觸事有餘常無不足，有少欲者則有涅槃。",
        "translation": "When he practices few desires, his mind is open and free of grief and fear, and when he touches things with remainder, he always has no lack, and when he has few desires, he has nirvāṇa.",
        "source": "T12n0389_001:1111c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名少欲。",
        "translation": "This is called having few desires.",
        "source": "T12n0389_001:1111c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，若欲脫諸苦惱，當觀知足，知足之法即是富樂安隱之處。",
        "translation": "\"You monks, if you want to be freed from suffering and distress, you should examine the state of being satisfied, for the state of being satisfied is a place of wealth, happiness, and comfort.",
        "source": "T12n0389_001:1111c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知足之人，雖臥地上猶為安樂；不知足者，雖處天堂亦不稱意。",
        "translation": "A person who knows his feet is comfortable even though he's lying on the ground, but someone who doesn't know his feet isn't satisfied even though he's in heaven.",
        "source": "T12n0389_001:1111c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知足者雖富而貧，知足之人雖貧而富。",
        "translation": "Although he doesn't know his feet, he's rich but poor, and although he's poor, he's rich.",
        "source": "T12n0389_001:1111c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知足者常為五欲所牽，為知足者之所憐愍。",
        "translation": "Those who don't know their own feet are always tied by the five desires, and they are pitied by those who know their own feet.",
        "source": "T12n0389_001:1111c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名知足。",
        "translation": "This is called knowing contentment.",
        "source": "T12n0389_001:1111c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，若求寂靜無為安樂，當離憒閙、獨處閑居，靜處之人帝釋諸天所共敬重。",
        "translation": "\"If you monks seek quietude and aimless happiness, you should part with the commotion and live alone in seclusion, where people of quietude are held in high esteem by the gods of Indra and Indra.",
        "source": "T12n0389_001:1111c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當捨己眾他眾，空閑獨處思滅苦本。",
        "translation": "Therefore, you must abandon yours and others, and you must live in solitude and contemplate the cessation of the causes of suffering.",
        "source": "T12n0389_001:1111c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若樂眾者則受眾惱，譬如大樹眾鳥集之，則有枯折之患。",
        "translation": "If someone takes delight in crowds, then they'll be afflicted by crowds, like a large tree that's crowded with birds and will suffer from withering and breaking down.",
        "source": "T12n0389_001:1111c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間縛著沒於眾苦，譬如老象溺泥不能自出。",
        "translation": "Their worldly bonds are tied up in many sufferings, like an old elephant submerged in mud that can't get out on its own.",
        "source": "T12n0389_001:1111c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名遠離。",
        "translation": "This is called seclusion.",
        "source": "T12n0389_001:1111c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，若勤精進則事無難者，是故汝等，當勤精進，譬如小水常流則能穿石。",
        "translation": "\"If you monks diligently apply yourselves, then there's no difficulty in doing anything; therefore, you should apply yourselves diligently, like a small stream of water that can pierce a rock when it flows constantly.",
        "source": "T12n0389_001:1111c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行者之心數數懈廢，譬如鑽火未熱而息，雖欲得火，火難可得。",
        "translation": "If a practitioner's mind is repeatedly lazy, it's like a fire that's stilled before it's heated, and even though you want to get fire, it's difficult to get it.",
        "source": "T12n0389_001:1111c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名精進。",
        "translation": "This is called exertion.",
        "source": "T12n0389_001:1111c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，求善知識、求善護助而不忘念，若不忘念者，諸煩惱賊則不能入，是故汝等，常當攝念在心；若失念者則失諸功德。",
        "translation": "\"You monks, seek good friends and seek good protection and don't forget mindfulness; if you don't forget mindfulness, the thieves of affliction won't be able to enter, so you should always keep mindfulness in mind; if you lose mindfulness, you'll lose your virtues.",
        "source": "T12n0389_001:1111c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若念力堅強，雖入五欲賊中不為所害，譬如著鎧入陣則無所畏。",
        "translation": "If mindfulness is strong, then even though you enter the five thieves of desire, you won't be harmed, like putting on armor and going into battle and having no fear.",
        "source": "T12n0389_001:1111c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名不忘念。",
        "translation": "This is called not forgetting mindfulness.",
        "source": "T12n0389_001:1111c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，若攝心者心則在定，心在定故能知世間生滅法相，是故汝等，常當精勤修集諸定，若得定者心則不亂，譬如惜水之家善治堤塘。",
        "translation": "\"You monks, if you collect your minds, your minds are in concentration, and when they are in concentration, you can know the characteristics of the world's arising and ceasing dharmas.",
        "source": "T12n0389_001:1111c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者亦爾，為智慧水故，善修禪定令不漏失。",
        "translation": "So too, practitioners skillfully cultivate meditation so that water of wisdom isn't lost.",
        "source": "T12n0389_001:1111c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名為定。",
        "translation": "This is called concentration.",
        "source": "T12n0389_001:1112a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，若有智慧則無貪著，常自省察不令有失，是則於我法中能得解脫；若不爾者，既非道人又非白衣，無所名也。",
        "translation": "\"If you monks have wisdom, then you'll have no craving and always examine yourselves so that nothing is lost, and this is how you'll attain liberation in our teaching; if that's not the case, you're neither a practitioner nor a white-clothed man, and there's no name for it.",
        "source": "T12n0389_001:1112a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實智慧者，則是度老病死海堅牢船也，亦是無明黑闇大明燈也，一切病苦之良藥也，伐煩惱樹者之利斧也。",
        "translation": "True wisdom, then, is a ship that's hard and fastened over the sea of old age, illness, and death, a great bright lamp in the darkness of ignorance, a good medicine for all illnesses and pains, and a sharp ax for cutting down the trees of affliction.",
        "source": "T12n0389_001:1112a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等，當以聞思修慧而自增益。",
        "translation": "Therefore, all of you should empower yourselves with the wisdom of hearing, contemplating, and cultivating.",
        "source": "T12n0389_001:1112a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人有智慧之照，雖無天眼而是明見人也。",
        "translation": "If a person has the illumination of wisdom, he'll see people clearly even though they don't have the divine eye.",
        "source": "T12n0389_001:1112a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為智慧。",
        "translation": "This is wisdom.",
        "source": "T12n0389_001:1112a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，若種種戲論其心則亂，雖復出家猶未得脫。",
        "translation": "\"Monks, if you engage in various kinds of conceptual proliferation, your minds will be disturbed, and even though you've left home again, you still haven't attained liberation.",
        "source": "T12n0389_001:1112a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故比丘，當急捨離亂心戲論。",
        "translation": "Therefore, monks, you should urgently abandon mental agitation that disturbs the mind.",
        "source": "T12n0389_001:1112a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若汝欲得寂滅樂者，唯當善滅戲論之患。",
        "translation": "If you want to attain the joy of cessation, you must only skillfully end the danger of conceptual proliferation.",
        "source": "T12n0389_001:1112a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名不戲論。",
        "translation": "This is called not engaging in conceptual proliferation.",
        "source": "T12n0389_001:1112a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，於諸功德常當一心，捨諸放逸如離怨賊。",
        "translation": "\"You monks, always be single-minded about these attributes, and abandon all carelessness as you would a thief.",
        "source": "T12n0389_001:1112a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大悲世尊所欲利益皆以究竟，汝等但當勤而行之。",
        "translation": "The greatly compassionate Bhagavān wants to bring about the ultimate benefit, so you must only diligently apply yourselves to it.",
        "source": "T12n0389_001:1112a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在山間、若空澤中，若在樹下、閑處靜室，念所受法勿令忘失，常當自勉精進修之，無為空死後致憂悔。",
        "translation": "If you're in a mountainous region or in an empty swamp or under a tree or in a quiet room in a quiet place, remember the teaching you've received and don't let it be forgotten, and always strive to cultivate it yourself so that you don't regret being empty and dying later.",
        "source": "T12n0389_001:1112a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如良醫，知病說藥，服與不服，非醫咎也。",
        "translation": "I'm like a good doctor who knows the disease and prescribes medicine, and it's not the doctor's fault whether he takes it or not.",
        "source": "T12n0389_001:1112a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如善導，導人善道，聞之不行，非導過也，汝等若於苦等四諦有所疑者，可疾問之，無得懷疑不求決也。」",
        "translation": "I'm also like a good guide who guides people on the good path and hears that it's not a fault of the guide if they don't follow it. If you have any doubts about the four truths of suffering and so forth, you can quickly ask about them; you can't doubt them and not seek answers.\"",
        "source": "T12n0389_001:1112a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊如是三唱，人無問者。",
        "translation": "At the time, the Bhagavān called out this three times, but no one asked any questions.",
        "source": "T12n0389_001:1112a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0389_001:1112a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾無疑故。",
        "translation": "It's because the multitude has no doubts.",
        "source": "T12n0389_001:1112a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿[少/兔]樓馱觀察眾心而白佛言：「世尊！",
        "translation": "It was then that A[sao/rabbit] Rudra observed the minds of the people and said to the Buddha, \"Bhagavān!",
        "source": "T12n0389_001:1112a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月可令熱，日可令冷，佛說四諦不可令異。",
        "translation": "While the moon can be made hot and the sun can be made cold, the Buddha teaches that the four truths can't be made different.",
        "source": "T12n0389_001:1112a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說苦諦真實是苦，不可令樂；集真是因，更無異因；苦若滅者即是因滅，因滅故果滅；滅苦之道實是真道，更無餘道。",
        "translation": "When the Buddha teaches that the truth of suffering is truly suffering, it can't be made pleasant; that agglomeration is truly a cause, and there's no different cause; that if suffering ceases, it's the cause that ceases, and because the cause ceases, the effect ceases; and that the path to ending suffering is truly the path, and there's no other path.",
        "source": "T12n0389_001:1112a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0389_001:1112a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸比丘於四諦中決定無疑。",
        "translation": "\"Such monks are certain of the four truths and have no doubt about them.",
        "source": "T12n0389_001:1112a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此眾中所作未辦者，見佛滅度，當有悲感。",
        "translation": "Those among them who have yet to accomplish what they've done will have compassionate feelings when they see the Buddha's passing away.",
        "source": "T12n0389_001:1112a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有初入法者，聞佛所說，即皆得度，譬如夜見電光即得見道。",
        "translation": "If there are people who have just begun to enter the Dharma and hear what the Buddha teaches, they'll all be liberated, like seeing a flash of lightning at night and then attaining the path.",
        "source": "T12n0389_001:1112b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若所作已辦、已度苦海者，但作是念：『世尊滅度，一何疾哉！』」",
        "translation": "If someone has accomplished what they've done and has crossed the ocean of suffering, they'll simply think, 'How quickly will the Bhagavān cease to exist?'\"",
        "source": "T12n0389_001:1112b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿[少/兔]樓馱雖說是語，眾中皆悉了達四聖諦義。",
        "translation": "Although A[less/rabbit] Rudra spoke these words, everyone in the crowd fully grasped the meaning of the four noble truths.",
        "source": "T12n0389_001:1112b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊欲令此諸大眾皆得堅固，以大悲心復為眾說：「汝等比丘，勿懷憂惱。",
        "translation": "Desiring to make this crowd resolute, the Bhagavān again addressed the crowd with a great compassionate heart, \"You monks, don't be troubled.",
        "source": "T12n0389_001:1112b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我住世一劫會亦當滅，會而不離，終不可得。",
        "translation": "If I were to remain in the world for one eon, this congregation would also cease, and it would never be possible to separate from it.",
        "source": "T12n0389_001:1112b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自利利人法皆具足，若我久住更無所益，應可度者，若天上人間皆悉已度，其未度者，皆亦已作得度因緣。",
        "translation": "The Dharma for the benefit of self and others is complete, and if I were to stay a long time, there would be nothing more to gain, and those who should be saved would all have been saved up in heaven or among humans, and those who haven't been saved would have been made the cause for their salvation.",
        "source": "T12n0389_001:1112b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今已後，我諸弟子展轉行之，則是如來法身常在而不滅也。",
        "translation": "From now on, as my disciples continue to practice, the Tathāgata's Dharma body will always remain and not perish.",
        "source": "T12n0389_001:1112b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知，世皆無常，會必有離，勿懷憂也。",
        "translation": "Therefore, you should know that the world is impermanent and will surely part, so don't be concerned.",
        "source": "T12n0389_001:1112b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世相如是，當勤精進早求解脫，以智慧明滅諸癡闇。",
        "translation": "Thus are the characteristics of the world, so you should strive to seek early liberation and extinguish delusion and darkness with the insight of wisdom.",
        "source": "T12n0389_001:1112b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世實危脆無牢強者，我今得滅如除惡病，此是應捨罪惡之物，假名為身，沒在生老病死大海，何有智者得除滅之，如殺怨賊而不歡喜？",
        "translation": "The world is really fragile and has no strong hold, and I've now been able to extinguish it like removing a bad disease. This is a sinful or evil thing that should be abandoned, which is nominally called a body and is submerged in the ocean of birth, age, sickness, and death.",
        "source": "T12n0389_001:1112b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘，常當一心勤求出道，一切世間動不動法，皆是敗壞不安之相。",
        "translation": "\"You monks, you must always single-mindedly strive to escape the path, for all worldly phenomena that are neither moving nor unmoving are signs of decay and unease.",
        "source": "T12n0389_001:1112b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等且止，勿得復語，時將欲過，我欲滅度，是我最後之所教誨。」",
        "translation": "Stop right there, don't say that again; the time is about to pass, and I want to annihilate it; this is the last thing I'll teach.\"",
        "source": "T12n0389_001:1112b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛垂般涅槃略說教誡經",
        "translation": "Fochui banniepan lüeshuo jiaojie jing",
        "source": "T12n0389_001:1112b22_0",
        "is_bad_quality": false
    }
]