[
    {
        "source_sentence": "佛說無量清淨平等覺經卷第四",
        "translation": "Sutra of Immeasurable Pure and Equal Enlightenment, Volume 4",
        "source": "T12n0361_004:0295b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後漢月氏國三藏支婁迦讖譯",
        "translation": "A Translation of the Tripiṭaka of the Yuezhi State of the Latter Han Dynasty by Zhilukakṣema",
        "source": "T12n0361_004:0295b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎佛告阿逸菩薩等：「若曹於是世能自制心正意、身不作惡者，是為大德善，都為八方上下最無有比。",
        "translation": "The Buddha told Āyatollah Bodhisattvas and others, \"If someone in this world can control their mind and right intention and refrain from doing evil in themselves, this is a great virtue and goodness that has no parallel up or down in the eight directions.",
        "source": "T12n0361_004:0295b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0361_004:0295b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八方上下無央數佛國中，諸天人民皆自然作善、不大為惡、易教化。",
        "translation": "In the numberless buddha lands up and down in the eight directions, the gods and people naturally do good, don't do evil, and are easy to teach.",
        "source": "T12n0361_004:0295b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我於是世間為佛，於五惡、五痛、五燒之中作佛為最劇。",
        "translation": "Now, I've become a buddha in this world, and among the five evils, five pains, and five burns, becoming a buddha is the most drastic.",
        "source": "T12n0361_004:0295b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教語人民令絕五惡、令去五痛、令去五燒；降化其心令持五善，得其福德度世長壽泥洹之道。」",
        "translation": "I teach and talk to the people, causing them to stop the five evils, get rid of the five pains, and get rid of the five burns; I subdue their minds and cause them to maintain the five good qualities, which will lead to their merit and the path to a long life and nirvāṇa.\"",
        "source": "T12n0361_004:0295b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「何等為五惡？",
        "translation": "The Buddha said, \"What are the five evils?",
        "source": "T12n0361_004:0295b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五痛？",
        "translation": "What are the five kinds of pain?",
        "source": "T12n0361_004:0295b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五燒中者？",
        "translation": "What are the five mediums of burning?",
        "source": "T12n0361_004:0295b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為消化五惡、令持五善者？",
        "translation": "\"What is it that digests the five evils and makes them uphold the five good qualities?",
        "source": "T12n0361_004:0295b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為持五善，得其福德長壽度世泥洹之道？」",
        "translation": "What are the five good qualities that obtain long life and merit and the path to worldly salvation?\"",
        "source": "T12n0361_004:0295b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其一惡者，諸天、人民、下至禽獸、蜎飛蠕動之類欲為眾惡。",
        "translation": "The Buddha said, \"One of these evils is the desire of gods, people, down to animals and creatures that fly and wriggle to do numerous evils.",
        "source": "T12n0361_004:0295c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「強者伏弱，轉相剋賊，自相殺傷，更相食噉，不知為善，惡逆不道，受其殃罰，道之自然，當往趣向。",
        "translation": "\"They don't know what's good, and they are unrighteous and immoral, which brings misfortune and punishment; naturally, they will go to the right path.",
        "source": "T12n0361_004:0295c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "神明記識，犯之不貰，轉相承續，故有貧窮、下賤、乞丐、孤獨人，有聾、盲、瘖瘂、愚癡、弊惡，下有尫狂不及逮之屬。",
        "translation": "The spirits remember and realize that transgressions don't continue, so there are poor, lowly, beggar, and orphan people, deaf, blind, dumb, and unwholesome people, and the lower class who are crazy and don't have the ability to cope.",
        "source": "T12n0361_004:0295c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有尊貴、豪富、高才明達、智慧勇猛，皆其前世宿命，為善慈孝，布恩施德。",
        "translation": "Their noble, wealthy, highly talented, insightful, and courageous counterparts were all predestined in previous lives to be good and kind, and to bestow blessings and virtue.",
        "source": "T12n0361_004:0295c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故有官事、王法、牢獄，不肯畏慎作惡入法，受其過讁重罰致劇，求望解脫難得度出。",
        "translation": "Therefore, they had official duties, the king's law, and prison sentences, refused to be cautious about doing evil and entering the Dharma, received heavy punishment for their faults, and sought liberation that was difficult to escape from.",
        "source": "T12n0361_004:0295c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世有是目前現在，壽終尤劇，入其窈冥，受身更生，譬若王法劇苦極刑。",
        "translation": "In this world, there's the present and the present time, which is especially severe at the end of their lives, when they enter their darkness and are reborn physically, just like the severe pain and extreme punishment of the king's law.",
        "source": "T12n0361_004:0295c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類屬貿身形，改惡易道，壽命短長，魂神命精，自然入趣。",
        "translation": "Therefore, there are naturally nirayas, animals, ferns, and creeping creatures that are bound to trade bodies, change their evil ways, have short and long lives, and naturally enter destinies with their souls, spirits, and vital energies.",
        "source": "T12n0361_004:0295c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受形寄胎當獨值向，相從共生，轉相報償，當相還復。",
        "translation": "They'll be destined to receive a form in the womb alone, be born together, and experience mutual retribution in the future, and will return to each other.",
        "source": "T12n0361_004:0295c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殃惡讁罰，眾事未盡終不得離。",
        "translation": "They'll be subject to evil and retribution, and they'll never be able to escape before all these things have ended.",
        "source": "T12n0361_004:0295c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "展轉其中，世世累劫無有出期，難得解脫，痛不可言。",
        "translation": "It's indescribable how painful it is to go through this cycle of rebirths, with no possibility of escape from it in ages and eons, and how difficult it is to attain liberation.",
        "source": "T12n0361_004:0295c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天地之間自然有是，雖不臨時卒暴至，應時恒取自然之道，皆當善惡歸之，是為一大惡、為一痛、為一燒。",
        "translation": "Although this naturally occurs between heaven and earth, and although it doesn't suddenly and violently arrive at the right time, it's always the natural way that should be followed when appropriate, and it should be the result of good and evil, which is a great evil, a pain, and a burn.",
        "source": "T12n0361_004:0295c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「勤苦如是，愁毒呼嗟，比如劇火起燒人身。",
        "translation": "\"Such is the pain of suffering and the sorrow and bitterness of lamentation, like a raging fire that starts to burn a person.",
        "source": "T12n0361_004:0295c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人能自於其中一心制意、端身正行、獨作諸善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為一大善。」",
        "translation": "If a person can control their thoughts with single-mindedness, proper conduct, and individually create goodness and not do numerous evils, they'll be freed from them alone and attain their merit, which will lead to a long life and escape the path of nirvāṇa in the heavens of the world, which is the great good.\"",
        "source": "T12n0361_004:0295c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其二惡者，世間帝王、長吏、人民、父子、兄弟、室家、夫婦略無義理，不從政令。",
        "translation": "The Buddha said, \"The other two evils are when worldly kings, high-ranking officials, people, fathers, sons, brothers, families, and couples lack righteousness and don't obey government orders.",
        "source": "T12n0361_004:0296a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉淫奢驕慢，各欲快意，恣心自在，更相欺調，殊不懼死。",
        "translation": "They become lustful, extravagant, and arrogant, each desiring what's pleasant, acting freely with their minds, and further deceiving each other, without fearing death.",
        "source": "T12n0361_004:0296a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心口各異，言念無實，佞諂不忠，諛媚巧辭。",
        "translation": "Their minds and speech differ, their words and thoughts are untrue, and they flatter and disloyal, flattering and cleverly describing each other.",
        "source": "T12n0361_004:0296a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行不端正，更相嫉憎，轉相讒惡，陷入惡枉。",
        "translation": "They behave improperly, become jealous and hateful toward each other, and turn to slander and abuse, falling into evil and wrongdoing.",
        "source": "T12n0361_004:0296a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主上不明，心不察照，任用臣下，臣下存在。",
        "translation": "Their lord doesn't know, and his mind doesn't examine and illuminate, appointing subordinates who exist.",
        "source": "T12n0361_004:0296a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淺度能行，知其形勢，在位不正，為其所調。",
        "translation": "They are shallow in their abilities and conduct, and they know their form and strength; they are incorrect in their position and are subject to their control.",
        "source": "T12n0361_004:0296a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄捐忠良，不當天心，甚違道理，臣欺其君、子欺其父、弟欺其兄、婦欺其夫。",
        "translation": "Falsely sacrificing loyalty and goodness, they don't match the mind of God, which is quite contrary to reason.",
        "source": "T12n0361_004:0296a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "室家中外知識相紹，各懷貪婬，心獨恚怒，蒙聾愚癡欲益多。",
        "translation": "Their families and their friends at home and abroad each harbor desire and lust, and their minds are alone with anger, which increases their desire to be deaf and dumb.",
        "source": "T12n0361_004:0296a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有尊卑、上下，無男、無女，無大、無小，心俱同然，欲自厚己。",
        "translation": "Whether superior or inferior, male or female, large or small, their minds are all the same, and they want to enrich themselves.",
        "source": "T12n0361_004:0296a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破家、亡身，不顧念前後，家室親屬坐之破族。",
        "translation": "When their family is destroyed and their body is lost, they don't think about what came before or after them, and their family members sit there with their relatives destroyed.",
        "source": "T12n0361_004:0296a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或時家中內外、知識朋友、鄉黨市里愚民轉共從事，更相利害。",
        "translation": "\"Sometimes their family, friends, friends of the family, or townspeople and townspeople come together to work for their mutual benefit and detriment.",
        "source": "T12n0361_004:0296a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爭錢財鬪，忿怒成仇；轉爭勝負，慳富焦心；不肯施與，專專守惜。",
        "translation": "They fight over money and possessions, becoming angry and hostile; they fight over victory and defeat, becoming stingy and wealthy, and becoming anxious; they refuse to give, focusing only on guarding and cherishing.",
        "source": "T12n0361_004:0296a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛寶貪重，坐之思念，心勞身苦，如是至竟，無所恃怙，獨來獨去，無一隨者。",
        "translation": "They love treasures and covet them, and when they sit and think about them, their minds are tormented and their bodies suffer.",
        "source": "T12n0361_004:0296a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡禍福，殃咎讁罰，追命所生，或在樂處、或入毒苦，然後乃悔，當復何及？",
        "translation": "Good and bad fortune, misfortune, blame, and punishment are produced in pursuit of life, either in pleasant places or into pain and suffering, and then they repent, how could it be?",
        "source": "T12n0361_004:0296a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或時世人愚心少智，見善誹謗恚之，不肯慕及。",
        "translation": "\"Sometimes people are foolish and lack knowledge, and when they see goodness and denigrate it, they won't look up to it.",
        "source": "T12n0361_004:0296a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但欲為惡，妄作非法；但欲盜竊，常懷毒心；欲得他人財物，用自供給，消散摩盡，賜復求索；邪心不正，常獨恐怖，畏人有色，臨時不計，事至乃悔。",
        "translation": "They want to do evil, acting falsely and unlawfully; they want to steal, always harboring a venomous heart; they want to obtain another person's property and use it to provide for themselves, dissipate it and exhaust it, and then give it back to them; their wrong thoughts are not right, and they're always alone in fear; they're afraid of people's appearance, so they don't think about it for a while, but then they repent.",
        "source": "T12n0361_004:0296a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世現在，長吏牢獄，自然趣向，受其殃咎。",
        "translation": "In this world and in the present, they're imprisoned by a longtime official, and they naturally go to be blamed for it.",
        "source": "T12n0361_004:0296a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間貧窮、乞丐、孤獨，但坐前世宿命，不信道德、不肯為善。",
        "translation": "The world is poor, beggar, and orphaned, but they sit on the past lives of their predecessors, don't believe in morality, and refuse to be good.",
        "source": "T12n0361_004:0296a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世為惡，天神別籍，壽終入惡道，故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類。",
        "translation": "When they do evil in this life, the gods separate them from the rest of the world, and they enter a bad destiny at the end of their lives, so they naturally have species like mud and plows, animals, lions, and larvae.",
        "source": "T12n0361_004:0296a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "展轉其中，世世累劫，無有出期，難得解脫，痛不可言，是為二大惡、二痛、二燒。",
        "translation": "Their continuity, age after age, lack of escape, and difficulty in attaining liberation are the two great evils, two pains, and two burns that cannot be described.",
        "source": "T12n0361_004:0296a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「勤苦如是，比如火起燒人身。",
        "translation": "\"Striving for such suffering is like a fire starting to burn one's body.",
        "source": "T12n0361_004:0296b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人能自於其中一心制意、端身正行、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為二大善。」",
        "translation": "If a person can control their own thoughts with single-mindedness, correct their conduct, and do numerous good deeds alone and not numerous evil deeds, they'll be liberated alone and attain merit, which will lead to a long life and the path of nirvāṇa in the gods of the world. These are the two great good deeds.\"",
        "source": "T12n0361_004:0296b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其三惡者，世間人民寄生相因，共依居天地之間，處年壽命無能幾歲。",
        "translation": "The Buddha said, \"The three evils are the causes of parasitic birth for the people of the world, who live together between heaven and earth and whose lifespan each year lasts an indeterminate number of years.",
        "source": "T12n0361_004:0296b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至有豪貴者、賢明善人；下有貧賤、尫羸愚者；中有不良之人，但懷念毒惡，身心不正，常念婬泆，煩滿胸中；愛欲交錯，坐起不安；貪意慳惜，但欲唐得；眄睞細色，惡態婬泆。",
        "translation": "There are the noble and the wise and the good, and there are the poor and the weak and the foolish. There are unscrupulous people who harbor thoughts of evil, whose minds and bodies are not right, who are constantly mindful of sexual misconduct, whose chests are filled with affliction, whose desires are mingled, whose seats are disturbed, whose minds are stingy and stingy, whose desires are only for gain, whose eyes are subtle, and whose attitudes are lustful and erotic.",
        "source": "T12n0361_004:0296b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有婦厭憎，私妄出入，持家所有，相結為非，聚會飲食，自共作惡。",
        "translation": "Some women become disgusted with them, leaving and entering privately and deludedly, forming unholy bonds with each other over what belongs to the family, gathering for meals, and doing evil together.",
        "source": "T12n0361_004:0296b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "興兵作賊，攻城格鬪，劫殺截斷，強奪不道，取人財物。",
        "translation": "They raise an army, become thieves, attack cities, fight, rob, kill, cut off, forcibly seize unrighteous things, and take people's property.",
        "source": "T12n0361_004:0296b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偷竊趣得，不肯治生；所當求者，不肯為之；惡心在外，不能專作；欲擊成事，恐勢迫脅，持歸給家。",
        "translation": "They steal what they want, but won't govern their lives; they refuse to do what they should seek; they can't focus their evil thoughts outwardly; and when they want to accomplish something, they fear pressure and threat, so they take it back to their families.",
        "source": "T12n0361_004:0296b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共相生活，恣心快意，極身作樂，行亂他人婦女。",
        "translation": "They live together, have abandoned their minds and hearts, and have taken great delight in their bodies, thus disrupting the women of others.",
        "source": "T12n0361_004:0296b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或於其親屬，不避尊卑、長老，眾共憎惡，家室中外，患而苦之。",
        "translation": "They may avoid their relatives, honor their superiors, and elders, and make them all hate each other, causing distress and suffering in their homes and families.",
        "source": "T12n0361_004:0296b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復不畏縣官、法令無所避，錄如是之惡，自然牢獄，日月照識、神明記取、諸神攝錄。",
        "translation": "They also don't fear officials or decrees and have nothing to avoid, so they record such evil as a natural prison, where the sun and moon shine on their consciousnesses, the gods remember it, and the spirits take it into account.",
        "source": "T12n0361_004:0296b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類，展轉其中，世世累劫，無有出期，難得度脫，痛不可言，是為三大惡、三痛、三燒，勤苦如是，比若火起燒人身，人能自於其中一心制意、端身正行、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為三大善。」",
        "translation": "\"Therefore, there are natural hells, animals, ferns, and wriggling creatures that go on forever, have no escape time, are difficult to liberate, and have pain that defies explanation. These are the three major evils, three pains, and three burns, and they are painful and painful like this.",
        "source": "T12n0361_004:0296b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其四惡者，諸惡人不能作善，自相壞敗，轉相教令，共作眾惡。",
        "translation": "The Buddha said, \"The four evils are those bad people who can't do good, corrupt themselves, and teach each other to do numerous evils.",
        "source": "T12n0361_004:0296b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主為傳言，但欲兩舌、惡口、罵詈、妄語，相嫉更相鬪亂。",
        "translation": "They preach for the sake of preaching, but they only want to duplicate words, badmouth, ridicule, and speak falsehoods, and they become jealous of each other and fight each other.",
        "source": "T12n0361_004:0296b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憎嫉善人，敗壞賢善，於傍快惡。",
        "translation": "He hates and resents good people, corrupts goodness, and is quick to do evil in the neighborhood.",
        "source": "T12n0361_004:0296c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復不孝順供養父母，輕易師父知識，無信難得誠實。",
        "translation": "They also don't honor or support their parents, make it easy for their teachers and friends, and lack faith that makes it difficult to be genuine.",
        "source": "T12n0361_004:0296c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自言尊貴有道，橫行威武，加捲力勢，侵剋易人不能自知。",
        "translation": "They claim to be noble and virtuous, act boldly and authoritatively, exert force and power, and attack and oppress people without knowing it.",
        "source": "T12n0361_004:0296c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為惡無自羞慚，自用頗健，令人承事敬畏。",
        "translation": "They are ashamed of doing evil and are quite strong in their own ways, which makes them desirable and frightening to others.",
        "source": "T12n0361_004:0296c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復不敬畏天地、神明、日月，亦不可教令作善，不可降化，自用偃蹇，謂常當爾。",
        "translation": "They also don't revere heaven and earth, the gods, the sun, or the moon, and they can't be taught to do good or to subdue or teach others, so they use their own despondency, which is called constant.",
        "source": "T12n0361_004:0296c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復無憂哀心，亦不知恐懼，恣意憍慢如是，天神記識。",
        "translation": "Also, he has no sadness or pity, doesn't know fear, and is wantonly arrogant like this, which the gods remember.",
        "source": "T12n0361_004:0296c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賴其前世宿命頗作福德，小善扶接，營護助之。",
        "translation": "\"They relied on the merit they had accumulated in previous lives, supporting and connecting with minor goodness and supporting and assisting them.",
        "source": "T12n0361_004:0296c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世作惡，福德盡儩，諸善鬼神各去離之，身獨空立，無所復依。",
        "translation": "When their merit ended because of the evil they did in this life, the good spirits left and departed, leaving their bodies alone and empty, with no further support.",
        "source": "T12n0361_004:0296c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受重殃讁，壽命終身惡繞歸，自然迫促，當往追逐，不得止息。",
        "translation": "They'll be exposed to heavy calamities, and at the end of their life they'll be surrounded by evil, which naturally forces them to go after them and won't allow them to stop.",
        "source": "T12n0361_004:0296c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自然眾惡共趣頓乏，其有名籍在神明所，殃咎引牽當值相得，當往趣向。",
        "translation": "Naturally, all evil destinies share a sudden lack of existence, and their names are with the spirits, so they'll be led by evil and blame to meet each other and will go to them.",
        "source": "T12n0361_004:0296c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受過讁罰，身心摧碎，神形苦極，不得離却，但得前行，入於火鑊。",
        "translation": "After being punished by a fatal injury, they are destroyed physically and mentally, and their physical appearance is so painful that they can't escape but travel forward and enter a fiery caldron.",
        "source": "T12n0361_004:0296c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當是時悔復何益？",
        "translation": "What good will it do to repent at that point?",
        "source": "T12n0361_004:0296c16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當復何及？",
        "translation": "How could it be?",
        "source": "T12n0361_004:0296c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天道自然，不得蹉跌，故有泥犁、禽獸、薜荔、蜎飛蠕動之屬，展轉其中，世世累劫，無有出期，難得解脫，痛不可言，是為四大惡、四痛、四燒。",
        "translation": "\"Naturally, the path of heaven can't be compromised, so there are mud and plows, animals, ferns, and wriggling creatures that go from place to place, age after age, with no possibility of escape, and which are difficult to liberate from and cause pain that can't be described, which are the four major evils, the four pains, and the four burns.",
        "source": "T12n0361_004:0296c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「勤苦如是，比如火起燒人身。",
        "translation": "\"Such is the pain of striving, like a fire starting to burn your body.",
        "source": "T12n0361_004:0296c20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人能於其中一心制意、端身正行、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為四大善。」",
        "translation": "A person who can control their thoughts with single-mindedness, conduct themselves correctly, and do numerous good deeds alone and not numerous bad deeds will be liberated alone and attain merit, which will lead to a long life and the path of nirvāṇa in the world's heavens. These are the four major good deeds.\"",
        "source": "T12n0361_004:0296c21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其五惡者，世人徙倚懈惰，不肯作善，不念治生，妻子飢寒，父母俱然。",
        "translation": "The Buddha said, \"The five evils are people who are lazy and migrant, refuse to do good deeds, aren't mindful of healing life, and have wives who are hungry and cold, as well as parents.",
        "source": "T12n0361_004:0296c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲呵教其子，其子惡心，瞋目應怒。",
        "translation": "They want to instruct their children, but their sons are ill-minded and respond angrily to their eyes.",
        "source": "T12n0361_004:0296c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言令不和，違戾反逆劇於野人，比若怨家，不如無子。",
        "translation": "When their words and commands aren't in harmony, their disagreement and rebellion are worse than that of a savage, which is like a resentful family that's worse than having no children.",
        "source": "T12n0361_004:0296c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄遍假貸，眾共患厭，尤無反復，無有報償之心，窮貧困乏，不能復得。",
        "translation": "They are falsely lending to others, and they share their misery and disillusionment, especially without any desire to repay them.",
        "source": "T12n0361_004:0296c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辜較諧聲，放縱遊散，串數唐得，自用賑給，不畏防禁。",
        "translation": "He compares himself to men of sound, indulges in indolence, wanders about, conspires to obtain numerous things, and provides for his own use, not fearing the prohibitions.",
        "source": "T12n0361_004:0297a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飲食無極，喫酒嗜美，出入無有期度。",
        "translation": "He has no limit to what he can eat and drink, and he enjoys the fine things he drinks, and he goes in and out without a set schedule.",
        "source": "T12n0361_004:0297a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魯扈抵突，不知人情，睢眄強制。",
        "translation": "He is arrogant, resilient, unaware of human feelings, and looks at and coerces people.",
        "source": "T12n0361_004:0297a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見人有喜，憎嫉恚之。",
        "translation": "When he sees someone's joy, he hates and resents them.",
        "source": "T12n0361_004:0297a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無義無禮，自用職當，不可諫曉。",
        "translation": "They lack righteousness and propriety, and they use their positions appropriately, so they can't be advised or informed.",
        "source": "T12n0361_004:0297a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復不憂念父母、妻子有無，又復不念卒報父母之德，亦復不念師父之恩。",
        "translation": "They also don't think about the existence or nonexistence of their parents or wives, and they don't think about never repaying the virtue of their parents or the kindness of their teachers.",
        "source": "T12n0361_004:0297a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心常念惡、口常言惡，日不成就。",
        "translation": "His mind is always mindful of evil, and his mouth always speaks evil, which is not accomplished every day.",
        "source": "T12n0361_004:0297a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不信道德、不信有賢明先聖、不信作善為道可得度世、不信世間有佛。",
        "translation": "They don't believe in morality, don't believe in wise sages, don't believe that creating a good path will lead to salvation, and don't believe there's a Buddha in the world.",
        "source": "T12n0361_004:0297a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲殺羅漢、鬪比丘僧，常欲殺人——欲殺父母、兄弟、妻子、宗親、朋友。",
        "translation": "They want to kill arhats, fight monks and priests, and always want to kill people-they want to kill their parents, brothers, wives, relatives, and friends.",
        "source": "T12n0361_004:0297a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母、兄弟、妻子、宗親、朋友憎惡見之，欲使之死。",
        "translation": "They hate their parents, brothers, wives, relatives, and friends, and want to cause them to die.",
        "source": "T12n0361_004:0297a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不信佛經語、不信人壽命終盡死，後世復生、不信作善得善、不信作惡得惡。",
        "translation": "They don't believe the words of the Buddha's sūtras, don't believe that people die at the end of their life and are reborn in a later life, don't believe that doing good obtains good, and don't believe that doing evil obtains evil.",
        "source": "T12n0361_004:0297a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是曹人——男子、女人——心意俱然，違戾反逆，愚癡濛澒，瞋怒嗜欲，無所識知。",
        "translation": "\"Thus, these people - men and women - are all mindful, disobedient, deluded, misguided, and lacking awareness of anger, rage, and desire.",
        "source": "T12n0361_004:0297a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自用快善為大智慧，亦不知所從來、生死所趣向。",
        "translation": "They take pleasure in goodness as great wisdom, but they don't know where it comes from or where birth-and-death is headed.",
        "source": "T12n0361_004:0297a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不肯慈孝，惡逆天地，於其中間求望僥倖，欲得長生、躬得不死。",
        "translation": "They don't want to be kind and filial, and they rebel against heaven and earth, hoping and wishing for luck in the interim, hoping to attain long life and personally attain immortality.",
        "source": "T12n0361_004:0297a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "會當歸就生死勤苦善惡之道，身所作惡，殃咎眾趣，不得度脫。",
        "translation": "They will then return to the path of suffering, pain, good, and evil in birth and death, and the evil they do will bring misfortune to all the destinies and prevent them from being liberated.",
        "source": "T12n0361_004:0297a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦不可降化令作善，慈心教語開導生死、善惡所趣有是，復不信之。",
        "translation": "Nor can they be subjugated to goodness, or they'll teach and guide with kindness to birth-and-death and the destinies of good and evil, but they won't believe it.",
        "source": "T12n0361_004:0297a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然苦心與語欲令度脫，無益其人。",
        "translation": "Still, painful thoughts and words that seek to bring about deliverance won't help them.",
        "source": "T12n0361_004:0297a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心中閉塞，意不開解，大命將至，至時皆悔。",
        "translation": "Their minds are shut off, and their thoughts aren't liberated; when their great life approaches, they all repent.",
        "source": "T12n0361_004:0297a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後乃悔，當復何及？",
        "translation": "What's the point of regretting it later?",
        "source": "T12n0361_004:0297a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不豫計善，臨窮何益？",
        "translation": "If we don't plan for goodness, what good will it do in the face of exhaustion?",
        "source": "T12n0361_004:0297a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天地之間五道分明，恢廓窈窕，浩浩茫茫，轉相承受。",
        "translation": "\"Between heaven and earth, the five paths are clearly delineated, vast and slender, and vast and endless, and they are subject to each other in turn.",
        "source": "T12n0361_004:0297a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡、毒痛，身自當之，無有代者。",
        "translation": "Good and evil, as well as pain and suffering, are self-reported, and there's no substitute for them.",
        "source": "T12n0361_004:0297a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道之自然，隨其所行，追命所生，不得縱捨。",
        "translation": "The path is natural, follows what it does, and follows orders to be born, so it can't be abandoned.",
        "source": "T12n0361_004:0297a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善人行善，從善慈孝、從樂入樂、從明入明；惡人行惡，從苦入苦、從冥入冥。",
        "translation": "When a good person does good, they'll follow goodness, kindness, filial piety, enter happiness from happiness, and enter light from light; when a bad person does evil, they'll enter suffering from suffering and enter darkness from darkness.",
        "source": "T12n0361_004:0297a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能知者？",
        "translation": "Who can know this?",
        "source": "T12n0361_004:0297a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨佛知見耳。",
        "translation": "The Buddha alone has the ear of knowledge and insight.",
        "source": "T12n0361_004:0297a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教語人民，信用者少，生死不休，惡道不絕。",
        "translation": "He teaches the people, but those who believe in it are few, and birth-and-death doesn't end, and the evil path doesn't end.",
        "source": "T12n0361_004:0297b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，世人不可悉道，故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類，展轉其中，世世累劫，無有出期，難得解脫，痛不可言，是為五大惡、五痛、五燒。",
        "translation": "\"Thus, the world can't fully understand the path, so there are naturally nirayas, animals, ferns, and wriggling creatures that go from place to place, age after age, with no possibility of escape, difficult to attain liberation, and painful beyond words, which are the five major evils, five pains, and five burns.",
        "source": "T12n0361_004:0297b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「勤苦如是，比如火起燒人身，人能自於其中一心制意、端身正行、言行相副、所作至誠、所語如語、心口不轉、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為五大善。」",
        "translation": "\"Such is the suffering of striving, like when a fire rises and burns your body, but if someone can control their thoughts with single-mindedness, correct their conduct, match their words and deeds, be sincere in what they do, speak as they speak, not change their mind or speech, do good things alone, and not do evil things, they'll be liberated alone and attain merit, and they'll attain a long life and cross over to the path of nirvāṇa in the heavens, which are the five major good qualities.\"",
        "source": "T12n0361_004:0297b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿逸菩薩等：「我皆語若曹，是世五惡勤苦如是，令起五痛、令起五燒，展轉相生。",
        "translation": "The Buddha told Āyurveda and the others, \"I've told Wakarusa that these are the five worldly evils that are so painful and painful that they cause five pains and five burns, which arise in turn.",
        "source": "T12n0361_004:0297b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間人民不肯為善，欲作眾惡，敢有犯此諸惡事者皆悉自然，當更具歷入惡道中。",
        "translation": "People of the world who refuse to be good and want to do many evils will naturally and surely end up in a bad destiny if they dare to do any of these evils.",
        "source": "T12n0361_004:0297b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或其今世先被病殃，死生不得，示眾見之。",
        "translation": "Perhaps they were sick or ill in the past and weren't allowed to be born in death, and they'll show it to the public.",
        "source": "T12n0361_004:0297b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽終趣入至極大苦，愁痛酷毒，自相焦然，轉相燒滅。",
        "translation": "At the end of their lives, they'll go into the ultimate suffering, sorrow, pain, and suffering, scorching themselves and burning each other up.",
        "source": "T12n0361_004:0297b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至其後共作怨家，更相傷殺，從小微起至大困劇，皆從貪淫財色、不肯忍辱施與、各欲自快、無復有曲直、欲得健名、為癡欲所迫、隨心思想不能得也，結憤胸中。",
        "translation": "From minor beginnings to great hardships, they all start with lust for possessions and form, a refusal to tolerate charity, a desire for self-pleasure, a desire for self-righteousness, a desire to attain a good reputation, and being forced by deluded desires and unable to attain it based on their own thoughts, which build up anger in their chests.",
        "source": "T12n0361_004:0297b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "財色縛束無有解脫、不知厭足；厚己諍欲，無所省錄，都無義理，不隨正道。",
        "translation": "They're bound by possessions and form, have no liberation, and don't know satisfaction; they are full of selfish and contentious desires, have nothing to reflect on, have no principle, and don't follow the right path.",
        "source": "T12n0361_004:0297b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富貴榮華，當時快意，不能忍辱、不知施善，威勢無幾，隨惡名焦。",
        "translation": "Their wealth and prosperity are pleasurable at the time, but they can't tolerate humiliation and don't know how to be kind, and their authority is limited, so they are scorched by a bad reputation.",
        "source": "T12n0361_004:0297b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身坐勞苦，久後大劇自然隨逐，無有解已。",
        "translation": "They sit in physical exertion and suffering, and after a long time, great violence naturally follows them, with no escape.",
        "source": "T12n0361_004:0297b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王法施張，自然糺舉，上下相應；羅網綱紀，煢煢忪忪，當入其中。",
        "translation": "The king's teaching naturally involves raising and lowering, and the net of rules and regulations is a worrying, uncertain thing into which you'll enter.",
        "source": "T12n0361_004:0297b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "古今有是，痛哉，可傷！」",
        "translation": "This has happened in the past and present, and it's painful and sad!\"",
        "source": "T12n0361_004:0297b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿逸菩薩等：「若世有是佛，皆慈愍哀之，威神摧動眾惡諸事皆消化之。",
        "translation": "The Buddha said to Ajita and the other bodhisattvas, \"If there were such buddhas in the world, they'd all be compassionate and sympathetic, and their authority and soul would destroy all the bad things they do and make them tolerable.",
        "source": "T12n0361_004:0297b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令得去惡就善，棄捐所思，奉持經戒，莫不承奉。",
        "translation": "They would cause them to abandon evil and turn to goodness, renounce what they contemplate, and uphold the sūtras and precepts, and none of them would be accepted.",
        "source": "T12n0361_004:0297b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施行經法，不敢違失度世無為泥洹之道，快善極樂，甚明無極。」",
        "translation": "They bestow the teachings of the sūtras, dare not lose sight of the path to the nirvāṇa of world-transcendence and do not lose sight of the ultimate happiness and goodness.\"",
        "source": "T12n0361_004:0297b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若曹諸天、帝王、人民及後世人，得佛經語熟思惟之，能自於其中端心正行。",
        "translation": "The Buddha said, \"Suppose gods, emperors, people, and the generations that follow them were to familiarize themselves with the words of the Buddha's sūtras and contemplate them thoroughly, so that they themselves could correctly conduct themselves with proper concentration.",
        "source": "T12n0361_004:0297c01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其主上為善率化，撿御其下，教語人民，轉相勅令、轉共為善、轉相度脫，各自端守，慈仁愍哀，終身不殆，尊聖敬孝，通洞博愛。",
        "translation": "Their lords lead and guide them well, subdue their subordinates, teach and instruct their people, order them to instruct each other to be good, deliver them from each other, maintain their own dignity, be kind and compassionate, remain true to themselves, honor sages and honor filial piety, and penetrate into widespread love.",
        "source": "T12n0361_004:0297c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語教令無敢虧負，當憂度世泥洹之道；當憂斷截生死、痛痒，拔惡根本；當憂斷絕泥犁、禽獸、薜荔、蜎飛蠕動之類惡苦之道；當勱佛世，堅持經道，無敢失也。」",
        "translation": "They dare not fail to follow the Buddha's instructions, and they must worry about saving the world from the path of nirvāṇa; they must worry about ending birth and death, pain and itching, and the root of evil; they must worry about ending the path of suffering caused by mud, animals, lions, and creatures that fly and wriggle; and they must maintain their upholding of the Buddha's world and adhere to the path of the sutras, not daring to lose it.\"",
        "source": "T12n0361_004:0297c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若曹當作善者，云何第一急？",
        "translation": "The Buddha said, \"If Tso should undertake good deeds, what would be the first priority?",
        "source": "T12n0361_004:0297c10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當自端身、當自端心、當自端目、當自端耳、當自端鼻、當自端口、當自端手、當自端足。",
        "translation": "You must fix your body, fix your mind, fix your eyes, fix your ears, fix your nose, fix your mouth, fix your hands, and fix your feet.",
        "source": "T12n0361_004:0297c11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能自撿斂，莫妄動作，身心淨潔，俱善相應。",
        "translation": "They should control themselves, refrain from false actions, and purify their bodies and minds, all of which are well-associated.",
        "source": "T12n0361_004:0297c13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中外約束，勿隨嗜欲，不犯諸惡。",
        "translation": "They are restrained both inside and out, don't follow their desires, and don't commit any bad acts.",
        "source": "T12n0361_004:0297c14_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言色常和，身行當專，行步坐起不動。",
        "translation": "His speech and expression are always harmonious, and his physical conduct should be focused, so he walks, sits, and rises without moving.",
        "source": "T12n0361_004:0297c14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作事所為當先熟思慮計之，揆度才能、視瞻圓規，安定徐作為之；作事倉卒，不豫熟計，為之不諦，亡其功夫，敗悔在後，唐苦亡身。",
        "translation": "You must first carefully consider what you're doing, deliberate your abilities, examine them in detail, and conduct yourself with stability and care; when you do something hastily and don't plan it carefully, you'll lose your effort, fail and regret later, and end up suffering and losing your body.",
        "source": "T12n0361_004:0297c15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至誠忠信，得道絕去。」",
        "translation": "Being perfectly sincere and faithful, they will attain the path and abandon it.\"",
        "source": "T12n0361_004:0297c18_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若曹於是益作諸善，布恩施德，能不絕道禁，忍辱、精進、一心、智慧，展轉復相教化，作善為德。",
        "translation": "The Buddha said, \"Suppose someone were to skillfully do good deeds, bestow kindness and virtue, and be able to keep from cutting off the path's prohibitions, tolerate, make effort, be unified in mind, and be wise, then they'll continue to teach each other and do good deeds for virtue.",
        "source": "T12n0361_004:0297c19_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是經法慈心專一，齋戒清淨一日一夜者，勝於無量清淨佛國作善百歲。",
        "translation": "Thus, when the sūtras and teachings are focused on loving kindness and the purification of precepts for a day and a night, it's better than working well for a hundred years in measureless pure Buddha lands.",
        "source": "T12n0361_004:0297c21_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0361_004:0297c23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量清淨佛國皆積德眾善，無為自然，在所求索，無有諸惡大如毛髮。」",
        "translation": "Innumerable pure Buddha lands are filled with virtues and goodness, which are effortless and natural, and there are no evils as large as a hair.\"",
        "source": "T12n0361_004:0297c23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「於是作善十日十夜者，其得福勝於他方佛國中人民作善千歲。",
        "translation": "The Buddha said, \"Thus, someone who does good deeds for ten days and nights will attain more merit than the people of a buddha land in another direction who do good deeds for a thousand years.",
        "source": "T12n0361_004:0297c25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0361_004:0297c27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方佛國皆悉作善，作善者多、為惡者少，皆有自然之物，不行求作便自得之；是間為惡者多、為善者少，不行求作不能得也。",
        "translation": "In other places, all buddha lands are filled with people who do good, and there are many who do good and few who do evil; they all have natural things that can be obtained without seeking to do them; in other places, there are many who do evil and few who do good, and they can't obtain them without seeking to do them.",
        "source": "T12n0361_004:0297c27_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人能自端制作善，至心求道，故能爾耳。",
        "translation": "It's because a person can endow himself with goodness and pursue the path with the utmost care that he's able to do so.",
        "source": "T12n0361_004:0298a01_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是間無有自然，不能自給，當行求索，勤苦治生。",
        "translation": "There's nothing natural in this world that can't be given on its own, so you should conduct searches and work hard to govern life.",
        "source": "T12n0361_004:0298a02_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉相欺怠，調作好惡，得其財物歸給妻子。",
        "translation": "They will continue to deceive one another, cultivate goodness and evil, and obtain property to return to their wives.",
        "source": "T12n0361_004:0298a03_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飲苦食毒，勞心苦身，如是至竟，心意不專，周旋不安。",
        "translation": "After drinking pain and eating poison, toiling mentally and physically, and thus reaching the end, their minds aren't focused, and they're restless.",
        "source": "T12n0361_004:0298a04_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人能自安靜為善，精進作德，故能爾耳。」",
        "translation": "It's because a person can be quiet and virtuous on their own and work energetically that they're able to do so.\"",
        "source": "T12n0361_004:0298a05_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我皆哀若曹及諸天、帝王、人民，皆教令作諸善、不為眾惡，隨其所能輒授與道，教戒開導悉奉行之。",
        "translation": "The Buddha said, \"I'm sorry for all of you, gods, emperors, and people, for teaching them to do good and not to do evil, for granting the path as often as they are able, and for teaching and guiding them all to follow the precepts.",
        "source": "T12n0361_004:0298a06_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則君率化為善教令臣下、父教其子、兄教其弟、夫教其婦，室家內外、親屬、朋友轉相教語，作善為道。",
        "translation": "Then, the ruler leads and instructs his subjects to be good, his father to teach his son, his brother to teach his brother, his husband to teach his wife, and he teaches and speaks to his relatives and friends inside and outside the home to cultivate goodness as the path.",
        "source": "T12n0361_004:0298a08_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉經持戒，各自端守，上下相撿，無尊、無卑，無男、無女，齋戒清淨，莫不歡喜。",
        "translation": "They respect the sūtras and observe the precepts, each conducts himself properly, and they are collected from above and below, without honor or inferiority, male or female, and pure in observance of precepts, so that no one is left unhappy.",
        "source": "T12n0361_004:0298a11_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "和順義理，勸樂慈孝，自相約撿。",
        "translation": "They harmonize with right principles, encourage happiness and kindness, and meet each other for pickup.",
        "source": "T12n0361_004:0298a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得佛經語悉持思之，不當所作如犯為之則自悔過，去惡就善，棄邪為正，朝聞夕改，奉持經戒劇，如貧人得寶。",
        "translation": "Those who have access to the words of the Buddha's sūtras will always maintain and consider them, repent of improper actions or infractions, turn away what's bad and return to what's good, discard what's wrong and turn it into what's right, change their ways as soon as they hear them, and adhere to the sūtras and precepts, just as a poor man might obtain a treasure.",
        "source": "T12n0361_004:0298a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛所行處、所在郡國，輒授與經戒，諸天、日月、星辰、諸神、國王、傍臣、長吏、人民、諸龍、鬼神、泥犁、禽獸承奉行之，則君改化為善，齋戒精思，淨自湔洒，端心正行，居位嚴慓，教勅率眾為善，奉行道禁，令言令止；臣事其君，忠直受令，不敢違負。",
        "translation": "\"Where the Buddha travels or where he is in a county, he often confers the sūtras and precepts, and the gods, gods, suns, moons, stars, gods, kings, ministers, governors, people, dragons, ghosts, hells, nirayas, and animals accept and carry them out.",
        "source": "T12n0361_004:0298a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父子言令孝順承受，兄弟、夫婦、宗親、朋友，上下相令，順言和理，尊卑、大小轉相敬事，以禮如義不相違負，莫不改往修來，洒心易行端正中表，自然作善所願輒得。",
        "translation": "When fathers and sons are told to be dutiful and obedient, brothers, couples, clansmen, and friends are ordered up and down, are obedient in speech and principle, are honored and deferred to, are treated with respect and respect by their superiors and juniors, and don't act contrary to each other according to propriety and meaning, don't change their past and cultivate their future, shed their minds and conduct themselves properly and correctly, and readily obtain whatever goodness they desire naturally.",
        "source": "T12n0361_004:0298a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "感善降化自然之道，求欲不死則可得長壽，求欲度世則可得泥洹之道。」",
        "translation": "When they experience goodness and are subdued and transformed by the natural way, they may attain long life if they want to be immortal, and they may attain the path of nirvāṇa if they want to save the world.\"",
        "source": "T12n0361_004:0298a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「佛威神尊重，消惡化善莫不度脫。",
        "translation": "The Buddha said, \"The Buddha's authority and respect make it impossible to escape from the deterioration of goodness.",
        "source": "T12n0361_004:0298a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我出於天下，在是惡中於苦世作佛，慈愍哀傷，教語開道，諸天、帝王、傍臣左右、長吏、人民，隨其心所欲願樂皆令得道。",
        "translation": "Now, I have emerged from the world and become a buddha in this miserable world, being compassionate and sympathetic, teaching and opening the way, so that gods, emperors, ministers, officers, and people will attain the path according to their hearts' desires and wishes.",
        "source": "T12n0361_004:0298a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛諸所行處、所更過歷郡國、縣邑、丘聚、市里，莫不豐熟，天下太平，日月運照，倍益明好；風雨時節，人民安寧；強不凌弱，各得其所。",
        "translation": "The places where the Buddha travels and the places he passes through, such as counties, towns, villages, and cities, are all abundant, the world is peaceful, the sun and moon shine brightly and well, the people are peaceful during times of wind and rain, and the strong don't bully the weak, each getting their due.",
        "source": "T12n0361_004:0298b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無惡歲疾疫、無病瘦者、兵革不起、國無盜賊、無有怨抂、無有拘閉者。",
        "translation": "There are no bad years or epidemics, no sick or thin people, no military battles, no thieves or pirates in the country, no unrighteousness, and no one who is held back.",
        "source": "T12n0361_004:0298b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "君臣、人民莫不歡喜，忠慈至誠，各自端守，皆自然守國，雍和孝順，莫不歡樂。",
        "translation": "Their rulers and ministers, as well as the people, are delighted, loyal, kind, and sincere, and each is properly guarded, naturally guarding the country, harmonious, and filially obedient, and everyone is happy.",
        "source": "T12n0361_004:0298b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有無相與布恩施德，心歡樂與皆相敬愛，推財讓義，謙讓於先。",
        "translation": "They extend kindness and benevolence with and without each other, rejoice in their hearts and adore each other, and give up their possessions for righteousness, being modest and yielding beforehand.",
        "source": "T12n0361_004:0298b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前後以禮敬事，如父、如子，如兄、如弟，莫不仁賢，和順禮節都無違諍，快善無極。」",
        "translation": "They serve each other with respect and dignity, like father and son, like brother and brother, and are always kind and virtuous, conforming with propriety and propriety without conflict, and are quickly and well.\"",
        "source": "T12n0361_004:0298b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我哀子曹欲度脫之，劇父母念子。",
        "translation": "The Buddha said, \"I pity the son and want to liberate him, so I'll play parents mindful of their sons.",
        "source": "T12n0361_004:0298b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今八方上下諸天、帝王、人民及蜎飛蠕動之類，得佛經戒、奉行佛道，皆得明慧，心悉開解，莫不得過度脫憂苦者。",
        "translation": "Now, the gods, goddesses, people, and creeping creatures in the eight directions who have attained the precepts of the Buddha's sūtras and have dedicated themselves to the Buddha's path have all attained insight and mental liberation, and none of them has ever been freed from sorrow and suffering.",
        "source": "T12n0361_004:0298b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我作佛在於五惡、五痛、五燒之中，降化五惡、消盡五痛、絕滅五燒，以善攻惡拔去毒苦，令得五善明好，燒惡不起。",
        "translation": "Now, when I became a buddha, I subdued the five evils, ended the five pains, and extinguished the five burns, attacking evil with goodness and removing the pain and suffering, so that I attained five good and insightful qualities and the burning evil didn't arise.",
        "source": "T12n0361_004:0298b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我般泥洹去後，經道稍稍斷絕，人民諛諂淳為眾惡，不復作善，五燒復起，五痛劇苦——復如前法——自然還復，久後轉劇，不可悉說，我但為若曹小道之耳。」",
        "translation": "When the path of the sutras is slightly cut off after I leave Parinirvāṇa, the people flatter themselves and become numerous evils; they don't do good anymore; the five burns return; the five pains and severe suffering - which are the same as the previous teaching - naturally return; and they become severe after a long time, which cannot be explained in detail; I'm only for the ears of Wakṣa's lesser path.\"",
        "source": "T12n0361_004:0298b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿逸菩薩等：「若曹各思持之，展轉相教戒，如佛經法無敢犯也。」",
        "translation": "The Buddha told Ājñāta-bodhisattva and the others, \"Suppose each of them considers upholding and teaching the precepts in turn, just as the Buddha's sūtras and dharmas do, and they don't dare to violate them.\"",
        "source": "T12n0361_004:0298b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸菩薩長跪叉手言：「佛所說甚苦痛，世人為惡甚劇，如是如是。",
        "translation": "Ayi Bodhisattva knelt down and saluted with his palms together, saying, \"What the Buddha has taught is very painful, and the evils of the world are very serious, such as this and that.",
        "source": "T12n0361_004:0298b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛皆慈哀悉度脫之，皆言：『受佛重教，請展轉相承。』",
        "translation": "The Buddha has compassionately delivered them all, saying, 'Accept the Buddha's important teaching and please continue to carry it forward.",
        "source": "T12n0361_004:0298b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不敢犯也。」",
        "translation": "They wouldn't dare to violate it.\"",
        "source": "T12n0361_004:0298b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「我哀若曹，令悉見無量清淨佛及諸菩薩、阿羅漢所居國土。",
        "translation": "The Buddha told Ānanda, \"I sympathize with Rājagṛha and will allow them all to see the measureless pure buddhas and the lands where the bodhisattvas and arhats live.",
        "source": "T12n0361_004:0298b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲見之不？」",
        "translation": "Do you want to see them?\"",
        "source": "T12n0361_004:0298b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難則大喜，長跪叉手言：「願皆欲見之。」",
        "translation": "Ānanda, however, was overjoyed and knelt down with his palms together, saying, \"May I wish to see them all.\"",
        "source": "T12n0361_004:0298b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若起更被袈裟西向拜——當日沒處——為無量清淨佛作禮，以頭面著地言：『南無無量清淨平等覺。』」",
        "translation": "The Buddha said, \"Suppose he rises and puts on his robe and bows to the west - there's no place for him that day - and salutes the Buddha of Immeasurable Purity, puts his head to the ground, and says, 'Nanfang, the perfectly pure and equally enlightened one of Immeasurable Purity.'\"",
        "source": "T12n0361_004:0298b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「諾，受教。」",
        "translation": "Ānanda said, \"Promise, accept the teaching.\"",
        "source": "T12n0361_004:0298c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則起更被袈裟西向拜——當日所沒處——為無量清淨佛作禮，以頭腦著地言：「南無無量清淨平等覺。」",
        "translation": "He then rose, put on his robe, bowed to the Buddha of Immeasurable Pureness in a westerly direction where he had been absent that day, paid homage to him, put his head to the ground, and said, \"Nam gyeong gyeong gyeong kak.\"",
        "source": "T12n0361_004:0298c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難未起，無量清淨佛便大放光明威神，則遍八方上下諸無央數佛國，天地則皆為大震動。",
        "translation": "Before Ānanda got up, the Buddha of Immeasurable Pureness then radiated a great radiance and authority that reached up and down to measureless buddha lands in the eight directions, and heaven and earth were both greatly shaken.",
        "source": "T12n0361_004:0298c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天無央數天地、須彌山羅寶、摩訶須彌大山羅寶、諸天地大界、小界，其中諸有大泥犁、小泥犁，諸山林、溪谷、幽冥之處，皆則大明，悉雨大開闢。",
        "translation": "The heavens, incalculable heavens and earth, Sumeru's mountains and valleys, the great Sumeru mountains and valleys, the large and small realms of heaven and earth, the large and small mud plows in them, and the mountains, forests, streams, and dark places all become greatly illuminated and are all greatly opened up by rain.",
        "source": "T12n0361_004:0298c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則阿難、諸菩薩、阿羅漢等，諸天、帝王、人民，悉皆見無量清淨佛及諸菩薩、阿羅漢、國土七寶已，心皆大歡喜踊躍，悉起為無量清淨佛作禮，以頭腦著地，皆言：「南無無量清淨三藐三佛陀。」",
        "translation": "Then Ānanda, the bodhisattvas and arhats, the gods, emperors, and people all saw the Buddha of Immeasurable Clarity, the bodhisattvas and arhats, and the seven treasures of the land, rejoiced and jumped for joy, rose up to pay homage to the Buddha of Immeasurable Clarity, and, with their heads on the ground, said, \"Namasarga bañjana samyak-saṃbuddha.\"",
        "source": "T12n0361_004:0298c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量清淨佛放光明威神已，諸無央數天、人民、及蜎飛蠕動之類，皆悉見無量清淨佛光明，莫不慈心歡喜作善者。",
        "translation": "After the Buddha of Immeasurable Purity radiated his radiant power, measureless gods, people, and wriggling creatures all saw the Buddha of Immeasurable Purity's radiant power, and none of them were compassionate and joyous in their hearts, rejoicing in the goodness of others.",
        "source": "T12n0361_004:0298c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有泥犁、禽獸、薜荔，諸有考治勤苦之處，則皆休止不復治，莫不解脫憂苦者。",
        "translation": "Where there are nirayas, animals, and lions, and where there's hard work and suffering, they all stop and don't treat it again, and none of them are freed from sorrow and suffering.",
        "source": "T12n0361_004:0298c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有盲者則皆得視，諸跛躄蹇者則皆得走行，諸病者則皆愈起，諸尫者則皆強健；愚癡者則皆更黠慧，諸有婬泆瞋怒者皆悉慈心作善，諸有被毒者毒皆不行。",
        "translation": "All the blind will be able to see, the lame and handicapped will be able to walk, the sick will heal, the weak will become strong, the foolish will become wise, the lustful and angry will all be kind and work for good, and the poisoned will not be used.",
        "source": "T12n0361_004:0298c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鍾鼓、琴瑟、箜篌、樂器諸伎，不鼓皆自作音聲；婦女珠環皆自作聲；百鳥、畜獸皆自悲鳴。",
        "translation": "The bells and drums, lutes, harps, and musical instruments all make their own sounds without drums, the women's jewelry and rings all make their own sounds, and a hundred birds and animals all cry out in pity.",
        "source": "T12n0361_004:0298c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當是之時莫不歡喜得過度者。",
        "translation": "At that point, no one is unhappy and overjoyed.",
        "source": "T12n0361_004:0298c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則時爾日，諸佛國中諸天人，莫不持天上華香來下於虛空中，悉皆供養，散諸佛及無量清淨佛上。",
        "translation": "On that day, the gods and goddesses of the buddha lands all descended into the sky with flowers and incense from heaven, offering them all up as offerings to the buddhas and measureless pure buddhas.",
        "source": "T12n0361_004:0298c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天各共大作萬種自然伎樂，樂諸佛及諸菩薩、阿羅漢。",
        "translation": "Together, the gods each create a myriad of natural music to delight the buddhas and the bodhisattvas and arhats.",
        "source": "T12n0361_004:0298c27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當是之時，甚快樂不可言。",
        "translation": "At the time, it was a great joy unspeakable.",
        "source": "T12n0361_004:0298c29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難、阿逸菩薩等：「我說無量清淨佛及諸菩薩、阿羅漢、國土自然七寶，當無有異乎？」",
        "translation": "The Buddha told Ānanda and Ārya, the bodhisattvas, and others, \"Would there be nothing different about my saying that there are measureless pure buddhas, bodhisattvas, arhats, and the natural seven treasures of the land?\"",
        "source": "T12n0361_004:0299a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難長跪叉手言：「佛說無量清淨佛國土快善，如佛所說無有一異。」",
        "translation": "Ānanda knelt down and saluted with his palms together, saying, \"The Buddha teaches that the measureless pure buddha lands are fast and good, just as he teaches them, without any difference.\"",
        "source": "T12n0361_004:0299a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我說無量清淨佛功德國土快善，晝夜一劫尚復未竟，我但為若曹小說之耳。」",
        "translation": "The Buddha said, \"I've described the pleasant goodness of measureless pure buddha-lands of merit for an eon in a day and night that's yet to be completed, but I've only described it for Rājagṛha.\"",
        "source": "T12n0361_004:0299a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸菩薩則長跪叉手問佛言：「今佛國從是間當有幾阿惟越致菩薩往生無量清淨佛國？",
        "translation": "Ayi then asked the Buddha, kneeling down with his palms together, \"How many nonretrogressing bodhisattvas will be born in this Buddha-land of immeasurable purity?",
        "source": "T12n0361_004:0299a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願聞之。」",
        "translation": "May I hear about it.\"",
        "source": "T12n0361_004:0299a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若欲知者，明聽著心中。」",
        "translation": "The Buddha said, \"If you want to know, clearly listen and attach your mind.\"",
        "source": "T12n0361_004:0299a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸菩薩言：「受教。」",
        "translation": "Ayi said, \"Accept the teaching.\"",
        "source": "T12n0361_004:0299a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從我國當有七百二十億阿惟越致菩薩皆往生無量清淨佛國——一阿惟越致菩薩者，前後供養無央數諸佛，以次如彌勒皆當作佛——及其餘諸小菩薩輩者無央數不可復計，皆當往生無量清淨佛國。」",
        "translation": "The Buddha said, \"From my country, 72 billion nonretrogressing bodhisattvas will be reborn in measureless pure buddha lands-one nonretrogressing bodhisattva who has made offerings to measureless buddhas before and after him, followed by others like Maitreya, who will all become buddhas-and the rest of the small group of bodhisattvas, whose number is incalculable, will all be reborn in measureless pure buddha lands.\"",
        "source": "T12n0361_004:0299a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿逸菩薩：「不但我國中諸菩薩當往生無量清淨佛國，他方異國復有佛亦復如是。",
        "translation": "The Buddha told Āyurveda, \"Not only will the bodhisattvas in my country be reborn in measureless pure buddha lands, but there are buddhas in foreign lands elsewhere who will do the same.",
        "source": "T12n0361_004:0299a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一佛名光遠炤，其國有百八十億菩薩皆當往生無量清淨佛國。",
        "translation": "The first Buddha's name is Guang Yuanzhao, and there are 18 billion bodhisattvas in that country who will all go on to be born in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第二佛，佛名寶積，其國有九十億菩薩皆當往生無量清淨佛國。",
        "translation": "The second Buddha of a foreign land elsewhere is called Baoding, and 9 billion bodhisattvas in that land will be reborn in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第三佛，名儒無垢，有二百二十億菩薩皆當往生阿彌陀佛國。",
        "translation": "The third Buddha of a foreign land elsewhere, whose name is Ruwugong, has 22 billion bodhisattvas who will all be reborn in the land of Amitâbha Buddha.",
        "source": "T12n0361_004:0299a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第四佛，名無極光明，其國有二百五十億菩薩皆當往生無量清淨佛國。",
        "translation": "The fourth Buddha of a foreign land elsewhere, whose name is Inexhaustible Light, is a land where 25 billion bodhisattvas will be reborn in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第五佛，名於世無上，其國有六百億菩薩皆當往生無量清淨佛國。",
        "translation": "The fifth Buddha of a foreign land elsewhere is called the unsurpassed in the world, and 60 billion bodhisattvas in that land will be reborn in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第六佛，名勇光，其國有萬四千菩薩皆當往生無量清淨佛國。",
        "translation": "The sixth Buddha of a foreign land elsewhere is named Brave Light, and there are 10,000 to 4,000 bodhisattvas in that land who will be reborn in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第七佛，名具足交絡，其國有十四億菩薩皆當往生無量清淨佛國。",
        "translation": "The seventh Buddha of a foreign land elsewhere is called Completely Interlaced, and 1.4 billion bodhisattvas from that land will be reborn in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第八佛，名雄慧王，其國有八菩薩皆當往生無量清淨佛國。",
        "translation": "The eighth Buddha of a foreign land elsewhere is called Śubhavyūha, and eight bodhisattvas from that land will all be reborn in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第九佛，名多力無過者，其國有八百一十億菩薩皆當往生無量清淨佛國。",
        "translation": "The ninth Buddha of a foreign land elsewhere is called the Many Powerful and Incomparable One, and 810 billion bodhisattvas in his land will all be reborn in a limitless number of pure Buddha-lands.",
        "source": "T12n0361_004:0299b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第十佛，名吉良，其國有萬億菩薩皆當往生無量清淨佛國。",
        "translation": "The tenth Buddha of a foreign land elsewhere, named Kira, has a million million bodhisattvas in his land who will all be reborn in a limitless number of pure buddha lands.",
        "source": "T12n0361_004:0299b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第十一佛，名慧辯，其國有萬二千菩薩皆當往生無量清淨佛國。",
        "translation": "The eleventh Buddha of a foreign land elsewhere, named Huifan, has 10,000,000 bodhisattvas in his land who will all go on to be born in a limitless number of pure Buddha-lands.",
        "source": "T12n0361_004:0299b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第十二佛，名無上華，其國有諸菩薩無央數不可復計——皆阿惟越致、皆智慧勇猛、各供養無央數諸佛，以一時俱心願欲往生——皆當生無量清淨佛國。",
        "translation": "The twelfth Buddha of a foreign land elsewhere is called the peerless flower, and there are an incalculable number of bodhisattvas in that land-all abhidharma, all wise and courageous, each making offerings to an incalculable number of buddhas, each wishing with a single mind to be reborn-who will be born in an infinite number of pure buddha lands.",
        "source": "T12n0361_004:0299b06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方異國第十三佛，名樂大妙音，其國有七百九十億菩薩皆當往生無量清淨佛國。」",
        "translation": "The thirteenth Buddha of a foreign land named Prabhūtaratna is a country with 79 billion bodhisattvas who will all be reborn in a limitless number of pure buddha lands.\"",
        "source": "T12n0361_004:0299b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是諸菩薩——皆阿惟越致——諸比丘僧中及小菩薩輩無央數，皆當往生無量清淨佛國。",
        "translation": "The Buddha said, \"These bodhisattvas-all abhishekas, monks, and junior bodhisattvas of incalculable number-will be reborn in measureless pure buddha lands.",
        "source": "T12n0361_004:0299b12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不獨是十四佛國中諸菩薩當往生也，都八方上下無央數佛國諸菩薩輩各各如是，皆當往生無量清淨佛國。",
        "translation": "Not only will the bodhisattvas in these 14 Buddha-lands be reborn, but so will the bodhisattva communities in measureless Buddha-lands in the eight directions and up and down, each of them will be reborn in measureless pure Buddha-lands.",
        "source": "T12n0361_004:0299b14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其無央數都共往會，無量清淨佛國大眾多不可復計，我但說八方上下無央數佛名字，晝夜一劫尚未竟。",
        "translation": "There are an incalculable number of them all going together, and there are an incalculably large number of pure Buddha-lands, so I'll just say the names of an incalculably large number of buddhas up and down in eight directions, which is not finished for an eon in the day and night.",
        "source": "T12n0361_004:0299b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我但復說佛國諸比丘僧眾、菩薩當往生無量清淨佛國人數，說之一劫不休止尚未竟。",
        "translation": "I've only explained the number of monks, nuns, and bodhisattvas in that Buddha country who will go forth to be born in measureless pure Buddha lands, and I've explained that it's an eon without respite that hasn't ended.",
        "source": "T12n0361_004:0299b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我但為若曹總攬都小說之耳。」",
        "translation": "I've only explained it in small detail for Wakarusa's general overview.\"",
        "source": "T12n0361_004:0299b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難阿逸菩薩等：「其世間帝王、人民、善男子、善女人，前世宿命行善所致相祿，迺當聞無量清淨佛聲，慈心歡喜，我代之喜。」",
        "translation": "The Buddha said to Ānanda, Ayi, and the other bodhisattvas, \"Emperors, people, good men, and good women of the world who in previous lifetimes performed good deeds and received comparative rewards will hear the sound of measureless pure buddhas and rejoice with kindness, and I will rejoice on their behalf.\"",
        "source": "T12n0361_004:0299b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其有善男子、善女人聞無量清淨佛聲，慈心歡喜，一時踊躍，心意清淨，衣毛為起拔出者，皆前世宿命作佛道——若他方佛故，菩薩、非凡人。",
        "translation": "The Buddha said, \"Suppose there are good men and good women who hear the sound of measureless pure buddhas, rejoice with kindness, jump with joy and clarity of mind, and pull out the hairs on their clothing, for they were all destined in a previous life to achieve the buddha path-if it were a buddha from another place, a bodhisattva, or an extraordinary person.",
        "source": "T12n0361_004:0299b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有人民——男子、女人——聞無量清淨佛聲，不信有佛者、不信佛經語、不信有比丘僧、心中狐疑都無所信者，皆故從惡道中來，生愚蒙不解宿命，殃惡未盡、未當得度脫，故心中狐疑不信向耳。」",
        "translation": "Those people - men and women - who hear the measureless pure sounds of the Buddha but don't believe in the Buddha, don't believe in the words of the Buddha's sūtras, don't believe in the existence of monks, and have doubts in their minds about their lack of faith have all come from bad destinies, been born in ignorance and don't understand past lives, and have yet to end the evils and attain deliverance, so they have doubts in their minds and don't believe in the way they're headed.\"",
        "source": "T12n0361_004:0299b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我語若曹，若曹所當作善法皆當奉行信之。",
        "translation": "The Buddha said, \"I've told Rājagṛha that whatever good qualities Rājagṛha has created, he'll consecrate and believe in them.",
        "source": "T12n0361_004:0299c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無得以我般泥洹去後故，若曹及後世人無得復言：『我不信有無量清淨佛國。』",
        "translation": "It's not possible for Wakarus and the generations to come to say, 'I don't believe there's an infinite number of pure Buddha-lands after I leave parinirvāṇa.'",
        "source": "T12n0361_004:0299c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我故令若曹悉見無量清淨佛國土，所當為者若自求之。",
        "translation": "I therefore want Cao to see all of the measureless pure Buddha-lands, and I will seek them out for myself.",
        "source": "T12n0361_004:0299c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我具為汝曹道說經戒順法，若曹當如佛法持之，無得毀失。",
        "translation": "I have explained the sūtras, precepts, and secondary principles for you, and you will maintain them according to the Buddha's teaching, without loss or disagreement.",
        "source": "T12n0361_004:0299c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我持是經以累汝曹，汝曹當堅持之，無得為妄增減是經法。",
        "translation": "\"I'll hold this sūtra to burden you with its teachings, and you will hold to it, not allowing yourself to falsely add or subtract from the teachings of this sūtra.",
        "source": "T12n0361_004:0299c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我般泥洹去後，經道留止千歲，千歲後經道斷絕，在心所願皆可得道。」",
        "translation": "After I depart from parinirvāṇa, the path of the sūtras will remain for a thousand years, and after a thousand years the path of the sūtras will be cut off, and whatever you wish in your mind will attain the path.\"",
        "source": "T12n0361_004:0299c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「師開導人耳目，智慧明達，度脫人令得善，舍泥洹之道。",
        "translation": "The Buddha said, \"A teacher guides people's ears and eyes, penetrates their wisdom, liberates people and makes them attain goodness, and abandons the path of nirvāṇa.",
        "source": "T12n0361_004:0299c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常當慈孝，於佛如父母；常念師恩，當念不斷絕，則得道疾。」",
        "translation": "Always be kind and filial, treating the Buddha like a father and mother; always remember the kindness of your teacher, and when that mindfulness doesn't stop, you'll quickly attain the path.\"",
        "source": "T12n0361_004:0299c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「天下有佛者甚難得值，人有信受師法經語深者亦難得值，若有沙門、若師為人說佛經者甚難得值。」",
        "translation": "The Buddha said, \"It's very difficult for people under heaven to attain worthiness when there's a Buddha, and it's also difficult for people to attain worthiness when they believe and accept the profundity of the teacher's teaching and the words of the sūtras, and it's very difficult for people to attain worthiness when there are ascetics or masters who teach the Buddha's sūtras for them.\"",
        "source": "T12n0361_004:0299c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是經時，則萬二千億諸天人民皆得天眼徹視，悉一心皆為菩薩道；則二百二十億諸天人民皆得阿那含道；則八百沙門皆得阿羅漢道；則四十億菩薩皆得阿惟越致。",
        "translation": "When the Buddha spoke this sūtra, then 1,200 billion people in the heavens all attained the divine eye that sees deeply, and all were unified in their minds for the bodhisattva path; 22 billion people in the heavens all attained the nonreturner path; 800 ascetics all attained the arhat path; and 4 billion bodhisattvas all attained the abhidharma path.",
        "source": "T12n0361_004:0299c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經已，諸菩薩、阿羅漢、諸天、帝王、人民皆大歡喜，前趣為佛作禮，遶佛三匝，以頭面著佛足而去。",
        "translation": "After the Buddha spoke the sūtra, the bodhisattvas, arhats, gods, emperors, and people rejoiced greatly as they went forward to pay homage to the Buddha, circled him three times, put their heads and faces on his feet, and departed.",
        "source": "T12n0361_004:0299c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說無量清淨平等覺經卷第四",
        "translation": "Sutra of Immeasurable Pure and Equal Enlightenment, Volume 4",
        "source": "T12n0361_004:0299c26_0",
        "is_bad_quality": false
    }
]