[
    {
        "source_sentence": "佛說大乘無量壽莊嚴經卷下",
        "translation": "Foshuo dasheng wuliangshou zhuangyan jing, vol. 2",
        "source": "T12n0363_003:0323c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試光祿卿",
        "translation": "Tripiṭaka of the Western Translation of the Sutra, Chaozan Dashi, and Guangluqing",
        "source": "T12n0363_003:0323c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao dashi ministers, Faxian, in accordance with the imperial edict, translated",
        "source": "T12n0363_003:0323c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0323c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方恒河沙數佛剎，一一剎中，有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。",
        "translation": "In each of the Ganges River Sands Buddha-temples in the east, there are measureless and countless bodhisattvas, mahāsattvas, and measureless and countless crowds of śrāvakas who maintain and make offerings with flowers, banners, streamers, and jeweled canopies to the Buddha of Immeasurable Life of the Blissful World.",
        "source": "T12n0363_003:0323c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南方恒河沙數佛剎，一一剎中，亦有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。",
        "translation": "In each of the Ganges River Sands buddha-houses in the south, there are also measureless and countless bodhisattvas, mahāsattvas, and measureless and countless crowds of śrāvakas who offer their support and offerings to the Buddha of Limitless Life of the Blissful World with fragrant flowers, banners, streamers, and jeweled canopies.",
        "source": "T12n0363_003:0323c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西方恒河沙數世界，一一佛剎，亦有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。",
        "translation": "In each of the buddha-temples of the Ganges River Sands World in the west, there are also measureless and countless bodhisattvas, mahāsattvas, and measureless and countless crowds of śrāvakas who offer their support and offerings to the Buddha of Limitless Life of the Blissful World with fragrant flowers, banners, streamers, and jeweled canopies.",
        "source": "T12n0363_003:0323c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方恒河沙數佛剎，一一佛剎，亦有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。",
        "translation": "In each of the buddha-temples of the northern Ganges River Sands, there are also measureless and countless bodhisattvas, mahāsattvas, and measureless and countless crowds of śrāvakas who offer their support and offerings to the Buddha of Immeasurable Life of the Blissful World with fragrant flowers, banners, streamers, and jeweled canopies.",
        "source": "T12n0363_003:0323c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四維、上、下亦復如是，各禮佛足，稱讚佛土功德莊嚴。」",
        "translation": "Similarly, the four intermediate, superior, and inferior levels each bowed their heads at the Buddha's feet and praised the merits and adornment of the Buddha's land.\"",
        "source": "T12n0363_003:0323c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說頌曰：「東方世界恒河沙，　　一一剎中無數量，　菩薩聲聞發勝心，　　各以香花寶蓋等，　持至莊嚴佛剎中，　　供養如來無量壽；　供已禮足而稱讚，　　最上希有大福田。",
        "translation": "It was then that the Bhagavān spoke a verse, \"There are numberless buddhas in the eastern world that are like the Ganges River, and in each moment there are bodhisattvas and śrāvakas who have aroused the determination to bring fragrant flowers, precious lids, and the like to the adorned Buddha's buddha and make offerings to the Tathāgata's immeasurable life; after making their offerings, they bow their feet and praise him as the supreme, rare, and great field of merit.",
        "source": "T12n0363_003:0323c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是西、南及北方，　　四維、上、下恒沙界，　聲聞、菩薩數亦然；　　皆以香花伸供養。",
        "translation": "Thus, to the west, south, and north, in the four dimensions, above, and below the sands, the same goes for the śrāvakas and bodhisattvas, who each extend offerings with flowers and incense.",
        "source": "T12n0363_003:0324a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　禮足旋繞懷敬愛，　　復讚如來宿願深，　積集功德普莊嚴，　　無量無邊極樂國；　諸佛國界雖嚴飾，　　難比如來寶剎中。",
        "translation": "They bow their feet, circle their arms, and venerate the Tathāgata, praising him for the depth of his long vows, the accumulation of merit and universal adornment, the measureless and limitless Land of Ultimate Bliss, and the adornment of all the buddha-realms, but it's difficult to imagine the jeweled blazes of the Tathāgata.",
        "source": "T12n0363_003:0324a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復以天花供養佛，　　花散虛空為傘蓋，　縱廣量等百由旬，　　色相莊嚴無有比；　遍覆如來寶剎中，　　互相慶慰生歡喜。",
        "translation": "Again, he offered an offering of flowers to the Buddha, scattering them across the sky as an umbrella, even though their size is measured in hundreds of leagues, and their appearance is unsurpassed; they covered the Tathāgata's jeweled bases, comforting each other and making them rejoice.",
        "source": "T12n0363_003:0324a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　曾於過去百千劫，　　積集無量眾善根；　捨彼輪迴三有身，　　今至解脫清淨剎。",
        "translation": "They have accumulated measureless good roots over hundreds of thousands of eons in the past, abandoned the three bodies of transmigration, and now they've arrived at the pure blaze of liberation.",
        "source": "T12n0363_003:0324a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時彼佛無量壽，　　化導他方菩薩心，　密用神通化大光，　　其光從彼面門出，　三十六億那由他，　　普照俱胝千佛剎，　如是人、天普照已，　　即入如來頂髻中。",
        "translation": "At the time, that Buddha of measureless life, who guides the minds of bodhisattvas in other directions, secretly uses his superknowledge to create a great radiance, and that radiance emanates from his facial approach, shining out over 36 billion nayutas and illuminating a thousand buddha-blocs in their corpuscles. After this universal illumination of humans and gods, he then enters the Tathāgata's topknot.",
        "source": "T12n0363_003:0324a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時會一切諸眾生，　　敬歎佛光未曾有，　各各俱發菩提心，　　願出塵勞登彼岸。」",
        "translation": "All the sentient beings in the assembly then praised the Buddha's unprecedented radiance, each arouse the mind of enlightenment, and vow to escape the world's toil and reach the other shore.\"",
        "source": "T12n0363_003:0324a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，會中有觀自在菩薩，即從座起合掌向佛，而作是言：「世尊！",
        "translation": "After the Bhagavān spoke this verse, a bodhisattva in the assembly who was observing Zizai got up from his seat, put his palms together, and addressed the Buddha, saying, \"Bhagavān!",
        "source": "T12n0363_003:0324a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣，無量壽佛於其面門，放無量光照諸佛剎？",
        "translation": "For what reason does the Buddha of Immeasurable Life emit an infinite amount of light from his face to shine on the buddha bases?",
        "source": "T12n0363_003:0324a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊方便解說，令諸眾生及他方菩薩，聞是語已生希有心，於佛菩提志樂趣求入不退位。」",
        "translation": "Please let the Bhagavān explain this in a way that will cause sentient beings and bodhisattvas from other directions who hear these words to give rise to a wish to enter the stage of nonretrogression with joy in the Buddha's aspiration for enlightenment.\"",
        "source": "T12n0363_003:0324a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告觀自在菩薩言：「汝今諦聽！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva of Spontaneous Contemplation, \"Now listen closely!",
        "source": "T12n0363_003:0324a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾為汝說。",
        "translation": "I'll explain it for you.",
        "source": "T12n0363_003:0324a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛如來，於過去無量無邊阿僧祇劫前，為菩薩時發大誓言：『我於未來成正覺時，若有十方世界無量眾生，聞我名號，或頂禮憶念、或稱讚歸依、或香花供養等。",
        "translation": "That Tathāgata Buddha, when he was a bodhisattva measureless and infinite incalculably long eons ago, made a great vow, 'When I become perfectly enlightened in the future, if measureless sentient beings in the world in the ten directions hear my name, either pay homage to me and remember me, praise and rely on me, or offer flowers and offer support, then they will quickly be born in my blazing blaze and become liberated.",
        "source": "T12n0363_003:0324a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生速生我剎，見此光明即得解脫。",
        "translation": "Such sentient beings will quickly be born in my blazing banner and will then attain liberation when they see this light.",
        "source": "T12n0363_003:0324a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩見此光明，即得受記證不退位，手持香花及諸供具，往十方界無邊淨剎，供養諸佛而作佛事增益功德，經須臾間復還本土受諸快樂，是故光明而入佛頂。』",
        "translation": "If bodhisattvas see this light, they'll be memorized and realize the stage of nonretrogression, carry fragrant flowers and other offerings, go to the limitless pure temples of the ten directions, make offerings to the buddhas, perform Buddha-works and enhance merit, and return to their homeland after a moment's time to experience the pleasures that result from this light, and enter the Buddha's peak.'",
        "source": "T12n0363_003:0324a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0324b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量壽佛、應、正等覺，所有菩提之樹，高一千六百由旬，四布枝葉八百由旬，根入土際五百由旬，花菓敷榮，作無量百千珍寶之色。",
        "translation": "\"The tree of enlightenment owned by the Buddha of Limitless Life, the Worthy One, and the Perfectly Enlightened One is 1,600 leagues high, has four branches and leaves that spread out over 800 leagues, and its roots enter the earth for 500 leagues, where flowers and fruits bloom in the colors of measureless hundreds of thousands of treasures.",
        "source": "T12n0363_003:0324b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其樹上，復以月光摩尼寶、帝釋摩尼寶、如意摩尼寶、持海摩尼寶、大綠寶、莎悉帝迦寶、愛寶瓔珞、大綠寶瓔珞、紅真珠瓔珞、青真珠瓔珞、及金銀寶網等種種莊嚴。",
        "translation": "On top of that tree, it's adorned with moon-bright maṇi-jewel, Tissa maṇi-jewel, wish-granting maṇi-jewel, ocean-supporting maṇi-jewel, great green jewels, svastika jewels, jewels of love, great green jewels, red genuine jewels, blue genuine jewels, and nets of gold and silver jewelry.",
        "source": "T12n0363_003:0324b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0324b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每於辰時香風自起吹此寶樹，樹相揨觸出微妙音，其聲普聞無量世界。",
        "translation": "Whenever an incense breeze arises on its own at an auspicious time and blows this precious tree, the tree's characteristics and its potential to touch give rise to a subtle sound that's heard throughout measureless worlds.",
        "source": "T12n0363_003:0324b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生聞者無其耳病，乃至成就阿耨多羅三藐三菩提。",
        "translation": "When sentient beings hear it, they don't suffer from ear problems, and they accomplish unsurpassed, correct enlightenment.",
        "source": "T12n0363_003:0324b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生見此樹者，乃至成佛，於其中間不生眼病。",
        "translation": "If sentient beings see this tree, they'll attain Buddhahood and not suffer from eye problems in its midst.",
        "source": "T12n0363_003:0324b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生聞樹香者，乃至成佛，於其中間不生鼻病。",
        "translation": "If sentient beings hear the tree's fragrance, they'll become buddhas and not suffer from nasal problems in their midst.",
        "source": "T12n0363_003:0324b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生食樹菓者，乃至成佛，於其中間舌亦無病。",
        "translation": "If there are sentient beings who eat fruit from the tree, so they become buddhas, and there's no disease of the tongue in their midst.",
        "source": "T12n0363_003:0324b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生樹光照者，乃至成佛，於其中間身亦無病。",
        "translation": "If a sentient being is illuminated by the light of a tree, it will become a buddha, and there will be no illness in their body.",
        "source": "T12n0363_003:0324b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生觀想樹者，乃至成佛，於其中間心得清淨，遠離貪等煩惱之病。」",
        "translation": "If there are sentient beings who contemplate the tree ... and become buddhas, their minds will be purified in the interim, and they'll be free of such afflictive illnesses as craving.\"",
        "source": "T12n0363_003:0324b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「如是佛剎花菓樹木，與諸眾生而作佛事，皆是彼佛過去大願之所攝受。",
        "translation": "The Buddha told Ānanda, \"Such buddha bases with flowers, fruits, and trees that perform buddha-works for sentient beings are all the result of that Buddha's great vow in the past.",
        "source": "T12n0363_003:0324b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0324b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛剎中所有現在及未來生一切菩薩摩訶薩，一生令得阿耨多羅三藐三菩提。",
        "translation": "\"All the bodhisattvas and mahāsattvas in those buddha bases who are born now and in the future will attain unsurpassed, correct, and complete enlightenment in their lifetime.",
        "source": "T12n0363_003:0324b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩，以宿願故入生死界作師子吼利益有情，我令隨意而作佛事。",
        "translation": "If there are bodhisattvas who enter the realm of birth-and-death as lion's roar for the benefit of sentient beings because of a past vow, I'll allow them to perform Buddha-works as they wish.",
        "source": "T12n0363_003:0324b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0324b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛剎中，一切菩薩及諸聲聞，身相端嚴圓光熾盛，周迴照耀百千由旬。",
        "translation": "In those buddha bases, all the bodhisattvas and śrāvakas have a body that's so dignified and perfectly radiant that it shines around for a hundred thousand leagues.",
        "source": "T12n0363_003:0324b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二菩薩，身光遠照三千大千世界。」",
        "translation": "There are two bodhisattvas whose bodies shine far and wide across 3,000 great one-thousand worlds.\"",
        "source": "T12n0363_003:0324c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白言：「此二菩薩有大身光，其名云何？」",
        "translation": "Ānanda said, \"What's the name of these two bodhisattvas who have a great body radiance?\"",
        "source": "T12n0363_003:0324c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「二菩薩者：一名、觀自在。",
        "translation": "The Buddha told Ānanda, \"The two bodhisattvas are, first, Avalokitêśvara.",
        "source": "T12n0363_003:0324c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二名、大精進。",
        "translation": "The second is called great zeal.",
        "source": "T12n0363_003:0324c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現居此界作大利樂，命終之後當生彼國。",
        "translation": "They now live in this realm and create great joy, and when their lives end, they'll be born in that country.",
        "source": "T12n0363_003:0324c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0324c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛剎中一切菩薩，容貌柔和相好具足，禪定、智慧通達無礙，神通威德無不圓滿。",
        "translation": "\"All the bodhisattvas in those buddha bases are endowed with gentle features and good looks, unimpeded penetration of meditation and wisdom, and unimpeded completion of the powers and authority of their spiritual abilities.",
        "source": "T12n0363_003:0324c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深入法門得無生忍，諸佛祕藏究竟明了。",
        "translation": "They deeply enter the Dharma teaching and attain the patient acceptance of nonarising, and they thoroughly understand the secrets of the buddhas.",
        "source": "T12n0363_003:0324c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "調伏諸根身心柔軟，安住寂靜大乘涅盤。",
        "translation": "He tames his senses and makes his body and mind flexible, and he abides in the tranquil great vehicle nirvāṇa.",
        "source": "T12n0363_003:0324c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深入正慧無復餘習，依佛所行七覺聖道。",
        "translation": "He deeply enters right wisdom with no further accumulation, relying on the Buddha's practice of the seven noble paths of awakening.",
        "source": "T12n0363_003:0324c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行五眼照真達俗，辯才總持自在無礙；善解世間無邊方便。",
        "translation": "He cultivates the five eyes to illuminate the real and reach the conventional, and his eloquence is unimpeded and unimpeded as he comprehends the world's limitless skillful means.",
        "source": "T12n0363_003:0324c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言誠諦深入義味，度諸有情演說正法。",
        "translation": "He deeply penetrates the meaning of what's said with sincerity, and he liberates sentient beings by expounding the right teaching.",
        "source": "T12n0363_003:0324c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三界平等離諸分別，無相、無為、無因、無果、無取、無捨、無縛、無脫，遠離顛倒，堅固不動如須彌山。",
        "translation": "Equally free of discrimination in the three realms, they are without marks, without actions, without cause, without effect, without taking, without abandonment, without binding, and without liberation, free of delusion, and resolute and unmoving like Mount Sumeru.",
        "source": "T12n0363_003:0324c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧明了如日、月朗；廣大如海出功德寶；熾盛如火燒煩惱薪；忍辱如地一切平等；清淨如水洗諸塵垢，如虛空無邊，不障一切故；如蓮花出水，離一切染故；如雷震響，出法音故；如雲靉靆，降法雨故；如風動樹，發菩提芽故；如牛王聲，異眾牛故；如龍象威，難可測故；如良馬行，乘無失故；如師子坐，離怖畏故；如尼拘樹，覆蔭大故；如須彌山，八風不動故；如金剛杵，破邪山故；如梵王身，生梵眾故；如金翅鳥，食毒龍故；如空中禽，無住處故；如慈氏觀，法界等故。",
        "translation": "智慧明了如日、月朗；廣大如海出功德寶；熾盛如火燒煩惱薪；忍辱如地一切平等；清淨如水洗諸塵垢，如虛空無邊，不障一切故；如蓮花出水，離一切染故；如雷震響，出法音故；如雲靉靆，降法雨故；如風動樹，發菩提芽故；如牛王聲，異眾牛故；如龍象威，難可測故；如良馬行，乘無失故；如師子坐，離怖畏故；如尼拘樹，覆蔭大故；如須彌山，八風不動故；如金剛杵，破邪山故；如梵王身，生梵眾故；如金翅鳥，食毒龍故；如空中禽，無住處故；如慈氏觀，法界等故。",
        "source": "T12n0363_003:0324c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩遍滿佛剎，吹法螺、豎法幢、擊法鼓、然法燈，離過清淨，無迷、無失。",
        "translation": "Thus, the bodhisattva pervades the buddha bases, blows the Dharma conch, erects the Dharma banner, beats the Dharma drum, and produces the Dharma lamp, free of error and pure, without confusion or loss.",
        "source": "T12n0363_003:0324c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "手中出生花鬘、瓔珞、塗香、粖香一切供具，持往百千俱胝那由他佛剎，供養諸佛。",
        "translation": "In his hands, he produces flower garlands, jewelry, coated incense, and all the articles of worship, carrying them to hundreds of thousands of those many buddha bases to make offerings to the buddhas.",
        "source": "T12n0363_003:0324c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於手中別出寶花，散虛空中化成寶蓋廣十由旬，或二十由旬，乃至百千由旬，遍諸佛剎。",
        "translation": "In his hand, he then produces a separate jeweled flower that spreads out into the sky and transforms into a jeweled canopy 10 leagues wide, 20 leagues wide, or a hundred thousand leagues wide that reaches all the buddha bases.",
        "source": "T12n0363_003:0324c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經須臾間還來本國，無愛無著，無取無捨，身心寂靜。」",
        "translation": "In a moment's time, they return to their original land without craving or attachment, without grasping or equanimity, and with serenity of body and mind.\"",
        "source": "T12n0363_003:0325a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「此諸菩薩，我土五濁之所無有，經百千俱胝劫說不能盡。」",
        "translation": "The Buddha told Ānanda, \"These bodhisattvas are like nothing else in the five turbidities of our land, which cannot be explained in detail after a hundred thousand koṭīs of eons.\"",
        "source": "T12n0363_003:0325a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「吾今此土，所有菩薩摩訶薩，已曾供養無量諸佛植眾德本；命終之後，皆得生於極樂世界。",
        "translation": "The Buddha told Ānanda, \"In our present land, all the bodhisattvas, mahāsattvas, and buddhas who have made offerings to measureless buddhas and planted the roots of their virtues will be born in the paradise world when their lives end.",
        "source": "T12n0363_003:0325a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0363_003:0325a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝起合掌面西頂禮。」",
        "translation": "Stand up and bow with your palms together and face west.\"",
        "source": "T12n0363_003:0325a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿難即從座起，合掌面西，頂禮之間忽然得見極樂世界無量壽佛，容顏廣大色相端嚴如黃金山。",
        "translation": "It was then that Ānanda rose from his seat, folded his palms, faced west, and bowed his head in prostration, and suddenly he saw the Buddha of Immeasurable Life of the paradise world, whose features were vast and whose appearance was as dignified as a yellow gold mountain.",
        "source": "T12n0363_003:0325a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又聞十方世界諸佛如來，稱揚讚歎無量壽佛種種功德。",
        "translation": "He also heard the tathāgatas of the worlds in the ten directions praising and singing the praises of the Buddha of Immeasurable Life for his various attributes.",
        "source": "T12n0363_003:0325a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白言：「彼佛淨剎得未曾有，我亦願樂生於彼土。」",
        "translation": "Ānanda said, \"That Buddha's pure abode has never existed before, and I too would like to be born there.\"",
        "source": "T12n0363_003:0325a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告言：「其中生者菩薩摩訶薩，已曾親近無量諸佛植眾德本。",
        "translation": "The Bhagavān told him, \"The bodhisattva Mahāsattva who's born there has been close to measureless buddhas and planted the roots of their merits.",
        "source": "T12n0363_003:0325a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝欲生彼，應當一心歸依瞻仰。」",
        "translation": "If you want to be born there, you should wholeheartedly rely on and venerate them.\"",
        "source": "T12n0363_003:0325a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語時，無量壽佛於手掌中，放無量光照于東方百千俱胝那由他佛剎。",
        "translation": "When he said that, the Buddha of Immeasurable Life put measureless light in the palm of his hand and shone in the east at a hundred thousand koṭīs of those buddhas.",
        "source": "T12n0363_003:0325a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此世界，所有黑山、雪山、金山、寶山、目真隣陀山、摩訶目真隣陀山、須彌山、鐵圍山、大鐵圍山，大海、江河、叢林、樹木，及天人宮殿，一切境界無不照見，譬如日出明照世間，亦復如是。",
        "translation": "In this world, all the black mountains, snow mountains, gold mountains, jeweled mountains, Mount Maudgalyāyana, Mount Sumeru, Mount Tejaprabhā, Mount Great Tejaprabhā, the ocean, rivers, jungles, trees, and the palaces of gods and humans are all illuminated in their entirety, just as the sun rises and shines brightly in the world, so too is it.",
        "source": "T12n0363_003:0325a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中，苾芻、苾芻尼、優婆塞、優婆夷、天、龍、藥叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，皆見極樂世界種種莊嚴，及見無量壽如來，聲聞、菩薩圍繞恭敬，譬如須彌山王出于大海。",
        "translation": "At the time, the bhikṣus, bhikṣuṇīs, upāsaka, upāsikā, gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, mahoragas, humans, and nonhumans all saw the various adornments of the paradise world and the Tathāgata of Immeasurable Life, surrounded and venerated by śrāvakas and bodhisattvas, like Mount Sumeru the king emerging from the ocean.",
        "source": "T12n0363_003:0325a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，極樂世界，過於西方百千俱胝那由他國，以佛威力如對目前。",
        "translation": "At the time, the paradise world, which is a hundred thousand koṭīs and nayutas farther west, was being confronted by the Buddha's authority.",
        "source": "T12n0363_003:0325a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見彼土清淨平正，譬如海面無有丘陵、山嶮、草木、雜穢，唯是眾寶莊嚴，聖賢共住。",
        "translation": "They also see that land as pure and level, like the surface of the ocean with no hills, mountains, peaks, trees, or filth, but only the adornment of many treasures where sages and good men live together.",
        "source": "T12n0363_003:0325a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0325b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼無量壽佛，與諸菩薩、聲聞之眾，亦皆得見我身及娑婆世界菩薩、聲聞，人天之眾。」",
        "translation": "The Buddha of Immeasurable Life and the crowds of bodhisattvas and śrāvakas can also see myself, the bodhisattvas and śrāvakas of the sahā world, and the crowds of humans and gods.\"",
        "source": "T12n0363_003:0325b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告慈氏菩薩言：「汝見極樂世界功德莊嚴，宮殿、樓閣、園林、臺觀、流泉、浴池不？",
        "translation": "It was then that the Bhagavān addressed the Mercy Bodhisattva, \"Have you seen the riches and adornment of the paradise world, its palaces, mansions, gardens, terraces, streams, and baths?",
        "source": "T12n0363_003:0325b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏！",
        "translation": "Tzu's!",
        "source": "T12n0363_003:0325b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見欲界諸天，上至色究竟天，雨種種香花遍滿佛剎，作莊嚴不？",
        "translation": "Do you see the gods of the desire realm, up to the final form heaven, raining flowers of various scents all over the buddha's temple, making adornments?",
        "source": "T12n0363_003:0325b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見菩薩、聲聞淨行之眾，而作佛聲演說妙法，一切佛剎皆得聞聲，獲利樂不？",
        "translation": "Do you see bodhisattvas and śrāvakas of pure practice making the Buddha's voice heard and expounding the wonderful Dharma, so that all buddha bases can hear the sound and attain benefit and happiness?",
        "source": "T12n0363_003:0325b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見百千俱胝眾生，游處虛空宮殿隨身不？」",
        "translation": "Have you seen a hundred thousand koṭīs of sentient beings wandering around in empty palaces?\"",
        "source": "T12n0363_003:0325b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏菩薩白佛言：「世尊！",
        "translation": "The bodhisattva Maitreya said to the Buddha, \"Bhagavān!",
        "source": "T12n0363_003:0325b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說一一皆見。」",
        "translation": "As the Buddha has taught, they all see it.\"",
        "source": "T12n0363_003:0325b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏白言：「云何此界一類眾生，雖亦修善而不求生？」",
        "translation": "Tzu said, \"How is it that a certain type of sentient being in this world doesn't seek birth even though they're also cultivating goodness?\"",
        "source": "T12n0363_003:0325b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慈氏：「此等眾生，智慧微淺，分別西方不及天界，是以非樂不求生彼。」",
        "translation": "The Buddha told Maitreya, \"Such sentient beings have shallow wisdom and discern that the West is not like the heavenly realm; therefore, they don't seek birth there because they don't like it.\"",
        "source": "T12n0363_003:0325b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏白言：「此等眾生虛妄分別，不求佛剎何免輪迴？」",
        "translation": "Tzu said, \"These sentient beings falsely discriminate, so how can they avoid the cycle of rebirth if they don't seek the Buddha's bases?\"",
        "source": "T12n0363_003:0325b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「慈氏！",
        "translation": "The Buddha said, \"Maitreya!",
        "source": "T12n0363_003:0325b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國中有胎生不？」",
        "translation": "Is there womb birth in the land of paradise?\"",
        "source": "T12n0363_003:0325b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏白言：「不也！",
        "translation": "Tze-shi said, \"No!",
        "source": "T12n0363_003:0325b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0363_003:0325b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中生者，譬如欲界諸天，居五百由旬宮殿，自在遊戲，何有胎生？",
        "translation": "\"Where is there birth, like in the desire realm where the gods live in palaces of 500 yojanas and play freely, so why is there birth in the womb?",
        "source": "T12n0363_003:0325b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0363_003:0325b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此界眾生，何因何緣而處胎生？」",
        "translation": "What are the causes and conditions for sentient beings in this realm to be born in the womb?\"",
        "source": "T12n0363_003:0325b19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「慈氏！",
        "translation": "The Buddha said, \"Maitreya!",
        "source": "T12n0363_003:0325b20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等眾生，所種善根不能離相，不求佛慧妄生分別。",
        "translation": "Such sentient beings cultivate good roots that can't be separated from their characteristics and don't seek the Buddha's wisdom to falsely discriminate between them.",
        "source": "T12n0363_003:0325b20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深著世樂人間福報，是故胎生。",
        "translation": "They are deeply attached to the worldly pleasures and rewards of human merit, and are therefore born in the womb.",
        "source": "T12n0363_003:0325b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，以無相智慧植眾德本，身心清淨遠離分別，求生淨剎趣佛菩提。",
        "translation": "If there are sentient beings who cultivate the roots of many virtues with markless wisdom, their bodies and minds are purified and free of discrimination, and they seek birth in a pure buddha and head for bodhi.",
        "source": "T12n0363_003:0325b22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人命終，剎那之間於佛淨土坐寶蓮花身相具足。",
        "translation": "When that person's life ends, he or she will sit on a jeweled lotus in the Buddha's Pure Land in a split second, fully endowed with the body and features.",
        "source": "T12n0363_003:0325b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何有胎生？",
        "translation": "How could there be birth in the womb?",
        "source": "T12n0363_003:0325b25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏！",
        "translation": "Tzu's!",
        "source": "T12n0363_003:0325b25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見愚癡之人，不種善根，但以世智聰辯，妄生分別增益邪心，云何出離生死大難？",
        "translation": "Do you see a foolish man who doesn't plant good roots but uses worldly wisdom and intelligence to falsely discriminate and gain wrong mental states, how will he escape the great difficulty of birth-and-death?",
        "source": "T12n0363_003:0325b25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有眾生，雖種善根供養三寶作大福田，取相分別情執深重，求出輪迴終不能得。」",
        "translation": "\"There are also sentient beings who, even though they plant good roots and make offerings to the three treasures as a field of great merit, grasp to characteristics, discriminate between them, and hold deeply to them, seeking to escape the cycle of rebirth is never possible.\"",
        "source": "T12n0363_003:0325b27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慈氏：「譬如受灌頂位剎帝利王，置一大獄，於其獄內，安置殿堂、樓閣、鉤欄、窓牖、床榻座具，皆以珍寶嚴飾；所須衣服、飲食無不豐足。",
        "translation": "The Buddha told Ci Shi, \"Suppose the consecrated king Jātī sets up a large prison, and inside that prison, he puts in place a hall, a tower, a hooked railing, a window, a bed and a seat, all adorned with treasures, and all the necessary clothing and food are plentiful.",
        "source": "T12n0363_003:0325b29_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時灌頂王，驅逐太子禁閉獄中，復與錢財、珍寶、羅紈、匹帛，恣意受用。」",
        "translation": "The king of consecration then expelled the prince, confined him to the prison, and gave him money, valuables, robes, and fabrics to use as he liked.\"",
        "source": "T12n0363_003:0325c03_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慈氏：「於意云何？",
        "translation": "The Buddha told Maitreya, \"What do you think?",
        "source": "T12n0363_003:0325c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼太子得快樂不？」",
        "translation": "Will that prince be happy?\"",
        "source": "T12n0363_003:0325c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏白言：「不也！",
        "translation": "Tze-shi said, \"No!",
        "source": "T12n0363_003:0325c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0363_003:0325c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼中雖有堂殿、樓閣、飲食、衣服、錢帛、金寶隨意受用，身閉牢獄心不自在，唯求出離。」",
        "translation": "Although there are halls, mansions, food, clothing, money, and gold jewelry there that he can enjoy as he wishes, his body is shut up in prison, and his mind isn't at ease; he only seeks to escape.\"",
        "source": "T12n0363_003:0325c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慈氏：「若灌頂王不捨其過，彼諸大臣、長者、居士等，可令太子免禁獄不？」",
        "translation": "The Buddha told Tzushi, \"If the consecrated king doesn't abandon his faults, will those ministers, elders, householders, and so forth free the prince from confinement?\"",
        "source": "T12n0363_003:0325c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏白言：「王既不捨，云何得出？」",
        "translation": "Tzu said, \"Since the king doesn't abandon it, how can he escape?\"",
        "source": "T12n0363_003:0325c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是，如是！",
        "translation": "The Buddha said, \"So it is, so it is!",
        "source": "T12n0363_003:0325c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生，雖復修福供養三寶，虛妄分別求人天果。",
        "translation": "\"Although those sentient beings cultivate virtue and make offerings to the Three Treasures and falsely discriminate among them in pursuit of the fruits of humanhood and godhood, when they attain their reward, the container world, palace, and tower in which they live, the clothing, bedding, food, and medicine that they need are all abundant, and they're always in the cycle of transmigration without freedom.",
        "source": "T12n0363_003:0325c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得報之時，所居器界、宮殿、樓閣，衣服、臥具、飲食、湯藥，一切所須悉皆豐足，而未能出三界獄中，常處輪迴而不自在。",
        "translation": "When they attain their reward, they'll live in a container, a palace, a tower, clothing, bedding, food, drink, and medicine, and everything else they need will be abundant, but they won't be able to escape the three realms and hells, and they'll always be in the cycle of transmigration and won't be able to do so freely.",
        "source": "T12n0363_003:0325c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使父母、妻子、男、女眷屬欲相救免，終不能出邪見業王無能捨離。",
        "translation": "Even if their parents, wives, men, and women dependents try to save them, they can't escape the king of wrong-view karma and can't abandon it.",
        "source": "T12n0363_003:0325c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生斷妄分別，植諸善本無相、無著，當生佛剎永得解脫。」",
        "translation": "If sentient beings cut off false discrimination and plant wholesome roots that have no characteristics and no attachment, they will be born in a buddha's bases and be permanently liberated.\"",
        "source": "T12n0363_003:0325c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏菩薩白佛言：「世尊！",
        "translation": "The Mercy bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T12n0363_003:0325c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此娑婆世界及諸佛剎，有幾多菩薩摩訶薩，得生極樂世界，見無量壽佛，成就阿耨多羅三藐三菩提？」",
        "translation": "How many bodhisattvas, mahāsattvas, have attained birth in the paradise world, seen the Buddha of Immeasurable Life, and accomplished supreme perfect enlightenment in this sahā world and in the buddha bases?\"",
        "source": "T12n0363_003:0325c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「慈氏！",
        "translation": "The Buddha said, \"Maitreya!",
        "source": "T12n0363_003:0325c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此娑婆世界，有七十二俱胝那由他菩薩摩訶薩，已曾供養無量諸佛植眾德本，當生彼國親近供養無量壽佛，成就阿耨多羅三藐三菩提。",
        "translation": "In this Saha world of mine, there are 72 corpus nayutas, bodhisattvas, and mahāsattvas who have made offerings to measureless buddhas and planted the roots of their merits, and will be born in that country to make intimate offerings to the Buddha of Immeasurable Life and achieve supreme, perfect enlightenment.",
        "source": "T12n0363_003:0325c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "\"Furthermore, Ānanda!",
        "source": "T12n0363_003:0325c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難忍佛剎，有十八俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "At the Nandanavana Buddha-zha, there are 18 koṭīs, or nayutas, of bodhisattvas and mahāsattvas who are born in that land.",
        "source": "T12n0363_003:0325c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶藏佛剎，有九十俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "At Jewel-treasure Buddha's buddha-stele, there are ninety koṭīs that are born to other bodhisattvas and mahāsattvas in that land.",
        "source": "T12n0363_003:0325c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "火光佛剎，有二十二俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "There are twenty-two corpuscles of firelight in the Buddha's buddha-stele, which gives birth to that bodhisattva-mahāsattva.",
        "source": "T12n0363_003:0325c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量光佛剎，有二十五俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "The Buddha Temple of Limitless Light has 25 koṭīs that are born to other bodhisattvas and mahāsattvas in that land.",
        "source": "T12n0363_003:0325c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世燈佛剎，有六十俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "At the Buddha Temple of Worldly Light, there are 60 corpuscles of nayutas and mahāsattvas who are born in that land.",
        "source": "T12n0363_003:0326a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍樹佛剎，有一千四百菩薩摩訶薩，生彼國土。",
        "translation": "At Nāgârjuna Buddha's buddha temple, there are 1,400 bodhisattvas and mahāsattvas who are born in that land.",
        "source": "T12n0363_003:0326a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無垢光佛剎，有二十五俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "At Vimalakīrti Buddha's buddha temple, there are 25 corpuscles of nayutas and mahāsattvas who are born in that land.",
        "source": "T12n0363_003:0326a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師子佛剎，有一千八百菩薩摩訶薩，生彼國土。",
        "translation": "There are 1,800 bodhisattvas and mahāsattvas at Shizi Buddha's buddha temple who are born in that land.",
        "source": "T12n0363_003:0326a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吉祥峯佛剎，有二千一百俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "The buddha temple of Auspicious Peak has 2,100 koṭīs, or other bodhisattvas and mahāsattvas, who are born in that land.",
        "source": "T12n0363_003:0326a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁王佛剎，有一千俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "At the Renwang buddha temple, there are 1,000 koṭīnayutpas and mahāsattvas who are born in that land.",
        "source": "T12n0363_003:0326a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "花幢佛剎，有一俱胝菩薩摩訶薩，生彼國土。",
        "translation": "At Flower Banner Buddha's buddha temple, there's one koṭī of bodhisattvas and mahāsattvas who are born in that land.",
        "source": "T12n0363_003:0326a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光明王佛剎，有十二俱胝菩薩摩訶薩，生彼國土。",
        "translation": "There are twelve corpuscles of bodhisattvas and mahāsattvas at the Dhāraṇī King Buddha's buddha temple who are born in that land.",
        "source": "T12n0363_003:0326a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得無畏佛剎，有六十九俱胝那由他菩薩摩訶薩，生彼國土。",
        "translation": "At the Attainment of Fearlessness buddha temple, there are sixty-nine corpuscles of nayuta bodhisattvas and mahāsattvas who are born in that land.",
        "source": "T12n0363_003:0326a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉皆親近供養無量壽佛，不久當成阿耨多羅三藐三菩提。」",
        "translation": "They all become intimate with and make offerings to the Buddha of Immeasurable Life, and they will soon achieve supreme perfect enlightenment.\"",
        "source": "T12n0363_003:0326a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「慈氏！",
        "translation": "The Buddha said, \"Maitreya!",
        "source": "T12n0363_003:0326a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是功德莊嚴極樂國土，滿彼算數無量之劫，說不能盡。",
        "translation": "Such merits adorn the paradise land, filling an incalculably long eon that cannot be explained.",
        "source": "T12n0363_003:0326a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子、善女人，得聞無量壽佛名號，發一念信心，歸依瞻禮。",
        "translation": "If a good man or woman hears the name of the Buddha of Immeasurable Life, arouses a moment of faith, relies on it, and venerates it, then that person should know that they aren't a follower of the lesser vehicle and can be called the first disciple in our teaching.",
        "source": "T12n0363_003:0326a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此人非是小乘，於我法中得名第一弟子。」",
        "translation": "You should know that person isn't a follower of the lesser vehicle and will be called the first disciple in my teaching.\"",
        "source": "T12n0363_003:0326a16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告慈氏：「若有苾芻、苾芻尼、優婆塞、優婆夷、天、龍、藥叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，於此經典書寫、供養、受持、讀誦、為他演說，乃至於一晝夜，思惟彼剎及佛身功德，此人命終速得生彼，成就阿耨多羅三藐三菩提。",
        "translation": "The Buddha told Ci Shi, \"If a monk, monk's nun, upāsaka, upāsik, god, dragon, yakṣa, gandharva, asura, garuḍa, kiṃnara, mahoraga, human or non-human, etc., writes down this sūtra, makes offerings, accepts it, recites it, expounds it for others, and contemplates its merits and the Buddha's body for one day and night, that person will quickly be born there at the end of his life and achieve unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0363_003:0326a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，慈氏！",
        "translation": "\"Furthermore, Maitreya!",
        "source": "T12n0363_003:0326a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此經典甚深微妙，廣利眾生。",
        "translation": "\"This sūtra is profound and subtle, and it widely benefits sentient beings.",
        "source": "T12n0363_003:0326a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，於此正法受持、讀誦、書寫、供養。",
        "translation": "If there are sentient beings who memorize, recite, write, and make offerings to this right teaching, then they'll be able to surpass them when they finally die.",
        "source": "T12n0363_003:0326a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人臨終，假使三千大千世界滿中大火，亦能超過生彼國土。",
        "translation": "At their final moment, even if the whole world of the 3,000 great one-thousand worlds were filled with great fires, they would still be able to surpass them and be born in that land.",
        "source": "T12n0363_003:0326a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人已曾值過去佛受菩提記，一切如來同所稱讚，無上菩提隨意成就。」",
        "translation": "That person has met past buddhas and received the assurance of enlightenment, and all tathāgatas have praised them together for accomplishing unsurpassed enlightenment at will.\"",
        "source": "T12n0363_003:0326a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「慈氏！",
        "translation": "The Buddha said, \"Cissy!",
        "source": "T12n0363_003:0326a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛世難值，正法難聞，如來所行亦應隨行。",
        "translation": "The Buddha's world is difficult to come across, and the right teaching is difficult to hear, so you should follow what the Tathāgata does.",
        "source": "T12n0363_003:0326a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此經典作大守護，為諸有情長夜利益，莫令眾生墮在五趣莊嚴獄中；令諸有情種修福善，求生淨剎。」",
        "translation": "Be a great protector of this scripture for the long-term benefit of sentient beings, so that they won't fall into the ornate hells of the five destinies and cause sentient beings to cultivate goodness and merit and seek birth in pure bases.\"",
        "source": "T12n0363_003:0326b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說頌曰：「若不往昔修福慧，　　於此正法不能聞；　已曾供養諸如來，　　是故汝等聞斯義。",
        "translation": "It was then that the Bhagavān spoke a verse, \"If you hadn't cultivated virtue and wisdom in the past, you wouldn't have been able to hear this right teaching; you've already made offerings to the tathāgatas, so you've heard its meaning.",
        "source": "T12n0363_003:0326b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞已受持及書寫，　　讀誦、讚演并供養，　如是一心求淨方，　　決定往生極樂國。",
        "translation": "After hearing it, you memorize it, write it down, recite it, praise it, perform it, and make offerings to it. Thus, you single-mindedly seek the pure land and decide to be reborn in the paradise land.",
        "source": "T12n0363_003:0326b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使大火滿三千，　　及彼莊嚴諸牢獄；　如是諸難悉能超，　　皆是如來威德力。",
        "translation": "Even if a great fire were to fill 3,000 places and those ornate prisons were to be filled, such difficulties could all be surpassed because of the Tathāgata's authoritative power.",
        "source": "T12n0363_003:0326b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼佛利樂諸功德，　　唯佛與佛乃能知；　聲聞、緣覺滿世間，　　盡其神力莫能測。",
        "translation": "Those buddhas' merits that bring benefit and joy can be known only by buddhas and buddhas, and their powers are unfathomable as they fill the world with śrāvakas and pratyekbuddhas.",
        "source": "T12n0363_003:0326b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使長壽諸有情，　　命住無數俱胝劫，　稱讚如來功德身，　　盡其形壽讚無盡。",
        "translation": "Suppose long-lived sentient beings live for an incalculably long eon, praising the Tathāgata's body of merit for as long as their physical forms last.",
        "source": "T12n0363_003:0326b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大聖法王所說法，　　利益一切諸群生；　若有受持恭敬者，　　佛說此人真善友。」",
        "translation": "The teaching given by the great sage Dharma king benefits all sentient beings, and if anyone accepts it and venerates it, the Buddha says that person is truly a good friend.\"",
        "source": "T12n0363_003:0326b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此法時，有十二俱胝那由他人，遠塵離垢得法眼淨。",
        "translation": "At the time the Bhagavān spoke this teaching, there were twelve corpuscular nayutas who became dustless and spotless and attained purification of the Dharma eye.",
        "source": "T12n0363_003:0326b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八百苾芻，漏盡意解心得解脫。",
        "translation": "Eight hundred monks had their contaminants ended, their minds liberated, and their hearts liberated.",
        "source": "T12n0363_003:0326b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天人眾中，有二十二俱胝那由他人，證阿那含果。",
        "translation": "Among the gods and humans, there were twenty-two coarse people who realized the fruit of non-returning.",
        "source": "T12n0363_003:0326b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二十五俱胝人，得法忍不退。",
        "translation": "There are another 25 coarsenesses who attain forbearance and don't regress from the teaching.",
        "source": "T12n0363_003:0326b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四十俱胝百千那由他人，發阿耨多羅三藐三菩提心，種諸善根，皆願往生極樂世界，見無量壽佛。",
        "translation": "There are another 40 corpuscles and 1,000 nayutas who arouse the mind of unsurpassed, corrected enlightenment and plant good roots, all hoping to be reborn in the paradise world and see the Buddha of Immeasurable Life.",
        "source": "T12n0363_003:0326b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十方佛剎，若現在生及未來生，見無量壽佛者，各有八萬俱胝那由他人，得然燈佛記，名妙音如來，當得阿耨多羅三藐三菩提。",
        "translation": "Furthermore, if there are buddha bases in ten directions where present and future generations see the Buddha of Immeasurable Life, each of them has 80,000 corpuscles of nayutas who have attained the Rendō Bosatsuji, which is called the Wonderful Sound Tathāgata, and will attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0363_003:0326b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸有情，皆是無量壽佛宿願因緣，俱得往生極樂世界。",
        "translation": "All of those sentient beings are the causes and conditions of the Buddha of Immeasurable Life's long vows, and they'll all be reborn in the paradise world.",
        "source": "T12n0363_003:0326b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是語時，三千大千世界六種震動，雨諸香花積至于膝。",
        "translation": "When the Buddha spoke these words, six of the 3,000 great one-thousand worlds shook, and fragrant flowers poured down to their knees.",
        "source": "T12n0363_003:0326b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有諸天於虛空中，作妙音樂出隨喜聲；乃至色界諸天，悉皆得聞歎未曾有。",
        "translation": "Up in the sky, the gods made marvelous music and joyful sounds, and the gods of the form realm were all able to hear and praise that which had never been heard before.",
        "source": "T12n0363_003:0326b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，尊者阿難及慈氏菩薩等，并天龍八部一切大眾，聞佛所說，皆大歡喜，信受奉行。",
        "translation": "At the time, Venerable Ānanda, the Mercy Bodhisattva, and the rest of the eight groups of gods and dragons heard what the Buddha taught, they were all overjoyed, believed, and approved.",
        "source": "T12n0363_003:0326b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說大乘無量壽莊嚴經卷下",
        "translation": "Foshuo dasheng wuliangshou zhuangyan jing, vol. 2",
        "source": "T12n0363_003:0326c03_0",
        "is_bad_quality": false
    }
]