[
    {
        "source_sentence": "佛說大方廣善巧方便經卷第二",
        "translation": "Foshuo dafang guang shanqiao fangbian jing, vol. 2",
        "source": "T12n0346_002:0169a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Minister of Light for the Tripiṭaka Translation of the Sutra of the Western Paradise, the Grand Master of the Chaofeng",
        "source": "T12n0346_002:0169a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳法大師賜紫臣施護奉　詔譯",
        "translation": "Master Chuanfa Zhichen Shihuofeng Translation of the Imperial Edict",
        "source": "T12n0346_002:0169a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，光聚王！",
        "translation": "\"Furthermore, King Kōju!",
        "source": "T12n0346_002:0169a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如持明人善修瑜伽悉地法門，於祕密五種縛中而受繫縛，隨所作法不越三昧。",
        "translation": "\"It's also like a person who retains insight and skillfully cultivates the method of the accomplishment of yoga, which binds him to the five kinds of fetters of the esoteric practices and follows the methods that don't transcend samādhi.",
        "source": "T12n0346_002:0169a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人以一大明句力悉能斷除彼一切縛，而獲安住祕密行門。",
        "translation": "With the power of one great statement of insight, that person is able to sever all those fetters and attain a secure abode in the esoteric practices.",
        "source": "T12n0346_002:0169a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖在繫縛中，常不離三昧。",
        "translation": "Even though he's in bondage, he never departs from samādhi.",
        "source": "T12n0346_002:0169b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具善巧方便菩薩摩訶薩亦復如是，於五欲境中嬉戲順行，隨其所作不壞正行。",
        "translation": "So too, the bodhisattva Mahāsattva with skillful means plays and goes along with the five objects of desire, following their actions without disrupting right practice.",
        "source": "T12n0346_002:0169b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩以一智慧明力悉能清淨一切染法，於一切智心而能安住。",
        "translation": "With the insight of a single intelligence, this bodhisattva is fully able to purify all defiled dharmas, and he's able to abide in a mind with omniscience.",
        "source": "T12n0346_002:0169b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖受五欲樂，常生梵天界。",
        "translation": "Although they experience the pleasure of the five desires, they're always born in the Brahma heavenly realm.",
        "source": "T12n0346_002:0169b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「光聚王！",
        "translation": "\"King of the Luminaries!",
        "source": "T12n0346_002:0169b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如世間善用劍者於其劍法巧妙精熟。",
        "translation": "\"It's also like a person in the world who makes good use of the sword and is skilled and adept at its technique.",
        "source": "T12n0346_002:0169b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人一時隱覆利劍，獨行曠野險難之處。",
        "translation": "One time, this person is traveling alone through a wild and difficult place with a sharp sword concealed in his pocket.",
        "source": "T12n0346_002:0169b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其中路忽見一人，單己無伴復無器仗。",
        "translation": "On his path, he suddenly sees a man who's alone, without a companion or a weapon.",
        "source": "T12n0346_002:0169b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時用劍人見彼人已，生悲愍心，即相附近而謂言曰：『汝今獨行，一無伴侶又無器仗，將何護身？",
        "translation": "When the sword user sees that person, he becomes compassionate and says to them, 'Now that you're walking alone, with no companion and no weapon, how will you protect yourself?'",
        "source": "T12n0346_002:0169b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今同我隨其所往，終不令汝有所闕失。",
        "translation": "Now, you and I will go wherever we go, and I will never let you lose anything.",
        "source": "T12n0346_002:0169b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若忽值遇盜賊等事，我當為汝作大救護。』",
        "translation": "If you suddenly run into something like a thief, I'll be a great protector for you.'",
        "source": "T12n0346_002:0169b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言已同行。",
        "translation": "After he said that, he went along.",
        "source": "T12n0346_002:0169b13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其中路忽逢賊眾，時同行人不知此人先隱利劍，見是賊已即生怖畏。",
        "translation": "When they suddenly come upon a crowd of thieves on their path, the person traveling with them doesn't know that they've hidden a sharp sword, and they become frightened when they see them.",
        "source": "T12n0346_002:0169b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時用劍人發勇猛心，無所怯懼，即出其劍與彼賊眾而共鬪敵。",
        "translation": "The man with the sword then becomes courageous and fearless, and he takes out his sword to fight the bandits together.",
        "source": "T12n0346_002:0169b14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼賊眾皆悉斷命，其用劍人自護身已、復能防護彼同行者，咸得安隱過斯險難。",
        "translation": "The bandits' lives are all cut off, but the man with the sword protects himself and protects those who are with him, and they all safely escape this danger.",
        "source": "T12n0346_002:0169b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具善巧方便菩薩摩訶薩亦復如是，而能具足種種方便、執智慧劍。",
        "translation": "So too, the bodhisattva Mahāsattva with skillful means is able to fully possess various means and wield the sword of wisdom.",
        "source": "T12n0346_002:0169b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖於五欲境嬉戲順行，終不暫令身根起放逸事，能為身根作大防護。",
        "translation": "Even though they playfully go along with the five objects of desire, they never temporarily allow their physical faculties to become careless, and they can provide great protection for their physical faculties.",
        "source": "T12n0346_002:0169b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設於異時遇煩惱魔，菩薩亦復無所動轉，被精進鎧不生怖畏，以智慧劍斷煩惱網，悉令清淨。",
        "translation": "Even if he encounters the demon of affliction at another time, the bodhisattva remains unperturbed, is armed with the armor of zeal, doesn't become frightened, and uses the sword of wisdom to cut off the web of affliction and make it completely pure.",
        "source": "T12n0346_002:0169b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩常生清淨佛土。」",
        "translation": "The bodhisattva is always born in a pure Buddha land.\"",
        "source": "T12n0346_002:0169b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有一菩薩名曰作愛，於其食時入舍衛大城而行乞食。",
        "translation": "At the time, there was a bodhisattva named Zaohui in the assembly who went into the large city of Śrāvastī at feeding time and begged for food.",
        "source": "T12n0346_002:0169b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼菩薩次第行至一長者舍，住立門側，發聲乞食。",
        "translation": "That bodhisattva went in order to an elder's residence, stood by the entrance, and vocalized his desire to beg for food.",
        "source": "T12n0346_002:0169b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者有女名曰上財，顏貌端正，人所愛樂。",
        "translation": "That elder had a woman named Shang Cai who had a good appearance and was loved by people.",
        "source": "T12n0346_002:0169b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼女聞菩薩聲，即持飲食出施菩薩。",
        "translation": "When she heard the sound of the bodhisattva's voice, she took food and drink and offered it to the bodhisattva.",
        "source": "T12n0346_002:0169b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "授其食已，即於菩薩生愛樂心，若色相、若音聲而生取著，由此因緣起貪染心。",
        "translation": "After giving her food, she became attracted to the bodhisattva, whether it was for form or sound, and this was the cause and condition that gave rise to a mind tainted with desire.",
        "source": "T12n0346_002:0169b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作愛菩薩見是女已，即知其念。",
        "translation": "After the desirous bodhisattva sees this woman, he immediately knows what she's thinking.",
        "source": "T12n0346_002:0169c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時於貪染法無所作意，即自思惟：「於須臾間若起一念貪染心者，是大過失。",
        "translation": "At that point, the bodhisattva had no intention of becoming impassioned, and he thought to himself, \"It would be a great mistake if he were to give rise to a single momentary thought of impassioned mind.",
        "source": "T12n0346_002:0169c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0346_002:0169c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此女人，我於何處而生可愛？",
        "translation": "\"Now, where will I find this woman desirable?",
        "source": "T12n0346_002:0169c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼眼根為可愛者，眼是無常敗壞不淨肉團，彼自性空，何所愛樂？",
        "translation": "If the eye faculty is desirable, then what is there to love about the eye, which is an impermanent, decayed, and impure mass of flesh that's empty in its own nature?",
        "source": "T12n0346_002:0169c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於耳、鼻、舌、身、意根為可愛者，彼彼諸根亦復如是，自性皆空，無有實法，何所愛樂？",
        "translation": "If the sense faculties of ear, nose, tongue, body, and mind are desirable, what would be the desirability of those faculties, which are empty in nature and lack real dharmas?",
        "source": "T12n0346_002:0169c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，從足至頂、乃至內外中間，一一如實審諦觀察，是中無有少法可得。",
        "translation": "Thus, from the feet up to the top, and from inside to outside and between, I truly and critically observe each one, and there's not a single thing to be found in it.",
        "source": "T12n0346_002:0169c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今如是如實觀已，於一切法悉無所有。",
        "translation": "Now, having truly observed them in this way, I realize that all dharmas are nonexistent.",
        "source": "T12n0346_002:0169c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法無有故，即法無生。」",
        "translation": "Because dharmas don't exist, that means dharmas are unarisen.\"",
        "source": "T12n0346_002:0169c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是思惟時，即得無生法忍。",
        "translation": "When the bodhisattva thinks this, he attains the tolerance of the nonarising of dharmas.",
        "source": "T12n0346_002:0169c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩得是利已，心大歡喜，即於是處踊身虛空高一多羅樹，於其城中右繞七匝出舍衛大城，乘空往詣佛世尊所。",
        "translation": "After attaining this benefit, the bodhisattva's heart rejoiced greatly, and he rushed up into the sky, standing tall in a palm tree, circled the city to the right seven times, left Śrāvastī, and rode into the sky to visit the Bhagavān.",
        "source": "T12n0346_002:0169c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊見彼作愛菩薩威德巍巍猶如鵝王，乘空自在徐緩而來。",
        "translation": "At the time, the Bhagavān saw that Saṃkusumitarāja Bodhisattva, whose majestic features were like those of a king goose, riding freely in the air and coming slowly.",
        "source": "T12n0346_002:0169c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊見已，謂阿難言：「阿難！",
        "translation": "After he saw this, the Bhagavān addressed Ānanda, saying, \"Ānanda!",
        "source": "T12n0346_002:0169c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見此作愛菩薩從空來不？」",
        "translation": "Do you see this craving bodhisattva coming from emptiness?\"",
        "source": "T12n0346_002:0169c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, \"Bhagavān!",
        "source": "T12n0346_002:0169c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然已見。」",
        "translation": "Only yes, I've seen it.\"",
        "source": "T12n0346_002:0169c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難言：「汝今當知，此菩薩者，於一切法離貪愛心，證法無生、悉無所得，而能降伏一切魔軍，廣為眾生轉正法輪。」",
        "translation": "The Buddha told Ānanda, \"Now, you should know that this bodhisattva is free of craving for all things, realizes that all things are unarisen and unobtainable, and is able to subdue all the armies of Māra and widely turn the right wheel of the Dharma for sentient beings.\"",
        "source": "T12n0346_002:0169c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛言已，而彼菩薩即住空中聽佛說法。",
        "translation": "After the Buddha said that, that bodhisattva stood up in the air and listened to what he taught.",
        "source": "T12n0346_002:0169c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼上財女人於長者舍忽然命終，生三十三天，轉女人相，得天子身。",
        "translation": "At the time, that wealthy woman suddenly ended up in the eldest abode, was born in the Trāyastriṃśa Heaven, changed her appearance from that of a woman, and attained the body of a celestial son.",
        "source": "T12n0346_002:0169c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天子生時，有七寶莊嚴微妙宮殿同時出現，縱廣十二由旬。",
        "translation": "When that celestial son was born, there was a subtle palace adorned with seven jewels that appeared at the same time, measuring 12 leagues across.",
        "source": "T12n0346_002:0169c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一萬四千天女眷屬同時而生。",
        "translation": "There are another 14,000 members of the celestial ladies' retinue who are born at the same time.",
        "source": "T12n0346_002:0169c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸天女於須臾間自有智生，咸作是念：「我等今時以何善根得生於此？」",
        "translation": "In a moment's time, these goddesses themselves will be born with knowledge, and they'll all think, \"What good roots did we have that allowed us to be born here?\"",
        "source": "T12n0346_002:0169c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即知：「先世舍衛城中，有長者女於一菩薩起染愛心。",
        "translation": "That's how you know, \"In a previous life, there was an elderly woman in the city of Śrāvastī who became defiled and attached to a bodhisattva.",
        "source": "T12n0346_002:0169c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，於彼命終生此天中，轉女人相而為天子。",
        "translation": "Because of this cause, she was born in this heaven at the end of her life and changed her appearance from a woman to a son of the gods.",
        "source": "T12n0346_002:0169c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼得無量勝報神通，我等由是天子勝因緣故亦得生此。」",
        "translation": "Because of Peter's measureless and excellent powers, we sons of gods will also be born here because of this excellent cause.\"",
        "source": "T12n0346_002:0170a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，歡喜而住。",
        "translation": "After thinking this thought, they rejoiced and stayed there.",
        "source": "T12n0346_002:0170a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼新生天子即作是念：「我昔人間生染愛心，而何今時得是勝報？",
        "translation": "At that point, that newborn celestial then thought, \"How could I have had defiled love among humans in the past and then attained such a superior reward now?",
        "source": "T12n0346_002:0170a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此因緣者，乃是作愛菩薩增上善力為開導故。",
        "translation": "This cause and condition is the result of the Zaoi Bodhisattva's superior good power as a guide.",
        "source": "T12n0346_002:0170a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今宜應往詣佛所，恭敬供養彼佛、世尊及欲瞻禮作愛菩薩。」",
        "translation": "Now, I should go to the Buddha, venerate and make offerings to that Buddha, the Bhagavān, and venerate the beloved bodhisattva.\"",
        "source": "T12n0346_002:0170a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼天子作是念已，即時與諸天女眷屬持以種種殊妙香華，從彼天界來詣佛所。",
        "translation": "After that thought, that celestial immediately brought his retinue of goddesses and women from that heavenly realm to the Buddha's abode with a variety of exquisite flowers and fragrances.",
        "source": "T12n0346_002:0170a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已，頭面禮世尊足，即於佛前合掌向空遙伸敬禮作愛菩薩，然後以彼所持眾香華等尊重恭敬供養世尊。",
        "translation": "When they arrived, they bowed their heads to the Bhagavān's feet, put their palms together in front of the Buddha, extended their respects into the air, and paid homage to the Saṃdhinirmocana Bodhisattva, then offered the Bhagavān the respectful and respectful offerings of the many fragrant flowers that he was carrying.",
        "source": "T12n0346_002:0170a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作供養已，右繞三匝，合掌向佛說伽陀曰：「不可思議人中尊！",
        "translation": "After making the offerings, he circled the Buddha three times to his right, put his palms together, and said to him, \"Venerable among unfathomable men!",
        "source": "T12n0346_002:0170a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不可思議大菩提！",
        "translation": "Unfathomably great bodhi!",
        "source": "T12n0346_002:0170a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不可思議諸佛行！",
        "translation": "Unfathomable acts of the buddhas!",
        "source": "T12n0346_002:0170a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不可思議諸佛法！",
        "translation": "Unfathomable buddha-teachings!",
        "source": "T12n0346_002:0170a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我舍衛城長者女，　　父本立名為上財，　色相端嚴眾所欽，　　父母、宗親亦愛念。",
        "translation": "\"I, the eldest daughter of Śrāvastī, was originally named Shangzai by my father, and I was admired by many for my noble appearance and the affection of my parents and clan.",
        "source": "T12n0346_002:0170a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於一時中有佛子，　　具大威德名作愛，　舍衛城中乞食行，　　次第來至於我舍。",
        "translation": "At one point in time, there was a son of the Buddha with great authority and renown who went begging for food in Śrāvastī and came to my house one by one.",
        "source": "T12n0346_002:0170a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我時聞彼美音聲，　　適悅歡喜即取食，　持食詣彼作愛前，　　以尊重心施佛子。",
        "translation": "When I heard his beautiful voice, I was delighted and rejoiced, and I took the food, carried it to him, and offered it to the son of the Buddha with respect.",
        "source": "T12n0346_002:0170a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我時見彼妙色相，　　心生愛染欲和合，　彼因緣故不能成，　　我於剎那而命斷。",
        "translation": "When I saw their beautiful appearance, my mind became fond of them and wanted to combine them, but I couldn't because of their causes and conditions, and my life was cut short in a split second.",
        "source": "T12n0346_002:0170a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今不能具宣說，　　作愛佛子大因緣，　於染愛法不相應，　　令我滅已生勝處。",
        "translation": "Now, I can't fully explain the great cause and condition of making love to the Buddha's son, which isn't associated with defiled love and causes me to enter a superior place after ceasing.",
        "source": "T12n0346_002:0170a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0170a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我雖捨前報，　　快哉斷我女人相，　轉成男子大威光；　　又復得生於天界，　與我同生諸天女，　　一萬四千為眷屬；　復有最上七寶嚴，　　微妙宮殿同時現。",
        "translation": "\"Even though I abandoned my former reward, I've happily ended my femininity and become a man of great radiance; I was again born in the heavenly realm, born with me as one of the goddesses, with 14,000 of them as my retinue; and there are the most sublime seven-jeweled adornments and subtle palaces appearing at the same time.",
        "source": "T12n0346_002:0170a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我時發生如是心，　　此為不可思議事，　我以染愛心為因，　　云何得此清淨報？",
        "translation": "Such a thought occurred to me at the time, which is unfathomable; how could I have obtained this pure reward when my mind was the cause of defiled love?",
        "source": "T12n0346_002:0170b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作愛佛子甚希有，　　亦名作喜、作光明，　我身熾盛大威光，　　由彼勝因獲如是。",
        "translation": "\"Rare is the beloved son of the Buddha, also known as 'making merry and making bright,' whose blazing radiance is the cause of my success in attaining such a greatness.",
        "source": "T12n0346_002:0170b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　染因能成如是果，　　聲聞、緣覺不能知，　而彼乘中無此法，　　唯善逝智而能轉。",
        "translation": "Such a result can be produced from defiled causes that can't be known by direct disciples or pratyekbuddhas, and there's no such thing in that vehicle that can be transformed only by the wisdom of the well gone.",
        "source": "T12n0346_002:0170b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使殑伽沙數劫，　　不能修學諸佛智，　我今無餘所樂心，　　唯求無上菩提果。",
        "translation": "Even if I hadn't been able to train in the wisdom of the buddhas for sands of eons, I'd have nothing left to aspire to but the unsurpassed fruit of enlightenment.",
        "source": "T12n0346_002:0170b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作愛佛子大威德，　　是我最上善知識，　我因彼故得見佛，　　安住菩提無退轉。",
        "translation": "The great authority of the beloved son of the Buddha is my supreme good teacher, and it's because of him that I've come to see the Buddha and stand firm in bodhi without turning back.",
        "source": "T12n0346_002:0170b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我知修行菩提者，　　於染愛心無所著，　如我所轉女人相，　　普願一切為男子。",
        "translation": "I know that someone who cultivates enlightenment has no attachment to defiled love, so I will change the characteristics of women and vow that all of them will be men.",
        "source": "T12n0346_002:0170b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我前世中命終後，　　父母親族懷悲惱，　恩愛極苦所纏心，　　返於沙門生忿恚。",
        "translation": "In a previous life, when my life ended, my parents and clan were so sad and troubled by affection and suffering that I returned to the ascetic world and became angry.",
        "source": "T12n0346_002:0170b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今以佛威神力，　　於剎那間詣父所，　隱身住空而白言：　　『勿於沙門生忿恚，　起忿恚者大過失，　　於長夜中受苦惱。",
        "translation": "Now, with the Buddha's authoritative power, I went to my father's place in a flash, hid myself in space, and said, 'Don't become angry with the ascetics; it's a big mistake to become angry, and you'll be tormented in the long night.'",
        "source": "T12n0346_002:0170b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　上財女者今我是，　　已生三十三天中，　轉彼女人前報相，　　得大威光天子身。",
        "translation": "Now, I'm the wealthy woman who was born among the Trāyastriṃśa gods, and I've been transformed from that woman's former form of retribution into the body of a great radiant god child.",
        "source": "T12n0346_002:0170b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母今詣於佛所，　　應當懺彼忿恚心，　佛是眾生大慈父，　　一切眾生所歸趣。』」",
        "translation": "Now, when my parents go to the Buddha, they should repent of their anger; the Buddha is a great compassionate father of sentient beings, and all sentient beings go to him.'\"",
        "source": "T12n0346_002:0170b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母聞說佛聲已，　　即起廣大增勝心，　爾時父母承佛力，　　應聲即詣於佛所。",
        "translation": "After their parents heard the Buddha's voice, they immediately arouse a vast and superior resolve, and then, responding to the Buddha's voice, their parents went to the Buddha.",
        "source": "T12n0346_002:0170b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　到已頭面禮佛足，　　懺悔先起忿恚心，　白言：「我今歸依佛。」",
        "translation": "When they arrived, they bowed their heads to the Buddha's feet, repented of their anger, and said, \"Now, I take refuge in the Buddha.\"",
        "source": "T12n0346_002:0170b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　合掌又復伸問言：「佛、法、僧寶最尊勝，　　當云何作供養事？",
        "translation": "Clasping his hands, he also extended the question, \"Most honored are the buddhas, Dharma, and saṃgha treasures; how should I make offerings?",
        "source": "T12n0346_002:0170b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯佛能知我心意，　　如我所問願佛說。」",
        "translation": "Only the Buddha can know my thoughts, and as I've asked, I hope he'll tell them.\"",
        "source": "T12n0346_002:0170b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　發是言已諦誠住，　　一心渴仰而聽受。",
        "translation": "Truly abiding in sincerity after saying this, he wholeheartedly desired and listened to it.",
        "source": "T12n0346_002:0170b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛告上財父母言：　　「汝今諦聽我所說，　若欲供養諸佛者，　　應當發起菩提心。",
        "translation": "The Buddha addressed Shangcai's parents, \"Now, listen closely to what I've told you, for those who want to make offerings to the buddhas should arouse the mind of enlightenment.",
        "source": "T12n0346_002:0170c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當知汝女上財者，　　五百生中種善根，　今轉女身為天子，　　為汝父母善開導。」",
        "translation": "You should know that your daughter Shangcai, who has cultivated good roots in five hundred lifetimes, has now been transformed from a daughter's body into a son of gods to guide your parents well.\"",
        "source": "T12n0346_002:0170c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母聞佛如是語，　　即發無上菩提心，　歡喜稱讚作是言：　　「人中大仙如實語。」",
        "translation": "When the parents heard the Buddha say this, they immediately aroused the mind of unsurpassed enlightenment, rejoiced, and praised him, saying, \"The great man among men has spoken truly.\"",
        "source": "T12n0346_002:0170c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時佛告阿難言：　　「汝今證知如是事，　菩薩方便不思議，　　於染心中得淨報。",
        "translation": "It was then that the Buddha addressed Ānanda, \"Now that you've realized such a thing, the bodhisattva's skillful means are inconceivable, and the result can be purified in a defiled mind.",
        "source": "T12n0346_002:0170c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如上財女所轉相，　　一切眾生亦如是，　阿難！",
        "translation": "Just as the wealthy woman above shows, so do all sentient beings, Ānanda!",
        "source": "T12n0346_002:0170c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勝功德，　　能令眾生皆離苦。",
        "translation": "Such excellent qualities free all sentient beings from suffering.",
        "source": "T12n0346_002:0170c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今此天子勝福報，　　於染愛心常清淨，　而能恭敬佛世尊，　　尊重無上菩提故。",
        "translation": "Now, this celestial is so rewarded with excellent fortune that he's always pure in mind from defiled love, and he's able to revere the Bhagavān because he respects unsurpassed bodhi.",
        "source": "T12n0346_002:0170c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多劫已曾供養佛，　　於諸佛所種善根，　堅固安住菩提心，　　決定當得菩提果。」",
        "translation": "He has made offerings to the Buddha for many eons, planted good roots in the buddhas, resolutely abides in the mind of enlightenment, and is certain to attain the fruit of enlightenment in the future.\"",
        "source": "T12n0346_002:0170c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，尊者阿難白佛言：「世尊！",
        "translation": "It was then that Venerable Ānanda said to the Buddha, \"Bhagavān!",
        "source": "T12n0346_002:0170c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我意者，譬如須彌山王眾寶所成，雖種種寶有種種色，彼黃金色而為最上。",
        "translation": "\"As I intended, it's like Mount Sumeru, which is made of many treasures, and although there are various kinds of treasures with various colors, that golden color is the highest.",
        "source": "T12n0346_002:0170c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，若清淨心、若染污心、若住法心、若隱法心，雖種種心如是差別，彼一切智心而為最上。",
        "translation": "So it is with the bodhisattva Mahāsattva, whether it's a pure mind, a defiled mind, a mind that abides in the Dharma, or a mind that hides the Dharma, even though there are various kinds of minds with various distinctions, that omniscient mind is the highest.",
        "source": "T12n0346_002:0170c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0170c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩最初安住一切智心，於諸染法悉能清淨。",
        "translation": "When bodhisattvas, mahāsattvas, and bodhisattvas first abide in the mind of omniscience, they're all able to purify defiled dharmas.",
        "source": "T12n0346_002:0170c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如有藥名曰善現，能治世間一切病苦。",
        "translation": "It's also like a medicine called \"well-presented,\" which can cure all the world's illnesses and sufferings.",
        "source": "T12n0346_002:0170c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，住一切智心已，能斷除貪、瞋、癡等諸煩惱病。」",
        "translation": "So it is with the bodhisattvas, Mahāsattvas, who, after abiding in the mind of omniscience, are able to eliminate the afflictive illnesses of greed, anger, and delusion.\"",
        "source": "T12n0346_002:0170c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚尊者阿難言：「善哉，阿難！",
        "translation": "At that point, the Bhagavān praised Venerable Ānanda, saying, \"Good, Ānanda!",
        "source": "T12n0346_002:0170c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說，如是如是。」",
        "translation": "As you say, so it is and so it is.\"",
        "source": "T12n0346_002:0170c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，尊者大迦葉前白佛言：「希有，世尊！",
        "translation": "It was then that the Venerable Mahākāśyapa went forward and said to the Buddha, \"Rarely, Bhagavān!",
        "source": "T12n0346_002:0170c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩能行最上寂靜之行，能於一切眾生起悲愍心，常所利益。",
        "translation": "A bodhisattva-mahāsattva can practice the supreme practice of tranquility, arouse compassion for all sentient beings, and always act for their benefit.",
        "source": "T12n0346_002:0170c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復能修空、無相、無願解脫法門，不樂聲聞、緣覺之法，於一切處不離一切智心，具不可思議善巧方便。",
        "translation": "They also cultivate the liberating dharma-gate of emptiness, signlessness, and wishlessness, dislike the teachings of śrāvakas and pratyekbuddhas, and don't part with the mind of omniscience in all places with unfathomably skillful means.",
        "source": "T12n0346_002:0170c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩一切所行無著、無礙，於色、聲、香、味、觸境中行而不取、亦無起作。",
        "translation": "\"All the things that bodhisattvas and mahāsattvas do are unattached and unimpeded, and they act in response to form, sound, odor, taste, and tactile objects without grasping or initiating actions.",
        "source": "T12n0346_002:0171a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今樂說譬喻明菩薩行，願佛世尊聽許我說。」",
        "translation": "Now, I'd like to explain the bodhisattva's practice in parables, if the Bhagavān would listen and allow me to do so.\"",
        "source": "T12n0346_002:0171a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大迦葉！",
        "translation": "The Buddha said, \"Mahākāśyapa!",
        "source": "T12n0346_002:0171a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂說當說，今正是時。」",
        "translation": "It's the right time to say what you're comfortable saying.\"",
        "source": "T12n0346_002:0171a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大迦葉言：「世尊！",
        "translation": "Mahākāśyapa said, \"Bhagavān!",
        "source": "T12n0346_002:0171a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間有無數百千人眾，於其曠野險難之處見有一門，而彼人眾爾時各各從其門入。",
        "translation": "It's like a world in which there are countless hundreds of thousands of people who see a gate in a place that's vast and difficult, and each of those people then enters through that gate.",
        "source": "T12n0346_002:0171a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過是門已，次見道路，其路懸曠，險惡多難。",
        "translation": "After passing through that gate, they next see a road that's overhung, difficult, and harsh.",
        "source": "T12n0346_002:0171a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸人眾見是路已，咸生怖畏。",
        "translation": "Seeing that path, the people there became frightened.",
        "source": "T12n0346_002:0171a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，有一智人具善方便，欲為多人利益安樂，即告眾言：『汝等當知，去此不遠有一大城。",
        "translation": "Then, a wise man with skillful means who wanted to bring benefit and comfort to many people addressed the crowd, saying, 'You should know that there's a large city not far from here.",
        "source": "T12n0346_002:0171a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城廣闊，嚴麗清淨；人民熾盛，安隱豐饒。",
        "translation": "It's a vast, beautiful, and pure city, and its people are prosperous and abundant in comfort.",
        "source": "T12n0346_002:0171a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入彼城者，適悅快樂。",
        "translation": "Those who enter that city will be delighted and happy.",
        "source": "T12n0346_002:0171a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當愛樂入其城中，即能遠離險難怖畏。』",
        "translation": "Whoever enters that city with joy and pleasure will be freed from danger and fear.'",
        "source": "T12n0346_002:0171a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼眾中有一類人聞是語已，即時發言：『我今樂入。』",
        "translation": "When one of those people heard those words, he immediately said, 'Now, I'm happy to enter.'",
        "source": "T12n0346_002:0171a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入是城已，見其豐饒、安隱、快樂，生希有想，愛著不捨，即於彼住不復樂出。",
        "translation": "After entering that city, they see its abundance, comfort, and happiness, become attached to it with rarefied thoughts, and don't abandon them, so they stay there and aren't glad to leave.",
        "source": "T12n0346_002:0171a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一類人聞說其城，即時發言：『我亦隨順入彼城中。』",
        "translation": "When a certain kind of person hears about that city, they immediately say, 'I'll also go along with it and enter it.'",
        "source": "T12n0346_002:0171a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人雖入，不樂彼住，後復還出。",
        "translation": "Even though this person entered, he didn't enjoy staying there and then returned out.",
        "source": "T12n0346_002:0171a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復眾中有一類人雖聞是語，不能前詣入彼城中。",
        "translation": "Again, there's a certain kind of person among the others who hears this talk but can't go forward and enter that city.",
        "source": "T12n0346_002:0171a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0346_002:0171a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有智人過此城已，又復行於曠野險路。",
        "translation": "After passing through this city, that wise man again travels on a dangerous path through a wilderness.",
        "source": "T12n0346_002:0171a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出是路已，見一道徑，其徑狹小，可一尺量。",
        "translation": "After leaving that path, he sees a path that's so small it can be measured in a foot.",
        "source": "T12n0346_002:0171a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "徑之左面有一大坑深百千肘、徑之右面復一大坑深百千肘，若或有人墮是坑者不能出離。",
        "translation": "On the left side of that path there's a large pit a hundred thousand elbows deep, and on the right side of that path there's another large pit a hundred thousand elbows deep, so if someone were to fall into that pit, they wouldn't be able to escape.",
        "source": "T12n0346_002:0171a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼徑四向，有一類人發是聲言：『我於此處生大怖畏。』",
        "translation": "In the four directions of that path, a certain kind of person makes this noise, saying, 'Here, I've become very afraid.'",
        "source": "T12n0346_002:0171a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復去彼狹徑不遠有四衢道，一類人眾遊履其道，隨其所向彼彼皆能見有大城；如如所見，彼彼隨應而生愛樂。",
        "translation": "Again, not far from that narrow path there are four thoroughfares, and a certain kind of person wandering along them can see, following where they're headed, that there's a large city; thus they see it, and they become delighted with it accordingly.",
        "source": "T12n0346_002:0171a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼智人見是狹徑已，即行其徑到安隱處。",
        "translation": "Seeing this narrow path, that wise man then travels down it and arrives at a place of comfort.",
        "source": "T12n0346_002:0171a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0346_002:0171a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間無數百千人者，當知即是諸愚異生。",
        "translation": "\"Countless hundreds of thousands of people in the world should be known to be foolish unenlightened sentient beings.",
        "source": "T12n0346_002:0171a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一門者，當知即是取一有身；彼曠野險難中見道路者，當知即是生死險難之路；其路懸曠者，當知即是無明、有、愛，為因受果極懸遠故。",
        "translation": "\"Someone who has one gate should know that it's the appropriation of a single existent body; someone who sees the path in the wilderness and difficulty should know that it's the difficult path of birth-and-death; and someone whose path is vast should know that it's ignorance, existence, and craving, which cause and receive the results in great remoteness.",
        "source": "T12n0346_002:0171b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有智人能唱導者，當知即是具善巧方便菩薩摩訶薩；彼大城者，即是二乘所證涅盤。",
        "translation": "He who has wisdom and is able to preach and guide should be known to be a bodhisattva-mahāsattva with skillful means, and that great city should be known to be the nirvāṇa realized by the two vehicles.",
        "source": "T12n0346_002:0171b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一類人入彼大城愛樂安住、不求出者，當知即是聲聞、緣覺，下劣信解，生止息想；彼一類人亦欲隨順入其城中，不樂安住、後還出者，當知即是餘諸菩薩，成就最上信解心故；彼一類人雖聞是語不能前詣入其城者，當知即是少福、無智、諸外道輩。",
        "translation": "If there's a certain kind of person who enters that great city and loves to stay there but doesn't seek to escape, they should know that they're a direct disciple or a pratyekabuddha with low confidence and a perception of calm; if there's a certain kind of person who wants to follow them into the city but doesn't enjoy staying there and then goes back out, they should know that they're one of the other bodhisattvas who have achieved the highest level of confidence; if there's a certain kind of person who hears those words but can't go forward and enter the city, they should know that they're a less fortunate, unwise, group of non-Buddhists.",
        "source": "T12n0346_002:0171b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有智人過此城已又復出彼曠野路者，當知即是具善巧方便菩薩摩訶薩精進波羅蜜多故。",
        "translation": "That person with wisdom who has crossed this city and then goes out onto that wilderness road should be known as a bodhisattva with skillful means who has perfected the perfection of effort.",
        "source": "T12n0346_002:0171b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一尺量狹徑路者，當知即是最上法界；左面坑者，當知即是彼聲聞地；右面坑者，當知即是彼緣覺地。",
        "translation": "That one-foot narrow path should be known as the supreme Dharma realm, that pit on the left should be known as the stage of the śrāvakas, and that pit on the right should be known as the stage of the pratyekabuddhas.",
        "source": "T12n0346_002:0171b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼徑四面有一類人發怖畏聲者，當知即是諸天魔王及魔眷屬；彼四衢道者，即是四攝法門。",
        "translation": "The one on the four sides of that path who makes a frightening noise should be known to be the gods, Māra Kings, and Māra's followers, and the one on the four roads should be known to be the four methods for collecting dharmas.",
        "source": "T12n0346_002:0171b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所向彼彼皆能見大城者，當知即是彼二乘人，隨其所應見佛功德、見佛所行及佛智慧，生愛樂故；時彼智人到安隱處者，當知即是到一切智地。",
        "translation": "Anyone who can see the great city from there should know that this is a two-vehicle person who takes delight in seeing the Buddha's merits, what he does, and his wisdom as they see fit; that wise person then arrives at a place of comfort should know that he's arrived at the stage of omniscience.",
        "source": "T12n0346_002:0171b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T12n0346_002:0171b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等譬喻說者，當知皆是菩薩摩訶薩善巧方便引導眾生，是為菩薩最上勝行。",
        "translation": "Such metaphors should be known as the bodhisattva Mahāsattva's skillful means of guiding sentient beings, which is the bodhisattva's most excellent practice.",
        "source": "T12n0346_002:0171b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，我於菩薩摩訶薩所應敬禮。」",
        "translation": "For this reason, I should revere the bodhisattva Mahāsattva.\"",
        "source": "T12n0346_002:0171b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚尊者大迦葉言：「善哉，善哉。",
        "translation": "It was then that the Bhagavān praised Venerable Mahākāśyapa, saying, \"Good, good!",
        "source": "T12n0346_002:0171b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝大迦葉善說此語。」",
        "translation": "You, Mahākāśyapa, are good at saying this.\"",
        "source": "T12n0346_002:0171b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當佛如是讚迦葉時，會中有萬二千眾生得天人身，皆發阿耨多羅三藐三菩提心。",
        "translation": "When the Buddha thus praised Kāśyapa, 12,000 sentient beings in the assembly attained the status of celestial beings and all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0346_002:0171b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大迦葉言：「汝今當知，菩薩摩訶薩具善巧方便者，已能成就無量功德，於一切時雖有所作，不復起彼諸不善業，於自、於他遠離過失。」",
        "translation": "The Buddha told Mahākāśyapa, \"Now, you should know that a bodhisattva equipped with skillful means has accomplished measureless merits, doesn't again generate unskillful actions despite what he does at any given time, and is free of faults for himself and for others.\"",
        "source": "T12n0346_002:0171b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，智上菩薩摩訶薩於佛會中見如是事、聞如是法，又復恭敬，前白佛言：「云何，世尊！",
        "translation": "At the time, the superior bodhisattva Mahāsattva Zhizang saw such things and heard such things in the Buddha's assembly, and he also paid respect to the Buddha and said, \"Bhagavān!",
        "source": "T12n0346_002:0171c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔為一生補處菩薩時，於彼迦葉如來法中曾作是語：『何故剃鬚髮？",
        "translation": "In the past, when I was a bodhisattva in a lifetime retreat, the Kāśyapa Tathāgata used to say, 'Why did you shave your hair?'",
        "source": "T12n0346_002:0171c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何求菩提而此菩提最上難得？』",
        "translation": "How do you seek enlightenment and how is this enlightenment most difficult to attain?'",
        "source": "T12n0346_002:0171c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔作是語當有何義？",
        "translation": "What would have been the meaning of such a statement in the past?",
        "source": "T12n0346_002:0171c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛于今為我宣說。」",
        "translation": "May the Buddha preach this for me now.\"",
        "source": "T12n0346_002:0171c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告智上菩薩摩訶薩言：「止，善男子！",
        "translation": "The Buddha addressed the superior bodhisattva Mahāsattva Zhizang, saying, \"Stop, good man!",
        "source": "T12n0346_002:0171c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿作是語。",
        "translation": "\"Don't say that.",
        "source": "T12n0346_002:0171c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知菩薩摩訶薩隨其所行、隨有所說，非無利益。",
        "translation": "You should know that it's not without benefit for a bodhisattva-mahāsattva to follow what he does and follow what he teaches.",
        "source": "T12n0346_002:0171c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0346_002:0171c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具不可思議方便菩薩見彼彼正士，隨所應住於彼彼眾生如應調伏，一切所行當知不離菩薩摩訶薩善巧方便。",
        "translation": "A bodhisattva with unfathomable skillful means sees that there's another righteous person who follows suit and abides in that other sentient being as he should, and all his actions should be known as not deviating from the bodhisattva Mahāsattva's skillful means.",
        "source": "T12n0346_002:0171c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，智上！",
        "translation": "\"Furthermore, Jñānâbhisa!",
        "source": "T12n0346_002:0171c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今為汝廣說菩薩摩訶薩善巧方便甚深正法，汝應諦聽，如善作意。",
        "translation": "Now, I will explain in detail for you the very profound right teaching of the bodhisattva Mahāsattva's skillful means, and you should listen closely and contemplate it well.",
        "source": "T12n0346_002:0171c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0346_002:0171c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我往昔為菩薩時，於燃燈佛所成就不可思議方便。",
        "translation": "\"Just like when I was a bodhisattva in the past, I accomplished unfathomable skillful means at the Burning Lamp Buddha.",
        "source": "T12n0346_002:0171c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，我於彼佛法中證得無生法忍，從是已後，我為得忍菩薩。",
        "translation": "At the time, I realized the forbearance of the nonarising of the Dharma in that Buddha's teaching, and since then, I've been a bodhisattva who has attained forbearance.",
        "source": "T12n0346_002:0171c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為菩提故轉復精進，若一劫、若百劫，未甞懈倦、未甞厭捨、未甞失念，數數來此輪迴趣中以善方便救度眾生，以自慧力隨諸所作悉得成就，於後邊際不作住想，為利眾生無有休息。",
        "translation": "I've continued to exert myself for the sake of enlightenment for an eon or a hundred eons, never becoming lazy, never becoming disillusioned, and never losing mindfulness, saving sentient beings with good methods in this transmigration for many eons, accomplishing everything I do by the power of my own wisdom, not stopping to think about the latter end, and never resting for the benefit of sentient beings.",
        "source": "T12n0346_002:0171c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0171c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0346_002:0171c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為菩薩時，為菩提故，雖入聲聞寂靜三摩地，乃至入菩薩三摩地，若身、若心無出沒想；雖得寂靜樂而不住著；雖在三摩地而精進不懈，以六波羅蜜多、四攝法門教化眾生，諸有所作未甞懈息。",
        "translation": "When I was a bodhisattva, even though I entered the śrāvaka tranquilization samādhi and even entered the bodhisattva samādhi for the sake of enlightenment, I had no thoughts of escape in body or mind; even though I attained the joy of tranquilization and didn't stop clinging, even though I was in the samādhi, I strove unremittingly to teach sentient beings using the six perfections and four methods of collecting dharmas, and I never rested from my undertakings.",
        "source": "T12n0346_002:0171c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattvas, the great beings.",
        "source": "T12n0346_002:0171c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T12n0346_002:0171c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為菩薩時——已得一生補處，將欲成道轉大法輪——即於兜率天宮如實觀察：『我今為當於此天中成等正覺轉法輪耶？",
        "translation": "When I was a bodhisattva - having attained the abode of the once-returner and about to achieve the path and turn the great wheel of the Dharma - I was in the palace of Tuṣita Heaven and truly observed, 'Now, will I become perfectly enlightened and turn the wheel of the Dharma in this heaven?'",
        "source": "T12n0346_002:0171c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為人間耶？』",
        "translation": "for the sake of the human race?'",
        "source": "T12n0346_002:0172a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀察，又復思惟：『我若即於天中作此利者，閻浮提人不得聞法；若於閻浮提中作此利者，而此諸天不得聞法。",
        "translation": "After thus observing this, he also thought, 'If I were to do this for the benefit of the gods, the people of Jambudvīpa wouldn't be able to hear the Dharma, and if I were to do this for the benefit of Jambudvīpa, the gods wouldn't be able to hear the Dharma.",
        "source": "T12n0346_002:0172a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今隨其所宜，但應下降閻浮提中成等正覺，而此諸天亦可利益。』",
        "translation": "Now, as is appropriate, I should simply descend into Jambudvīpa and become perfectly enlightened, and the gods would then be able to benefit from it.'",
        "source": "T12n0346_002:0172a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復菩薩思惟觀察：『我若從此兜率天宮沒已下生人間，不入胎藏現受生相，於須臾間便成正覺者，彼閻浮提所有眾生當起疑念：「此釋迦菩薩從何所來？",
        "translation": "Again, the bodhisattva reflects and observes, 'If I were to descend from this palace in Tuṣita Heaven to be born among humans, not enter the womb and appear to be born, and then become perfectly enlightened in a moment's time, all the sentient beings in Yambudvīpa would wonder, 'Where did this Śākyamuni bodhisattva come from?'",
        "source": "T12n0346_002:0172a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天中來耶？",
        "translation": "Is it from within the heavens?",
        "source": "T12n0346_002:0172a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乾闥婆中來耶？",
        "translation": "Have you come from among the gandharvas?",
        "source": "T12n0346_002:0172a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "變化來耶？」』",
        "translation": "What about the 'coming of the transformation?'",
        "source": "T12n0346_002:0172a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，從天中沒，下降閻浮，隨順世間，入母胎藏。",
        "translation": "For this reason, he sinks out of the sky, descends into Jambudvīpa, follows the world, and enters his mother's womb.",
        "source": "T12n0346_002:0172a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattvas, the great mahāsattvas.",
        "source": "T12n0346_002:0172a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T12n0346_002:0172a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩雖住胎藏，世間眾生不應於此作實住想。",
        "translation": "Although bodhisattvas abide in the womb, sentient beings in the world shouldn't conceptualize their true abiding here.",
        "source": "T12n0346_002:0172a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0346_002:0172a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩本從無垢寂靜三摩地安詳而起。",
        "translation": "\"The bodhisattva originally rose serenely from the samādhi of undefiled tranquility.",
        "source": "T12n0346_002:0172a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從天中沒、下降人間、處胎受生、出家苦行，乃至坐菩提場成等正覺、降伏魔眾、轉大法輪，如是一切所作，菩薩於中清淨、無染，無動、無轉，不出、不沒。",
        "translation": "From his descent from among the gods, his descent to the human realm, his birth in the womb, his leaving home and ascetic practices, up to his sitting in the site of enlightenment and becoming perfectly enlightened, subduing Māra, and turning the great wheel of the Dharma, the bodhisattva is pure and undefiled in all these undertakings, unmoving and uninclined, and neither emerging nor sinking.",
        "source": "T12n0346_002:0172a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，應知清淨行菩薩不實住胎藏，當知此是菩薩摩訶薩善巧方便。",
        "translation": "Because of this, you should know that the bodhisattva of pure practices doesn't really abide in the womb, and you should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0172a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣菩薩但現胎生、不現餘生耶？",
        "translation": "\"What further reason does a bodhisattva only manifest birth in the womb and not other births?",
        "source": "T12n0346_002:0172a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：菩薩於一切眾生中最上、最勝，是潔白分，純一無雜。",
        "translation": "It means that the bodhisattva is the highest and most superior of all sentient beings, pure and white, and unadulterated.",
        "source": "T12n0346_002:0172a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是相現處胎生，當知此是菩薩摩訶薩善巧方便。",
        "translation": "To be present in the womb in this way should be known as the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0172a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復菩薩初入母胎其相云何？",
        "translation": "\"Again, what's the appearance of the bodhisattva when he first enters his mother's womb?",
        "source": "T12n0346_002:0172a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：菩薩入母胎時內外清淨，安隱無難，不苦、不惱。",
        "translation": "\"It means that when a bodhisattva enters his mother's womb, he's pure inside and out, peaceful and without difficulty, and not suffering or distressing.",
        "source": "T12n0346_002:0172a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如昔天中所受快樂，菩薩入母胎時樂受相應亦復如是，不同世人攬彼父母羯邏藍等穢污不淨為入胎相。",
        "translation": "Just as it was pleasant in the heavens in the past, it's likewise pleasant for a bodhisattva to experience when he enters his mother's womb, unlike the defiled and impure worldly view of his parents' kalala as a sign of entering the womb.",
        "source": "T12n0346_002:0172a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣菩薩於母胎中住滿十月，不增減耶？",
        "translation": "\"What further reason would there be for a bodhisattva to remain in his mother's womb for 10 months without increasing or decreasing?",
        "source": "T12n0346_002:0172b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：菩薩不同世人住母胎藏日月數量有增、有減，以增、減故，胎藏不圓，諸根缺減。",
        "translation": "It means that unlike people who live in their mother's womb, the number of suns and moons increases and decreases, and because of that increase or decrease, the womb is not complete and the faculties are deficient.",
        "source": "T12n0346_002:0172b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，菩薩滿足十月，胎藏圓滿，諸根具足，無所增減。",
        "translation": "Therefore, when a bodhisattva fulfills the tenth month, his womb is full, and his faculties are complete, with nothing increasing or decreasing.",
        "source": "T12n0346_002:0172b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattva-mahāsattva.",
        "source": "T12n0346_002:0172b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣菩薩不樂宮殿而返於其園林中生？",
        "translation": "\"What further reason would a bodhisattva not enjoy the palace and return to be born in its garden?",
        "source": "T12n0346_002:0172b06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：菩薩於其長時遠離憒閙，樂寂靜處，修寂靜行，有諸天、龍、夜叉、乾闥婆等常所衛護。",
        "translation": "\"It means that for a long time, the bodhisattva was free of commotion, enjoyed a quiet place, and cultivated quiet practices that were constantly guarded by gods, dragons, yakṣas, and gandharvas.",
        "source": "T12n0346_002:0172b07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩欲令迦毘羅城一切人民以諸香華隨喜供養，各得瞻覩。",
        "translation": "The bodhisattva wants to cause all the people of Kapilavastu to offer up flowers and incense as tokens of joy and to see each other.",
        "source": "T12n0346_002:0172b09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，菩薩於其園林中生。",
        "translation": "It was for this reason that the bodhisattva was born in that grove.",
        "source": "T12n0346_002:0172b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣菩薩之母攀其樹枝生菩薩耶？",
        "translation": "\"What further reason did the bodhisattva's mother climb the branches of that tree to give birth to the bodhisattva?",
        "source": "T12n0346_002:0172b11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：菩薩母不同世間所有母人，當產生時苦受相應，得大苦惱。",
        "translation": "That is, a bodhisattva's mother is unlike any mother in the world, and when she's produced, it's associated with painful feelings and results in great suffering and distress.",
        "source": "T12n0346_002:0172b12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩耶夫人生菩薩時樂受相應，得大快樂。",
        "translation": "When the Māyā woman gives birth to a bodhisattva, it's associated with pleasant feelings and results in great happiness.",
        "source": "T12n0346_002:0172b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，菩薩之母攀彼樹枝而生菩薩。",
        "translation": "Because of these causes and conditions, the bodhisattva's mother climbs on that tree's branch and gives birth to the bodhisattva.",
        "source": "T12n0346_002:0172b14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣菩薩於母胎中能念能知彼三世事，乃至菩薩入胎、住胎等事悉能知耶？",
        "translation": "\"What further reason is there for a bodhisattva to be mindful and able to know the events of the three worlds while in his mother's womb, even to the point where he's able to know everything about the bodhisattva's entry into and stay in the womb?",
        "source": "T12n0346_002:0172b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：清淨行菩薩於三界中最上、最勝，正念現前，於一切法無所忘失。",
        "translation": "It means that the bodhisattva of pure practices is the most superior and most outstanding in the three realms, and when right mindfulness is present, he doesn't lose sight of any dharmas.",
        "source": "T12n0346_002:0172b17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，菩薩雖住胎中能念能知彼一切事。",
        "translation": "Therefore, even though the bodhisattva lives in the womb, he's mindful and able to know all of those things.",
        "source": "T12n0346_002:0172b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣菩薩生時唯帝釋天主而來衛護？",
        "translation": "\"What further reason is there that only Indra the goddess comes to guard the bodhisattva when he's born?",
        "source": "T12n0346_002:0172b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩生已即為捧接，爾時無復餘天人耶？",
        "translation": "After the bodhisattva is born, he is then held up to them, and at that point there are no other gods or humans?",
        "source": "T12n0346_002:0172b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：帝釋天主先發大願：『菩薩生時為作守護。』",
        "translation": "That is, Indra the god first made a great vow, 'When the bodhisattva is born, I want you to guard him.'",
        "source": "T12n0346_002:0172b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以彼往昔善根力故，是故菩薩生時唯帝釋天主而來衛護。",
        "translation": "Because of the power of their good roots in the past, only Indra the goddess comes to guard the bodhisattva when he's born.",
        "source": "T12n0346_002:0172b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣菩薩生已即於四方各行七步，不減至六、不增八耶？",
        "translation": "\"What further reason would there be for a bodhisattva to take seven steps in each direction after birth and not decrease to six or increase by eight?",
        "source": "T12n0346_002:0172b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：菩薩正士神通變化隨宜方便，其相如是，由此因緣但行七步，無所增減。",
        "translation": "It means that a bodhisattva's correct person's supernormal abilities change according to appropriate skillful means, and their appearance is thus such that, for this reason, he simply takes seven steps, without any increase or decrease.",
        "source": "T12n0346_002:0172b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復何緣行七步已即發是言：『我於世間最尊、最勝，已能解脫老、病、死法。』",
        "translation": "\"What other reason is there that after taking seven steps, he says, 'I'm the most honored and superior in the world, and I've been able to liberate myself from old age, illness, and death.'",
        "source": "T12n0346_002:0172b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此梵界諸天子眾聞菩薩生悉來瞻禮，各各隨應得其利益。",
        "translation": "It means that this multitude of gods and goddesses in the Brahma realm who hear about the bodhisattva's birth all come to venerate him, each reaping their own benefits as they see fit.",
        "source": "T12n0346_002:0172b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時即自思惟：『但此梵界諸天子眾得知是事，我今欲令一切普得聞知。』",
        "translation": "The bodhisattva then thought to himself, 'But this is something known to the children of Brahmā, and now I want to make sure that it's heard by all of them.'",
        "source": "T12n0346_002:0172c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，乃發聲言：『我於世間最尊、最勝，已能解脫老、病、死法。』",
        "translation": "After this thought, he then vocalized, 'I'm the most honored and most superior in the world, and I'm already liberated from the law of old age, illness, and death.'",
        "source": "T12n0346_002:0172c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發是言時，所有三千大千世界諸天子眾及諸梵眾聞是聲已，於須臾間一切皆來至菩薩所，合掌恭敬，隨喜稱讚。",
        "translation": "When they said this, all the thousands of gods and priests in the world who heard that sound came to the bodhisattva in a moment's time, put their hands together in respect, and praised him joyfully.",
        "source": "T12n0346_002:0172c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，乃唱是言：『我於世間最尊、最勝。』",
        "translation": "Because of this, they then said, 'I'm the most honored and most excellent in the world.'",
        "source": "T12n0346_002:0172c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說大方廣善巧方便經卷第二",
        "translation": "Foshuo dafang guang shanqiao fangbian jing, vol. 2",
        "source": "T12n0346_002:0172c09_0",
        "is_bad_quality": false
    }
]