[
    {
        "source_sentence": "菩薩處胎經卷第二",
        "translation": "Sutra on the Handling of the Womb by Bodhisattvas, Volume 2",
        "source": "T12n0384_002:1021a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian Translation",
        "source": "T12n0384_002:1021a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎佛樹品第四",
        "translation": "The Fourth Chapter of the Buddha-Tree",
        "source": "T12n0384_002:1021a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊將欲入無餘涅槃界，集諸神通大德菩薩，神足變化說不思議法。",
        "translation": "At the time, the Bhagavān was about to enter the state of nirvāṇa without remainder when he gathered the bodhisattvas of great virtue and supernormal powers to teach the inconceivable Dharma in a transformative way.",
        "source": "T12n0384_002:1021a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「今我寧可化作七寶樹，度此長流永在生死沒溺者，令得解脫。」",
        "translation": "\"Now, I'd rather turn myself into a seven-jewel tree to save those whose long streams are forever submerged in birth-and-death and make them attain liberation.\"",
        "source": "T12n0384_002:1021a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即入琉璃定無形三昧，東方去此忍界六十四億恒河沙剎，化作七寶樹遍滿其中，諸寶樹上莖、節、柯、枝、葉、果實，各各有七寶宮殿，宮殿有佛，諸佛各說四非常法。",
        "translation": "He then entered the lapis lazuli concentration and formless concentration, and 6.4 billion rhesus sand bases in the eastern part of the forbearance realm were transformed into seven-jeweled trees that filled them with stems, knots, branches, leaves, and fruits, each with a palace of seven jewels, and in the palace were buddhas, each of whom taught the four extraordinary things.",
        "source": "T12n0384_002:1021a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後園浴池眾鳥聚集，娛樂其中快樂難勝。",
        "translation": "In the back garden, the bathing pond is filled with birds that gather there to enjoy themselves and have fun.",
        "source": "T12n0384_002:1021a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其池水中生優鉢蓮華、須乾提花、末乾提花；於彼陸地生瞻蔔花、須曼羅花，牛頭栴檀、搗香、末香，天繒、幡蓋、懸處虛空。",
        "translation": "From the water of that pond there grows the Upāli lotus, the saugandhika flower, and the marquandhika flower; on the land there grows the campaka flower and the sumac flower, oxhead sandalwood, pounded incense, and powdered incense, and a sky with silks and banners suspended in the sky.",
        "source": "T12n0384_002:1021a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，風神王名曰隨意，放大香風吹七寶樹葉，柔軟香熏枝葉相掁，皆出自然八種音響。",
        "translation": "At the time, the wind god king named Sui Yi magnified the fragrant wind and blew the leaves of seven precious trees, perfuming their branches and leaves with a soft fragrance, each producing a natural sound of eight kinds of music.",
        "source": "T12n0384_002:1021a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善哉！",
        "translation": "\"Good!",
        "source": "T12n0384_002:1021a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出大光明，如來八種音聲，將欲度未度者。",
        "translation": "A great radiance arises, and the Tathāgata makes eight kinds of sounds, intending to save those who have yet to be saved.",
        "source": "T12n0384_002:1021a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰現是瑞應，昔我不聞此亦復不現覩見，起滅無常相，將非幻化耶？」",
        "translation": "Who is it that shows this auspicious response, that I didn't hear in the past, that I don't see in the present, that the characteristic of impermanence of arising and ceasing is not illusory?\"",
        "source": "T12n0384_002:1021a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時樹葉上七寶宮殿中，諸如來、至真、等正覺發大音聲闡揚不思議難有之法，欲說八地中莊嚴諸佛剎。",
        "translation": "It was then that in a palace of seven jewels on a leafy hill, the tathāgatas, the supreme truths, and the perfectly enlightened ones made a great noise and explained a teaching that was inconceivable and difficult to find, intending to explain the eight stages in which the buddhas are adorned.",
        "source": "T12n0384_002:1021a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「猶如有人欲覩大海水，去海百由旬不見諸生木，遇見澇水甞之知海尚遠；即自辦入海之具，不見形相念定如空始至海岸，以無畏心自莊嚴身。",
        "translation": "\"They're like a person who wants to see the ocean water but doesn't see any growing trees a hundred leagues from the ocean and then meets a man who tastes the water and knows the ocean is still far away; they prepare themselves to enter the ocean, don't see form and shape, are mindful of concentration like space, and then reach the shore, and they adorn themselves with a fearless mind.",
        "source": "T12n0384_002:1021a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『善哉！",
        "translation": "'Good!'",
        "source": "T12n0384_002:1021b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖！",
        "translation": "A great sage!",
        "source": "T12n0384_002:1021b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我所求者今乃獲之。』",
        "translation": "Now I've obtained what I sought.'",
        "source": "T12n0384_002:1021b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欣之樂之心無疲惓，即時捨所資生盡入海中，隨本所願皆悉在前。",
        "translation": "Delighting in it, his mind isn't weary, and he immediately ends up in the ocean after disposing of the births he's accumulated, where all his former desires are present.",
        "source": "T12n0384_002:1021b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，能斷一住至六住地，盡眾生結使永盡無餘。",
        "translation": "In the same way, the bodhisattva Mahāsattva can end the bonds of sentient beings from the first abode to the sixth abode, and those bonds are permanently ended without remainder.",
        "source": "T12n0384_002:1021b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『今我成佛必然不疑。』",
        "translation": "'Now, there's no doubt that I'll become a buddha.'",
        "source": "T12n0384_002:1021b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩於胎中莊嚴佛樹。",
        "translation": "This is called the bodhisattva Mahāsattva adorning the Buddha-tree while still in the womb.",
        "source": "T12n0384_002:1021b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩欲自莊嚴身相，具足三十二大人之相，為真實不？",
        "translation": "\"Furthermore, is it true that the bodhisattva Mahāsattva wants to adorn his own body with the full range of the thirty-two major characteristics of a great person?",
        "source": "T12n0384_002:1021b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從頂至足，足有千輪，輪有千輻，輻有千相，相有六度無極。",
        "translation": "From the top of the head to the feet, there are a thousand wheels, a thousand spokes, a thousand spokes, and a thousand marks, and the marks have the limitless six perfections.",
        "source": "T12n0384_002:1021b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所成無見頂相者，破憍慢山得成肉髻相。",
        "translation": "\"He attains the mark of the invisible crown, and he breaks through the mountain of conceit to attain the mark of a kambala.",
        "source": "T12n0384_002:1021b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫得不犯婬欲果報，得陰馬藏相。",
        "translation": "\"From countless incalculably long eons, I've attained the fruit of not transgressing sexual desires and attained the shape of a steeplechase.",
        "source": "T12n0384_002:1021b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陰馬藏相者壞彼邪見，放相光明遍滿十方恒河沙剎，一一光明皆有化佛，一一化佛皆坐七寶高座，發大音聲演說六度無極，如諸如來常所說法：苦、集、滅、道，施、戒、忍、精進、禪、般若波羅蜜，善巧方便解了諸法，空空、大空、無量空、內空、外空、最空、行空、相空、報空、滅三災空、三明報空、三慧空、三達空、三等空、三世空、三分法身空、三界寂滅空、過去當來現在空、自相空，是謂菩薩摩訶薩不犯婬報相。",
        "translation": "陰馬藏相者壞彼邪見，放相光明遍滿十方恒河沙剎，一一光明皆有化佛，一一化佛皆坐七寶高座，發大音聲演說六度無極，如諸如來常所說法：苦、集、滅、道，施、戒、忍、精進、禪、般若波羅蜜，善巧方便解了諸法，空空、大空、無量空、內空、外空、最空、行空、相空、報空、滅三災空、三明報空、三慧空、三達空、三等空、三世空、三分法身空、三界寂滅空、過去當來現在空、自相空，是謂菩薩摩訶薩不犯婬報相。",
        "source": "T12n0384_002:1021b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從阿僧祇劫常修口淨，不從彼聞此說，不從此聞彼說，得廣長舌相。",
        "translation": "\"Since incalculably long eons, I've always cultivated the purity of my mouth, not hearing this from others or that from here, and I've attained the characteristic of a broad and long tongue.",
        "source": "T12n0384_002:1021b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遍滿十方阿僧祇恒河沙剎，放舌相光明；一一光明皆有化佛，一一化佛皆坐七寶座上，以清淨音聲演說無量口行，清淨報業真實所作，成辦四事無畏，曉了諸法無來無去，音響清淨，以度生死畏地無所罣礙，分別眾生一一音響，演說無量智慧辯才，度五道淵法法成就，以九解脫而自瓔珞，十力具足，空性無形不可沮壞，其聞法者悉皆信解，是謂菩薩摩訶薩口淨舌相果報。",
        "translation": "Every one of those lights has a transformation buddha, and every one of those transforming buddhas sits on a seven-jewel throne and speaks with pure sounds about measureless verbal actions, the true workings of pure retribution, the accomplishment of four fearless tasks, the comprehension of dharmas without coming or going, and the purity of sound, which liberates sentient beings from the fearful stages of birth-and-death without impediment, discerns the internal sounds of each sentient being, speaks with measureless wisdom and eloquence, crosses over five destinies, accomplishes each dharma with nine liberations, and beams with ten powers, the emptiness of which is formless and indestructible, which all those who hear the teaching believe and understand, which is known as the fruit of the bodhisattva Mahāsattva's pure tongue.",
        "source": "T12n0384_002:1021b22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫得音響相，遍滿三千大千剎土，柔軟和雅所說不麁，出言成就不從彼受，其聲音者無不悅滿；此音響中亦有無數清淨所說，如諸如來常所說法，十二因緣癡行生死，自觀其身觀他身觀內外身，息長亦知息短亦知，化彼眾生越次取證亦不住證，發聲響相光明，一一光明皆有化佛，一一化佛皆坐七寶高座上，普與眾生說無量法門。",
        "translation": "\"From incalculably long incalculable eons, I've attained a sonorous voice that fills 3,000 great thousand buddha-lands, is gentle and elegant, isn't crude in what it says, and produces words that are accomplished and not received from others, so there's no one whose voice isn't filled with joy; in this voice there are countless pure teachings like those always given by the tathāgatas, twelve causes and conditions, delusion, birth and death, observing one's own body and observing the bodies of others, observing the internal and external bodies, knowing when one's breath is long and knowing when one's breath is short, teaching sentient beings to readily attain realization in sequence and not to stop realizing it, emitting a sound, resonating with a characteristic light, each of which has a transformation buddha, and each of which sits on a high, seven-jeweled throne and explains measureless teachings to sentient beings.",
        "source": "T12n0384_002:1021c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心趣解脫空無相願，觀了諸法悉無所有，常以四事慈、悲、喜、捨，四禪、四諦眾智法門，得總持法門、捷疾法門、應聲法門、辯才法門，無量法門常現在前；心常遊戲無量百千三昧，是謂菩薩摩訶薩音響相。",
        "translation": "He vows that his mind will proceed to liberation through emptiness and signlessness, observes that all dharmas are nonexistent, always employs the four things of kindness, pity, joy, and equanimity, the four meditation and four truths, the teachings of wisdom, the Dharma gate of mastery, the Dharma gate of swiftness, the Dharma gate of responsiveness, and the Dharma gate of eloquence, and countless other teachings are always present, and his mind always wanders through measureless hundreds of thousands of samādhis, which is called the sound signature of the bodhisattva Mahāsattva.",
        "source": "T12n0384_002:1021c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫，恒修心清淨，所念專正所行慚愧，執心一向無他異想悉無塵垢，若有人毀不生憂慼，設當稱譽不以為歡心不移易，所行堅固難動如地，從無數劫承事諸佛，與諸眾生說微妙法，所行不偽一向趣道。",
        "translation": "\"Since incalculably long incalculable eons, I've always cultivated a pure mind, been focused and correct in what I think and do, been conscientious about what I do, kept my mind focused on nothing other than conceptions, and avoided all defilement, didn't become sad if someone disparaged me, didn't take delight in praise when it came, didn't change my mind, was resolute in what I do and difficult to move like the ground, served the buddhas from incalculable eons, taught sentient beings the subtle Dharma, and was unpretentious in what I do and always headed for the path.",
        "source": "T12n0384_002:1021c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛、法、僧處輒身往化，講論無量總持法門，所謂論者，施論、戒論、生天之論，欲是不淨、涅槃是樂，引導眾生入定三昧，分別苦諦去離四縛，蠲除集法滅大分結，道除雜糅不起法忍，住不退轉得清淨觀。",
        "translation": "He readily goes to teach the buddhas, Dharma, and Saṃgha, lecturing on the innumerable summarized teachings, which are called the theory of generosity, the theory of morality, and the theory of birth in heaven, where desire is impurity and nirvāṇa is bliss, guiding sentient beings into concentration and concentration, discerning the truth of suffering and escaping the four fetters, ridding them of the great fetters of accumulation and cessation, ridding them of the contamination of things that don't arise, and abiding in nonretrogression to attain the contemplation of purity.",
        "source": "T12n0384_002:1021c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知彼眾生心之所念，隨類開化得成道果，猶如新成白[疊*毛]易染為色，自常攝心不譏彼闕，常樂閑靜不處憒閙，入比丘眾威儀具足，若入禪定係意在明，經行往來心無懈慢，於大眾中能師子吼，分別空性悉無所有，是謂菩薩摩訶薩心清淨門。",
        "translation": "Knowing what sentient beings think in their minds, they are transformed according to their type and attain the fruit of the path, just like a newly formed white [tuft of *hair] that's easily defiled into color, they always collect their thoughts and don't criticize their lack, always enjoy calm and quiet and don't get into a tizzy, enter the assembly of monks with perfect manners, enter meditation with their minds in the clear, go through the motions without laziness, and roar like a lion in the midst of the crowd, discerning that emptiness is completely absent is called the gate to the purity of the bodhisattva's mind.",
        "source": "T12n0384_002:1021c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫，修總持法門不可沮壞，聞一得百、聞百得千、聞千得萬，諸佛所說句義、字義，皆悉總持而不忘失，是謂菩薩摩訶薩成就總持法門。",
        "translation": "\"Since countless incalculable eons, I've cultivated the Dharma gate of maintaining the Dharma in a comprehensive way that's indestructible, hearing one thing and getting a hundred, hearing a hundred and getting a thousand, and hearing a thousand and getting ten thousand, and I've always maintained the meanings of the sentences and words taught by the buddhas without forgetting them, which is called the bodhisattva-mahāsattva's accomplishment of the Dharma gate of maintaining the Dharma in a comprehensive way.",
        "source": "T12n0384_002:1021c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫，常自修習無常觀行，一切諸法皆歸無常生者有滅，在在處處興隆法樂淨治佛土，所說誠諦自識宿命所經歷處，為說法化心識堅固，神足無畏不可思議，從無數劫積諸苦行，所發誓願不違本行，遊戲諸法自在無礙，是謂菩薩摩訶薩成就總持法門。",
        "translation": "\"Since incalculably long incalculable eons, I've always cultivated the practice of observing impermanence, attributing all dharmas to impermanence, producing the happiness of the Dharma everywhere, purifying the Buddha-lands, teaching the truth of my own consciousness about the places of my past lives, making my mind and consciousness resolute for the sake of teaching the Dharma, being unfathomably powerful and fearless, accumulating painful practices over countless eons, making vows that don't contradict my practice, and playing with the dharmas freely and without obstruction, which is called the bodhisattva-mahāsattva accomplishing the Dharma gate of mastery.",
        "source": "T12n0384_002:1022a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫修眼神通，遍知十方眾生之類，有應空行不應空行，有定意無定意者，有亂意無亂意者，有金剛志無金剛志者，有思惟定無思惟定者，天道、人道、餓鬼道、畜生道、地獄道，以天眼悉見悉知見。",
        "translation": "\"Throughout countless incalculable eons of cultivating the eye's power, I've pervasively known the types of sentient beings in the ten directions who have practices that should be empty and those that shouldn't be, those who have a concentrated mind and those who don't have a concentrated mind, those who have a vajra determination and those who don't have a vajra determination, those who contemplate and those who don't contemplate, and those who are in the heavenly, human, hungry ghost, animal, and hell realms, and I've seen and known them all with the divine eye.",
        "source": "T12n0384_002:1022a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此眾生趣有餘涅槃無餘涅槃者，亦知此眾生於中陰取涅槃，亦悉知之；知此眾生向須陀洹得須陀洹果，向斯陀含得斯陀含果，向阿那含得阿那含果，向阿羅漢得阿羅漢，果，向辟支佛得辟支佛果；亦觀眾生出家苦行不捨本誓，剃除鬚髮身被法服，入師子遊步三昧，在樹王下思惟觀樹，或一日、二日乃至七日；或一歲、二歲乃至七歲；或一劫、二劫乃至七劫；是謂菩薩摩訶薩成就天眼通。",
        "translation": "He also knows that this sentient being is headed for nirvāṇa with or without remainder, and he knows them all; he knows that this sentient being will attain the fruit of stream entry, the fruit of stream entry for once-returner, the fruit of non-returner for once-returner, the fruit of arhat for once-returner, the fruit of arhat for once-returner, and the fruit of pratyekabuddha for once-returner; he also knows that this sentient being renounces the ascetic practices of his family and doesn't abandon his original vows, shaves off his hair and puts on the Dharma robe, enters the lion's pace samādhi, and contemplates contemplating the tree under the king of trees, whether for one, two, or even seven days; for one, two, or even seven years; or for one, two, or even seven eons; this is called a bodhisattva who has accomplished the divine vision.",
        "source": "T12n0384_002:1022a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫修耳神通，遍聞十方眾生行報，黑有黑果報，白有白果報，不黑不白果報，有漏有漏果報，無漏無漏果報；聞彼眾生清淨音響，不男聲不女聲，不男不女柔軟聲，不長不短聲，不非人聲，梵聲清淨聲，伽羅毘羅柔和聲，不麁聲不細聲；復以天耳聞彼眾生除垢斷縛，不住有為相，不住無為相，不住過去、當來、現在相，住亦不住，不住亦不不住，吾我不住，不住亦不不住，成佛不成佛者，成道不成道者，生天不生天者，生人不生人者，生餓鬼不生餓鬼者，生地獄不生地獄者，生畜生不生畜生者，分別五道以天耳聽，悉聞知之；是謂菩薩摩訶薩成就天耳通。",
        "translation": "「吾從無數阿僧祇劫修耳神通，遍聞十方眾生行報，黑有黑果報，白有白果報，不黑不白果報，有漏有漏果報，無漏無漏果報；聞彼眾生清淨音響，不男聲不女聲，不男不女柔軟聲，不長不短聲，不非人聲，梵聲清淨聲，伽羅毘羅柔和聲，不麁聲不細聲；復以天耳聞彼眾生除垢斷縛，不住有為相，不住無為相，不住過去、當來、現在相，住亦不住，不住亦不不住，吾我不住，不住亦不不住，成佛不成佛者，成道不成道者，生天不生天者，生人不生人者，生餓鬼不生餓鬼者，生地獄不生地獄者，生畜生不生畜生者，分別五道以天耳聽，悉聞知之；是謂菩薩摩訶薩成就天耳通。",
        "source": "T12n0384_002:1022a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫修鼻神通，遍嗅十方無量眾生，悉知分別善香、惡香，麁香、細香，火香、水香，俗香、道香，乃至菩薩坐樹王下香；戒香、定香、慧香、解脫香、解脫知見香，教授眾生大慈無邊香，悲愍眾生香，喜悅和顏香，放捨周遍香，神足無畏香，覺力根本香，破慢貢高香，自然普熏香，莊嚴佛道香，趣三解脫門香，相相殊勝香，明行果報香，分別微塵香，光明遠照香，集眾和合香，五聚清淨香，持入不起香，止滅眾垢香，觀滅眾垢香，聞戒布施香，慚愧無慢香，仙人法勝香，說法無礙香，舍利流布香，封印佛藏香，七寶無盡香。」",
        "translation": "「吾從無數阿僧祇劫修鼻神通，遍嗅十方無量眾生，悉知分別善香、惡香，麁香、細香，火香、水香，俗香、道香，乃至菩薩坐樹王下香；戒香、定香、慧香、解脫香、解脫知見香，教授眾生大慈無邊香，悲愍眾生香，喜悅和顏香，放捨周遍香，神足無畏香，覺力根本香，破慢貢高香，自然普熏香，莊嚴佛道香，趣三解脫門香，相相殊勝香，明行果報香，分別微塵香，光明遠照香，集眾和合香，五聚清淨香，持入不起香，止滅眾垢香，觀滅眾垢香，聞戒布施香，慚愧無慢香，仙人法勝香，說法無礙香，舍利流布香，封印佛藏香，七寶無盡香。」",
        "source": "T12n0384_002:1022b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊便說頌曰：「摩伽山所出，　　花香及栴檀，　三界所有香，　　不如戒香勝。",
        "translation": "It was then that the Bhagavān spoke this verse, \"The fragrance of flowers and sandalwood that comes from Mount Magadha is superior to the fragrance of precepts among all the fragrances of the three realms.",
        "source": "T12n0384_002:1022b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　戒香滅眾垢，　　往來入無間；　菩薩不退轉，　　涅槃香第一。",
        "translation": "The scent of precepts extinguishes all pollution, and it enters into the interruptions of past and future; bodhisattvas don't regress, and the scent of nirvāṇa is the greatest.",
        "source": "T12n0384_002:1022b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如善射人，　　仰射於虛空；　箭勢不盡空，　　尋復墮于地；　德香遠無際，　　終不有轉還。",
        "translation": "He's like a good marksman who shoots up into the sky; his arrow's momentum doesn't end in emptiness, and he falls to the ground again; the fragrance of virtue is far off and has no limit, and there's never any turning back.",
        "source": "T12n0384_002:1022b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今說佛身香，　　戒、定、慧解度，　於億百千劫，　　不能盡佛香；　若於千萬劫，　　佛讚佛功德，　大聖不能盡，　　佛身戒德香。",
        "translation": "Now, I've described the fragrance of the Buddha's body as the liberation of morality, concentration, and wisdom, which cannot be exhausted in billions of eons; if the Buddha praises the merits of the Buddha in a thousand million eons, the great sages can't exhaust the fragrance of the Buddha's body as the scent of virtue of morality.",
        "source": "T12n0384_002:1022b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛威儀法，　　授前補處別，　口中五色香，　　上至忉利天；　還來至佛所，　　遶佛身七匝。",
        "translation": "The buddhas' manner and rules, the special place where they compensate before conferring, the five-colored fragrance in their mouths, and their ascendancy to the Heaven of Thirty-three; they come back to the Buddha and circumambulate his body seven times.",
        "source": "T12n0384_002:1022c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天散花香，　　稱歎未曾有；　定香遠流布，　　濟度阿僧祇。」",
        "translation": "The gods scatter the scent of flowers, praising it as unprecedented, and the fragrance of meditation spreads far and wide, helping to save Asaṅga.\"",
        "source": "T12n0384_002:1022c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，於彼會中十二那由他眾生，心識開悟皆悉發意，願樂欲生香積佛剎。",
        "translation": "After the Bhagavān spoke this verse, twelve sentient beings in that assembly whose minds and consciousnesses were enlightened all arouse their aspirations and wish to be born in the Buddha's fragrant buddha-stage.",
        "source": "T12n0384_002:1022c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是謂菩薩摩訶薩成就鼻通。",
        "translation": "\"This is called the bodhisattva Mahāsattva's accomplishment of the power of the nose.",
        "source": "T12n0384_002:1022c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫修口神通，言教往來終不中滯，有所言說言則有光，脣脣有光、齒齒有光、舌舌有光，如來於大眾中說甚深法，所有法者，一名、阿，阿者無，有千萬義，無有千萬義中，取一無義度無量眾生。",
        "translation": "\"Since I cultivated the supernormal power of speech for measureless incalculable eons, my words and teachings have never been obstructed, and when I speak, there's light from my words, light from my lips, light from my teeth, and light from my tongue.",
        "source": "T12n0384_002:1022c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二名、羅，羅者除垢，除垢有千萬義，千萬義中取一除垢義，除無量眾生垢。",
        "translation": "The second name is ra, which is to remove defilement, and there are a thousand meanings of removing defilement, and out of those thousand meanings, he takes one meaning of removing defilement and removes the defilement of measureless sentient beings.",
        "source": "T12n0384_002:1022c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三名、波遮，波遮名果熟，果熟有千萬義，千萬義中取一果熟義，使無量眾生皆悉果熟。",
        "translation": "The third name, poṣadha, is called fruition, which has a thousand meanings and one of the thousand meanings, which is ripening fruit so that measureless sentient beings will all ripen fruit.",
        "source": "T12n0384_002:1022c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四名、那，那者非常義，非常義有千萬義，千萬義中取一非常義，使無量眾生悉解非常義。",
        "translation": "The fourth name is na, which has a non-perfect meaning, a non-perfect meaning with a thousand different meanings, and a single non-perfect meaning among a thousand different meanings, so that measureless sentient beings will all understand the non-perfect meaning.",
        "source": "T12n0384_002:1022c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五名、茶，茶者盡無，名盡無名，言有無有、言無亦無無，無盡義有千萬義，千萬義中取一無盡義，使無量眾生得解於盡，是為茶盡義。",
        "translation": "The fifth name is tea, which has the meaning of exhaustive nonexistence, the meaning of ending nonexistence by naming, and the meaning of neither existence nor nonexistence by saying that it's existent or inexistent.",
        "source": "T12n0384_002:1022c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方無量恒河沙諸佛，受食威儀，從閻浮提上至十八天，皆見如來食。",
        "translation": "Measureless buddhas of the Ganges River in the ten directions receive the food with ceremony, and from Jambudvīpa up to the eighteen heavens, they all see the Tathāgata eating.",
        "source": "T12n0384_002:1022c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從一住至四住菩薩，見如來身琉璃咽喉，不退轉菩薩乃至九地，見健疾天子接如來食，乃至他方施行佛事，是為如來神口果報。",
        "translation": "From the first abode to the fourth abode, bodhisattvas see the Tathāgata's body with a beryl throat, and nonretrogressing bodhisattvas up to the ninth ground see a sturdy god receive food from the Tathāgata and perform Buddha-works in other directions.",
        "source": "T12n0384_002:1022c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來現食味，次第味味不動味，不哊咽不[口*尃][口*集]，世尊舉飯向口時，心念十方諸五道眾生等同此味，即如念皆悉飽滿，猶如比丘得九次第禪心軟美飽，是謂菩薩摩訶薩口通清淨。",
        "translation": "When the Bhagavān raises rice to his mouth, his mind is mindful that sentient beings in the five destinies in the ten directions are equal to this taste, and they are all filled just as they are, just like a monk who attains the nine levels of meditation and whose mind is soft and satisfying, which is called a bodhisattva-mahāsattva with purified oral abilities.",
        "source": "T12n0384_002:1022c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾昔無數阿僧祇劫修身神通，分別身中淨不淨想、不淨淨想，三十六物污露不真，髮、毛、爪、齒、骨、血、涕、淚，反復思惟；以己身法觀眾生身亦復如是。",
        "translation": "\"In the countless incalculably long eons since I cultivated the body's supernormal powers, I've discerned the perceptions of purity and impurity in my body, the thirty-six things that are defiled and untrue, and I've repeatedly reflected on my hair, fur, nails, teeth, bones, blood, tears, and runny eyes.",
        "source": "T12n0384_002:1023a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自化其身膖脹臭爛膿血流出；或復現身白骨灰色、青瘀色、燋黑色、與地同色，無量眾生見此身者，皆生苦、空、無常、無我想。",
        "translation": "He transforms his own body into a bloated, smelly, rotten, pus-filled, and bloody one, or he might show his body to be white and gray with bones, blue and bruises, scorching black, or the same color as the ground.",
        "source": "T12n0384_002:1023a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復與眾生說身業報法，此身非身何者是身？",
        "translation": "Again, he explains to sentient beings the law of the results of their actions on this body, \"What's this body and not body?",
        "source": "T12n0384_002:1023a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一分別從頭至足悉無所有，以無有身則無有識。",
        "translation": "Every single part of it, from head to toe, is completely nonexistent, and because there's no body, there's no consciousness.",
        "source": "T12n0384_002:1023a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生聞此，自思惟身穢惡不淨，猶如光音清淨天下觀閻浮提臭穢，惡氣上熏七千萬里，是以菩薩不生光音天。",
        "translation": "When sentient beings hear this, they themselves consider their bodies to be filthy and impure, just like the pure heaven of Luminous Sound observing the stench of Yambudvīpa, which smokes bad air upward for 70 million miles, so the bodhisattva isn't born in the Heaven of Luminous Sound.",
        "source": "T12n0384_002:1023a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身通菩薩入金剛三昧碎身如塵，一一塵皆作化佛，濟渡無量阿僧祇眾生之類；現身色相，身上出火身下出水，身下出火身上出水，東踊西沒西踊東沒；現如來十八神變。",
        "translation": "The bodhisattva with bodily abilities enters the vajra concentration, crushing his body like dust, and each of those dusts becomes a transformation buddha that saves measureless incalculable categories of sentient beings; he manifests the body's form, fire rises from his body, water rises from beneath his body, fire rises from beneath his body, water rises from the east and disappears from the west, and rises from the west and disappears from the east; he manifests 18 miraculous transformations of the Tathāgata.",
        "source": "T12n0384_002:1023a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生之類見如來變尋時覺悟，眾結永盡入無為道。",
        "translation": "When these sentient beings see the Tathāgata's transformations, they awaken and enter the path of nonproductivity with the permanent ending of all the bonds.",
        "source": "T12n0384_002:1023a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "微塵化佛現身教化，濟渡無量阿僧祇眾生，是為如來身密教化而不說法。",
        "translation": "The dusty transformation buddhas who manifest themselves and teach and liberate measureless sentient beings are the Tathāgatas who teach and teach in detail but don't preach.",
        "source": "T12n0384_002:1023a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫修習意識，成菩薩神通，攝意入定遊至無量諸佛剎土，猶如力人屈伸臂頃還來故處，意識菩薩亦入化生、胎生、濕生、卵生，現不思議神變教化，即於彼處成無為道。",
        "translation": "\"Since I cultivated consciousness for countless incalculable eons and became a bodhisattva with supernormal powers, I've gathered my mind into concentration and traveled to measureless buddha-lands, just like a powerful man who flexes and extends his arm before returning to his old place, and the bodhisattva of consciousness has also entered birth by transformation, birth in the womb, birth in the wet, and birth in the egg, where he now inconceivably achieves the path to nothingness by miraculous transformation.",
        "source": "T12n0384_002:1023a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意識菩薩於諸通中最上最勝，非辟支佛、阿羅漢所能思議。",
        "translation": "Among the powers of consciousness, the bodhisattva is the greatest and most excellent, beyond what a pratyekabuddha or arhat can conceive.",
        "source": "T12n0384_002:1023a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1023a26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非彼境界。」",
        "translation": "It's not that realm.\"",
        "source": "T12n0384_002:1023a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎菩薩處胎經三世等品第五爾時，坐中有菩薩名曰喜見——辯才無礙登躡十住，如來所行悉能總持——即從座起偏露右臂右膝著地，叉手合掌前白佛言：「善哉！",
        "translation": "It was then that a bodhisattva in the midst of his seat named Śivi - a bodhisattva whose eloquence was unimpeded, who had climbed into the ten abodes, and who could summarize all the tathāgatas' practices - rose from his seat, bared his right arm and knelt on his right knee, folded his palms together, and said to the Buddha, \"Good!",
        "source": "T12n0384_002:1023a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0384_002:1023b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今聞此法至未曾有，過去無數恒沙如來，有入涅槃不入涅槃。",
        "translation": "Now that I've heard this teaching, which has never existed before, there are countless Tathāgatas who entered and didn't enter nirvāṇa in the past.",
        "source": "T12n0384_002:1023b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若入涅槃，欲界眾生云何得度？",
        "translation": "If they had entered nirvāṇa, how would sentient beings in the desire realm have been saved?",
        "source": "T12n0384_002:1023b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來不入涅槃，彼諸如來住何佛界？」",
        "translation": "If the Tathāgata doesn't enter nirvāṇa, what Buddha-realm do the Tathāgatas abide in?\"",
        "source": "T12n0384_002:1023b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告喜見菩薩：「善哉，善哉！",
        "translation": "The Buddha told Pleasant View Bodhisattva, \"Good, good!",
        "source": "T12n0384_002:1023b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃能於如來前作師子吼。",
        "translation": "Then he could make a lion's roar in front of the Tathāgata.",
        "source": "T12n0384_002:1023b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen closely, listen closely!",
        "source": "T12n0384_002:1023b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T12n0384_002:1023b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今與汝一一分別說之。」",
        "translation": "Now, I'll tell you about each one of them separately.\"",
        "source": "T12n0384_002:1023b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜見對曰：「如是，世尊！",
        "translation": "He was delighted to see them and replied, \"So it is, Bhagavān!",
        "source": "T12n0384_002:1023b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T12n0384_002:1023b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「過去恒河沙諸佛世尊，名字假號不可勝記，亦如眾生生生不滅，無邊無際亦無端緒，諸佛要集心如空界，涅槃者即眾生是也。",
        "translation": "The Buddha said, \"The names of the buddhas of the Ganges who lived in the past are indescribable, just like sentient beings who are born and don't cease, have no limit, no end, and no beginning, and the essential collection of buddhas is like the realm of emptiness, which is nirvāṇa, which is sentient beings.",
        "source": "T12n0384_002:1023b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故如來不入涅槃。",
        "translation": "Therefore, the Tathāgata doesn't enter nirvāṇa.",
        "source": "T12n0384_002:1023b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1023b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾生故。」",
        "translation": "It's for the sake of sentient beings.\"",
        "source": "T12n0384_002:1023b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜見菩薩白佛言：「過去多薩阿竭、阿羅呵、三耶三佛所度眾生，有滅度無滅度耶？」",
        "translation": "The joyful-viewing bodhisattva said to the Buddha, \"Did the Tathāgata, Ārāha, and Samyak-saṃbuddhas save sentient beings in the past that were saved by them, or did they cease to exist and not cease to exist?\"",
        "source": "T12n0384_002:1023b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告喜見菩薩：「云何？",
        "translation": "The Buddha addressed the Bodhisattva Pleasant View, \"What is it?",
        "source": "T12n0384_002:1023b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜見！",
        "translation": "joyful views!",
        "source": "T12n0384_002:1023b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝從無數阿僧祇劫，承事諸佛禮事、供養、香花、幡蓋，頗見如來取般涅槃不？」",
        "translation": "Since countless incalculably long eons of serving the buddhas with worship, offerings, flowers, and banners, have you not seen the Tathāgata attain parinirvāṇa?\"",
        "source": "T12n0384_002:1023b15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「不也。」",
        "translation": "They replied, \"No.\"",
        "source": "T12n0384_002:1023b16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何？",
        "translation": "\"What's the answer?",
        "source": "T12n0384_002:1023b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜見！",
        "translation": "joyful views!",
        "source": "T12n0384_002:1023b17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我號釋迦文多薩阿竭、阿羅呵、三耶三佛陀，今處母胎，為涅槃為非涅槃？」",
        "translation": "I am called Śākyamuni, Ārāha, and Samyak-saṃbuddha, and I am now in my mother's womb; is it nirvāṇa or not?\"",
        "source": "T12n0384_002:1023b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「不也。",
        "translation": "They replied, \"No.",
        "source": "T12n0384_002:1023b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T12n0384_002:1023b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何？",
        "translation": "\"What is it?",
        "source": "T12n0384_002:1023b19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜見！",
        "translation": "joyful views!",
        "source": "T12n0384_002:1023b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩眾生受別當成無上正真道，是真實道非真實道？」",
        "translation": "Are bodhisattva sentient beings who are subject to specificity about what will become the unsurpassed true path the true path and not the true path?\"",
        "source": "T12n0384_002:1023b19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「是道非真實道若真實道。",
        "translation": "They replied, \"This path is not the true path ... it's the true path.",
        "source": "T12n0384_002:1023b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1023b21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛有說法見化眾生，以是故，是道非真實道。",
        "translation": "\"There are buddhas and teachings that see and transform sentient beings; therefore, this is the path and not the true path.",
        "source": "T12n0384_002:1023b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣緣眾生是道，緣緣盡眾生是真實道。",
        "translation": "Conditioned beings are the path, and beings whose conditions are ended are the true path.",
        "source": "T12n0384_002:1023b22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去緣緣盡眾生，於現在非真實道。",
        "translation": "The conditioned end of sentient beings in the past was not the true path in the present.",
        "source": "T12n0384_002:1023b23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在緣緣盡眾生，於過去非真實道。",
        "translation": "The present conditioned by the conditioned and exhausted sentient beings is not the true path in the past.",
        "source": "T12n0384_002:1023b24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去、現在緣緣盡眾生，於未來非真實道。",
        "translation": "The conditioned cessation of sentient beings in the past and present is not the true path in the future.",
        "source": "T12n0384_002:1023b25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來緣緣盡眾生，於過去、現在非真實道。",
        "translation": "For sentient beings whose future conditions have ended, the path was not true in the past and present.",
        "source": "T12n0384_002:1023b26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1023b27_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是道非真實道，過去緣緣盡眾生，現在緣緣盡眾生，未來緣緣盡眾生，是真實道。",
        "translation": "\"This path is not the true path; it's the true path that ended sentient beings' past conditions, ends sentient beings' present conditions, and ends sentient beings' future conditions.",
        "source": "T12n0384_002:1023b27_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩知而見之，不處不入。",
        "translation": "The bodhisattvas know and see it, and they don't enter it anywhere.",
        "source": "T12n0384_002:1023b29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1023c01_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如九行不盡。",
        "translation": "\"It's like the nine practices that don't end.",
        "source": "T12n0384_002:1023c01_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂九行者，上上、上中、上下、中上、中中、中下、下上、下中、下下。",
        "translation": "The nine practices are upward, upward, middle, up and down, middle, middle, down, up and down, middle and down, up and down, middle and down, and down and down.",
        "source": "T12n0384_002:1023c01_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上上緣盡，上中緣不盡，非真實道。",
        "translation": "When the conditions of the upper and middle are exhausted, the conditions of the upper and middle are not exhausted, which is not the true path.",
        "source": "T12n0384_002:1023c03_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上中緣盡，上下緣不盡，非真實道。",
        "translation": "When the upper-middle condition is ended, the upper and lower conditions aren't ended, which is not the true path.",
        "source": "T12n0384_002:1023c03_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上下緣盡，中上緣不盡，非真實道。",
        "translation": "When the upper and lower conditions are ended, the middle and upper conditions aren't ended, which is not the true path.",
        "source": "T12n0384_002:1023c04_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中上緣盡，中中緣不盡，非真實道。",
        "translation": "When the middle and upper conditions are ended, the middle and middle conditions aren't ended, which is not the true path.",
        "source": "T12n0384_002:1023c05_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中中緣盡，中下緣不盡，非真實道。",
        "translation": "When the middle and middle-level conditions are ended, the middle and lower-level conditions aren't ended, which is not the true path.",
        "source": "T12n0384_002:1023c06_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中下緣盡，下上緣不盡，非真實道。",
        "translation": "When the middle and lower-level conditions are ended, the lower and upper-level conditions are not ended, which is not the true path.",
        "source": "T12n0384_002:1023c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下上緣盡，下中緣不盡，非真實道。",
        "translation": "When the lower and upper-level conditions are ended, the lower-middle conditions are not ended, which is not the true path.",
        "source": "T12n0384_002:1023c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下中緣盡，下下緣不盡，非真實道。",
        "translation": "When the lower-middle-level conditions are ended, the lower-level conditions are not ended, which is not the true path.",
        "source": "T12n0384_002:1023c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下下緣盡，是真實道。",
        "translation": "The lower and lower conditions are ended, which is the true and real path.",
        "source": "T12n0384_002:1023c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩於真實性，不取不捨，不住不不住，過去、當來、現在等，道等涅槃等，一等無有二。",
        "translation": "In the true and real nature of bodhisattvas, they don't grasp or relinquish, don't stop or don't stop, and there's no difference between past, future, and present, or between the path and nirvāṇa.",
        "source": "T12n0384_002:1023c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性等、自然相等、眾生等、垢等、五陰等、緣等、癡行等，道行清淨不一不二。",
        "translation": "Equals in Dharma nature, equals in nature, equals in sentient beings, equals in defilement, equals in the five aggregates, equals in conditions, and equals in the practice of delusion, the practice of the path is pure, not one and not two.",
        "source": "T12n0384_002:1023c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲行緣盡，非色行緣盡；色行緣盡，非無色行緣盡；無色行緣盡，色行緣盡，欲界行緣盡，是謂菩薩等非一非二。」",
        "translation": "When the conditions of the form-activity are ended, it's not the conditions of the form-activity that are ended; when the conditions of the form-activity are ended, it's not the conditions of the formless-activity that are ended; when the conditions of the form-activity are ended, it's the conditions of the form-activity that are ended; this is called a bodhisattva who is neither one nor two.\"",
        "source": "T12n0384_002:1023c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告喜見菩薩曰：「汝欲知過去諸佛滅不滅剎土不耶？」",
        "translation": "It was then that the Buddha addressed the joyful-viewing bodhisattvas, \"Do you want to know about the past buddhas' extinction and non-extinction bases?\"",
        "source": "T12n0384_002:1023c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即以神力入無畏空界三昧，使一切眾盡見釋迦文身寂然無言身相具足。",
        "translation": "At that point, the Bhagavān then used his supernormal powers to enter the fearless samādhi of the realm of emptiness, causing all the people to see the silent, wordless body of Śākyamuni complete in body and form.",
        "source": "T12n0384_002:1023c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩當知我過去身，其數不可稱不可量。」",
        "translation": "\"Bodhisattvas should know that my past body was indescribable and immeasurable.\"",
        "source": "T12n0384_002:1023c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以神足入濕生界，眾相具足，與無數阿僧祇為濕識眾生說法，令彼濕識隨意所願各得解脫。",
        "translation": "Then, with miraculous powers, he enters the sphere of wet birth, replete with all its characteristics, and speaks to countless incalculable sentient beings of the wet consciousness, causing each of them to attain liberation according to their wishes.",
        "source": "T12n0384_002:1023c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以神足入化生眾生，現身色相，與無央數阿僧祇眾生說法，令彼化識隨意所願各得解脫。",
        "translation": "Again, he entered the sentient beings of the transformation realm with his spiritual feet, manifested his body in form, and spoke to measureless myriad sentient beings of the transformation consciousness, causing each of them to attain liberation according to their wishes.",
        "source": "T12n0384_002:1023c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即以神足入卵識眾生，現身色相，與無央數阿僧祇眾生說法，令彼眾生隨意所願各得解脫。",
        "translation": "At that point, the Bhagavān then entered sentient beings with egg consciousnesses using his spiritual feet, manifested his body in form, and spoke to measureless myriad sentient beings, causing each of them to attain liberation as they wished.",
        "source": "T12n0384_002:1023c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復以神足現當來世界，人四生中現身色相，與無央數阿僧祇眾生說法，令彼四生眾生隨意所願各得解脫。",
        "translation": "At the time, the Bhagavān also used his spiritual powers to manifest himself in the form of four human beings in the future world and spoke to measureless myriad sentient beings, causing each of those four sentient beings to attain liberation as they wished.",
        "source": "T12n0384_002:1023c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如我今日在母胎中，與諸十方神通菩薩，說不退轉難有之法，亦以神通入天四生，入地獄四生、餓鬼四生、畜生四生，於四生中胎、化二生盡漏疾，濕生、卵生盡漏遲；化生、胎生是利根人，濕生、卵生是鈍根人。」",
        "translation": "\"Just as I did today when I was in my mother's womb, I spoke to other deeply-powered bodhisattvas in ten directions about the irreversible and difficult-to-exist teaching, and I also used my supernormal powers to enter the four births in heaven, the four births in hell, the four births of hungry ghosts, and the four births in animals, where the contaminants in the two births of fetus and transformation are ended, and the contaminants in wet birth and egg birth are ended slowly; transformation birth and fetus birth are people with sharp faculties, and wet birth and egg birth are people with dull faculties.\"",
        "source": "T12n0384_002:1023c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復以神足現寂寞世界，使彼大眾皆悉知見，亦無言教苦、集、滅、道之名。",
        "translation": "At the time, the Bhagavān again showed up with miraculous powers in the lonely world, making it known to a large crowd, and teaching the names of suffering, arising, cessation, and the path without saying anything.",
        "source": "T12n0384_002:1024a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1024a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼土眾生皆是胎化利根人。",
        "translation": "All the sentient beings in that land are born in the womb and have sharp faculties.",
        "source": "T12n0384_002:1024a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復以神足現下方照光世界，視彼眾生稟受讀誦，經歷劫數乃成道果，知此眾生濕生、卵生是鈍根人。",
        "translation": "Again, the Buddha uses his spiritual feet to manifest in the world of lower illumination and sees that sentient beings there receive instruction, read aloud, and pass through eons before realizing the fruit of the path, knowing that these sentient beings are wet-born and egg-born and have dull roots.",
        "source": "T12n0384_002:1024a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復以神足現不死剎土，使彼大眾知彼眾生不聞死名，知此眾生大慈誓願利根中勝根。",
        "translation": "Again, the Buddha manifested the land of the buddha of immortality with miraculous powers, causing the large crowd to know that sentient beings don't hear the name death and know that these sentient beings have superior, medium, and profound roots from the vow of great compassion.",
        "source": "T12n0384_002:1024a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復以神足現中夭剎土，使彼大眾皆悉知見，見彼眾生有中夭者，由彼眾生自造苦本，本壽極長今壽轉短。",
        "translation": "Again, the Buddha manifested the land of the buddha of premature death with miraculous powers, causing that great multitude to know and see that there are sentient beings who die in the interim because they created the root of suffering themselves and their original life span was extremely long, and now their life span has become shorter.",
        "source": "T12n0384_002:1024a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼世界王名曰除憂，剝死人皮以用作鼓，百歲一打使彼眾生皆知死名，壽命轉減至于百歲，時有出者。",
        "translation": "The king of that world, whose name is Bhaiṣajyaguru, skins a dead person and uses it as a drum. Once a hundred years have passed, he beats it so that all sentient beings there know the name death, and their life span decreases until they reach a hundred years, when there's someone who escapes.",
        "source": "T12n0384_002:1024a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾今捨壽八十有四，出五濁世，胎生、化生是我利根分。",
        "translation": "\"Now, I've given up 84 years of my life and emerged from the five turbid worlds, and birth in the womb and birth in the transformation world are parts of my sharp faculties.",
        "source": "T12n0384_002:1024a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知！",
        "translation": "All of you should know this!",
        "source": "T12n0384_002:1024a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命不久存，非佛神力所能留住，此身如泡勢不久立，是身如霧常亂人想，是身如夢增益瞋恚，是身如幻誑惑世人，是身如響求對無形。",
        "translation": "\"His life won't last long, and it's not retained by the Buddha's spiritual power. This body is like a bubble that won't stand long, and it's like a mist that always disturbs people's perceptions, a body like a dream that creates anger, a body like an illusion that deludes people, and a body like a resonant echo that seeks to confront the formless.",
        "source": "T12n0384_002:1024a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是身如影眼見不獲，如是我身於此滅盡更不復生。",
        "translation": "This body is like a shadow that the eye doesn't see and doesn't obtain, so my body will cease here and never arise again.",
        "source": "T12n0384_002:1024a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者不生？",
        "translation": "What's not going to arise again?",
        "source": "T12n0384_002:1024a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不於此閻浮提生。",
        "translation": "He's not born here in Jambudvīpa.",
        "source": "T12n0384_002:1024a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於十方三十二垓佛剎，遍滿彼剎施行佛事，此非過去者，以是之故緣緣盡，緣緣不盡無有涅槃者。」",
        "translation": "Furthermore, he has performed Buddha-works in all the 32 Gai buddha bases in the ten directions and has filled them with buddhas, and this is not something that has passed away; therefore, conditions and objects have ended, and there's no such thing as nirvāṇa until conditions and objects have ended.\"",
        "source": "T12n0384_002:1024a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒菩薩摩訶薩即從坐起，整衣服偏露右臂，右膝著地前白佛言：「甚奇，世尊！",
        "translation": "At that point, Maitreya the Bodhisattva Mahāsattva rose from his seat, adjusted his robes, bared his right arm, knelt on his right knee, and went before the Buddha, saying, \"How marvelous, Bhagavān!",
        "source": "T12n0384_002:1024a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世界若干眾生不同，善惡行報各各別異，如來說法空無寂寞，不可思議入何三昧？",
        "translation": "There are a number of different sentient beings in the world, and the rewards of good and evil actions are each distinct, so the Tathāgata teaches that the Dharma is empty and lonely, and it's inconceivable what samādhi to enter.",
        "source": "T12n0384_002:1024a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "威神感動如是難測。",
        "translation": "Such is the unfathomability of the authoritative power that moves them.",
        "source": "T12n0384_002:1024a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有識眾生咸可易化，山河石壁生樹草木，皆變人形，為有識眾生無識眾生？」",
        "translation": "Can all beings with consciousness be easily transformed, and mountains, rivers, rocks, walls, trees, and grasses all take on human forms, whether they're beings with or without consciousness?\"",
        "source": "T12n0384_002:1024b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彌勒：「汝昔與我共越山海，見一惡獸應食十住菩薩肉耶？」",
        "translation": "The Buddha told Maitreya, \"Did you cross the mountains and seas with me in the past and see a bad animal that should eat the flesh of the ten abiding bodhisattvas?\"",
        "source": "T12n0384_002:1024b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒白佛言：「不也。」",
        "translation": "Maitreya said to the Buddha, \"No.\"",
        "source": "T12n0384_002:1024b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T12n0384_002:1024b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使三千大千剎土滿中惡獸，欲食菩薩肉者，是事不然。",
        "translation": "This is precisely the kind of thing that causes a thousand great thousand buddha lands to be filled with wild animals that want to eat the flesh of a bodhisattva.",
        "source": "T12n0384_002:1024b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾昔勸汝誰能先進，汝及文殊皆言不能當。",
        "translation": "When I once urged you to find someone who could do it, you and Mañjuśrī both said they couldn't do it.",
        "source": "T12n0384_002:1024b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾爾時即以神力，以甘露味示彼飢獸，執意堅固得成無上正真等正覺。",
        "translation": "Then, with my supernormal powers, I showed those hungry beasts the taste of ambrosia and resolutely resolved to achieve unsurpassed true and perfect enlightenment.",
        "source": "T12n0384_002:1024b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝說權退在後，悉是有識教化，非無識教化。」",
        "translation": "Your claim that the expedient retreat was followed by the teaching of those with consciousness, not the teaching of those without consciousness.\"",
        "source": "T12n0384_002:1024b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彌勒：「汝豈不憶古昔無數阿僧祇劫，去此西北六十二恒河沙剎，佛名平等，其剎名無形，如今現在說法，無有辟支佛、聲聞乘，無有日、月、時節、劫數多少；彼佛教化盡一佛界，現界眾生盡得成佛，更不移處他佛世界。",
        "translation": "The Buddha told Maitreya, \"Don't you remember that in the distant past, during incalculably long incalculable eons, there were sixty-two Ganges Sand buddhas to the northwest of here, whose buddhas were called equal and whose buddhas were called formless, and now they preach in the present, with no pratyekabuddhas or śrāvaka vehicles, no suns, moons, periods of time, or numbers of eons; their teachings exhausted the single buddha-realm, and all the sentient beings in the present realm became buddhas, never moving to another buddha-realm.",
        "source": "T12n0384_002:1024b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何？",
        "translation": "How is that?",
        "source": "T12n0384_002:1024b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T12n0384_002:1024b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當名彼佛為過去、未來、現在耶？」",
        "translation": "Shall we name this Buddha as past, future, or present?\"",
        "source": "T12n0384_002:1024b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒白佛言：「亦過去、現在、未來。",
        "translation": "Maitreya said to the Buddha, \"It's also past, present, and future.",
        "source": "T12n0384_002:1024b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1024b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆從諸剎往至彼土，諸緣盡眾生盡得度脫故，現有現在。」",
        "translation": "They've all gone from one of the buddhas to the other land, and they're all present now because their conditions have ended and all sentient beings have been liberated.\"",
        "source": "T12n0384_002:1024b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彌勒：「汝今現在耶？」",
        "translation": "The Buddha told Maitreya, \"Are you present now?\"",
        "source": "T12n0384_002:1024b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「不也。",
        "translation": "They replied, \"No.",
        "source": "T12n0384_002:1024b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0384_002:1024b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名雖現在行不現在，前行過去後行未至，識念思惟三事成就，是故無現在。」",
        "translation": "Although words are present and deeds aren't present, previous deeds have passed and subsequent deeds have yet to come, and the three things accomplished in consciousness, mindfulness, contemplation, and deliberation are therefore not present.\"",
        "source": "T12n0384_002:1024b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即問彌勒：「心有所念，幾念、幾想、幾識耶？」",
        "translation": "The Buddha then asked Maitreya, \"What kinds of mindfulness does the mind have, which kinds of mindfulness, which kinds of perception, and which kinds of consciousness?\"",
        "source": "T12n0384_002:1024b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒言：「拍手彈指之頃，三十二億百千念，念念成形，形形皆有識，識念極微細不可執持。",
        "translation": "Maitreya said, \"In the instant that you clap your hands and snap your fingers, 3,200,000,000,000 thoughts are formed from each thought, and each form has a consciousness, which is extremely subtle and cannot be held.",
        "source": "T12n0384_002:1024b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛之威神入彼微識皆令得度，此識教化非無識也。",
        "translation": "The Buddha's authoritative power enters those subtle consciousnesses and causes them to be liberated, and this consciousness teaches that they aren't without consciousness.",
        "source": "T12n0384_002:1024b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，微識極微細過於微塵，此微塵識不可覩見，如來威神入彼教化皆令得度。",
        "translation": "Furthermore, the subtle consciousness is extremely subtle and more than a particle, and this tiny consciousness can't be seen, but the Tathāgata's authoritative power and energy enter it and teach it, and it's all possible to liberate it.",
        "source": "T12n0384_002:1024b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒當知未有狐疑，此微塵識亦受四氣亦有四生。",
        "translation": "Maitreya should know without misgivings that this finely particulate consciousness is also subject to the four prana and has four births.",
        "source": "T12n0384_002:1024b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T12n0384_002:1024b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生無邊，邊亦無邊，如來亦無邊，道亦無邊，一切言有，有亦無有，無界、無處、無住，亦無教授化眾生者，此名逆順三昧。",
        "translation": "The sentient beings are limitless, the extremes are limitless, the Tathāgata is limitless, the path is limitless, everything that's said to exist, exists, and doesn't exist, has no realm, no place, and no abode, and there's no one who teaches the transformation of sentient beings, which is called adversarial samādhi.",
        "source": "T12n0384_002:1024b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不住不不住一相無相，不著不縛亦無真際，修治道場淨佛境界，權變無數非下劣所及。」",
        "translation": "Without abiding or not abiding in either aspect or form, without attachment or binding and without a true limit, it purifies the Buddha's realm of the path and has measureless powers that are beyond the reach of inferior people.\"",
        "source": "T12n0384_002:1024c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊將欲解釋彌勒狐疑，即現身色柔軟色，無厭足色，內外清淨無瑕穢色。",
        "translation": "It was then that the Bhagavān, intending to explain Maitreya's misgivings, revealed a body that was soft and supple in color, unsatisfied in color, and pure and undefiled inside and out.",
        "source": "T12n0384_002:1024c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾從無數阿僧祇劫修眼清淨，內外無閡今獲色身，身亦無身色亦無色，知身空色空，身色俱空，知身色俱空者，此空空空。",
        "translation": "\"Since I cultivated eye purity for countless incalculable eons, I've cultivated internal and external purity without hindrance and have now attained a form body, a body that's also devoid of body and form that's also devoid of form, knowing that the body is empty and form is empty, and knowing that both body and form are empty, this emptiness is empty and vacant.",
        "source": "T12n0384_002:1024c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知無身空無色空，知無身無色俱空，知無身無色俱空者，此空空空。",
        "translation": "He knows that the body is empty and form is empty, knows that the body is empty and form is empty at the same time, and knows that the body is empty and form is empty at the same time, and this emptiness is empty.",
        "source": "T12n0384_002:1024c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知過去身空，知過去色空，知過去身色俱空，知過去身色俱空者，此空空空。",
        "translation": "He who knows that the past body is empty, knows that past form is empty, knows that past body and form are both empty, and knows that past body and form are both empty, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知未來身空，知未來色空，知未來身色俱空，知未來身色俱空者，此空空空。",
        "translation": "He who knows the emptiness of future bodies, knows the emptiness of future form, knows the emptiness of both future body and form, and knows the emptiness of both future body and form, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知現在身空，知現在色空，知現在身色俱空，知現在身色俱空者，此空空空。",
        "translation": "He who knows the present body is empty, knows that present form is empty, knows that the present body and form are both empty, and knows that the present body and form are both empty, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知過去無身空，知過去無色空，知過去無身無色俱空，知過去無身無色俱空者，此空空空。",
        "translation": "He who knows that the past was empty of body, knew that the past was empty of form, knew that the past was empty of body and form at the same time, and knew that the past was empty of body and form at the same time, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知未來無身空，知未來無色空，知未來無身無色俱空，知未來無身無色俱空者，此空空空。",
        "translation": "He who knows that the future will be empty of body, knows that the future will be empty of form, knows that the future will be empty of body and form alike, and knows that the future will be empty of body and form alike, this emptiness is empty.",
        "source": "T12n0384_002:1024c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知現在無身空，知現在無色空，知現在無身無色俱空，知現在無身無色俱空者，此空空空。",
        "translation": "He who knows that the present is empty of body, knows that the present is empty of form, knows that the present is empty of body and form alike, and knows that the present is empty of body and form alike, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知欲界身空，知欲界色空，知欲界身色俱空，知欲界身色俱空者，此空空空。",
        "translation": "He who knows that the body of the desire realm is empty, knows that form in the desire realm is empty, knows that both body and form in the desire realm are empty, and knows that both body and form in the desire realm are empty, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知色界身空，知色界色空，知色界身色俱空，知色界身色俱空者，此空空空。",
        "translation": "He who knows the emptiness of the body in the form realm, knows the emptiness of form in the form realm, knows the emptiness of both body and form in the form realm, and knows the emptiness of both body and form in the form realm, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知無色界身空，知無色界色空，知無色界身色俱空，知無色界身色俱空者，此空空空。",
        "translation": "He who knows the emptiness of the body in the formless realm, knows the emptiness of form in the formless realm, knows the emptiness of both body and form in the formless realm, and knows the emptiness of both body and form in the formless realm, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知欲界無身空，知欲界無色空，知欲界無身無色俱空，知欲界無身無色俱空者，此空空空。",
        "translation": "He who knows that the desire realm is empty of body, knows that the desire realm is empty of form, knows that the desire realm is empty of body and form, and knows that the desire realm is empty of body and form, this is emptiness and voidness.",
        "source": "T12n0384_002:1024c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知色界無身空，知色界無色空，知色界無身無色俱空，知色界無身無色俱空者，此空空空。",
        "translation": "He who knows that the form realm is empty of body, knows that the form realm is empty of form, knows that the form realm is empty of body and form alike, and knows that the form realm is empty of body and form alike, this emptiness is empty.",
        "source": "T12n0384_002:1024c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知無色界無身空，知無色界無色空，知無色界無身無色俱空，知無色界無身無色俱空者，此空空空。",
        "translation": "He who knows that the formless realm is empty of body, knows that the formless realm is empty of form, knows that the formless realm is empty of body and form alike, and knows that the formless realm is empty of body and form alike, this emptiness is empty.",
        "source": "T12n0384_002:1025a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知緣緣身空，知緣緣色空，知緣緣身色俱空，知緣緣身色俱空者，此空空空。",
        "translation": "He who knows that the body is empty in terms of conditions, knows that form is empty in terms of conditions, knows that both body and form are empty in terms of conditions, and knows that both body and form are empty in terms of conditions, this emptiness is empty.",
        "source": "T12n0384_002:1025a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知緣緣無身空，知緣緣無色空，知緣緣無身無色俱空，知緣緣無身無色俱空者，此空空空。",
        "translation": "He who knows that the body is empty of conditions and objects, knows that form is empty of conditions and objects, knows that both body and form are empty of conditions and objects, and knows that both body and form are empty of conditions and objects, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「知胎生身空，知胎生色空，知胎生身色俱空，知胎生身色俱空者，此空空空。",
        "translation": "\"He who knows that the body of the unborn is empty, knows that the form of the unborn is empty, knows that both body and form of the unborn are empty, and knows that both body and form of the unborn are empty, this is emptiness and voidness.",
        "source": "T12n0384_002:1025a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知胎生無身空，知胎生無色空，知胎生無身無色俱空，知胎生無身無色俱空者，此空空空。",
        "translation": "He who knows that the body of womb birth is empty, knows that form is empty in womb birth, knows that the body of womb birth is empty without form, and knows that the body of womb birth is empty without form, this is emptiness and voidness.",
        "source": "T12n0384_002:1025a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知化生身空，知化生色空，知化生身色俱空，知化生身色俱空者，此空空空。",
        "translation": "He who knows that the body of the transformation birth is empty, knows that the form of the transformation birth is empty, knows that the body of the transformation birth is empty with form, and knows that the body of the transformation birth is empty with form, this emptiness is empty.",
        "source": "T12n0384_002:1025a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知化生無身空，知化生無色空，知化生無身無色俱空，知化生無身無色俱空者，此空空空。",
        "translation": "He who knows that the body of a person born by transformation is empty, knows that the form of a person born by transformation is empty, knows that the body of a person born by transformation is empty without form, and knows that the body of a person born by transformation is empty without form, this is empty and vacant.",
        "source": "T12n0384_002:1025a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知濕生身空，知濕生色空，知濕生身色俱空，知濕生身色俱空者，此空空空。",
        "translation": "He who knows that the body of wet birth is empty, knows that the form of wet birth is empty, knows that the body of wet birth is empty with form, and knows that the body of wet birth is empty with form, this emptiness is empty.",
        "source": "T12n0384_002:1025a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知濕生無身空，知濕生無色空，知濕生無身無色俱空，知濕生無身無色俱空者，此空空空。",
        "translation": "He who knows that the wet-born body is empty, knows that the wet-born form is empty, knows that the wet-born body is empty and form is empty, and knows that the wet-born body is empty and form is empty, this is emptiness and voidness.",
        "source": "T12n0384_002:1025a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知卵生身空，知卵生色空，知卵生身色俱空，知卵生身色俱空者，此空空空。",
        "translation": "He who knows that the body of an egg is empty, knows that the form of an egg is empty, knows that the body of an egg is empty of both form and knows that the body of an egg is empty of both form, this emptiness is empty.",
        "source": "T12n0384_002:1025a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知卵生無身空，知卵生無色空，知卵生無身無色俱空，知卵生無身無色俱空者，此空空空。",
        "translation": "He who knows that the body of an egg is empty, knows that the form of an egg is empty, knows that the body of an egg is empty and the form of an egg is empty, and knows that the body of an egg is empty and the form of an egg is empty, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「知未至禪身空，知未至禪色空，知未至禪身色俱空，知未至禪身色俱空者，此空空空。",
        "translation": "\"He who knows that the body has yet to reach meditation is empty, knows that form has yet to reach meditation is empty, knows that both body and form have yet to reach meditation are empty, and knows that both body and form have yet to reach meditation are empty, this emptiness is empty.",
        "source": "T12n0384_002:1025a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知未至禪無身空，知未至禪無色空，知未至禪無身無色俱空，知未至禪無身無色俱空者，此空空空。",
        "translation": "He who knows that the body is empty before he reaches meditation, knows that form is empty before he reaches meditation, knows that the body is empty without form before he reaches meditation, and knows that the body is empty without form before he reaches meditation, this emptiness is empty.",
        "source": "T12n0384_002:1025a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知初禪身空，知初禪色空，知初禪身色俱空，知初禪身色俱空者，此空空空。",
        "translation": "He who knows that the body of the first dhyāna is empty, knows that form of the first dhyāna is empty, knows that both body and form of the first dhyāna are empty, and knows that both body and form of the first dhyāna are empty, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知初禪無身空，知初禪無色空，知初禪無身無色俱空，知初禪無身無色俱空者，此空空空。",
        "translation": "He who knows that the first dhyāna body is empty, knows that the first dhyāna form is empty, knows that the first dhyāna body is empty and form is empty, and knows that the first dhyāna body is empty and form is empty, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知中間禪身空，知中間禪色空，知中間禪身色俱空，知中間禪身色俱空者，此空空空。",
        "translation": "He who knows that the middle dhyāna is empty of body, knows that the middle dhyāna is empty of form, knows that the middle dhyāna is empty of both body and form, and knows that the middle dhyāna is empty of both body and form, this emptiness is empty.",
        "source": "T12n0384_002:1025b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知中間禪無身空，知中間禪無色空，知中間禪無身無色俱空，知中間禪無身無色俱空者，此空空空。",
        "translation": "He who knows that the middle dhyāna is empty of body, knows that the middle dhyāna is empty of form, knows that the middle dhyāna is empty of body and form alike, and knows that the middle dhyāna is empty of body and form alike, this is emptiness and voidness.",
        "source": "T12n0384_002:1025b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知二禪身空，知二禪色空，知二禪身色俱空，知二禪身色俱空者，此空空空。",
        "translation": "He who knows that the body of the second dhyāna is empty, knows that form of the second dhyāna is empty, knows that both body and form of the second dhyāna are empty, and knows that both body and form of the second dhyāna are empty, this emptiness is empty.",
        "source": "T12n0384_002:1025b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知二禪無身空，知二禪無色空，知二禪無身無色俱空，知二禪無身無色俱空者，此空空空。",
        "translation": "He who knows that the second dhyāna body is empty, knows that the second dhyāna form is empty, knows that the second dhyāna body is empty and form is empty, and knows that the second dhyāna body is empty and form is empty, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知三禪身空，知三禪色空，知三禪身色俱空，知三禪身色俱空者，此空空空。",
        "translation": "He who knows that the body of the third dhyāna is empty, knows that form of the third dhyāna is empty, knows that both body and form of the third dhyāna are empty, and knows that both body and form of the third dhyāna are empty, this emptiness is empty.",
        "source": "T12n0384_002:1025b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知三禪無身空，知三禪無色空，知三禪無身無色俱空，知三禪無身無色俱空者，此空空空。",
        "translation": "He who knows that the third meditation body is empty, knows that the third meditation form is empty, knows that the third meditation body is empty and form is empty, and knows that the third meditation body is empty and form is empty, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知四禪身空，知四禪色空，知四禪身色俱空，知四禪身色俱空者，此空空空。",
        "translation": "He who knows that the body of the fourth meditation is empty, knows that form of the fourth meditation is empty, knows that both body and form of the fourth meditation are empty, and knows that both body and form of the fourth meditation are empty, this emptiness is empty.",
        "source": "T12n0384_002:1025b13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知四禪無身空，知四禪無色空，知四禪無身無色俱空，知四禪無身無色俱空者，此空空空。",
        "translation": "He who knows that the body of the fourth dhyāna is empty, knows that form is empty, knows that the body of the fourth dhyāna is empty without form, and knows that the body of the fourth dhyāna is empty without form, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「知空處身空，知空處色空，知空處身色俱空，知空處身色俱空者，此空空空。",
        "translation": "\"He who knows that the body in the realm of emptiness is empty, knows that form in the realm of emptiness is empty, knows that both body and form in the realm of emptiness are empty, and knows that both body and form in the realm of emptiness are empty, this is emptiness and nothingness.",
        "source": "T12n0384_002:1025b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知空處無身空，知空處無色空，知空處無身無色俱空，知空處無身無色俱空者，此空空空。",
        "translation": "He who knows that the empty place is empty of body, knows that the empty place is empty of form, knows that the empty place is empty of body and form alike, and knows that the empty place is empty of body and form alike, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知識處身空，知識處色空，知識處身色俱空，知識處身色俱空者，此空空空。",
        "translation": "This is emptiness when the knowledgeable person's body is empty, the knowledgeable person's form is empty, the knowledgeable person's body and form are both empty, and the knowledgeable person's body and form are both empty.",
        "source": "T12n0384_002:1025b21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知識處無身空，知識處無色空，知識處無身無色俱空，知識處無身無色俱空者，此空空空。",
        "translation": "If the knowledgeable place is empty of body, the knowledgeable place is empty of form, the knowledgeable place is empty of both body and form, and the knowledgeable place is empty of both body and form, this is emptiness and voidness.",
        "source": "T12n0384_002:1025b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知不用處身空，知不用處色空，知不用處身色俱空，知不用處身色俱空者，此空空空。",
        "translation": "This is emptiness and voidness when you know that the body in unnecessary places is empty, form in unnecessary places is empty, body and form in unnecessary places are both empty, and body and form in unnecessary places are both empty.",
        "source": "T12n0384_002:1025b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知不用處無身空，知不用處無色空，知不用處無身無色俱空，知不用處無身無色俱空者，此空空空。",
        "translation": "He who knows that the unused place is empty of body, knows that the unused place is empty of form, knows that the unused place is empty of both body and form, and knows that the unused place is empty of both body and form, this is emptiness and emptiness.",
        "source": "T12n0384_002:1025b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知非想非不想處身空，知非想非不想處色空，知非想非不想處身色俱空，知非想非不想處身色俱空者，此空空空。",
        "translation": "He's empty when he knows the body is empty where he doesn't think or doesn't want it, knows the form is empty where he doesn't think or doesn't want it, knows the body is empty where he doesn't think or doesn't want it, and knows the body is empty where he doesn't think or doesn't want it.",
        "source": "T12n0384_002:1025b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知非想非不想處無身空，知非想非不想處無色空，知非想非不想處無身無色俱空，知非想非不想處無身無色俱空者，此空空空。」",
        "translation": "This is emptiness when you know that the absence of body is empty, the absence of form is empty, the absence of body and form are empty, and the absence of body and form are empty when you know that the absence of body and form are empty.\"",
        "source": "T12n0384_002:1025c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彌勒：「今當與汝說生義、根義。",
        "translation": "The Buddha told Maitreya, \"Now, I will explain to you the meaning of birth and the meaning of faculties.",
        "source": "T12n0384_002:1025c05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen closely, listen closely!",
        "source": "T12n0384_002:1025c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T12n0384_002:1025c06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何生義？",
        "translation": "What does it mean to give rise to?",
        "source": "T12n0384_002:1025c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生者七九是也；根者連著義也。",
        "translation": "\"Seven and nine are the things that arise, and the root is the meaning of attachment.",
        "source": "T12n0384_002:1025c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來無所著，已知、未知、無知。",
        "translation": "The Tathāgata has no attachments, which are known, unknown, and ignorant.",
        "source": "T12n0384_002:1025c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已知根者，過去、當來、現在。",
        "translation": "Known faculties are past, future, and present.",
        "source": "T12n0384_002:1025c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知根者，結、使、障礙。",
        "translation": "The faculties that are not known are bonds, tendencies, and obstacles.",
        "source": "T12n0384_002:1025c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無知根者，如來、至真、等正覺，過去、當來、現在諸佛，成就此根分別諸根，無根亦不無根，無說無義，分別字義空無所有，是根義也。",
        "translation": "The faculty of not-knowing is the Tathāgata, the Supreme Truth, and the Completely Awakened One, the buddhas of the past, future, and present who have accomplished this faculty of discerning faculties, have no faculties, aren't without faculties, don't explain the absence of meaning, and discern the meaning of words as empty and non-existent, which is the meaning of faculties.",
        "source": "T12n0384_002:1025c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從初發意乃至坐樹王下，轉無上法輪集諸法門，行無行法門，思議法門，總持根法門，虛空法藏法門，此是諸佛要集三昧。",
        "translation": "From the first arousal of the intention until he sits beneath the king of trees, he turns the unsurpassed wheel of the Dharma and gathers dharmas, practices the dharma-gate of no practice, deliberates the dharma-gate, comprehends the dharma-gate of the faculties, and conceals the dharma-gate of the Dharma of space, which are the essential samādhi collections of the buddhas.",
        "source": "T12n0384_002:1025c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒當知！",
        "translation": "Maitreya, you should know this!",
        "source": "T12n0384_002:1025c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復受記五十六億七千萬歲，於此樹王下成無上等正覺。",
        "translation": "Again, you've been predicted to become unsurpassed and perfectly enlightened under this tree king for 5,600,700,000 years.",
        "source": "T12n0384_002:1025c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以右脇生，汝彌勒從頂生。",
        "translation": "I was born at my right hypochondrium, and you, Maitreya, were born from the top of that tree.",
        "source": "T12n0384_002:1025c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我壽百歲，彌勒壽八萬四千歲。",
        "translation": "Just as I will live to be 100 years old, Maitreya will live to be 84,000 years old.",
        "source": "T12n0384_002:1025c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我國土土，汝國土金，我國土苦，汝國土樂。」",
        "translation": "My land is earth, and your land is gold; my land is painful, and your land is pleasant.\"",
        "source": "T12n0384_002:1025c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即說頌曰：「如來十力尊，　　虛空無邊際；　忍、慧、福業力，　　誓願力最勝。",
        "translation": "It was then that the Bhagavān spoke a verse, \"The Tathāgata is honored by ten powers, and space has no limit; the powers of patience, wisdom, and meritorious actions are the greatest of all, and the vow is the most powerful.",
        "source": "T12n0384_002:1025c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝生快樂國，　　不如我界苦；　汝說法甚易，　　我說法甚難。",
        "translation": "You were born in a happy land that's not like the suffering in my world; your teaching is easy, but my teaching is difficult.",
        "source": "T12n0384_002:1025c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初說九十六，　　二說九十四，　三說九十二。",
        "translation": "The first teaching is ninety-six, the second is ninety-four, and the third is ninety-two.",
        "source": "T12n0384_002:1025c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我初說十二，　二說二十四，　　三說三十六。",
        "translation": "I spoke twelve in the beginning, twenty-four in the second, and thirty-six in the third.",
        "source": "T12n0384_002:1025c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝所三說人，　　是吾先所化；　汝父梵摩淨，　　將八萬四千，　非我先所化，　　是汝所開度。",
        "translation": "The three people you've spoken to were converted by me; your father Brahmapurohita, who taught 84,000, was not converted by me but was liberated by you.",
        "source": "T12n0384_002:1025c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　九十六億人，　　受我五戒者；　九十四億人，　　受持三歸者；　九十二億人，　　一稱南無佛。",
        "translation": "Nine billion, six hundred million people accept my five precepts; nine billion, four hundred million people uphold the three refuges; nine billion, two hundred million people are called Namo Buddha.",
        "source": "T12n0384_002:1026a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初說千比丘，　　二十四億天，　三三十六億，　　所度諸眾生；　汝樂我勤苦，　　汝怠我清進。」",
        "translation": "The first spoke of 1,000 monks, 2.4 billion gods, and 3.6 billion sentient beings whom you have saved; you enjoy my suffering, and I purify your laziness.\"",
        "source": "T12n0384_002:1026a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當佛說此偈時，苦行眾生七十二億，即於座上不動，得不起法忍。",
        "translation": "When the Buddha spoke this verse, 7.2 billion ascetic sentient beings remained motionless on their seats and attained the tolerance of the Dharma of not rising.",
        "source": "T12n0384_002:1026a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎菩薩處胎經卷第二",
        "translation": "◎菩薩處胎經卷二",
        "source": "T12n0384_002:1026a08_1",
        "is_bad_quality": false
    }
]