[
    {
        "source_sentence": "大方廣十輪經卷第四",
        "translation": "Daśacakra-kṣitigarbha-sūtra, Vol. 4",
        "source": "T13n0410_004:0696b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "失譯人名今附北涼錄",
        "translation": "The Names of the Missing Translators Are Now Attached to the Record of Northern Liang",
        "source": "T13n0410_004:0696b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎利旃陀羅現智相品第六",
        "translation": "Sixth Chapter of the Zaili Candra Chapter on the Appearance of Wisdom",
        "source": "T13n0410_004:0696b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，地藏菩薩白佛言：「世尊！",
        "translation": "At that point, Kṣitigarbha Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0410_004:0696b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是剎利旃陀羅，輔相旃陀羅，少於善根不肯信向，諂曲愚癡自稱多知，皆生憍慢，不畏後世惡業果報，離善知識，乃至趣向阿鼻地獄。",
        "translation": "These are Kālīyāntika and Auxiliary Kālīyāntika, who have few good roots, refuse to believe in them, flatter foolishly claim to have much knowledge, and become proud, aren't afraid of the results of bad actions in later lifetimes, and leave good friends, even going to the avīci hell.",
        "source": "T13n0410_004:0696b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為財利故，與此惡行諸比丘等，作非法朋黨。」",
        "translation": "For the sake of wealth and profit, they make unlawful friends of these monks and others who behave badly.\"",
        "source": "T13n0410_004:0696b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是，如是！",
        "translation": "The Buddha said, \"So it is, so it is!",
        "source": "T13n0410_004:0696c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_004:0696c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世，剎利旃陀羅乃至婆羅門旃陀羅，善根微少無有信心欺詐諂曲，是諸愚癡現智慧相。",
        "translation": "In future generations, the Zāri Candra or even the Brāhmaṇa Candra will have few good roots, lack faith, and deceive and twist, which are foolishness in the appearance of wisdom.",
        "source": "T13n0410_004:0696c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不隨善知識語，實是愚癡現為智慧。",
        "translation": "Not following the words of a good teacher is really foolishness manifested as wisdom.",
        "source": "T13n0410_004:0696c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心常疑悔不畏後世，而無禁戒作諸殺生，乃至邪見欺誑於他，於諸世間常行誹謗語。",
        "translation": "Their minds are always doubtful and remorseful, and they don't fear the afterlife; they commit acts of killing without the precepts, even deceive others with wrong views, and always speak slanderously about the world.",
        "source": "T13n0410_004:0696c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎利旃陀羅、婆羅門旃陀羅壞亂佛法，於我法中而得出家，常毀破戒作諸惡行。",
        "translation": "The bhadra and brāhmaṇa daṇḍalas disrupt the Buddha's teaching, leave home in our teaching, and always violate the precepts and engage in bad behavior.",
        "source": "T13n0410_004:0696c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而剎利婆羅門，盡心供養多畜錢財，貪心染著取空言語，通致信命治生販賣，好讀外典墾土種殖，守護錢財、產業、舍宅，守護妻子、呪說仙藥，貪著衣服、飲食之物，破戒惡行其聲如貝；實非沙門自言沙門，實非梵行自謂梵行，乃至為剎利、婆羅門恭敬供養聽受。",
        "translation": "Those Bālīs and Brahmans who devote their minds to providing for many bartered goods, are addicted to secrecy, speak empty words, are devoted to faith and livelihood, treat life as birth, cultivate land and plant seeds, guard money, property, and homes, guard wives, preach incantations and medicines, covet clothing and food, and break precepts and engage in bad behavior that sounds like seashells; they really aren't ascetics who say they are ascetics, and they really aren't the religious practice who call themselves the religious practice, even to the point of respectfully offering support to Bālīs and Brahmans and listening to them.",
        "source": "T13n0410_004:0696c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎利旃陀羅、婆羅門旃陀羅，好喜破戒遠離持戒，於我法中，若見有人持戒修善能謙下者，學與無學一切得向。",
        "translation": "*Bhadra and Brāhmaṇa Candra, who prefer to violate the precepts and distance themselves from upholding them, if they see someone in our order who upholds the precepts and cultivates goodness and is humble, they'll be able to apply themselves to both training and no-training.",
        "source": "T13n0410_004:0696c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是比丘，皆悉不得恭敬供養，有所言說皆不聽受。",
        "translation": "None of these monks will be allowed to respect and offer support, and nothing they say will be accepted.",
        "source": "T13n0410_004:0696c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_004:0696c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人到寶渚所，捨帝釋青寶及大青寶，金、銀、真珠皆悉捨離，大價之寶取於水精。",
        "translation": "\"It's like a person who goes to a jeweled islet and discards the blue treasure of Indra and the great blue treasure, and they all discard gold, silver, and genuine pearls, while taking a great-valued treasure and placing it in a water essence.",
        "source": "T13n0410_004:0696c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我法中，如是持戒有大功德，心常謙下而便捨之。",
        "translation": "If there's great merit in observing the precepts in this way in my teaching, my mind is always humble and I simply abandon them.",
        "source": "T13n0410_004:0696c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取於破戒造惡行者，成就惡法不生羞恥心無慚愧，遠離一切大慈大悲，反取如是諸惡福田，聽受其語，供養如是造作惡人，師及弟子俱墮地獄，悉具於此十種惡輪。",
        "translation": "They take someone who breaks the precepts and creates bad behavior, accomplishes bad qualities without shame or conscience, parts with all great kindness and compassion, and instead takes such bad fields of merit, listens to their words, makes offerings to such a bad creator, and sends both their teacher and disciple to hell, where they'll all be replete with these ten kinds of bad turns.",
        "source": "T13n0410_004:0696c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎利旃陀羅、婆羅門旃陀羅、沙門旃陀羅、大臣旃陀羅，先修善根今悉消滅，乃至墮於阿鼻地獄。",
        "translation": "A warrior candra, a brāhmaṇa candra, an ascetic candra, or a ministerial candra, whose previously cultivated good roots have all vanished now, will fall into the avīci hell.",
        "source": "T13n0410_004:0696c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為十破戒惡行？",
        "translation": "\"What are the ten bad actions that violate the precepts?",
        "source": "T13n0410_004:0696c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是比丘，乃至剎利、婆羅門，忍樂惡見，誹謗阿練若比丘，愚癡諂曲非毀賢聖，誑惑世間，飲食錢財及諸利養，求名稱故自苦其身，毀謗他人嫉妬鬪亂，純為利養，莫肯聽受信用其語，退棄令下遠離實法，皆言無有得道果者，亦無離欲能盡結者，但為利養而自顯現，慎莫奉事供養是等，乃是諂曲誑惑之人，實非福田趣向道者。",
        "translation": "Such monks, even the bhadras and brāhmaṇas, who tolerate evil views, denigrate the monk Āryāna, flatter foolishly, don't disparage the good and noble, deceive the world, eat, finance, and make profits, seek fame and reputation for the sake of self-pity, disparage others, are jealous and tumultuous, are motivated solely by profit, won't listen to or accept their words, abandon and cause others to depart from the true teaching, say there's no one who has attained the fruit of the path, and there's no one who's free of the bond of desire and can end it, but only shows himself for profit, and carefully avoids serving and making offerings to such people, are deceitful and deceptive people who really aren't a field of merit oriented toward the path.",
        "source": "T13n0410_004:0697a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時剎利栴陀羅，婆羅門栴陀羅，於阿練若比丘，不生恭敬希有之心；其心顛倒而不承事恭敬供養，不肯聽受信用彼語，即是不能護持法眼紹三寶種。",
        "translation": "At the time, the Zāri Caṇḍāla and Brāhmaṇa Caṇḍāla didn't have the respectful and rare attitude toward the monks of Araṇya, and their mistaken minds didn't honor or serve them or offer support, refusing to listen to or accept their words, which means they weren't able to safeguard the Dharma eye and introduce the seeds of the Three Treasures.",
        "source": "T13n0410_004:0697a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，國土天、龍、鬼神而於三寶信心深重，皆同瞋恚如是剎利婆羅門等，互相語言：『汝今諦觀剎利栴陀羅、沙門栴陀羅、婆羅門栴陀羅、大臣栴陀羅，悉起憍慢，一切三寶斷於善根近惡知識，退失善法當入惡趣，我等今日不復擁護如此國土剎利、婆羅門等。』",
        "translation": "At the time, the gods, dragons, and spirits of the land had profound faith in the Three Treasures, and they were all angry with such bālis, priests, and so forth, saying to each other, 'Now, if you look closely at bālis, ascetics, brāhmaṇas, and ministerial caityas, they'll all become proud, and all the Three Treasures will be cut off from their good roots and become close to bad friends, so they'll lose their good qualities and go to a bad destiny; we won't support such bālis, brāhmaṇas, and so forth of the land today.'",
        "source": "T13n0410_004:0697a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切天、龍、諸善鬼神既捨離已，於其國中堪任法器為福田者皆生捨心。",
        "translation": "Once all the gods, dragons, and good spirits have abandoned them, those in their lands who are qualified to serve as fields of merit for the Dharma will become indifferent.",
        "source": "T13n0410_004:0697a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切天神及堪任法器應為福田者，於彼剎利旃陀羅等生捨心已，於自國土及餘隣國，皆悉兵起飢饉疾疫，更相殘害不復歡樂。",
        "translation": "If all the gods and goddesses and worthy Dharma vessels that should be fields of merit in their lands become indifferent, then in their own lands and in other neighboring lands, famine and epidemics will arise, and they'll be further harmed and made unhappy.",
        "source": "T13n0410_004:0697a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先所愛樂皆悉別離，忿心慳悋無有矜愍，於一切眾生不起慈心，殺生乃至邪見無慚無愧，一切塔寺及僧祇物，皆悉食噉供其衣服，瞋諸左右悉生嫌隙；若與他戰，令己軍眾自然退散；若欲死時皆結其舌口不能語，趣向地獄。",
        "translation": "They part with all their former loves and pleasures, become hateful and stingy with no compassion, show no compassion for all sentient beings, kill beings and even mistaken views without conscience or modesty, eat and bite all the things in their stūpas and temples and saṃgha offerings for their clothing, become hostile to their left and right, cause their troops to naturally retreat if they fight others, and wrap their tongues around their mouths when they want to die, unable to speak and headed for hell.",
        "source": "T13n0410_004:0697a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0410_004:0697a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎利旃陀羅，乃至婆羅門旃陀羅，皆悉遠離諸善知識，輕慢三寶無恭敬心不畏後世。",
        "translation": "\"Kālī Cāṇḍaras and even Brāhmaṇa Cāṇḍaras are all estranged from good teachers, despise the Three Treasures, have no respect, and don't fear the afterlife.",
        "source": "T13n0410_004:0697a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於聲聞乘得少信心謂己聰哲，而於辟支佛乘及大乘經法，誹謗不信，不讀、不誦，下至一偈生不信心，是名謗法。",
        "translation": "To have little faith in the śrāvaka vehicle and consider oneself intelligent, but to denigrate the pratyekabuddha vehicle and great vehicle sūtras and teachings, not to read or recite them, or to give rise to a lack of faith down to a single verse, is called denigrating the Dharma.",
        "source": "T13n0410_004:0697b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，少信辟支佛法及大乘法，而不信於聲聞之法，毀呰譏呵，亦名誹謗正法，是名誹謗三世諸佛正法之藏，斷八正道，破於無量眾生法眼。",
        "translation": "If another person has little faith in the teachings of the pratyekabuddhas and the great vehicle teachings but doesn't believe in the śrāvaka teachings and ridicules them, this is also called denigrating the right teaching, denigrating the treasury of the true teachings of the three buddhas, cutting off the eightfold correct path, and refuting the Dharma-eye of measureless sentient beings.",
        "source": "T13n0410_004:0697b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，於如來所說聲聞乘、辟支佛乘及菩薩乘，若作障礙若隱蔽覆藏乃至一偈，而不恭敬於三寶者，以是因緣令使守護一切國土天龍善神，以不動信即便瞋恚，是剎利諸臣乃至結舌不語而死墮阿鼻地獄。",
        "translation": "If another person makes an obstruction or conceals even a verse in what the Tathāgata teaches about the śrāvaka vehicle, pratyekabuddha vehicle, or bodhisattva vehicle and doesn't revere the Three Treasures, this will cause gods, dragons, and good spirits guarding all lands to become angry because of their unshaken faith, which will cause the ministers of the bhadra to stick their tongues out and not speak, and then they'll die and fall into the avīci hell.",
        "source": "T13n0410_004:0697b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0410_004:0697b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若持戒有功德者，在彼國住具足法器，善入捨心安住靜室，而不數數至檀越舍，亦不輕呵惡行比丘使彼覺知，亦不譏嫌呵責破戒。",
        "translation": "\"If someone who has merit in upholding the precepts lives in that country with the full Dharma vessel, enters well into equanimity and lives in a quiet room, and doesn't frequently go to the donor's quarters, doesn't ridicule ascetic monks and make them aware, and doesn't criticize and rebuke those who break the precepts.",
        "source": "T13n0410_004:0697b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而惡行比丘，於清淨持戒者所反生譏嫌，言作姦偽種種妄語，於剎利大臣，及至國中一切人民男女大小，悉於其前生諸誹謗。",
        "translation": "That monk of evil behavior then becomes hostile to the pure observer of the precepts, speaking adulterously and falsely of various kinds of falsehoods, and he slanders the ministers of the bhadra and all the people of the land, both men and women, large and small, in front of him.",
        "source": "T13n0410_004:0697b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼剎利栴陀羅等，於諸清淨持戒具足修行功德有名聞者——如是比丘真我弟子，具足一切禪定解脫，善巧言辭——便起毀呰而生瞋恚，種種惡口麁語逼切令受苦惱；或奪衣鉢及四方僧物資業敷具，驅遣令出，或時繫閉或斬截其首。",
        "translation": "Those Zāri Caṇḍalas and others who are well-known and well-versed in the virtues of cultivating the pure observance of precepts-such a monk is truly my disciple, fully liberated in all meditations, and skillful in speech-begin to resent and become angry, and they harass and harshly speak variously, causing suffering and distress; they may seize their robes and bowls, the property and bedding of the saṃgha in the four directions, drive them out, bind them up at times, or chop off their heads.",
        "source": "T13n0410_004:0697b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_004:0697b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀親近惡行比丘者，為得幾所罪，乃至當墮阿鼻地獄。",
        "translation": "\"He observes that someone who approaches a monk who behaves badly will obtain how many sins he commits, up to the point of falling into the avīci hell.",
        "source": "T13n0410_004:0697b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眾生造作五逆等罪及四根本罪，誹謗賢聖誹謗正法，超過一切根本之罪。",
        "translation": "If sentient beings commit the five heinous crimes and the four fundamental sins, they will denigrate the good and noble and denigrate the right teaching, which exceeds all fundamental sins.",
        "source": "T13n0410_004:0697b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是惡行諸比丘等，我亦不聽刑罰鞭杖繫閉乃至斷命，以是因緣得大罪報，況復堅持禁戒清淨行者。",
        "translation": "I won't allow monks who behave badly like this to be punished by being whipped and caned, bound up and shut down, or even have their lives cut off, which would be a great punishment for such causes, let alone someone who adheres to the precepts and pure practices.",
        "source": "T13n0410_004:0697b29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘，於性重罪中若犯一罪者，雖犯重罪，和上眾僧和合羯磨，所受之戒猶有餘勢。",
        "translation": "If a monk commits one of the serious crimes in nature, then even though he's committed a serious crime, he'll still have residual power in the precepts he's received after harmonizing with the karma of the superior saṃgha.",
        "source": "T13n0410_004:0697c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如妙香雖無香質，餘分芬馨不可輕蔑。",
        "translation": "It's like a fine fragrance that has no fragrance, but the remaining parts are fragrant and shouldn't be despised.",
        "source": "T13n0410_004:0697c05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破戒比丘亦復如是，無戒白衣不應輕慢，雖非法器，於賢聖毘尼中，退沒墮落棄出家法，不得受用四方僧物；於眾僧和合所受得戒餘不犯者，其戒香氣多有勢力，是故不聽白衣謫罰。",
        "translation": "So it is with a monk who breaks the precepts; although a white robe without precepts shouldn't despise it even though it's not a vessel for the Dharma, it's good and noble, falls back, abandons the religious order, and can't accept the property of the four directions of the saṃgha; if the rest of the precepts received in the harmony of the saṃgha aren't violated, the fragrance of those precepts has much strength, so the white robe won't be allowed to take punishment.",
        "source": "T13n0410_004:0697c06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0410_004:0697c10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔過去有國名迦尸，時王名梵摩達多，勅旃陀羅言：『雪山下有六牙白象王，名欝波羅華眼，可拔其牙；若不得者，汝等五人悉斷其命。』",
        "translation": "Once upon a time there was a country named Kāsi, and the king's name was Brahmadatta. I commanded Candra, 'At the bottom of the snowy mountain there's a six-tusked white elephant king named Uppāraka-eye, whose tusks can be pulled; if you don't get them, all five of you will lose your lives.'",
        "source": "T13n0410_004:0697c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，旃陀羅護惜身命詐作沙門，外現精進被著袈裟，如王所勅往至彼山到象王所。",
        "translation": "At the time, Candra, guarding his life and pretending to be an ascetic, put on his outer robe of exertion and went to the elephant king's place on that mountain as the king had ordered.",
        "source": "T13n0410_004:0697c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母象見之，張弓挽箭生怖畏心，語象王言：『此是獵師，今已張弓挽箭而來，將非我等命欲盡耶？』」",
        "translation": "When the mother elephant saw him, she opened her bow and drew an arrow and became frightened, saying to the elephant king, 'Is this the hunter who's come with his bow and arrow, or is it not us who want to end our lives?'",
        "source": "T13n0410_004:0697c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，象王即便見之，剃除鬚髮被著袈裟，而說偈言：「『彼恒沙諸佛，　　幢相之法衣；　　悉捨於諸惡，　　云何害眾生？』",
        "translation": "\"Even then, the elephant king saw him, shaved off his hair, put on the reddish-brown robes, and spoke in verse, saying, 'Those buddhas of the sands of the Ganges, with their banners and dharma robes, have all abandoned evil, so why would they harm sentient beings?'",
        "source": "T13n0410_004:0697c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，母象復說偈言：「『身雖被袈裟，　　持弓執毒箭；　　作惡旃陀羅，　　無有悲愍心。』",
        "translation": "\"It was then that the mother elephant again spoke a verse, saying, 'Although he's wearing the reddish-brown robe, he holds a bow and poisoned arrow; he creates a bad caṇḍāla and has no compassion.'",
        "source": "T13n0410_004:0697c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，象王復說偈言：「『袈裟決定服，　　以哀愍為本；　　是必歸佛者，　　慈悲諸眾生。",
        "translation": "\"It was then that the elephant king again spoke the verse, \"The reddish-brown robe is a garment of determination, based on compassion; it must go to the Buddha, who is compassionate toward sentient beings.",
        "source": "T13n0410_004:0697c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於此衣無疑，　　汝當自攝心；　　能被此服者，　　欲度生死岸。』",
        "translation": "Have no doubt about this robe; collect yourself; those who can wear this robe will want to cross the shore of birth and death.'",
        "source": "T13n0410_004:0697c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，旃陀羅即以一毒箭射其象王。",
        "translation": "\"At that point, Candra then shot the king elephant with a poisoned arrow.",
        "source": "T13n0410_004:0698a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時母象見射象王已，大喚悲號，復說偈言：「『如是之衣服，　　應當歸依佛；　　威儀雖寂靜，　　而心懷大惡。",
        "translation": "Seeing the king elephant being shot, the mother elephant cried out in pity and spoke again in verse, saying, 'Such are your robes, so you must take refuge in the Buddha; although your manner is peaceful, your mind harbors great evil.",
        "source": "T13n0410_004:0698a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　速疾踏彼身，　　斷除其命根；　　滅此怨令盡，　　是射汝身者。』",
        "translation": "Quickly step on his body and cut off his life root; cease this enmity and make it end; this is the one who shot you in the body.'",
        "source": "T13n0410_004:0698a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，象王復說偈言：「『寧速捨身命，　　不應生惡心；　　彼雖懷惡心，　　猶似佛弟子。",
        "translation": "\"It was then that the elephant king spoke another verse, saying, \"Better quickly abandon your body and life than give rise to a bad mind; even though they harbor a bad mind, they're still like a disciple of the Buddha.",
        "source": "T13n0410_004:0698a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　智者不為己，　　卒暴起瞋心；　　常思為眾生，　　修行於菩提。』",
        "translation": "A wise man doesn't act out of anger for himself; he always thinks about the sake of sentient beings and cultivates bodhi.'",
        "source": "T13n0410_004:0698a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，象王心生慈悲，即喚彼人而問之言：『汝須何物？』",
        "translation": "\"At that point, the elephant king's heart became compassionate, and he summoned that man and asked him, 'What do you need?'",
        "source": "T13n0410_004:0698a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼便答言：『欲須汝牙。』",
        "translation": "He then answered, 'I want your tusks.'",
        "source": "T13n0410_004:0698a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，象王即自拔牙，發大誓願而說偈言：「『我今以白牙，　　求佛故奉施；　　不瞋不貪惜，　　令眾滅煩惱。』",
        "translation": "The elephant king then pulled out his own tusks, made a great vow, and spoke in verse, saying, 'Now, with my white tusks, I'm asking the Buddha to give them to me because I want them; I won't hate or cherish them, so that all people will cease their afflictions.'",
        "source": "T13n0410_004:0698a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0410_004:0698a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於往昔曾見如是畜生身中，求無上道能作如是，不惜身命為護佛法，終不於彼著袈裟者而作留難。",
        "translation": "I've seen such an animal in the past who sought the unsurpassed path and did so, spared his life to protect the Buddha's teaching, and never made trouble for someone wearing a monk's robe.",
        "source": "T13n0410_004:0698a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世，剎利旃陀羅、輔相旃陀羅、婆羅門旃陀羅、居士旃陀羅，以諂曲心欺於世間，不畏後世。",
        "translation": "In the future, the bhadra, auxiliary bhadra, brāhmaṇa bhadra, and householder bhadra will deceive the world with flattery and won't fear the afterlife.",
        "source": "T13n0410_004:0698a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸世間有求無上道者，入我法中而得出家，生心惱害我諸弟子，應成法器及不成者，惡口罵詈、鞭杖謫罰、逼切其身，於過去、未來、現在諸佛犯諸重罪，趣阿鼻地獄，斷諸善根除滅信心，一切智者之所遠離。",
        "translation": "If there are people in the world who seek the unsurpassed path, enter my teaching and leave home, become intent on harming my disciples, become worthy Dharma vessels or those who don't, badmouth and ridicule them, flog them, punish them with whips, force them to cut themselves, commit serious crimes against past, future, and present buddhas, go to the avīci hell, cut off their good roots, and cease their faith, all the wise ones will leave them.",
        "source": "T13n0410_004:0698a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如丈夫雖自無目能示他道，我諸弟子亦復如是，雖毀禁戒猶能利益世間眾生。",
        "translation": "Just as a man can show others the way even though he lacks eyes, so too can my disciples benefit sentient beings in the world even though they violate the precepts.",
        "source": "T13n0410_004:0698a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世旃陀羅王，乃至居士旃陀羅，見有依我法中出家，若成法器、不成法器，而便擾惱我諸聲聞一切弟子，則於三世無量諸佛作大過罪，消滅善心難復人身；何況毀呰正位聲聞、辟支佛，及諸大乘無量功德。",
        "translation": "If in some future king Candra or householder Candra sees someone leaving home based on my teaching who becomes a vessel for the teaching or doesn't become a vessel for the teaching and then disturbs all my śrāvaka disciples, that would be a great misdeed for measureless buddhas in the three worlds and would eliminate good intentions and make it difficult to resume their lives, not to mention disparaging the right-ranked śrāvakas, pratyekabuddhas, and other great vehicles with their measureless merits.",
        "source": "T13n0410_004:0698b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0410_004:0698b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如過去有國名般闍羅，王號勝軍，人罪應死，繫著可畏軻藍塚間，令使惡鬼食噉其身。",
        "translation": "Suppose there was a country named Banjara in the past, and the king's name was Victorious Army, and a person who deserved death for a crime was bound up in the dreaded Kharaskandha tomb and made to be eaten and eaten by bad spirits.",
        "source": "T13n0410_004:0698b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守獄人以五繫縛，送著可畏軻藍塚間。",
        "translation": "The jailer then put five fetters on him and sent him to the dreaded Kharaskandha.",
        "source": "T13n0410_004:0698b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人聞已即剃鬚髮，以納袈裟著於頸下。",
        "translation": "After hearing this, he shaved his hair and put his reddish-brown robe under his neck.",
        "source": "T13n0410_004:0698b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，守獄之人受王勅已，即捉縛送至可畏軻藍塚間。",
        "translation": "After receiving the king's order, the jailer then took the fetters and sent them to the Khor Khram tomb.",
        "source": "T13n0410_004:0698b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時塚間有羅剎，名曰惡眼，共五千羅剎俱至塚間，即見是人被五繫縛在於塚間，剃除鬚髮以納袈裟繫著於頸。",
        "translation": "There was a rājas named Evil Eye who arrived at the tomb with 5,000 rājas and saw this man bound by five fetters in the tomb, shaved off his hair, and tied the reddish-brown robe around his neck.",
        "source": "T13n0410_004:0698b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅剎右遶是人，而說偈言：「『今可自安慰，　　我終不害汝；　　剃髮服袈裟，　　令我憶念佛。』",
        "translation": "The rājasas then circled him to his right and spoke in verse, saying, 'Now you can comfort yourself, for I will never harm you; shave off your hair and put on the reddish-brown robe, so that I will remember the Buddha.'",
        "source": "T13n0410_004:0698b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎子復說偈言：「『白母甚飢渴，　　當須食此人；　　我得除飢渴，　　身心快安樂。』",
        "translation": "\"At the time, Rāṣṭrapāla again spoke the verse, saying, \"This white mother is so hungry and thirsty that she must feed on this person; I'll be able to relieve my hunger and thirst, and I'll be happy and comfortable in body and mind.\"",
        "source": "T13n0410_004:0698b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎母說偈答子：「『恒沙等諸佛，　　法式之幢相；　　於此起惡心，　　當墮阿鼻獄。』",
        "translation": "\"It was then that the Rāṣṭrapāla mother spoke a verse in reply to her son, 'Such are the buddhas of the sands, the banners of Dharma style, and if you have bad thoughts about them, you'll fall into Abhidharma.'",
        "source": "T13n0410_004:0698b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎子與其眷屬右遶匝已，而說偈言：「『我等父母共為惡，　　身、口、意等造不善；　　我已捨惡不害汝，　　被著染衣解脫相。』",
        "translation": "\"After circling to the right with his retinue, the son of Rāṣṭrapāla said, \"Our parents did evil together, and they created unwholesomeness in body, speech, and thought; now that I've abandoned evil and won't harm you, I'll be covered in dyed clothing and become liberated.\"",
        "source": "T13n0410_004:0698b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時羅剎名為牛齒，有五百眷屬，俱共圍遶入大塚間。",
        "translation": "\"It was then that the Rāṣṭrapāla named Ox-Tooth had five hundred members of his retinue who all circled him and went into a large tomb.",
        "source": "T13n0410_004:0698b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見被縛人剃除鬚髮，以納袈裟繫其頸下，右遶竟已而說偈言：「『歸依眾聖妙幢相，　　袈裟繫頸謂其人；　　我為此故而恭敬，　　唯願勿怖不害汝。』",
        "translation": "When he saw the bound man shave off his hair and tie a monk's robe around his neck, he finished circling to his right and spoke a verse, saying, 'I take refuge in the marvelous banners of the sages, and this man is described as having a monk's robe tied around his neck; for this reason I venerate him, and may you not be afraid or harmed.'",
        "source": "T13n0410_004:0698b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎子復說偈言：「『母今當知人肉美，　　應當食肉而飲血；　　益其氣力得具足，　　增益身體無所畏。』",
        "translation": "\"It was then that the Rāṣṭrapāla again spoke the verse, \"Now, Mother, you must know that human flesh is delicious; you must eat it and drink its blood; it will give you strength and fulfillment and will increase your body without fear.\"",
        "source": "T13n0410_004:0698c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎母復為其子而說偈言：「『一切世間眾樂具，　　天、龍、夜叉及羅剎；　　悉當恭敬染衣者，　　當獲種種上妙樂。』",
        "translation": "\"It was then that the Rāṣṭrapāla mother again spoke a verse for her son, saying, \"All the world's pleasures are fully present, and gods, dragons, yakṣas, and rājas should all revere those who dye their robes, for they will attain all kinds of wonderful happiness.\"",
        "source": "T13n0410_004:0698c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎子與其眷屬，右遶恭敬而說偈言：「『悉應恭敬而歸依，　　剃除鬚髮著袈裟；　　我於過去無數劫，　　見佛世尊救世者。』",
        "translation": "\"At the time, the son of Rāṣṭrapāla and his retinue circled to his right in respect and said, \"Should you all venerate and take refuge in him, shave off your hair and put on the reddish-brown robes; in the countless eons of the past, I've seen the Buddha, the world-honored one, save the world.\"",
        "source": "T13n0410_004:0698c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，第三羅剎名曰黃髮，亦有五千眷屬，而自圍遶入大塚間。",
        "translation": "\"At the time, a third rāṣṇa named Yellowhead, who also had 5,000 members of his retinue, surrounded himself and went into a large tomb.",
        "source": "T13n0410_004:0698c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見被縛人剃除鬚髮，繫納袈裟而著頸下，復右遶已而說偈言：「『仙人幢相我歸依，　　若能供養得勝利；　　為袈裟故修供養，　　應悉除斷諸有縛。』",
        "translation": "He shaved off his hair, tied his reddish-brown robe around his neck, and went around to his right, saying, 'I take refuge in the sage's banner, and if I can make offerings to him, I'll get surpassing benefits; cultivate offerings for the sake of the reddish-brown robe, and I'll completely remove all the bonds that exist.'",
        "source": "T13n0410_004:0698c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，黃頭羅剎子而說偈言：「『我得此人應食噉，　　國王所遣故來此；　　當食其肉復飲血，　　母語子言應供養。』",
        "translation": "\"It was then that the yellow-headed Rāṣṭrapāla spoke this verse, \"I found this person to eat and devour, and the king sent me here because I was sent here; I will eat his flesh and drink his blood, and my mother told my son to make offerings.\"",
        "source": "T13n0410_004:0698c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，黃頭羅剎復為其子而說偈言：「『如是相人非我食，　　若起惡心大苦器。』",
        "translation": "\"It was then that the yellow-headed Rāṣṭrapāla again spoke a verse for his son, saying, 'Such a person with these characteristics is not mine to eat, and if he develops bad thoughts, he'll be a great vessel of suffering.'",
        "source": "T13n0410_004:0698c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎子右遶恭敬，復說偈言：「『如是大仙堪福田，　　是故應供離有縛。』",
        "translation": "\"At the time, the Rāṣṭrapāla's son circled to his right and venerated him, again speaking in verse, 'Such a great man is a field of merit; therefore, you should make offerings to him and leave the bonds of existence.'",
        "source": "T13n0410_004:0698c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，刀口羅剎復與五千羅剎來到塚間，見繫縛者剃除鬚髮，以納袈裟繫其頸下，心恭敬已而說偈言：「『有餘生死得涅槃，　　納袈裟者不應害；　　若害此人佛所呵，　　應當尊重而供養。』",
        "translation": "\"It was then that the Rāṣṭrapāla with the Sword's Mouth Rāṣṭrapāla and 5,000 other Rāṣṭrapāla came into the tumulus and saw the man bound to him with his hair shaved off and his reddish-brown robe tied around his neck. After venerating him, he said, \"That man who takes the reddish-brown robe should not be harmed; if he harms this man, the Buddha will scold him, so he should be honored and offered up.\"",
        "source": "T13n0410_004:0698c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎子復說偈言：「『我等常吸人精氣，　　食噉其肉復飲血；　　是故當食此眾生，　　令我身體益氣力。』",
        "translation": "\"It was then that the Rāṣṭrapāla again spoke the verse, \"We always suck the energy out of people, eating and devouring their flesh and drinking their blood; therefore, I will eat this sentient being to give my body more energy.\"",
        "source": "T13n0410_004:0699a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎母復為其子而說偈言：「『若有生心欲加害，　　剃除鬚髮袈裟者；　　必墮惡趣阿鼻獄，　　受苦無量甚長遠。』",
        "translation": "\"It was then that the mother Rāṣṭrapāla again spoke a verse for her son, saying, \"If there's anyone born with the intention to harm them, they'll shave off their hair and robes and surely fall into the bad destiny of avīci, where they'll suffer immeasurably and for a long time.\"",
        "source": "T13n0410_004:0699a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎子與其眷屬，右遶被縛著袈裟者，復說偈言：「『我今怖畏地獄苦，　　終不惡心害汝命；　　我等同心當放汝，　　亦求解脫地獄苦。』",
        "translation": "\"At the time, the Rāṣṭrapāla and his retinue surrounded the man bound in the reddish-brown robes to the right and spoke again, \"Now, I'm afraid of the pain of hell, but I will never harm your life with evil intent; with one accord, we will release you, and we will seek to be freed from the pain of hell.\"",
        "source": "T13n0410_004:0699a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，羅剎等即便解放彼被縛人。",
        "translation": "\"At that point, the rājas and others even freed the bound man.",
        "source": "T13n0410_004:0699a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時被縛人，待至天明到於王所。",
        "translation": "The bound man then waited until daybreak and went to the king.",
        "source": "T13n0410_004:0699a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即廣告一切人民，諸人集已皆請問王及侍從左右群臣百官：『是人得來未曾有也。』",
        "translation": "The king then advertised to all the people, and when they gathered, they asked the king and the ministers and officials who were serving him, 'This person has never been seen before.'",
        "source": "T13n0410_004:0699a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王即便立制普告內外：『若我國中，有佛、聲聞諸弟子等，若成法器及不成者，不起恭敬或加謫罰。",
        "translation": "The king then established a rule and universally told both inside and outside, 'Suppose there were buddhas and śrāvaka disciples in my country who become Dharma-vessels or who don't become such, and they don't show respect or are subject to punishment.",
        "source": "T13n0410_004:0699a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，我當刑戮乃至致死。』",
        "translation": "For this reason, I will punish them with death.'",
        "source": "T13n0410_004:0699a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "族姓子！",
        "translation": "Sons of great clans!",
        "source": "T13n0410_004:0699a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提王及與夜叉食血肉者，惡心熾盛無憐愍心，乃至見剃除鬚髮，繫納袈裟以著其頸，尚不加害，況餘眾生而起輕慢。",
        "translation": "\"The king of Jambudvīpa and his fellow yakṣas who eat flesh and blood are so malevolent and lack compassion that when they see their hair shaved off and their robes tied around their necks, they don't harm them, so why wouldn't other sentient beings despise them?",
        "source": "T13n0410_004:0699a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，當有剎利旃陀羅、居士旃陀羅造作諸惡，復有惡鬼斷於善根趣阿鼻地獄。",
        "translation": "In a future life, there will be a warrior candra or householder candra who commits various evils, and there will be another evil spirit who ends good roots and goes to the avīci hell.",
        "source": "T13n0410_004:0699a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於我法而能出家，若成法器及不成法器，剃除鬚髮當奪命根。",
        "translation": "If someone leaves home because of my teaching, and if they become a Dharma vessel or don't become a Dharma vessel, shaving off their hair will take their life root.",
        "source": "T13n0410_004:0699a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「族姓子！",
        "translation": "\"Clansmen!",
        "source": "T13n0410_004:0699a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如過去有王名曰福德，若人有犯罪過者乃至繫縛。",
        "translation": "\"Suppose there was a king in the past named Fude, and if a person committed a crime, they would be bound.",
        "source": "T13n0410_004:0699a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼王不欲奪人身命，有輔相大臣語王莫愁，若殺此人或能令王而得大罪；大臣自以智慧將付狂象。",
        "translation": "At the time, that king didn't want to take his life, but an auxiliary minister told the king not to worry about it because killing this person might cause the king to commit a great crime; the minister himself then used his wisdom to deliver it to the mad elephant.",
        "source": "T13n0410_004:0699a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，狂象捉其二足欲撲其地，而見此人著染色衣故，狂象即便安徐置地，不敢損傷共對蹲坐，以鼻舐足而生慈心。",
        "translation": "At the time, the mad elephant grabbed his two feet and wanted to throw them to the ground, but when he saw this man wearing dyed clothing, the mad elephant calmly placed them on the ground, didn't dare to harm them, and sat down facing each other with its trunk licking its feet, giving rise to a compassionate attitude.",
        "source": "T13n0410_004:0699a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "族姓子！",
        "translation": "Sons of the clan!",
        "source": "T13n0410_004:0699b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象是畜生墮於八難，見染衣人尚不加惡生於害心。",
        "translation": "Like an animal that's fallen into the eight difficulties, seeing a person with dyed clothing doesn't yet cause evil and give rise to harmful thoughts.",
        "source": "T13n0410_004:0699b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至未來世若有旃陀羅王，見我法中有人出家，堪任法器及不成法器，故作逼惱或奪其命；若作是行則口不能語，命終之後必定墮於阿鼻地獄。",
        "translation": "It could be that in a future life, if King Candra sees someone in my teaching who leaves home and becomes a suitable vessel for the teaching or doesn't become a vessel for the teaching, he might oppress or take his life; if he does that, then he won't be able to speak, and when his life ends, he'll surely fall into the avīci hell.",
        "source": "T13n0410_004:0699b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_004:0699b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第三輪。",
        "translation": "This is called the third wheel.",
        "source": "T13n0410_004:0699b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎利旃陀羅，乃至居士旃陀羅，雖有過去宿殖善根，現造惡故今盡消滅。",
        "translation": "Although a warrior candra or a householder candra has long-established good roots in the past, they now completely disappear because of the bad roots they've created in the present.",
        "source": "T13n0410_004:0699b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0410_004:0699b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當有剎利旃陀羅乃至居士旃陀羅，見有施四方僧物，床敷、臥具，塔廟、住處及與園林、屋舍、田宅，一切淨人、牛、驢、騾、馬種種畜生，衣服、飲食、湯藥所須資生雜物，持戒清淨有德比丘辯才聰明言辭應機，如是人等悉不與之；破戒比丘作惡行者，給其所須床褥敷具，自恣受用并與白衣同共食噉。",
        "translation": "Suppose there's a *Bhadra Candra or a householder Candra who sees a donor who gives property to the saṃgha in four directions, bed and bedding, a stūpa, a dwelling place, a garden, a house, a field, all the pure animals like humans, cattle, donkeys, mules, horses, and various necessities for clothing, food, drink, and medicine, and a well-established, pure, and virtuous monk who's eloquent and intelligent and whose words match his abilities; such a person wouldn't give it to him; a monk who breaks the precepts and commits a bad act would be given the necessary bed and bedding, given it for his own enjoyment, and would eat and bite it with the white coat.",
        "source": "T13n0410_004:0699b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，剎利旃陀羅、居士旃陀羅，命終皆墮阿鼻地獄。",
        "translation": "As a result, the warrior candra and the householder candra all fall into the avīci hell at the end of their lives.",
        "source": "T13n0410_004:0699b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T13n0410_004:0699b19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當有剎利旃陀羅、居士旃陀羅，見有依我法中出家，若聲聞、辟支佛，乃至大乘說法法師，誹謗罵辱欺誑正法，而作留難惱亂法師；以是因緣，墮阿鼻地獄。",
        "translation": "Suppose there's a warrior candra or householder candra who sees a renunciant in my teaching who's a direct disciple of a śrāvaka, pratyekabuddha, or even a great vehicle preacher of the Dharma and denigrates, abuses, and deceives the true teaching, then causes trouble and distress to the preacher; as a result, he'll fall into the avīci hell.",
        "source": "T13n0410_004:0699b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T13n0410_004:0699b23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有剎利旃陀羅、居士旃陀羅，見人有與四方僧物，華樹、果樹、雜味樹、蔭樹、香樹，我聲聞弟子持戒多聞坐禪誦習者，所有資生眾具，若自奪或使人奪，自食使人食；以是因緣，命終之後墮阿鼻地獄。",
        "translation": "\"If a warrior candra or householder candra sees someone who has the property of the four directions of the saṃgha, including the flower and fruit trees, the mixed-meal tree, the shade tree, and the fragrance tree, or my śrāvaka disciples who observe precepts and are well-versed in sitting, meditating, and chanting, and who possesses the necessities of life, and if they take it from themselves or have it taken from them, or if they eat it and have it eaten by others, then they'll fall into the avīci hell after their lives end because of that cause.",
        "source": "T13n0410_004:0699b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T13n0410_004:0699b28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世，當有剎利旃陀羅、居士旃陀羅毀壞我法，若見依我法中而出家者，於此人所數數瞋恚、罵詈、毀辱，我所說法不肯信受，破壞塔寺、僧坊、堂舍、殺害比丘，先所修習一切善根皆悉滅盡。",
        "translation": "In a future life, there will be a warrior candra or householder candra who disparages my teaching, and if he sees a renunciant relying on my teaching, he'll repeatedly become angry with that person, ridicule and insult them, refuse to accept my teaching, destroy a stūpa, a monastery, or a hall, and kill a monk, so all the good roots he cultivated in the past will be destroyed.",
        "source": "T13n0410_004:0699b28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命欲終時，支節皆疼如火焚燒，其人舌根如被繫縛，於多日中口不能語；命終之後墮阿鼻地獄。",
        "translation": "When his life is about to end, his limbs will hurt like fire, and his tongue will be tied up like a fetter, so he won't be able to speak for many days; after his life ends, he'll fall into the avīci hell.",
        "source": "T13n0410_004:0699c04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就如是十種惡輪不善眾生，難得人身，況復能成聲聞、辟支佛果，乃至成就具足大乘，一切諸佛所不能救。",
        "translation": "If these ten kinds of unwholesome sentient beings who complete the evil cycle have difficulty attaining human life, how could they attain the fruit of śrāvaka and pratyekabuddha, or even achieve the full accomplishment of the great vehicle, which is beyond the ability of all the buddhas to save.",
        "source": "T13n0410_004:0699c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0410_004:0699c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如押油，一一麻中皆生諸蟲，以押油輪而押取之即便得油。",
        "translation": "\"It's like staking oil, for which worms grow in each piece of hemp, and staking it with an oil wheel to get the oil.",
        "source": "T13n0410_004:0699c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_004:0699c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當看押油之人，於其日夜為應定殺幾所眾生。",
        "translation": "You must examine how many sentient beings a person who consigns oil must surely kill each day and night.",
        "source": "T13n0410_004:0699c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，以是十輪而押油者，一輪一日一夜押油千斛，如是乃至滿於千年，是押油人得幾所罪？」",
        "translation": "If another person takes oil from these ten wheels, and one wheel takes a thousand cubic yards of oil a day and a night, and so on up to a thousand years, how much of a crime does that person take?\"",
        "source": "T13n0410_004:0699c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏菩薩言：「甚多，世尊！",
        "translation": "Kṣitigarbha Bodhisattva said, \"Very much, Bhagavān!",
        "source": "T13n0410_004:0699c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無邊阿僧祇數，此押油人得如是罪。",
        "translation": "Measureless and limitless are the incalculable number of times this person in oil has committed such a sin.",
        "source": "T13n0410_004:0699c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有能知是人罪量其數多少，唯佛與佛乃能知之。」",
        "translation": "No one can know the amount or number of this person's sins except the Buddha and the buddhas.\"",
        "source": "T13n0410_004:0699c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T13n0410_004:0699c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如十輪之罪等一婬女舍，其舍有十女人皆為求欲。",
        "translation": "\"It's like the sin of ten rounds being equal to one house of a woman who's a prostitute, and there are ten women in that house who are all seeking after it.",
        "source": "T13n0410_004:0699c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十婬女舍，其罪等一酒家；如是十酒家等一屠兒舍；如是十屠兒舍罪等剎利旃陀羅、居士旃陀羅十輪中等於一輪一日一夜罪。」",
        "translation": "Thus, the ten houses of sexual misconduct are equal to one restaurant, and thus the ten restaurants are equal to one butcher's house; thus the ten butcher's houses are equal to the ten rounds of crimes of a warrior candra or a householder candra, which are equal to one round of one-night crimes.\"",
        "source": "T13n0410_004:0699c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「十輪罪等一婬舍，　　十婬罪等一酒家，　十酒家等一屠兒，　　十屠兒罪等一王。」",
        "translation": "At that point, the Bhagavān spoke in verse, saying, \"Ten wheel sins equal one house of prostitution, ten prostitution sins equal one restaurant, ten restaurants equal one butcher's house, and ten butcher's sins equal one king.\"",
        "source": "T13n0410_004:0699c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，地藏菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that Kṣitigarbha Bodhisattva Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0410_004:0699c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有真善剎利輔相大臣、真善沙門、真善婆羅門、真善居士，自護護他，於將來世守護佛法，守護堪任法器及不堪法器者，乃至守護剃除鬚髮著染衣者，持戒清淨有功德者，供養恭敬聽受言教，於聲聞、辟支佛法，皆悉守護，諦聽受持守護大乘，如聞信受住大乘者，持戒多聞言辭清辯，與如此人對相歡娛，則心悅樂諮問議論敬受教誨；遠離破戒非梵行者，四方僧物而自食噉，私竊費用不依戒律，隨順十惡不善輪者，亦令捨離不與從事；教學先王治國舊法典禮制度，紹三寶種常令熾然，親近一切諸善知識，遵用前王所行政法，是名真善剎利。",
        "translation": "If there are truly good bhadra ministers, truly good ascetics, truly good priests, and truly good householders who guard themselves and protect others, guard the Buddha's teaching in future generations, guard those who are worthy of the Dharma vessel and those who aren't worthy of the Dharma vessel, guard those who shave off their hair and wear dyed clothing, observe precepts that are pure and meritorious, make offerings and respect, listen to and accept the teachings, guard the teachings of the śrāvakas and pratyekbuddhas, listen closely to those who believe and accept the great vehicle, observe precepts and are well-versed in the eloquence of language, and enjoy the company of such people, then their hearts are pleased with their inquiries and discussions, and they respect and accept the teachings.",
        "source": "T13n0410_004:0699c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得幾所福？",
        "translation": "How much merit has he attained?",
        "source": "T13n0410_004:0700a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅幾所罪？」",
        "translation": "How many sins will be extinguished?\"",
        "source": "T13n0410_004:0700a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「族姓子！",
        "translation": "The Buddha said, \"Clansman!",
        "source": "T13n0410_004:0700a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如丈夫欲求出世，集諸珍寶滿閻浮提。",
        "translation": "\"It's like a husband who wants to transcend the world and gather all the treasures to fill Jambudvīpa.",
        "source": "T13n0410_004:0700a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若值佛出并聲聞眾，於其晨朝修行布施，日中亦施，如是次第乃至千年，常修布施種種供養。",
        "translation": "If the Buddha were to appear and the śrāvakas were to cultivate generosity in the morning and give in the middle of the day, they would always cultivate generosity and make offerings in this order for a thousand years.",
        "source": "T13n0410_004:0700a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "族姓子！",
        "translation": "Clansmen!",
        "source": "T13n0410_004:0700a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是行施得大福不？」",
        "translation": "Will this kind of generosity obtain great merit?\"",
        "source": "T13n0410_004:0700a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏菩薩白佛言：「世尊！",
        "translation": "Kṣitigarbha Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0410_004:0700a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其福甚多，無量無邊阿僧祇數，無能稱量如此福者；唯佛世尊乃能知之。」",
        "translation": "Its merits are so great that they are countless and limitless, and there's no one who can measure such merits; only the Bhagavān can know them.\"",
        "source": "T13n0410_004:0700a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, \"So it is!",
        "source": "T13n0410_004:0700a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "\"As you said.",
        "source": "T13n0410_004:0700a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有真善剎利，遠離不善十惡之輪，亦能遮制斷他諸惡如上所說，是人功德倍多於前。",
        "translation": "If there's a truly good bhadra who's free of the cycle of the ten unwholesome evils and can restrain and stop the evils of others as explained above, this person's merits are twice as great as the previous ones.",
        "source": "T13n0410_004:0700a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假設有人，以四天下盡為四方眾僧建立房舍，臥具、醫藥悉皆給足，使百千億聲聞弟子及菩薩摩訶薩，修行種種無量法門，坐禪、誦經、教化諸善，如此之人其福多不？",
        "translation": "Suppose someone were to use the whole of the four heavens to build a dwelling for the four directions of monks and nuns, providing them with sufficient bedding and medicine, and causing 10,000,000,000 śrāvaka disciples and bodhisattvas and mahāsattvas to practice various measureless methods, sit in meditation, recite sūtras, and teach goodness, wouldn't that person be very fortunate?",
        "source": "T13n0410_004:0700a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於上千年修行布施，供養功德復倍於前。",
        "translation": "After cultivating almsgiving for the past thousand years, the merit of making offerings is doubled.",
        "source": "T13n0410_004:0700a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假設有人於四天下，盡為建立僧房、堂閣，臥具、醫藥皆悉具足，滿百千億聲聞弟子、菩薩摩訶薩，修諸法門一切諸善，坐禪、誦經、教化功德得幾所福？」",
        "translation": "Suppose someone were to build a monk's residence or hall, complete with bedding and medicine, and fill it with 100,000,000,000 śrāvaka disciples and bodhisattvas, cultivating all the good qualities of the various teachings, how much merit would they attain from sitting in meditation, chanting sūtras, and the virtues of teaching?\"",
        "source": "T13n0410_004:0700a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T13n0410_004:0700a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所得福，無量無邊阿僧祇數。」",
        "translation": "The merits they obtain are countless and limitless, incalculable.\"",
        "source": "T13n0410_004:0700a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0410_004:0700a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假設滿三千大千世界，為舍利故起諸塔廟，遍滿三千大千世界。",
        "translation": "Suppose he were to fill 3,000 great worlds with stūpas and temples built for the sake of relics, and they were to fill 3,000 great worlds.",
        "source": "T13n0410_004:0700a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是造塔功德無量，其福日夜常得增長，四方造作僧房，臥具、醫藥所須一切悉給，起塔功德復倍於前。",
        "translation": "Such a stūpa would have immeasurable merit, and its fortune would always increase day and night, and it would build a monks' residence in each direction, providing everything needed for bedding and medicine, and raising stūpas would have even greater merit than before.",
        "source": "T13n0410_004:0700b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使三千大千世界滿中菩薩，具足六波羅蜜如稻麻、竹葦，設滿三千大千世界聲聞羅漢具八解脫，亦如稻麻、竹葦、叢林，皆被囚執堅固繫縛乃至一劫。",
        "translation": "Suppose there were a bodhisattva in the full 3,000,000 worlds who fulfills the six perfections like rice and hemp, or suppose there were a śrāvaka arhat in the full 3,000,000 worlds who fulfills the eight liberations like rice and hemp, bamboo and reeds, or a jungle, and they're all held captive and firmly bound for an eon.",
        "source": "T13n0410_004:0700b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一人出現於世，為福因緣故，悉解諸菩薩及阿羅漢被繫縛者，并與洗浴，給其衣服、瓶鉢、房舍、飲食、醫藥、種種臥具，乃至百千萬歲盡入涅槃。",
        "translation": "Then, a person appears in the world who, for good reasons, releases all the bodhisattvas and arhats who are fettered, washes them, and gives them robes, bottles, bowls, housing, food, medicine, and various bedding, so that they'll enter nirvāṇa at the end of a hundred million years.",
        "source": "T13n0410_004:0700b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復取舍利而供養之，為一一舍利起七寶塔，供養如是七寶塔故，各以香華及諸伎樂、繒蓋、幢幡。",
        "translation": "He then takes the relics and makes offerings to them, erecting seven-jeweled stūpas for each one, and making offerings to each of these seven-jeweled stūpas with fragrant flowers, music, silken canopies, and banners.",
        "source": "T13n0410_004:0700b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，為如來故起諸塔廟，乃至滿三千大千世界，其所得福百千億分，不如解此被縛功德。",
        "translation": "If someone were to erect stūpas and temples for the Tathāgata's sake that would fill 3,000 great thousand worlds, the merit they would attain wouldn't be as great as the virtue of being freed from this bondage.",
        "source": "T13n0410_004:0700b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真善剎利、真善婆羅門、真善居士、真善沙門，如是福聚增長無量阿僧祇數。",
        "translation": "Such a stock of merit of truly good bhadra, truly good brāhmaṇas, truly good householders, and truly good ascetics would increase immeasurably and incalculably.",
        "source": "T13n0410_004:0700b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於末法中法欲滅時，能善自護亦護他人，於未來世常護佛法，亦復護我聲聞弟子，堪任法器及不任者，乃至剃除鬚髮、被著袈裟，不應嬈亂而作惱害。",
        "translation": "When the Dharma is about to end in the final period, they can skillfully protect themselves and others, always protect the Dharma in the future, and protect my śrāvaka disciples, those who are fit to serve as Dharma vessels and those who aren't, even when they shave off their hair and put on the reddish-brown robes, so they won't be disruptive and cause harm.",
        "source": "T13n0410_004:0700b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有親近供養聲聞乘者，亦不得惱亂，亦復不應願樂供養；於大乘者，終不欺毀；修辟支佛乘者，亦自親近供養；堅固受持大乘之法安住大乘有功德者，善巧機辯恒樂親近諮問義論，問已隨順受持，而於一切惡行比丘皆悉遠離，不應與同四方僧食共受利養。",
        "translation": "If someone makes offerings to the vehicle of the śrāvakas, they won't be disturbed, and they shouldn't wish to make offerings; they'll never deceive those who are devoted to the great vehicle; they'll make offerings to those who cultivate the vehicle of the solitary buddhas; they'll firmly maintain the teachings of the great vehicle, abide in the merit of the great vehicle, skillfully and eloquently consult the doctrine in close proximity, and after asking about it, they'll readily accept it; they'll avoid all monks who engage in bad behavior, and they won't share the benefits of the same four directions of saṃgha food.",
        "source": "T13n0410_004:0700b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自不染著十惡之輪，亦不教他令生染著，皆悉修習先王之道具行十善，常當親近諸善知識熾然法眼。",
        "translation": "He doesn't defile himself with the wheel of the ten evils, and he doesn't teach others to defile him, cultivating all the ten good qualities proffered by the previous king and always approaching good teachers with the blazing Dharma eye.",
        "source": "T13n0410_004:0700b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是真善剎利，得福倍多無量無邊，終不虛食國民祿俸；天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽，乃至富多那等，皆悉愛念同共擁護者。",
        "translation": "Thus, truly good bhadra obtains measureless and unlimited fortune, never wasting their salaries as a citizen, and gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, mahoragas, and even pūtanas all cherish those who uphold them together.",
        "source": "T13n0410_004:0700c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有一切堪任福田成法器者，皆悉愛念，同共擁護己國增長。",
        "translation": "If there are any people who could serve as fields of merit and become vessels of the Dharma, they all love and remember them, and they all work together to protect their own country and make it grow.",
        "source": "T13n0410_004:0700c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若他國土亦令增廣，涸竭惡道利益天人，守護壽命令得久長，自滅結使亦能滅他一切煩惱，成就菩提滿足六波羅蜜；遠離一切惡道，而隨生死流轉無數，於生死中而無譏嫌，常值善知識，悉與諸佛菩薩共俱。",
        "translation": "If other lands also increase in size, they dry up bad destinies for the benefit of gods and humans, safeguard their long lives, order them to be long, extinguish their own bonds and tendencies, extinguish all other afflictions, achieve enlightenment, and fulfill the six perfections; they're free of all bad destinies, follow the countless transitions of birth-and-death, have no criticism during birth-and-death, always meet good teachers, and always join the buddhas and bodhisattvas.",
        "source": "T13n0410_004:0700c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠惡知識，如是不久成就佛國，得阿耨多羅三藐三菩提。」",
        "translation": "Being far from bad teachers, they'll soon achieve the Buddha Land and attain unsurpassed, correct enlightenment.\"",
        "source": "T13n0410_004:0700c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，一切天帝及諸眷屬，乃至毘舍闍帝釋及諸眷屬，從坐而起合掌向佛，白佛言：「世尊！",
        "translation": "At the time, all the gods and their retinues, even Vaiśravaṇa and his retinues, rose from their seats, put their palms together, and bowed their heads to the Buddha, saying, \"Bhagavān!",
        "source": "T13n0410_004:0700c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世，有真善剎利王乃至真善居士，若能遠離此十惡輪，守護己身亦能護他，及護持正法紹三寶種，熾然不斷成熟三乘，於佛所說悉能信受如法供養，諸佛所說終不覆藏。",
        "translation": "\"In a future life, if there's a truly good Bṛhatphala king or truly good householder who can part with these ten bad turns, guard himself, protect others, and safeguard the right Dharma, preserve the seeds of the Three Treasures, and blaze forth to continuously ripen the three vehicles, they'll be able to faithfully accept what the Buddha teaches and make offerings according to the Dharma, and what the Buddha teaches will never be hidden.",
        "source": "T13n0410_004:0700c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等眷屬，與真善剎利王乃至真善居士，當以十法守護此人令得增長。",
        "translation": "Our retinue, along with the truly good Śāriputra and the truly good householder, will guard this person with ten things so that he can grow.",
        "source": "T13n0410_004:0700c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0410_004:0700c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為護壽命終不橫死；除諸非法常得少病；眷屬安隱財產增長；具足大富名稱遠聞；親近善知識智慧增長。",
        "translation": "He protects his life so that he never dies horribly, is freed from unlawful behavior and always attains few illnesses, has his retinue secure and increased in possessions, is endowed with great wealth and renown, and is heard far and wide, and becomes close to good teachers who increase his wisdom.",
        "source": "T13n0410_004:0700c21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是真善剎利，乃至真善居士，遠離一切十惡輪者，如佛所說，當以十種善法而守護之令得增長。",
        "translation": "Thus, a truly good warrior or a truly good householder who's free of the ten evil wheels will, as the Buddha has taught, guard and protect them with ten kinds of good qualities so that they may increase.",
        "source": "T13n0410_004:0700c23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0410_004:0700c26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂怨賊外敵不能侵害；色、聲、香、味、觸無不可憙者；一切病痛，邪縛，邪歸依，一切疑悔，一切邪諂，一切惡友，一切不善根本，一切夭橫死亡，真善剎利具足功德，如上所說皆悉除滅，當以十善法守護是人。",
        "translation": "It means that external enemies who hate people and thieves can't harm them; there's nothing about form, sound, odor, taste, or touch that can't be jealously guarded; all illness, pain, wrong bonds, wrong attachments, all doubts and regrets, all wrong flattery, all bad friends, all unwholesome roots, all premature deaths, and truly good bases full of merit are all removed as explained above, and this person should be guarded by the ten good qualities.",
        "source": "T13n0410_004:0700c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，世尊！",
        "translation": "\"Furthermore, Bhagavān!",
        "source": "T13n0410_004:0701a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真善剎利，如上所說功德滿足皆悉修行，我當以此十法，守護剎利國土之人。",
        "translation": "\"If these truly good bhadras all cultivate the fulfillment of the merits described above, I will guard the people of the bhadra's land in these ten ways.",
        "source": "T13n0410_004:0701a02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0410_004:0701a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懼隣國怨敵，畏非人，畏於亢旱，畏於霖雨，畏非時風，畏非時惡星變怪，畏飢饉，畏非時病死，畏惡邪見，畏真善剎利。",
        "translation": "They fear enemies in neighboring countries, non-people, excessive drought, rain, unseasonable winds, unseasonable misbehavior of stars, famine, unseasonable illness and death, bad and wrong views, and truly good bharis.",
        "source": "T13n0410_004:0701a04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於上所說能修行者，我等當以十法，守護國土及諸人民。」",
        "translation": "Those of us who can practice what's described above will guard the land and its people with these ten things.\"",
        "source": "T13n0410_004:0701a07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚天帝釋乃至富多那等：「善哉，善哉！",
        "translation": "At that point, the Bhagavān praised Śakra and even Pūtanā, \"Good, good!",
        "source": "T13n0410_004:0701a09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_004:0701a10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆是汝等之所應作。」",
        "translation": "All of you should do this.\"",
        "source": "T13n0410_004:0701a10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天藏大梵即從坐起，整其衣服，右膝著地長跪叉手，白佛言：「世尊！",
        "translation": "At that point, the Mahābrahma Tenzō rose from his seat, adjusted his robes, knelt down on his right knee, saluted with his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T13n0410_004:0701a10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願聽我說。",
        "translation": "\"May I please be heard to explain this.",
        "source": "T13n0410_004:0701a12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是真善剎利，轉不退轉地陀羅尼心呪章句，以此不退轉地陀羅尼神呪力故，使未來世真善剎利，令邊國怨敵自然退散；使身、口、意戒成就；得勝智慧，為一切智人之所讚歎；遠離諸惡常修行善；遠離一切邪見邪歸依；精進堅固成熟無量諸眾生故得自在智；六波羅蜜珍寶伏藏具足增長；遠離一切瞋恚、慳貪、諸惡嫉妬；常為天人之所守護；得不退轉菩提之心；不捨一切眾生；得四攝法無所疑問；成熟法器具足福田；親近菩薩、諸聲聞眾利益一切。",
        "translation": "是真善剎利，轉不退轉地陀羅尼心呪章句，以此不退轉地陀羅尼神呪力故，使未來世真善剎利，令邊國怨敵自然退散；使身、口、意戒成就；得勝智慧，為一切智人之所讚歎；遠離諸惡常修行善；遠離一切邪見邪歸依；精進堅固成熟無量諸眾生故得自在智；六波羅蜜珍寶伏藏具足增長；遠離一切瞋恚、慳貪、諸惡嫉妬；常為天人之所守護；得不退轉菩提之心；不捨一切眾生；得四攝法無所疑問；成熟法器具足福田；親近菩薩、諸聲聞眾利益一切。",
        "source": "T13n0410_004:0701a12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_004:0701a23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真善剎利，終不退轉菩提之心，得陀羅尼神力功德，於未來世最勝不壞無所譏嫌，常親近諸佛一切菩薩。」",
        "translation": "A truly good warrior who never backslides from the mind of enlightenment, attains the spiritual powers and virtues of a dhāraṇī, is most excellent and indestructible in future lives, and always draws near to the buddhas and all bodhisattvas.\"",
        "source": "T13n0410_004:0701a23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天藏大梵即說呪曰：「多闍他　牟尼置梨　牟那舍囉鞞　牟尼夷梨地夜　末啼盧闍毘闍隷　牟那栗芝　阿昵伽彌　[口*叔]迦羅博差　波羅舍博差　蜜羅博差　掃囉裟栗啼　兜羅挐栗隸鉢哆叉栗婆隸　舊舊拏彌隸　阿鞞叉婆婆阿[少/兔]阿祇梨梵　牟尼波陀鞞　私婆呵」爾時，天藏大梵說是呪已，白佛言：「我願世尊，於此陀羅尼心生隨喜。」",
        "translation": "It was then that the Mahābrahma of the Heavenly Treasury spoke the dhāraṇī, saying, \"Doñcāraka, Muniśālva, Muniśālva, Muniśirītiya, Mahāloo-vijayagupta, Muna-rīji, Aniruddha- [kowtowns] Kālapāśa, Pārasyapāśa, Mīlapāśa, Saṃsa-rīpaṇa, Dhūra-rīji, Pātakas-rīpaṇa, Pātakas-rīpaṇa, Pātakas-rīpaṇa, and Pātakas-rīpaṇa.\" After reciting this dhāraṇī, the Mahābrahma of the Heavenly Treasury said to the Buddha, \"I wish, Bhagavān, that this dhāraṇī would give rise to delight in my heart.\"",
        "source": "T13n0410_004:0701a26_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T13n0410_004:0701b05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大梵！",
        "translation": "Brahma!",
        "source": "T13n0410_004:0701b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於此呪心生歡喜。」",
        "translation": "My heart rejoices at this dhāraṇī.\"",
        "source": "T13n0410_004:0701b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時會大眾亦稱：「善哉！",
        "translation": "The assembly then also said, \"Good!",
        "source": "T13n0410_004:0701b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快說此陀羅尼耶！」",
        "translation": "Quickly explain this dhāraṇī!\"",
        "source": "T13n0410_004:0701b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告大目揵連、彌勒菩薩摩訶薩：「汝等受持不退轉地心陀羅尼，能令真善剎利安樂利益，為轉法輪故，為名稱利故，為威德故，為滅諸邪見故，為建立正見故，為守護法眼故，為無邊眾生令得成熟故，為使堅固大乘不退故，為使滿足六波羅蜜故。」",
        "translation": "It was then that the Buddha addressed Mahāmaudgalyāyana and Maitreya, the bodhisattvas and mahāsattvas, \"You [might] accept and uphold the nonretrogressing ground mind dhāraṇī, which can bring true and good bases and benefits in well-being, for the sake of turning the wheel of the Dharma, for the sake of renown and benefit, for the sake of authority, for the sake of ending wrong views, for the sake of establishing right views, for the sake of guarding the Dharma eye, for the sake of bringing limitless sentient beings to maturity, for the sake of making the great vehicle resolute and not retrogressing, and for the sake of fulfilling the six perfections.\"",
        "source": "T13n0410_004:0701b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊，欲重宣此義而說偈言：「爾時天藏梵，　　發問兩足尊：『利根等眾生，　　修禪而誦習，　勇猛強勸作，　　剎利有智者，　云何滅煩惱？",
        "translation": "It was then that the Bhagavān, wishing to recapitulate this meaning, spoke in verse, saying, \"At the time, Tenzō Brahmā asked Venerable Two-Foot, 'How do sentient beings with sharp faculties who practice meditation and recite it, who are vigorously and strongly encouraged to do it, and who are wise in the bhadra, cease affliction?'",
        "source": "T13n0410_004:0701b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何住不退？』",
        "translation": "How do we abide in nonretrogression?'",
        "source": "T13n0410_004:0701b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛時答彼言：　　『犯重墮落者，　雖意有明利，　　急趣阿鼻獄。",
        "translation": "The Buddha then answered them, 'A serious offender falls into Abhidharma even though his intentions are bright and clever.",
        "source": "T13n0410_004:0701b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此十種惡輪，　　無智所修行，　則斷善根本，　　速疾墮地獄。",
        "translation": "These ten kinds of bad turns, which are cultivated without wisdom, cut off the roots of goodness and quickly lead to hell.",
        "source": "T13n0410_004:0701b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　禪定亦滅結，　　非獨多聞智，　若欲得解脫，　　應當勤修禪。",
        "translation": "Even the bond of meditation is ended, not just well-versed wisdom, so if you want to attain liberation, you should diligently cultivate meditation.",
        "source": "T13n0410_004:0701b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者常精進，　　守護我正法，　以恭敬袈裟，　　能度煩惱海。",
        "translation": "Always diligent in wisdom, he guards my right principles, and with his reverential robe, he's able to cross the ocean of affliction.",
        "source": "T13n0410_004:0701b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂處於空林，　　遠離五逆罪，　持戒修禪定，　　能度煩惱海。",
        "translation": "He's happy in an empty forest, far removed from the five heinous crimes, observing precepts and cultivating meditation, and able to cross the ocean of affliction.",
        "source": "T13n0410_004:0701b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有信三乘，　　熾然於佛法，　供養染衣者，　　得大功德海。",
        "translation": "If someone is a believer in the three vehicles, blazes about the Buddha's teaching, and makes offerings to dyed robes, they'll attain an ocean of great merit.",
        "source": "T13n0410_004:0701b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能調難伏心，　　不舉比丘罪，　聖種修少欲，　　獲得兩足尊。",
        "translation": "They can tame a mind that's difficult to control, don't hold up a monk's faults, cultivate few desires among the noble lineage, and attain the status of a two-legged honored one.",
        "source": "T13n0410_004:0701c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離惡比丘，　　恭敬親賢聖，　不食僧祇物，　　速到於菩提。",
        "translation": "He parts with evil monks, pays respect to the noble ones, doesn't eat the saṃgha's valuables, and quickly reaches enlightenment.",
        "source": "T13n0410_004:0701c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三界得妙樂，　　三寶出於世，　若欲得安樂，　　當供養三寶。",
        "translation": "Attaining marvelous happiness in the three realms, the Three Treasures appear in the world, and if you want to attain well-being, you must make offerings to the Three Treasures.",
        "source": "T13n0410_004:0701c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三寶旃陀羅，　　剎利作過者，　惡比丘伴黨，　　速疾墮地獄。",
        "translation": "Those who do wrong by the Three Treasures and those who do wrong by the bhadra, and those who are companions of evil monks, will quickly fall into hell.",
        "source": "T13n0410_004:0701c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是十輪罪，　　等於一婬女；　以是十婬罪，　　亦等同一酒；　如是十酒罪，　　復等於一屠；　以是十屠罪，　　亦同於一王。",
        "translation": "Thus, these ten wheel-turning sins are the same as one lustful woman; these ten lustful sins are also the same as alcohol; these ten alcoholic sins are also the same as one butchery; and these ten butchery sins are also the same as one king.",
        "source": "T13n0410_004:0701c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有真善剎利，　　供養於正法；　三乘得熾盛，　　當獲功德海。",
        "translation": "There are truly good bhadra that are offered to the right Dharma, and the three vehicles become flourishing, so they'll attain an ocean of merit.",
        "source": "T13n0410_004:0701c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具足七寶等，　　遍滿閻浮提；　持用施諸佛，　　其福猶有限。",
        "translation": "They are replete with the seven treasures that fill Yambudvīpa, and their merit is limited even when they are given to the buddhas for their use.",
        "source": "T13n0410_004:0701c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至四天下，　　造僧房供養；　彼雖得大福，　　不如護正法。",
        "translation": "Even if they were to build a monastery under the four heavens and make offerings to them, they wouldn't attain great fortune like protecting the right teaching.",
        "source": "T13n0410_004:0701c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使為諸佛，　　滿中造塔廟；　彼雖得大福，　　不如護正法。",
        "translation": "Suppose someone were to build a stūpa for all the buddhas in their midst; even though they've attained great fortune, they wouldn't be as good as guarding the right teaching.",
        "source": "T13n0410_004:0701c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　羅漢諸菩薩，　　解縛而供養；　顯現於我法，　　其福倍於彼。",
        "translation": "Arhat bodhisattvas free themselves from bondage and make offerings; they manifest our teaching, and their merit is greater than theirs.",
        "source": "T13n0410_004:0701c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修禪億千劫，　　不為諸佛護；　若不隱正法，　　諸佛速護念。",
        "translation": "They practice meditation for a hundred million eons, but they aren't protected by the buddhas; if they don't hide the right teaching, the buddhas will quickly guard it.",
        "source": "T13n0410_004:0701c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若真善剎利，　　遠離十惡輪；　能守護佛法，　　及持袈裟者。",
        "translation": "If he's a truly good bhadra, far removed from the wheel of the ten evils, he'll be able to guard the Buddha's teaching and carry his robe.",
        "source": "T13n0410_004:0701c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不謗毀正法，　　我所說三乘；　聞已能供養，　　護持法器者。",
        "translation": "They don't denigrate the right teaching, the three vehicles I've taught, and they make offerings after hearing it, so they protect the Dharma vessel.",
        "source": "T13n0410_004:0701c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如五日出，　　能竭於大海；　若護我法者，　　則竭煩惱結。",
        "translation": "It's like when five suns rise, which can dry up the ocean, and if someone protects my teaching, they'll dry up the bonds of affliction.",
        "source": "T13n0410_004:0702a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如風災起，　　悉摧一切山；　若護正法者，　　亦滅諸煩惱。",
        "translation": "Like a windstorm that arises and destroys all mountains, if someone guards the right teaching, they'll also extinguish the bonds of affliction.",
        "source": "T13n0410_004:0702a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如水災起，　　漂蕩壞大地；　若護正法者，　　亦消諸煩惱。",
        "translation": "Like a flood that arises and wrecks the earth, if someone guards the right teaching, they'll also extinguish the afflictions.",
        "source": "T13n0410_004:0702a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世有如意寶，　　能滿人所願；　若說三乘法，　　隨願亦皆得。",
        "translation": "There's a wish-granting jewel in the world that fulfills people's wishes, and if they teach the teachings of the three vehicles, they'll obtain whatever they wish.",
        "source": "T13n0410_004:0702a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如獲德瓶，　　盡破於貧窮；　如是破煩惱，　　速疾得菩提。",
        "translation": "It's like a vial of acquired merit that completely destroys poverty; thus destroying afflictions, it quickly attains enlightenment.",
        "source": "T13n0410_004:0702a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如月十五日，　　光明滿虛空；　得是智慧者，　　滿足護正法。",
        "translation": "Like the fifteenth day of the moon, its light fills the sky; those who attain this wisdom fulfill the protection of the right teaching.",
        "source": "T13n0410_004:0702a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如空無所有，　　無物亦無相；　守護正法者，　　是智無疑惑。",
        "translation": "Like space without substance, it has neither things nor marks; this is the wisdom that guards the right teaching without doubt.",
        "source": "T13n0410_004:0702a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如日所照處，　　能除諸闇冥；　守護正法者，　　是則得照明。』」",
        "translation": "Like the place where the sun shines, it removes darkness; this is how he guards the right teaching, and he attains illumination.'\"",
        "source": "T13n0410_004:0702a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣十輪經卷第四",
        "translation": "Dafangguang shilun jing, vol. 4",
        "source": "T13n0410_004:0702a17_0",
        "is_bad_quality": false
    }
]