[
    {
        "source_sentence": "虛空孕菩薩經卷上",
        "translation": "Ākāśagarbha-sūtra, Vol. 1",
        "source": "T13n0408_001:0667c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T13n0408_001:0667c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時婆伽婆住佉羅坻迦山古昔神仙所居之處，與大一切比丘眾俱，度量已過，皆悉漏盡諸大沙門。",
        "translation": "Thus I have heard: One time, the Bhagavān stayed at Mount Kharaka, where the gods used to live, and he was with a large assembly of monks who had measured and passed away, and they were all contaminated by great ascetics.",
        "source": "T13n0408_001:0667c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有菩薩摩訶薩眾，無量無邊阿僧祇恒河沙數諸大人俱，乃至世尊授功德天記莂訖已。",
        "translation": "There were also a multitude of bodhisattvas, mahāsattvas, and an infinite and unlimited number of great persons of the Ganges River Sands, up to the point where the Bhagavān had finished granting the prediction to the gods of merit.",
        "source": "T13n0408_001:0667c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊默然而住，及諸大眾亦復如是。",
        "translation": "At the time, the Bhagavān stood silently, and so did the other great people.",
        "source": "T13n0408_001:0667c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時西方有一應珠，是摩尼寶忽然出現，復有百千帝釋天寶左右圍遶摩尼應珠，時彼應珠最在其前。",
        "translation": "At the time, a maṇi-jewel suddenly appeared in the west, and there were a hundred thousand Indra celestial jewels surrounding the maṇi-jewel, with the maṇi-jewel in the forefront.",
        "source": "T13n0408_001:0667c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應珠現已，彼山所有諸色光明皆悉不現，并諸天人大神王等、聲聞菩薩大地火風諸水色光莫不隱蔽，唯除如來光明不滅。",
        "translation": "After the maṇi jewel appeared, all the colors and lights on that mountain didn't appear, and the lights of the gods, goddesses, gods, gods, śrāvakas, and bodhisattvas in the earth, fire, wind, and water were all obscured except for the Tathāgata's light, which didn't go out.",
        "source": "T13n0408_001:0667c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大會覩如來光，無量無邊不可說不可說，遍滿十方猶如虛空，而世尊光威嚴殊特照曜顯赫最妙最勝。",
        "translation": "The great assembly then saw the Tathāgata's light, which was measureless, limitless, ineffable, and inexpressible, filling the ten directions like space, and the Bhagavān's radiant splendor was extraordinary, shining, and most marvelous and outstanding.",
        "source": "T13n0408_001:0667c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼大會所有眾生集會之者，各見自身所有光明，并及諸大妙色隱蔽不現，自己色相觸受等事亦復如是。",
        "translation": "All the sentient beings assembled in that assembly then saw all their own light and the great marvelous colors that were hidden from view, and so did their own form, touch, feeling, and other things.",
        "source": "T13n0408_001:0667c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡所觀處狀若虛空，亦復隱蔽日月星宿地水火風一切諸色種種光明，不與眼對，耳不聞聲、鼻不聞香、舌不得味、心意識等亦不能緣，亦無彼我，亦無六入。",
        "translation": "Their place of contemplation is like space, and it's also hidden from the sun, moon, stars, earth, water, fire, and wind, with all their various forms and lights not confronting the eye, the ear doesn't hear sound, the nose doesn't hear fragrance, the tongue doesn't taste, and the mind and consciousness can't relate to them, and there's no self or the six sense-fields.",
        "source": "T13n0408_001:0667c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸大凡所求覓，欲有觀視一切方處，皆悉不見所視諸方，唯見佛身光明相好顯現特尊。",
        "translation": "All great men who seek to examine all directions want to see them, but they don't see the directions they examine, except to see the Buddha's body in all its radiant splendor.",
        "source": "T13n0408_001:0667c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙見彼珠，無量無數釋提桓因著身妙珠左右圍遶，彼勝摩尼獨在於前。",
        "translation": "From a distance, they see that pearl, surrounded by measureless and countless wonderful pearls of Śakra Devānām-Indra's body, with that excellent maṇi alone in front of them.",
        "source": "T13n0408_001:0667c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大眾中唯諸菩薩住十地者，或得首楞嚴三昧者，或復有得一生補處，彼等菩薩見斯瑞相，不驚不怖不沒不悔。",
        "translation": "At the time, the only bodhisattvas in the crowd were those who had abided in the tenth ground, those who had attained the concentration of Śūraṃgama, and those who had attained the abode of the once-returner, but when they saw this auspicious sign, they weren't frightened or terrified, weren't confused, and didn't repent.",
        "source": "T13n0408_001:0667c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0408_001:0668a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩於一切法皆達真理，曉了實相勤入空門，以是義故不驚不怖亦不悔沒。",
        "translation": "Those bodhisattvas comprehend the truth about all things, understand their true characteristics, and diligently enter the gate of emptiness; because of this, they aren't frightened or terrified, and they don't repent.",
        "source": "T13n0408_001:0668a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其餘菩薩摩訶薩等，及諸聲聞、天、龍、夜叉、阿修羅、迦樓羅、緊那羅、鳩槃茶，及諸餓鬼、毘舍遮、富單那、迦吒富單那、人非人等集會之者，皆悉驚怖恐懼滯沒，於此彼岸不能曉了，以驚怖心各各相求而不顯現，心懷疑惑各作是念：「此是何相？",
        "translation": "The other bodhisattvas, mahāsattvas, śrāvakas, gods, dragons, yakṣas, asuras, garuḍas, kiṃnaras, kumbhāṇas, hungry ghosts, piśācīs, pūrṇas, kaṭapūrṇas, humans, and nonhumans who gather here are all frightened and fearful, unable to comprehend this other shore, seeking each other with fear and uncertainty but not revealing them, and each thinking, \"What is this aspect?",
        "source": "T13n0408_001:0668a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事何因？",
        "translation": "What is the cause of this matter?",
        "source": "T13n0408_001:0668a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此誰威力？」",
        "translation": "Who is this power?\"",
        "source": "T13n0408_001:0668a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲自決疑而無問處。",
        "translation": "They wanted to resolve their doubts but had no place to ask questions.",
        "source": "T13n0408_001:0668a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時於彼海會之中有一菩薩摩訶薩，名曰梵橛，即從坐起合掌向佛，而說偈言：「一切諸法相，　　真實無知者，　若人住諸陰，　　六根皆閉塞，　觀一陰不實，　　所謂色陰是，　彼疑諸佛法，　　迷惑眾生等。",
        "translation": "Then, in the midst of that ocean assembly, a bodhisattva named Brahmakāyika rose from his seat, put his palms together, and addressed the Buddha, saying, \"The characteristics of all dharmas are truly ignorant.",
        "source": "T13n0408_001:0668a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善哉大世尊，　　願為說實法，　如來此彼岸，　　教知空忍門。",
        "translation": "\"Good, great world-honored one, may you explain the true teaching for them, for the Tathāgata is here on the other side, and teach them the gate of patience through emptiness.",
        "source": "T13n0408_001:0668a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼大精勤者，　　得定身難說，　最大摩尼寶，　　頂戴彼莊嚴，　天帝著身珠，　　無量左右遶，　彼等欲來故，　　先現是瑞相。",
        "translation": "That great diligent person attains a body of concentration that's hard to describe, a great maṇi treasure that's adorned on his head, a heavenly god wearing a body of pearls, and measureless circles around him, and he first shows this auspicious sign because he wants to come.",
        "source": "T13n0408_001:0668a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼等諸菩薩，　　悉得首楞嚴，　如是諸智輩，　　欲見佛世尊，　彼等來詣此，　　說深法無疑。",
        "translation": "Those bodhisattvas have all attained śūraṃgama, and such wise ones who want to see the Bhagavān come here and explain the profound Dharma without doubt.",
        "source": "T13n0408_001:0668a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願佛慰此眾，　　彼當哀矜汝，　是等欲來故，　　先現是境界。」",
        "translation": "May the Buddha console these people, and they will sympathize with you, for they want to come here, so they first showed this object.\"",
        "source": "T13n0408_001:0668a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於時佛世尊，　　告彼菩薩言：「一如汝所說，　　此是三昧境，　若人聞無住，　　彼人能住智。",
        "translation": "The Bhagavān then addressed the bodhisattvas, \"As you said, this is the state of samādhi, and if someone hears it and doesn't abide in it, they can abide in knowledge.",
        "source": "T13n0408_001:0668a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此是虛空孕，　　三昧威力境，　得住無說處，　　三昧先相現。",
        "translation": "This is the realm of the mighty power of samādhi, which is pregnant with space, and it's the first manifestation of samādhi when it's possible to abide in a place that's not explained.",
        "source": "T13n0408_001:0668b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人住二見，　　彼等常迷惑，　染著斷及常，　　即失此彼岸。",
        "translation": "If someone abides in these two views, they're always deluded, defiled by attachment to nihilism and permanence, and they lose both this and that shore.",
        "source": "T13n0408_001:0668b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此等二見者，　　若欲速解脫，　是等莫言說，　　速得證諸地。」",
        "translation": "Those who want to quickly liberate themselves from these two views, don't say such things, for they'll quickly realize the stages.\"",
        "source": "T13n0408_001:0668b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說此偈已，告彼菩薩作如是言：「仁者雖然，但初學人諸菩薩等，應欲教者應教彼等言說之相，以方便力亦教攀緣六波羅蜜，乃至諸大本相次第相生，應教令證。",
        "translation": "After speaking this verse, the Bhagavān addressed the bodhisattvas, saying, \"Gentlemen, although it's true that bodhisattvas who are beginners should teach those who want to teach them the marks of language, they should also be taught by the power of skillful means to take refuge in the six perfections, and they should be taught to realize the sequential production of the major fundamental marks.",
        "source": "T13n0408_001:0668b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既證知已，然後能於一切諸法無言無說。",
        "translation": "Once they realize it, they can then understand all things without words or expressions.",
        "source": "T13n0408_001:0668b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須知本體生處應滅攀緣，諸陰無體應證應知，不令彼墮斷常見中。",
        "translation": "They should know that the place where the original body arises should be eliminated from attachment, and the aggregates lacking a body should be realized and known, so they won't fall into the common view of nihilism.",
        "source": "T13n0408_001:0668b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨二邊已，即不驚怖不沒不悔，於諸一切法中不生攀緣之想，於諸一切波羅蜜速得圓滿具足成就，亦不住於斷常二見。」",
        "translation": "Once they abandon the two extremes, they won't be frightened or confused, won't have any thoughts of attachment to any dharmas, and will quickly attain the full accomplishment of all the perfections, nor will they abide in the two views of nihilism and permanence.\"",
        "source": "T13n0408_001:0668b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說是法已，時會大眾還得相見如本無異，如舊所見諸色光明，如前所聞還聞如故，所證所觸亦復如是。",
        "translation": "After the Bhagavān explained this teaching, the audience then was able to see each other again as before without difference, shining brightly as they had seen before, hearing what they had heard before as before, and realizing what they had touched in the same way.",
        "source": "T13n0408_001:0668b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即舉右手，唱如是言：「此是虛空孕菩薩摩訶薩來詣我所，得諸三昧如大海水，於菩薩行成就具足如須彌山，於大智內猶若虛空，勤行精進猶如大風，於諸忍中猶若金剛，於般若中猶如虛空，於菩薩眾猶如大幢，向涅槃路如大商主，於諸善根猶如地藏，為眾貧窮猶如德瓶，為幽眾生猶如日光，為失路者猶如盛月，為驚怖眾如須彌山，為諸煩惱病苦眾生如甘露藥，為斷善根諸眾生等猶如拄杖，於生天路及涅槃道猶如橋梁，於度彼岸猶如大船，於上生天猶如閣道，若有被人誹謗惱者為作傘蓋，於諸外道猶如師子，於諸惱熱猶如冷水，於魔怨敵猶如鎧鉀，於學錯悞猶如智師，於諸善根猶如大地，於愛鬘者猶如香花，於諸持戒及知足者猶如明鏡，於諸無慚無愧人所猶如刀劍，於諸病患眾生之內猶如良醫，於飢眾生如功德天，於渴眾生猶如月珠，於疲乏眾猶如床鋪，於諸勤求三昧人所猶如日珠，於向菩提道心眾生猶如車乘，於諸愛樂禪定眾生如清涼池，於樂菩提助道眾生猶如花鬘。",
        "translation": "爾時世尊即舉右手，唱如是言：「此是虛空孕菩薩摩訶薩來詣我所，得諸三昧如大海水，於菩薩行成就具足如須彌山，於大智內猶若虛空，勤行精進猶如大風，於諸忍中猶若金剛，於般若中猶如虛空，於菩薩眾猶如大幢，向涅槃路如大商主，於諸善根猶如地藏，為眾貧窮猶如德瓶，為幽眾生猶如日光，為失路者猶如盛月，為驚怖眾如須彌山，為諸煩惱病苦眾生如甘露藥，為斷善根諸眾生等猶如拄杖，於生天路及涅槃道猶如橋梁，於度彼岸猶如大船，於上生天猶如閣道，若有被人誹謗惱者為作傘蓋，於諸外道猶如師子，於諸惱熱猶如冷水，於魔怨敵猶如鎧鉀，於學錯悞猶如智師，於諸善根猶如大地，於愛鬘者猶如香花，於諸持戒及知足者猶如明鏡，於諸無慚無愧人所猶如刀劍，於諸病患眾生之內猶如良醫，於飢眾生如功德天，於渴眾生猶如月珠，於疲乏眾猶如床鋪，於諸勤求三昧人所猶如日珠，於向菩提道心眾生猶如車乘，於諸愛樂禪定眾生如清涼池，於樂菩提助道眾生猶如花鬘。",
        "source": "T13n0408_001:0668b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子又於行諸波羅蜜者猶如大果。",
        "translation": "That good man is also like a great fruit to those who practice the perfections.",
        "source": "T13n0408_001:0668c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子於修諸地，如彼應現摩尼之寶。",
        "translation": "When he cultivates the stages, that good man is like the jewel of the maṇi that should be revealed.",
        "source": "T13n0408_001:0668c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人修習首楞嚴三昧者，如波利質多羅樹。",
        "translation": "If someone cultivates the concentration of śūraṃgama, he's like the pārijātaka tree.",
        "source": "T13n0408_001:0668c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子猶如利劍，割截一切諸見結故。",
        "translation": "That good man is like a sharp sword that cuts through all the bonds of constructed views.",
        "source": "T13n0408_001:0668c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子猶如金剛，破壞一切習氣煩惱故，能降伏一切魔眾，於方便眾生如解地藏者。",
        "translation": "He's like a good man who's like a vajra that destroys all habituated afflictions, subdues all Māras, and is like an understander of the Kṣitigarbha for skillful sentient beings.",
        "source": "T13n0408_001:0668c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子顯現勝智善巧方便。",
        "translation": "That good man displays excellent knowledge and skillful means.",
        "source": "T13n0408_001:0668c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子於一切法真實體中能作住持，又於一切辟支佛所為作花鬘，又於一切聲聞眾所猶如衣覆。",
        "translation": "He's a good man who abides in the true substance of all things, makes a flower garland for all pratyekabuddhas, and is like a robe covering all śrāvakas.",
        "source": "T13n0408_001:0668c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切天猶如淨眼，於諸人中猶如直路，於諸畜生能作歸依，憐愍餓鬼拔地獄苦。",
        "translation": "He's like a pure eye in all the heavens, like a straight path among humans, a refuge for animals, and a compassionate friend to hungry ghosts who remove the suffering of hell.",
        "source": "T13n0408_001:0668c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於一切諸眾生所為大寶器、是大福田，於諸菩薩猶如大車。",
        "translation": "They are a great vessel of treasure and a field of merit for all sentient beings, and they're like a great chariot for bodhisattvas.",
        "source": "T13n0408_001:0668c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子猶如大臣，於三世中諸佛如來怛他阿伽度、阿羅呵、三藐三佛陀，常能守護諸法城門。",
        "translation": "That good man is like a minister who's always able to guard the entrances to the Dharma by the buddhas, tathāgatas, arhats, and samyak-saṃbuddhas of the three times.",
        "source": "T13n0408_001:0668c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子以十八不共法而莊嚴身，具足一切諸佛智慧，堪受一切眾生供養，種種供具而供養之，唯除如來。",
        "translation": "That good man adorns his body with 18 distinctive qualities, is fully endowed with the wisdom of all the buddhas, and is able to accept offerings from all sentient beings and make various offerings to them, except for the Tathāgata.",
        "source": "T13n0408_001:0668c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等此會，應須迎逆持諸供具，隨力隨分而供給之，尊重讚歎，以種種寶及諸幡蓋香花寶幢諸花鬘等，末香塗香花鬘莊嚴種種瓔珞，以諸寶器安置香湯淨灑道路，種種瓔珞莊嚴道側，種種讚歎而歌詠之。",
        "translation": "At this meeting, you should welcome and disregard the offerings, making offerings according to your abilities and abilities, honoring and praising them, decorating various jewelry and banners, flowers, banners, flower garlands, and other things, decorating various jewelry with powdered incense, coating incense and flower garlands, placing incense and hot water on the road, decorating the side of the road with various jewelry, and singing and praising them in various ways.",
        "source": "T13n0408_001:0668c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0408_001:0669a04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等一切不久當得如是種種功德之器。」",
        "translation": "All of you will soon attain such a variety of vessels of merit.\"",
        "source": "T13n0408_001:0669a04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時一切集會大眾皆從坐起，面向西方，於虛空孕菩薩摩訶薩所來之處，低頭合掌遙禮致敬，心生歡喜踊躍無量，熈怡含笑正立而住。",
        "translation": "At that point, all the assembled people rose from their seats, faced west, bowed their heads with their palms together in salute at the place where the pregnant bodhisattva Mahāsattva of space had come from, rejoiced, jumped incalculably, smiled pleasantly, and stood upright.",
        "source": "T13n0408_001:0669a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大眾中最勝菩薩摩訶薩，及大沙門、天王、龍王、夜叉王、阿修羅王、迦樓羅王、緊那羅王、摩睺羅加王、五通諸仙，各各思惟：「我等今者作何供具，最勝最勝莊嚴供具，供養恭給彼善男子？」",
        "translation": "The most excellent bodhisattva, the great ascetics, god kings, dragon kings, yakṣa kings, asura kings, garuḍa kings, kiṃnara kings, mahoraga kings, and the five magical sages in that assembly each thought, \"What is the most excellent and ornate offering that we would make to that good man?\"",
        "source": "T13n0408_001:0669a08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時虛空孕菩薩摩訶薩現神通力，變此三千大千世界平正如掌七寶合成，除滅一切山川沙鹵高峯石崖丘陵坑坎土塊礓石，臭處糞穢荊棘沙礫無復遺餘，除諸雲霧塵烟等穢及諸惡聲種種音樂。",
        "translation": "At the time, the Ākāśagarbha Bodhisattva Mahāsattva showed supernormal powers and transformed this flat, square palm of three thousand great worlds into a composite of seven treasures that removed all mountains, rivers, sand, seas, high peaks, rocky cliffs, hills, pits, rivers, dirt, thorns, sand, and gravel, leaving nothing behind, and removed clouds, mists, dust, smoke, and other defilements as well as various kinds of music with bad noises.",
        "source": "T13n0408_001:0669a12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此大千種種諸樹變為七寶，其諸寶樹枝葉花果出微妙香，於地所生種種藥草，若小若大、若有枝葉若無枝葉皆成七寶。",
        "translation": "Here in the great trichiliocosm, various trees are transformed into seven treasures, and the branches, leaves, flowers, and fruits of those precious trees produce a subtle fragrance, while various medicinal plants that grow on the ground, whether small or large, with or without branches and leaves, all become seven treasures.",
        "source": "T13n0408_001:0669a17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此娑婆大千世界，諸病患者莫不除愈，一切地獄、餓鬼、畜生皆悉除滅一切諸苦。",
        "translation": "In this great chiliocosm of the sahāva, none of the sick will be healed, and all hells, hungry ghosts, and animals will be freed from all suffering.",
        "source": "T13n0408_001:0669a20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等眾生，飢者得食、渴者得飲、裸者得衣，復得種種微妙瓔珞。",
        "translation": "Those sentient beings who are hungry get food, those who are thirsty get drink, those who are naked get clothing, and they also receive a variety of exquisite jewelry.",
        "source": "T13n0408_001:0669a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是娑婆世界之內，所有眾生隨心所樂莫不滿足，身色端正世間無比最勝殊特，六根具足支節洪滿，離諸煩惱心得寂定樂行善行，於佛法僧心得淨信。",
        "translation": "As a result, all sentient beings in the sahā world are satisfied with whatever their minds desire, their physical appearance is correct and unsurpassed in the world, their six faculties are fully developed, they partake of tranquil concentration and enjoy good behavior free of affliction, and they have pure faith in the mind of the Buddha, Dharma, and Saṃgha.",
        "source": "T13n0408_001:0669a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是此會所集種種一切大眾，左右二手皆持應珠。",
        "translation": "Thus, all the various people gathered at this meeting are holding the response pearl in their right and left hands.",
        "source": "T13n0408_001:0669a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於應珠中復出種種微妙光明，照此三千大千世界悉皆遍滿無不明耀。",
        "translation": "From that response pearl, various subtle lights also emanate, illuminating the 3,000 great one-thousand worlds in an unobstructed way.",
        "source": "T13n0408_001:0669a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼應珠復出種種微妙音聲，雨種種寶、種種幡蓋、種種瓔珞種種花香、雨種種鬘、種種寶器、種種甘果，復雨種種無價衣服、種種金縷，復雨種種真珠羅網，復雨種種優鉢羅花，分陀利花，波頭摩花，拘物頭花，沈水等香，復雨種種諸末香等，所謂牛頭栴檀及赤栴檀、白栴檀等。",
        "translation": "The pearl then produces another variety of subtle sounds, raining down various treasures, various banners and shrouds, various jewelry, various flowers and fragrances, various garlands, various precious vessels, various sweet fruits, various priceless garments, various gold threads, various true beads and nets, various upland flowers, puṇḍarī flowers, kuṇḍarī flowers, Shenshui and other fragrances, and various kinds of derivative fragrances, such as oxhead sandalwood, red sandalwood, and white sandalwood.",
        "source": "T13n0408_001:0669a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼菩薩所來之路自然灑掃，於道二邊變成七寶莊嚴廊廡，猶如天帝難勝法堂。",
        "translation": "They naturally mop up the path from which the bodhisattva comes and turn it into a veranda adorned with seven treasures on either side of the path, resembling the unsurpassed dharma hall of Indra.",
        "source": "T13n0408_001:0669b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其廊內自然化成種種玉女狀，如欲界魔王妻妾，皆作五種微妙音聲，自相娛樂或歌或舞。",
        "translation": "Inside that veranda, they naturally transform into the shapes of various jade women, like the wives and concubines of the demon king of the desire realm, who each make five kinds of exquisite sounds, entertaining themselves or singing and dancing.",
        "source": "T13n0408_001:0669b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化作如是寶步廊已，於佛頂上虛空之中化成一蓋，如梵天王所受用者，縱廣正等滿百由旬。",
        "translation": "After creating this kind of a jeweled corridor, it transforms into a lid in the sky above the Buddha's head, just like the one used by Brahmā, measuring exactly a hundred leagues in length and breadth.",
        "source": "T13n0408_001:0669b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶綖為繐真珠垂露，四散垂下，諸餘瓔珞處處莊嚴，其瓔珞中出五音聲。",
        "translation": "Jeweled tassels made of fine, genuine jewels hang down in a puddle, and the rest of the jewelry is adorned with five sounds that emanate from the jewelry.",
        "source": "T13n0408_001:0669b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切大地所生草木，若大若小若長若短若好若惡，皆悉出於五種天樂，一切眾生莫不聞者。",
        "translation": "From all the grass and trees that grow on the earth, whether large or small, long or short, and good or bad, there are five kinds of heavenly music that arise, and none of the sentient beings can fail to hear them.",
        "source": "T13n0408_001:0669b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞彼聲已，無有不得不退轉地，畢竟得至阿耨多羅三藐三菩提。",
        "translation": "After hearing that sound, there's no ground of no turning back, and they will ultimately attain supreme, perfect enlightenment.",
        "source": "T13n0408_001:0669b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼會一切大眾，見虛空孕菩薩現大神力如是莊嚴，心生歡喜踊躍無量，生殊特想復作是念：「我等今者於世尊前，云何當為彼善男子敷設別座？」",
        "translation": "At the time, when all the people in that assembly saw the Ākāśagarbha Bodhisattva displaying such adornment with great supernormal powers, their hearts rejoiced and jumped incalculably, giving rise to the distinctive notion that they would again think, \"Now, before the Bhagavān, how would we prepare a separate seat for that good man?\"",
        "source": "T13n0408_001:0669b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛前自然即有一蓮華座，白銀為莖、紫金為葉、馬瑙為臺、梵摩尼寶以為花蕊，縱廣正等一俱盧舍，其葉無量百千等數。",
        "translation": "It was then that there naturally appeared before the Buddha a lotus seat with a stalk of silver, leaves of purple gold, a platform of onyx, and a brahma-maṇi jewel for its stamens, measuring exactly one kuruśa in width and with leaves that were numberless and one hundred thousand in number.",
        "source": "T13n0408_001:0669b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其花周匝自然踊出無量無邊百千花座，一如前花等無有異。",
        "translation": "From its circumference naturally wells up a limitless and infinite hundred thousand-flower throne, just like the previous flowers, with no difference.",
        "source": "T13n0408_001:0669b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復於彼大蓮華上，見虛空孕菩薩摩訶薩結加趺坐自然顯現，首戴應珠。",
        "translation": "Again, on top of that large lotus, he sees the Ākāśagarbha Bodhisattva Mahāsattva sitting cross-legged and naturally manifesting himself, wearing a string of pearls on his head.",
        "source": "T13n0408_001:0669b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼圍遶蓮華之上，復有無量無邊眷屬諸菩薩等結加趺坐自然顯現。",
        "translation": "On top of the lotus that surrounded it, there were also measureless and limitless retinues of bodhisattvas and others sitting cross-legged and naturally manifesting themselves.",
        "source": "T13n0408_001:0669b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彌勒菩薩摩訶薩即以偈告藥王菩薩摩訶薩言：「先來大菩薩，　　有大名聞者，　頂禮世尊足，　　退坐蓮花上。",
        "translation": "It was then that Maitreya addressed the Medicine King Bodhisattva and Mahāsattva in a verse, \"There was a great bodhisattva from before, a man of great renown and learning, who bowed his head at the feet of the Bhagavān and withdrew to sit on a lotus flower.",
        "source": "T13n0408_001:0669b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此勝人來已，　　顯現大莊嚴，　不禮世尊足，　　逕坐蓮花座。」",
        "translation": "After this remarkable person came, he showed great adornment, didn't bow at the Bhagavān's feet, and sat straight up on the lotus-flower throne.\"",
        "source": "T13n0408_001:0669c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時藥王菩薩摩訶薩還以偈頌報彌勒菩薩摩訶薩言：「此是仁者見；　　諸佛真如法，　不見有眾生，　　不染於分別。」",
        "translation": "It was then that the Bhaiṣajyaguru Bodhisattva repaid Maitreya with a verse, \"This is the vision of a good person; they truly are the Dharma of the buddhas, don't see any sentient beings, and aren't stained by discrimination.\"",
        "source": "T13n0408_001:0669c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彌勒菩薩摩訶薩復以偈頌報藥王菩薩摩訶薩言：「若不見眾生，　　是住於實際，　何故現莊嚴？",
        "translation": "Maitreya then again answered the King of Medicine with a verse, \"If you don't see sentient beings, then why do you appear adorned when you actually abide?",
        "source": "T13n0408_001:0669c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝決我心疑。」",
        "translation": "You've resolved my mental doubts.\"",
        "source": "T13n0408_001:0669c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時藥王菩薩摩訶薩復以偈頌報彌勒菩薩摩訶薩言：「此是智者諸方便，　　為化一切諸眾生，　所有不解真如者，　　愚癡執著住分別。",
        "translation": "It was then that the Medicine King Bodhisattva Mahāsattva again answered Maitreya's Bodhisattva Mahāsattva with a verse, \"These are the methods of the wise one who purifies all sentient beings, those who don't understand true reality, and who foolishly cling to and abide in discrimination.",
        "source": "T13n0408_001:0669c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是智出現為世諦，　　眾苦逼惱不會真，　欲為令彼等解脫，　　故現如是莊嚴事。」",
        "translation": "This is the wisdom that appears as the truth of the world, which is oppressed by suffering and doesn't come true, and which is intended to cause them to be liberated, so it produces such adornments.\"",
        "source": "T13n0408_001:0669c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊讚歎藥王菩薩摩訶薩言：「善哉仁者！",
        "translation": "It was then that the Bhagavān praised the Medicine King Bodhisattva Mahāsattva, saying, \"Good, sir!",
        "source": "T13n0408_001:0669c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，如汝所說。",
        "translation": "\"So it is, just as you've said.",
        "source": "T13n0408_001:0669c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使一切凡夫眾生，彼等眾生終不能知須陀洹人境界方便解脫之事；假使一切諸眾生等悉得成於須陀洹果，彼等眾生亦不能知一斯陀含境界方便解脫等事，乃至斯陀含人亦不能得知阿那含境界方便，其阿那含亦不能得知阿羅漢境界方便，其阿羅漢亦不能知一辟支佛方便解脫。",
        "translation": "Suppose all mortal sentient beings and such sentient beings could never know about the skillful liberation of a stream-winner's state; suppose all sentient beings and such were to attain the fruit of stream-winnerhood, and such sentient beings couldn't know about the skillful liberation of a once-returner's state, even if a stream-winner couldn't know about the skillful liberation of an arhat's state, nor could an arhat know about the skillful liberation of an arhat's state, nor could an arhat know about the skillful liberation of a pratyekabuddha.",
        "source": "T13n0408_001:0669c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使一切諸眾生等悉得獨覺辟支佛道，猶如犀牛獨一無侶，彼等緣覺不能得知無生法忍境界方便解脫之事而化眾生。",
        "translation": "Suppose all sentient beings and so forth attain the path of the solitary realizer and pratyekabuddha, just like a rhinoceros that's alone and has no companions, and those solitary realizers can't learn about the goal of forbearance of nonarising and the world's skillful liberation and then teach sentient beings.",
        "source": "T13n0408_001:0669c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使一切諸眾生等得無生忍，亦不能得知一辯才首楞嚴三昧菩薩摩訶薩方便信行契會真如觀察建立，本不能知從何處生從何處滅。",
        "translation": "Even if all sentient beings had attained the forbearance of nonarising, they wouldn't be able to know that the Śūraṃgama-samādhi bodhisattva's skillful faithful practice meets true observation and establishment, and they wouldn't be able to know from where to arise and where to cease in the first place.",
        "source": "T13n0408_001:0670a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子虛空孕菩薩，得無生法忍已過無量無邊數劫，亦復已得無礙辯才首楞嚴三昧，知諸眾生心心所趣。",
        "translation": "This good sons, the Ākāśagarbha Bodhisattvas, have attained the patience of the nonarising of the Dharma after countless and limitless eons, and they've also attained the śūraṃgama samādhi of unhindered eloquence, knowing the destinies of the minds and hearts of sentient beings.",
        "source": "T13n0408_001:0670a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是菩薩故，令無量無邊眾生見大莊嚴顯現神力得住厭地。",
        "translation": "Because of this bodhisattva, he causes measureless and limitless sentient beings to see the great adornment and manifest miraculous powers to attain a stage of disillusionment.",
        "source": "T13n0408_001:0670a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此善男子從此處沒隱身不現，於西方出，知於此剎三乘雜教。",
        "translation": "From this place, such a good man disappears without being seen, emerges in the west, and knows that he's in this temple with a mixed teaching of the three vehicles.",
        "source": "T13n0408_001:0670a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，故現無邊虛空三昧神通勝智。",
        "translation": "Because of this, he manifests the infinite space samādhi of superb supernormal cognition.",
        "source": "T13n0408_001:0670a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現三昧已，令諸眾生生厭離想，然後現於世諦，現入莊嚴三昧。",
        "translation": "After manifesting this concentration, he causes sentient beings to become disillusioned with it, and then he manifests the worldly truth and enters the sublime concentration.",
        "source": "T13n0408_001:0670a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現入三昧已，因此三昧教化無量無邊眾生。",
        "translation": "After manifesting and entering that concentration, he teaches and transforms measureless and limitless sentient beings because of that concentration.",
        "source": "T13n0408_001:0670a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0670a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子若徑示現真如境界無生法忍莊嚴事者，即時世間一切天人心生擾亂即便迷惑，乃至八地菩薩猶尚迷沒，況餘人也。",
        "translation": "\"When this good man demonstrates the adornment of the sphere of true reality and the patience of the unborn Dharma, it immediately disturbs and confuses the minds of all the gods in the world, even up to the eighth-stage bodhisattva, so why wouldn't the rest of us be confused?",
        "source": "T13n0408_001:0670a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0670a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此大菩薩，無人能知心行境界顯現之相。",
        "translation": "\"This great bodhisattva, no one can know the manifestation of the mind's activity in its objective realm.",
        "source": "T13n0408_001:0670a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子得入如是甚深微妙功德之法故，有如是無量無邊巧方便智，已入一切諸佛法海，無有疑心不由他悟自知方便，堪為一切大眾生等而作大王。",
        "translation": "Because this good man has entered such a teaching of profound and subtle merit, he has such measureless and limitless skillful and expedient wisdom, has entered the ocean of all the buddhas' teachings, has no doubts, and doesn't rely on others to understand his own skillful means, and can be a great king over all sentient beings and so forth.",
        "source": "T13n0408_001:0670a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0670a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子虛空孕菩薩猶如寶幢，能為一切眾生示現天道解脫之路，能除眾生心煩惱病，能滅其身諸大苦毒。",
        "translation": "This good man, Ākāśagarbha, is like a banner of treasures that shows all sentient beings the path to liberation in the heavenly realm, removes the afflictive illnesses of their minds, and extinguishes the great pain and poison of their bodies.",
        "source": "T13n0408_001:0670a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0670a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生墮在邪見曠野之中，厄難迷惑不解方便，欲求生天、欲求涅槃。",
        "translation": "\"If there are sentient beings who fall into the wilderness of wrong views, who are troubled, confused, and don't understand the teaching, and who want to be born in heaven or want to pursue nirvāṇa, then this good man knows that those sentient beings' minds and thoughts are truly devoted to what they do, and that they have become afflicted.",
        "source": "T13n0408_001:0670a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等眾生若能至心燒沈水香，頂禮致敬彼虛空孕菩薩摩訶薩足者，此善男子知彼眾生心心所行真實敬信，而彼眾生起煩惱見迷惑顛倒，如其往昔所作心業種諸善根，隨其所能，於諸佛邊種諸善根、或於法邊、或於僧邊、或作施業、或持戒業、或復欲於內心證法。",
        "translation": "If those sentient beings wholeheartedly burn the incense of immersed water and bow at the feet of that Ākāśagarbha Bodhisattva Mahāsattva, this good man knows that those sentient beings' minds and hearts are truly devoted to what they do, and that sentient beings give rise to afflictive views, are confused and mistaken, and cultivate good roots based on their past mental actions, then according to their abilities, they'll cultivate good roots near the buddhas, or near the Dharma, or near the saṃgha, or they'll do acts of generosity, or observe precepts, or they'll want to realize the Dharma in their inner mind.",
        "source": "T13n0408_001:0670a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子或於夢中、或於白日在於現前，以善方便示現至真之道。",
        "translation": "Sometimes in a dream or in the presence of the sun, this good man shows the ultimate truth with a good method.",
        "source": "T13n0408_001:0670b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是方便已，令諸眾生解諸邪見發生善願，斷諸邪路滅諸邪道歸於正見，如實得彼真正三行。",
        "translation": "After performing this method, he causes sentient beings to understand wrong views and give rise to good vows, to end wrong paths and cease wrong ways and return to right views, and to truly attain the three true practices.",
        "source": "T13n0408_001:0670b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即得真正深心所願，或復得於真善知識。",
        "translation": "That is, they'll attain the true and deep vows of their minds, and perhaps they'll attain a true and good teacher.",
        "source": "T13n0408_001:0670b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因善知識，悉得斷除臭處煩惱邪見之病。",
        "translation": "Because of a good teacher, they'll all be freed from the disease of the stinking places, afflictions, and wrong views.",
        "source": "T13n0408_001:0670b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復得速解惡道之願，即得善行勝願因緣，彼等速得心行自在，亦得安住十深忍中。",
        "translation": "They'll also attain the vow to quickly understand the evil destinies, which is the cause and condition for the superior vow to do good actions, and they'll quickly attain mastery over their mental actions and be able to abide in the ten profound tolerances.",
        "source": "T13n0408_001:0670b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生自於身起種種諸病逼切之者，或有眾生忘失本心，或復失眼、或復失舌，於六根內不具足者，或於身分小不遂者，彼等眾生若能至心頂禮虛空孕菩薩，或復稱名，皆得如意。",
        "translation": "If sentient beings themselves are beset by various illnesses that arise in their bodies, or if they forget their original mind, lose their eyes or tongue, don't have the full range of the six internal faculties, or suffer from minor identity deficiencies, then they'll all get what they want if they wholeheartedly bow to the Ākāśagarbha Bodhisattva or call him by name.",
        "source": "T13n0408_001:0670b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生欲治患者，於晨朝時香湯澡浴，當淨身口面正向東燒沈水香，頂禮虛空孕菩薩摩訶薩大德之足。",
        "translation": "If there are sentient beings who want to treat a patient, they should bathe them in scented bathing water in the morning, purify their bodies and mouths, and face eastward while burning incense made from submerged water, and pay homage to the feet of the Ākāśagarbha Bodhisattva Mahāsattva.",
        "source": "T13n0408_001:0670b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼善男子於睡眠夢中，或作婆羅門身、或作天帝釋身、或作功德天身、或作大辯天身、或作剎利身、或作大臣身、或作斷事官身、或作醫師身、或作父母身、或作童子身、或作童女身，在病者前忽然來現，以是方便而令彼病速得除愈。",
        "translation": "While that good man is asleep and dreaming, he suddenly appears to the sick person in the body of a brāhmaṇa, the body of Indra, the body of a god of merit, the body of a great eloquent god, the body of a bhadra, the body of a minister, the body of a superintendent, the body of a physician, the body of a father and mother, the body of a child, or the body of a young woman, and causes him to quickly heal his illness with these skillful means.",
        "source": "T13n0408_001:0670b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復示作良藥方便，令彼病者一切諸患悉得除差。",
        "translation": "He might also show them the way to make a good remedy, so that all of their illnesses are completely removed.",
        "source": "T13n0408_001:0670b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生或求資財、或求多聞讀誦經論若好寂靜深思禪定、或求多智、或求名聞、或求伎藝、或求苦行、或求官位、或求身色、或求財寶、或求善根、或求音聲、或求饒子、或求妻妾、或求眷屬、或求多眾、或求行施、或求持戒、或求忍辱、或求精進、或求禪定、或求般若、或求好聲言語清辯、或求事他稱彼心意、或求解脫一切眾罪、或求勸人令行布施乃至行智、或求長命。",
        "translation": "Suppose there's a sentient being who seeks possessions, much learning, reading sūtras and treatises, good quiet and deep meditation, much wisdom, renown, skill, austerities, an official position, physical appearance, wealth, good roots, sounds, pampering children, wives and concubines, family members, numerous people, the practice of charity, observance of precepts, patience, effort, meditation, prajñā, eloquence in speech and voice, serving others and praising their minds, freedom from all sins, encouragement to practice generosity and even practice wisdom, or long life.",
        "source": "T13n0408_001:0670b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生乏少資財恒作慳貪欲令彼等除捨慳貪行於布施，或破戒者欲令持戒，若懈怠者欲令精進，乃至無智慧者令學智慧。",
        "translation": "Sometimes sentient beings lacking few possessions will always be stingy and greedy, and they'll want to get rid of their stinginess and cultivate generosity, or they'll want to make those who have broken the precepts observe them, or they'll want to make those who are lazy to make them work hard, or they'll want to make those without wisdom train in wisdom.",
        "source": "T13n0408_001:0670c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生未得定乘教行小乘，自度身者教緣覺乘。",
        "translation": "If there are sentient beings who haven't yet attained the vehicle of concentration, he teaches them to practice the lesser vehicle, and he teaches those who have saved their own bodies to practice the vehicle of pratyekabuddha.",
        "source": "T13n0408_001:0670c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此善男子於彼眾生，示現方便令解上業。",
        "translation": "This good man then shows skillful means to those sentient beings to make them understand higher actions.",
        "source": "T13n0408_001:0670c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生無有慈心，唯護自身不救他苦。",
        "translation": "If there are sentient beings who lack compassion and protect only themselves and don't save others from suffering, then that good man will show them the way to understand the higher karma.",
        "source": "T13n0408_001:0670c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生作如是念：『我今當作何等方便，若有眾生欲發道心為他障礙。』",
        "translation": "Perhaps there are sentient beings who think, 'What method should I use now if sentient beings want to arouse the intention to achieve enlightenment that will hinder others?'",
        "source": "T13n0408_001:0670c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等眾生欲迴彼心，欲作如是方便示現，教彼眾生住四梵行，乃至教行大慈大悲。",
        "translation": "Those sentient beings want to convert them, and they want to perform such a skillful manifestation that teaches them to abide in the four pure practices and even teaches them to practice great kindness and compassion.",
        "source": "T13n0408_001:0670c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等眾生應當頂禮虛空孕菩薩，或住阿練若處、若在空閑，燒沈水香、或燒多伽羅香、或燒栴檀香，香湯澡浴身口清淨，胡跪合掌，五體投地，頂禮十方一切諸佛，而誦此呪：「『多地他(一)阿蜜利舍(二)阿蜜利舍(三)迦嘍尼迦(四)這囉這囉(五)毘這囉(六)羶這囉(七)迦嘍尼迦(八)何囉沒囉(九)何邏末囉(十)毘伽陀唎(十一)摩摩佉(十二)蒱闍末那迦嘍尼迦(十三)真多末膩(十四)逋囉夜迦嘍迦(十五)薩婆貰迷薩他鉢夜(十六)阿闍若陀履(十七)薩破鉗(十八)薩破鉗(十九)喉嘍帝毘毘伽鉗(二十)地唎殺吒毘比伽鉗(二十一)迦嘍尼迦晡唎夜妬摩摩(二十二)薩迦賜夜(二十三)阿貰夜(二十四)薩婆鉢達舍(二十五)阿舒迦伽帝(二十六)莎呵(二十七)』「誦此呪時，彼善男子即來現前，或作人形、或作野獸形、或作鳥形。",
        "translation": "彼等眾生應當頂禮虛空孕菩薩，或住阿練若處、若在空閑，燒沈水香、或燒多伽羅香、或燒栴檀香，香湯澡浴身口清淨，胡跪合掌，五體投地，頂禮十方一切諸佛，而誦此呪：「『多地他(一)阿蜜利舍(二)阿蜜利舍(三)迦嘍尼迦(四)這囉這囉(五)毘這囉(六)羶這囉(七)迦嘍尼迦(八)何囉沒囉(九)何邏末囉(十)毘伽陀唎(十一)摩摩佉(十二)蒱闍末那迦嘍尼迦(十三)真多末膩(十四)逋囉夜迦嘍迦(十五)薩婆貰迷薩他鉢夜(十六)阿闍若陀履(十七)薩破鉗(十八)薩破鉗(十九)喉嘍帝毘毘伽鉗(二十)地唎殺吒毘比伽鉗(二十一)迦嘍尼迦晡唎夜妬摩摩(二十二)薩迦賜夜(二十三)阿貰夜(二十四)薩婆鉢達舍(二十五)阿舒迦伽帝(二十六)莎呵(二十七)』「誦此呪時，彼善男子即來現前，或作人形、或作野獸形、或作鳥形。",
        "source": "T13n0408_001:0670c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或雖復來隱身不現，觀彼眾生福業深淺，隨所受身或出音聲，示現一乘善巧方便，令彼眾生從一方便能化無量百千眾生，未住定乘令住定乘，或住聲聞、或住緣覺。",
        "translation": "Even though he may again come to hide his body and not show it, he observes the depth of their merits and observes the body he receives or the sounds he makes, and he shows them the One Vehicle of skillful means that enables them to transform measureless hundreds of thousands of sentient beings from that one means, whether they're abiding in the vehicle of concentration or the vehicle of śrāvakas or pratyekabuddhas.",
        "source": "T13n0408_001:0670c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生於一時頃，發智方便用少功業，令入大乘不退轉地，乃至教示種種三昧諸陀羅尼忍辱度等，乃至令住第十菩薩行地之中。",
        "translation": "At one point in time, those sentient beings will be inspired by wisdom and skillful means to use a little work to enter the stage of nonretrogression in the great vehicle, and they'll be taught various samādhis, dhāraṇīs, tolerances, and so forth, until they're able to abide in the tenth bodhisattva stage of practice.",
        "source": "T13n0408_001:0671a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0671a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此虛空孕菩薩，得如是等善巧方便大慈悲智。",
        "translation": "\"This Ākāśagarbha has attained this kind of skillful means and great compassionate wisdom.",
        "source": "T13n0408_001:0671a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0671a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今為汝要略說之。",
        "translation": "I'll now explain it for you in brief.",
        "source": "T13n0408_001:0671a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使有人度量虛空能盡邊際，而此善男子方便大智大慈大悲總持三昧難可度量。",
        "translation": "Suppose someone were to measure the limit of space, but this good man's samādhi of skillful means, great wisdom, great kindness, and great compassion is difficult to fathom.",
        "source": "T13n0408_001:0671a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此大菩薩得如是等不可思議功德之法。",
        "translation": "This great bodhisattva has attained such unfathomable merits.",
        "source": "T13n0408_001:0671a09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0671a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此虛空孕菩薩，見有眾生捨離諂曲遠離邪心，發淳厚意成就正見，不毀於他不讚自己，捨離慳妬無有諂曲，不求名聞信心淨者，是善男子憐愍彼等清淨眾生，示現方便智慧精進，如是方便、如是智慧、如是精進，得度厄難，發菩提心，當得阿耨多羅三藐三菩提。",
        "translation": "\"When this Ākāśagarbha sees sentient beings who abandon flattery, free themselves from wrong thoughts, develop a simple and generous mind, achieve right view, don't praise others and themselves, abandon parsimony and lack flattery, and don't seek fame or reputation, that good man takes pity on those pure sentient beings, demonstrates skillful means, wisdom, and effort, thus skillfully, thus wisely, and thus energetically, overcoming difficulties and arousing the aspiration for enlightenment, and will attain supreme, perfect enlightenment.",
        "source": "T13n0408_001:0671a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教彼眾生所有善根迴向菩提，當得正道不退轉地，速至阿耨多羅三藐三菩提。",
        "translation": "Teaching those sentient beings to direct all their good roots toward enlightenment will lead them to the stage of nonretrogression on the right path, where they'll quickly reach unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0408_001:0671a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教作如是方便之利，智慧精進，圓滿成就六波羅蜜，發大力心，當速成就阿耨多羅三藐三菩提。",
        "translation": "They are taught to create such benefits of skillful means, to make effort with wisdom, to fully achieve the six perfections, and to give rise to a vigorous intention that will quickly lead to unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0408_001:0671a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0671a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此虛空孕菩薩得如是等不可思議殊特方便善巧勝智，教化眾生。」",
        "translation": "This Ākāśagarbha has attained this unfathomably special skillful and superior wisdom to teach sentient beings.\"",
        "source": "T13n0408_001:0671a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彌勒菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that Maitreya Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0408_001:0671a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子以何義故首戴應珠，如是光焰、如是威力，善能示現；諸餘菩薩無有是事。」",
        "translation": "What is the purpose of this good man wearing the first Yingzhu pearl, which is such a bright flame and such a powerful force, and which can be skillfully displayed; there are no other bodhisattvas who do this?\"",
        "source": "T13n0408_001:0671a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彌勒菩薩摩訶薩言：「善男子！",
        "translation": "The Buddha addressed Maitreya, the bodhisattva Mahāsattva, saying, \"Good sons!",
        "source": "T13n0408_001:0671a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子虛空孕菩薩摩訶薩為諸眾生成就大慈，常化眾生而無休息，見諸眾生在大厄難，欲拔苦故常不休息。",
        "translation": "\"This good man, the Ākāśagarbha Bodhisattva Mahāsattva, accomplishes great compassion for sentient beings, always transforms sentient beings without resting, and never rests when he sees sentient beings in great distress and wants to remove their suffering.",
        "source": "T13n0408_001:0671a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生犯四重禁，將墮惡道捨諸善根散滅眾善，而此善男子為彼眾生作大醫師。",
        "translation": "If there are sentient beings who violate the four grave prohibitions and will fall into a bad destiny and abandon their good roots and dissipate all goodness, this good man becomes a great physician for those sentient beings.",
        "source": "T13n0408_001:0671a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見彼眾生墮於無明，入邪見網在危厄獄，此善男子為彼眾生，猶如日光照明彼罪滅四重業，為彼眾生拔心疑刺。",
        "translation": "He sees a sentient being fall into ignorance and enter the web of wrong views while they're in the prison of peril, and this good man acts for that sentient being like daylight illuminating his sins and extinguishing the four grave karmas, and he removes the thorns of doubt from his mind for that sentient being.",
        "source": "T13n0408_001:0671a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生破壞心器，而此善男子見彼眾生破滅法行為煩惱陵，失於正法欲入惡道，無有歸依無有救護棄捨諸智。",
        "translation": "If there are sentient beings who destroy the vessel of their minds, and this good man sees that sentient beings' destructive mental functions are tainted by affliction, lose sight of the right Dharma, want to enter a bad path, have no refuge, have no protection, and abandon their cognition, then this good man will help them overcome their sins and enter the prison of peril.",
        "source": "T13n0408_001:0671b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子為彼等輩罪惡眾生，猶如拄杖示現正道，於諸罪垢煩惱穢惡洗令香淨教背惡道，猶如大車將入天處速得涅槃。",
        "translation": "This good man shows those sentient beings who commit sins and evil actions the right path like a staff, cleanses them of the stains of sin and affliction, purifies their fragrance, teaches them to depart from the evil path, and is like a great chariot about to enter the heavens and quickly attain nirvāṇa.",
        "source": "T13n0408_001:0671b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生以欲逼心迷惑熱惱；若有眾生瞋恚熾盛共相鬪諍，憍慢嫉妬心無暫息，煩惱所亂失於本心；若有眾生無明闇障無出離心，不識有因不畏來世；或有眾生廣集財寶心無厭足；或有眾生具行十惡曾無休息。",
        "translation": "If sentient beings are forced by desire into delusion and agitation, if sentient beings are raging with anger and fights with each other, their minds are not tranquilized by conceit and jealousy, and they lose their original minds due to affliction, if sentient beings are ignorant and dark and don't have the intention to escape, they don't realize there are causes and don't fear the future, if sentient beings gather wealth and treasure in abundance and don't tire of it, or if sentient beings are fully engaged in the ten evils and never rest.",
        "source": "T13n0408_001:0671b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子為彼等故，閉惡道門開天人路，猶如妙車運令上生，安置涅槃解脫正道。",
        "translation": "For those reasons, this good man closes the door of the bad path and opens the way for gods and humans, like a wonderful chariot that carries sentient beings upward and places them on the right path to nirvāṇa and liberation.",
        "source": "T13n0408_001:0671b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，此善男子於諸天人應受供養，唯除如來、阿羅呵、三藐三佛陀。」",
        "translation": "Because of this, this good man should accept offerings from gods and humans, except for the Tathāgata, Ālāha, and Samyak-saṃbuddha.\"",
        "source": "T13n0408_001:0671b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彌勒菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that Maitreya Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0408_001:0671b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於前說有四重者，何等為四？",
        "translation": "What are the four grave prohibitions that the Buddha explained earlier?",
        "source": "T13n0408_001:0671b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而諸眾生犯四重已，退失諸善、斷滅善根、墮於惡道，違本誓願，煩惱所押、為諸天人之所憎惡。",
        "translation": "After violating these four grave offenses, sentient beings retreat from goodness, cut off their good roots, fall into a bad path, disobey their original vows, are stifled by affliction, and are hated by gods and humans.",
        "source": "T13n0408_001:0671b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此善男子見如是等諸惡眾生，拔彼苦惱置安樂處，令得充足。」",
        "translation": "Seeing such bad sentient beings, this good man removes their suffering and distress and places them in a peaceful place, making them prosperous.\"",
        "source": "T13n0408_001:0671b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告彌勒菩薩：「善男子！",
        "translation": "It was then that the Buddha addressed Maitreya Bodhisattva, \"Good sons!",
        "source": "T13n0408_001:0671b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡剎利王有五重惡，若彼國王犯五惡者，失於往昔所造善根，忘本誓願被煩惱蓋，遠離天人一切樂事，墮於惡道無有出時。",
        "translation": "\"Where there are five serious evils for a king of a bhadra, if that king commits those five evils, he'll lose the good roots he created in the past, forget his original vows and be hindered by afflictions, become estranged from all the pleasures of gods and humans, and fall into a bad destiny from which there's no escape.",
        "source": "T13n0408_001:0671b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0671b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有剎利灌頂王者，強奪佛物、或奪僧物招提僧物、或奪信心所施之物，或自身奪或教人奪，是名第一極惡重罪。",
        "translation": "If a king of the bodhisattva consecration forcibly takes something belonging to the Buddha, or something belonging to the saṃgha, or something given by faith, either by himself or by teaching others to take it, this is the first most heinous and serious misdeed.",
        "source": "T13n0408_001:0671b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有剎利灌頂之王，誹謗正法，或聲聞乘、或緣覺乘、或復大乘，誹謗不信，不令他行教令隱藏，是名第二極惡重罪。",
        "translation": "If the king of the bodhisattva consecration denigrates the right teaching, whether it's the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, or the greater vehicle, denigrates unbelief, doesn't allow others to practice, and teaches them to hide, this is the second most heinous and serious misdeed.",
        "source": "T13n0408_001:0671b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有剎利灌頂之王，為我出家諸弟子等剃除鬚髮著袈裟者，若持戒者、若無持戒，身脫袈裟令彼還俗，科彼與罪，若打若縛、若復罵辱流徙諸方、或遣輸物、或令入獄、或斷命根，是名第三極惡重罪。",
        "translation": "If there's a king of the bhadra consecration who shaves off the hair of his head and puts on the reddish-brown robes for one of my renunciant disciples, or if he upholds the precepts or doesn't uphold them, takes off his reddish-brown robes and causes him to return to the secular world, disciplining him for a crime, beating, binding, insulting, or sending him away to various places, sending him away with goods, putting him in prison, or cutting off his life root, this is called the third most heinous and serious offense.",
        "source": "T13n0408_001:0671c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有剎利灌頂之王，故斷父命、故斷母命、或復斷我弟子阿羅漢命、破和合僧、出佛身血。",
        "translation": "If there's a king consecrated by a bhadra who cuts off his father's life or his mother's life because of it, or if he also cuts off the life of an arhat who's a disciple of mine, breaks up the harmony of the saṃgha, or spills the blood of the Buddha's body, then that's the third most serious offense.",
        "source": "T13n0408_001:0671c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等五逆，若犯一種、或始發心，是名第四極惡重罪。",
        "translation": "If he commits one of these five heinous crimes or has just begun to do so, this is called the fourth most heinous and serious offense.",
        "source": "T13n0408_001:0671c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有剎利灌頂之王，不說有因棄於來世，行十惡業。",
        "translation": "If there's a king consecrated by a bhadra who doesn't explain that there's a cause for abandoning the future world, he'll perform ten bad actions.",
        "source": "T13n0408_001:0671c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十惡業中多教眾生行十不善建立十惡，是名第五極惡重罪。",
        "translation": "If he often teaches sentient beings to perform the ten unwholesome deeds and establish the ten evils, this is called the fifth most heinous and serious misdeed.",
        "source": "T13n0408_001:0671c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0671c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有剎利灌頂之王，此等五惡但犯一者，彼剎利王失於往昔所作善根悉令散滅，違本誓願被煩惱蓋，失天人樂後墮惡道，於無量劫無有出期。",
        "translation": "If a religious consecration king commits just one of these five evils, that religious king will lose the good roots he built in the past and have them all dissipated, be hindered by afflictions in violation of his original vow, lose the pleasure of gods and humans, and fall into a bad destiny, with no possibility of escape in an immeasurable eon.",
        "source": "T13n0408_001:0671c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0671c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此虛空孕菩薩摩訶薩，為彼眾生故生邊地顯示其身，或作沙門婆羅門等威儀庠序，觀彼眾生隨何身化，方便示現如是身相，在在處處於國王前如是說法，昔未聞者如來所說一切智法甚深經典，持戒忍辱諸地行相為說示現。",
        "translation": "\"This Ākāśagarbha-mahāsattva is a pregnant bodhisattva who, for the sake of those sentient beings, is born in a border land and displays his body, or he becomes an ascetic, a brāhmaṇa, or some other kind of dignified manner, observes the various bodies of those sentient beings as they are transformed, skillfully shows such a body, and speaks thus before the king from place to place, teaching those who have never heard before the profound scriptures of the Tathāgata's teaching of all wisdom, observing precepts, tolerating humility, and the conduct of the stages for their explanation and manifestation.",
        "source": "T13n0408_001:0671c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知彼剎利灌頂之王，昔造諸罪作不善行，自悔自慚，欲得謝過更不敢造，捨離惡事有悔過者，後作福德行大布施建立善業，往生上界即得解脫。",
        "translation": "He knew that the consecrated king of the bhadra had committed various sins and unwholesome acts in the past, had repented and conscientiously acknowledged them, wanted to be thankful for their faults, didn't dare to do them again, abandoned bad deeds and repented, and subsequently made great gifts of merit to establish good deeds that would lead to liberation when they were born in the upper realms.",
        "source": "T13n0408_001:0671c21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0408_001:0671c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切大臣有五重罪。",
        "translation": "\"There are five serious crimes committed by all ministers.",
        "source": "T13n0408_001:0671c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有大臣，奪取佛物、或奪僧物招提僧物，是名第一重罪。",
        "translation": "If a minister takes a buddha's property, or if he takes a saṃgha's property and solicits a saṃgha's property, this is the first serious offense.",
        "source": "T13n0408_001:0671c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有大臣，破國村邑、或破聚落、或破城隍、或破他國，是名第二重罪。",
        "translation": "If a minister destroys a country, village, town, town god, or another country, this is the second serious offense.",
        "source": "T13n0408_001:0671c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有大臣，誹謗正法、或聲聞乘、或緣覺乘、或一切智乘，若自誹謗、若教他謗，不令修行，隱沒不顯，是名第三重罪。",
        "translation": "If a minister denigrates the right teaching, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, or the vehicle of omniscience, if he denigrates it himself or teaches others to denigrate it, doesn't allow it to be cultivated, and suppresses it without revealing it, this is called the third serious offense.",
        "source": "T13n0408_001:0671c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有大臣，於佛世尊出家弟子故生擾亂而恐怖之，若有持戒若不持戒、若有精進若不精進，脫彼袈裟逼令還俗，或與身罪、或打或縛、禁繫罵辱呵叱恐怖、或令輸物、或令入獄、或斷命根，如是名為第四重罪。",
        "translation": "If a minister disturbs and terrorizes a renunciant disciple of the Bhagavān, or if he observes or doesn't observe precepts, or if he makes effort or doesn't make effort, he takes off his robe and forces him to return to the secular world, or if he is physically offended, beaten or bound, restrained, insulted, shouted at, or terrorized, or causes him to lose property, go to prison, or cut off his life root, this is called the fourth serious offense.",
        "source": "T13n0408_001:0672a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有大臣，造作五逆，或一或二或三或四，或具五種造罪惡業，如是名為第五重罪。",
        "translation": "If there's a minister who commits five heinous acts, whether one, two, three, four, or all five kinds of bad actions that create crimes, this is called the fifth serious offense.",
        "source": "T13n0408_001:0672a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0672a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有大臣，此五重中若犯一者，彼等大臣失於往業，所作善根皆悉滅盡，違本誓願失天人樂，墮於惡道受大極苦。",
        "translation": "If a minister violates one of these five rules, that minister will lose his past actions, all the good roots he's worked for will perish, and he'll lose the pleasures of gods and humans in violation of his original vow, falling into a bad destiny and undergoing great suffering.",
        "source": "T13n0408_001:0672a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0672a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此虛空孕菩薩摩訶薩，為彼眾生生於邊地，故住邊地示現身相，作沙門身威儀庠序為彼說法、或復現於婆羅門身容儀齊肅、或作童子而為說法，在在處處示現生相，知彼等輩隨有善根而為說法，未曾有者諸佛所說深妙經典諸陀羅尼忍辱諸地慰喻說法，作是方便令諸臣等悔過發露心生慚愧，懺彼惡業捨離眾罪，教修布施精進持戒，建立善業往生上方得涅槃道。",
        "translation": "For the sake of those sentient beings born in the borderlands, this Ākāśagarbha-mahāsattva shows himself in the borderlands, assumes the body of an ascetic with dignified demeanor, speaks to them, furthermore, he shows himself as a brāhmaṇa with dignified demeanor, or he speaks as a boy, demonstrates the appearance of birth everywhere, knows that these people follow their good roots, speaks to them from profound and subtle scriptures and dhāraṇīs that have never been taught by the buddhas, tolerates and speaks comfortably in parables, makes this method cause ministers to repent of their faults, reveal their conscience, confess their bad deeds, abandon their sins, teach generosity, diligently observe precepts, and establish good actions that lead to rebirth upward and the path to nirvāṇa.",
        "source": "T13n0408_001:0672a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0408_001:0672a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞之人有五種事犯大重罪。",
        "translation": "There are five things that śrāvakas do that are major grave offenses.",
        "source": "T13n0408_001:0672a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T13n0408_001:0672a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者殺生；二者行婬；三者劫盜；四者妄語；五者破壞形像出佛身血。",
        "translation": "One kills beings, two commits sexual misconduct, three steals, four speaks false words, and five destroys images and spills the blood of the Buddha's body.",
        "source": "T13n0408_001:0672a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名五種犯大重罪。",
        "translation": "These are called the five kinds of major serious offenses committed.",
        "source": "T13n0408_001:0672a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我聲聞諸弟子等於五事中但犯一者，乃至如上所說之事，是虛空孕菩薩摩訶薩為彼等故往生彼處示現身相，或作沙門及婆羅門，以彼威儀現彼身相，為說種種微妙法義，一切智人所說甚深種種法門修多羅等諸陀羅尼一切諸地顯揚宣說，令彼等聞悔昔所造種種諸惡，憶念不忘深生慚愧，懺悔彼罪更不敢作。",
        "translation": "If we śrāvaka disciples commit just one of these five offenses, or even something like the above, it's because of them that the Ākāśagarbha Bodhisattva, Mahāsattva, and others go there and show themselves, or become ascetics or priests, and they present themselves with their dignity and demeanor, teach the various subtle meanings of the Dharma, and the profound various Dharma teachings of people of omniscience, such as the sūtra and other dhāraṇīs, and proclaim them in all the various places, so that they hear them and repent of the various evils they did in the past, remember them and don't forget them, and deeply feel conscience, repenting their sins and not daring to do them again.",
        "source": "T13n0408_001:0672a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懺悔罪已，修行布施，備行苦行精勤勇猛，命終上生後得涅槃，即便發心入於大乘行菩薩行。",
        "translation": "After they repent of their sins, they cultivate generosity, prepare for ascetic practices, and work energetically and vigorously to attain nirvāṇa after their lives end and they are reborn, even as they set their minds to enter the great vehicle and practice the bodhisattva path.",
        "source": "T13n0408_001:0672b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0408_001:0672b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘之人有八種事犯於大罪，造八重已令彼初行諸菩薩等失彼往昔所種善根皆悉滅失，違本誓願為煩惱蓋，使諸天人之所輕忽，違背大乘即墮惡道，於多時間在煩惱處離善知識。",
        "translation": "There are eight ways in which a great vehicle person commits a major sin, creating eight grave offenses that cause first-time bodhisattvas and others to lose the good roots they planted in the past, violate their original vows and become a hindrance to affliction, cause gods and humans to despise them, deviate from the great vehicle and fall into a bad path, and spend much time in the place of affliction apart from good friends.",
        "source": "T13n0408_001:0672b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0408_001:0672b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T13n0408_001:0672b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，以於往昔造惡因緣生不淨剎。",
        "translation": "\"Suppose there are sentient beings who were born in an impure brake because of the bad causes and conditions they created in the past.",
        "source": "T13n0408_001:0672b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等眾生以不多種善根因緣故，因善知識乃能得聞甚深大乘微妙經典。",
        "translation": "Because they don't have many kinds of causes and conditions for good roots, those sentient beings are able to hear the subtle sūtras of the profound great vehicle because of a good teacher.",
        "source": "T13n0408_001:0672b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼眾生等心意狹劣，亦復不能多種善根。",
        "translation": "Because of their narrow-mindedness, those sentient beings also aren't able to cultivate many good roots.",
        "source": "T13n0408_001:0672b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是初行菩薩雖復發於阿耨多羅三藐三菩提心，聞是甚深空相經典，為他解說讀誦。",
        "translation": "Even though they have once again aroused the mind of unsurpassed, perfect enlightenment, these novice bodhisattvas hear these profound scriptures on emptiness and explain them to others for them to recite.",
        "source": "T13n0408_001:0672b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其所聞如其所誦，為種種愚癡啞羊眾生如是之輩宣揚敷演，於彼前說一切智法教令讀誦。",
        "translation": "Just as he hears it and recites it, he proclaims and expounds it for this kind of group of foolish, dumb, and sheepish sentient beings, explaining all the teachings of cognition before them and causing them to recite it.",
        "source": "T13n0408_001:0672b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼凡夫無有功勞，以凡夫心不能得解甚深法意，聞是法已生恐怖心，心生悔沒，即便背於阿耨多羅三藐三菩提，於聲聞行中發心修學。",
        "translation": "That ordinary person has no merit, and because their ordinary mind can't understand the profound meaning of the teaching, they become frightened after hearing this teaching, repent, and turn their back on the unsurpassed, corrected, and determined to train in the śrāvaka path.",
        "source": "T13n0408_001:0672b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空孕菩薩經卷上",
        "translation": "Ākāśagarbha-sūtra, Vol. 1",
        "source": "T13n0408_001:0672b20_0",
        "is_bad_quality": false
    }
]