[
    {
        "source_sentence": "大集大虛空藏菩薩所問經卷第",
        "translation": "Daji daxukongzang pusa suowen jing roll di",
        "source": "T13n0404_002:0617b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二",
        "translation": "two",
        "source": "T13n0404_002:0617b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開府儀同三司特進試鴻臚卿肅國",
        "translation": "Hongxing Qing Suguo, Specially Advanced Examination of the Third Secretary of the Kaifu Ritual",
        "source": "T13n0404_002:0617b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "公食邑三千戶賜紫贈司空謚大鑑",
        "translation": "The Duke received a grant of 3,000 households and was given the purple color as a gift from the Secretary of State for the Great Mirror.",
        "source": "T13n0404_002:0617b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正號大廣智大興善寺三藏沙門",
        "translation": "Sanzang Shaman of Daxingshan Temple, Correctly Named Dagong Zhi",
        "source": "T13n0404_002:0617b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不空奉　詔譯",
        "translation": "Amoghasiddhi Translation of the imperial edict",
        "source": "T13n0404_002:0617b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復告大虛空藏菩薩摩訶薩言：「善男子！",
        "translation": "At that point, the Bhagavān again addressed the Mahākauṣṭhila Bodhisattva Mahāsattva, saying, \"Good sons!",
        "source": "T13n0404_002:0617b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就四法，修行淨戒波羅蜜多猶若虛空。",
        "translation": "When a bodhisattva accomplishes four things, cultivating the perfection of pure precepts is like space.",
        "source": "T13n0404_002:0617b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0617b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：知身如影像；知聲如谷響；知心如幻化；知慧如虛空。",
        "translation": "\"It's knowing the body as an image, knowing sound as a grain sound, knowing the mind as an illusion, and knowing wisdom as space.",
        "source": "T13n0404_002:0617b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就四法，修行淨戒波羅蜜多猶若虛空。",
        "translation": "These are the four things a bodhisattva accomplishes when he cultivates the perfection of pure precepts as if it were empty space.",
        "source": "T13n0404_002:0617b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，若菩薩成就八法，能淨修行淨戒波羅蜜多。",
        "translation": "\"Furthermore, if a bodhisattva accomplishes eight things, he'll be able to purify the practice of the perfection of pure precepts.",
        "source": "T13n0404_002:0617b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0617b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：不離菩提心，戒清淨故；離聲聞、緣覺心得無限量心，戒清淨故；不捨一切學處，智慧清淨故；於一切處受生，願清淨故；於戒不緩任運無作，行清淨故；迴向菩提，魔羅心清淨故；心無熱惱，煩惱清淨故；大願圓滿，菩提清淨故。",
        "translation": "They are: not parting with the mind of enlightenment, which purifies the precepts; parting with the unlimited minds of the śrāvakas and pratyekbuddhas, which purifies the precepts; not abandoning all the places of training, which purifies wisdom; taking birth in all places, which purifies vows; not being lazy about the precepts and not making any effort, which purifies practice; dedicating oneself to enlightenment, which purifies the mind of māra; having no mental anguish, which purifies the afflictions; and fulfilling the great vow, which purifies enlightenment.",
        "source": "T13n0404_002:0617b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行淨戒波羅蜜多。",
        "translation": "These are the eight things a bodhisattva accomplishes to purify the practice of the perfection of pure precepts.",
        "source": "T13n0404_002:0617c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0617c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空清淨，菩薩持戒清淨亦爾；譬如虛空無有垢穢，菩薩持戒無垢亦爾；譬如虛空寂靜不亂，菩薩持戒寂靜亦爾；譬如虛空無有邊際，菩薩持戒無邊亦爾；譬如虛空無有繫屬，菩薩持戒無繫亦爾；譬如虛空無有執著，菩薩持戒離著亦爾；譬如虛空無可積集，菩薩持戒無積亦爾；譬如虛空不離於性，菩薩持戒不離亦爾；譬如虛空其性常住，菩薩持戒常住亦爾；譬如虛空究竟無盡，菩薩持戒無盡亦爾；譬如虛空無有形相，菩薩持戒離相亦爾；譬如虛空無有來、往，菩薩持戒無動亦爾；譬如虛空無有戲論，菩薩持戒離戲亦爾；譬如虛空遠離諸漏，菩薩持戒無漏亦爾；譬如虛空無所為作，菩薩持戒無為亦爾；譬如虛空無有變易，菩薩持戒不變亦爾；譬如虛空無有分別，菩薩持戒無取亦爾；譬如虛空遍一切處，菩薩持戒周遍亦爾；譬如虛空無有破壞，菩薩持戒無犯亦爾；譬如虛空無有高下，菩薩持戒平等亦爾；譬如虛空性離於染，菩薩持戒無染亦爾。",
        "translation": "譬如虛空清淨，菩薩持戒清淨亦爾；譬如虛空無有垢穢，菩薩持戒無垢亦爾；譬如虛空寂靜不亂，菩薩持戒寂靜亦爾；譬如虛空無有邊際，菩薩持戒無邊亦爾；譬如虛空無有繫屬，菩薩持戒無繫亦爾；譬如虛空無有執著，菩薩持戒離著亦爾；譬如虛空無可積集，菩薩持戒無積亦爾；譬如虛空不離於性，菩薩持戒不離亦爾；譬如虛空其性常住，菩薩持戒常住亦爾；譬如虛空究竟無盡，菩薩持戒無盡亦爾；譬如虛空無有形相，菩薩持戒離相亦爾；譬如虛空無有來、往，菩薩持戒無動亦爾；譬如虛空無有戲論，菩薩持戒離戲亦爾；譬如虛空遠離諸漏，菩薩持戒無漏亦爾；譬如虛空無所為作，菩薩持戒無為亦爾；譬如虛空無有變易，菩薩持戒不變亦爾；譬如虛空無有分別，菩薩持戒無取亦爾；譬如虛空遍一切處，菩薩持戒周遍亦爾；譬如虛空無有破壞，菩薩持戒無犯亦爾；譬如虛空無有高下，菩薩持戒平等亦爾；譬如虛空性離於染，菩薩持戒無染亦爾。",
        "source": "T13n0404_002:0617c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0617c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩修行淨戒波羅蜜多猶若虛空。」",
        "translation": "This is a bodhisattva who cultivates the perfection of pure precepts just like space.\"",
        "source": "T13n0404_002:0617c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「護戒寂靜心無垢，　　能除熱惱無所得；　身、語、意業無瑕疵，　　一切律儀皆具足。",
        "translation": "It was then that the Bhagavān spoke to Jātaka, saying, \"Guard the precepts with a serene mind that's spotless, capable of ridding itself of feverish vexations and attaining nothing, and whose physical, verbal, and mental actions are without blemish, and in which all manner of discipline is complete.",
        "source": "T13n0404_002:0617c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者不以戒憍逸，　　內心恒寂而無亂；　智者常依菩提心，　　而於心意不染著。",
        "translation": "A wise person doesn't become proud of the precepts, and their mind remains calm and unconfused; a wise person always relies on the mind of enlightenment, and their mind isn't tainted with attachment.",
        "source": "T13n0404_002:0618a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離諸業無思慮，　　如是不生諸分別；　既離青、黃及赤、白，　　亦不住於名色中。",
        "translation": "Secluded from actions and without thought, he thus doesn't give rise to discrimination; since he's free of blue, yellow, red, and white, he doesn't dwell in name-and-form.",
        "source": "T13n0404_002:0618a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無取、無捨、無染心，　　譬如虛空無障礙；　此戒智者所稱讚，　　不見所讚諸句義。",
        "translation": "Without grasping, without equanimity, and without defiled thought, it's like space without obstruction; these precepts are praised by wise ones who don't see the meaning of the praised phrases.",
        "source": "T13n0404_002:0618a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是戒能令心寂靜，　　亦能寂靜諸煩惱；　悉得止觀之邊際，　　了然顯現得解脫。",
        "translation": "These precepts calm the mind and quell the afflictions, fully realizing the limits of calm abiding and clear manifestation and attaining liberation.",
        "source": "T13n0404_002:0618a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　解脫諸縛之聖者，　　悉皆安住於尸羅；　是故戒為勝解脫，　　亦為菩提根本句。",
        "translation": "The noble ones who are liberated from their bonds all abide comfortably in Śīlabhadra; therefore, the precepts are superior liberation and are also the fundamental basis of enlightenment.",
        "source": "T13n0404_002:0618a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有杜多居蘭若，　　小欲喜足絕貪求；　遠離憒閙而住禪，　　心獲輕安離煩惱。",
        "translation": "Those of you who have an abundance of precepts and live in a forest, delight in small desires and stop craving, abide in meditation far removed from anxiety, and attain mental equanimity and freedom from affliction.",
        "source": "T13n0404_002:0618a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是戒是為根本，　　思惟寂靜解脫句；　是故尸羅為莊嚴，　　一切處為安樂道。",
        "translation": "Thus, these precepts are fundamental, and the phrase quiescent liberation is contemplated; therefore, Śīlabhadra is adorned, and all places are the path to well-being.",
        "source": "T13n0404_002:0618a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦令遠離於散動，　　斷諸煩惱及諸見；　慈心遍布如虛空，　　能靜邊執令清淨。",
        "translation": "It also frees him from agitation, stops the afflictions and views, and spreads his compassionate mind like space, which quiets extreme attachments and purifies them.",
        "source": "T13n0404_002:0618a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　決定不捨菩提故，　　而於菩提無分別；　智者若具如是德，　　皆由於戒到彼岸。",
        "translation": "Because he's determined not to abandon enlightenment, he has no discrimination about it; if a wise person possesses such virtues, it's all because of the precepts that they reach the other shore.",
        "source": "T13n0404_002:0618a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0618a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩成就四法，修行忍辱波羅蜜多猶若虛空。",
        "translation": "If a bodhisattva accomplishes four things, cultivating the perfection of forbearance is like space.",
        "source": "T13n0404_002:0618a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0618a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：他罵不報，知語如虛空；他打不報，知身如虛空；他瞋不報，知心如虛空；掉戲不報，知意如虛空。",
        "translation": "They say, \"Don't take it personally when someone scolds you, knowing that your words are like space; don't take it personally when someone hits you, knowing that your body is like space; don't take it personally when someone gets angry, knowing that your mind is like space; and don't take it personally when you get into play, knowing that your thoughts are like space.",
        "source": "T13n0404_002:0618a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就四法，修行忍辱波羅蜜多猶若虛空。",
        "translation": "These are the four things a bodhisattva accomplishes when he cultivates the perfection of forbearance as if it were empty space.",
        "source": "T13n0404_002:0618a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，若菩薩成就八法，能淨修行忍辱波羅蜜多。",
        "translation": "\"Furthermore, if a bodhisattva accomplishes eight things, he'll be able to purify the practice of the perfection of patience and humiliation.",
        "source": "T13n0404_002:0618a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0618a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：於諸有情心無限礙猶若虛空，修行忍辱得清淨故；於諸利養不生貪著猶若虛空，修行忍辱得清淨故；於諸有情利益平等猶若虛空，修行忍辱得清淨故；身、心無壞猶若虛空，修行忍辱得清淨故；離諸惑結猶若虛空，修行忍辱得清淨故；離所觀境猶若虛空，修行忍辱得清淨故；觀諸法性不生、不滅猶若虛空，修行忍辱得清淨故；於色、無色以慈遍緣猶若虛空，修行忍辱得清淨故。",
        "translation": "所謂：於諸有情心無限礙猶若虛空，修行忍辱得清淨故；於諸利養不生貪著猶若虛空，修行忍辱得清淨故；於諸有情利益平等猶若虛空，修行忍辱得清淨故；身、心無壞猶若虛空，修行忍辱得清淨故；離諸惑結猶若虛空，修行忍辱得清淨故；離所觀境猶若虛空，修行忍辱得清淨故；觀諸法性不生、不滅猶若虛空，修行忍辱得清淨故；於色、無色以慈遍緣猶若虛空，修行忍辱得清淨故。",
        "source": "T13n0404_002:0618a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行忍辱波羅蜜多猶若虛空。",
        "translation": "These are the eight things a bodhisattva accomplishes that purify the practice of the perfection of forbearance as if it were empty space.",
        "source": "T13n0404_002:0618b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0618b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八法，能諦觀察修行忍辱波羅蜜多。",
        "translation": "\"There are another eight things that can be observed with the utmost care when cultivating the perfection of forbearance.",
        "source": "T13n0404_002:0618b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0618b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂性空忍辱，不壞諸見故；無相忍辱，不遣於相故；無願忍辱，不捨菩提故；無行忍辱，不盡有為故；無生忍辱，不住無為故；無起忍辱，不住生滅故；無有情忍辱，不壞體性故；如如忍辱，不壞三世故。",
        "translation": "It's called the forbearance of emptiness, which doesn't destroy views; the forbearance of having no marks, which doesn't reject marks; the forbearance of having no desire, which doesn't abandon enlightenment; the forbearance of having no practice, which doesn't end existential activity; the forbearance of having no birth, which doesn't abide in nonexistence; the forbearance of having no arising, which doesn't abide in arising and ceasing; the forbearance of having no sentient beings, which doesn't destroy their essence; and the forbearance of thusness, which doesn't destroy the three worlds.",
        "source": "T13n0404_002:0618b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善男子！",
        "translation": "Thus, good sons!",
        "source": "T13n0404_002:0618b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為八種諦察法忍能修忍辱波羅蜜多。",
        "translation": "These are the eight kinds of forbearance in observing principles that cultivate the perfection of forbearance.",
        "source": "T13n0404_002:0618b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T13n0404_002:0618b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行忍辱波羅蜜多時，若有毀罵於我，我當忍受，名我忍辱，非忍辱波羅蜜多。",
        "translation": "\"When I practice the perfection of forbearance, if I'm reviled, I'll tolerate it, which is called the perfection of forbearance of self and not the perfection of forbearance of insults.",
        "source": "T13n0404_002:0618b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見罵者及以罵法，我當忍受，名我忍辱，非忍辱波羅蜜多。",
        "translation": "If I see someone who ridicules me and the way they ridicule me, I'll tolerate it, which is called the pāramitā of tolerating myself and not the pāramitā of tolerating humiliation.",
        "source": "T13n0404_002:0618b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住無諍行是音聲忍辱，非忍辱波羅蜜多。",
        "translation": "To abide in the practice of no-strife is forbearance with sound, not the perfection of forbearance.",
        "source": "T13n0404_002:0618b16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是加行彼我俱空，思惟忍受彼我無常，思惟忍受，此名施設忍辱，非忍辱波羅蜜多。",
        "translation": "To do this applied practice of making both that self and that self empty, contemplate tolerating that self as impermanent, and contemplate tolerating it is called the pāramitā of tolerating what's posited, not the pāramitā of tolerating it.",
        "source": "T13n0404_002:0618b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0618b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "都不見有能行、所行。",
        "translation": "\"They don't see what they can do or what they do.",
        "source": "T13n0404_002:0618b19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大娑羅林，若復有人手持利斧，入彼林中斫其枝葉，彼樹終無一念之心，彼為能斫、此為所斫，不生憎愛。",
        "translation": "It's like the great Sālêndra forest, for example, when someone with a sharp ax enters that forest and chops down its branches and leaves, the tree never has a single thought that they're the thing that gets chopped down and that they're the thing that gets chopped down, and they don't become disagreeable.",
        "source": "T13n0404_002:0618b20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0618b22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行忍辱波羅蜜多時，亦復如是無有憎愛，無能分別、無所分別，是為菩薩修行忍辱波羅蜜多猶若虛空。」",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of forbearance, it's likewise without hatred, without the ability to discriminate, and without discrimination, which is like the bodhisattva's practice of the perfection of forbearance as if it were empty space.\"",
        "source": "T13n0404_002:0618b22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「盡智無生清淨忍，　　於境不染意成就；　內、外寂靜無所依，　　心淨忍辱虛空等。",
        "translation": "It was then that the Bhagavān spoke to the buddha, saying, \"Endowed with knowledge, unborn pure tolerance, undefiled in regard to objects, accomplished with intent, tranquil in internal and external quiescence, and with a mind as pure and tolerant as space.",
        "source": "T13n0404_002:0618b25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是身如影、如草木，　　心形如幻無真實；　是法性空無所見，　　身、心變異等於彼。",
        "translation": "The body is like a shadow or a blade of grass, and the mind's form is illusory and unreal; the nature of these things is empty without being seen, and the body and mind change like that.",
        "source": "T13n0404_002:0618b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設有毀、譽無喜、怒，　　無所分別、無高下；　知忍如地、如門閫，　　依教忍辱度有情。",
        "translation": "If there's disparagement and praise, no joy or anger, nothing discriminated, and nothing higher or lower, knowing that forbearance is like the ground and a gate and a path, they rely on the teaching to patiently save sentient beings.",
        "source": "T13n0404_002:0618c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖知一切法性空，　　無人、無我、無壽命；　不違因緣及造作，　　此忍最為真實行。",
        "translation": "Even though he knows the nature of all things is empty, there's no person, no self, and no life; this forbearance is most truly practiced when it doesn't contradict causes and conditions or creations.",
        "source": "T13n0404_002:0618c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞彼惡言不瞋恚，　　知語言性如虛空；　修習身、心空亦然，　　當淨有情修此忍。",
        "translation": "They don't get angry when they hear those harsh words, knowing that the nature of language is like space; cultivating the emptiness of body and mind is likewise, which will purify sentient beings and cultivate this forbearance.",
        "source": "T13n0404_002:0618c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0618c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩修行精進波羅蜜多猶若虛空？",
        "translation": "\"How does a bodhisattva cultivate the perfection of effort just like space?",
        "source": "T13n0404_002:0618c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩成就四法，修行精進波羅蜜多猶若虛空。",
        "translation": "\"If a bodhisattva accomplishes four things, cultivating the perfection of effort is like space.",
        "source": "T13n0404_002:0618c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0618c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：勤修善根，知一切法未成就故；於諸佛所作大供養，了知如來身平等故；常樂成就無量有情，知諸有情無所得故；從諸佛所受持正法，不見諸法所厭離故。",
        "translation": "They are: diligently cultivating good roots, knowing that all dharmas have yet to be accomplished; making great offerings to the buddhas, knowing that the tathāgata's body is equal; always delighting in the accomplishment of measureless sentient beings, knowing that sentient beings attain nothing; and accepting and upholding the right dharma from the buddhas, not seeing any dharmas to which one is disillusioned.",
        "source": "T13n0404_002:0618c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就四法，修行精進波羅蜜多猶若虛空。",
        "translation": "These are the four things a bodhisattva accomplishes when he cultivates the perfection of effort as if it were space.",
        "source": "T13n0404_002:0618c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0404_002:0618c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩成就八法，能淨修行精進波羅蜜多。",
        "translation": "\"If a bodhisattva accomplishes eight things, he can purify the practice of the perfection of effort.",
        "source": "T13n0404_002:0618c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0618c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由莊嚴身，勤行精進，知身如影，像無所得故；由莊嚴語，勤行精進，知語如露，性無所得故；由莊嚴心，勤行精進，得致於定，知心無所得故；為具諸波羅蜜分，勤行精進，展轉修習，思惟無所得故；由成就一切菩提分法，勤行精進，菩提性相，思惟無所得故；為淨佛土，勤行精進，知諸佛國等於虛空，無所得故；為成就一切所聞悉皆能持，勤行精進，知所聞法猶如響應，究竟無所得故；為成就一切佛法故，勤行精進，知諸法界平等一相，思惟無所得故。",
        "translation": "由莊嚴身，勤行精進，知身如影，像無所得故；由莊嚴語，勤行精進，知語如露，性無所得故；由莊嚴心，勤行精進，得致於定，知心無所得故；為具諸波羅蜜分，勤行精進，展轉修習，思惟無所得故；由成就一切菩提分法，勤行精進，菩提性相，思惟無所得故；為淨佛土，勤行精進，知諸佛國等於虛空，無所得故；為成就一切所聞悉皆能持，勤行精進，知所聞法猶如響應，究竟無所得故；為成就一切佛法故，勤行精進，知諸法界平等一相，思惟無所得故。",
        "source": "T13n0404_002:0618c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行精進波羅蜜多。",
        "translation": "These are the eight things a bodhisattva accomplishes that purify the practice of the perfection of effort.",
        "source": "T13n0404_002:0618c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0618c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有二種精進，所謂：加行精進；限齊精進。",
        "translation": "\"Again, bodhisattvas have two kinds of exertion, which are called the exertion of applied practices and the exertion of restriction and alignment.",
        "source": "T13n0404_002:0618c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以加行精進策身、口、意，修習成就一切善法，無有所住，思惟無所得故。",
        "translation": "With the exertion of applied practices, they cultivate the accomplishment of all good qualities in body, speech, and mind, without any abiding, and because their contemplation is unobtainable.",
        "source": "T13n0404_002:0618c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以限齊精進應住不出、不入，隨順法界無所去來，則如虛空，無所得故。",
        "translation": "With limited and uniform effort, he should abide without exiting or entering, and he follows the Dharma realm without going or coming, then he's like space, having nothing to gain.",
        "source": "T13n0404_002:0619a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如虛空無色於諸有情成就所作，菩薩精進亦復如是，依諸佛法成就一切有情事故。",
        "translation": "As empty space without form accomplishes what's created in sentient beings, so too does the bodhisattva's exertion accomplish the works of all sentient beings based on the Buddha's teachings.",
        "source": "T13n0404_002:0619a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如虛空含容一切色，菩薩精進含容一切有情，離一切見亦復如是。",
        "translation": "As space contains all form, so does the bodhisattva's exertion contain all sentient beings and is free of all views.",
        "source": "T13n0404_002:0619a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如虛空一切草木生長無根、無住，菩薩精進生長一切佛法，不住我見亦復如是。",
        "translation": "As in space, all grass and trees grow without roots and without abiding, so too does the bodhisattva's exertion grow all the Buddha's teachings, free of the view of self.",
        "source": "T13n0404_002:0619a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如虛空遍一切處無所動搖，菩薩精進遍一切善法，無所動相亦復如是。",
        "translation": "As space pervades all places without wavering, so too does the bodhisattva's exertion pervade all good qualities without wavering.",
        "source": "T13n0404_002:0619a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如虛空等現種種色，菩薩精進等為有情，示現修習平等思惟，皆無所得亦復如是。",
        "translation": "Just as space and so forth manifest various forms, so too does the bodhisattva's exertion demonstrate the cultivation of equal contemplation for sentient beings, which is unobtainable.",
        "source": "T13n0404_002:0619a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0619a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩修行精進波羅蜜多猶若虛空。」",
        "translation": "This is a bodhisattva who cultivates the perfection of effort just like space.\"",
        "source": "T13n0404_002:0619a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「勇猛所生精進力，　　無悋於身及命財；　能行威德大菩提，　　於諸有情恒利益。",
        "translation": "It was then that the Bhagavān spoke to the bodhisattva, saying, \"The power of effort produced by vigor doesn't require stinginess for body and life and possessions; it's capable of practicing the mighty great bodhi and constantly benefits sentient beings.",
        "source": "T13n0404_002:0619a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　往昔所修功德利，　　不生厭倦常修習；　愛樂解脫諸有情，　　於諸如來常供養。",
        "translation": "He cultivates the merits and rewards of past endeavors, never wearies of cultivating them, loves and liberates sentient beings, and always makes offerings to the tathāgatas.",
        "source": "T13n0404_002:0619a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願遊無量諸佛剎，　　推伏一切諸魔羅；　常樂給施一切人，　　常樂護持於淨戒，　常樂大慈相應忍，　　常樂勤集諸善根，　思惟無量禪定心，　　以大智慧常觀察，　無量慈心捨瞋恚，　　功德利益正修行；　於身、於命無所慳，　　善能解脫諸煩惱。",
        "translation": "He wishes to visit measureless buddha bases, subdue all the māras, always enjoys giving to all people, always maintains pure precepts, always enjoys forbearance associated with great kindness, always enjoys diligently gathering good roots, contemplates measureless meditation states of mind, always observes with great wisdom, immeasurably comforts mind and rejects anger, and correctly cultivates merit for its benefit; he doesn't save anything in body or life and is well able to liberate all afflictions.",
        "source": "T13n0404_002:0619a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常修無我空解脫，　　離相、無相大威德；　永離諸見修菩提，　　如幻、陽焰觀自性。",
        "translation": "He always cultivates the liberation of selfless emptiness, the great authority of being free of marks and markslessness, permanently abandons views and cultivates enlightenment, and observes his own nature as illusion and mirage.",
        "source": "T13n0404_002:0619a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂說空法無思慮，　　依世淨行讀諸經；　於法、無法二俱亡，　　不捨音聲及文字。",
        "translation": "He enjoys teaching emptiness without contemplation, reads the scriptures based on pure worldly practices, and vanishes both dharmas and nonharmas without abandoning sounds and words.",
        "source": "T13n0404_002:0619a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於世常說諸經典，　　讚佛功德亦無邊；　有情心行既難量，　　智者應生大精進。",
        "translation": "He always teaches the sutras in the world, praising the Buddha's merits as limitless; since the mental functions of sentient beings are difficult to fathom, a wise person should make great effort.",
        "source": "T13n0404_002:0619a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悟於無量有情性，　　不滯於生及不生；　能以無邊精進心，　　常習度生諸淨法。",
        "translation": "Realizing the immeasurable nature of sentient beings, he isn't stuck in birth or nonbirth and can always cultivate the pure dharma of liberating sentient beings with boundless zeal.",
        "source": "T13n0404_002:0619b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0619b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩修行禪定波羅蜜多猶若虛空？",
        "translation": "How does a bodhisattva cultivate the perfection of meditation just like space?",
        "source": "T13n0404_002:0619b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩成就四法，修行禪定波羅蜜多猶若虛空。",
        "translation": "\"If a bodhisattva accomplishes four things, cultivating the perfection of meditation is like space.",
        "source": "T13n0404_002:0619b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0619b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：安心於內，內心無所見；制心於外，外心無所得；由自心平等故，知一切有情心亦平等；彼心及平等思惟，證知皆如幻化。",
        "translation": "It means that when you calm your mind internally, the internal mind sees nothing, and when you restrain your mind externally, the external mind obtains nothing; because your own mind is equal, you know that the minds of all sentient beings are also equal; and when you contemplate that mind and contemplate it equally, you realize that they are all illusory.",
        "source": "T13n0404_002:0619b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就四法，修行禪定波羅蜜多猶若虛空。",
        "translation": "These are the four things that bodhisattvas accomplish when they cultivate the perfection of meditation, which is like space.",
        "source": "T13n0404_002:0619b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0404_002:0619b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩成就八法，能淨修行禪定波羅蜜多。",
        "translation": "\"If a bodhisattva accomplishes eight things, he'll be able to purify the practice of meditation and the perfection of wisdom.",
        "source": "T13n0404_002:0619b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0619b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：不依蘊而修禪定；不依處而修禪定；不依界而修禪定；不依現世而修禪定；不依他世而修禪定；不依欲界而修禪定；不依色界而修禪定；不依無色界而修禪定。",
        "translation": "This is called cultivating meditation without relying on the aggregates, cultivating meditation without relying on the locations, cultivating meditation without relying on the elements, cultivating meditation without relying on the present life, cultivating meditation without relying on other lives, cultivating meditation without relying on the desire realm, cultivating meditation without relying on the form realm, and cultivating meditation without relying on the formless realm.",
        "source": "T13n0404_002:0619b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行禪定波羅蜜多猶若虛空。",
        "translation": "These are the eight things that bodhisattvas accomplish, which purify the practice of meditation and make the perfections of meditation just like space.",
        "source": "T13n0404_002:0619b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0404_002:0619b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以專注心禪定清淨。",
        "translation": "A bodhisattva's concentration is purified by concentrated mind meditation.",
        "source": "T13n0404_002:0619b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何專注？",
        "translation": "What is concentration?",
        "source": "T13n0404_002:0619b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於法名字不除、不加，無變異、無差別，無損、無益，無取、無捨，無暗、無明，無分別、非不分別，無想、無作意，無一、無二亦無無一二，無動、無思、無戲論，無積聚亦無無積聚，不思惟一切相，心無所住，名為專注。",
        "translation": "The mind is called concentrated when it doesn't remove or add names to qualities, doesn't change or discriminate, doesn't harm or benefit, doesn't grasp or relinquish, doesn't have darkness or ignorance, doesn't discriminate or not discriminate, doesn't think or contemplate, doesn't have one or two or neither, doesn't move, doesn't think, doesn't engage in conceptual proliferation, doesn't accumulate or not accumulate, doesn't contemplate all characteristics, and doesn't have a place to abide.",
        "source": "T13n0404_002:0619b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "專注心不流散，於色、眼、色識遠離故自相清淨；觀行專注心不流散，於聲、耳、聲識遠離故自相清淨；專注心不流散，於香、鼻、香識遠離故自相清淨；專注心不流散，於味、舌、味識遠離故自相清淨；專注心不流散，於觸、身、觸識遠離故自相清淨；專注心不流散，於法、意、法識遠離故自相清淨。",
        "translation": "When the mind is focused and not distracted, it's self-purified because form, eye, and form consciousness are distantly removed; when the mind is focused on contemplation and practice, it's self-purified because sound, ear, and sound consciousness are distantly removed; when the mind is focused and not distracted, it's self-purified because fragrance, nose, and fragrance consciousness are distantly removed; when the mind is focused and not distracted, it's self-purified because taste, tongue, and taste consciousness are distantly removed; when the mind is focused and not distracted, it's self-purified because touch, body, and touch consciousness are distantly removed; and when the mind is focused and not distracted, it's self-purified because dharmas, thoughts, and dharma consciousnesses are distantly removed.",
        "source": "T13n0404_002:0619b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0619b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空，於劫燒時不為所燒，於水災時不為所濕。",
        "translation": "It's like space that doesn't get burned when an eon burns up and doesn't get wet when a flood occurs.",
        "source": "T13n0404_002:0619b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩修習禪定，不為一切諸煩惱火之所焚燒；一切解脫等持、等至，諸禪定水之所漂溺。",
        "translation": "Thus, when a bodhisattva cultivates meditation, he isn't burned by the fires of all the afflictions, and he's equal to and equal to all the liberations and drowns in the waters of meditation.",
        "source": "T13n0404_002:0619b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常無間雜，令散動有情安住禪定，而於禪定不生愛味，出定亦然，無復障礙。",
        "translation": "Always without interruption, it causes distracted sentient beings to abide in meditation without craving for it, and it's the same when they emerge from meditation, with no further obstruction.",
        "source": "T13n0404_002:0619c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸聖人常現寂靜，非聖人所勤成就之。",
        "translation": "He always produces stillness in the presence of sages that's not achieved by the diligence of sages.",
        "source": "T13n0404_002:0619c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常令定心住於平等，不平等者說法化導。",
        "translation": "He always makes his concentrated mind abide in equality, and he teaches the Dharma to guide those who aren't equal.",
        "source": "T13n0404_002:0619c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見平等及不平等，於等、不等亦不相違。",
        "translation": "Not seeing equality and inequality, there's no contradiction between equality and inequality.",
        "source": "T13n0404_002:0619c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心無有礙猶如虛空，是故名為修禪定者；亦名勝慧修禪定者；亦名不住識修禪定者。",
        "translation": "The mind is unobstructed like space, and therefore it's called someone who cultivates meditation, someone who cultivates meditation with superior wisdom, and someone who cultivates meditation without abiding in consciousness.",
        "source": "T13n0404_002:0619c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此定故，而彼菩薩獲得如是無住禪定猶若虛空。」",
        "translation": "Because of this concentration, that bodhisattva attains such unstaying meditation just like space.\"",
        "source": "T13n0404_002:0619c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「善護諸根修靜慮，　　常定不著於有情；　等引平等度世間，　　於內、於外常安住。",
        "translation": "It was then that the Bhagavān spoke to Jātaka, saying, \"Well-protecting their faculties and cultivating meditation, they are always concentrated and not attached to sentient beings; they are equally guided to transcend the world and are always at ease both internally and externally.",
        "source": "T13n0404_002:0619c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不依於蘊及處、界，　　遠離境界住寂靜；　智者其心常在禪，　　於等、不等皆平等。",
        "translation": "Not depending on the aggregates, fields, or elements, he abides in quiescence detached from the objective realm; the mind of a wise person is always in meditation, and he's equal in both equality and inequality.",
        "source": "T13n0404_002:0619c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　達於法界無高下，　　見心與意皆寂靜；　為令世間成就故，　　示現諸禪及變易。",
        "translation": "Attaining neither higher nor lower in the realm of reality, he sees that both mind and thought are quiescent; in order to bring about worldly success, he shows meditations and transformations.",
        "source": "T13n0404_002:0619c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼無變易及禪定，　　自在心趣亦復然；　現境無色禪定中，　　示現欲界亦如是。",
        "translation": "Their lack of change and their meditation are likewise the same as their own mental destinies, and in their manifest formless meditation, they show the desire realm to be likewise.",
        "source": "T13n0404_002:0619c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆為有情成就故，　　彼復不著於有情；　境界如空、如幻化，　　陽炎、水月、夢及雲。",
        "translation": "Because they all attain sentient beings, they aren't attached to sentient beings; the objective realm is as empty and illusory, and it's sun, heat, water, moon, dreams, and clouds.",
        "source": "T13n0404_002:0619c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已知禪定及世間，　　即轉世心成智慧；　不能覆蔽於心故，　　則得生於自在心。",
        "translation": "Once they know meditation and the world, they transform their worldly mind into wisdom; because they can't be hindered by their mind, they can then give rise to a mind of mastery.",
        "source": "T13n0404_002:0619c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　了達禪定及神通，　　遊歷遍於俱胝剎；　普能供養於諸佛，　　無知惑障悉斷除。",
        "translation": "Having fully comprehended meditation and superknowledge, he travels around the myriad buddhas, making universal offerings to the buddhas, and completely eliminating the hindrances of nescience and delusion.",
        "source": "T13n0404_002:0619c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸根調伏意寂然，　　度奢摩他無分別；　世間及意俱清淨，　　常恒智力寂亦然。",
        "translation": "Their faculties are disciplined, their minds are quiescent, and they attain calmness without discrimination; both the world and their minds are purified, and their power of constancy and permanence is quiescent.",
        "source": "T13n0404_002:0619c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以無所得住平等，　　故名平等遍無相；　若於平等無所住，　　是故名為得定者。",
        "translation": "Because they abide in equality without attaining it, they're called equal and pervasive without marks; if they abide in equality without anything, they're called someone who has attained concentration.",
        "source": "T13n0404_002:0619c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0620a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩修行般若波羅蜜多猶若虛空？",
        "translation": "How does a bodhisattva cultivate the perfection of wisdom just like space?",
        "source": "T13n0404_002:0620a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩成就四法，修行般若波羅蜜多猶若虛空。",
        "translation": "If a bodhisattva accomplishes four things, his practice of prajñāpāramitā is like space.",
        "source": "T13n0404_002:0620a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0620a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：由虛空清淨故，入一切有情清淨；由智清淨故，入一切識清淨；由法界清淨故，入我、人、有情、壽者清淨；由義清淨故，入一切文字清淨。",
        "translation": "It means that it's because space is purified that entry into all sentient beings is purified, because knowledge is purified that entry into all consciousnesses is purified, because the Dharma realm is purified that entry into self, person, sentient beings, and lifespan is purified, and because meaning is purified that entry into all words is purified.",
        "source": "T13n0404_002:0620a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就四法，修行般若波羅蜜多猶若虛空。",
        "translation": "These are the four things that bodhisattvas accomplish when they cultivate the perfection of wisdom, just like space.",
        "source": "T13n0404_002:0620a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0404_002:0620a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩成就八法，能淨修行般若波羅蜜多。",
        "translation": "If a bodhisattva accomplishes eight things, he'll be able to purify the practice of the perfection of wisdom.",
        "source": "T13n0404_002:0620a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0620a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：勤集一切善法，不著常見；勤斷一切不善法，不著斷見；知緣起法而不違於無生法忍；現四無礙解而不著於四辯；善能決擇四鄔馱南，不見無常、苦、無我、寂靜；善說業果而亦不動；於無業果住無戲論；智常顯說一切法句差別之相；善得一切淨法光明；於諸有情說於清淨及雜染法。",
        "translation": "These are: diligently collecting all good qualities and not clinging to common views; diligently cutting off all unskillful qualities and not clinging to views of cutting off; knowing the law of dependent arising and not being at odds with the tolerance of nonarising; displaying the four unhindered understandings and not clinging to the four abilities; skillfully discerning the four dhānas and not seeing impermanence, suffering, selflessness, or quiescence; skillfully explaining the results of actions and not being agitated; abiding in the absence of the results of actions and not engaging in conceptual proliferation; knowledge that always reveals the distinctive aspects of all phrases of the Dharma; skillfully attaining the light of all pure dharmas; and explaining pure and defiled dharmas to sentient beings.",
        "source": "T13n0404_002:0620a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩成就八法能淨修行般若波羅蜜多。",
        "translation": "These are the eight things a bodhisattva accomplishes to purify and cultivate the perfection of wisdom.",
        "source": "T13n0404_002:0620a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0620a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知般若是清淨句，能摧惡覺故；是無變異句，自相清淨故；是無分別句，無可限齊故；是如實句，性真實故；是諦句，無動搖故；是誠實句，無虛誑故；是聰慧句，解諸縛故；是滿足句，聖者功德故；是通達句，善能觀察故；是第一義句，無所言說故；是平等句，無差別故；是堅牢句，不可壞故；是不動句，無所依故；是金剛句，能穿鑿故；是濟度句，所作已辦故；是清淨句，性無染故；是無暗句，明無所得故；是無二句，無有建立故；是盡句，究竟盡滅故；是無盡句，無為常住故；是無為句，非生、滅所攝故；是空句，最清淨故；是虛空句，無障礙故；是虛空道句，無行迹故；是無所得句，自性無故；是智句，智、識無二故；是無摧句，離對治故；是無身句，無轉易故；是苦遍知句，離遍計苦故；是集斷句，害貪欲故；是證滅句，究竟無生故；是修道句，入無二道故；是佛陀句，能生正覺故；是達摩句，究竟離欲故。",
        "translation": "當知般若是清淨句，能摧惡覺故；是無變異句，自相清淨故；是無分別句，無可限齊故；是如實句，性真實故；是諦句，無動搖故；是誠實句，無虛誑故；是聰慧句，解諸縛故；是滿足句，聖者功德故；是通達句，善能觀察故；是第一義句，無所言說故；是平等句，無差別故；是堅牢句，不可壞故；是不動句，無所依故；是金剛句，能穿鑿故；是濟度句，所作已辦故；是清淨句，性無染故；是無暗句，明無所得故；是無二句，無有建立故；是盡句，究竟盡滅故；是無盡句，無為常住故；是無為句，非生、滅所攝故；是空句，最清淨故；是虛空句，無障礙故；是虛空道句，無行迹故；是無所得句，自性無故；是智句，智、識無二故；是無摧句，離對治故；是無身句，無轉易故；是苦遍知句，離遍計苦故；是集斷句，害貪欲故；是證滅句，究竟無生故；是修道句，入無二道故；是佛陀句，能生正覺故；是達摩句，究竟離欲故。",
        "source": "T13n0404_002:0620a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等類句義差別，智慧光明不屬於他，於所說法隨入少分，都無分別及所分別，是名修行般若波羅蜜多猶若虛空。」",
        "translation": "Such and other kinds of distinctions in word and meaning, the light of wisdom that doesn't belong to others, and which enters into a small part of what's taught, both without discrimination and that which is discriminated, are called the cultivation of the perfection of wisdom just like space.\"",
        "source": "T13n0404_002:0620b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說伽他曰：「明慧能斷煩惱習，　　示現作業及因緣，　不依我見及有情，　　不住壽者并人相，　於我、無我二俱離，　　顯說般若到真源。",
        "translation": "It was then that the Bhagavān spoke jāti, saying, \"Luminous wisdom stops afflictive habits, reveals activities and causes, doesn't rely on view of self or sentient beings, doesn't abide in the marks of a lifespan or a person, and is free of both self and selflessness, so it reveals that prajñā reaches its true source.",
        "source": "T13n0404_002:0620b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　般若能摧於所有，　　般若能度於瀑流，　般若能作清淨因，　　般若能安勝解脫，　淨慧能離諸纏蓋，　　於蘊、處、界悉遍知。",
        "translation": "Prajñā can destroy all that exists, Prajñā can cross the waterfalls, Prajñā can be the cause of purity, Prajñā can bring about resolute liberation, and pure wisdom can free him from the hindrances of bondage and fully know the aggregates, fields, and elements.",
        "source": "T13n0404_002:0620b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　明慧照曜三界空，　　於能、所相皆解脫；　修行般若令清淨，　　一切世間無所著；　通達能行般若行，　　常修淨慧照真空。",
        "translation": "With insight that illuminates the emptiness of the three realms, he's liberated from both the subjective and objective aspects; cultivates prajñā to make it pure, and all the world is free of attachment; penetrating the practice of prajñā, he always cultivates pure wisdom that illuminates the vacuum.",
        "source": "T13n0404_002:0620b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五眼清淨五根明，　　能除五趣淨五蘊；　至於彼岸常安住，　　入於法界亦復然；　平等猶若大虛空，　　高廣善順於佛智。",
        "translation": "With the five eyes purified and the five faculties illuminated, he's able to remove the five destinies and purify the five aggregates; as for the other shore, he always remains stable, and he enters the Dharma realm likewise; his equality is like that of space, and he follows the Buddha's wisdom in great breadth and skillfulness.",
        "source": "T13n0404_002:0620b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於得、無得二俱離，　　能示中道甘露門；　隨順聖人之所行，　　善能分別、無分別。",
        "translation": "Being free of both attainment and non-attainment, he can show the method of the middle way as the ambrosia gate; following the actions of noble people, he's well able to discern and non-discern.",
        "source": "T13n0404_002:0620b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能知苦、集斷貪愛，　　修道、示滅顯無為；　成就實智慧光明，　　故了三世無來、去。",
        "translation": "He can know suffering and accumulation, cut craving, cultivate the path, and manifest cessation to reveal inaction; accomplishing the light of true wisdom, he therefore understands that the three times have neither coming nor going.",
        "source": "T13n0404_002:0620b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於諸剎土皆平等，　　諸法寂靜等亦然；　了諸有情無我、人，　　是則真修智慧者。",
        "translation": "All buddhas and lands are equal, as is the quiescence of all dharmas, and so forth; this is someone who truly cultivates wisdom and understands that all sentient beings lack self and person.",
        "source": "T13n0404_002:0620b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0620b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩修行福德猶若虛空？",
        "translation": "How is the bodhisattva's cultivation of merit like space?",
        "source": "T13n0404_002:0620b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法性猶如虛空，以菩提心而為種子，所修福聚皆不捨離於菩提心；積集善根而皆迴向薩婆若海，由是獲得無量福德皆如虛空。",
        "translation": "The nature of all dharmas is like space, and with the mind of enlightenment as its seed, the merits they cultivate don't part from the mind of enlightenment; they accumulate good roots and all turn toward the ocean of sarvajña, and as a result, they attain measureless merits that are like space.",
        "source": "T13n0404_002:0620b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩應當發如是心，虛空無量故，感招福聚亦復無量。",
        "translation": "Bodhisattvas should give rise to the thought that because space is immeasurable, the merits they bring about will also be immeasurable.",
        "source": "T13n0404_002:0620c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0404_002:0620c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由意無量故福亦無量；菩薩於彼應作是觀。",
        "translation": "\"Because intention is immeasurable, merit is also immeasurable; bodhisattvas should observe it that way.",
        "source": "T13n0404_002:0620c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0620c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十種無量莊嚴，菩薩應滿如是福聚。",
        "translation": "\"There are another 10 kinds of immeasurable adornment that bodhisattvas should fill with such a stock of merit.",
        "source": "T13n0404_002:0620c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T13n0404_002:0620c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：無量身莊嚴，相好圓滿故；無量語莊嚴，隨說法輪皆清淨故；無量心莊嚴，通達一切有情心故；無量行智莊嚴，成熟無量諸有情故；無量行相莊嚴，淨無量佛剎故；無量福德、禪定、精進莊嚴，成滿無量佛威儀故；無量大菩提場莊嚴，應滿一切相及行故；無量無遮施會莊嚴，成滿無量佛毫相故；無量恭敬無我莊嚴，成滿如來無見頂相故；無量無間定心莊嚴，成滿無量無諂曲心順淨意故。",
        "translation": "所謂：無量身莊嚴，相好圓滿故；無量語莊嚴，隨說法輪皆清淨故；無量心莊嚴，通達一切有情心故；無量行智莊嚴，成熟無量諸有情故；無量行相莊嚴，淨無量佛剎故；無量福德、禪定、精進莊嚴，成滿無量佛威儀故；無量大菩提場莊嚴，應滿一切相及行故；無量無遮施會莊嚴，成滿無量佛毫相故；無量恭敬無我莊嚴，成滿如來無見頂相故；無量無間定心莊嚴，成滿無量無諂曲心順淨意故。",
        "source": "T13n0404_002:0620c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620c15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十種無量莊嚴。",
        "translation": "\"These are the ten kinds of immeasurable adornment.",
        "source": "T13n0404_002:0620c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若能如是發廣大心猶如虛空，所獲福德如虛空故。",
        "translation": "If a bodhisattva can thus arouse a mind that's as vast as space, the merit attained is like space.",
        "source": "T13n0404_002:0620c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0620c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩修行智慧猶如虛空？",
        "translation": "How is a bodhisattva's cultivated wisdom like space?",
        "source": "T13n0404_002:0620c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩遍緣一切有情，有欲心、無欲心如實知；有瞋心、無瞋心如實知；有癡心、無癡心如實知；有雜染心、無雜染心如實知；自既離欲，復能為他補特伽羅說調伏欲法；自既離瞋，復能為他補特伽羅說調伏瞋法；自既離癡，復能為他補特伽羅說調伏癡法；自離雜染，復能為他說調伏一切諸煩惱法；不見有貪、瞋、癡煩惱者為下劣心，離貪、瞋、癡煩惱者為勝上心。",
        "translation": "\"If a bodhisattva fully perceives all sentient beings and truly knows whether there's a mind with desire or no desire, a mind with anger or no anger, a mind with delusion or no delusion, and a mind with defilement or no defilement, then he can teach other pudgelas the way to regulate desire even though he's free of desire, teach other pudgelas the way to regulate anger even though he's free of anger, teach other pudgelas the way to regulate delusion even though he's free of delusion, teach other pudgelas the way to regulate all afflictions even though he's free of defilement, and teach other pudgelas the way to regulate all afflictions even though he's free of them; someone who doesn't see the afflictions of greed, anger, and delusion is an inferior mind, and someone who's free of the afflictions of greed, anger, and delusion is a superior mind.",
        "source": "T13n0404_002:0620c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0404_002:0620c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以彼菩薩於不二法界清淨法門以證知故；如是法界即貪、瞋、癡界；如是法界即離染界。",
        "translation": "It's because that bodhisattva perceives the pure dharma-gate of the nondual reality realm; thus, the reality realm is the realm of craving, anger, and delusion; and thus, the reality realm is the realm of freedom from defilement.",
        "source": "T13n0404_002:0620c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故法界與一切法互相涉入，法界即法、法即法界，無所不遍。",
        "translation": "Therefore, the Dharma realm and all dharmas interfere with each other, and there's nothing that isn't pervasive, such that the Dharma realm is the Dharma and the Dharma is the Dharma realm.",
        "source": "T13n0404_002:0620c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知我界即知法界，法界、我界無有二故。",
        "translation": "If someone knows the self-realm, they know the dharma-realm, so there's no difference between the dharma-realm and the self-realm.",
        "source": "T13n0404_002:0621a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0404_002:0621a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我清淨故法界清淨，如是一切法清淨故。",
        "translation": "The Dharma realm is purified because the self is purified, and all such things are purified because they are purified.",
        "source": "T13n0404_002:0621a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光顯容受亦無容受，離於一切相無相故。",
        "translation": "Because the luminosity shows receptivity and the absence of receptivity, it's free of all marks and has no marks.",
        "source": "T13n0404_002:0621a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所安立，猶如虛空，名無礙智。",
        "translation": "Being unmoored and just like space, it's called unobstructed cognition.",
        "source": "T13n0404_002:0621a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無礙智了一切法無所障礙，是為菩薩修行智慧猶如虛空。",
        "translation": "Because unobstructed cognition understands all things without obstruction, this is the wisdom of a bodhisattva's practice that's like space.",
        "source": "T13n0404_002:0621a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩佛所印可佛隨念？",
        "translation": "\"How do bodhisattvas seal the Buddha's mindfulness?",
        "source": "T13n0404_002:0621a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：念無漏戒，是戒佛隨念；一切法平等不散，是定佛隨念；一切法無所分別，是慧佛隨念；不住於二心，是解脫佛隨念；不著一切智，是解脫知見佛隨念；三世平等不動，是力佛隨念；不住一切漏，是無所畏佛隨念；如是當念佛身所有一切功德，皆是佛隨念，法界平等無所分別。",
        "translation": "This is called the mindfulness of the uncontaminated precepts, which is the mindfulness of the Buddha of precepts; the equality of all things that don't disperse, which is the mindfulness of the Buddha of concentration; the absence of discrimination of all things, which is the mindfulness of the Buddha of wisdom; the abiding in two minds, which is the mindfulness of the Buddha of liberation; the absence of attachment to all cognition, which is the mindfulness of the Buddha of liberating knowledge and views; the equality and immovability of the three worlds, which is the mindfulness of the Buddha of strength; the abiding in all contaminants, which is the mindfulness of the Buddha of fearlessness; and the mindfulness of all the merits of the Buddha's body, which is the mindfulness of the Buddha, the equality of the Dharma realm and the absence of discrimination.",
        "source": "T13n0404_002:0621a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，佛隨念，念佛所有色自性清淨，由見色自性清淨故，無念智隨至，乃至受、想、行、識，見識自性清淨故，無念智隨至。",
        "translation": "\"Furthermore, when the Buddha is mindful, the mindfulness of the Buddha's own form is purified, and because he sees that form is purified in its own nature, wisdom without mindfulness follows, up to feeling, perception, volition, and consciousness, and because he sees that consciousness is purified in its own nature, wisdom without mindfulness follows.",
        "source": "T13n0404_002:0621a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十二處、十八界亦復如是。",
        "translation": "Thus, the 12 sense-fields and 18 elements are likewise.",
        "source": "T13n0404_002:0621a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由一切法自性智故，最殊勝慧一切作意，遠離一切見纏。",
        "translation": "Because of knowledge of the self-nature of all things, the most excellent wisdom has all intents and purposes, and it's free of all the tethers of views.",
        "source": "T13n0404_002:0621a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離如是，知色無垢濁，念無垢濁，是謂佛所印可佛隨念。",
        "translation": "Being free of such, knowing that form is unsullied and mindfulness is unsullied is called the Buddha's approving mindfulness of the Buddha.",
        "source": "T13n0404_002:0621a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，佛隨念，謂念於佛行、住、坐、臥一切威儀，不生執著；於佛說法、於佛寂嘿不生執著，亦不執著念與非念。",
        "translation": "\"Furthermore, mindfulness according to the Buddha means mindfulness of all the Buddha's mannerisms as he walks, stands, sits, and lies down without becoming attached, not becoming attached to the Buddha's teaching or to his stillness, and not becoming attached to mindfulness or non-mindfulness.",
        "source": "T13n0404_002:0621a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0404_002:0621a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛無念、無作意、非色、非相、非法、非非法，由一切相緣慮不現行故。",
        "translation": "\"The Buddha's absence of mindfulness and absence of contemplation is neither form nor form, illegitimate nor illegitimate, and it's because all forms of conditioned thought aren't active.",
        "source": "T13n0404_002:0621a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名佛所印可佛隨念。",
        "translation": "This is called the Buddha's seal of approval, and the Buddha follows it.",
        "source": "T13n0404_002:0621a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩佛所印可法隨念？",
        "translation": "\"How are the bodhisattva-buddha-sealable dharmas recollected?",
        "source": "T13n0404_002:0621a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法名離欲，於法無染故，亦無法隨念。",
        "translation": "\"The name of a dharma is freedom from desire, and it's impossible to be mindful of that dharma because it's not defiled.",
        "source": "T13n0404_002:0621a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法名無阿賴耶，於法無隱沒故，亦無法隨念。",
        "translation": "The dharma is called nonhāraṇī, which is impossible to follow because there's no concealment of qualities.",
        "source": "T13n0404_002:0621a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法名寂靜，以無心、意、識染著故，亦無法隨念。",
        "translation": "The dharma is called quiescent, and it's impossible to think of it as such because there's no defiled attachment of mind, thought, or consciousness.",
        "source": "T13n0404_002:0621a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法名無相，於法無隨相識故，亦無法隨念。",
        "translation": "The name of the teaching is signless, and it's impossible to follow its mindfulness because there's no consciousness that follows characteristics of dharmas.",
        "source": "T13n0404_002:0621a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法名無為，於法無施設住故，亦無法隨念。",
        "translation": "The name of the Dharma is nonproductivity, and it's impossible to be mindful of it because there are no constructed abodes in the Dharma.",
        "source": "T13n0404_002:0621a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，法隨念，若念無間斷不起法想，即入正位證無生忍，觀一切法本來不生無法可證，即是一切學、無學、緣覺、菩薩，正等菩提所證之處。",
        "translation": "\"Furthermore, if mindfulness follows mindfulness, and if mindfulness is uninterruptedly stopped without conceptions of things, then he enters the correct stage of realizing the forbearance of nonarising, observing that all things originally don't arise and can't be realized, which is the place where all students, postlearners, pratyekbuddhas, and bodhisattvas realize correct and complete enlightenment.",
        "source": "T13n0404_002:0621b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切聖所證解脫法，亦無自性。",
        "translation": "Thus, all the noble principles of liberation that are realized also lack self-nature.",
        "source": "T13n0404_002:0621b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩佛所印可法隨念。",
        "translation": "This is the Dharma that's approved by the bodhisattvas and buddhas, according to their mindfulness.",
        "source": "T13n0404_002:0621b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩佛所印可僧伽隨念？",
        "translation": "\"How are the bodhisattvas and buddhas endorsed by the saṃgha for recollection?",
        "source": "T13n0404_002:0621b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧名無為，彼不可以造作而作，而無現行身、語、意業，但是施設而有所行。",
        "translation": "\"Monks are called 'doerless,' which doesn't create and act, has no present physical, verbal, or mental activity, but merely makes assumptions and carries out actions.",
        "source": "T13n0404_002:0621b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是無為僧，離施設住、超諸言論。",
        "translation": "This is a nonpropelling monk who abides free of conceptualization and transcends discourse.",
        "source": "T13n0404_002:0621b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為佛所印可僧伽隨念。",
        "translation": "This is what the Buddha has acknowledged as the Saṃgha's recollection.",
        "source": "T13n0404_002:0621b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩佛所印可捨隨念？",
        "translation": "\"How can a bodhisattva's Buddha-seal be abandoned to mindfulness?",
        "source": "T13n0404_002:0621b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂捨於一切所依資具，及捨於法亦無所捨，此名最勝捨。",
        "translation": "To abandon all the necessities that they rely on and abandon qualities that they don't abandon is called the supreme equanimity.",
        "source": "T13n0404_002:0621b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法無取、無捨亦無所求，無有緣慮、非無緣慮，彼無心行亦無施設，亦不住於識，不生於心以無住心故；名為佛所印可捨隨念。",
        "translation": "Regarding all things, there's no taking, no equanimity, and nothing to be sought, no conditioned or unconditioned consideration, no mental function, no stipulation, and no abiding in consciousness; it doesn't arise in the mind because it's an unabiding mind; it's called mindfulness of equanimity that can be sealed by the Buddha.",
        "source": "T13n0404_002:0621b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩捨隨念者，以所修行迴向平等薩婆若智，不見菩提為所隨念。",
        "translation": "Furthermore, a bodhisattva who gives up mindfulness follows the knowledge that the practice he cultivates leads back to equality of samāpāyas and doesn't see enlightenment as a mindfulness that follows.",
        "source": "T13n0404_002:0621b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0404_002:0621b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以薩婆若與彼隨念性無二故。",
        "translation": "It's because the nature of sarvajñas and their mindfulness aren't two.",
        "source": "T13n0404_002:0621b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是法智相應，是名菩薩佛所印可捨隨念。",
        "translation": "Thus, when associated with knowledge of the Dharma, this is called a bodhisattva's Buddha-seal that can be abandoned and followed.",
        "source": "T13n0404_002:0621b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩佛所印可戒隨念？",
        "translation": "\"How are the precepts that are approved by the bodhisattva buddhas mindful of?",
        "source": "T13n0404_002:0621b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒名無為，無漏、無礙，永息功用成就一切禁戒，無識、無相亦不住心作三摩地，最勝所依亦是發生淨慧根本。",
        "translation": "The precepts are called uncontaminated, uncontaminated, unhindered, and permanently calmed by exertion, accomplish all the prohibitions, lack consciousness and form, don't abide in mind, and create samādhi, which is the most excellent basis and the root of pure wisdom.",
        "source": "T13n0404_002:0621b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離於戲論及解脫相，亦無二種分別之相。",
        "translation": "He's free of conceptual elaborations and the mark of liberation, and he has no discriminating marks of either kind.",
        "source": "T13n0404_002:0621b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者所讚，無有現色，能息煩惱亦無施設，安樂隨行，亦無對治一切分別。",
        "translation": "They are praised by wise ones as having no visible form, calming afflictions and making no assumptions, following them with comfort, and not countering all discriminations.",
        "source": "T13n0404_002:0621b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩常於如是類戒無有垢濁，是名菩薩佛所印可戒隨念。",
        "translation": "A bodhisattva's constant unsullied adherence to these kinds of precepts is called a bodhisattva's Buddha-approved mindfulness of precepts.",
        "source": "T13n0404_002:0621b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩佛所印可天隨念？",
        "translation": "\"How are the bodhisattvas and buddhas endorsed by the gods for recollection?",
        "source": "T13n0404_002:0621b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應隨念二種天：一者、五淨居天，有聖者故；二者、覩史多天，以一生補處菩薩在彼天故。",
        "translation": "Two kinds of heavens should be remembered: the first, the Heaven of the Five Pure Abodes, where there are sages, and the second, the Tushita Heaven, because the bodhisattva in his once-returning lifetime is staying in that heaven.",
        "source": "T13n0404_002:0621b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，此一生補處菩薩住彼天宮，有十種頂法。",
        "translation": "\"Furthermore, there are ten ways the bodhisattva in this once-returner lives in that heavenly palace.",
        "source": "T13n0404_002:0621c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are the ten?",
        "source": "T13n0404_002:0621c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：一切波羅蜜中，般若波羅蜜多而為其頂；一切神通之中，不退神通而為其頂；一切地中，唯灌頂地而為其頂；一切菩提分法之中，不退正見勝三摩地而為其頂；一切無礙解中，義辯無礙而為其頂；一切智中，無著、無礙智而為其頂；一切根中，知上、中、下根無礙智而為其頂；一切力無畏中，照耀隨入智而為其頂；一切眼中，佛眼觀察一切佛法，了如掌內而為其頂；坐菩提場中當成正覺，一剎那心相應正慧而為其頂。",
        "translation": "所謂：一切波羅蜜中，般若波羅蜜多而為其頂；一切神通之中，不退神通而為其頂；一切地中，唯灌頂地而為其頂；一切菩提分法之中，不退正見勝三摩地而為其頂；一切無礙解中，義辯無礙而為其頂；一切智中，無著、無礙智而為其頂；一切根中，知上、中、下根無礙智而為其頂；一切力無畏中，照耀隨入智而為其頂；一切眼中，佛眼觀察一切佛法，了如掌內而為其頂；坐菩提場中當成正覺，一剎那心相應正慧而為其頂。",
        "source": "T13n0404_002:0621c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十種頂法之相，應隨念之。",
        "translation": "These are the ten kinds of characteristics of the crowning dharma, which should be recollected accordingly.",
        "source": "T13n0404_002:0621c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩得是念已，見則不亂隨眠纏，不亂作意戲論，不亂於如是類。",
        "translation": "If a bodhisattva attains this mindfulness, then his views won't be confused by the tethers of latency, aren't confused by mental conceptualization, and aren't confused by such-and-such.",
        "source": "T13n0404_002:0621c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念無垢濁，應當如是隨念彼天。",
        "translation": "Being mindful of the unsullied, they should thus follow that heavenly being with mindfulness.",
        "source": "T13n0404_002:0621c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩佛所印可天隨念。",
        "translation": "\"This is called the bodhisattva Buddha's seal of approval for the gods to follow.",
        "source": "T13n0404_002:0621c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩所行諸行等於涅槃？",
        "translation": "How are the practices undertaken by bodhisattvas equivalent to nirvāṇa?",
        "source": "T13n0404_002:0621c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃名寂靜，悉除一切煩惱，滅一切受，離一切所緣，出蘊、處、界，即彼正士獲得涅槃平等。",
        "translation": "Nirvāṇa is called tranquility, which fully removes all afflictions, ceases all sensations, parts with all objects, and escapes the aggregates, fields, and elements, meaning that the correct person attains equality in nirvāṇa.",
        "source": "T13n0404_002:0621c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以本願力遊戲大悲，方便智慧得如來加持故，善修智慧意樂清淨，住於如幻妙三摩地，悉知有情煩惱生死皆如幻化，示現受生，由此能斷諸生死縛，無所染污，名曰涅槃。",
        "translation": "Because of the power of the former vow, play of great compassion, and skillful wisdom that obtains the Tathāgata's blessing, he well cultivates the purification of intentions and aspirations through wisdom, abides in the marvelous samādhi of illusion, knows that the afflictions of sentient beings in birth and death are illusory and manifestly takes birth, and is thus able to sever the bonds of birth and death and become undefiled, which is called nirvāṇa.",
        "source": "T13n0404_002:0621c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得自在，不生而生，無所不生亦無所生，常在涅槃不斷生死，而成熟有情無有休息。",
        "translation": "Once they attain freedom, they are born without being born, nothing is unborn, and nothing is born, and they remain in nirvāṇa without stopping birth-and-death while maturing sentient beings without rest.",
        "source": "T13n0404_002:0621c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此名菩薩大悲方便雙智慧門。",
        "translation": "\"This is called the bodhisattva's approach of great compassion, skillful means, and dual wisdom.",
        "source": "T13n0404_002:0621c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住此門者，獲得涅槃平等行菩薩行。",
        "translation": "If a bodhisattva abides in this gate, he'll attain nirvāṇa and equally carry out bodhisattva practices.",
        "source": "T13n0404_002:0621c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0404_002:0621c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩，善知一切有情行相？",
        "translation": "How do bodhisattvas well know the defining activities of all sentient beings?",
        "source": "T13n0404_002:0621c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩有八萬四千行，是於根本鄔馱南句。",
        "translation": "\"The bodhisattva has 84,000 practices, which are the fundamental dhāraṇī phrases.",
        "source": "T13n0404_002:0621c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情行相，無量差別、不可思議、不可言說，唯佛能知，非諸聲聞、緣覺所了，亦非菩薩之所能了。",
        "translation": "The conduct of sentient beings is measurelessly different, unfathomable, and inexpressible, and only the Buddha can know it; it's not comprehended by śrāvakas or pratyekbuddhas, nor can it be comprehended by a bodhisattva.",
        "source": "T13n0404_002:0621c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩蒙佛加持及自智力，隨知一切有情行相。",
        "translation": "Thanks to the Buddha's blessing and his own wisdom, that bodhisattva can know the defining characteristics of all sentient beings at will.",
        "source": "T13n0404_002:0622a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：如是自性相，如是行相，如是因相，如是緣相，如是作相，如是和合相，或種種相離相、欲相，瞋相、癡相、等分相，地獄相、傍生相、琰魔界相、天相、人相，或聲聞尼夜摩相、或緣覺尼夜摩相、或佛尼夜摩相，或遠因相、中因相、近因相，如是有情一切行相如實知之，除一切智不被摧伏。",
        "translation": "These are: such are the characteristics of their own nature, such are the characteristics of their actions, such are the characteristics of their causes, such are the characteristics of their conditions, such are the characteristics of their actions, such are the characteristics of their combination, such are the characteristics of various forms, such are the characteristics of separation from desire, the characteristics of anger, delusion, and equipoise, the characteristics of hell, the characteristics of unenlightened beings, the characteristics of the demon realm, the characteristics of gods, and the characteristics of humans, the characteristics of śrāvakas' niyāma, the characteristics of pratyekabuddhas' niyāma, the characteristics of distant causes, middle causes, and proximate causes, and so on, and they truly know all the ways in which sentient beings behave, except that all cognition is not overpowered.",
        "source": "T13n0404_002:0622a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0622a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩善知一切有情行相。",
        "translation": "\"This is a bodhisattva who well knows the defining characteristics of the actions of all sentient beings.",
        "source": "T13n0404_002:0622a10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大集虛空藏菩薩所問經卷第二",
        "translation": "Daji xukongzang pusa suowen jing roll 2",
        "source": "T13n0404_002:0622a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "丙午歲高麗國大藏都監奉　勅雕造",
        "translation": "Carved by Imaizhao, the director of the Grand Tripiṭaka of Goryeo during the year propo",
        "source": "T13n0404_002:0622a12_0",
        "is_bad_quality": false
    }
]