[
    {
        "source_sentence": "寶女所問經卷第一",
        "translation": "Jewel Girl's Questions Sutra, Vol. 1",
        "source": "T13n0399_001:0452a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月支三藏竺法護譯",
        "translation": "Translated by Dharmarakṣa of the Yuezhi Tripiṭaka of the Western Jìn Dynasty",
        "source": "T13n0399_001:0452a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問慧品第一",
        "translation": "Most Eminent in the Chapter of Questions and Wisdom",
        "source": "T13n0399_001:0452a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛遊於如來寶淨高座，則為如來之所建立，積無極德已為莊嚴，所遊道場佛慧報應，蠲除所行升菩薩宮，講無量頌如來所歎，顯立威變聖導無礙，普有所入志存微妙，誘進權行等過去慧。",
        "translation": "Thus I heard: \"One time, the Buddha traveled to the Tathāgata's high, jeweled, and pure seat, then he was established by the Tathāgata, accumulated measureless virtues, adorned himself, responded to the Buddha's wisdom in the place of refuge, ascended to the bodhisattva's palace, spoke measureless verses praised by the Tathāgata, established authoritative transformations, guided sages without obstruction, universally entered, had subtle aspirations, and induced past wisdom such as expedient practice.",
        "source": "T13n0399_001:0452a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於當來劫，弘大究竟其德無量，順平等覺善轉法輪，無限之首諦分別慧，於一切法而得自在，悉覩眾生心之諸根，度于彼岸曉了方便，斷除諸著邪業之行，為造佛事，莫不篤信化令寂定。",
        "translation": "In a future eon, he'll propagate the ultimate in his measureless virtues, skillfully turn the wheel of the Dharma in accord with the awakening of equality, discern the infinite first truth, attain mastery over all dharmas, fully perceive the mental faculties of sentient beings, cross over to the other shore with insight and skillful means, eliminate the practice of wrong actions that attach to them, and create a Buddhahood in which no one is devoutly convinced and which leads to tranquility and concentration.",
        "source": "T13n0399_001:0452a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與大比丘俱六百萬，其心調和，消除罣礙塵勞之欲，乃為如來法王之子。",
        "translation": "He is the son of the Tathāgata, the Dharma king, along with 6 million great monks whose minds are harmonized and whose hindrances and worldly desires are removed.",
        "source": "T13n0399_001:0452b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修深妙法興發道化，無有顛倒威儀顯曜，成就聖路為大眾祐，如來安詳獲善究竟。",
        "translation": "He cultivates the profound and marvelous Dharma, arouses the development of the Way, demonstrates his lack of mistaken dignity, accomplishes the noble path, and protects the great people, and attains the good end of the Tathāgata's serenity.",
        "source": "T13n0399_001:0452b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復與菩薩大聖眾俱，無量無限不可思惟，浩浩大會行無所拘，諸菩薩等斯須之間，尋能超越無量佛國，便設權宜供養奉事，十方如來有所諮啟，聽受經典不以厭倦。",
        "translation": "Again, he's accompanied by a great multitude of bodhisattvas and sages, an unfathomably vast multitude, a vast assembly of practitioners, and bodhisattvas who, between now and then, search for a way to transcend measureless buddha lands, then establish appropriate offerings and serve them, and the tathāgatas in the ten directions are consulted and receive the sūtras without wearying.",
        "source": "T13n0399_001:0452b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而常精勤勸化眾生，智慧善權以用超殊，至于彼岸得度無極，而以建立無礙脫門，便得超越一切眾想望報羅網，近一切智諸通之慧。",
        "translation": "Always exerting themselves to encourage sentient beings, they use their wisdom and good authority to transcend the extraordinary, reach the other shore, and establish the gate of unobstructed liberation so that they can transcend all conceptual expectations, hope for the rewards of the net, and approach the wisdom of omniscience and all penetrations.",
        "source": "T13n0399_001:0452b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰：明天菩薩、選遊步菩薩、擇戰鬪菩薩、照明藏菩薩、蠲慢意菩薩、踊步菩薩、眼觀菩薩、雷音菩薩、離冥菩薩，如是等類諸菩薩眾，不可限量無邊無際不可引喻。",
        "translation": "They are called the Tomorrow Bodhisattva, the Selective Procession Bodhisattva, the Fight Bodhisattva, the Illumination Store Bodhisattva, the Alleviation of Conceit Bodhisattva, the Ardent Procession Bodhisattva, the Eyesight Contemplation Bodhisattva, the Thundering Sound Bodhisattva, and the Free from Mystery Bodhisattva, and such a multitude of bodhisattvas that are limitless, limitless, and ineffable.",
        "source": "T13n0399_001:0452b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊歎詠菩薩所生道場，其法名曰無陰蓋辭。",
        "translation": "At the time, the Bhagavān praised the bodhisattva's birthplace, which is called the expression 'without aggregates or obscurations.'",
        "source": "T13n0399_001:0452b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩徑路清淨，諸佛之法力無所畏，具足究竟聖慧之事，於諸法典而得自由總持之門，所入法印敢可遭遇決眾法門，聖通無極超入於慧，不退轉輪說不迴還，諸乘平等所導無二。",
        "translation": "\"All bodhisattvas have a pure path, the power of the buddhas' teachings is fearless, they're fully endowed with the works of noble wisdom, they attain a free and comprehensive approach to the codes of discipline, they dare to encounter the Dharma-seal they enter, they resolve the many dharma-gates, their noble abilities are limitless, they transcend insight, they don't turn back the wheel of explanation, and they're guided by the equality of the vehicles without distinction.",
        "source": "T13n0399_001:0452b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊無所壞一品法界，而分別說眾生心根。",
        "translation": "He travels around without destroying a single class of the Dharma realm and discerns and explains the mental faculties of sentient beings.",
        "source": "T13n0399_001:0452b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所入之慧獨步堅強決了諸法，滅除一切諸魔之場，已度眾患隨應順法，律化眾塵諸邪之見，入無限慧方便勸助，行無邊際諮嗟權慧，十方諸佛所共宣暢，達無希望行無罣礙無處之門，分流興隆一切諸法，決了如應而等普入，有想無想體解聖達，遊于深妙緣起之事，顯明道業無極德慧，佛身口意而以莊嚴。",
        "translation": "The wisdom that's entered is alone, resolute, and resolute in understanding all dharmas, extinguishing all the battlefields of Māra, having liberated sentient beings from suffering and following compliant dharmas, disciplining the dust of all mistaken views, entering unlimited wisdom, skillfully assisting, practicing limitlessly, consulting and contemplating expedient wisdom, shared by the buddhas of the ten directions, realizing the wishless path, the unobstructed and unhindered gate, diverting and producing all dharmas, resolutely and universally entering as they should be, comprehending the essence of perception and non-perception, comprehending the noble reach, swimming in the profound and wondrous matter of dependent arising, revealing the infinite virtue and wisdom of the path, and adorned by the Buddha's body, speech, and mind.",
        "source": "T13n0399_001:0452b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此三事，心行所歸智慧無盡，越諸聖諦壞聲聞乘，身心澹泊開演明哲，教化緣覺致諸通慧，導利大乘入于道品，於一切法而得信忍，宣揚如來所因興德，講說分別誦讀宣現，智慧教授開示流布靡不周遍。",
        "translation": "In these three ways, his wisdom is inexhaustible as he traverses the noble truths and destroys the vehicle of the śrāvakas, becomes calm in body and mind, discloses his wisdom, teaches the pratyekabuddhas to bring about penetrating insights, guides the great vehicle into the factors of the path, attains faith and patience in all things, proclaims the virtues produced by the Tathāgata's causes, discerns them in lectures, recites and proclaims them, and disseminates them without fail as teachings of wisdom.",
        "source": "T13n0399_001:0452c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊講說於斯善慧法典，宣弘普誦。",
        "translation": "At the time, the Bhagavān taught this code of good wisdom, proclaiming and reciting it universally.",
        "source": "T13n0399_001:0452c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，眾會中有一女人，名曰寶女，即從坐起，右手執持妙珠瓔珞，白世尊曰：「唯然，大聖！",
        "translation": "Then, a woman named Jewel Woman rose from her seat in the assembly, held a marvelous bead and necklace in her right hand, and said to the Bhagavān, \"Yes, great sage!",
        "source": "T13n0399_001:0452c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我所言至誠不虛，設此眾會佛所說法、大士所講，吾能具足持斯經典，普於十方流布弘廣勸無量人，於此法寶建立無上正真之道。",
        "translation": "As I have said, it's perfectly sincere and not false that if this were a congregation where the Buddha teaches and the great man preaches, I could fully uphold this sūtra, disseminate it throughout the ten directions, and broadly encourage measureless people to establish the unsurpassed true path with this Dharma treasure.",
        "source": "T13n0399_001:0452c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所誓不改易者，如來威神使斯貫珠顯示聖旨。」",
        "translation": "Thus vowing not to change it, the Tathāgata's authoritative power and spirit cause this to penetrate the pearl and reveal the holy will.\"",
        "source": "T13n0399_001:0452c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊因眾現變，令諸菩薩皆於其上，化成棚閣珠交露帳：「斯諸正士！",
        "translation": "The Bhagavān then caused the bodhisattvas to transform themselves into a pavilion with a jewel-strewn curtain on top of them, saying, \"Such are the upright gentlemen!",
        "source": "T13n0399_001:0452c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後來世成正覺時，如其佛土微妙嚴淨，佛道場樹當使於今現此瑞應，眾寶棚閣珠交露帳，令斯會者覩其嚴淨悉皆悅豫。」",
        "translation": "When he then becomes perfectly enlightened in the next life, as in the case of the Buddha's land of marvelous splendor and purity, the Buddha's methodological tree will cause this auspicious promise to appear now, with its many jeweled palaces and dew receivers, so that those who meet here will see its splendor and purity and will all rejoice.\"",
        "source": "T13n0399_001:0452c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時寶女前詣佛所則散珠瓔，散珠瓔已，佛之威神寶女之德誓願至誠，在於佛上及諸菩薩上虛空中，化成棚閣，珠交露帳，壁方弘廣。",
        "translation": "When the precious maiden went to the Buddha, she scattered beads and diadems, and after she scattered them, the Buddha's authoritative power and the precious maiden's virtue and sincerity of vows transformed them into a pavilion in the sky above the Buddha and the bodhisattvas, interspersed with beads and dew receivers, with a vast expanse of wall.",
        "source": "T13n0399_001:0452c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若干種變奇特殊妙，周匝平等莊嚴校飾，分布安處正無傾斜。",
        "translation": "It was marvelous in its many forms, equally adorned and decorated, and correctly placed without tilting.",
        "source": "T13n0399_001:0452c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸菩薩各心念言：「如我等身，本往古時志所誓願，當令吾等佛土嚴淨，道場覺樹亦復如是！」",
        "translation": "The bodhisattvas then each thought to themselves, \"Just like us, we vowed in the distant past to make our Buddha-lands beautiful and pure, and so will the enlightenment tree at the site of enlightenment!\"",
        "source": "T13n0399_001:0452c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯諸菩薩如心所念，各各自見交露棚閣。",
        "translation": "Thus, the bodhisattvas, as they had thought in their minds, each saw the interlaced canopy.",
        "source": "T13n0399_001:0452c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "適覩此已怪未曾有，前白佛言：「甚為難及，天中之天！",
        "translation": "Having seen this, they wondered what had never happened before and said to the Buddha, \"That's quite difficult to attain, a god of gods!",
        "source": "T13n0399_001:0452c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其寶女者所建立力，能為我等顯現瑞應。",
        "translation": "That precious woman has built up a force that's capable of manifesting portents for us.",
        "source": "T13n0399_001:0453a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無央數劫所發志願，今此寶女！",
        "translation": "I've vowed for countless eons that this precious woman would be the one to do it!",
        "source": "T13n0399_001:0453a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心念頃悉令現矣！」",
        "translation": "In an instant of single-minded recollection, they will all appear!\"",
        "source": "T13n0399_001:0453a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「如是，正士！",
        "translation": "The Bhagavān told them, \"So it is, upright man!",
        "source": "T13n0399_001:0453a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言。",
        "translation": "Just as you said.",
        "source": "T13n0399_001:0453a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶女發意如志所建，行道以來，於六十二百千億姟諸佛之所殖眾德本，乃致若茲至誠所建真實誓願。",
        "translation": "寶女發意如志所建，行道以來，於六十二百千億姟諸佛之所殖眾德本，乃致若茲至誠所建真實誓願。",
        "source": "T13n0399_001:0453a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之故，今斯寶女如其所誓，被德之鎧，尋使成立諸正士等。",
        "translation": "Because of this, the precious woman now takes the armor of virtue as she has vowed and seeks to establish righteous men and women.",
        "source": "T13n0399_001:0453a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又寶女者，設欲志願，於斯三千大千世界普雨天華悉令周滿。",
        "translation": "\"Suppose she wants to vow that these 3,000 great one-thousand worlds will be filled with the full rain of celestial flowers.",
        "source": "T13n0399_001:0453a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則如所言，輒雨名香、擣香、澤香、雜香、衣服、膳饌。",
        "translation": "Then, just as she says, she'll rain down name-dropping incense, pounded incense, mixed incense, clothing, and food.",
        "source": "T13n0399_001:0453a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設復欲令幢蓋繒幡，自然莊飾周遍虛空，尋如意成。",
        "translation": "Suppose you also want to cause banners, canopies, and silken banners to naturally adorn and surround space, just as you wish.",
        "source": "T13n0399_001:0453a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復欲令天地水災自然興者、若復火災，則如所言便有水災、自然火災；設復欲令水災火災蠲除還復，如其所言悉能致之。",
        "translation": "If he also wants to cause the natural production of floods in heaven and earth or fire disasters, then there will be floods and natural fire disasters just as described; and if he wants to cause the floods and fire disasters to subside and return, he'll be able to cause them all to do so just as described.",
        "source": "T13n0399_001:0453a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設欲令此一切眾會，悉自然變形體被服如轉輪王，尋悉能成。",
        "translation": "If he wanted to cause all these assemblies to naturally change their bodies and be clothed like wheel-turning kings, he could find out how it would happen.",
        "source": "T13n0399_001:0453a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為四天王形體被服，天帝形像、梵天顏貌、大神妙姿容之像，比丘、比丘尼、清信士、清信女色像顏貌，則如所言悉能成之。",
        "translation": "Dressing the four heavenly kings in their bodies, images of the gods, the faces of the Brahmā gods, images of great spiritual beauty, and the appearance of monks, nuns, religious men, and religious women, then they'll all be able to accomplish it just as they say.",
        "source": "T13n0399_001:0453a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使欲令變怪現化億百千魔，一一魔者手各執持百種刀杖，令此眾魔堅住不動不設刀杖，悉使化成若干品種諸珠瓔珞、須縵眾華、思夷之華，皆輒如言。",
        "translation": "When he wants to cause billions of Māra to conjure up strange manifestations, he causes each of them to hold a hundred kinds of swords and staves in his hand, so that these Māras will stand firm and still without setting up swords and staves, and they all transform into various kinds of beads and jewelry, as well as numerous flowers and flowers of zealots and saints, all as described.",
        "source": "T13n0399_001:0453a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復欲令玄絕曠野，自然變有飲食衣被，為大城郭，十八億家遊居其中，如其所言皆能致之。",
        "translation": "If he wants to cause a mysterious wilderness to naturally transform into food, clothing, and clothing for a large city, and 1.8 billion families to wander around in it, he can cause them to do so just as he says.",
        "source": "T13n0399_001:0453a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千世界所有形像，欲令顏貌皆成如來，尋輒如志。",
        "translation": "He wants to make all the forms and images of the 3,000 worlds look like the Tathāgata, and he can easily find out what he wants to do.",
        "source": "T13n0399_001:0453a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復欲令一切眾會處在虛空，悉當如言。",
        "translation": "If they also want to cause all congregations to stand in space, they'll all do as they say.",
        "source": "T13n0399_001:0453a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸族姓子！",
        "translation": "\"Children of the clans!",
        "source": "T13n0399_001:0453a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯寶女身，欲令無量無限無有邊際佛之境界，諸佛世尊所說經典，於虛空中皆為通達，具足眾備普聞音聲，如佛所言無有缺減，十方佛辭亦女所說但能宣暢。」",
        "translation": "This precious woman's body is intended to cause measureless, infinite, and limitless buddha-realms, and the scriptures taught by the buddhas are all comprehended in space, fully replete with the sounds heard universally, as the buddhas speak without fail, and the words of the buddhas in the ten directions are also explained by the woman but are able to be proclaimed.\"",
        "source": "T13n0399_001:0453a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是寶女立願之力神足變化，普示現之如此色像，則於佛前說是頌曰：「以寶為業，　　執妙聖珍；　　演說豪尊，　無量道德。",
        "translation": "Then, with the power of her vow, the jeweled woman's miraculous abilities transformed, and she universally showed this form and image, saying this verse before the Buddha, \"With jewels as myriad possessions, I hold onto marvelous and noble treasures, and I explain the great sage's measureless ethics.",
        "source": "T13n0399_001:0453b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　則以蠲除，　　塵欲瞋結；　乃布惠施，　　七覺之寶。",
        "translation": "Then, he removes the bond of anger toward worldly desires and bestows the seven treasures of awakening.",
        "source": "T13n0399_001:0453b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以寶光明，　照眾窈冥；　　若干品類，　　明月珠曜。",
        "translation": "By the light of these treasures, they illuminate the darkness of many, and there are various kinds of bright moons and brilliant pearls.",
        "source": "T13n0399_001:0453b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尊上琦珍，　　寶英最勝；　　今以璝珠，　恭奉安住。",
        "translation": "Among the most precious treasures, the precious jewels are the most excellent; now, with this precious jewel, I'll respectfully present it to you.",
        "source": "T13n0399_001:0453b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　假使瑪瑙、　　首藏明珠、　焰光之珠、　　無垢藏珠、　　日月之明，　所出光暉；　　蒙尊所照，　　而悉覆蔽。",
        "translation": "Suppose there were an agate, a śramaṇa, a flaming pearl, a pearl of the stainless collection, or a bright light of the sun and moon that emits a radiance that's shone by the venerable and completely obscured.",
        "source": "T13n0399_001:0453b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀能仁身，　　無能限量；　　所荷之祐，　致獲十力。",
        "translation": "There's no limit to the number of people who can observe the benevolent body, and the blessings they receive cause them to attain ten powers.",
        "source": "T13n0399_001:0453b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　住立斯土，　　極至上界；　觀察聖體，　　轉顯加倍。",
        "translation": "He stands in this land, the very highest realm, and observes the holy body, which is doubly manifested.",
        "source": "T13n0399_001:0453b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切眾會，　各各見佛，　　悉自念言：　　尊在我前。",
        "translation": "All the assembled people see the Buddha and each thinks to himself, \"Your Holiness is here in front of me!",
        "source": "T13n0399_001:0453b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆從方面，　　悉見佛顏，　　紫金縱容，　無比之貌。",
        "translation": "From their perspective, they all see the Buddha's face, purple-gold in profile, and incomparable appearance.",
        "source": "T13n0399_001:0453b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　正使坐時、　　臥寐經行；　若復現在，　　處眾會中。",
        "translation": "When he's sitting, he sleeps and sifts, but now he's in the midst of this congregation.",
        "source": "T13n0399_001:0453b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　言辭若嘿，　樂立禪定；　　威儀無比，　　聖智無限。",
        "translation": "With words like hey, he's happy to establish meditation, his manner is peerless, and his noble wisdom is limitless.",
        "source": "T13n0399_001:0453b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一一毛孔，　　所演光暉；　　則能普照，　一切十方。",
        "translation": "From pore to pore, the light that radiates from that pore can universally illuminate all the ten directions.",
        "source": "T13n0399_001:0453b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　身如蓮華，　　最勝弘滿；　猶如志性，　　令意寂然。",
        "translation": "His body is like a lotus, most excellent and vast, like the nature of intention, which causes his mind to be tranquil.",
        "source": "T13n0399_001:0453b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　常立誠諦，　所云真實；　　如口所言，　　尊行相應。",
        "translation": "Always establishing the truth, what's said is true, and as it's spoken, it's associated with honored behavior.",
        "source": "T13n0399_001:0453b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　曉了分別，　　諸法之誼；　　稽首道備，　得度彼岸。」",
        "translation": "He understands and discerns the meaning of all dharmas, and he presents himself at the preparation of the path to reach the other shore.\"",
        "source": "T13n0399_001:0453b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，寶女以此頌偈讚佛德已，白世尊曰：「我身今欲咨問如來，於斯經典章品之句志所趣向；設見聽者乃當自陳。」",
        "translation": "After praising the Buddha's virtue in this verse, the precious woman said to the Bhagavān, \"Now, I myself would like to ask the Tathāgata about what I want to achieve from this sūtra, chapter, class, and phrase; if I see and hear it, I will explain it myself.\"",
        "source": "T13n0399_001:0453b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告女曰：「恣所欲問，吾當為汝分別說之令心悅豫。」",
        "translation": "The Buddha told the woman, \"Feel free to ask as many questions as you like, and I will discern them for you so that your mind will be pleased.\"",
        "source": "T13n0399_001:0453b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，寶女見佛聽之，歡喜踊躍白世尊曰：「何謂菩薩常懷至誠？",
        "translation": "Seeing the Buddha listening, the precious woman rejoiced and leaped for joy as she said to the Bhagavān, \"What's the meaning of a bodhisattva always harboring utmost sincerity?",
        "source": "T13n0399_001:0453b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來為諸菩薩說真實辭？",
        "translation": "\"How does the Tathāgata explain the true words for the bodhisattvas?",
        "source": "T13n0399_001:0453c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而應順法？",
        "translation": "What is meant by a bodhisattva who accords with the Dharma?",
        "source": "T13n0399_001:0453c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來為諸菩薩講說經典？",
        "translation": "How does the Tathāgata preach the sutras for the bodhisattvas?",
        "source": "T13n0399_001:0453c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩尋應威儀？",
        "translation": "What is meant by a bodhisattva's manner of discerning response?",
        "source": "T13n0399_001:0453c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來為諸菩薩而說議趣？",
        "translation": "\"How does the Tathāgata explain the aim of discussion for the bodhisattvas?",
        "source": "T13n0399_001:0453c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩奉順律教？",
        "translation": "What does it mean for a bodhisattva to follow the teachings of the Vinaya?",
        "source": "T13n0399_001:0453c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來為諸菩薩講決律事？」",
        "translation": "How does the Tathāgata preach the Vinaya for the bodhisattvas?\"",
        "source": "T13n0399_001:0453c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T13n0399_001:0453c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶女所問欲暢仁賢真要辯才，諦聽諦聽，善思念之！」",
        "translation": "Listen closely, listen well, and consider it well,\" the precious woman asked, wanting to penetrate the true essence of the eloquence of good men and women.",
        "source": "T13n0399_001:0453c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯然、世尊！",
        "translation": "\"Yes, Bhagavān!",
        "source": "T13n0399_001:0453c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T13n0399_001:0453c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時寶女受教而聽。",
        "translation": "The precious maiden then accepted the teaching and listened.",
        "source": "T13n0399_001:0453c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「菩薩有三法常懷至誠。",
        "translation": "The Buddha told the precious maiden, \"There are three things that bodhisattvas always hold with utmost sincerity.",
        "source": "T13n0399_001:0453c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為三？",
        "translation": "What are the three?",
        "source": "T13n0399_001:0453c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未曾欺佛、不自欺身、亦不欺誑一切眾生。",
        "translation": "They haven't deceived the buddhas, haven't deceived themselves, and haven't deceived all sentient beings.",
        "source": "T13n0399_001:0453c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩欺於諸佛，而欺己身及與眾生？",
        "translation": "What does it mean when a bodhisattva deceives the buddhas and deceives himself and sentient beings?",
        "source": "T13n0399_001:0453c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩興發無上正真道意，志慕聲聞、緣覺之地，而誓求願意甘樂之，是為菩薩欺佛、己身及與眾生。",
        "translation": "Suppose a bodhisattva arouses the intention for the unsurpassed true path, aspires to the stage of śrāvakas and pratyekbuddhas, and vows to seek it willingly and happily, this is a bodhisattva who deceives the buddhas, himself, and sentient beings.",
        "source": "T13n0399_001:0453c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何謂菩薩不欺諸佛、己身、眾生？",
        "translation": "\"What does it mean for a bodhisattva not to deceive the buddhas, himself, or sentient beings?",
        "source": "T13n0399_001:0453c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩發大道意，設令勤苦遭眾惱患，為諸眾魔所見嬈試，為諸外道所見逼迫，毀辱誹謗而戲弄之，百種罵詈撾捶危害，虛妄之事而以加己，志性寂然不起怨結不懷怯弱、不成迷誤不恐不畏、不以憂慼不以為恨，續秉一志志性堅強，平等之行不捨道意。",
        "translation": "Suppose a bodhisattva arouses the aspiration for the great way, assumes that he's subject to many hardships and sufferings, is provoked by the views of Māra, is persecuted by the views of non-Buddhists, is ridiculed and slandered, is assaulted with a hundred insults, and has falsehoods inflicted on him, then his resolve is still, he doesn't harbor resentments, doesn't become frightened or fearful when he's not mistaken, doesn't become sad or hateful, maintains a single resolve, and is resolute in his approach to equality and doesn't abandon the aspiration for the way.",
        "source": "T13n0399_001:0453c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但執惠心、珍寶之心，常懷道心，一切世間最尊第一。",
        "translation": "He simply clings to his mind of wisdom and treasure and always harbors the mind of the path, which is the most honored and highest of all the world.",
        "source": "T13n0399_001:0453c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復發心為諸眾生，救護歸命令得超度。",
        "translation": "Again, he arouses the intention to rescue and order all sentient beings to be saved and rescued.",
        "source": "T13n0399_001:0453c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所興之心而無等倫，無以為喻，不退不捨不在餘乘，常立一志樂於佛道，導御法輪，令諸群萌悉得面見。",
        "translation": "There's no parallel to the mind that arises, no metaphor, no retrogression, no abandonment, and no remaining vehicle, and he always establishes one intention to delight in the Buddha Way and guide the Dharma wheel so that all the sentient beings can see it.",
        "source": "T13n0399_001:0453c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現於諸力興顯如是，行步舉動遵脩精進，終不破壞他人言教。",
        "translation": "Now, these powers are produced in such a way that their actions and movements are cultivated and pursued, and they never undermine the words and teachings of others.",
        "source": "T13n0399_001:0453c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩不欺諸佛、不自欺身，亦不侵欺一切眾生。",
        "translation": "This is a bodhisattva who doesn't deceive the buddhas, doesn't deceive himself, and doesn't deceive all sentient beings.",
        "source": "T13n0399_001:0453c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「假使菩薩不欺諸佛、不自欺己、不誑眾生，是為菩薩第一至誠。",
        "translation": "\"Suppose a bodhisattva doesn't deceive the buddhas, doesn't deceive himself, and doesn't deceive sentient beings, this is the bodhisattva's supreme sincerity.",
        "source": "T13n0399_001:0453c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼以四事不欺諸佛：順于堅固、而應威施、所為力強、精進慇懃。",
        "translation": "They don't deceive the buddhas in four ways: by being resolute, by responding with authority, by the strength of their actions, and by their zeal and devotion.",
        "source": "T13n0399_001:0453c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以四事不自欺身：志性仁和、質直其心、無有諛諂、亦無虛訑。",
        "translation": "They also don't deceive themselves in four ways: their intentions are benevolent and gentle, their mind is straightforward, there's no flattery, and they're not false and arrogant.",
        "source": "T13n0399_001:0454a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼以四事不欺眾生：方便應病、慈心愍哀、加以四恩，是為菩薩第一至誠，不捨道心而不違失往古之願。」",
        "translation": "They don't deceive sentient beings in four ways: by responding skillfully to illness, by being compassionate and kind, and by extending the four kinds of kindness, this is the bodhisattva's supreme sincerity, not abandoning the mind of the Way and not failing to fulfill his vows of the past.\"",
        "source": "T13n0399_001:0454a02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告寶女曰：「菩薩至誠，謂口寂然護於言語，所說無缺口辭真諦。",
        "translation": "The Buddha again told the precious maiden, \"A bodhisattva's utmost sincerity is when his mouth is silent, he guards his words, and what he says is true without gaps in speech.",
        "source": "T13n0399_001:0454a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在於獨處若大眾中，言常至誠，不以國故而兩舌也；不以珍寶具足貨業而欺虛言；不以父母親族貪財惜費而兩舌也。」",
        "translation": "When they're alone or in a large group, they are always sincere in what they say, not speaking duplicitously because of their country; not deceivingly speaking falsely because they have an abundance of treasures to offer; and not speaking duplicitously because their parents and relatives are greedy for money and wasteful of expenses.\"",
        "source": "T13n0399_001:0454a06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語寶女：「有三十二事口辭清淨。",
        "translation": "The Buddha said to the precious maiden, \"There are thirty-two things that are said with a pure tongue.",
        "source": "T13n0399_001:0454a09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂三十二？",
        "translation": "What are the thirty-two?",
        "source": "T13n0399_001:0454a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羞慚(一)。",
        "translation": "Shame (1).",
        "source": "T13n0399_001:0454a10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造德(二)。",
        "translation": "He creates virtue(2).",
        "source": "T13n0399_001:0454a10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常懷恥愧(三)。",
        "translation": "He's always ashamed(3).",
        "source": "T13n0399_001:0454a10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等修於善(四)。",
        "translation": "He cultivates goodness equally(4).",
        "source": "T13n0399_001:0454a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為劣惡(五)。",
        "translation": "He doesn't do evil (5).",
        "source": "T13n0399_001:0454a11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不索譏謗(六)。",
        "translation": "He doesn't seek to slander (6).",
        "source": "T13n0399_001:0454a11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為卒暴(七)。",
        "translation": "He doesn't act violently(g).",
        "source": "T13n0399_001:0454a12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教化諸天(八)。",
        "translation": "He teaches the gods(viii).",
        "source": "T13n0399_001:0454a12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不興恐懼(九)。",
        "translation": "They don't become frightened(ix).",
        "source": "T13n0399_001:0454a12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燒諸惡趣(十)。",
        "translation": "He burns up the bad destinies(10) ...",
        "source": "T13n0399_001:0454a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開演善歸(一)。",
        "translation": "He reveals good qualities(1).",
        "source": "T13n0399_001:0454a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢聖所命(二)。",
        "translation": "Good men and sages command them(2).",
        "source": "T13n0399_001:0454a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恭奉明智(三)。",
        "translation": "He respects wisdom(3).",
        "source": "T13n0399_001:0454a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其內清淨(四)。",
        "translation": "He's internally pure(4).",
        "source": "T13n0399_001:0454a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善修於外(五)。",
        "translation": "He cultivates it well externally(5).",
        "source": "T13n0399_001:0454a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而受言教(六)。",
        "translation": "And he receives instruction(6).",
        "source": "T13n0399_001:0454a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別言辭(七)。",
        "translation": "He discerns words (7).",
        "source": "T13n0399_001:0454a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無[革*亢][革*卬]說(八)。",
        "translation": "There's no [g*co][g*ang] to speak (h).",
        "source": "T13n0399_001:0454a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "口演柔軟(九)。",
        "translation": "He speaks softly (ix).",
        "source": "T13n0399_001:0454a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言語殊特(十)。",
        "translation": "Their speech is exceptional(10).",
        "source": "T13n0399_001:0454a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "口暢香潔(一)。",
        "translation": "Their speech is smooth and clean(1).",
        "source": "T13n0399_001:0454a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而隨教命(二)。",
        "translation": "He follows instructions(2).",
        "source": "T13n0399_001:0454a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有欺詐(三)。",
        "translation": "There's no deception(3).",
        "source": "T13n0399_001:0454a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所熱惱(四)。",
        "translation": "Nothing is disturbed(4).",
        "source": "T13n0399_001:0454a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造業可愛(五)。",
        "translation": "He creates desirable actions(5).",
        "source": "T13n0399_001:0454a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內無有失(六)。",
        "translation": "There's no internal mistake(6) ...",
        "source": "T13n0399_001:0454a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外亦無誤(七)。",
        "translation": "There's no error outside(7) ...",
        "source": "T13n0399_001:0454a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為罪業(八)。",
        "translation": "He doesn't do evil actions(8).",
        "source": "T13n0399_001:0454a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造眾祐地(九)。",
        "translation": "He creates a multitude of fortunate stages(ix).",
        "source": "T13n0399_001:0454a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂於佛道(十)。",
        "translation": "He's happy in the Buddha Way (10).",
        "source": "T13n0399_001:0454a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳語至誠(一)。",
        "translation": "He's sincere in his transmission(1).",
        "source": "T13n0399_001:0454a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言輒獲利(二)。",
        "translation": "He readily obtains benefit from his words(2). These are the thirty-two things.",
        "source": "T13n0399_001:0454a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為三十二事也。」",
        "translation": "These are the thirty-two things.\"",
        "source": "T13n0399_001:0454a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「所謂至誠求願具足。",
        "translation": "The Buddha told the precious maiden, \"This is called perfect sincerity in seeking and fulfilling vows.",
        "source": "T13n0399_001:0454a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0399_001:0454a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜布施者為菩薩道，無慳貪故斯成志願，一切所有設能慧施，覩是以後此則至誠。",
        "translation": "\"Suppose someone who enjoys giving is the bodhisattva path, and this is the intention because they don't have stinginess or greed, and they imagine that they're able to give wisely to all that exists, seeing that this is the highest level of sincerity afterward.",
        "source": "T13n0399_001:0454a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨之誡為菩薩道，不為毀禁斯成所願，假使戒禁具足清淨，覩是以後此則至誠。",
        "translation": "The bodhisattva path is pursued by pure precepts, and this is accomplished by vowing not to violate the precepts, assuming the precepts and prohibitions are perfectly pure, and this is done with utmost sincerity after seeing this.",
        "source": "T13n0399_001:0454a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "建立忍力為菩薩道，志不懷結斯成誓願，其忍辱者此為柔和，覩是以後則為至誠。",
        "translation": "Establishing the power of forbearance is the bodhisattva path, and when one's intention is not to harbor fetters, this becomes a vow, and this is how those who endure humiliation become gentle, and seeing it thereafter becomes perfectly sincere.",
        "source": "T13n0399_001:0454a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遵修精進為菩薩道，不為懈廢斯成所願，設能普行一切德本，覩是以後則為至誠。",
        "translation": "He observes diligence as the bodhisattva path, doesn't become lazy, and thus fulfills his vow if he can universally apply all the roots of virtue, and seeing it from here on out is perfectly sincere.",
        "source": "T13n0399_001:0454a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "建立禪定為菩薩道，不為亂心斯成所願，設能懷來習一心者，覩是以後則為至誠。",
        "translation": "Establishing meditation as the bodhisattva path doesn't distract the mind from what it wants, but if he can carry forward the cultivation of a single mind, seeing it thereafter will be the ultimate sincerity.",
        "source": "T13n0399_001:0454a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "建立智慧為菩薩道，不為邪黠斯成所願，曉了聖慧，覩是以後則為至誠。",
        "translation": "Establishing wisdom is the bodhisattva path, which is desired because it's not mistaken or clever, and it's perfectly sincere when you know the noble wisdom and see it coming.",
        "source": "T13n0399_001:0454b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四意止行為菩薩道，不為放逸斯成所願，意以寂定，覩是以後此則至誠。",
        "translation": "The bodhisattva path is built on the cessation of the four mental states, which are desired by those who don't act carelessly and whose minds are calm and concentrated, and which are perfectly sincere after seeing this.",
        "source": "T13n0399_001:0454b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四意之斷為菩薩道，不興眾惡心若滅除斯成所願，覩是以後此則至誠。",
        "translation": "The bodhisattva path is marked by the cessation of the four intentions, which accomplish what they desire if they don't give rise to many bad thoughts and cease them, and this is their utmost sincerity after observing this.",
        "source": "T13n0399_001:0454b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四神足行為菩薩道，無有不達已能飛行斯成所願，覩是以後此則至誠。",
        "translation": "The bodhisattva path is marked by four miraculous abilities, which accomplish what they desire once they've attained nothing, and this is their utmost sincerity when they see it.",
        "source": "T13n0399_001:0454b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五根之事為菩薩道，諸根寂然無有錯亂斯成所願，諸根澹泊，覩是以後此則至誠。",
        "translation": "The five works of the faculties are the bodhisattva path, the faculties are quiescent and without disorder, which accomplishes what they desire, and the faculties are calm, which is the highest level of sincerity after seeing this.",
        "source": "T13n0399_001:0454b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五力之行為菩薩道，不為無勢具足十力斯成所願，覩是以後，斯則至誠。",
        "translation": "The practice of the five powers is the bodhisattva path, and it's the realization of what's desired when the ten powers are not counteracted by force and power, and it's perfectly sincere when you see it from here.",
        "source": "T13n0399_001:0454b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七覺之意為菩薩道，無所不了已能覺達，諸情不起斯成所願，覩是以後此則至誠。",
        "translation": "The seven factors of awakening are the bodhisattva path, which are comprehended without fail, and which are vowed to be accomplished when feelings don't arise, and which are perfectly sincere after seeing this.",
        "source": "T13n0399_001:0454b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八聖道行為菩薩道，無有邪徑設處聖路斯成所願，覩是以後此則至誠。",
        "translation": "The practice of the eight noble paths is the bodhisattva path, and there's no wrong path that sets out for a noble path, which accomplishes what they desire, and this is their utmost sincerity after seeing this.",
        "source": "T13n0399_001:0454b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四恩之行為菩薩道，不為無救攝諸危厄斯成所願，覩是以後此則至誠。",
        "translation": "The practice of the four kinds of kindness is the bodhisattva path, which accomplishes what's desired when there's no unsaved way to bring in danger and trouble, and which is perfectly sincere when you see it from here on out.",
        "source": "T13n0399_001:0454b16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修四梵行為菩薩道，不為天人慈悲喜護，救濟群黎斯成所願，覩是以後此則至誠。",
        "translation": "Cultivating the four pure practices is the bodhisattva path, and it's not for the compassion, joy, and protection of gods and humans that saving the lives of all people becomes what they desire, but after seeing this, this is their utmost sincerity.",
        "source": "T13n0399_001:0454b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "神通之慧、三達之智、正觀寂寞為菩薩道，無諸瑕穢，眾行普具斯成所願，覩是以後此則至誠。",
        "translation": "The bodhisattva path of supernormal wisdom, the wisdom of the three penetrations, and the loneliness of right contemplation is unsullied, and this is what they desire when they see the full complement of practices, which is their utmost sincerity after seeing this.",
        "source": "T13n0399_001:0454b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具足一切諸德法本為菩薩道，不為無度，蠲除一切諸不善法斯成所願，設能宣備仁賢之法，覩是以後此則至誠。」",
        "translation": "The full possession of all virtuous qualities is originally the bodhisattva path, which is not without limit, and the removal of all unskillful qualities accomplishes what's desired if one can proclaim the teachings of the benevolent and the virtuous, and this is their utmost sincerity after seeing this.\"",
        "source": "T13n0399_001:0454b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「菩薩亦當翫習奉行，賢聖之諦：知於苦慧、斷於所習、曉了滅盡、修行聖路。",
        "translation": "The Buddha told the precious maiden, \"Bodhisattvas should also study and practice the noble truths: knowing the wisdom of suffering, stopping what's been cultivated, understanding cessation, and cultivating the noble path.",
        "source": "T13n0399_001:0454b24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所謂知於苦者，分別五陰無所起故。",
        "translation": "They're called knowing suffering because the discrimination of the five aggregates arises from nothing.",
        "source": "T13n0399_001:0454b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷於習者，於五陰愛無所習故，究竟恩情無所習行，其為脫門，無所遊居不懷所施，其無所懷則於過去而無所至；設於過去無所至者，彼則正法無所蠲除；已於諸法無所除者，是為斷習。",
        "translation": "He stops accumulation because there's no accumulation of craving for the five aggregates, no accumulation of the practice of ultimate kindness, which is the gate of liberation, no place to wander, and no thing to be given, and when there's nothing to be given, there's nothing in the past to reach; if there's nothing in the past to reach, then there's nothing to remove from the right dharma; once there's nothing to remove from the dharmas, this is stopping accumulation.",
        "source": "T13n0399_001:0454b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼知滅盡，一切想著所興方便覩究竟盡。",
        "translation": "He knows that cessation is complete, and he sees the ultimate end of all conceptual attachments and the methods that arise from them.",
        "source": "T13n0399_001:0454c02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其滅盡者，為不復懷得於生死，等於所有終始均平，於一切法而無增減，已等觀者，斯為曉了滅盡之慧。",
        "translation": "Their cessation is the insight that understands cessation because they no longer harbor thoughts about birth and death, are equal in both beginning and end, and don't experience any increase or decrease in all things, and have observed them equally.",
        "source": "T13n0399_001:0454c03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼察平等，於八正路則能等療，無所想念而無邪想，求諸塵勞無有吾我，以無吾我便無所受，則無所生、無造業者，悉能善修於一切法，是則名曰為聖路矣！",
        "translation": "When they observe equality, they can equally treat the eightfold path, have no thoughts and no mistaken ideas, seek the world's defilements without self, and because there's no self, there's nothing to be experienced, so nothing is produced, no action is created, and they're all capable of skillfully cultivating all things, which is called the noble path!",
        "source": "T13n0399_001:0454c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使於斯至誠之慧，曉了一切皆暢眾生，亦無有內亦無所證，是為菩薩之至誠也。」",
        "translation": "Suppose this perfectly sincere wisdom makes it clear that all sentient beings are universally accessible, and there's nothing internal and nothing to realize; this is the bodhisattva's supreme sincerity.\"",
        "source": "T13n0399_001:0454c09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是至誠教時，一萬菩薩具足聖慧，逮得法忍。",
        "translation": "When the Buddha taught this supreme sincerity, 10,000 bodhisattvas perfected the noble wisdom and attained the tolerance of the Dharma.",
        "source": "T13n0399_001:0454c11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「何謂菩薩應順於法？",
        "translation": "The Buddha told the precious maiden, \"What does it mean for a bodhisattva to conform to the Dharma?",
        "source": "T13n0399_001:0454c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "御行如法則隨法教思惟於法，法為志性恭敬於法，遵修法行欲慕於法，樂於法樂多存於法，法為妙英法為刀杖，被法之鎧誓法自嚴，修法光明法之錠燎，常志法念以法為意，遊步於法分別經典，方便應法遊步法行，法為臥寐法為威儀，將護法事以法布施，法為財業法無有盡，普弘演法法為嚴辦，常修法身法為言辭，思惟法念而不放逸。",
        "translation": "御行如法則隨法教思惟於法，法為志性恭敬於法，遵修法行欲慕於法，樂於法樂多存於法，法為妙英法為刀杖，被法之鎧誓法自嚴，修法光明法之錠燎，常志法念以法為意，遊步於法分別經典，方便應法遊步法行，法為臥寐法為威儀，將護法事以法布施，法為財業法無有盡，普弘演法法為嚴辦，常修法身法為言辭，思惟法念而不放逸。",
        "source": "T13n0399_001:0454c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是比類，遵修法行具足成就，而順法主不為非法。」",
        "translation": "Such an example is a person who fully accomplishes the practice of following the Dharma and conforms to the Dharma lord and doesn't act unlawfully.\"",
        "source": "T13n0399_001:0454c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼為何謂順法主者？",
        "translation": "\"What does that mean, 'obeying the lord of the Dharma?'",
        "source": "T13n0399_001:0454c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使如斯至誠真諦，被佛法鎧以法為護，恭敬聖眾慇懃聽經，樂於道意積累眾善，不捨至真志性本淨，而無所著不違所應，見諸賢聖習眾善友，常行恭敬隨其示現，離於憍慢多所咨嗟，遊在法會至心聽經，慕求法典不以厭足，講說道義則不懈倦，而於經法無能為師，念報恩慈以有反復，所作成辦。",
        "translation": "Suppose someone of such utmost sincerity and truth is armed with the Buddha's teaching and uses the teaching as protection, pays respect to the noble people and listens intently to the sūtras, enjoys accumulating the many good qualities in the mind of the path, doesn't abandon the ultimate truth of their innate resolve, isn't attached to anything and doesn't act contrary to what should be, sees the good and noble and cultivates many good friends, always conducts themselves with respect and follows their appearances, is free of conceit and much discouragement, wanders around the Dharma assembly and listens intently to the sūtras, doesn't tire of seeking the Dharma code, doesn't tire of teaching the doctrine, and is incapable of being a teacher of the sūtras and teachings, is mindful of repaying kindnesses with reciprocity, and accomplishes what they've done.",
        "source": "T13n0399_001:0454c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "處於閑居而無恐懼，賢聖之教無所犯負，不捨止足順從十善。",
        "translation": "He lives in a quiet place without fear, doesn't transgress the teachings of the good and the noble, and doesn't abandon his feet of calmness to obey the ten good qualities.",
        "source": "T13n0399_001:0455a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咨嗟布施勸助佛道，奉於禁戒，忍辱為力，遵修精進而不怯弱，禪定寂然，遊入智慧。",
        "translation": "He encourages the Buddha's path by making alms in contempt, observes precepts, makes patience his strength, follows diligent cultivation without faltering, and wanders into wisdom with calmness in meditation.",
        "source": "T13n0399_001:0455a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "興隆道化顯揚善權，慈多所護，入於愍哀悅豫行喜，護離二事而順至誠，所可遭遇以善為業，興發神通導利正法，在所遊至以法惠施。",
        "translation": "He prospers the way, manifests good authority, protects kindness, enters into compassion, pities, delights in actions, protects and secludes himself from two things, accords with utmost sincerity, makes goodness his business when he encounters it, arouses supernormal powers that guide the right Dharma, and gives alms with the Dharma wherever he goes.",
        "source": "T13n0399_001:0455a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於四意止不忘失志，四意斷者遵修平等，四神足者現在究竟，諸根明達修治諸力，曉了諸覺超越徑路，入于寂寞觀察所行，真諦之惠聖明解脫，頒宣暉曜順諸聲聞，隨其本地教化緣覺，咨嗟一切大乘之德，則以應誼而理緣起，便於空無無所恐畏，遊于無想則無所著，觀察無願五陰如幻，觀諸四種亦如虛空。",
        "translation": "He doesn't lose heart when he stops the four intentions, cultivates equality when he stops the four intentions, reaches the end of the four spiritual abilities, cultivates the powers of knowledge and understanding of the faculties, transcends the paths of awakening, enters into solitude and observes what he does, confirms the noble and luminous liberation of the true truth, confers radiance and radiance in accordance with the śrāvakas, teaches the solitary realizers according to their locality, contemplates all the great vehicle virtues, makes sense of the principle of dependent arising, is fearless in emptiness, has no attachment when he wanders into nonconception, observes the wishless five aggregates as illusory, and observes the four kinds as space.",
        "source": "T13n0399_001:0455a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸入者本淨悉空，七財之業遵修六念，及樂於六行度無極，而獲五眼第一之議。",
        "translation": "Furthermore, those who enter are originally pure and completely empty, cultivate the six mindfulnesses in accordance with the actions of the seven assets, and delight in the limitlessness of the six practices, and they attain the vision of the supreme five eyes.",
        "source": "T13n0399_001:0455a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常自將護多所超度，善修道業等心一切眾生之類，歌頌一切無量諸佛功德之法。」",
        "translation": "They always guard and protect themselves, transcend many, cultivate good actions and the minds of all sentient beings, and sing the praises of all the Buddha's innumerable merits.\"",
        "source": "T13n0399_001:0455a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言寶女：「順法菩薩不言有我、不計有人，亦不計命亦不念壽，不思斷絕、不覩有常、不見所有。",
        "translation": "The Buddha said to the precious maiden, \"A compliant bodhisattva doesn't say there's a self, doesn't count people, doesn't count life, isn't mindful of life, doesn't think about ending [suffering], doesn't see existence and permanence, and doesn't see possessions.",
        "source": "T13n0399_001:0455a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不離之所覩者，不釋邊際不猗中間、不從朋友亦無諍訟、亦無不和亦無偏黨，不處顛倒不在邪見，越度狐疑蠲除陰蓋諸所罣礙，不違遠法亦不亂法、不誹謗經不輕慢道、不滅究竟一切諸法。",
        "translation": "Furthermore, if they don't see what they're not free from, they don't interpret extremes or interfere with the middle, don't follow friends or have arguments, don't have discord or partiality, don't abide in error or mistaken views, transcend doubt and remove the hindrances of the aggregates, don't contradict distant dharmas or disturb dharmas, don't denigrate sūtras or despise the path, and don't cease to completely understand all dharmas.",
        "source": "T13n0399_001:0455a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "順道菩薩志存諸法具足經典，所言至誠為順法矣！",
        "translation": "A bodhisattva on the path of obedience has aspirations for all things that are fully scriptural, and what he says is perfectly sincere is in accord with the Dharma!",
        "source": "T13n0399_001:0455a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所興舉，於諸異學順法言者，姦難邪行悉以滅矣！",
        "translation": "Nothing is raised, and those who follow the teaching of those who are not students will all cease their adulterous, difficult, and mistaken behavior!",
        "source": "T13n0399_001:0455a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切世而順法言，菩薩順空行無所獲，則無邪想無瞋恚法，順無願教而於三界悉無所行，慇懃專精覩諸瑕穢。",
        "translation": "In all the world, when they conform to the teaching of the Dharma, bodhisattvas who practice according to emptiness obtain nothing, then they have no mistaken conceptions and no anger toward the Dharma, conform to the teaching of wishlessness, perform no actions in all three realms, and concentrate their energies to see the blemishes.",
        "source": "T13n0399_001:0455a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "順法菩薩則無所起亦無所滅，則不受生本性清淨，義在寂寞。」",
        "translation": "When a bodhisattva conforms to the teaching of emptiness, nothing arises and nothing ceases, so he doesn't undergo birth, which is inherently pure and has its meaning in loneliness.\"",
        "source": "T13n0399_001:0455b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「所謂法者則不可獲，無有文字，而無言說亦無辭意，無色無見亦無所趣，無有言誨亦無所教，離心意識無有塵垢，以離瑕疵遠於貪欲，無有窈冥無所積聚，則無吾我而無所受，亦無所取離於所受，無有境界便無差特。",
        "translation": "The Buddha told the precious maiden, \"The so-called dharma is unobtainable, lacking words, lacking expressions and lacking words, lacking form and views and lacking a destination, lacking words and teachings, free of defilement by mind and consciousness, free of blemishes and far from desire, lacking obscurity and lacking accumulation, then there's no self and nothing to be felt, nothing to be grasped and removed from what's felt, and no objective realm that's without distinction.",
        "source": "T13n0399_001:0455b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於十方界而無所著則為澹泊，棄行身退亦不可覩，覺了玄曠亦無想念、亦無思行抑制聖賢，為明智者所蒙開化。",
        "translation": "Being unattached to anything in the ten directions, he's calm, abandons his practice, retreats from his body, and becomes invisible, realizes that he's profound and open, has no thoughts, and suppresses noble and virtuous behavior, and is enlightened by the wise.",
        "source": "T13n0399_001:0455b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦無所遭亦無不遭，休息一切，所可遇者則如真諦，三世為空便無永沒，亦無終亡亦無退還、亦無所生無所成就亦無毀滅，亦無所有亦不不有，亦無所成亦不不成亦無所行，亦無所視亦無不見亦不離視，亦不成相亦無不相則為一相。",
        "translation": "There's nothing encountered, nothing not encountered, resting in all things, and those who can be encountered are like the true truth; the three worlds are empty, so there's no permanence, nothing that ends or dies, nothing that's produced, nothing that's accomplished, and nothing that's destroyed; there's nothing to be had, nothing that doesn't exist, nothing that's accomplished, nothing that's not formed, and nothing that's done; there's nothing to be seen, nothing that's not seen, and nothing that's free from being seen; and nothing that has neither marks nor non-marks is one mark.",
        "source": "T13n0399_001:0455b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復無相亦無所著，離於所著亦無有餘，無著無縛亦無所脫，不是我所亦無所屬，無所遵修亦無諸漏，則無等倫亦無平等，等無所等。",
        "translation": "Again, being without marks and without attachment, free from attachment and without remainder, without attachment or binding and without escape, not possessed by self and without affiliation, without observing cultivation and without contaminants, they are neither equal nor equal, and equal to nothing.",
        "source": "T13n0399_001:0455b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦無至誠亦不虛妄，不樂不苦，亦不精進亦無不勤、亦無所應亦不不應、亦不專精亦無不精、亦無名色亦無所起，不為堅固亦無不固，無所破壞亦無不壞，不為金剛亦不壞相，則為真諦不違至誠。",
        "translation": "Neither is it perfectly sincere nor false, neither pleasant nor painful, neither diligent nor undemanding, neither desirable nor undesirable, neither concentrated nor inexhaustible, neither named nor uncollected, neither firm nor insubstantial, neither broken nor indestructible, neither adamantine nor broken in appearance, and then it's the true truth that's not at odds with ultimate sincerity.",
        "source": "T13n0399_001:0455b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而無別異亦無所遠，亦無有像類無有倫比，無有處所亦無有想、亦無有此亦無有彼亦無差特，亦無有內亦無有外亦無中間、亦無所樂不度彼岸，亦無所見亦無所聞、亦無所念亦無所教、亦無所知亦不無知、亦不有形亦不無形、亦不有作亦不無作，則離一切諸所有形，是謂為法。",
        "translation": "When there's no difference, nothing distant, no likeness, nothing in common, no place, no perception, nothing here, nothing there, and nothing special, nothing internal, nothing external, and nothing in between, nothing that's pleasant and doesn't reach the other shore, nothing to see, nothing to hear, nothing to think about, nothing to teach, nothing to know, and nothing to be known, nothing with form and nothing without form, nothing made and nothing made, then they are free of all forms, which are called dharmas.",
        "source": "T13n0399_001:0455b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是法者，則無音聲亦無不聲亦無合會，無言無說，是謂菩薩應順於法也。」",
        "translation": "Thus, when it's the Dharma, there's no sound, nothing that isn't sound, nothing that comes together, and nothing that's spoken and nothing that's explained, this is called the Dharma that bodhisattvas should conform to.\"",
        "source": "T13n0399_001:0455c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「具足一切諸所言辭，則為順法。",
        "translation": "The Buddha told the precious maiden, \"When all words are complete, that's being compliant with the Dharma.",
        "source": "T13n0399_001:0455c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其順法者未曾與人有所諍訟，其順法者不輕慢他，其順法者亦不輕易於未學者、亦不偏敬學成就者，其順法者不自稱譽亦不顯己，其順法者不亂經典，其順法者不以供養而說道義，其順法者不為他人順發狐疑，其順法者終不訟說他人之罪，其順法者不輕慢經，其順法者終不妨廢他人經道，其順法者終不覩見覺了諸法差特分數，其順法者不覩諸法離於空者。",
        "translation": "Someone who is compliant with the Dharma has never had a dispute with anyone, someone who is compliant with the Dharma doesn't despise others, someone who is compliant with the Dharma doesn't take lightly those who have yet to learn or those who have accomplished their training, someone who is compliant with the Dharma doesn't praise themselves or present themselves, someone who is compliant with the Dharma doesn't disrupt the sutras, someone who is compliant with the Dharma doesn't teach the meaning of the Way with offerings, someone who is compliant with the Dharma doesn't raise misgivings for others, someone who is compliant with the Dharma never accuses others of their sins, someone who is compliant with the Dharma doesn't belittle the sūtras, someone who is compliant with the Dharma never sees and understands the distinctive characteristics of the Dharma, and someone who is compliant with the Dharma doesn't see the Dharma that's free from emptiness.",
        "source": "T13n0399_001:0455c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其順法者悉覩諸法不遠無常，其順法者不覩諸法捨於無願，其順法者不壞法界，其順法者不動無本，其順法者亦不超度於真本際，其順法者亦不導御隨瞋恚也，其順法者亦不御念於諸神識。",
        "translation": "He who follows the Dharma fully sees that things are not far from impermanent, he doesn't see that things are abandoned to wishlessness, he follows the Dharma and doesn't destroy the Dharma realm, he follows the Dharma and doesn't move without a root, he follows the Dharma and doesn't transcend the true essence, he follows the Dharma and doesn't guide and follow anger, and he follows the Dharma and doesn't control mindfulness of the spiritual consciousnesses.",
        "source": "T13n0399_001:0455c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其順法者：亦不導利有所猗著，其順法者亦不思念計有人也。",
        "translation": "He who conforms to the Dharma doesn't lead to gaining an unconcerned attachment, and he conforms to the Dharma doesn't contemplate the imaginary.",
        "source": "T13n0399_001:0455c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其順法者不亂法議不違嚴飾，其順法者不迷神識不惑道義，其順法者不毀正議，其順法者不錯法品，其順法者不迷於人，其順法者不造朋黨，其順法者亦不順於緣起之事，其順法者則無有勢亦無有法清淨因緣，其順法者亦無慳悋塵勞之穢，其順法者不沒禁戒，其順法者亦不捨於毀戒之人，其順法者無有懈、厭、瞋恚、結恨，其順法者不與懈怠、垢濁之人而俱同歸，其順法者不失道意，其順法者未曾違壞智慧之本，其順法者不求他人法之長短，其順法者不用憎人厭於經典，其順法者不用經典御於典籍，其順法者不違律教，其順法者不違法律，其順法者亦不遵修而有所應具法非法，其順法者不以心念而有所失，其順法者不沒經典，其順法者不壞成就，其順法者不取結縛，其順法者不得生死，其順法者不除無為，其順法者無有親友怨讎之想，其順法者不毀報應所殖之果，其順法者亦不信樂罪福之應，其順法者若加惡言則不念報，其順法者不求鬪諍之瑕缺也。",
        "translation": "「其順法者不亂法議不違嚴飾，其順法者不迷神識不惑道義，其順法者不毀正議，其順法者不錯法品，其順法者不迷於人，其順法者不造朋黨，其順法者亦不順於緣起之事，其順法者則無有勢亦無有法清淨因緣，其順法者亦無慳悋塵勞之穢，其順法者不沒禁戒，其順法者亦不捨於毀戒之人，其順法者無有懈、厭、瞋恚、結恨，其順法者不與懈怠、垢濁之人而俱同歸，其順法者不失道意，其順法者未曾違壞智慧之本，其順法者不求他人法之長短，其順法者不用憎人厭於經典，其順法者不用經典御於典籍，其順法者不違律教，其順法者不違法律，其順法者亦不遵修而有所應具法非法，其順法者不以心念而有所失，其順法者不沒經典，其順法者不壞成就，其順法者不取結縛，其順法者不得生死，其順法者不除無為，其順法者無有親友怨讎之想，其順法者不毀報應所殖之果，其順法者亦不信樂罪福之應，其順法者若加惡言則不念報，其順法者不求鬪諍之瑕缺也。",
        "source": "T13n0399_001:0455c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其順法者則不恣口，其順法者將身口心不為諛諂，其順法者不以自顯欲令人見處於閑居，其順法者不以供養之所貪利而見少事，其順法者不以無欲而造凶偽，其順法者不用他人及與己身演說佛道，其順法者不興反教，其順法者不以七財而為貪悋，其順法者不以糇糧而為服食，其順法者亦不破壞嚴父族種，其順法者不譏人短，其順法者亦不稱譽己身之德，其順法者不分別說佛之道德而有限礙，其順法者咨嗟大乘不以懈厭。",
        "translation": "「其順法者則不恣口，其順法者將身口心不為諛諂，其順法者不以自顯欲令人見處於閑居，其順法者不以供養之所貪利而見少事，其順法者不以無欲而造凶偽，其順法者不用他人及與己身演說佛道，其順法者不興反教，其順法者不以七財而為貪悋，其順法者不以糇糧而為服食，其順法者亦不破壞嚴父族種，其順法者不譏人短，其順法者亦不稱譽己身之德，其順法者不分別說佛之道德而有限礙，其順法者咨嗟大乘不以懈厭。",
        "source": "T13n0399_001:0456a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩應順於法也。」",
        "translation": "This is the kind of bodhisattva who should conform to the Dharma.\"",
        "source": "T13n0399_001:0456a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「何謂菩薩尋應威儀？",
        "translation": "The Buddha told the precious maiden, \"What's the meaning of a bodhisattva's manner of discernment?",
        "source": "T13n0399_001:0456a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂議者，無求名聞非羸劣誼，遵修療治一切德本，積累善誼志性超異，興發道意合集空誼。",
        "translation": "This is called the friendship of those who don't seek fame or reputation but aren't inferior, who cultivate and treat all the roots of virtue, who accumulate good friendships and have transcendent aspirations, and who give rise to the idea of the path and assemble the friendship of emptiness.",
        "source": "T13n0399_001:0456a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使布施不望報誼，顯揚一切諸安之誼，不毀戒誼，忍不忍誼，精進之行一切所造則超度誼，而以禪定為寂寞誼，則於智慧無猶豫誼。",
        "translation": "Suppose he gives without expecting reward, demonstrates the friendship of all peace, doesn't disparage the friendship of precepts, tolerates intolerance, practices assiduously, transcends friendship, and makes meditation his lonely friendship, then he has no hesitation in the friendship of wisdom.",
        "source": "T13n0399_001:0456a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遵修慈者等眾生誼，設為悲者則於眾生一切演誼，其為喜者歡樂法誼，若為護者於諸苦樂無動搖誼。",
        "translation": "He cultivates the friendship of compassion for sentient beings, shows friendship to all sentient beings if he's compassionate, rejoices in the Dharma if he's joyful, and isn't shaken by suffering and pleasure if he's protective.",
        "source": "T13n0399_001:0456a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若布施者則無誨誼，欣樂所生無所害誼，造成誼者興法願誼。",
        "translation": "If they are generous, they have the friendship of no teaching, the friendship of delighting in the arising of nothing harmful, and the friendship of creating the vow for the Dharma.",
        "source": "T13n0399_001:0456b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "平等誼者勸化眾生志于大乘，而以四恩化黎庶議。",
        "translation": "The friendship of equality encourages sentient beings to aspire to the great vehicle and converts ordinary people with four kinds of kindness.",
        "source": "T13n0399_001:0456b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切萬物非常苦誼，一切諸法無吾我誼。",
        "translation": "He encourages and teaches sentient beings to aspire to the great vehicle, and he teaches the common people about the four kinds of kindnesses.",
        "source": "T13n0399_001:0456b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸塵勞至澹泊誼，而於識者曉聖慧誼，遊嚴飾事為將御誼，一切經典則為帑藏導利典誼，計人命者化以法誼。",
        "translation": "He has the friendship of calmness in regard to all the world's worldly sufferings, the friendship of noble wisdom in regard to those who know, the friendship of generals in regard to the adornment of things, the friendship of guides in regard to all the scriptures, and the friendship of those who count human life as the teaching of the Dharma.",
        "source": "T13n0399_001:0456b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能了識覩達法誼，說誼無盡，分別經卷不壞法誼；若覩順滅，入無色慧而遭辯才，隨其眾人應病說誼。",
        "translation": "If he can perceive and observe the friendship of the Dharma, his friendship will be inexhaustible when he speaks, and his friendship of the Dharma won't be destroyed when he discerns the scrolls of sūtras; if he perceives obedience and extinction, he'll enter into the wisdom of formlessness and encounter eloquence, teaching the friendship of many people according to their ailments.",
        "source": "T13n0399_001:0456b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設布施業不以厭誼，為持戒業具足願故，博聞之業奉要行故，功德之業滿諸相故，為惠業者曉了一切群生根故，寂然之業將心事故，觀察之業通達智故。",
        "translation": "Suppose someone's duty of generosity isn't based on disaffection, because the duty of observing precepts is fully vowed, the duty of being well-versed is consecrated to practice, the duty of making merit full of characteristics, the duty of benefiting people is to understand the faculties of all sentient beings, the duty of being still is to bring mental incidents into focus, and the duty of observing people is to penetrate knowledge.",
        "source": "T13n0399_001:0456b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四意止者制止志故，四意斷者興顯一切功德法故，為神足者遊十方故。",
        "translation": "The four kinds of mental stabilization stop aspirations, the four kinds of mental elimination produce the manifestation of all meritorious qualities, and the spiritual abilities travel to the ten directions.",
        "source": "T13n0399_001:0456b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其五根者不破他故亦不毀空，為五力者而不錯亂諸塵勞故，七覺意者曉了一切諸法之故，遊求路者於一切法無結恨故，成神通者究竟本末無缺漏故。",
        "translation": "The five faculties don't refute others and therefore don't disparage emptiness, the five powers don't mislead the world with their defilements, the seven factors of awakening are the reason they understand all dharmas, the path of travel is the reason they have no grudges about all dharmas, and the accomplishment of supernormal powers is the reason they have no deficiencies in their origin or derivation.",
        "source": "T13n0399_001:0456b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在彼如斯，若茲像類順法議者，則為究竟法誼之要。",
        "translation": "Such being the case, if these kinds of people conform to the discussion of principles, then they are the essence of the ultimate friendship of principles.",
        "source": "T13n0399_001:0456b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若應此誼，尋應威儀不為非誼。",
        "translation": "If this friendship is appropriate, then seeking appropriate comportment wouldn't be an improper friendship.",
        "source": "T13n0399_001:0456b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩尋應威儀。」",
        "translation": "Thus, the bodhisattva investigates the appropriate manner.\"",
        "source": "T13n0399_001:0456b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「一切顛倒眾邪見滅則為空誼，行空菩薩為順誼矣！",
        "translation": "The Buddha told the precious maiden, \"When all mistaken and mistaken views cease, then it's the friendship of emptiness, and the bodhisattva who practices emptiness is the friendship of conformity!",
        "source": "T13n0399_001:0456b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除一切想，應以不應則無想故，無想菩薩便順應誼。",
        "translation": "Being free of all conceptions, it should be because there are no conceptions when there aren't any, and the bodhisattva without conceptions then accords with the meaning of accords.",
        "source": "T13n0399_001:0456b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離於一切三界之願則無願誼，無願菩薩便順應誼。",
        "translation": "Being free of all vows in the three realms, there's no sorrow of vows, and the wishless bodhisattva then conforms to their friendship.",
        "source": "T13n0399_001:0456b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "休息一切諸所造行則無行故，無行菩薩便順應誼。",
        "translation": "Being free of all created actions, there's no action, and the lack of action makes the bodhisattva agreeable.",
        "source": "T13n0399_001:0456b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨遠所生一切滅盡則無生故，無生菩薩便順應誼。",
        "translation": "Being free of all birth, there's no birth, and the nonproductivity bodhisattva then accords with it.",
        "source": "T13n0399_001:0456b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所起受以無所起則無起故，無起菩薩便順應誼。",
        "translation": "Because there's no arising of sensations that are produced, there's no arising, and the bodhisattva of no arising then conforms to it.",
        "source": "T13n0399_001:0456b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而以蠲除苦習盡道則為盡故，滅盡菩薩便順應誼。",
        "translation": "Because the path of ending suffering and accumulation is ended when it's removed, the Bodhisattva of extinction then conforms to the friendship of the buddhas.",
        "source": "T13n0399_001:0456c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法無有人命則為無故，無人菩薩便順應誼。",
        "translation": "Since all dharmas lack human life, they become nonexistent, and the bodhisattva lacking a human being then accords with friendship.",
        "source": "T13n0399_001:0456c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切言辭音響之誼，而不可得則為故矣，無獲菩薩便順應誼。",
        "translation": "Because all words and sounds are friendship, but they're unobtainable, the bodhisattva accords with their friendship.",
        "source": "T13n0399_001:0456c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸行清淨則誠諦故，至誠菩薩便順應誼。",
        "translation": "Because the practices are pure, then they're sincere, and the perfectly sincere bodhisattva accords with their friendship.",
        "source": "T13n0399_001:0456c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切道品法無放逸則為故矣，無騁菩薩便順應誼。",
        "translation": "It's because all the factors of the path are without dissipation that the nonacquainted bodhisattva then conforms to their friendship.",
        "source": "T13n0399_001:0456c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切所聞悉信奉行則為誼也，遵行菩薩便順應誼。",
        "translation": "It's because all that's heard is believed and practiced, and the bodhisattva who follows it then accords with friendship.",
        "source": "T13n0399_001:0456c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸乘由大乘故，若有菩薩隨大乘教，便順應誼。」",
        "translation": "All vehicles are based on the great vehicle, so if a bodhisattva follows the great vehicle's teaching, then he conforms to its friendship.\"",
        "source": "T13n0399_001:0456c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「無所壞者無若干事，則為誼矣。",
        "translation": "The Buddha told the precious maiden, \"Nothing that's destroyed and nothing in particular is right.",
        "source": "T13n0399_001:0456c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一品類者若一味者，則為誼矣。",
        "translation": "If there's one type of thing and one taste, then that's right.",
        "source": "T13n0399_001:0456c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所動搖若無所盡，則為誼矣。",
        "translation": "When nothing is shaken and nothing is exhausted, then that's right.",
        "source": "T13n0399_001:0456c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所行者不生不起，則為誼矣。",
        "translation": "If nothing that's practiced doesn't arise and doesn't rise, then it's righteousness.",
        "source": "T13n0399_001:0456c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所來者亦無所去，則為誼矣。",
        "translation": "When there's nothing that comes and nothing that goes, then it's righteousness.",
        "source": "T13n0399_001:0456c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所生者亦無所滅，則為誼矣。",
        "translation": "Nothing that arises and nothing that ceases, then it's right.",
        "source": "T13n0399_001:0456c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有二事：不舉不下、不高不卑，則為誼矣。",
        "translation": "There are no two things: nothing raised and nothing lowered, and nothing raised and nothing lowered, and this is righteousness.",
        "source": "T13n0399_001:0456c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所造作亦無有形，則為誼矣。",
        "translation": "Nothing is created, and nothing has form, and this is righteousness.",
        "source": "T13n0399_001:0456c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所興為亦無所有，則為誼矣。",
        "translation": "Nothing is created, and nothing exists, and this is righteousness.",
        "source": "T13n0399_001:0456c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有同像、無所勸教、亦無有知，則為誼矣。",
        "translation": "When there's no likeness, nothing to encourage, and nothing to know, this is righteousness.",
        "source": "T13n0399_001:0456c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去於三瑕淨三道場，平等三世，三垢永除而無三塵，則為誼矣。",
        "translation": "When he goes beyond the three blemishes and purifies the three sites of enlightenment, equalizes the three worlds, and permanently removes the three defilements without the three dusts, then this is righteousness.",
        "source": "T13n0399_001:0456c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所遊止無所毀失，則為誼矣。",
        "translation": "To have nothing to wander about, nothing to disparage, and nothing to lose is considered righteousness.",
        "source": "T13n0399_001:0456c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有怨敵為澹泊行，無有惱熱，則為誼矣。",
        "translation": "To conduct oneself calmly without enmity and without anger is considered righteousness.",
        "source": "T13n0399_001:0456c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無燕居行，則為誼矣。",
        "translation": "When there's no practice of living in seclusion, it's righteousness.",
        "source": "T13n0399_001:0456c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所宣布無有攝取，常如應行，則為誼矣。",
        "translation": "When there's nothing to declare, nothing to gather, and always acting as one should, that's right, and it's right.",
        "source": "T13n0399_001:0456c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷去來今無有諛諂，則為誼矣。",
        "translation": "He stops flattery in the past and present, and he has no flattery, and this is righteousness.",
        "source": "T13n0399_001:0456c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦不想念正法非法，除有限無限、有常無常，平等之惠而超度去，則為誼矣。",
        "translation": "Not missing what's right and wrong, except for the finite and infinite, the permanent and impermanent, and the superbly beneficial, then it's a friendship.",
        "source": "T13n0399_001:0456c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸文字所應音聲，而悉曉了一切本淨無有言辭，則為誼矣。",
        "translation": "He understands the sounds associated with words and fully comprehends that everything is originally pure and without words, and this is known as friendship.",
        "source": "T13n0399_001:0456c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉心意識，無所宣暢而出家者，則為誼矣。",
        "translation": "Someone who leaves home after understanding the mind and consciousness and proclaiming nothing, then they've had a meaning.",
        "source": "T13n0399_001:0456c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於婬怒癡塵勞之欲，有想無想應與不應，悉分別之而無想著，則為誼矣。",
        "translation": "He discerns all desires of lust, anger, delusion, and worldly suffering, whether conceptual or non-conceptual, and discerns them without conceptual attachment, and this is known as righteousness.",
        "source": "T13n0399_001:0456c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等於諸法而無若干，不為差特，則為誼矣。",
        "translation": "Being equal to all dharmas without specificity and without distinctions, this is known as righteousness.",
        "source": "T13n0399_001:0456c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空無想願無所造作、亦無有形，則為誼矣。",
        "translation": "When they are empty of conceptions and vows, nothing is created, and they have no form, then this is meaningful.",
        "source": "T13n0399_001:0456c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了第一至誠事者，不有所信、不仰他人、不知相處，則為誼矣。",
        "translation": "He who understands the supreme sincerity and doesn't have faith, doesn't look up to others, and doesn't know where to stand, then this is friendship.",
        "source": "T13n0399_001:0457a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦無勅教不著諸相，則為誼矣。",
        "translation": "When he doesn't have an imamant teaching and doesn't attach to marks, then he's right.",
        "source": "T13n0399_001:0457a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相如虛空靖寂之相，則為誼矣。",
        "translation": "When the marks are like the quiescent marks of space, then that's right.",
        "source": "T13n0399_001:0457a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所著相無所造作、無所悅相，則為誼矣。",
        "translation": "When there are no marks to attach to, no marks to create, and no marks to please, then that's friendship.",
        "source": "T13n0399_001:0457a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所壞相如其本無，真諦無異無差特相，則為誼矣。",
        "translation": "When the characteristic of nothing destructing is as it originally was, and the true truth is without difference or distinction, then that's meaningful.",
        "source": "T13n0399_001:0457a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善開化相計陰如幻，自然之相，則為誼矣。",
        "translation": "When the marks of skillful transformation are imagined, the aggregates are illusory, and the marks are natural, then they're well meaningful.",
        "source": "T13n0399_001:0457a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其四種者為法界相，而不遊出徑行外相，則為誼矣。",
        "translation": "These four are the characteristics of the Dharma realm that don't travel beyond the characteristics of pathways and practices, and that's right.",
        "source": "T13n0399_001:0457a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施戒惠寂然善權，無有相者，則為誼矣。",
        "translation": "When generosity, morality, and wisdom are tranquil, well-established, and without marks, this is known as righteousness.",
        "source": "T13n0399_001:0457a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "興設至誠無欺詐相，一切所有為無所有相，則為誼矣。",
        "translation": "When he produces a perfectly sincere, non-deceptive mark, and all that exists is a mark of nothingness, then he's righteous.",
        "source": "T13n0399_001:0457a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如金剛堅無壞相，處於世間無所諍相，則為誼矣。",
        "translation": "He's like adamantine, resolute, and indestructible, and he lives in the world without any marks of contention, and this is known as righteousness.",
        "source": "T13n0399_001:0457a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所作極善而諦究竟，具足之相，則為誼矣。",
        "translation": "The mark of perfect wholesomeness and completion of the truth, the mark of being complete, is righteousness.",
        "source": "T13n0399_001:0457a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切普入而悉濟相，無有陰蓋所向門相，則為誼矣。",
        "translation": "The characteristic of being fully liberated by universal entry into all things and the characteristic of having no hindrances to which to turn, then that's meaningful.",
        "source": "T13n0399_001:0457a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等於諸趣，入於一切諸法之相，則為誼矣。",
        "translation": "When they are equal in all destinies and enter into the characteristics of all dharmas, this is known as righteousness.",
        "source": "T13n0399_001:0457a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "平等無邪覩於平均，無所有相，則為誼矣。",
        "translation": "When he sees equality, absence of error, and evenness, and has no characteristics, this is known as righteousness.",
        "source": "T13n0399_001:0457a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "定意智惠因遊生相，解度知見而為惠相，則為誼矣。",
        "translation": "When the mark of knowledge and wisdom of concentrated intent arises from wandering, and the mark of wisdom arises from the knowledge and vision of understanding and liberation, then this is friendship.",
        "source": "T13n0399_001:0457a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依於聖相，若有所知若教命相，則為誼矣。",
        "translation": "If he relies on the mark of holiness, and if he knows and teaches the mark of life, then this is friendship.",
        "source": "T13n0399_001:0457a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其真諦曉發遣相，等御一切諸法之相，則為誼矣。",
        "translation": "If they truly understand the aspect of dispatching and equip them to control the aspects of all dharmas, then they've fulfilled their friendship.",
        "source": "T13n0399_001:0457a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使菩薩如是具足所修之誼，能說若斯諸誼事者，則能分別一切眾誼。",
        "translation": "If a bodhisattva thus fully possesses the friendship that he cultivates and is able to explain such things as friendship, then he'll be able to discern the friendship of all people.",
        "source": "T13n0399_001:0457a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故謂大士菩薩尋應威儀者也。」",
        "translation": "Therefore, it's called a great person who's a bodhisattva in search of appropriate comportment.\"",
        "source": "T13n0399_001:0457a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「何謂菩薩奉順律教？",
        "translation": "The Buddha told the precious maiden, \"What does it mean for a bodhisattva to conform to the teachings of the Vinaya?",
        "source": "T13n0399_001:0457a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來講說，而有二律。",
        "translation": "As the Tathāgata explains it, there are two vinaya texts.",
        "source": "T13n0399_001:0457a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are the two?",
        "source": "T13n0399_001:0457a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殃罪之律、決勞欲律。",
        "translation": "\"It's the law of harmful offenses and the law of settling desires for labor.",
        "source": "T13n0399_001:0457a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼何謂殃罪之律？",
        "translation": "What does it mean by the law of calamity?",
        "source": "T13n0399_001:0457a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言罪律，思想之本，不應順本、無明之本、愚癡之本、顛倒之本、無實之本、虛偽之本、貪身之本、猗我之本、著人之本、懈怠之本、無所捨本、無所歸本、狐疑之本、慢恣之本、難致慧本，是謂殃罪之律。",
        "translation": "The so-called law of sin, which is the root of thought, the root of disobedience, the root of ignorance, the root of delusion, the root of insubstantiality, the root of hypocrisy, the root of desire for the body, the root of agitation for self, the root of attachment to others, the root of laziness, the root of no abandonment, the root of no refuge, the root of doubt, the root of conceit, and the root of awakening that's difficult to attain, is called the law of harmful sin.",
        "source": "T13n0399_001:0457a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂決塵欲律？",
        "translation": "What's the law of settling worldly desires?",
        "source": "T13n0399_001:0457a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住無猶豫而無所念，無有罪處亦不說罪、不說方面，不樂王者，不為塵埃，無有慳貪、亦無所見心無所起，其志安雅離于滅盡，則無所有無有處所、亦無方面無有塵勞，無所悋惜亦無所覩，計如心者罪亦如之。",
        "translation": "He abides without hesitation and without thought, has no place of blame, doesn't speak of blame, doesn't speak of aspects, doesn't delight in kings, doesn't become dust, has no stinginess or greed, sees nothing, and has a mind that arises from nothing, his intentions are peaceful and free of cessation, then he has nothing, has no place, has no aspect, has no dust and trouble, has nothing to cherish, and sees nothing, and he conceives of himself as a person of mind, so are his crimes.",
        "source": "T13n0399_001:0457b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其罪者，一切諸法亦復如是，無有根本亦無所住，猶如心者不可攀引，清淨鮮潔超諸所有，寂然澹泊趣于滅盡，斷絕休息生死患難，信遵聖教而秉一心無有猶豫，志於同歸無有殃舋。",
        "translation": "Like that sin, all dharmas are likewise, having no root and no place to abide, just as the mind is unclimbable, pure and clean, transcending all that exists, calm and collected, headed for total cessation, cutting off the trouble of birth-and-death at rest, faithfully following the noble teaching, maintaining a single mind without hesitation, and aiming for the same goal without misfortune.",
        "source": "T13n0399_001:0457b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則名曰決塵欲律。」",
        "translation": "This is called the precept for resolving defilements and desires.\"",
        "source": "T13n0399_001:0457b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「何謂塵勞？",
        "translation": "The Buddha told the precious maiden, \"What's meant by dust and labor?",
        "source": "T13n0399_001:0457b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何決欲律？",
        "translation": "What are the rules of desire?",
        "source": "T13n0399_001:0457b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言塵者，謂婬怒癡、無明恩愛，及以所受諸有十二所趣有為因緣之行，是曰塵勞。",
        "translation": "By dust, I mean lust, anger, delusion, ignorance, craving, and the conditioned conditioned actions of having twelve destinies, which are called dust and labor.",
        "source": "T13n0399_001:0457b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所決欲律究竟開化一切諸法。",
        "translation": "It's determined to ultimately enlighten all dharmas with the desire and discipline.",
        "source": "T13n0399_001:0457b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0399_001:0457b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則以空事開化諸法，彼無欲行無恚恨癡；則以無相開化諸法，亦無翫習行眾勞塵；則以無願化於諸法，彼則習行諸德善事。",
        "translation": "They then enlighten dharmas with empty phenomena, which lack desire and conduct, and lack anger, hate, and delusion; they then enlighten dharmas with marklessness, which lack the accumulation of the many dusts of labor; and they then enlighten dharmas with wishlessness, which accumulate the conduct of virtuous and good works.",
        "source": "T13n0399_001:0457b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切行而無所行，已無所有化於諸法，以無所行導利諸法。",
        "translation": "With nothing to do and nothing to practice, he has nothing to teach the dharmas and guides the dharmas with nothing to practice.",
        "source": "T13n0399_001:0457b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於所造而無所行，一切諸法依猗因緣，於一切見無所遵修。",
        "translation": "He does nothing based on what he has created, relies on interdependent causes for all dharmas, and cultivates nothing based on all views.",
        "source": "T13n0399_001:0457b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使於此十二因緣，有所歸趣平等諸法，於一切勞則無欲塵本末寂滅。",
        "translation": "If these twelve causes and conditions were to lead to the equality of all dharmas, then all labor would be without desire for the disappearance of the dust in its origin.",
        "source": "T13n0399_001:0457b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所云空者，俗與道空。",
        "translation": "What's called emptiness is the emptiness of the conventional and the path.",
        "source": "T13n0399_001:0457b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之空，一切塵勞欲事亦空。",
        "translation": "Because of this emptiness, all the dust and toil of desiring things are also empty.",
        "source": "T13n0399_001:0457b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使以空等於道者，是決欲律。",
        "translation": "Suppose someone equates emptiness with the path, for this is a judgmental precept on desire.",
        "source": "T13n0399_001:0457b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有言曰，彼典主律，自開化者乃名曰律。",
        "translation": "It's said that this is a classic master of discipline, and he calls it discipline when he reveals and transforms himself.",
        "source": "T13n0399_001:0457b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其能知己自化身者，則能曉了開化欲律。",
        "translation": "Those who can know their own transformation body can then understand the law of desire for enlightenment.",
        "source": "T13n0399_001:0457b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何謂開化己身之律？",
        "translation": "\"What's meant by the precept of enlightening one's own body?",
        "source": "T13n0399_001:0457b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其能分別於我、不我，知身自然，解己澹泊了己如實，曉於己身無所瞋恨，分別身空己無所有，曉己無本了己無獲，分別己身而不動搖，分別己身無有倫比，曉己無生亦無所起，其有了己，分別如是則了塵勞，而無有本亦復若斯！",
        "translation": "He discerns self and not-self, knows the body as natural, understands his own calmness and comprehends himself as he really is, knows that he has no anger about himself, discerns that his body is empty and has nothing, knows that he has no basis and comprehends that he has nothing to gain, discerns his body without wavering, discerns that his body has no equal, knows that he is unborn and has nothing to give rise to, and comprehends himself as he is, discerns this, and then he has ended his defilement, and so has he gone without a basis!",
        "source": "T13n0399_001:0457b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無有我而想有我，彼則顛倒；設如是者，己無塵勞而起勞想，是為顛倒。",
        "translation": "\"If someone thinks there's a self when there's no self, they're mistaken; suppose someone thus conceives of labor when they have no dust and labor, which is mistaken.",
        "source": "T13n0399_001:0457c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如吾我本淨無身，如是欲塵則為本淨，無塵勞也。",
        "translation": "Also, if my self is originally pure and bodiless, then the dust of desire is originally pure and lacks the dust and labor.",
        "source": "T13n0399_001:0457c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有曉了如是觀者，是決欲律。",
        "translation": "Anyone who understands such an observation is determined to observe the precepts of desire.",
        "source": "T13n0399_001:0457c05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼亦不化過去欲塵，亦無當來、亦無現在。",
        "translation": "They won't transform the dust of desire in the past, nor will they be in the future or present.",
        "source": "T13n0399_001:0457c05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0399_001:0457c06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不習諸行亦不復念塵勞欲塵。",
        "translation": "He doesn't train in practices and doesn't again think about the dust of worldly sufferings and desires.",
        "source": "T13n0399_001:0457c07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其於己身無所念者，則無過去亦無當來、亦無現在。",
        "translation": "When he's not mindful of anything about himself, there's nothing past, nothing future, and nothing present.",
        "source": "T13n0399_001:0457c07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如心者無有色像，則無有內亦無有外、亦無所得，欲塵如是則無色像，亦無有內亦無有外、亦無所得。",
        "translation": "Also, just as the mind has no form, then there's nothing internal, nothing external, and nothing to be attained, so the desire dust has no form, nothing internal, nothing external, and nothing to be attained.",
        "source": "T13n0399_001:0457c09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所得者則無瞋恨，亦無諍訟無所滅除，亦無所造無所不造，亦無所作亦復不作。",
        "translation": "When there's nothing to attain, there's no anger, no dispute, nothing to cease, nothing to create, nothing not to create, and nothing to do and nothing not to do.",
        "source": "T13n0399_001:0457c11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切欲塵其有遊此，於諸欲塵了別恩愛，而無所有亦不離有，是則名曰決欲塵律。」",
        "translation": "When all the objects of desire and their existence wander here, and when they discern affection for the objects of desire, they lack existence and aren't free from existence, this is called the rule of settling desires and objects.\"",
        "source": "T13n0399_001:0457c13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告寶女：「假使菩薩曉了如是開化欲律，則能教導眾人欲塵而說法矣！",
        "translation": "The Buddha told the precious maiden, \"If a bodhisattva understands the precepts for resolving desires in this way, then he'll be able to teach the Dharma to all people in regard to the desire dust!",
        "source": "T13n0399_001:0457c15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則名曰奉順律教。」",
        "translation": "This is called conforming to the vinaya.\"",
        "source": "T13n0399_001:0457c16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是至誠真教之法，隨誼奉順律事，一萬菩薩得不起法忍。",
        "translation": "When the Buddha teaches this method of the most sincere and true teaching, 10,000 bodhisattvas will attain patience based on their obedience to the precepts.",
        "source": "T13n0399_001:0457c17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶女欣然志懷踊躍，善心生焉，前白佛言：「未曾有，如來！",
        "translation": "The jeweled maiden was elated, her aspiration soaring, and her good heart arisen as she went forward to say to the Buddha, \"Never before has there been such a thing, Tathāgata!",
        "source": "T13n0399_001:0457c18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快說此至誠法歎詠誼律。",
        "translation": "\"Quickly explain this perfectly sincere teaching, praising the Vinaya.",
        "source": "T13n0399_001:0457c19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使菩薩奉行如斯，則為第一，無所諍訟，便能蠲除眾生所訟，則順經典。」",
        "translation": "If a bodhisattva thus practices it, then he's the best, has no quarrels, and can remove the quarrels of sentient beings, and then he complies with the sūtras.\"",
        "source": "T13n0399_001:0457c20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶女所問經卷第一",
        "translation": "Jewel Girl's Questions Sutra, Volume 1",
        "source": "T13n0399_001:0457c23_0",
        "is_bad_quality": false
    }
]