[
    {
        "source_sentence": "地藏菩薩本願經卷下",
        "translation": "Second Fascicle of the Sutra on the Original Vows of Kṣitigarbha Bodhisattva",
        "source": "T13n0412_002:0783c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐于闐國三藏沙門實叉難陀譯",
        "translation": "Translated by the Tripiṭaka Master Śikṣānanda of Yutan, Tang Dynasty",
        "source": "T13n0412_002:0783c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "利益存亡品第七",
        "translation": "The Seventh Chapter of Benefiting Life and Death",
        "source": "T13n0412_002:0783c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，地藏菩薩摩訶薩白佛言：「世尊！",
        "translation": "At that point, Kṣitigarbha Bodhisattva Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0783c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我觀是閻浮眾生，舉心動念，無非是罪。",
        "translation": "\"I observe that these Jambudvīpa sentient beings lift their minds, and nothing they do is a sin.",
        "source": "T13n0412_002:0783c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脫獲善利，多退初心；若遇惡緣，念念增益。",
        "translation": "When they attain good benefits, they often retreat from their first thoughts, and when they encounter bad conditions, they are mindful of gaining ground.",
        "source": "T13n0412_002:0783c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是等輩人，如履泥塗，負於重石，漸困漸重，足步深邃。",
        "translation": "Such a group of people is like walking through mud and carrying a heavy load of rocks, gradually becoming more and more trapped and having deeper and deeper footing.",
        "source": "T13n0412_002:0784a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得遇知識，替與減負，或全與負，是知識有大力故，復相扶助，勸令牢脚，若達平地，須省惡路，無再經歷。",
        "translation": "If they meet a friend who takes the load off their shoulders or takes it all on, that friend has great strength, helps them back up, encourages them to keep their feet firmly planted, and makes it possible for them to reach level ground and save themselves from going down bad roads that they won't have to go through again.",
        "source": "T13n0412_002:0784a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T13n0412_002:0784a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "習惡眾生，從纖毫間，便至無量。",
        "translation": "\"From the slightest hairsbreadth, sentient beings accustomed to evil reach infinity.",
        "source": "T13n0412_002:0784a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生，有如此習，臨命終時，父母眷屬宜為設福，以資前路。",
        "translation": "When these sentient beings with such habits reach the end of their lives, it's appropriate for their parents and relatives to designate blessings to support their former path.",
        "source": "T13n0412_002:0784a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或懸旛蓋，及然油燈，或轉讀尊經，或供養佛像及諸聖像。",
        "translation": "They might hang banners and parasols, read venerable sūtras, or make offerings to images of the Buddha and other sages.",
        "source": "T13n0412_002:0784a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至念佛菩薩及辟支佛名字，一名一號，歷臨終人耳根，或聞在本識。",
        "translation": "They might even recite the names of buddhas, bodhisattvas, and pratyekabuddhas, one by one, to the person's ear faculty at the time of death, or they might hear them in their original consciousness.",
        "source": "T13n0412_002:0784a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生所造惡業，計其感果，必墮惡趣，緣是眷屬為臨終人修此聖因，如是眾罪，悉皆銷滅。",
        "translation": "As a result of their dependents cultivating these noble causes for the dying person, such sins will all be extinguished.",
        "source": "T13n0412_002:0784a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能更為身死之後，七七日內，廣造眾善，能使是諸眾生，永離惡趣，得生人天，受勝妙樂，現在眷屬，利益無量。",
        "translation": "If they can also create numerous good deeds within seven or seven days after their physical death, it will cause these sentient beings to permanently escape the bad destinies and be born in heaven, where they'll experience excellent and wonderful happiness, and their present dependents will have immeasurable benefits.",
        "source": "T13n0412_002:0784a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故我今對佛世尊，及天龍八部、人、非人等，勸於閻浮提眾生：臨終之日，慎勿殺害，及造惡緣——拜祭鬼神，求諸魍魎。",
        "translation": "\"Therefore, I now commend the Bhagavān, the eight groups of gods, dragons, humans, and nonhumans to the sentient beings of Jambudvīpa: On the day of their death, be careful not to kill or cause harm - to worship ghosts and spirits, or to seek out monsters.",
        "source": "T13n0412_002:0784a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0412_002:0784a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾所殺害，乃至拜祭，無纖毫之力利益亡人，但結罪緣，轉增深重。",
        "translation": "That killing or even paying respect to the deceased doesn't have the slightest power to benefit them, but it creates a condition of guilt that becomes increasingly grave.",
        "source": "T13n0412_002:0784a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使來世，或現在生，得獲聖分，生人天中，緣是臨終被諸眷屬造是惡因，亦令是命終人，殃累對辯，晚生善處。",
        "translation": "Even if he were to be born in a future life or in the present life and attain the noble portion of the world and be born in heaven, because his family members created these bad causes at the end of his life, it would cause this person whose life ended to be burdened with negative association to be born in a good place later.",
        "source": "T13n0412_002:0784a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況臨命終人，在生未曾有少善根，各據本業，自受惡趣，何忍眷屬，更為增業？",
        "translation": "How could a person approaching the end of his life who never had few good roots in life and who relies on his own actions to be subject to a bad destiny tolerate further actions by his retinue?",
        "source": "T13n0412_002:0784a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，從遠地來，絕糧三日，所負擔物，彊過百斤。",
        "translation": "It's like a person who comes from a faraway land, stops eating for three days, and carries a load that's more than a hundred pounds strong.",
        "source": "T13n0412_002:0784a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忽遇隣人，更附少物，以是之故，轉復困重。",
        "translation": "Suddenly, they meet someone near them who has a little more to carry, and as a result, they're further weighed down.",
        "source": "T13n0412_002:0784a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0412_002:0784a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我觀閻浮眾生，但能於諸佛教中，乃至善事，一毛一渧，一沙一塵，如是利益，悉皆自得。」",
        "translation": "I've observed that among the Yama sentient beings, even a hair, a drop, or a grain of sand can be done for good, and such benefits are all obtained by themselves.\"",
        "source": "T13n0412_002:0784a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，會中有一長者，名曰大辯——是長者，久證無生，化度十方，現長者身——，合掌恭敬，問地藏菩薩言：「大士！",
        "translation": "When he spoke these words, an elder in the assembly named Daban - an elder who had long realized the nonarising of sentient beings and had saved ten directions by transforming them into the body of an elder - joined his palms in respect and asked Kṣitigarbha Bodhisattva, \"Great man!",
        "source": "T13n0412_002:0784a28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是南閻浮提眾生，命終之後，小大眷屬，為修功德，乃至設齋，造眾善因，是命終人，得大利益及解脫不？」",
        "translation": "Are these sentient beings in southern Jambudvīpa who, after their lives end, cultivate merit, even to the point of establishing purification, and create numerous good causes, the people whose lives end who attain great benefit and liberation?\"",
        "source": "T13n0412_002:0784b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏答言：「長者！",
        "translation": "Kṣitigarbha replied, \"Sir!",
        "source": "T13n0412_002:0784b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今為未來現在一切眾生，承佛威力，略說是事。",
        "translation": "Now, I'd like to briefly explain this matter for all sentient beings in the future and in the present, thanks to the Buddha's authority.",
        "source": "T13n0412_002:0784b05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者，未來現在諸眾生等，臨命終日，得聞一佛名、一菩薩名、一辟支佛名，不問有罪無罪，悉得解脫。",
        "translation": "Sir, when sentient beings in the future and in the present reach the end of their lives, they'll hear the name of a Buddha, a bodhisattva, or a pratyekabuddha, and they'll all be liberated, regardless of guilt or innocence.",
        "source": "T13n0412_002:0784b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有男子女人，在生不修善因，多造眾罪，命終之後，眷屬小大為造福利一切聖事，七分之中，而乃獲一，六分功德，生者自利。",
        "translation": "\"If a man or woman doesn't cultivate good causes in his or her lifetime and often commits numerous sins, then after his or her life ends, his or her dependents will be small or large enough to perform all the noble deeds for his or her welfare, and only one of the seven parts will be obtained, and six parts of the merit will be self-benefiting to the one who's born.",
        "source": "T13n0412_002:0784b08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之故，未來現在善男女等，聞健自修，分分己獲。",
        "translation": "Because of this, good men and women in the present who hear about it will cultivate it on their own, and they'll attain it in part.",
        "source": "T13n0412_002:0784b11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無常大鬼，不期而到，冥冥遊神，未知罪福，七七日內，如癡如聾。",
        "translation": "A great impermanent ghost arrives unexpectedly, wanders aimlessly in the dark, unaware of sins and merits, and goes dumb and deaf for seven or seven days.",
        "source": "T13n0412_002:0784b12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或在諸司，辯論業果，審定之後，據業受生。",
        "translation": "Some of them may be in the directorate, debating the results of their actions, and after they're judged, they'll be born based on their actions.",
        "source": "T13n0412_002:0784b14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未測之間，千萬愁苦，何況墮於諸惡趣等？",
        "translation": "Before they know it, they'll experience tens of thousands of miseries, so why would they fall into the negative rebirths?",
        "source": "T13n0412_002:0784b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是命終人，未得受生，在七七日內，念念之間，望諸骨肉眷屬，與造福力救拔。",
        "translation": "\"When a person's life ends and he's not yet allowed to be born, he'll spend seven or seven days in mindfulness, hoping that his bones and flesh and his family will save him with the power to create merit.",
        "source": "T13n0412_002:0784b16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過是日後，隨業受報，若是罪人，動經千百歲中，無解脫日。",
        "translation": "After those days, he'll be punished according to his actions, and if he's a sinner, he'll go through a thousand hundred years without a single day of liberation.",
        "source": "T13n0412_002:0784b18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是五無間罪，墮大地獄，千劫萬劫，永受眾苦。",
        "translation": "If he commits the five heinous crimes, he'll be cast into great hell for a thousand or ten thousand eons and will experience eternal suffering.",
        "source": "T13n0412_002:0784b19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，長者！",
        "translation": "\"Furthermore, sir!",
        "source": "T13n0412_002:0784b20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是罪業眾生，命終之後，眷屬骨肉，為修營齋，資助業道。",
        "translation": "\"Thus, when a sentient being with sinful activity reaches the end of his life, his family members and flesh and blood cultivate purification to support the path of activity.",
        "source": "T13n0412_002:0784b20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未齋食竟，及營齋之次，米泔菜葉，不棄於地。",
        "translation": "After they finish eating before the meal is served, and after the meal is served, they don't throw rice, swill, or leaves on the ground.",
        "source": "T13n0412_002:0784b22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至諸食未獻佛僧，勿得先食。",
        "translation": "Don't even eat food that hasn't been offered to the Buddha and Saṃgha beforehand.",
        "source": "T13n0412_002:0784b23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有違食及不精勤，是命終人，了不得力。",
        "translation": "If someone disregards these foods and doesn't make an effort, this person's life will end and he won't attain strength.",
        "source": "T13n0412_002:0784b23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如精勤護淨，奉獻佛僧，是命終人，七分獲一。",
        "translation": "If he diligently protects and purifies his food and dedicates it to the Buddha and Saṃgha, this person's life will end and he'll attain one out of seven.",
        "source": "T13n0412_002:0784b24_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，長者！",
        "translation": "Therefore, sir!",
        "source": "T13n0412_002:0784b25_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮眾生，若能為其父母，乃至眷屬，命終之後，設齋供養，志心勤懇，如是之人，存亡獲利。」",
        "translation": "If Jambudvīpa sentient beings can make offerings to their parents and even their retinues after their lives end, and if they are diligent in their intentions, such people will reap benefits in their lifetime.\"",
        "source": "T13n0412_002:0784b26_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，忉利天宮有千萬億那由他閻浮鬼神，悉發無量菩提之心。",
        "translation": "When he said those words, a thousand thousand million nayuta Jambudvīpa spirits in the palace of the Heaven of Thirty-three all aroused the intention for immeasurable enlightenment.",
        "source": "T13n0412_002:0784b28_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大辯長者，作禮而退。",
        "translation": "The elder of great eloquence paid homage and withdrew.",
        "source": "T13n0412_002:0784b29_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻羅王眾讚歎品第八",
        "translation": "The Eighth Chapter of the Praises of King Yama's Bhūtas",
        "source": "T13n0412_002:0784c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，鐵圍山內，有無量鬼王，與閻羅天子，俱詣忉利，來到佛所。",
        "translation": "At the time, on Mount Tiewei, there were measureless demon kings and Yama gods who all went to the Thirty-three and came to the Buddha.",
        "source": "T13n0412_002:0784c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂惡毒鬼王、多惡鬼王、大諍鬼王、白虎鬼王、血虎鬼王、赤虎鬼王、散殃鬼王、飛身鬼王、電光鬼王、狼牙鬼王、千眼鬼王、噉獸鬼王、負石鬼王、主耗鬼王、主禍鬼王、主食鬼王、主財鬼王、主畜鬼王、主禽鬼王、主獸鬼王、主魅鬼王、主產鬼王、主命鬼王、主疾鬼王、主險鬼王、三目鬼王、四目鬼王、五目鬼王、祁利失王、大祁利失王、祁利叉王、大祁利叉王、阿那吒王、大阿那吒王。",
        "translation": "所謂惡毒鬼王、多惡鬼王、大諍鬼王、白虎鬼王、血虎鬼王、赤虎鬼王、散殃鬼王、飛身鬼王、電光鬼王、狼牙鬼王、千眼鬼王、噉獸鬼王、負石鬼王、主耗鬼王、主禍鬼王、主食鬼王、主財鬼王、主畜鬼王、主禽鬼王、主獸鬼王、主魅鬼王、主產鬼王、主命鬼王、主疾鬼王、主險鬼王、三目鬼王、四目鬼王、五目鬼王、祁利失王、大祁利失王、祁利叉王、大祁利叉王、阿那吒王、大阿那吒王。",
        "source": "T13n0412_002:0784c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等大鬼王，各各與百千諸小鬼王，盡居閻浮提，各有所執，各有所主。",
        "translation": "Each of these great demon kings and a hundred thousand other small demon kings live in Yambudvīpa, each with something to hold and someone to preside over.",
        "source": "T13n0412_002:0784c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸鬼王，與閻羅天子，承佛威神，及地藏菩薩摩訶薩力，俱詣忉利，在一面立。",
        "translation": "These demon kings and Yama gods, endowed with the Buddha's authoritative power and the power of Kṣitigarbha Bodhisattva Mahāsattva, all went to Tārāvatī and stood at one side.",
        "source": "T13n0412_002:0784c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，閻羅天子，胡跪合掌，白佛言：「世尊！",
        "translation": "At the time, the Yama gods prostrated with their palms together and said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0784c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者與諸鬼王，承佛威神，及地藏菩薩摩訶薩力，方得詣此忉利大會，亦是我等獲善利故。",
        "translation": "Now, thanks to the Buddha's authority and the power of Kṣitigarbha Bodhisattva Mahāsattva, we and the demon kings have been able to go to this great meeting at Tuṣita, and it's because we've gained good benefits.",
        "source": "T13n0412_002:0784c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今有小疑事，敢問世尊，唯願世尊，慈悲宣說。」",
        "translation": "Now, I have a minor doubt that I dare to ask the Bhagavān, so please have mercy on him and explain it.\"",
        "source": "T13n0412_002:0784c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告閻羅天子：「恣汝所問，吾為汝說。」",
        "translation": "The Buddha told Yama, \"Allow me to answer your questions, and I'll explain them for you.\"",
        "source": "T13n0412_002:0784c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，閻羅天子瞻禮世尊，及迴視地藏菩薩，而白佛言：「世尊！",
        "translation": "The Yama-deva then paid homage to the Bhagavān and looked back at Kṣitigarbha Bodhisattva as he said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0784c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我觀地藏菩薩，在六道中，百千方便，而度罪苦眾生，不辭疲倦。",
        "translation": "I've observed Kṣitigarbha Bodhisattva in the six destinies, working with a hundred thousand skillful means to save sentient beings who suffer from sins without tire.",
        "source": "T13n0412_002:0784c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大菩薩，有如是不可思議神通之事。",
        "translation": "This great bodhisattva has such unfathomable miraculous abilities.",
        "source": "T13n0412_002:0784c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然諸眾生，脫獲罪報，未久之間，又墮惡道。",
        "translation": "Still, all sentient beings are freed from the effects of their sins and then fall into a bad destiny before long.",
        "source": "T13n0412_002:0784c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0412_002:0784c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是地藏菩薩既有如是不可思議神力，云何眾生而不依止善道，永取解脫？",
        "translation": "Given this unfathomable power of Kṣitigarbha Bodhisattva, how is it that sentient beings don't rely on the good path and attain liberation forever?",
        "source": "T13n0412_002:0784c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，為我解說。」",
        "translation": "Please let the Bhagavān explain this for me.\"",
        "source": "T13n0412_002:0784c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告閻羅天子：「南閻浮提眾生，其性剛彊，難調難伏。",
        "translation": "The Buddha told Yama, the son of Yama, \"The sentient beings of southern Yambudvī are rigid in nature and difficult to control and difficult to subdue.",
        "source": "T13n0412_002:0784c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大菩薩，於百千劫，頭頭救拔如是眾生，早令解脫。",
        "translation": "This is a great bodhisattva who, during a hundred thousand eons, first rescues such sentient beings and causes them to be liberated early.",
        "source": "T13n0412_002:0785a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是罪報人，乃至墮大惡趣。",
        "translation": "Such people are the rewards of their sins, even if they fall into the great evil destinies.",
        "source": "T13n0412_002:0785a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以方便力，拔出根本業緣，而遣悟宿世之事。",
        "translation": "With the power of skillful means, the bodhisattva uprooted the fundamental causes and conditions of karma and expelled the understanding of past lives.",
        "source": "T13n0412_002:0785a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自是閻浮眾生，結惡習重，旋出旋入。",
        "translation": "Since then, sentient beings in Jambudvīpa have heavy bonds and bad habits, and they keep emerging and entering.",
        "source": "T13n0412_002:0785a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勞斯菩薩，久經劫數，而作度脫。",
        "translation": "It takes a long time for this bodhisattva to work to liberate them.",
        "source": "T13n0412_002:0785a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「譬如有人，迷失本家，誤入險道。",
        "translation": "\"It's like a person who loses sight of their original home and mistakenly enters a dangerous path.",
        "source": "T13n0412_002:0785a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其險道中，多諸夜叉，及虎狼師子、蚖蛇蝮蠍。",
        "translation": "In that dangerous path, there are many nightjars, tigers, wolves, lions, newts, snakes, and vipers.",
        "source": "T13n0412_002:0785a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迷人，在險道中，須臾之間，即遭諸毒。",
        "translation": "Thus, an attractive person is in the path of danger, and in a moment's time they'll encounter various poisons.",
        "source": "T13n0412_002:0785a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一知識，多解大術，善禁是毒，乃及夜叉諸惡毒等。",
        "translation": "There's a friend who's well-versed in the great arts and who skillfully prohibits this poison, along with the harsh poisons of the yakṣas and so forth.",
        "source": "T13n0412_002:0785a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忽逢迷人，欲進險道，而語之言：『咄哉！",
        "translation": "He suddenly meets a charmer who wants to go down a dangerous path and says, 'Oh, really!",
        "source": "T13n0412_002:0785a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "男子！",
        "translation": "Man!",
        "source": "T13n0412_002:0785a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為何事故，而入此路？",
        "translation": "Why did you enter this path because of the accident?",
        "source": "T13n0412_002:0785a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何異術，能制諸毒？』",
        "translation": "What is the extraordinary skill that can control poisons?'",
        "source": "T13n0412_002:0785a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迷路人，忽聞是語，方知險道，即便退步，求出此路。",
        "translation": "That lost person suddenly hears these words and realizes the dangerous path, so he retreats and seeks to escape it.",
        "source": "T13n0412_002:0785a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善知識，提携接手，引出險道，免諸惡毒，至于好道，令得安樂，而語之言：『咄哉！",
        "translation": "That good teacher guides him and leads him out of the dangerous path, free of bad poison, to a good path, where he attains well-being, and says, 'Oh, really!",
        "source": "T13n0412_002:0785a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迷人！",
        "translation": "Fascinating!",
        "source": "T13n0412_002:0785a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今已後，勿履是道。",
        "translation": "From now on, don't follow this path.",
        "source": "T13n0412_002:0785a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此路入者，卒難得出，復損性命。』",
        "translation": "If someone enters this path, it'll be difficult to escape and will again harm their life.'",
        "source": "T13n0412_002:0785a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迷路人，亦生感重。",
        "translation": "That lost wayfarer also felt a sense of respect.",
        "source": "T13n0412_002:0785a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨別之時，知識又言：『若見親知及諸路人，若男若女，言於此路多諸毒惡，喪失性命。",
        "translation": "When he was about to part, the friend also said, 'Suppose you see someone you know and someone on the path, male or female, who says that this path is full of bad things and will cost them their lives.",
        "source": "T13n0412_002:0785a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無令是眾，自取其死。』",
        "translation": "Don't let those people take their own lives.'",
        "source": "T13n0412_002:0785a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故地藏菩薩具大慈悲，救拔罪苦眾生，生天人中，令受妙樂。",
        "translation": "\"Therefore, Kṣitigarbha Bodhisattva has great compassion and rescues sentient beings who suffer from sins and are born among gods and humans, so that they may experience marvelous happiness.",
        "source": "T13n0412_002:0785a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸罪眾，知業道苦，脫得出離，永不再歷。",
        "translation": "These sinful beings know the suffering of the path of karma, are freed from it, and never experience it again.",
        "source": "T13n0412_002:0785a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如迷路人，誤入險道，遇善知識，引接令出，永不復入。",
        "translation": "They're like a person who's lost their way and mistakenly enters a dangerous path and meets a good teacher who guides them and causes them to get out, so they never enter again.",
        "source": "T13n0412_002:0785a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逢見他人，復勸莫入，自言：『因是迷故，得解脫竟，更不復入。』",
        "translation": "When they meet someone else, they're again discouraged from entering, saying to themselves, 'Because of this misconception, I've been liberated and won't enter again.'",
        "source": "T13n0412_002:0785a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若再履踐，猶尚迷誤，不覺舊曾所落險道，或致失命，如墮惡趣。",
        "translation": "If they still remain deluded after following the path again, they won't realize that they've fallen down a dangerous path in the past, which might cause them to lose their lives and fall into a bad destiny.",
        "source": "T13n0412_002:0785a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏菩薩方便力故，使令解脫，生人天中。",
        "translation": "Because of the power of Kṣitigarbha Bodhisattva's skillful means, he's liberated and will be reborn in the heavens.",
        "source": "T13n0412_002:0785a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "旋又再入，若業結重，永處地獄，無解脫時。」",
        "translation": "If they then re-enter, they'll be permanently imprisoned in hell with no time for liberation if the karmic bonds are heavy.\"",
        "source": "T13n0412_002:0785a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，惡毒鬼王合掌恭敬，白佛言：「世尊！",
        "translation": "At that point, the king of malevolent spirits joined his palms in respect and said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0785a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等諸鬼王，其數無量，在閻浮提，或利益人，或損害人，各各不同。",
        "translation": "We demon kings, whose number is countless, are each in Jambudvīpa, either benefiting people or harming people in different ways.",
        "source": "T13n0412_002:0785a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然是業報，使我眷屬，遊行世界，多惡少善。",
        "translation": "Still, this is the result of karma that causes my retinue to travel the world, doing much evil and little good.",
        "source": "T13n0412_002:0785b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過人家庭，或城邑聚落，莊園房舍。",
        "translation": "They may pass by a person's family, a town or village, or a mansion.",
        "source": "T13n0412_002:0785b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有男子女人，修毛髮善事，乃至懸一旛一蓋，少香少華，供養佛像及菩薩像，或轉讀尊經，燒香供養一句一偈。",
        "translation": "Perhaps there are men and women who cultivate good deeds with their hair, or who hang a pennant or canopy, scatter incense and flowers, make offerings to images of the Buddha and bodhisattva, or read venerable sūtras and burn incense to offer a phrase or verse.",
        "source": "T13n0412_002:0785b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等鬼王，敬禮是人，如過去、現在、未來諸佛。",
        "translation": "We ghost kings revere this person as a past, present, or future Buddha.",
        "source": "T13n0412_002:0785b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勅諸小鬼，各有大力，及土地分，便令衛護。",
        "translation": "I command all the little ghosts to each have great strength and a share of the land, so that they can guard them.",
        "source": "T13n0412_002:0785b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不令惡事橫事、惡病橫病，乃至不如意事，近於此舍等處，何況入門？」",
        "translation": "They won't let anything bad or disagreeable, or even anything unsatisfactory, come near this house or elsewhere, let alone enter it.\"",
        "source": "T13n0412_002:0785b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛讚鬼王：「善哉！",
        "translation": "The Buddha praised the demon king, \"Good!",
        "source": "T13n0412_002:0785b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T13n0412_002:0785b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等及與閻羅，能如是擁護善男女等，吾亦告梵王帝釋，令衛護汝。」",
        "translation": "If you and Yama can thus protect good men and women, I'll also tell Brahmā Indra to guard you.\"",
        "source": "T13n0412_002:0785b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，會中有一鬼王，名曰主命，白佛言：「世尊！",
        "translation": "When he spoke these words, a demon king named Lord Life appeared in the assembly and said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0785b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我本業緣，主閻浮人命，生時死時，我皆主之。",
        "translation": "As the original object of my karma, I preside over the lives of Jambudvīpa people when they're born and when they die.",
        "source": "T13n0412_002:0785b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在我本願，甚欲利益。",
        "translation": "In my original vow, I wanted so badly to benefit them.",
        "source": "T13n0412_002:0785b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自是眾生，不會我意，致令生死，俱不得安。",
        "translation": "Because sentient beings don't conform to my wishes, birth and death are not at all peaceful.",
        "source": "T13n0412_002:0785b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T13n0412_002:0785b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是閻浮提人，初生之時，不問男女，或欲生時，但作善事，增益舍宅。",
        "translation": "\"This is a person in Jambudvīpa who, when he's first born, doesn't ask about male or female, and when he wants to be born, does good works to build a house.",
        "source": "T13n0412_002:0785b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自令土地無量歡喜，擁護子母，得大安樂，利益眷屬。",
        "translation": "They cause the land to rejoice immeasurably, embrace their children and mothers, attain great happiness, and benefit their retinue.",
        "source": "T13n0412_002:0785b16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或已生下，慎勿殺害，取諸鮮味，供給產母。",
        "translation": "Even after birth, he'll be careful not to kill or injure her, and he'll gather fresh foods to offer to the mother.",
        "source": "T13n0412_002:0785b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及廣聚眷屬，飲酒食肉，歌樂絃管，能令子母，不得安樂。",
        "translation": "They gather a large retinue, drinking wine and meat, and singing and playing music, which can prevent their children's mothers from being comfortable.",
        "source": "T13n0412_002:0785b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T13n0412_002:0785b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是產難時，有無數惡鬼，及魍魎精魅，欲食腥血。",
        "translation": "During this difficult time of childbirth, there are countless evil spirits and ghouls and spirits that want to eat fishy blood.",
        "source": "T13n0412_002:0785b20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我早令舍宅土地靈祇，荷護子母，使令安樂，而得利益。",
        "translation": "I've long since caused the spirits of the land of my abode to protect my children and their mothers, making them comfortable and bringing benefit.",
        "source": "T13n0412_002:0785b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之人，見安樂故，便合設福，答諸土地。",
        "translation": "Such a person sees well-being and then combines it with good fortune to repay the land.",
        "source": "T13n0412_002:0785b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "翻為殺害，集聚眷屬，以是之故，犯殃自受，子母俱損。",
        "translation": "Instead, he kills and gathers his retinue; as a result, he suffers the consequences of his offense and his children and mother are both harmed.",
        "source": "T13n0412_002:0785b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又閻浮提臨命終人，不問善惡，我欲令是命終之人，不落惡道，何況自修善根，增我力故。",
        "translation": "\"Furthermore, when a person in Jambudvīpa approaches the end of his life, he doesn't ask about good and bad, and I want to make sure that person at the end of his life doesn't fall into a bad path, not to mention cultivating good roots on his own that will increase my strength.",
        "source": "T13n0412_002:0785b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是閻浮提行善之人，臨命終時，亦有百千惡道鬼神，或變作父母，乃至諸眷屬，引接亡人，令落惡道，何況本造惡者？",
        "translation": "When a person in Jambudvīpa who has done good deeds approaches the end of his life, a hundred thousand ghosts of bad destinies or spirits may transform into parents or even dependents to lead the deceased into a bad destiny, so why wouldn't they do so if they had originally done evil?",
        "source": "T13n0412_002:0785b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T13n0412_002:0785c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是閻浮提男子女人，臨命終時，神識惛昧，不辯善惡，乃至眼耳，更無見聞。",
        "translation": "\"Thus, when a man or woman in Jambudvīpa reaches the end of his or her life, his or her consciousness is dulled, and he or she doesn't discern good from evil; even his or her eyes and ears are unable to see or hear.",
        "source": "T13n0412_002:0785c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眷屬，當須設大供養，轉讀尊經，念佛菩薩名號。",
        "translation": "These retinues should make great offerings, read the venerable sūtras, and recite the names of the buddhas and bodhisattvas.",
        "source": "T13n0412_002:0785c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是善緣，能令亡者，離諸惡道，諸魔鬼神，悉皆退散。",
        "translation": "Such good causes will enable the deceased to escape bad destinies, and demons and spirits will all retreat.",
        "source": "T13n0412_002:0785c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0412_002:0785c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生臨命終時，若得聞一佛名、一菩薩名，或大乘經典一句一偈，我觀如是輩人，除五無間殺害之罪，小小惡業，合墮惡趣者，尋即解脫。」",
        "translation": "When all sentient beings are about to die, if they hear the name of a single Buddha or a single bodhisattva or a single verse from a great vehicle scripture, I'll observe that such a group of people will be freed from the five heinous crimes of killing and injuring and from the minor bad karma that leads to falling into a bad destiny.\"",
        "source": "T13n0412_002:0785c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告主命鬼王：「汝大慈故，能發如是大願，於生死中，護諸眾生。",
        "translation": "The Buddha addressed the chief demon king, \"Because of your great compassion, you were able to make this great vow to protect sentient beings during birth-and-death.",
        "source": "T13n0412_002:0785c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世中，有男子女人，至生死時，汝莫退是願，總令解脫，永得安樂。」",
        "translation": "If there will be men and women in future lives who will reach birth and death, don't give up this vow, for you will always cause their liberation and permanent happiness.\"",
        "source": "T13n0412_002:0785c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼王白佛言：「願不有慮，我畢是形，念念擁護閻浮眾生，生時死時，俱得安樂。",
        "translation": "The demon king said to the Buddha, \"May there be no concern that after I take this form, I'll be mindful of protecting sentient beings in Jambudvīpa and attain well-being during birth and death.",
        "source": "T13n0412_002:0785c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但願諸眾生，於生死時，信受我語，無不解脫，獲大利益。」",
        "translation": "May all sentient beings, when they are born and die, believe and accept my words, and none of them will be liberated and receive great benefit.\"",
        "source": "T13n0412_002:0785c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告地藏菩薩：「是大鬼王主命者，已曾經百千生，作大鬼王，於生死中，擁護眾生。",
        "translation": "It was then that the Buddha addressed Kṣitigarbha Bodhisattva, \"This is a great demon king whose lord of life has been a great demon king for a hundred thousand lifetimes and who protects sentient beings during birth-and-death.",
        "source": "T13n0412_002:0785c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大士，慈悲願故，現大鬼身，實非鬼也。",
        "translation": "That great man, because of his compassionate vow, manifested the body of a great ghost that really wasn't a ghost.",
        "source": "T13n0412_002:0785c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "却後過一百七十劫，當得成佛，號曰無相如來。",
        "translation": "After he passes through one hundred and seventy eons, he'll become a buddha and be called the formless tathāgata.",
        "source": "T13n0412_002:0785c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劫名安樂，世界名淨住。",
        "translation": "The eons will be called peaceful and pleasant, and the world will be called a pure abode.",
        "source": "T13n0412_002:0785c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛壽命，不可計劫。",
        "translation": "Their buddha's lifespan can't be counted for an eon.",
        "source": "T13n0412_002:0785c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏！",
        "translation": "Kṣitigarbha!",
        "source": "T13n0412_002:0785c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大鬼王，其事如是，不可思議，所度天人，亦不可限量。」",
        "translation": "This is a great demon king whose works are thus unfathomable, and the gods and humans he has saved are also unlimited.\"",
        "source": "T13n0412_002:0785c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱佛名號品第九",
        "translation": "The Ninth Chapter of Calling the Buddha by His Name",
        "source": "T13n0412_002:0785c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，地藏菩薩摩訶薩白佛言：「世尊！",
        "translation": "At that point, Kṣitigarbha Bodhisattva Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0785c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今為未來眾生，演利益事，於生死中，得大利益。",
        "translation": "Now, I'll explain something beneficial for future sentient beings that will be of great benefit in birth-and-death.",
        "source": "T13n0412_002:0785c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，聽我說之。」",
        "translation": "Please let the Bhagavān hear me teach them.\"",
        "source": "T13n0412_002:0785c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告地藏菩薩：「汝今欲興慈悲，救拔一切罪苦六道眾生，演不思議事，今正是時，唯當速說。",
        "translation": "The Buddha told Kṣitigarbha Bodhisattva, \"Now, if you want to show compassion and save all the sentient beings in the six destinies who suffer from sins and perform inconceivable tasks, now is the right time, so you must quickly explain them.",
        "source": "T13n0412_002:0785c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾即涅槃，使汝早畢是願，吾亦無憂現在未來一切眾生。」",
        "translation": "I will soon nirvāṇa, so that you will fulfill this vow as soon as possible, and I will have no worries about all sentient beings in the present and future.\"",
        "source": "T13n0412_002:0785c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏菩薩白佛言：「世尊！",
        "translation": "Kṣitigarbha Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0785c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去無量阿僧祇劫，有佛出世，號無邊身如來。",
        "translation": "In the past, there was a Buddha who appeared in the world, called the Infinite Body Tathāgata, for measureless incalculably long eons.",
        "source": "T13n0412_002:0785c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，暫生恭敬，即得超越四十劫生死重罪。",
        "translation": "If a man or woman hears this Buddha's name and venerates it for a moment, they'll be able to transcend the heavy transgression of forty eons of birth-and-death.",
        "source": "T13n0412_002:0786a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況塑畫形像、供養讚歎？",
        "translation": "How could it be possible to sculpt an image, offer it up for praise?",
        "source": "T13n0412_002:0786a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人獲福，無量無邊。",
        "translation": "The merits that person obtains are measureless and limitless.",
        "source": "T13n0412_002:0786a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於過去恒河沙劫，有佛出世，號寶性如來。",
        "translation": "\"Also, in a past eon vast in number of sands, a Buddha appeared in the world called the Jewel Nature Tathāgata.",
        "source": "T13n0412_002:0786a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，一彈指頃，發心歸依，是人於無上道，永不退轉。",
        "translation": "If a man or woman hears the name of this Buddha and within a snap of a finger makes up their mind to rely on him, that person will never turn back from the unsurpassed path.",
        "source": "T13n0412_002:0786a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於過去，有佛出世，號波頭摩勝如來。",
        "translation": "Also, in the past, there was a Buddha who appeared in the world and was called Bodhidharma-samyak-saṃbhava Tathāgata.",
        "source": "T13n0412_002:0786a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，歷於耳根，是人當得千返生於六欲天中，何況志心稱念？",
        "translation": "If a man or woman hears this Buddha's name and hears it in their auditory faculty, that person will be reborn among the six heavens of desire in a thousand rebirths, so why would they want to be mindful of it?",
        "source": "T13n0412_002:0786a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於過去不可說不可說阿僧祇劫，有佛出世，號師子吼如來。",
        "translation": "\"Also in an inexplicable and ineffable eon in the past, a Buddha appeared in the world called the Shizi-ho Tathāgata.",
        "source": "T13n0412_002:0786a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，一念歸依，是人得遇無量諸佛，摩頂授記。",
        "translation": "If a man or woman hears the name of that Buddha and instantly relies on it, that person will meet measureless buddhas who will give them their heads and give them their assurances.",
        "source": "T13n0412_002:0786a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於過去，有佛出世，號拘留孫佛。",
        "translation": "Also in the past, there was a Buddha who appeared in the world named Kauśāmbī.",
        "source": "T13n0412_002:0786a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，志心瞻禮，或復讚歎，是人於賢劫千佛會中，為大梵王，得授上記。",
        "translation": "If a man or woman hears the Buddha's name and wholeheartedly venerates or praises him, that person will become a great brahma king in the assembly of a thousand buddhas of the good eon and will be granted superior assurance of Buddhahood.",
        "source": "T13n0412_002:0786a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於過去，有佛出世，號毘婆尸。",
        "translation": "\"Also in the past, there was a Buddha who appeared in the world and was called Vipaśyin.",
        "source": "T13n0412_002:0786a16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，永不墮惡道，常生人天，受勝妙樂。",
        "translation": "If a man or woman hears this Buddha's name, they'll never fall into a bad path, and they'll always be born in a heaven and experience wonderful happiness.",
        "source": "T13n0412_002:0786a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於過去無量無數恒河沙劫，有佛出世，號寶勝如來。",
        "translation": "\"Also, in the past, there was a Buddha who appeared in the world, who was called the Jeweled Tathāgata, in measureless and incalculable eons.",
        "source": "T13n0412_002:0786a18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，畢竟不墮惡道，常在天上，受勝妙樂。",
        "translation": "If there are men and women who hear this Buddha's name, they will never fall into a bad path after all, and they'll always be up in the heavens, enjoying wonderful, marvelous happiness.",
        "source": "T13n0412_002:0786a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於過去，有佛出世，號寶相如來。",
        "translation": "\"Also in the past, there was a Buddha who appeared in the world and was called the Tathāgata of Jeweled Appearance.",
        "source": "T13n0412_002:0786a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名，生恭敬心，是人不久，得阿羅漢果。",
        "translation": "If a man or woman hears the name of this Buddha and becomes respectful, that person will soon attain the fruit of the arhat.",
        "source": "T13n0412_002:0786a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於過去，無量阿僧祇劫，有佛出世，號袈裟幢如來。",
        "translation": "\"Also, in the past, there was a Buddha who appeared in the world, called the Rāṣṭrapāla Tathāgata, during an incalculably long eon.",
        "source": "T13n0412_002:0786a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名者，超一百大劫生死之罪。",
        "translation": "If a man or woman hears this Buddha's name, it will transcend the transgression of birth-and-death for a hundred great eons.",
        "source": "T13n0412_002:0786a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於過去，有佛出世，號大通山王如來。",
        "translation": "\"Also in the past, there was a Buddha who appeared in the world and was called the Tathāgata Ratnaketu Tathāgata.",
        "source": "T13n0412_002:0786a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有男子女人，聞是佛名者，是人得遇恒河沙佛，廣為說法，必成菩提。",
        "translation": "If a man or woman hears the name of this Buddha, they'll meet one of the buddhas of the Ganges River who will preach extensively and surely achieve enlightenment.",
        "source": "T13n0412_002:0786a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於過去，有淨月佛、山王佛、智勝佛、淨名王佛、智成就佛、無上佛、妙聲佛、滿月佛、月面佛，有如是等不可說佛。",
        "translation": "In the past, there was the Pure Moon Buddha, the Mountain King Buddha, the Buddha of Wisdom, the King of Pure Names Buddha, the Buddha of Wisdom Accomplishment, the Supreme Buddha, the Buddha of Marvelous Sound, the Full Moon Buddha, the Moon-Faced Buddha, and such ineffable buddhas.",
        "source": "T13n0412_002:0786a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T13n0412_002:0786b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在未來一切眾生，若天若人，若男若女，但念得一佛名號，功德無量，何況多名？",
        "translation": "Now, for all sentient beings in the future, whether gods or humans, men or women, simply reciting the name of a single Buddha will have immeasurable merit, so why not multiple ones?",
        "source": "T13n0412_002:0786b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是眾生等，生時死時，自得大利，終不墮惡道。",
        "translation": "When they are born, these sentient beings will attain great rewards for themselves when they die, and they will never fall into a bad path.",
        "source": "T13n0412_002:0786b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有臨命終人，家中眷屬，乃至一人，為是病人，高聲念一佛名，是命終人，除五無間罪，餘業報等，悉得銷滅。",
        "translation": "If a person nearing the end of his life has a family member or even one person who recites the name of a single Buddha aloud for this patient, then except for the five unremitting sins, the rest of the results of karma and so forth will all perish when his life ends.",
        "source": "T13n0412_002:0786b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是五無間罪，雖至極重，動經億劫，了不得出，承斯臨命終時，他人為其稱念佛名，於是罪中亦漸銷滅。",
        "translation": "Although these five heinous sins are extremely serious and move through hundreds of millions of eons, they can't be escaped, but when he meets his end of life, another person calls out the Buddha's name for him, and that sin is gradually extinguished.",
        "source": "T13n0412_002:0786b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況眾生，自稱自念，獲福無量，滅無量罪。」",
        "translation": "How could it be that sentient beings who call themselves mindful of the Buddha's name will attain measureless merit and cease measureless sins?\"",
        "source": "T13n0412_002:0786b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "校量布施功德緣品第十",
        "translation": "Tenth Chapter of the Chapter on the Meritorious Conditions for Evaluating Measurements of Almsgiving",
        "source": "T13n0412_002:0786b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，地藏菩薩摩訶薩承佛威神，從座而起，胡跪合掌，白佛言：「世尊！",
        "translation": "At that point, Kṣitigarbha Bodhisattva Mahāsattva, in response to the Buddha's authoritative power, rose from his seat, knelt down with his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0786b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我觀業道眾生，校量布施，有輕有重：有一生受福，有十生受福，有百生千生受大福利者。",
        "translation": "\"I've observed that when sentient beings in the path of karma give generosity in measured amounts, there's something light and something heavy: there's one life that's blessed, ten lives that's blessed, and a hundred lives and a thousand lives that receive great benefit.",
        "source": "T13n0412_002:0786b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事云何？",
        "translation": "What's this?",
        "source": "T13n0412_002:0786b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，為我說之。」",
        "translation": "Please let the Bhagavān explain this for me.\"",
        "source": "T13n0412_002:0786b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告地藏菩薩：「吾今於忉利天宮，一切眾會，說閻浮提布施，校量功德輕重。",
        "translation": "It was then that the Buddha addressed Kṣitigarbha Bodhisattva, \"Now, I'm going to explain the relative seriousness of Jambudvīpa's almsgiving in the palace of the Heaven of Thirty-three, where all the people gather, and I'll measure its merits.",
        "source": "T13n0412_002:0786b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當諦聽，吾為汝說。」",
        "translation": "You must listen closely as I explain it for you.\"",
        "source": "T13n0412_002:0786b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏白佛言：「我疑是事，願樂欲聞。」",
        "translation": "Kṣitigarbha said to the Buddha, \"I've had my doubts about this, and I'd like to hear about it.\"",
        "source": "T13n0412_002:0786b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告地藏菩薩：「南閻浮提，有諸國王、宰輔大臣、大長者、大剎利、大婆羅門等，若遇最下貧窮，乃至癃殘瘖瘂，聾癡無目，如是種種不完具者。",
        "translation": "The Buddha told Kṣitigarbha Bodhisattva, \"In Southern Jambudvīpa, there are great kings, rulers, ministers, great elders, bhadras, and great brāhmaṇas who encounter the lowest of the poor, are physically handicapped, deaf, dumb, and blind, or who are not completely equipped in this way.",
        "source": "T13n0412_002:0786b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大國王等，欲布施時，若能具大慈悲，下心含笑，親手遍布施，或使人施，軟言慰喻。",
        "translation": "When they want to make a gift, suppose these great kings were to have great compassion, smile with their hearts, and personally distribute it throughout their lives or cause others to give it, speaking softly and reassuringly.",
        "source": "T13n0412_002:0786b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是國王等，所獲福利，如布施百恒河沙佛功德之利。",
        "translation": "Such a king or king would receive benefits like the benefits of giving the merits of a hundred Ganges River Buddhas.",
        "source": "T13n0412_002:0786b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0412_002:0786b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣是國王等，於是最貧賤輩，及不完具者，發大慈心，是故福利，有如此報：百千生中，常得七寶具足，何況衣食受用？",
        "translation": "It's because of this that the king and the others showed great kindness to the poorest and least endowed of people, and this is the reason for their welfare: In a hundred thousand lifetimes, they'll always have an abundance of the seven treasures, not to mention clothing, food, and shelter.",
        "source": "T13n0412_002:0786b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Again, Kṣitigarbha!",
        "source": "T13n0412_002:0786b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有諸國王，至婆羅門等，遇佛塔寺，或佛形像，乃至菩薩、聲聞、辟支佛像，躬自營辦，供養布施。",
        "translation": "\"If there will be kings of countries in the future who go to a brāhmaṇa or other place and come across a stūpa or a buddha image, or an image of a bodhisattva, śrāvaka, or pratyekabuddha, they'll build it themselves and make offerings to it.",
        "source": "T13n0412_002:0786b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是國王等，當得三劫為帝釋身，受勝妙樂。",
        "translation": "Those kings will then attain three eons as Indra's body and experience marvelous happiness.",
        "source": "T13n0412_002:0786c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能以此布施福利，迴向法界，是大國王等，於十劫中，常為大梵天王。",
        "translation": "If they can thus dedicate the benefits of their almsgiving to the Dharma realm, these great kings will always be great brahma kings throughout the ten eons.",
        "source": "T13n0412_002:0786c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0786c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有諸國王，至婆羅門等，遇先佛塔廟，或至經像，毀壞破落，乃能發心修補。",
        "translation": "\"Suppose there are future kings of countries that go to a brāhmaṇa or other place where a stūpa or sūtra of a previous Buddha has been damaged or fallen down, and then they're able to make a resolution to repair it.",
        "source": "T13n0412_002:0786c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是國王等，或自營辦，或勸他人，乃至百千人等，布施結緣。",
        "translation": "Such a king might operate it himself, encourage others to do so, or cause hundreds of thousands of people to make alms.",
        "source": "T13n0412_002:0786c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是國王等，百千生中，常為轉輪王身。",
        "translation": "For a hundred thousand lifetimes, these kings will always be wheel-turning kings.",
        "source": "T13n0412_002:0786c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是他人同布施者，百千生中，常為小國王身。",
        "translation": "Thus, when others give alms together, they'll always be the body of a minor king for a hundred thousand lifetimes.",
        "source": "T13n0412_002:0786c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更能於塔廟前，發迴向心，如是國王，乃及諸人，盡成佛道，以此果報，無量無邊。",
        "translation": "If they can also give the intention to turn around in front of a stūpa, then such a king and all of his people will attain the Buddha Way, and the rewards of that will be measureless and limitless.",
        "source": "T13n0412_002:0786c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0786c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，有諸國王，及婆羅門等，見諸老病，及生產婦女，若一念間，具大慈心，布施醫藥、飲食、臥具，使令安樂。",
        "translation": "In a future life, there will be kings and brāhmaṇas who see old people, sick people, and women in labor and who, with a moment's thought, have great compassion and give medicine, food, and bedding to make them comfortable.",
        "source": "T13n0412_002:0786c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是福利，最不思議：一百劫中，常為淨居天主；二百劫中，常為六欲天主；畢竟成佛，永不墮惡道，乃至百千生中，耳不聞苦聲。",
        "translation": "Such benefits are most inconceivable: for a hundred eons, they'll always be the lord of the Pure Land gods; for 200 eons, they'll always be the lord of the six heavens of desire; after eventually becoming a buddha, they'll never fall into a bad path, and for a hundred thousand lifetimes, their ears won't hear the sound of suffering.",
        "source": "T13n0412_002:0786c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0786c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世中，有諸國王，及婆羅門等，能作如是布施，獲福無量，更能迴向，不問多少，畢竟成佛，何況釋梵轉輪之報？",
        "translation": "If there will be kings and brāhmaṇas in future generations who are able to make such an offering, they will receive immeasurable merit and will be able to dedicate themselves to the cause, regardless of how much, and eventually become buddhas, not to mention the rewards of the turning wheel of Brahmā and Śakra.",
        "source": "T13n0412_002:0786c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，地藏！",
        "translation": "Therefore, Kṣitigarbha!",
        "source": "T13n0412_002:0786c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普勸眾生，當如是學。",
        "translation": "All sentient beings are encouraged to train in this way.",
        "source": "T13n0412_002:0786c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0786c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若善男子、善女人，於佛法中，種少善根，毛髮沙塵等許，所受福利，不可為喻。",
        "translation": "In future lives, if good men and good women plant a few good roots in the Buddha's teaching, such as a little bit of hair, sand, or dust, the benefits they'll receive cannot be described.",
        "source": "T13n0412_002:0786c21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，地藏！",
        "translation": "Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0786c23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若有善男子、善女人，遇佛形像、菩薩形像、辟支佛形像、轉輪王形像，布施供養，得無量福，常在人天，受勝妙樂。",
        "translation": "In future lives, if good men and good women encounter images of buddhas, bodhisattvas, pratyekabuddhas, and wheel-turning kings and make offerings to them, they'll attain measureless merit and will always be among humans and gods, enjoying marvelous happiness.",
        "source": "T13n0412_002:0786c24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向法界，是人福利，不可為喻。",
        "translation": "If someone can dedicate their life to the Dharma realm, their welfare is incomparable.",
        "source": "T13n0412_002:0786c26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0786c27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若有善男子、善女人，遇大乘經典，或聽聞一偈一句，發殷重心，讚歎恭敬，布施供養。",
        "translation": "\"In the future, if there are good men and good women who encounter a great vehicle sūtra or hear a single verse or sentence, arouse their hearts, praise and respect it, and make offerings to it, that person will attain great rewards that have no limit.",
        "source": "T13n0412_002:0786c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人獲大果報，無量無邊。",
        "translation": "That person will attain a great result that's immeasurable and limitless.",
        "source": "T13n0412_002:0787a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向法界，其福不可為喻。",
        "translation": "If he or she can dedicate themselves to the Dharma realm, their merit is inexpressible.",
        "source": "T13n0412_002:0787a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0787a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世中，有善男子、善女人，遇佛塔寺、大乘經典新者，布施供養，瞻禮讚歎，恭敬合掌；若遇故者或毀壞者，修補營理，或獨發心，或勸多人同共發心。",
        "translation": "\"If there will be good men and good women in future generations who encounter a new stūpa or temple or a great vehicle sūtra, make offerings, venerate and praise it, and join their palms in respect, or if they encounter one that's deceased or damaged, repair and maintain it, either by themselves or by encouraging many others to share that intention.",
        "source": "T13n0412_002:0787a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等輩，三十生中，常為諸小國王。",
        "translation": "Such a group will always be the kings of small states during their 30 lifetimes.",
        "source": "T13n0412_002:0787a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "檀越之人，常為輪王，還以善法，教化諸小國王。",
        "translation": "Those who are transgressors will always be wheel-turning kings and will teach the kings of small states the good Dharma.",
        "source": "T13n0412_002:0787a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0787a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若有善男子、善女人，於佛法中，所種善根，或布施供養，或修補塔寺，或裝理經典，乃至一毛一塵，一沙一渧。",
        "translation": "\"In the future, if there are good men and good women who plant good roots in the Buddha's teaching, whether by making alms and offerings, by building stūpas and temples, or by decorating sūtras, even down to a hair or a speck of dust or a grain of sand.",
        "source": "T13n0412_002:0787a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是善事，但能迴向法界，是人功德，百千生中，受上妙樂。",
        "translation": "Such good deeds that are simply directed back to the Dharma realm will merit that person to experience the highest and most wonderful happiness in a hundred thousand lifetimes.",
        "source": "T13n0412_002:0787a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如但迴向自家眷屬，或自身利益，如是之果，即三生受樂，捨一得萬報。",
        "translation": "If someone simply dedicates their merits to their family members or to their own benefit, such a result will be the enjoyment of three lifetimes and the attainment of ten thousand rewards for abandoning one.",
        "source": "T13n0412_002:0787a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，地藏！",
        "translation": "Therefore, Kṣitigarbha!",
        "source": "T13n0412_002:0787a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施因緣，其事如是。」",
        "translation": "It's like this when it comes to the causes and conditions of generosity.\"",
        "source": "T13n0412_002:0787a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地神護法品第十一",
        "translation": "The Eleventh Chapter of the Earth Spirit's Protection of the Dharma",
        "source": "T13n0412_002:0787a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，堅牢地神白佛言：「世尊！",
        "translation": "It was then that the Pṛthivī god Kālôdayin said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0787a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從昔來，瞻視頂禮無量菩薩摩訶薩，皆是大不可思議神通智慧，廣度眾生。",
        "translation": "Since the distant past, I've looked up and venerated measureless bodhisattvas and mahāsattvas, all of whom have unfathomable superknowledge and have extensively liberated sentient beings.",
        "source": "T13n0412_002:0787a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是地藏菩薩摩訶薩，於諸菩薩，誓願深重。",
        "translation": "This is Kṣitigarbha Bodhisattva Mahāsattva, among other bodhisattvas, who has made a profound vow.",
        "source": "T13n0412_002:0787a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0412_002:0787a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是地藏菩薩，於閻浮提，有大因緣。",
        "translation": "\"This is Kṣitigarbha Bodhisattva, who has great causes and conditions in Jambudvīpa.",
        "source": "T13n0412_002:0787a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如文殊、普賢、觀音、彌勒，亦化百千身形，度於六道，其願尚有畢竟。",
        "translation": "Like Mañjuśrī, Samantabhadra, Avalokitêśvara, and Maitreya, they also take on hundreds of thousands of bodies to save sentient beings in the six destinies, but their vows have yet to be completed.",
        "source": "T13n0412_002:0787a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是地藏菩薩，教化六道一切眾生，所發誓願劫數，如千百億恒河沙。",
        "translation": "This is Kṣitigarbha Bodhisattva, who teaches all sentient beings in the six destinies and makes vows for eons as numerous as the tens of billions of sands of the Ganges.",
        "source": "T13n0412_002:0787a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T13n0412_002:0787a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我觀未來及現在眾生，於所住處，於南方清潔之地，以土石竹木，作其龕室。",
        "translation": "\"I've observed future and present sentient beings living in a clean place to the south, making a niche of dirt, stone, bamboo, and wood.",
        "source": "T13n0412_002:0787a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中能塑畫，乃至金銀銅鐵，作地藏形像，燒香供養，瞻禮讚歎。",
        "translation": "In it, they can paint or sculpt an image of Kṣitigarbha made of gold, silver, bronze, and metal, burn incense, make offerings, and venerate and praise him.",
        "source": "T13n0412_002:0787a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人居處，即得十種利益。",
        "translation": "That person's abode will obtain ten kinds of benefits.",
        "source": "T13n0412_002:0787a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0412_002:0787a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者，土地豐壤。",
        "translation": "One, the land is rich in soil.",
        "source": "T13n0412_002:0787a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者，家宅永安。",
        "translation": "Two, his family's home will be permanently secure.",
        "source": "T13n0412_002:0787a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者，先亡生天。",
        "translation": "Three, the deceased will be born in heaven.",
        "source": "T13n0412_002:0787a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者，現存益壽。",
        "translation": "Four, their present existence will improve their longevity.",
        "source": "T13n0412_002:0787a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者，所求遂意。",
        "translation": "Five, their desires will be fulfilled.",
        "source": "T13n0412_002:0787a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者，無水火災。",
        "translation": "Six, there'll be no disasters from flood or fire.",
        "source": "T13n0412_002:0787a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者，虛耗辟除。",
        "translation": "Seven, wasted energy will be prevented.",
        "source": "T13n0412_002:0787a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者，杜絕惡夢。",
        "translation": "Eight, he'll stop bad dreams.",
        "source": "T13n0412_002:0787b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者，出入神護。",
        "translation": "Nine, the spirits will protect him when he enters and leaves.",
        "source": "T13n0412_002:0787b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者，多遇聖因。",
        "translation": "Ten, they'll often encounter noble causes.",
        "source": "T13n0412_002:0787b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T13n0412_002:0787b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，及現在眾生，若能於所住處方面，作如是供養，得如是利益。」",
        "translation": "In future lives and among sentient beings in the present, if they can make such offerings with respect to the place where they live, they'll obtain such benefits.\"",
        "source": "T13n0412_002:0787b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白佛言：「世尊！",
        "translation": "Again, he said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0787b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若有善男子、善女人，於所住處，有此經典及菩薩像，是人更能轉讀經典，供養菩薩。",
        "translation": "In a future life, if there's a good man or woman who has this sūtra and image of the bodhisattva where he or she lives, that person will be able to read the sūtra again and make offerings to the bodhisattva.",
        "source": "T13n0412_002:0787b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常日夜，以本神力，衛護是人，乃至水火盜賊，大橫小橫，一切惡事，悉皆銷滅。」",
        "translation": "Day and night, I'll guard that person with my original spiritual powers, even in the case of floods, fires, thieves, great and small acts, and all other bad deeds, and they'll all go away.\"",
        "source": "T13n0412_002:0787b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告堅牢地神：「汝大神力，諸神少及。",
        "translation": "The Buddha told the Pṛthivī god, \"Your great spiritual power is unmatched by that of other gods.",
        "source": "T13n0412_002:0787b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0412_002:0787b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮土地，悉蒙汝護。",
        "translation": "You protect all of the land of Jambudvīpa.",
        "source": "T13n0412_002:0787b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至草木沙石，稻麻竹葦，穀米寶貝，從地而有，皆因汝力。",
        "translation": "Even grass, trees, sand, rocks, rice, flax, bamboo, reeds, and precious grains and shells that come from the earth all exist because of your power.",
        "source": "T13n0412_002:0787b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又常稱揚地藏菩薩利益之事，汝之功德，及以神通，百千倍於常分。",
        "translation": "You always praise the benefits of Kṣitigarbha Bodhisattva, and your merits and supernormal powers are a hundred thousand times greater than the usual portion.",
        "source": "T13n0412_002:0787b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地神！",
        "translation": "Earth spirit!",
        "source": "T13n0412_002:0787b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世中，有善男子、善女人，供養菩薩，及轉讀是經，但依地藏本願經一事修行者，汝以本神力，而擁護之。",
        "translation": "\"If there will be good men and good women in future generations who make offerings to the bodhisattva and turn to read this sūtra, but who simply cultivate the practice of one thing based on the Sutra of the Original Vows of Kṣitigarbha, you will safeguard them with your original spiritual power.",
        "source": "T13n0412_002:0787b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿令一切災害，及不如意事，輒聞於耳，何況令受？",
        "translation": "Don't allow all calamities and unsatisfactory events to be heard so easily in your ears, so why would you allow them to be experienced?",
        "source": "T13n0412_002:0787b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但汝獨護是人故，亦有釋梵眷屬、諸天眷屬，擁護是人。",
        "translation": "Not only do you alone protect this person, but there are members of Brahmā's retinue and members of the celestials who also protect this person.",
        "source": "T13n0412_002:0787b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故得如是聖賢擁護？",
        "translation": "Why is it that you're supported by such noble men?",
        "source": "T13n0412_002:0787b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆由瞻禮地藏形像，及轉讀是本願經故。",
        "translation": "It's all because they've venerated the image of Earth-Store and read this scripture of the original vows.",
        "source": "T13n0412_002:0787b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自然畢竟出離苦海，證涅槃樂。",
        "translation": "Naturally, they eventually escape the ocean of suffering and realize the bliss of nirvāṇa.",
        "source": "T13n0412_002:0787b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之故，得大擁護。」",
        "translation": "Because of this, they attain great protection.\"",
        "source": "T13n0412_002:0787b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見聞利益品第十二",
        "translation": "Chapter 12 of the Benefits of Seeing and Hearing",
        "source": "T13n0412_002:0787b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊從頂門上，放百千萬億大毫相光——所謂白毫相光、大白毫相光、瑞毫相光、大瑞毫相光、玉毫相光、大玉毫相光、紫毫相光、大紫毫相光、青毫相光、大青毫相光、碧毫相光、大碧毫相光、紅毫相光、大紅毫相光、綠毫相光、大綠毫相光、金毫相光、大金毫相光、慶雲毫相光、大慶雲毫相光、千輪毫光、大千輪毫光、寶輪毫光、大寶輪毫光、日輪毫光、大日輪毫光、月輪毫光、大月輪毫光、宮殿毫光、大宮殿毫光、海雲毫光、大海雲毫光。",
        "translation": "爾時，世尊從頂門上，放百千萬億大毫相光——所謂白毫相光、大白毫相光、瑞毫相光、大瑞毫相光、玉毫相光、大玉毫相光、紫毫相光、大紫毫相光、青毫相光、大青毫相光、碧毫相光、大碧毫相光、紅毫相光、大紅毫相光、綠毫相光、大綠毫相光、金毫相光、大金毫相光、慶雲毫相光、大慶雲毫相光、千輪毫光、大千輪毫光、寶輪毫光、大寶輪毫光、日輪毫光、大日輪毫光、月輪毫光、大月輪毫光、宮殿毫光、大宮殿毫光、海雲毫光、大海雲毫光。",
        "source": "T13n0412_002:0787b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於頂門上，放如是等毫相光已，出微妙音，告諸大眾、天龍八部、人、非人等：「聽吾今日於忉利天宮稱揚讚歎地藏菩薩於人天中利益等事、不思議事、超聖因事、證十地事、畢竟不退阿耨多羅三藐三菩提事。」",
        "translation": "After emitting these hairs of light from the top of his head, he emitted a subtle voice that addressed the great crowd, the eight groups of gods and dragons, humans and nonhumans, saying, \"Today, I've been praising and commending Kṣitigarbha Bodhisattva in the palace of the Heaven of Thirty-three for the benefits among humans and gods, the inconceivable things, the transcendent holy causes, the realization of the tenth ground, and the ultimate nonretrogression from the unsurpassed, correct, and complete enlightenment.\"",
        "source": "T13n0412_002:0787c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，會中有一菩薩摩訶薩，名觀世音，從座而起，胡跪合掌，白佛言：「世尊！",
        "translation": "When he spoke these words, a bodhisattva named Avalokitêśvara rose from his seat, knelt down with his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0787c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是地藏菩薩摩訶薩，具大慈悲，憐愍罪苦眾生，於千萬億世界，化千萬億身。",
        "translation": "\"This is Kṣitigarbha Bodhisattva Mahāsattva, who possesses great compassion, pities sentient beings who suffer from sins, and transforms a thousand trillion bodies in a thousand trillion worlds.",
        "source": "T13n0412_002:0787c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有功德，及不思議威神之力，我聞世尊與十方無量諸佛，異口同音，讚歎地藏菩薩云：正使過去現在未來諸佛，說其功德，猶不能盡。",
        "translation": "With all of his merits and inconceivable authoritative power, I've heard the Bhagavān and measureless buddhas in the ten directions speak with one voice in praise of Kṣitigarbha Bodhisattva, saying, \"Even though the buddhas of the past, present, and future have described his merits, they still can't exhaust them.",
        "source": "T13n0412_002:0787c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "向者，又蒙世尊普告大眾，欲稱揚地藏利益等事。",
        "translation": "I've also heard the Bhagavān universally tell the public that he wants to praise the benefits of Kṣitigarbha.",
        "source": "T13n0412_002:0787c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，為現在未來一切眾生，稱揚地藏不思議事，令天龍八部，瞻禮獲福。」",
        "translation": "Please let the Bhagavān praise the inconceivable works of Kṣitigarbha for all sentient beings in the present and future, so that gods, dragons, and the eight groups will venerate them and obtain their merit.\"",
        "source": "T13n0412_002:0787c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告觀世音菩薩：「汝於娑婆世界，有大因緣。",
        "translation": "The Buddha told Avalokitêśvara Bodhisattva, \"In the Saha world, you have great causes and conditions.",
        "source": "T13n0412_002:0787c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若天若龍、若男若女、若神若鬼，乃至六道罪苦眾生，聞汝名者、見汝形者、戀慕汝者、讚歎汝者，是諸眾生，於無上道，必不退轉，常生人天，具受妙樂，因果將熟，遇佛授記。",
        "translation": "Whether it's gods or dragons, men or women, spirits or ghosts, or even sentient beings in the six destinies who suffer from sins and hear your name, see your form, adore you, or praise you, these sentient beings will surely not turn back from the unsurpassed path, always be born in heaven, fully enjoy marvelous happiness, and meet the Buddha's prediction when the causes and effects are about to ripen.",
        "source": "T13n0412_002:0787c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今具大慈悲，憐愍眾生，及天龍八部，聽吾宣說地藏菩薩不思議利益之事。",
        "translation": "Now, with great compassion, you have pity for sentient beings and the eight groups of gods and dragons, and listen to me as I explain the inconceivable benefits of Kṣitigarbha Bodhisattva.",
        "source": "T13n0412_002:0787c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當諦聽，吾今說之。」",
        "translation": "You must listen closely as I explain them now.\"",
        "source": "T13n0412_002:0787c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀世音言：「唯然，世尊！",
        "translation": "Avalokitêśvara said, \"Yes, Bhagavān!",
        "source": "T13n0412_002:0787c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T13n0412_002:0787c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告觀世音菩薩：「未來現在諸世界中，有天人受天福盡，有五衰相現，或有墮於惡道之者。",
        "translation": "The Buddha told Avalokitêśvara Bodhisattva, \"In the worlds of the future and present, there will be gods and humans who will experience the end of their heavenly merits and the appearance of the five declines, or who will fall into a bad destiny.",
        "source": "T13n0412_002:0787c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是天人，若男若女，當現相時，或見地藏菩薩形像，或聞地藏菩薩名，一瞻一禮，是諸天人，轉增天福，受大快樂，永不墮三惡道報。",
        "translation": "If such a celestial being, whether male or female, sees the image of Kṣitigarbha Bodhisattva when it appears, or hears the name of Kṣitigarbha Bodhisattva and pays homage to him, that celestial being will increase his heavenly fortune, experience great happiness, and never fall into the consequences of the three evil destinies.",
        "source": "T13n0412_002:0787c27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況見聞菩薩，以諸香、華、衣服、飲食、寶貝、瓔珞，布施供養，所獲功德福利，無量無邊。",
        "translation": "How much more so when they see and hear the bodhisattva making offerings of incense, flowers, clothing, food, jewelry, and jewelry, the merits and benefits they attain are measureless and limitless.",
        "source": "T13n0412_002:0788a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀世音！",
        "translation": "\"Furthermore, Avalokitêśvara!",
        "source": "T13n0412_002:0788a03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來現在諸世界中，六道眾生，臨命終時，得聞地藏菩薩名，一聲歷耳根者，是諸眾生，永不歷三惡道苦。",
        "translation": "\"If, in the future and present worlds, sentient beings in the six destinies hear the name of Kṣitigarbha Bodhisattva when their lives are about to end, and one sound reaches their auditory faculty, those sentient beings will never experience the suffering of the three evil destinies.",
        "source": "T13n0412_002:0788a03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況臨命終時，父母眷屬，將是命終人舍宅、財物、寶貝、衣服，塑畫地藏形像。",
        "translation": "What's more, when their life is about to end, their parents and relatives will give them their homes, possessions, treasures, and clothing, and they'll paint an image of Kṣitigarbha.",
        "source": "T13n0412_002:0788a06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或使病人未終之時，眼耳見聞，知道眷屬將舍宅寶貝等，為其自身，塑畫地藏菩薩形像。",
        "translation": "Perhaps when the patient is still alive, his eyes and ears see and hear that his family members have rid him of his home, treasures, and other things and painted an image of Kṣitigarbha Bodhisattva for him.",
        "source": "T13n0412_002:0788a07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人若是業報合受重病者，承斯功德，尋即除愈，壽命增益。",
        "translation": "If this person is seriously ill from the effects of karma, he'll inherit this merit, be healed, and have his life expectancy increased.",
        "source": "T13n0412_002:0788a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人若是業報命盡，應有一切罪障業障，合墮惡趣者，承斯功德，命終之後，即生人天，受勝妙樂，一切罪障，悉皆銷滅。",
        "translation": "If a person's life as a result of karma ends and he has all the hindrances and karmic retribution that coincide with falling into a bad destiny, he'll receive this merit and be born in heaven after his life ends, where he'll experience wonderful happiness and all the hindrances and sins will cease.",
        "source": "T13n0412_002:0788a11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀世音菩薩！",
        "translation": "\"Furthermore, Avalokitêśvara Bodhisattva!",
        "source": "T13n0412_002:0788a14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有男子女人，或乳哺時，或三歲、五歲、十歲已下，亡失父母，乃及亡失兄弟姊妹。",
        "translation": "\"Suppose there will be a man or woman in a future life who loses his or her parents or loses a brother or sister while they're still nursing, or after they're three, five, or ten years old.",
        "source": "T13n0412_002:0788a14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人年既長大，思憶父母，及諸眷屬，不知落在何趣？",
        "translation": "When that person grows older, they think about their parents and their dependents and wonder where they've ended up.",
        "source": "T13n0412_002:0788a16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生何世界？",
        "translation": "What world was it born in?",
        "source": "T13n0412_002:0788a17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生何天中？",
        "translation": "Born among what gods?",
        "source": "T13n0412_002:0788a18_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人若能塑畫地藏菩薩形像，乃至聞名，一瞻一禮，一日至七日，莫退初心，聞名見形，瞻禮供養。",
        "translation": "\"Suppose a person can paint an image of Kṣitigarbha Bodhisattva and even hear its name, examine it and venerate it for one to seven days, without ever retreating from that first thought, he or she hears its name and sees its form, venerates it, and makes offerings.",
        "source": "T13n0412_002:0788a18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人眷屬，假因業故，墮惡趣者，計當劫數，承斯男女兄弟姊妹塑畫地藏形像、瞻禮功德，尋即解脫，生人天中；受勝妙樂者，即承斯功德，轉增聖因，受無量樂。",
        "translation": "That person's family members, assuming they've fallen into a bad destiny because of their actions, will then count the number of eons to come when they inherit the merits of these men, women, brothers, and sisters who paint images of Kṣitigarbha and venerate them, and they'll be liberated and born in the heavens; those who experience wonderful happiness will inherit those merits, which will further increase their holy causes and lead to measureless happiness.",
        "source": "T13n0412_002:0788a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人更能三七日中，一心瞻禮地藏形像，念其名字，滿於萬遍。",
        "translation": "For thirty-one days, that person can wholeheartedly venerate Kṣitigarbha's image and recite its name more than ten thousand times.",
        "source": "T13n0412_002:0788a24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當得菩薩現無邊身，具告是人眷屬生界；或於夢中，菩薩現大神力，親領是人於諸世界，見諸眷屬。",
        "translation": "He'll then be able to have the bodhisattva reveal his limitless body and tell his followers exactly what birth realms they're in, or in a dream, the bodhisattva shows great supernormal powers and personally leads him to see his followers in all the worlds.",
        "source": "T13n0412_002:0788a25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更能每日，念菩薩名千遍，至于千日。",
        "translation": "He can also recite the bodhisattva's name a thousand times a day for a thousand days.",
        "source": "T13n0412_002:0788a28_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人當得菩薩遣所在土地鬼神，終身衛護，現世衣食豐溢，無諸疾苦，乃至橫事不入其門，何況及身？",
        "translation": "That person will then be protected for life by the land spirits that the bodhisattva sends to his place, have an abundance of food and clothing in the present life, experience no suffering or distress, and even have trouble getting through his door, let alone his body.",
        "source": "T13n0412_002:0788a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人畢竟得菩薩摩頂授記。",
        "translation": "After all, this person receives the bodhisattva's matsuration prediction.",
        "source": "T13n0412_002:0788b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀世音菩薩！",
        "translation": "\"Furthermore, Avalokitêśvara Bodhisattva!",
        "source": "T13n0412_002:0788b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有善男子、善女人，欲發廣大慈心，救度一切眾生者，欲修無上菩提者，欲出離三界者。",
        "translation": "\"If there will be good men and good women in future generations who want to arouse a generous compassionate heart, save all sentient beings, cultivate unsurpassed bodhi, and want to escape the three realms, then they will venerate Kṣitigarbha with all their hearts, or they will offer flowers, clothing, precious shells, food, and drink to venerate him.",
        "source": "T13n0412_002:0788b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸人等，見地藏形像及聞名者，至心歸依，或以香華衣服、寶貝飲食，供養瞻禮。",
        "translation": "Those people see an image of Kṣitigarbha and hear its name, wholeheartedly rely on it, or they may offer flowers, clothing, precious sculptures, food, and drink to venerate it.",
        "source": "T13n0412_002:0788b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男女等，所願速成，永無障礙。",
        "translation": "These good men and women will quickly achieve what they desire, and it will never be an obstruction.",
        "source": "T13n0412_002:0788b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀世音！",
        "translation": "\"Furthermore, Avalokitêśvara!",
        "source": "T13n0412_002:0788b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有善男子、善女人，欲求現在未來百千萬億等願、百千萬億等事，但當歸依、瞻禮、供養、讚歎地藏菩薩形像，如是所願所求，悉皆成就。",
        "translation": "\"If there are good men and good women in the future who want to pursue one hundred thousand million million vows or one hundred thousand million million things in the present and future, they must rely on, venerate, make offerings to, and praise the image of Kṣitigarbha Bodhisattva, and thus fulfill all their wishes and desires.",
        "source": "T13n0412_002:0788b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復願地藏菩薩，具大慈悲，永擁護我，是人於睡夢中，即得菩薩摩頂授記。",
        "translation": "Furthermore, may Kṣitigarbha Bodhisattva have great compassion and protect me forever, so that while I'm asleep and asleep, I'll receive a mo-topping prediction from the bodhisattva.",
        "source": "T13n0412_002:0788b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀世音菩薩！",
        "translation": "\"Furthermore, Avalokitêśvara Bodhisattva!",
        "source": "T13n0412_002:0788b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，善男子、善女人，於大乘經典，深生珍重，發不思議心，欲讀欲誦。",
        "translation": "\"Suppose there are good men and good women in future generations who deeply value the great vehicle sūtras, develop an inconceivable mind, and want to read and recite them.",
        "source": "T13n0412_002:0788b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縱遇明師，教視令熟，旋得旋忘，動經年月，不能讀誦。",
        "translation": "Even if they meet a wise teacher who teaches them and makes them ripe, they'll only acquire and forget them again, and they won't be able to recite them after years and months of chanting.",
        "source": "T13n0412_002:0788b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子等，有宿業障，未得銷除，故於大乘經典，無讀誦性。",
        "translation": "These good sons have past karmic hindrances that haven't been removed, so they don't have the disposition to recite the great vehicle sūtras.",
        "source": "T13n0412_002:0788b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之人，聞地藏菩薩名，見地藏菩薩像，具以本心恭敬陳白，更以香、華、衣服、飲食、一切玩具，供養菩薩。",
        "translation": "Such a person hears the name of Kṣitigarbha Bodhisattva, sees his image, respectfully proclaims it with his original intention, and makes offerings to the bodhisattva with incense, flowers, clothing, food, and all his toys.",
        "source": "T13n0412_002:0788b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以淨水一盞，經一日一夜，安菩薩前，然後合掌請服，迴首向南，臨入口時，至心鄭重。",
        "translation": "He takes a caldron of pure water and places it in front of the bodhisattva for a day and a night, then joins his palms and asks him to take it, turns his head to the south, and solemnly respects it with his utmost attention as he approaches the mouth.",
        "source": "T13n0412_002:0788b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "服水既畢，慎五辛、酒肉、邪婬、妄語，及諸殺害，一七日，或三七日。",
        "translation": "After taking the water, he must be careful about the five spices, alcohol, meat, sexual misconduct, false speech, and harm for one or three days.",
        "source": "T13n0412_002:0788b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，於睡夢中，具見地藏菩薩現無邊身，於是人處授灌頂水。",
        "translation": "That good man or woman sees Kṣitigarbha Bodhisattva in his or her infinite body while asleep and dreaming, and he or she gives him or her a consecration of water.",
        "source": "T13n0412_002:0788b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人夢覺，即獲聰明，應是經典，一歷耳根，即當永記，更不忘失一句一偈。",
        "translation": "That person awakens in the dream, immediately attains intelligence, and once he or she hears this sūtra, he or she will remember it forever, never forgetting a single verse.",
        "source": "T13n0412_002:0788b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀世音菩薩！",
        "translation": "\"Furthermore, Avalokitêśvara Bodhisattva!",
        "source": "T13n0412_002:0788b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有諸人等：衣食不足，求者乖願；或多病疾，或多凶衰；家宅不安，眷屬分散；或諸橫事，多來忤身；睡夢之間，多有驚怖。",
        "translation": "\"In the future, there will be people who lack food and clothing, whose desires are not met, who are sick and ill, or who suffer from bad fortune, whose homes are troubled, whose family members are scattered, whose misdeeds often come against them, and who are often frightened in their sleep and dreams.",
        "source": "T13n0412_002:0788b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是人等，聞地藏名，見地藏形，至心恭敬，念滿萬遍。",
        "translation": "Such people hear the name Kṣitigarbha and see Kṣitigarbha's form, respect it with all their hearts, and recite it 10,000 times.",
        "source": "T13n0412_002:0788c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸不如意事，漸漸消滅，即得安樂，衣食豐溢，乃至於睡夢中，悉皆安樂。",
        "translation": "Gradually, these unsatisfactory circumstances cease, and they attain well-being, an abundance of food and clothing, and even well-being in their sleep and dreams.",
        "source": "T13n0412_002:0788c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀世音菩薩！",
        "translation": "\"Furthermore, Avalokitêśvara Bodhisattva!",
        "source": "T13n0412_002:0788c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有善男子、善女人，或因治生，或因公私，或因生死，或因急事，入山林中，過渡河海，乃及大水，或經險道。",
        "translation": "\"If there will be a good man or woman in a future life who enters a mountain forest, crosses a river or ocean, encounters great waters, or goes through a dangerous path because of healing birth, public or private affairs, birth-and-death, or urgent matters, then he or she will recite the name of Kṣitigarbha Bodhisattva ten thousand times.",
        "source": "T13n0412_002:0788c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人先當念地藏菩薩名萬遍，所過土地，鬼神衛護，行住坐臥，永保安樂。",
        "translation": "That person should first recite the name of Kṣitigarbha Bodhisattva ten thousand times, and the land they cross will be guarded by ghosts and spirits, and they'll be permanently secure when walking, standing, sitting, and lying down.",
        "source": "T13n0412_002:0788c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至逢於虎狼師子、一切毒害，不能損之。」",
        "translation": "Even when they encounter tigers, wolves, lions, and all kinds of poison, they won't be able to harm them.\"",
        "source": "T13n0412_002:0788c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告觀世音菩薩：「是地藏菩薩，於閻浮提，有大因緣。",
        "translation": "The Buddha told Avalokitêśvara Bodhisattva, \"This is Kṣitigarbha Bodhisattva, who has great causes and conditions in Jambudvīpa.",
        "source": "T13n0412_002:0788c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說於諸眾生見聞利益等事，百千劫中，說不能盡。",
        "translation": "If he were to explain such things as the benefits of seeing and hearing to sentient beings, he wouldn't be able to explain them in a hundred thousand eons.",
        "source": "T13n0412_002:0788c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，觀世音！",
        "translation": "Therefore, Avalokitêśvara!",
        "source": "T13n0412_002:0788c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝以神力，流布是經，令娑婆世界眾生，百千萬劫，永受安樂。」",
        "translation": "By your supernormal powers, you will disseminate this sūtra so that sentient beings in the Sahava world will experience eternal happiness for a hundred thousand million eons.\"",
        "source": "T13n0412_002:0788c13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「吾觀地藏威神力，　　恒河沙劫說難盡，　見聞瞻禮一念間，　　利益人天無量事。",
        "translation": "It was then that the Bhagavān spoke a verse, \"I've observed Kṣitigarbha's awesome power, which is difficult to explain in an eon like the one in the Ganges sands, and in a moment's thought of seeing, hearing, venerating, and worshipping it, it benefits humans and gods in measureless ways.",
        "source": "T13n0412_002:0788c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若男若女若龍神，　　報盡應當墮惡道，　至心歸依大士身，　　壽命轉增除罪障。",
        "translation": "Whether it's a man, a woman, or a dragon spirit, their retribution will end and they'll fall into a bad destiny; if they wholeheartedly rely on the body of the bodhisattva, their life will increase and remove the hindrances of their crimes.",
        "source": "T13n0412_002:0788c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　少失父母恩愛者，　　未知魂神在何趣？",
        "translation": "Those who rarely lose the love of their parents don't know where their souls and spirits go.",
        "source": "T13n0412_002:0788c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　兄弟姊妹及諸親，　　生長以來皆不識。",
        "translation": "\"Brothers, sisters, and relatives have never known him since he was born.",
        "source": "T13n0412_002:0788c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或塑或畫大士身，　　悲戀瞻禮不暫捨，　三七日中念其名。",
        "translation": "Sometimes they sculpt or paint the body of a great person, venerate it with pity, and don't let go of it for a moment, recollecting its name for three or seven days.",
        "source": "T13n0412_002:0788c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩薩當現無邊體，　示其眷屬所生界，　　縱墮惡趣尋出離。",
        "translation": "The bodhisattva will then reveal his limitless body, show his followers the realm of birth, and seek escape even if they fall into a bad destiny.",
        "source": "T13n0412_002:0788c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能不退是初心，　　即獲摩頂受聖記。",
        "translation": "If he can nonretrogress from this first intention, he'll attain the noble prediction of being reborn in the moat.",
        "source": "T13n0412_002:0788c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲修無上菩提者，　　乃至出離三界苦，　是人既發大悲心，　　先當瞻禮大士像，　一切諸願速成就，　　永無業障能遮止。",
        "translation": "Those who want to cultivate unsurpassed bodhi ... to escape the suffering of the three realms ... should first venerate the image of the bodhisattva after arousing the mind of great compassion, so that all their vows are quickly accomplished and no karmic obstruction can ever prevent them.",
        "source": "T13n0412_002:0788c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有人發心念經典，　　欲度群迷超彼岸，　雖立是願不思議，　　旋讀旋忘多廢失。",
        "translation": "Some people arouse the intention to recite the sūtras, wanting to save the misled and transcend the other shore, but even though they establish this vow and don't deliberate on it, they read it again and again, forgetting it and often losing it.",
        "source": "T13n0412_002:0788c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斯人有業障惑故，　　於大乘經不能記。",
        "translation": "That person has karmic hindrances and mental disturbances, and they can't memorize the great vehicle sūtras.",
        "source": "T13n0412_002:0789a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　供養地藏以香華，　　衣服飲食諸玩具，　以淨水安大士前，　　一日一夜求服之，　發殷重心慎五辛，　　酒肉邪淫及妄語，　三七日內勿殺害，　　至心思念大士名。",
        "translation": "They make offerings to Kṣitigarbha with flowers and incense, dress themselves in food and drink, put pure water in front of the bodhisattva, seek to take it one day and one night, arouse deep concern and caution about the five spices, alcohol, meat, sexual misconduct, and false speech, don't kill or harm anyone for thirty-one days, and wholeheartedly think about the bodhisattva's name.",
        "source": "T13n0412_002:0789a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即於夢中見無邊，　　覺來便得利根耳，　應是經教歷耳聞，　　千萬生中永不忘。",
        "translation": "That's when he sees the infinite in a dream, awakens, and attains sharp faculties and ears, and he hears the teachings of sūtras and never forgets them in a thousand million lifetimes.",
        "source": "T13n0412_002:0789a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以是大士不思議，　　能使斯人獲此慧。",
        "translation": "Because the great man doesn't think things through, he can enable this person to acquire this wisdom.",
        "source": "T13n0412_002:0789a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貧窮眾生及疾病，　　家宅凶衰眷屬離，　睡夢之中悉不安，　　求者乖違無稱遂。",
        "translation": "Poor sentient beings and sickness, families in bad times and bad luck, and dependents in their homes are all disturbed in their sleep and dreams, and those who seek them are at odds with them without success.",
        "source": "T13n0412_002:0789a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　至心瞻禮地藏像，　　一切惡事皆消滅，　至於夢中盡得安，　　衣食豐饒神鬼護。",
        "translation": "They wholeheartedly venerate Kṣitigarbha's image, and all bad deeds are extinguished, and they're completely at peace in their dreams, well clothed and fed, and protected by gods and ghosts.",
        "source": "T13n0412_002:0789a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲入山林及渡海，　　毒惡禽獸及惡人，　惡神惡鬼并惡風，　　一切諸難諸苦惱。",
        "translation": "They want to enter the mountains, cross the forest, or cross the ocean, encounter poisonous animals and people, bad spirits, bad ghosts, and bad winds, and experience all kinds of hardships and suffering.",
        "source": "T13n0412_002:0789a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　但當瞻禮及供養，　　地藏菩薩大士像，　如是山林大海中，　　應是諸惡皆消滅。",
        "translation": "Only should you venerate and make offerings to the image of the bodhisattva Kṣitigarbha, so that in the mountains, forests, and seas, all the evil that exists will cease.",
        "source": "T13n0412_002:0789a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀音至心聽吾說，　　地藏無盡不思議，　百千萬劫說不周，　　廣宣大士如是力。",
        "translation": "Avalokitêśvara sincerely listens to my teaching, saying that Kṣitigarbha is inexhaustible and inconceivable, that it's incomprehensible for a hundred million eons, and that it's a broad declaration of the bodhisattva's power.",
        "source": "T13n0412_002:0789a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　地藏名字人若聞，　　乃至見像瞻禮者，　香華衣服飲食奉，　　供養百千受妙樂，　若能以此迴法界，　　畢竟成佛超生死。",
        "translation": "If people hear the name Kṣitigarbha, even those who see the image and venerate it, offer flowers, clothing, food, and drink, make offerings to the hundreds of thousands of people who experience marvelous pleasure, and if they can thus return to the Dharma realm, they'll ultimately become buddhas and transcend birth and death.",
        "source": "T13n0412_002:0789a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故觀音汝當知，　　普告恒沙諸國土。」",
        "translation": "Therefore, you should know that Avalokitêśvara universally addresses the lands of the sands of the Ganges.\"",
        "source": "T13n0412_002:0789a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "囑累人天品第十三",
        "translation": "The Thirteenth Chapter of the Exhortation to Human Beings and Gods",
        "source": "T13n0412_002:0789a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊舉金色臂，又摩地藏菩薩摩訶薩頂，而作是言：「地藏！",
        "translation": "At that point, the Bhagavān raised his golden arm and touched the head of Kṣitigarbha Bodhisattva Mahāsattva, saying, \"Kṣitigarbha!",
        "source": "T13n0412_002:0789a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏！",
        "translation": "Kṣitigarbha!",
        "source": "T13n0412_002:0789a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之神力，不可思議；汝之慈悲，不可思議；汝之智慧，不可思議；汝之辯才，不可思議。",
        "translation": "Your miraculous powers are unfathomable, your compassion is unfathomable, your wisdom is unfathomable, and your eloquence is unfathomable.",
        "source": "T13n0412_002:0789a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使十方諸佛，讚歎宣說汝之不思議事，千萬劫中，不能得盡。",
        "translation": "That's exactly why the buddhas of the ten directions praise and proclaim your inconceivable qualities, which cannot be exhausted in a thousand million eons.",
        "source": "T13n0412_002:0789a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏！",
        "translation": "Kṣitigarbha!",
        "source": "T13n0412_002:0789a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏！",
        "translation": "Kṣitigarbha!",
        "source": "T13n0412_002:0789b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "記吾今日在忉利天中，於百千萬億不可說不可說一切諸佛菩薩、天龍八部大會之中，再以人天諸眾生等，未出三界，在火宅中者，付囑於汝。",
        "translation": "\"I'd like to remind you that today, in the Heaven of Thousand and One Thousand Trillions of Ineffable and Ineffable Buddhas and Bodhisattvas, gods, dragons, and the eight groups of gods in the assembly, I'm again entrusting you with the task of telling all the sentient beings in humans and gods who have yet to escape the three realms and are in burning houses.",
        "source": "T13n0412_002:0789b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無令是諸眾生，墮惡趣中一日一夜，何況更落五無間及阿鼻地獄，動經千萬億劫，無有出期？",
        "translation": "Wouldn't you allow those sentient beings to fall into a single day or night in a bad destiny, let alone fall into the five unremitting hells or the avīci hell, which often pass through a thousand million eons with no hope of escape?",
        "source": "T13n0412_002:0789b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「地藏！",
        "translation": "\"Kṣitigarbha!",
        "source": "T13n0412_002:0789b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是南閻浮提眾生，志性無定，習惡者多，縱發善心，須臾即退，若遇惡緣，念念增長。",
        "translation": "\"These sentient beings in southern Jambudvīpa have indeterminate aspirations and many bad habits, and even though they arouse good intentions, they soon regress, and when they encounter bad conditions, their mind grows.",
        "source": "T13n0412_002:0789b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之故，吾分是形，百千億化度，隨其根性而度脫之。",
        "translation": "For this reason, we divide them into these forms and deliver them by teaching them a hundred billion things, according to their faculties and natures.",
        "source": "T13n0412_002:0789b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏！",
        "translation": "Kṣitigarbha!",
        "source": "T13n0412_002:0789b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今殷勤以天人眾，付囑於汝。",
        "translation": "\"Now, I've earnestly entrusted you with the task of creating a multitude of gods and humans.",
        "source": "T13n0412_002:0789b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來之世，若有天人，及善男子、善女人，於佛法中，種少善根，一毛一塵，一沙一渧。",
        "translation": "'In a future age, if there are gods or humans, good men or good women, who plant a tiny bit of good root, a hair or a speck of dust or a grain of sand in the Buddha's teaching, then by the power of the path, you'll support that person and gradually cultivate unsurpassed qualities, so that they don't lose it.'",
        "source": "T13n0412_002:0789b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝以道力，擁護是人，漸修無上，勿令退失。",
        "translation": "With the power of the path, you'll safeguard that person and gradually cultivate unsurpassedness, so that they don't lose it.",
        "source": "T13n0412_002:0789b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，地藏！",
        "translation": "\"Furthermore, Kṣitigarbha!",
        "source": "T13n0412_002:0789b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若天若人，隨業報應，落在惡趣。",
        "translation": "In a future life, suppose gods or humans are destined to fall into a bad destiny according to the results of their actions.",
        "source": "T13n0412_002:0789b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨墮趣中，或至門首，是諸眾生，若能念得一佛名、一菩薩名、一句一偈大乘經典。",
        "translation": "When they're about to fall into an evil destiny or reach the head of the gate, suppose these sentient beings can recollect the name of a single Buddha, the name of a single bodhisattva, or a single verse of a great vehicle scripture.",
        "source": "T13n0412_002:0789b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生，汝以神力，方便救拔。",
        "translation": "You will skillfully rescue these sentient beings with your supernormal powers.",
        "source": "T13n0412_002:0789b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是人所，現無邊身，為碎地獄，遣令生天，受勝妙樂。」",
        "translation": "In these places, you will present an infinite body, break open the hells, and send them off to be born in heaven to experience marvelous happiness.\"",
        "source": "T13n0412_002:0789b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「現在未來天人眾，　　吾今殷勤付囑汝，　以大神通方便度，　　勿令墮在諸惡趣。」",
        "translation": "It was then that the Bhagavān spoke this verse, \"Now, I earnestly bid you, among the gods and humans of the future, to save them with great supernormal powers and skillful means so that they won't fall into the bad destinies.\"",
        "source": "T13n0412_002:0789b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，地藏菩薩摩訶薩胡跪合掌，白佛言：「世尊！",
        "translation": "At that point, Kṣitigarbha Bodhisattva Mahāsattva knelt down with his palms together and said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0789b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，不以為慮。",
        "translation": "\"May the Bhagavān not take this as a concern.",
        "source": "T13n0412_002:0789b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若有善男子、善女人，於佛法中，一念恭敬，我亦百千方便，度脫是人，於生死中，速得解脫。",
        "translation": "In the future, if there are good men and good women who are respectful of the Buddha's teaching with a single thought, I will also make a hundred thousand skillful means to liberate them, so that they can quickly attain liberation in the midst of birth-and-death.",
        "source": "T13n0412_002:0789b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況聞諸善事，念念修行？",
        "translation": "How could it be possible to hear of good deeds and mindfully cultivate them?",
        "source": "T13n0412_002:0789b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自然於無上道，永不退轉。」",
        "translation": "Naturally, on the unsurpassed path, they never turn back.\"",
        "source": "T13n0412_002:0789b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，會中有一菩薩，名虛空藏，白佛言：「世尊！",
        "translation": "When he spoke these words, a bodhisattva named Ākāśagarbha in the assembly said to the Buddha, \"Bhagavān!",
        "source": "T13n0412_002:0789b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我自至忉利，聞於如來讚歎地藏菩薩威神勢力，不可思議。",
        "translation": "Since I arrived at the Thirty-three, I've heard the Tathāgata praise Kṣitigarbha Bodhisattva for his unfathomable authority and strength.",
        "source": "T13n0412_002:0789b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，若有善男子、善女人，乃及一切天龍，聞此經典，及地藏名字，或瞻禮形像，得幾種福利？",
        "translation": "In the future, if there will be good men and good women and all the gods and dragons who hear this scripture and the name Kṣitigarbha or who venerate their images, how many kinds of benefits will they receive?",
        "source": "T13n0412_002:0789b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，為未來現在一切眾等，略而說之。」",
        "translation": "May it please the Bhagavān to explain it in brief for all presently living beings in the future.\"",
        "source": "T13n0412_002:0789c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告虛空藏菩薩：「諦聽！",
        "translation": "The Buddha told the Ākāśagarbha Bodhisattva, \"Listen closely!",
        "source": "T13n0412_002:0789c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen closely!",
        "source": "T13n0412_002:0789c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別說之。",
        "translation": "I will explain them clearly for you.",
        "source": "T13n0412_002:0789c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世，有善男子、善女人，見地藏形像，及聞此經，乃至讀誦，香華飲食、衣服珍寶，布施供養，讚歎瞻禮，得二十八種利益：一者天龍護念，二者善果日增，三者集聖上因，四者菩提不退，五者衣食豐足，六者疾疫不臨，七者離水火災，八者無盜賊厄，九者人見欽敬，十者神鬼助持，十一者女轉男身，十二者為王臣女，十三者端正相好，十四者多生天上，十五者或為帝王，十六者宿智命通，十七者有求皆從，十八者眷屬歡樂，十九者諸橫銷滅，二十者業道永除，二十一者去處盡通，二十二者夜夢安樂，二十三者先亡離苦，二十四者宿福受生，二十五者諸聖讚歎，二十六者聰明利根，二十七者饒慈愍心，二十八者畢竟成佛。",
        "translation": "若未來世，有善男子、善女人，見地藏形像，及聞此經，乃至讀誦，香華飲食、衣服珍寶，布施供養，讚歎瞻禮，得二十八種利益：一者天龍護念，二者善果日增，三者集聖上因，四者菩提不退，五者衣食豐足，六者疾疫不臨，七者離水火災，八者無盜賊厄，九者人見欽敬，十者神鬼助持，十一者女轉男身，十二者為王臣女，十三者端正相好，十四者多生天上，十五者或為帝王，十六者宿智命通，十七者有求皆從，十八者眷屬歡樂，十九者諸橫銷滅，二十者業道永除，二十一者去處盡通，二十二者夜夢安樂，二十三者先亡離苦，二十四者宿福受生，二十五者諸聖讚歎，二十六者聰明利根，二十七者饒慈愍心，二十八者畢竟成佛。",
        "source": "T13n0412_002:0789c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，虛空藏菩薩！",
        "translation": "\"Furthermore, Ākāśagarbha Bodhisattva!",
        "source": "T13n0412_002:0789c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若現在未來，天龍鬼神，聞地藏名，禮地藏形，或聞地藏本願事行，讚歎瞻禮，得七種利益：一者速超聖地，二者惡業銷滅，三者諸佛護臨，四者菩提不退，五者增長本力，六者宿命皆通，七者畢竟成佛。」",
        "translation": "If gods, dragons, and spirits in the present or future hear the name Kṣitigarbha, venerate its form, or hear of its deeds and deeds in the past vows, praise and venerate it, they will attain seven benefits: first, they will quickly transcend the noble stages, second, their bad karma will cease, third, the buddhas will protect them, fourth, they will not retrogress, fifth, they will increase their innate powers, sixth, their past lives will all be supernormal, and seventh, they will finally become buddhas.\"",
        "source": "T13n0412_002:0789c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，十方一切諸來不可說不可說諸佛如來，及大菩薩、天龍八部，聞釋迦牟尼佛，稱揚讚歎地藏菩薩，大威神力，不可思議，歎未曾有。",
        "translation": "At the time, all the Tathāgatas, Ineffable, and Ineffable Buddha-Tathāgatas, great bodhisattvas, gods, dragons, and the eight orders in the ten directions heard Śākyamuni Buddha praise and praise Kṣitigarbha Bodhisattva for his unfathomable and unsurpassed might and power.",
        "source": "T13n0412_002:0789c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時忉利天，雨無量香華，天衣珠瓔，供養釋迦牟尼佛，及地藏菩薩已。",
        "translation": "It was then that the Heaven of the Thirty-three Dragons rained down measureless fragrant flowers and celestial robes and beads to pay homage to Śākyamuni Buddha and Kṣitigarbha Bodhisattva.",
        "source": "T13n0412_002:0789c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾會，俱復瞻禮，合掌而退。",
        "translation": "All of the congregation again paid homage, closed their palms, and withdrew.",
        "source": "T13n0412_002:0789c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地藏菩薩本願經卷下",
        "translation": "Second Fascicle of the Sutra on the Original Vows of Kṣitigarbha Bodhisattva",
        "source": "T13n0412_002:0790a01_0",
        "is_bad_quality": false
    }
]