[
    {
        "source_sentence": "大方等大集經卷第四十七",
        "translation": "Dafangdengdaji jing, vol. 47",
        "source": "T13n0397_047:0303c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高齊天竺三藏那連提耶舍譯",
        "translation": "A Translation of the Sanskrit Tripiṭaka of Nālandī Yeshiva by Gaoqi Tianzang",
        "source": "T13n0397_047:0303c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月藏分第十四魔王波旬詣佛所品",
        "translation": "Yuezang Fen xiv 魔王 波旬詣佛所品",
        "source": "T13n0397_047:0303c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二",
        "translation": "second",
        "source": "T13n0397_047:0303c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復於魔王宮中，所有一切諸雜林樹果實華葉，衣冠瓔珞莊嚴之物，皆悉變成半月而現，放大光明照魔王宮，內外明徹，琴瑟箜篌一切樂器，及非樂器寶莊嚴具，及餘諸物，自然演出如是偈句：「世間無等大導師，　　於諸法中最自在，　今住佉羅帝迦山，　　為眾顯示佛法海，　開說一道清淨法，　　聞者必得勝菩提。",
        "translation": "At the time, again, in the demon king's palace, all the various trees, fruits, flowers, leaves, and garments, jewelry, and ornaments that adorned the king's palace all appeared as half moons, and a magnificent light shone brightly in and out of the demon king's palace, shining brightly inside and out, and all the musical instruments, non-instrumental jewelry, and other things naturally gave rise to this verse, \"The world's peerless great teacher is the most comfortable among dharmas, and he's now staying on Mount Kharādika, showing the multitude the ocean of the Buddha's teachings, expounding a single pure dharma that will surely lead those who hear it to superior enlightenment.",
        "source": "T13n0397_047:0303c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　波旬獷戾儞不如，　　令汝魔界悉空無，　汝本曾作一邪善，　　今得如是自在報。",
        "translation": "Pāpīyān Kauṇḍinya is not like that, making your demonic realm completely empty and non-existent, for you've done one wrong good deed in the past, and now you've attained this kind of unhindered reward.",
        "source": "T13n0397_047:0303c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝今法應當退落，　　何不速去見導師？",
        "translation": "Now, you must retire from the Dharma, so why don't you quickly go see your guide?",
        "source": "T13n0397_047:0303c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切所來諸眾生，　　曾作邪善千億數，　福藏大眾皆來集，　　聽受最上無病法。",
        "translation": "\"All the sentient beings who come from here have done a hundred billion wrong good deeds, and the masses of the fortune store all come together to hear and accept the most excellent, disease-free teaching.",
        "source": "T13n0397_047:0303c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　各各向佛心敬仰，　　見尊導師修供養，　以其淨信滅煩惱，　　更不重生於欲界。",
        "translation": "Each one venerates the Buddha, makes offerings to the venerable guide, and with their pure faith they cease affliction and are no longer reborn in the desire realm.",
        "source": "T13n0397_047:0303c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　專信禮拜尊導師，　　滅三界苦煩惱縛，　億世受於勝妙報，　　速與三界為親友。",
        "translation": "Venerating the venerable guide with devoted faith, they will cease the bonds of suffering and affliction in the three realms, receive hundreds of millions of worldly rewards that are marvelous, and quickly become close friends with the three realms.",
        "source": "T13n0397_047:0303c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又於三界作法王，　　說真實法度眾生，　一切諸法如水泡，　　有為相現猶如幻。",
        "translation": "He also serves as the Dharma king of the three realms, teaching the true Dharma to save sentient beings, saying that all dharmas are like bubbles of water and their artificial appearances are just like illusions.",
        "source": "T13n0397_047:0303c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　福報無常悉空無，　　當疾捨離我見過，　速發無上菩提心，　　以此定受勝妙福。」",
        "translation": "The rewards of merit are impermanent and completely empty, so you must quickly abandon what I've seen, quickly give rise to the unsurpassed mind of enlightenment, and with this certainty receive excellent and wonderful fortune.\"",
        "source": "T13n0397_047:0303c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王波旬及諸官屬見聞是已，驚怖戰悚從床而墮，兩手掩耳而作是言：「當觀沙門作此幻惑，必奪我等諸魔勢力，令諸色像悉成半月，復出如是種種音聲。",
        "translation": "When Māra King Pāpīyān and his officials heard this, they were terrified and frightened, fell off their beds, covered their ears with their two hands, and said, \"You must examine the ascetic who created this illusion and confusion, which will surely deprive us of the power of Māra and cause all of our colorful images to become half moons and produce various sounds like these.",
        "source": "T13n0397_047:0303c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門瞿曇現大神力，盡攝欲界以為己有，可速擊鼓集諸大眾皆到此處。」",
        "translation": "The ascetic Gautama has shown great psychic power to gather up all the desire realms and claim them as his own, so he can quickly beat the drum and gather the whole crowd to this place.\"",
        "source": "T13n0397_047:0304a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，於其宮中即便擊鼓。",
        "translation": "After he said that, he then beat the drum in his palace.",
        "source": "T13n0397_047:0304a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "擊彼鼓時，於其鼓中，即出如是音聲偈句：「諸法空寂風和合，　　遠離所依眾色像，　於作無用誑眾生，　　事相詐現猶如幻。",
        "translation": "When he beat the drum, this sonorous verse came out of the drum: \"The things that are empty and tranquil are combined by the wind, which is free of the many forms and images that support them, and the things that are made are useless and lead sentient beings into deceptive appearances just like illusions.",
        "source": "T13n0397_047:0304a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　和合因緣故成字，　　如書虛空字不住，　陰界空寂離眾色，　　無常義現不自實。",
        "translation": "The combination of causes and conditions creates words, like words in writing that don't reside in space, the aggregates are empty and tranquil free of form, and the meaning of impermanence appears as something other than what it really is.",
        "source": "T13n0397_047:0304a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聲塵入於耳根門，　　無常義現不暫停，　其識如幻若分別，　　顯現無我不自在。",
        "translation": "When sound objects enter the ear faculty, the meaning of impermanence is not suspended in its manifestation, and its consciousness is illusory and discriminated, revealing itself as selfless and not self-contained.",
        "source": "T13n0397_047:0304a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眼根迅速故空寂，　　是苦自性義相應，　鼻根香塵與舌味，　　身根及與一切觸，　心法並與無常俱，　　迷惑眾生無所覺，　如是六境生諸苦，　　能令失壞涅槃道。",
        "translation": "The eye faculty is swift and therefore empty, which corresponds to the meaning of the self-nature of suffering; the nose faculty produces fragrance, dust, and taste with the tongue; the body faculty and all tactile sensations; the mind faculty is associated with impermanence; deluded sentient beings perceive nothing; such are the six objects that produce suffering and can cause the loss of the path to nirvāṇa.",
        "source": "T13n0397_047:0304a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以是凡夫轉五趣，　　不能離縛得解脫，　於諸境界除渴愛，　　則能速到勝妙處。",
        "translation": "Because this is the transformation of ordinary people into the five destinies, they can't be freed from bondage and attain liberation, but when they remove thirst and desire for these objects, they can quickly reach the most marvelous place.",
        "source": "T13n0397_047:0304a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此心自性清淨相，　　觀是了知菩提道，　若己境界得自在，　　則能悲愍一切眾。",
        "translation": "He observes the pure character of the mind's own nature and knows the path to enlightenment, and if he attains mastery over his own objective realm, then he'll be able to sympathize with all sentient beings.",
        "source": "T13n0397_047:0304a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼當得檀戒忍，　　智慧功德自莊嚴，　得最無上菩提智，　　能度無量諸眾生。」",
        "translation": "There he will attain tolerance of the precepts, adorn himself with the merits of wisdom, attain the most unsurpassed knowledge of enlightenment, and be able to save measureless sentient beings.\"",
        "source": "T13n0397_047:0304a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此偈時，魔之宮殿一切眾生驚怖不安，男夫婦女、童男童女，迭共相喚，詣魔王所，住立其前。",
        "translation": "When he spoke this verse, all the sentient beings in Māra's palace became frightened and upset, and men, women, boys, and girls were summoned together to go to the king of Māra and stand in front of him.",
        "source": "T13n0397_047:0304a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王以偈告彼眾言：「汝等悉見此魔宮，　　如是無量極醜惡，　諸聲不息生大苦，　　定奪我等魔勢力。",
        "translation": "The demon king addressed the crowd with this verse, \"You've all seen this demon's palace, which is so measureless and extremely ugly that its sounds don't stop producing great suffering and are sure to deprive us of the demon's power.",
        "source": "T13n0397_047:0304a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙門瞿曇作是聲，　　欲滅魔力境界事，　可速往詣瞿曇所，　　咸共讚歎而歸依。」",
        "translation": "The ascetic Gautama makes this sound, wanting to extinguish the things in the realm of Māra's power, you can quickly go to Gautama, where they all praise and take refuge.\"",
        "source": "T13n0397_047:0304a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔子名鴦瞿羅歇，即以偈頌而白父言：「我今嚴駕著鎧甲，　　將諸勇健鬪戰士，　弓刀鉾矟及刀輪，　　刀面鼓面諸獸面。",
        "translation": "It was then that the demon son named Aṅgulakṣa said to his father in verse, \"Now, I'm going to put on my armor and put together a group of brave men to fight, with bows, swords, spears, lances, wheels, and the faces of swords, drums, and the faces of animals.",
        "source": "T13n0397_047:0304a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　魔軍夜叉龍修羅，　　及諸眷屬滿虛空，　速詣惡心瞿曇所，　　碎滅令彼如灰塵。」",
        "translation": "The armies of Māra, the yakṣas, the dragons, the shuras, and their retinues fill the sky and quickly go to the Gautama with evil intentions, crushing them like dust.\"",
        "source": "T13n0397_047:0304b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王說偈答言：「我從昔來於彼人，　　曾作無量惡留難，　汝亦應見菩提樹，　　瞿曇勝我及軍眾。",
        "translation": "The demon king then spoke a verse in reply, \"I've been with that person since the distant past, and I've caused measureless difficult and unpleasant rebirths; you, too, should see the bodhi tree, where the Gautama is superior to me and my army.",
        "source": "T13n0397_047:0304b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是我等數惱亂，　　瞿曇常勝於我等，　不見天龍阿修羅，　　能動彼人一毛端。」",
        "translation": "Thus, we were often troubled, but the Gautama is always better than we are, and I don't see any gods, dragons, or asuras who could move a single hair on their heads.\"",
        "source": "T13n0397_047:0304b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有魔之大臣名珊盧遮那，而說偈言：「我等可速捨欲界，　　但當自護己宮殿，　瞿曇昔來未至此，　　今來拒之莫聽前。」",
        "translation": "It was then that another minister of Māra named Śāluccana spoke in verse, saying, \"We can quickly abandon the desire realm, but we must guard our palaces; Gautama has never been here in the past, so don't listen to him now when he rejects us.\"",
        "source": "T13n0397_047:0304b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王甚大憂愁，默然不答。",
        "translation": "At the time, the demon king was greatly distressed and remained silent without answering.",
        "source": "T13n0397_047:0304b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有大臣名起怖畏，而說偈言：「惟有巧力可伏怨，　　當以諂偽詐為親，　我等將眾往詣彼，　　詭詐而歎彼沙門。」",
        "translation": "Another minister named Raising Fear spoke in verse, saying, \"Only with skillful means can we subdue enemies; let's pretend that deceit is our intimacy; let's send our people there and praise that ascetic for his deceit.\"",
        "source": "T13n0397_047:0304b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有大臣名毘闡陀行，而說偈言：「昔此宮殿眾盈滿，　　沙門侵奪今減少，　已歸彼者眾甚多，　　我等亦可往歸依。」",
        "translation": "Another minister named Viśvāntaṅga spoke in verse, saying, \"This palace used to be full, but now the number of ascetics who have usurped it has decreased, and there are so many who have gone there that we might as well go and rely on them.\"",
        "source": "T13n0397_047:0304b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王聞其所說即瞋彼臣，瞋已默然。",
        "translation": "When the king of Māra heard what he said, he became angry with that minister, but after he became angry, he remained silent.",
        "source": "T13n0397_047:0304b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有大臣名曰老智，而說偈言：「瞿曇力加諸宮殿，　　出此種種異音聲，　我等若不疾詣彼，　　沙門必速來到此。",
        "translation": "Another minister named Laozi spoke in verse, saying, \"Gautama's power has placed these various foreign sounds in the palace, and if we don't quickly go there, the ascetics will surely come here soon.",
        "source": "T13n0397_047:0304b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此處無人能遮護，　　以力止彼瞿曇仙，　我等寧可共一切，　　速詣歸彼大沙門。」",
        "translation": "There's no one here who can protect us from that Gautama sage with his power, so we'd better join them all and quickly go to that great ascetic.\"",
        "source": "T13n0397_047:0304b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，於彼諸宮殿中所居大眾，男夫婦女、眷屬大小，悉作一朋，復作是言：「大王！",
        "translation": "At the time, the people living in those palaces, the men, women, and their dependents, large and small, all became one group, and they again said, \"Great king!",
        "source": "T13n0397_047:0304b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可將諸眷屬速詣彼所，我等今當守護此諸城邑宮殿。」",
        "translation": "Now, you may send your retinues there quickly, and we will guard the palaces of these cities.\"",
        "source": "T13n0397_047:0304b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王即作是言：「如是，如是。",
        "translation": "It was then that Māra King said, \"So it is, so it is.",
        "source": "T13n0397_047:0304b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我與他化自在天王，及諸軍眾、眷屬大小往詣彼所，并與化天、兜率陀天、須夜摩天、釋提桓因，及其軍眾共詣彼所。",
        "translation": "I'll go there with the king of the heaven where I've been transformed, along with my troops and retinues, and I'll go there with the transformation gods, the Tuṣita gods, the Suyāma gods, Śakrodevānāmī, and their troops.",
        "source": "T13n0397_047:0304b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復與毘沙門天王并諸軍眾，毘樓勒叉天王并鳩槃茶軍眾，提頭賴吒天王并乾闥婆、緊那羅軍眾，毘樓博叉天王及諸龍眾，往詣彼所。」",
        "translation": "They also went there with King Vaiśravaṇa and his army, King Virūḍhaka and his army of kumbhāṇas, King Dhṛtarāṣṭra and his army of gandharvas and kiṃnaras, and King Virūpākṣa and his dragons.\"",
        "source": "T13n0397_047:0304c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語時，復有魔王輔佐大臣名珊遮羅拏，白言大王：「今者所有諸天宮殿皆悉空寂，欲界諸天及諸天女一切眷屬，悉在瞿曇大沙門所聽法而住，如是緊那羅、龍、鬼、夜叉、伽樓羅、鳩槃茶，悉在彼處種種供養沙門瞿曇，聽受其法。」",
        "translation": "When he said that, another minister who assisted Māra called Sancerrāṇa said to the king, \"Now, all the heavenly palaces are empty, and all the retinues of the gods and goddesses of the desire realm are staying at the great ascetic Gautama to hear the Dharma, such as the kiṃnaras, dragons, ghosts, yakṣas, garuḍas, and kumbhāṇḍas, who are all there making offerings to the ascetic Gautama and listening to his teachings.\"",
        "source": "T13n0397_047:0304c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王自觀察已，見諸欲界一切宮殿皆悉空寂，欲界之中所有諸天人非人等，皆悉集在於瞿曇所而坐聽法，惟有阿修羅未到於彼。",
        "translation": "After he looked around, the demon king saw that all the palaces in the desire realm were empty and silent, and that all the gods, humans, and nonhumans in the desire realm had gathered at the Gautama's residence to sit and listen to the teaching, except for the asuras, who hadn't yet arrived there.",
        "source": "T13n0397_047:0304c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而作是言：「我今當與諸阿修羅俱詣彼所，令其會眾皆悉惑亂不得正信，勿使瞿曇教彼大眾諸法如幻，不去不來不合不散不生不滅，令我欲界皆悉空寂。」",
        "translation": "They said, \"Now, I will go there with those asuras to cause the congregation to be confused and unable to have correct faith, so that Gautama won't teach them that all dharmas are illusory, that they don't go away and don't come apart, don't disperse, don't arise, and don't cease, so that my desire realm will be completely empty and tranquil.\"",
        "source": "T13n0397_047:0304c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是言：「我今當共諸阿修羅并及軍眾疾詣彼所，遮諸眾生不令速得越度苦海到於彼岸，以沙門力速背死法，令我境界勢力減少，我今速往遮護彼諸人非人等。」",
        "translation": "Again, he said, \"Now, I will quickly go there with the asuras and their armies, block the sentient beings from quickly crossing the ocean of suffering to the other shore, and quickly recite the teaching of death with the power of ascetics, so that the power of my objective realm is diminished.",
        "source": "T13n0397_047:0304c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬，即以魔之神通境界，念四阿修羅王及其軍眾一切眷屬，速來集在須彌山頂，然後相將共下詣彼瞿曇沙門所，詐設美言謙下讚歎，示作歸依求見因緣，當以方便令諸大眾悉生怖畏斷其正信，又不令彼於瞿曇所生其尊敬，以是令彼沙門瞿曇厭患於世速入涅槃。",
        "translation": "Māra Pāpīyān then, using the demon's superknowledge, remembered that the four asura kings and their armies and all their retinues had quickly gathered at the top of Mount Sumeru, and then they all went down to that ascetic Gautama, deceptively praised him with beautiful words, showed him the causes and conditions for seeking refuge, caused the whole crowd to become frightened, broke their right faith, and didn't cause them to develop respect for the Gautama, thus causing that ascetic Gautama to become disillusioned with the world and quickly enter nirvāṇa.",
        "source": "T13n0397_047:0304c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是魔王，數數悕望阿修羅眾，然諸阿修羅為佛神力之所加故，茫然不知魔之悕望。",
        "translation": "Thus, the demon king repeatedly desired the multitude of asuras, but the asuras, because of the Buddha's spiritual power, were at a loss to understand what the demon desired.",
        "source": "T13n0397_047:0304c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其魔即時惡意於佛及一切阿修羅，便作是言：「觀瞿曇一人於我境界，已得解脫不可追迴，我於欲界悉得自在。",
        "translation": "That demon then maligned the Buddha and all the asuras and said, \"Seeing as how Gautama alone has attained liberation in my realm and can't be retraced, I've completely attained mastery in the desire realm.",
        "source": "T13n0397_047:0305a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此凡賤畜生阿修羅不受我教，我當為其作大衰惱，令彼速捨所治宮殿，然後我當以神通力，將諸眷屬往見瞿曇。",
        "translation": "This lowly animal asura won't accept my teaching, so I will cause him great trouble and cause him to quickly abandon the palace he's building, and then I will use my supernormal powers to bring my retinue to see the Gautama.",
        "source": "T13n0397_047:0305a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復與諸大臣、勇將、左右諸軍、男夫婦女營從圍遶，以第一最勝五音作樂調戲歌舞，一切衣服莊嚴之具，眾寶香華幢幡寶蓋音聲和合令速嚴辦，往見瞿曇。",
        "translation": "I'll also surround them with ministers, brave generals, left and right armies, husbands, wives, and children, create music, play, and dance to the five most excellent sounds, adorn them with all their clothing, and combine the sounds of many treasures, flowers, banners, banners, and jeweled shrouds to make them quickly adorn themselves as they go to see Gautama.",
        "source": "T13n0397_047:0305a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今亦將夫人婇女及以男女大眾圍繞，以第一最勝魔之境界神通遊戲五音和合，往見瞿曇。",
        "translation": "Now, I'll also surround my wife, Ṛṣipatana, and a large group of men and women with the first and most excellent Māra's realm of supernormal abilities, play, and combine five sounds, and go to see Gautama.",
        "source": "T13n0397_047:0305a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_047:0305a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯除瞿曇，諸餘大眾天、龍、乾闥婆、人及阿修羅等，世間大眾悉令迷惑，當以堅牢欲網而羅網之，於生死大海不令速度，是故詣彼。",
        "translation": "Only the Gautama and the rest of the great multitude of gods, dragons, gandharvas, asuras, and others of the world will be confused, and they will be netted with a firm net of desire that won't allow them to speed across the ocean of birth-and-death; therefore, they'll go there.",
        "source": "T13n0397_047:0305a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘者留住守此宮殿。」",
        "translation": "The rest of you will stay here and guard the palace.\"",
        "source": "T13n0397_047:0305a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬即將九百六十萬頻婆羅眷屬、男夫婦女、童男童女、大臣左右，以魔境界神通加持，作第一最勝五音伎樂歌舞調戲，一切所有令人多憙生染著者悉具備之。",
        "translation": "At the time, Māra Pāpīyān gathered 9,600,000 members of the Vaibhāra clan, husbands, wives, boys, girls, ministers, and their attendants, and empowered them with the Māra's superknowledge of the objective realm to create the most excellent five sounds, music, song, dance, and comedy, and to provide them with anything that would cause people to become defiled with pride.",
        "source": "T13n0397_047:0305a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬住彼諸宮告言：「悉出，往詣彼所。」",
        "translation": "Māra Pāpīyān then stayed at those palaces and told them, \"All of you, go away and visit them.\"",
        "source": "T13n0397_047:0305a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而復合掌說偈頌曰：「唯佛盡除諸煩惱，　　唯佛能化諸世間，　唯佛能然正法燈，　　三界中最我歸依。」",
        "translation": "He then joined his palms together and spoke a verse, saying, \"Only the Buddha completely removes the afflictions, only the Buddha can transform the world, only the Buddha can be a lamp of the true Dharma, and I'm the most relied-upon person in the three realms.\"",
        "source": "T13n0397_047:0305a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王既作如是魔之神通境界力已，從彼宮出以手散華，所散之華於四天下悉作華蓋在空而住，於一切處悉雨種種寶、種種華如雲而下。",
        "translation": "After the Māra King had performed such a feat with the Māra's supernormal powers, he emerged from his palace and scattered flowers with his hand, making flower coverings in the four heavens that stood in the sky and raining down various treasures and flowers like clouds everywhere.",
        "source": "T13n0397_047:0305a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於爾時，世尊仍說住阿蘭若第一義諦。",
        "translation": "At the time, the Bhagavān continued to speak about abiding in the supreme truth of araṇya.",
        "source": "T13n0397_047:0305a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大眾：「汝等一切守攝諸根繫心專念莫令馳散。",
        "translation": "The Buddha addressed the crowd, \"All of you guard your faculties, bind your minds and concentrate on them, and don't let them wander off.",
        "source": "T13n0397_047:0305a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此魔波旬多將諸眾歌舞調戲，五音作樂眾伎和合，又與婦女眷屬大小圍繞而來。」",
        "translation": "This Māra Pāpīyān often brings crowds of people to sing, dance, play, and combine five musical sounds with a variety of tricks, and he comes surrounded by women, their families, and large and small.\"",
        "source": "T13n0397_047:0305a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王與諸眷屬尋即來到佉羅帝山牟尼諸仙所依住處。",
        "translation": "The king of Māra and his retinue then rushed over to Mount Kharādī where the sages Mūlasarvâstivāda were staying.",
        "source": "T13n0397_047:0305b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到佛所已，即於佛上虛空之中化七寶蓋，縱廣七由旬而覆佛頂。",
        "translation": "When they arrived, they transformed seven jeweled canopies seven leagues wide into a canopy in the sky above the Buddha and covered his head.",
        "source": "T13n0397_047:0305b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以無價真珠瓔珞嚴置佛上，復以種種眾寶、華香、塗香、末香、天鬘、幢幡、寶蓋、金縷、真珠、瓔珞及五音伎樂，供養世尊。",
        "translation": "He also placed a priceless bead necklace adorned with the Buddha's head and made offerings to the Bhagavān with a variety of treasures, flowers, perfume, powdered incense, celestial garlands, banners, banners, jeweled canopies, gold thread, genuine beads, jewelry, and the five musical instruments.",
        "source": "T13n0397_047:0305b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右遶三匝，而說偈言：「我今歸命佛世尊，　　從是終不起惡心，　瞿曇心定容恕我，　　我當守護佛正法。",
        "translation": "Circumnavigating him three times to his right, he spoke a verse, saying, \"Now, I give my life to the Bhagavān, and from now on I'll never have bad intentions; the Gautama mind will surely forgive me, and I will guard the Buddha's right teaching.",
        "source": "T13n0397_047:0305b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於世更無如世尊，　　憐愍利益眾生者，　自得解脫令他得，　　是故我歸最勝尊。",
        "translation": "There's no one like the Bhagavān in the world who takes pity on those who benefit sentient beings and liberates themselves so that others may attain it; therefore, I give my refuge to the most honored one.",
        "source": "T13n0397_047:0305b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯佛慈愍一切眾，　　已越生死煩惱山，　常慈樂度諸眾生，　　今速歸依汝世尊。",
        "translation": "Only the Buddha has compassion for all sentient beings, has crossed the mountain of affliction of birth-and-death, and is always kind and happy to save sentient beings, so I quickly take refuge in you, the World Honored One.",
        "source": "T13n0397_047:0305b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能了有為及無為，　　離二如蓮不著水，　積德梵行所依身，　　是故我今歸依佛。",
        "translation": "He understands both the existent and the inactive, is free of both like a lotus not clinging to water, and has accumulated the body on which the religious practice rests; therefore, I now take refuge in the Buddha.",
        "source": "T13n0397_047:0305b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世無寂定無病法，　　清淨常勝伏煩惱，　唯有正法及涅槃，　　是故歸依無等法。",
        "translation": "There's no tranquil concentration, no disease-free dharmas, purity, permanence, and overcoming afflictions, only right dharmas and nirvāṇa; therefore, I take refuge in peerless dharmas.",
        "source": "T13n0397_047:0305b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於世更無如僧眾，　　和合解脫八丈夫，　能離一切煩惱縛，　　是故歸依大德僧。",
        "translation": "There's nothing like the saṃgha in the world, which is united with the eight virtuous beings of liberation and can free them from all the bonds of affliction, so I take refuge in the great virtuous saṃgha.",
        "source": "T13n0397_047:0305b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　閑居靜默常一食，　　第一義心恒相應，　慈悲愍念諸眾生，　　我亦歸依於彼等。",
        "translation": "Living in quietude and always taking one meal, their mind is constantly aligned with the ultimate truth, and they have compassion for sentient beings, to whom I also take refuge.",
        "source": "T13n0397_047:0305b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於三寶種作熾然，　　護養所有佛聲聞，　我勸一切諸眾生，　　名衣上饌而供養。」",
        "translation": "I encourage all sentient beings to offer name-dropped robes and superior foods as a tribute to the buddhas and śrāvakas who are flaming hot with the seeds of the Three Treasures.\"",
        "source": "T13n0397_047:0305b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中諸來大眾，若天、若人、乾闥婆等同聲讚言：「善哉，善哉！」",
        "translation": "At that point, the assembled crowd of gods, humans, and gandharvas alike shouted, \"Good, good!\"",
        "source": "T13n0397_047:0305b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告慧命憍陳如而說偈言：「我已告汝聲聞眾，　　所有相應求解脫，　常樂所依四聖種，　　以彼得滿菩提道。",
        "translation": "It was then that the Bhagavān addressed Wisdom Life Kauṇḍinya and spoke in verse, \"I've told you, śrāvakas, about the four noble seeds that are associated with seeking liberation, the four noble seeds that are constant sources of joy, and the path to enlightenment that Peter fulfills.",
        "source": "T13n0397_047:0305b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如樹果繁速自害，　　竹蘆結實亦如是，　如騾懷妊自喪身，　　無智求利亦復然。",
        "translation": "Like a tree whose fruit proliferates and quickly harms itself, so does a bamboo or reed that bears fruit, like a maid who loses her own body while pregnant, so does a person who lacks wisdom and seeks gain.",
        "source": "T13n0397_047:0305c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦如盛夏惡雹雨，　　傷害一切諸苗稼，　如是貪求利養者，　　必當速失勝菩提。",
        "translation": "Also like the bad hailstorm in the middle of summer that wounds all the crops, so someone who craves gain will quickly lose their superior enlightenment.",
        "source": "T13n0397_047:0305c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又如諸樹華開敷，　　而復為火所焚燒，　如是貪求利養者，　　亦當退失菩提道。",
        "translation": "Also, like when a tree in full bloom is burned by fire, so someone who covets gain will lose the path to enlightenment.",
        "source": "T13n0397_047:0305c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有比丘得供養，　　樂求利養堅著者，　於世更無如此惡，　　故令不得解脫道，　如是貪求利養者，　　既得道已還復失。」",
        "translation": "If a monk makes offerings and is attached to seeking profit, there's nothing more unwholesome in the world that would cause him not to attain the path to liberation, and thus he who covets profit will lose it again after attaining the path.\"",
        "source": "T13n0397_047:0305c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王聞說偈已，即自念言：「沙門瞿曇知我虛偽詐現歸依。」",
        "translation": "After hearing the verse, the Māra King then thought to himself, \"The ascetic Gautama knows that I'm being deceptive and deceitful, and he relies on him.\"",
        "source": "T13n0397_047:0305c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羞愧默然，退坐一面聽法而住。",
        "translation": "Ashamed and silent, he withdrew to sit to one side and listened to the teaching.",
        "source": "T13n0397_047:0305c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔諸婦女諸根形貌容狀光色，皆悉枯悴變成惡色，背僂跛躄醜陋弊惡。",
        "translation": "All of Māra's women's faculties, physical appearance, appearance, and appearance shine, and they all wither and turn badly, and their backs are lame and ugly.",
        "source": "T13n0397_047:0305c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有男夫都不復能歌舞調戲，五音作樂皆悉閉塞不能出聲，却坐一面，聽法而住。",
        "translation": "All the men and boys can no longer sing, dance, or play, and all five musical instruments are shut off and unable to make a sound, so they sit to one side and listen to the teaching.",
        "source": "T13n0397_047:0305c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經月藏分諸阿修羅詣佛",
        "translation": "The moon-store portion of the Mahāsaṃgha-sūtra has asuras visiting the Buddha.",
        "source": "T13n0397_047:0305c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所品第三",
        "translation": "the third of the categories",
        "source": "T13n0397_047:0305c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，月藏菩薩摩訶薩為欲攝化諸眾生故，說月幢月呪句之時，於彼四大阿修羅王所治之處，一切所有草木、華果、眾寶、瓔珞莊嚴之事，衣服、臥具皆悉變成半月而現。",
        "translation": "At the time, when the moon-store bodhisattva Mahāsattva wanted to gather sentient beings for transformation and spoke the words of the moon-banner-moon spell, all the plants, trees, flowers, fruits, treasures, and things adorned with jewelry, as well as clothing and bedding, all turned into half moons and appeared in the places ruled by the four major asura kings.",
        "source": "T13n0397_047:0305c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等諸事迭相掁觸出五音聲，所有鼓貝箜篌箏笛具足作樂，彼等音中亦復演出如是偈句：「唯佛化導以安隱，　　并眾住在佉羅山，　於臭煩惱拔眾生，　　為其說法永斷除。",
        "translation": "Five sounds emanate from the contact of those things, and all the drums, conchs, harps, and flutes make music, and this verse also plays in those sounds, \"Only the Buddha guides and secures them, so he dwells among them on Mount Kharo, plucks up sentient beings from their smelly afflictions and explains the Dharma for them, forever ending them.",
        "source": "T13n0397_047:0305c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡夫悉墮生死海，　　煩惱駛河起波浪，　三有更無哀愍者，　　如牟尼尊慈善心。",
        "translation": "All worldlings fall into the ocean of birth and death, the river of affliction sends up waves, and there's no one among the three realms who's compassionate like His Holiness Muni's charitable heart.",
        "source": "T13n0397_047:0305c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多眾聚集一方所，　　天人鳩槃龍夜叉，　悉依佉羅帝山所，　　於諸苦畏求解脫。",
        "translation": "Many multitudes gather at one place, and gods, humans, kumbhâṇḍas, dragons, and yakṣas all rely on Mount Kharādī to seek liberation from suffering and fear.",
        "source": "T13n0397_047:0306a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等俱時速詣彼，　　為欲聽聞正法故，　魔王不久或來此，　　而為我等作留難。",
        "translation": "We all quickly go there at the same time, wanting to hear the right teaching, but the demon king might come here soon and make things difficult for us.",
        "source": "T13n0397_047:0306a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一心聽受勝妙法，　　於彼淨心得大福，　以福長壽除諸怨，　　於世常受威德樂。",
        "translation": "With one mind, we'll listen to the surpassing and wonderful Dharma, purify our minds and experience great merit there, use that merit to live a long life free of enmity, and always enjoy the dignity and virtue of the world.",
        "source": "T13n0397_047:0306a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若以此福求解脫，　　斷諸煩惱得羅漢，　及斷諸緣作辟支，　　亦能成佛具諸樂。",
        "translation": "If they seek liberation based on this merit, they'll eliminate the afflictions and become a arhat, cut off all kinds of conditions and become a pratyekabuddha, and they'll also become a buddha with all kinds of happiness.",
        "source": "T13n0397_047:0306a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是當得無有疑，　　是故速捨諸緣縛，　一切當起清淨心，　　速到佛所修供養。",
        "translation": "Thus will attain freedom from doubt, so they'll quickly abandon the bonds of conditioning, all will arouse a pure mind, and quickly go to the Buddha to cultivate offerings.",
        "source": "T13n0397_047:0306a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從此賢劫初以來，　　未有如是大眾集，　於後久遠彌勒興，　　我等不得許時壽。」",
        "translation": "Since the beginning of this good eon, there hasn't been such a large gathering of people, and since Maitreya's rise in the distant future, we won't be allowed to live for much longer.\"",
        "source": "T13n0397_047:0306a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，於彼四阿修羅城邑宮殿，有如是事，以菩薩力莊嚴加持故，聞是句義皆生信心，各各於其城邑宮殿雲集一處，共相謂言：「今當於此欲有何事？",
        "translation": "At the time, these four asuras in their cities and palaces who had such an event, adorned and sustained by the power of the bodhisattvas, all became confident when they heard what this meant, and each gathered in a cloud in their city or palace, saying together, \"What do you want to do here now?",
        "source": "T13n0397_047:0306a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "What is the reason?",
        "source": "T13n0397_047:0306a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等昔來未曾見者今得見之，昔未聞者今得聞之，無人知者。」",
        "translation": "We have never seen them in the past but now we've seen them, and we've never heard them in the past but now we've heard them, and no one knows about them.\"",
        "source": "T13n0397_047:0306a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬從己宮下欲禮佛故而往散華，所散之華於四天下皆作華雨。",
        "translation": "Māra Pāpīyān then descended from his palace to scatter flowers in order to pay homage to the Buddha, and the flowers he scattered made a shower of flowers in the four heavens.",
        "source": "T13n0397_047:0306a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當雨之時，於四阿修羅城邑宮殿，遍一切處皆悉變作最極臭穢，及惡烟塵灰土[土*蓬][土*孛]處處盈滿，蚊虻、蛇蝎、諸惡毒蠅亦復悉滿，憂愁惱亂不可愛樂。",
        "translation": "When it rained, the four asura cities and their palaces were completely filled with the worst stench, and there was a lot of bad smoke, dust, ashes, [dirt, dust] [dirt, dust, dust], mosquitoes, snakes, scorpions, and other bad poisonous flies, which caused grief and distress and were unpleasant.",
        "source": "T13n0397_047:0306a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於爾時，諸阿修羅城邑宮殿皆悉黑闇，一切阿修羅男夫婦女、童男童女，悉懷最極憂愁惱亂不樂住彼，各於巷陌迭相雲集，至己王所在前住立。",
        "translation": "At the time, the asura cities and palaces were all darkened, and all the asura men, women, boys, and girls who were most distressed and troubled didn't want to stay there, so they gathered in clouds one by one in the lanes and streets and went to stand in front of the king's residence.",
        "source": "T13n0397_047:0306a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿修羅王見諸衰害極增憂惱，毘摩質多羅阿修羅王，與諸眷屬及所治處一切阿修羅男夫婦女、童男童女，波羅陀阿修羅王、跋持毘盧遮那阿修羅王，與諸眷屬及所治處男夫婦女、童男童女，向羅睺羅阿修羅王所治城邑聚落宮殿。",
        "translation": "When the king of the asuras saw what was happening to them, he was deeply distressed, and the king of the asuras Vimalacitra, along with his retinue and all the asura men, women, boys, and girls in the place they ruled, the king of the asuras Paranta and Vajraciana, along with their retinues and the men, women, boys, and girls in the place they ruled, went to the palace of the city that the king of the asuras ruled.",
        "source": "T13n0397_047:0306a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見彼如是諸惡惱亂蚊虻蛇蝎毒蠅等已，三阿修羅王俱至羅睺羅阿修羅王所，於前住立。",
        "translation": "After seeing these kinds of harmful and disruptive things like gnats, horseflies, snakes, scorpions, poisonous flies, and so forth, the three asura kings all went to King Rāhula asura and stood there in front of him.",
        "source": "T13n0397_047:0306b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘摩質多阿修羅王，請問羅睺羅阿修羅王，而說偈言：「一切修羅諸宮殿，　　猶如地獄等無異，　熱風暴起來至此，　　一切狀似火燒焚，　所有樹林諸果實，　　悉皆墮落在於地。",
        "translation": "King Vemacitra asura asked King Rāhula asura about them and spoke in verse, \"All the asura palaces and mansions are like hell and no different, a hot wind rises up and comes here, everything looks like it's on fire, and all the fruits of the trees and forests fall to the ground.",
        "source": "T13n0397_047:0306b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有蓮華及浴池，　　草苗眾華悉枯竭，　烟塵[土*蓬][土*孛]於我等，　　阿修羅城諸宮殿，　及有蚊虻蚤惡蠅，　　無量諸惡毒蟲等。",
        "translation": "There are lotus flowers and bathing pools, grasses and flowers that have all withered, smoke [dirt * puff] [dirt * comet] on us, the palaces of the city of asuras, mosquitoes, fleas, bad flies, and countless other malicious, poisonous insects.",
        "source": "T13n0397_047:0306b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今聞如是眾惡聲，　　眾生多惱不喜樂，　諸阿修羅受此苦，　　悉為飢渴所逼惱，　苦逼無所可歸依，　　一切驚怖心焦枯，　生死畏等誰威力，　　而不利益我天龍，　以何方便令休息，　　如是種種怖畏事？",
        "translation": "Now, when I hear such many bad sounds, sentient beings are often vexed and displeased, and asuras are subjected to this suffering, all are stifled by hunger and thirst, have no refuge from suffering, are terrified and depressed, fear birth and death, and so forth.",
        "source": "T13n0397_047:0306b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非是惡龍來至此，　　降伏我等阿修羅？」",
        "translation": "Is it not a malevolent dragon that has come here to subdue us asuras?\"",
        "source": "T13n0397_047:0306b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅睺羅阿修羅王說偈答言：「阿修羅輩汝諦聽，　　我等昔日具安樂，　五欲所須皆稱意，　　神通勇健有大力，　所持弓刀及箭矟，　　羂索矛[矛*贊]劍輪等，　一切今當悉退落，　　城邑巷陌盡茫然。",
        "translation": "It was then that Rāhula, the king of the asuras, spoke a verse in reply, \"Listen, you asuras, we used to have well-being, the five desires we desired, superb strength and power, bows and swords and arrows we wielded, carabiners and spears [spears*zan], swords and wheels, and so forth, all of which will now retire, and all the cities and lanes will be lost.",
        "source": "T13n0397_047:0306b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　男夫婦女先凶健，　　顏色端正有勢力，　悉與諸天共齊等，　　於今時中定當盡。",
        "translation": "Men, women, and men who are first fierce and strong, correct in appearance and powerful, will all be equal with the gods, and their lives will surely end in the present time.",
        "source": "T13n0397_047:0306b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　命盡眾生白法盡，　　羞恥慚愧解心盡，　及聰明人所知盡，　　巧行與善聖智盡，　苗稼及諸華藥盡，　　果味等盡諸戒盡，　所欲稱意音樂盡，　　眾寶衣服飲食盡，　喜樂事盡人天盡，　　夜叉乾闥修羅盡，　婆羅門種剎利盡，　　并諸毘舍首陀盡。",
        "translation": "Their lives will be ended, sentient beings' white dharmas will be ended, their shame, conscience, and understanding will be ended, their skillful conduct and good noble wisdom will be ended, their crops and flowers and medicines will be ended, their fruits and flavors will be ended, their precepts will be ended, the music they desire will be ended, their clothing and food will be ended, their pleasures will be ended, the human and divine beings will be ended, the yakṣas and gandharvas will be ended, the brāhmaṇas and bhadras will be ended, and the vaiśas and shuddhas will be ended.",
        "source": "T13n0397_047:0306b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惟共諸惡眾生等，　　非聖諂曲殺盜婬，　妄語兩舌綺惡口，　　貪恚胆侫癡邪見，　儉短增長及飢渴，　　愛離怨會與捕獵，　見他得利生嫉忌，　　割截斬斫諸破壞，　毒害刀矟劍輪增，　　面目流淚憂悲苦。",
        "translation": "But together with these evil beings, they are unholy, flattering, murderous, thieving, and lascivious; they speak falsely, duplicitously, and with fancy and bad breath; they crave, rage, squawk, and delusion; they grow frugal and thirsty; they associate with enemies and hunters; they become jealous when they see others gaining profit; they cut and chop and wreak havoc; they increase the poisonous sword and lance, and their faces weep with sorrow and pain.",
        "source": "T13n0397_047:0306c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　蚊虻惡風及烟塵，　　斯等竝來為觸惱，　地獄畜生與餓鬼，　　是等境界大苦海，　此非善行相應時，　　念念退失於正見。",
        "translation": "Mosquitoes, bad winds, and smoke and dust come together to cause contact and annoyance, and hell, animals, and hungry ghosts are a great ocean of suffering in these realms. When these things aren't associated with good actions, they are mindfully lost in right view.",
        "source": "T13n0397_047:0306c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　白業之人惡事增，　　如是眾惡皆興盛，　是阿修羅盡時至，　　唯無等乘能遮止。」",
        "translation": "As a result of these white activities, evil deeds increase, and all these evils flourish, which bring about the end of the asuras and can be stopped only by the peerless vehicle.\"",
        "source": "T13n0397_047:0306c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，波羅陀阿修羅王白羅睺羅阿修羅王，說偈問言：「唯王為諸眾生故，　　常勤精進修諸法，　具大福德神通力，　　及以智慧莊嚴身。",
        "translation": "It was then that the king of the asuras Prādhara addressed the king of the asuras Rāhula, asking in a verse, \"Only the king makes constant effort to cultivate the Dharma for the sake of sentient beings, endowed with great merit, supernormal powers, and adorned with the body of wisdom.",
        "source": "T13n0397_047:0306c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此是何力誰所作，　　欲滅我等阿修羅；　誰能救護於我等？",
        "translation": "What power is this that would want to extinguish us asuras and who would be able to rescue us?",
        "source": "T13n0397_047:0306c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當禮敬彼而歸依。」",
        "translation": "You must revere them and turn to them.\"",
        "source": "T13n0397_047:0306c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅睺羅阿修羅王說偈答言：「此非釋梵天王力，　　亦非自在那羅延，　又非夜叉及龍神，　　惟除魔王欲自在。",
        "translation": "It was then that Rāhula, the king of the asuras, spoke a verse in reply, \"This is not the power of Brahmā, nor is it the Śivi Nārāyaṇa, nor are they yakṣas and dragons, but only the desire of the demon king for mastery.",
        "source": "T13n0397_047:0306c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔惱諸龍亦如是，　　大仙瞿曇為斷除，　我等禮彼瞿曇仙，　　能施我等安樂故。」",
        "translation": "So were the dragons who were afflicted in the past, but the great sage Gautama removed them, and we worship that sage Gautama for his ability to give us comfort.\"",
        "source": "T13n0397_047:0306c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋持毘盧遮那阿修羅王以偈問言：「為是天人龍夜叉，　　能施一切安樂者，　彼何神通精進力，　　為當方便造幻惑，　於何法中得自在，　　何誰能受彼教勅，　為於魔力得解脫，　　而得何力使其然？」",
        "translation": "It was then that the king of the Vajraśekhara asuras asked in a verse, \"Why is it that gods, humans, dragons, and yakṣas can bestow all kinds of well-being, what is their power of extraordinary effort, what illusory mental disturbances do they create for future skillful means, in what dharmas do they attain mastery, and who is capable of accepting their commands, of attaining liberation through the power of Māra, and what power do they attain to make it so?\"",
        "source": "T13n0397_047:0306c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅睺羅阿修羅王以偈答言：「昔見端正大沙門，　　端坐菩提樹陰影，　魔將軍眾而詣彼，　　以慈悲力速降伏。",
        "translation": "It was then that Rāhula, the king of asuras, replied with a verse, \"I once saw a correct ascetic sitting upright in the shadow of the bodhi tree, and an army of demons approached him, quickly subduing them with the power of compassion.",
        "source": "T13n0397_047:0306c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼得成勝菩提，　　超過一切諸天眾，　具大慈悲入涅槃，　　故能枯竭眾苦海。",
        "translation": "Attaining supreme enlightenment, Peter surpassed all the gods and entered nirvāṇa with great compassion, so he was able to dry up the ocean of suffering.",
        "source": "T13n0397_047:0307a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此諸仙中最勝幢，　　具足十力眾生藥，　釋梵自在修羅仙，　　欲自在魔那羅延，　悉禮於彼作歸處，　　是人能示眾解脫，　於諸一切三界中，　　超勝所有諸天眾。",
        "translation": "The most distinguished of these sages, he possesses the ten powers that are the medicine for sentient beings, the Śubha-vyūha sage, and the Māra-nārāyaṇa with sovereign desires, and they all bow to him as a place of refuge, so he can show all people their liberation and surpass all the gods in all the three realms.",
        "source": "T13n0397_047:0307a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　調伏寂靜降諸根，　　樂寂七聖財莊嚴，　安住涅槃到彼岸，　　悉能枯竭煩惱海。",
        "translation": "Regulating tranquility and subduing the sense faculties, he enjoys the adornment of the seven noble possessions, abides in nirvāṇa, and reaches the other shore, and can completely dry up the ocean of affliction.",
        "source": "T13n0397_047:0307a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故我等一切眾，　　悉歸能滅諸苦者，　皆持種種妙香花，　　各各合掌而求請。」",
        "translation": "Therefore, we all go to him who can end suffering and carry a variety of wonderfully fragrant flowers, which we each ask for with folded palms.\"",
        "source": "T13n0397_047:0307a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅睺羅、毘摩質多羅、波羅陀、跋持毘盧遮那四阿修羅王，及男夫婦女、童男童女，所有一切阿修羅眾皆悉雲集，有以燒香供養禮佛而求請者；有持種種雜色妙華，有持種種摩尼寶珠，有持種種幢幡、寶蓋、金縷、真珠、瓔珞、衣服，以用奉佛而求請者；有持種種箏瑟、箜篌、簫笛、鼓吹五音作樂，供養禮拜求請佛者。",
        "translation": "At the time, four asura kings, Rāhula, Vimalacitra, Pārata, and Vairocana, as well as men, women, boys, and girls, and all the other asuras assembled, some of whom burned incense, made offerings to the Buddha, and asked for his support; some carried various kinds of exquisitely colored flowers, some carried various kinds of precious maṇi beads, some carried various banners, banners, jeweled canopies, threads of gold, real beads, jewelry, and clothing, which they used to present to the Buddha and ask for his support; and some carried various zither, harp, flutes, and drums that made five kinds of music, which they worshipped and asked for his support.",
        "source": "T13n0397_047:0307a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅睺羅阿修羅王以己神通境界之力，大身遊戲兩手執持帝釋毘楞伽摩尼寶鬘，頭面禮拜遙奉世尊。",
        "translation": "With the power of his own superknowledge, Rāhula the king of the asuras put his large body in play and held in his two hands the jeweled garland of the Tissa-vairocana maṇi, bowed his head and face, and paid homage to the Bhagavān.",
        "source": "T13n0397_047:0307a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說偈讚曰：「佛為眾生樂，　　久修諸苦行，　憐愍一切眾，　　願亦愍我等。",
        "translation": "He spoke a verse in praise, \"The Buddha cultivates long-standing ascetic practices for the happiness of sentient beings, pities all beings, and wishes to pity us as well.",
        "source": "T13n0397_047:0307a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　忍辱如大地，　　悲愍諸眾生，　休息諸濁惡，　　愍覆於我等。",
        "translation": "As patient as the great earth, he takes pity on sentient beings, rests from all the impurity of evil, and takes pity on us.",
        "source": "T13n0397_047:0307a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛度諸畏訖，　　得於無上智，　等心於眾生，　　願愍阿修羅。",
        "translation": "The Buddha liberates the weary, attains unsurpassed knowledge, is equanimous in mind toward sentient beings, and wishes to pity asuras.",
        "source": "T13n0397_047:0307a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛以八聖船，　　度脫苦眾生，　涅槃味充飽，　　慈念阿修羅。",
        "translation": "With the eight holy vessels, the Buddha liberates suffering sentient beings, fills them with the taste of nirvāṇa, and is compassionate toward asuras.",
        "source": "T13n0397_047:0307a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛於諸眾生，　　不恥惡種姓，　一切如赤子，　　是故歸依佛。」",
        "translation": "The Buddha is unashamed of bad seeds in all sentient beings, and he treats them all like naked children; therefore, they rely on the Buddha.\"",
        "source": "T13n0397_047:0307b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘摩質多羅阿修羅王以兩手捧持一切諸天登祚所著摩尼寶鬘，頭面作禮，以偈讚曰：「勝過天龍眾，　　修羅鳩槃茶，　盡除諸煩惱，　　心意所作惡，　降伏業苦道，　　而到於彼岸。",
        "translation": "At the time, King Vimalacitra the Asura held in his two hands the jeweled maṇi garlands worn by all the gods who had ascended to the throne, saluted them with his head and face, and praised them in verse, saying, \"They're superior to the multitude of gods and dragons, the tea of the asuras' lotus, they remove all afflictions and the evils of mind and thought, subdue the course of suffering, and reach the other shore.",
        "source": "T13n0397_047:0307b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離於有想，　　及無想眾生，　悲念眾生故，　　不入於涅槃。",
        "translation": "They're far removed from beings with and without ideation, and because they're compassionate toward sentient beings, they don't enter nirvāṇa.",
        "source": "T13n0397_047:0307b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為諸眾生故，　　能忍一切苦，　視於諸眾生，　　如母念一子，　願愍於此等，　　苦處灑悲水。",
        "translation": "Being able to endure all suffering for the sake of sentient beings, he regards sentient beings as a mother mindful of her one child and wishes to pity them, showering compassionate water on their painful places.",
        "source": "T13n0397_047:0307b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　休息苦惱觸，　　煩惱水所溺，　起發堅勇者，　　願救眾生苦。",
        "translation": "Resting under the touch of suffering and affliction, submerged in the waters of affliction, he arouses a resolute and courageous man who wants to save sentient beings from suffering.",
        "source": "T13n0397_047:0307b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　念今苦苦至，　　為魔力所壞，　苦觸阿修羅，　　願灑大悲水。",
        "translation": "Mindful of the present suffering and distress that has arrived, destroyed by the power of Māra, and touched by the pain of asuras, he wishes to sprinkle the water of great compassion.",
        "source": "T13n0397_047:0307b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生若於佛，　　起於瞋惡心，　而不能動佛，　　身心少分者。",
        "translation": "If sentient beings become angry with the Buddha and become hostile, they can't move him, and there's a small part of their body and mind.",
        "source": "T13n0397_047:0307b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若彼所有樂，　　境界身心事，　佛常等慈悲，　　於此更無異。",
        "translation": "If there were things that they enjoyed, things in the realm of body and mind, the Buddha's constant and equal compassion would be no different than this.",
        "source": "T13n0397_047:0307b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惟佛於天人，　　能施一切樂，　我等為魔惱，　　心孤無所依。",
        "translation": "Only the Buddha can bestow all kinds of happiness on gods and humans, but we're tormented by Māra, and our minds are lonely and have no support.",
        "source": "T13n0397_047:0307b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無有餘眾生，　　能滅於魔業，　惟佛速除遣，　　盡壞無有餘。",
        "translation": "There are no other sentient beings who can extinguish demonic activity, but the Buddha quickly removes them, destroying them without remainder.",
        "source": "T13n0397_047:0307b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天龍證知，　　夜叉阿修羅，　如佛眾生最，　　能救一切苦。",
        "translation": "Gods and dragons know and realize that yakṣas and asuras are like the most numerous of Buddha's sentient beings and can save them from all suffering.",
        "source": "T13n0397_047:0307b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　魔欲速滅我，　　修羅諸宮殿，　願速放戒光，　　施我滿足樂。」",
        "translation": "When the devil desires to quickly extinguish me, let him quickly release the light of morality in the palaces of the asuras and bestow his happiness upon me.\"",
        "source": "T13n0397_047:0307b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，波羅陀阿修羅王兩手捧持梵天光幢摩尼寶珠和合天鬘，頭面作禮，說偈讚曰：「流轉獄所縛，　　離諸一切樂，　極惡大巨海，　　沒溺無所依。",
        "translation": "It was then that the king of the asuras of Pārata held the Brahmā's beams of light, the maṇi-jewel, and the wreath of the gods in his two hands, saluted him with his head and face, and spoke a verse in praise, saying, \"Bound by the bonds of transmigration and hell, I'm free of all pleasure, submerged in the great ocean of extreme evil, and have no refuge.",
        "source": "T13n0397_047:0307c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯佛精勤行，　　於三阿僧祇，　自度到彼岸，　　悉竭煩惱海。",
        "translation": "Only the Buddha's diligent practice, in the three incalculable eons, brings him to the other shore by himself, completely drying up the ocean of affliction.",
        "source": "T13n0397_047:0307c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為諸眾生故，　　六年行苦行，　而得無上智，　　滅除彼煩惱。",
        "translation": "For the sake of sentient beings, he practices austerities for six years and attains unsurpassed knowledge, which destroys those afflictions.",
        "source": "T13n0397_047:0307c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等為魔嬈，　　無力受諸苦，　願除魔所加，　　洗浴我等宮。",
        "translation": "We've been bullied by Māra, and we're powerless to suffer. May we remove Māra's influence and bathe our palaces.",
        "source": "T13n0397_047:0307c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此等僧祇眾，　　為諸苦所惱，　願救此諸苦，　　當往見世尊。」",
        "translation": "These incalculable beings are afflicted by suffering, so let's go see the Bhagavān to save them from that suffering.\"",
        "source": "T13n0397_047:0307c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋持毘盧遮那阿修羅王兩手捧持梵天艶光摩尼寶鬘，頭面作禮，以偈讚曰：「今禮牟尼尊，　　於法自在者，　超過釋梵王，　　降魔及軍眾，　超過日月光，　　及與四天王，　慈悲明日月，　　普照諸眾生。",
        "translation": "At that point, the Vajra-vairocana asura king held a jeweled garland of Brahmakāyika special light in both hands, saluted with his head and face, and praised him in verse, \"Now I salute the Bhagavān, the Dharma sovereign who surpasses Brahmakāyika, subdues Māra and the army, surpasses the light of the sun and moon, and the four heavenly kings, whose compassionate sun and moon shine brightly and universally illuminating all sentient beings.",
        "source": "T13n0397_047:0307c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五日並出時，　　海水悉枯竭，　若供佛功德，　　無能枯竭者。",
        "translation": "When five suns arise together, the ocean's water always dries up, but if he makes offerings to the Buddha's merit, there's nothing that can dry it up.",
        "source": "T13n0397_047:0307c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　超度於三界，　　而入無畏城，　大悲覆眾生，　　諸苦悉除滅。",
        "translation": "They transcend the three realms and enter the city of fearlessness, where great compassion covers sentient beings and all suffering is completely eliminated.",
        "source": "T13n0397_047:0307c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　等心諸眾生，　　如母視一子，　我等憂翳障，　　慈風願吹散。",
        "translation": "Equally minded among sentient beings, like a mother regarding her one child, the wind of compassion wishes to blow away the cataracts of our grief.",
        "source": "T13n0397_047:0307c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　更無餘歸依，　　可救我等苦，　如佛功德滿，　　莫捨修羅宮。」",
        "translation": "There's no other refuge that will save us from suffering, just like the Buddha's merit is complete, so don't abandon the shrine palace.\"",
        "source": "T13n0397_047:0307c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以佛耳聞、以佛眼見諸阿修羅城邑宮殿，魔力所加，一切諸難皆悉周遍無有遺餘俱受熱惱：「願樂求我蔭覆救護，為歸為趣。",
        "translation": "It was then that the Bhagavān heard with the Buddha's ears and saw with the Buddha's eyes that the cities and palaces of the asuras were overcome by the power of magic, and all of their difficulties were completely surrounded by nothing left, and they all suffered from the heat: \"May I happily be asked to shield and protect them, so that they can return to their destinies.",
        "source": "T13n0397_047:0307c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當救護諸阿修羅，今正是時。」",
        "translation": "Now is the right time for me to rescue all the asuras.\"",
        "source": "T13n0397_047:0308a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時，世尊以大悲威勢現一切樂，即入悲風光明三昧，三昧力故，令四阿修羅宮殿所有魔之神力所加苦事，一念之頃皆悉休息還復如故，亦如三十三天宮殿，於中即現第一妙樂可樂之事。",
        "translation": "At that point, the Bhagavān, with the authority of great compassion, manifested all happiness and immediately entered the samādhi of the light of the compassionate wind, which, by its power, caused all the suffering inflicted by the spiritual power of Māra in the palace of the four asuras to be rested in a moment's thought and return to their former state, just like the palace of the Trāyastriṃśa Heaven, in which the most wonderful and pleasant things were manifested.",
        "source": "T13n0397_047:0308a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸阿修羅見已，踊躍心生歡喜，口眼皆悅熈怡微笑，皆作是言：「南無佛陀。",
        "translation": "Seeing this, those asuras leap for joy, their mouths and eyes are delighted, they smile pleasantly, and they all say, \"Homage to the Buddha!",
        "source": "T13n0397_047:0308a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南無佛陀。」",
        "translation": "Homage to the Buddha!\"",
        "source": "T13n0397_047:0308a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，即以諸天勝妙寶鬘，向佛方所遙擲奉獻。",
        "translation": "After they said that, they tossed the gods' superb jeweled garlands to the Buddha's direction and presented them to him.",
        "source": "T13n0397_047:0308a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其羅睺羅阿修羅王所擲寶鬘即到佛所，於佛頂上空中而住。",
        "translation": "The jeweled garlands tossed by Rāhula the king of the asuras then reached the Buddha and stayed up in the air above his head.",
        "source": "T13n0397_047:0308a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘摩質多羅阿修羅王所擲寶鬘亦到佛所，於虛空中住右肩上。",
        "translation": "The jeweled garland tossed by King Vimalacitra the Asura also reached the Buddha and stayed on his right shoulder in the sky.",
        "source": "T13n0397_047:0308a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波羅陀阿修羅王所擲寶鬘亦到佛所，於虛空中住左肩上。",
        "translation": "The jeweled garland tossed by King Pratibhāna asura also reached the Buddha and stood on his left shoulder in the sky.",
        "source": "T13n0397_047:0308a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "跋持毘盧遮那阿修羅王所擲寶鬘亦到佛所，住於佛前放光而照。",
        "translation": "The jeweled garland tossed by King Bhadrika Vairocana also reached the Buddha and stood in front of him, emitting a light that shone brightly.",
        "source": "T13n0397_047:0308a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其餘所有諸阿修羅，復持種種眾寶香華、幢幡、寶蓋，及以金縷、寶珠、天鬘、真珠、瓔珞、種種衣服、塗香、末香，彼等一切悉向世尊遙擲奉獻，而以供養。",
        "translation": "The other asuras also carried various kinds of fragrant flowers, banners, and jeweled canopies, as well as gold thread, precious beads, celestial garlands, real beads, jewelry, various kinds of clothing, and smeared and powdered incense, all of which they tossed out to the Bhagavān to make offerings.",
        "source": "T13n0397_047:0308a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，於此佉羅帝山牟尼諸仙所依住處，雨種種華乃至末香如降暴雨。",
        "translation": "At the time, at this place on Mount Kharādī where the sages of Muni were staying, it rained down a deluge of flowers and even fragrant incense.",
        "source": "T13n0397_047:0308a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有菩薩摩訶薩名求斷疑，從座而起偏袒右肩，合掌禮佛，以偈問曰：「大仙世尊無量智，　　於先已雨如是雨，　現諸神通變化瑞，　　月藏菩薩來到此。",
        "translation": "At the time, a bodhisattva in the assembly named Seeking to End Doubt rose from his seat, bared his right shoulder, put his palms together, saluted the Buddha, and asked in a verse, \"Great man, the Bhagavān has measureless wisdom, and after raining this kind of rain, he showed us all the miraculous powers and miraculous changes, and the moon-store bodhisattva came here.",
        "source": "T13n0397_047:0308a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今復雨於種種寶，　　誰當復來到於此？",
        "translation": "Now, it's raining various treasures, so who will come here again?",
        "source": "T13n0397_047:0308a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為是大德諸菩薩，　　為是他方諸佛使？」",
        "translation": "Are these bodhisattvas of great virtue and are they the messengers of buddhas from other directions?\"",
        "source": "T13n0397_047:0308a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告求斷疑菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Buddha addressed the bodhisattva Mahāsattva seeking to end doubt, \"Good sons!",
        "source": "T13n0397_047:0308a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是魔王波旬，於四阿修羅城邑宮殿，化作陰闇、灰塵、烟霧、蚊虻、毒蠅及以種種毒蛇、蜂蝎，於彼一切樹林、草木、華果、泉池皆悉枯涸，一切阿修羅苦困欲死。",
        "translation": "Here's Māra King Pāpīyān, who transforms four asura cities and palaces into darkness, dust, smoke, gnats, poisonous flies, and various venomous snakes, bees, and scorpions, where all the trees, grass, trees, flowers, fruits, and springs and pools dry up, and all the asuras are trapped and want to die.",
        "source": "T13n0397_047:0308a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等向我一心歸依合掌作禮，以種種華乃至末香，於彼阿修羅所住城邑，向我遙擲而作供養。",
        "translation": "They bow with their palms together in homage to me with wholehearted reliance, and they make offerings to me by tossing flowers of various kinds, down to the finest incense, at the cities where those asuras live.",
        "source": "T13n0397_047:0308b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅睺羅阿修羅王所擲寶鬘，今我頂上者是也。",
        "translation": "That's the jeweled garland tossed by Rāhula, the king of the asuras, and it's now on top of my head.",
        "source": "T13n0397_047:0308b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘摩質多羅阿修羅王所擲寶鬘，在我右肩者是也。",
        "translation": "That's the jeweled garland tossed by King Vimalacitra asura that's on my right shoulder.",
        "source": "T13n0397_047:0308b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波羅陀阿修羅王所擲寶鬘，在我左肩者是也。",
        "translation": "That's the jeweled garland tossed by King Paranirmita-vaśubha asura that's on my left shoulder.",
        "source": "T13n0397_047:0308b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "跋持毘盧遮那阿修羅王所擲寶鬘，今在我前者是也。」",
        "translation": "That's the jeweled garland tossed by King Vajraciana asura that's now in front of me.\"",
        "source": "T13n0397_047:0308b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王波旬從坐而起，向佛合掌恭敬禮拜，而作是言：「此諸阿修羅蒙佛恩福，我今亦令諸阿修羅還得具足饒益安樂。」",
        "translation": "At that point, Māra King Pāpīyān rose from his seat, bowed his palms together in respect to the Buddha, and said, \"These asuras have been blessed by the Buddha's grace, and now I will also cause these asuras to regain complete benefit and well-being.\"",
        "source": "T13n0397_047:0308b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告波旬：「汝今不須作如是言，我已令其充足安樂。",
        "translation": "The Buddha told Pāpīyān, \"You don't need to say that now; I've made it abundantly comfortable for you.",
        "source": "T13n0397_047:0308b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我諸阿修羅城邑宮殿，轉勝微妙樂具悉有還復如故。",
        "translation": "My asuras' cities and palaces are fully supplied with the most subtle and wonderful things, and they'll return to them as before.",
        "source": "T13n0397_047:0308b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_047:0308b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等四大阿修羅王是我親舊，如是其餘所有一切阿修羅等，於我得信敬仰尊重心生希有，今當不久來至於此為聽法故。」",
        "translation": "Those four major asura kings are my close friends, and so are all the other asuras who have gained faith in me, respected, venerated, and had high hopes that they would come here soon in order to hear the teaching.\"",
        "source": "T13n0397_047:0308b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王波旬復生惡心，而作是念：「我是一切欲界之中最勝自在，於諸眾生能作苦樂。",
        "translation": "Again, Māra King Pāpīyān had a bad heart and thought, \"I'm the most powerful and sovereign among all the desire realms, and I'm capable of causing suffering and happiness for sentient beings.",
        "source": "T13n0397_047:0308b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門是人，何能狡猾幻惑異端妖邪多語，敢共我競而欲與我挍量比並？",
        "translation": "How could this ascetic, who is cunning, illusory, heretical, slanderous, and verbose, dare to compete with me and try to compare himself to me in terms of calculation?",
        "source": "T13n0397_047:0308b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋梵四王摩醯首羅那羅延天、轉輪聖王、一切眾生，無能與我挍量比並作相違者。",
        "translation": "The four Śakra kings, Mahêśvara, the Nārāyaṇa gods, the wheel-turning sage kings, and all sentient beings are incapable of measuring up to us and acting differently.",
        "source": "T13n0397_047:0308b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此瞿曇，作幻誑惑一切眾生，遍四天下地及虛空一切盈滿，皆悉欲見瞿曇故來，今此下賤畜生之類諸阿修羅亦復蒙攝。",
        "translation": "Now, the Gautama creates illusions that deceive all sentient beings, filling the four heavens, the earth, and space with everything that wants to see the Gautama, and this lowly animal species of asuras are also included.",
        "source": "T13n0397_047:0308b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當作魔之境界神通勢力遊戲所加，更作幻惑惱亂於彼沙門瞿曇，及以降伏諸來會眾。」",
        "translation": "Now, I will act as a demon whose objective realm is exceeded by his supernormal powers and play, and I will further create illusory confusion to disturb the ascetic Gautama and subdue the assembled multitude.\"",
        "source": "T13n0397_047:0308b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬觀其眷屬而說偈言：「諸魔各作念，　　我常降伏怨，　及惱此會眾，　　并禁阿修羅。」",
        "translation": "Māra Pāpīyān then observed his followers and spoke in verse, \"Each of these Māras is mindful that I'm always subduing enemies, afflicting this assembly, and restraining asuras.\"",
        "source": "T13n0397_047:0308b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「汝等見我力，　　昔於菩提樹，　天神為證明，　　我修真正法。",
        "translation": "The Bhagavān then spoke a verse, saying, \"You see my strength, for in the past, when I was at the bodhi tree, the gods testified to my cultivation of the true Dharma.",
        "source": "T13n0397_047:0308c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨汝所有力，　　恣汝當現之；　若能惱我者，　　我當作歸依。」",
        "translation": "Whatever strength you have, you will freely display it; if you could disturb me, I would take you as refuge.\"",
        "source": "T13n0397_047:0308c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔王波旬復增第一極重瞋恨，以一切魔力境界神通遊戲所加，念於四方最熱之風，令其一切諸來大眾熱風觸惱而作降伏；于時世尊即入摧伏魔力三昧，其三昧力即於四方復起第一妙香涼風，觸其身分皆受快樂。",
        "translation": "At the time, Māra King Pāpīyān increased his first intense anger and, with the aid of all the demonic forces, applied his supernormal powers and games, mindfully created the hottest breezes in the four directions, causing all the people who came to be touched by those hot winds to be subdued.",
        "source": "T13n0397_047:0308c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王波旬知是事已，復於佛前化大火聚；世尊即於彼處化作清涼大池，水涌上出。",
        "translation": "After the demon king Pāpīyān realized this, he again turned into a great fire cluster in front of the Buddha, and the Bhagavān then turned it into a large, cool, refreshing pond, with water welling up and coming out of it.",
        "source": "T13n0397_047:0308c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王見已，復於空中降雨大石；佛即變其所雨之石，悉令化作種種天華而雨其處。",
        "translation": "After the demon king saw this, he then rained huge rocks in the air, and the Buddha transformed the rocks he was raining on into various celestial flowers that rained down on them.",
        "source": "T13n0397_047:0308c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王波旬及與眷屬，復以兩手捉佉羅帝山，而欲速疾震動三千大千世界；佛復以此三千地界加作金剛，尚不能動乃至一塵，況能多也。",
        "translation": "Māra King Pāpīyān and his retinue then grabbed Mount Kharādī with their two hands, intending to quickly shake the 3,000 great thousand worlds.",
        "source": "T13n0397_047:0308c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王復以瞋怒之力，向阿修羅所住之方，放口噓氣成黑氣雲，令其城邑宮殿陰闇，使諸阿修羅重復迷惑不能去來。",
        "translation": "Again, with the power of his anger, the demon king released his breath into a cloud of black air where the asuras were staying, causing their cities and palaces to be darkened, and causing the asuras to be repeatedly confused and unable to leave and come back.",
        "source": "T13n0397_047:0308c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即復變其所吹氣雲，令作種種天妙華雲。",
        "translation": "The Bhagavān then again transformed the cloud of air he was blowing into a variety of heavenly clouds of marvelous flowers.",
        "source": "T13n0397_047:0308c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，於彼四阿修羅城邑宮殿，復雨種種天華之雨，其華雨中演出百千微妙法門，所謂佛聲、法聲、僧聲、檀那波羅蜜聲乃至般若波羅蜜聲、三善行聲、三歸依聲、三律儀聲、三不護聲、三依止聲、三種菩提聲、三乘聲、三修聲、三種善根聲、越度三界聲、三受聲、三解脫聲、三示現聲、四念處聲、四正勤聲、四如意足聲、四不壞信聲、四禪聲、四梵住聲、四攝聲、四無礙智聲、四無色定三摩跋提聲、四聖諦聲、五根聲、五力聲、五支三昧聲、五解脫入聲、顯示六根聲、六和敬聲、六念聲、六通聲、七聖財聲、七識住聲、七覺分聲、八聖道聲、九次第定聲、十聖處聲、佛十力聲、大慈聲大悲聲、因緣生起聲、心不可壞聲、捨一切惡見聲、不忘菩提心聲、不退轉聲、忍聲、三昧聲、陀羅尼聲、授記登祚聲、無生忍聲、苦行聲、十地聲、十八不共佛法聲、到菩提聲、轉法輪聲、不可壞佛聲、捨聲、厭聲、解脫定聲、滅聲、成就眾生聲、攝受正法聲、辯才聲、無常聲、苦聲、無我聲、空聲、無所作聲、寂靜聲、無生聲、如聲、實際聲、入法界聲。",
        "translation": "爾時，於彼四阿修羅城邑宮殿，復雨種種天華之雨，其華雨中演出百千微妙法門，所謂佛聲、法聲、僧聲、檀那波羅蜜聲乃至般若波羅蜜聲、三善行聲、三歸依聲、三律儀聲、三不護聲、三依止聲、三種菩提聲、三乘聲、三修聲、三種善根聲、越度三界聲、三受聲、三解脫聲、三示現聲、四念處聲、四正勤聲、四如意足聲、四不壞信聲、四禪聲、四梵住聲、四攝聲、四無礙智聲、四無色定三摩跋提聲、四聖諦聲、五根聲、五力聲、五支三昧聲、五解脫入聲、顯示六根聲、六和敬聲、六念聲、六通聲、七聖財聲、七識住聲、七覺分聲、八聖道聲、九次第定聲、十聖處聲、佛十力聲、大慈聲大悲聲、因緣生起聲、心不可壞聲、捨一切惡見聲、不忘菩提心聲、不退轉聲、忍聲、三昧聲、陀羅尼聲、授記登祚聲、無生忍聲、苦行聲、十地聲、十八不共佛法聲、到菩提聲、轉法輪聲、不可壞佛聲、捨聲、厭聲、解脫定聲、滅聲、成就眾生聲、攝受正法聲、辯才聲、無常聲、苦聲、無我聲、空聲、無所作聲、寂靜聲、無生聲、如聲、實際聲、入法界聲。",
        "source": "T13n0397_047:0308c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無眾生無命無養育無受者、如如不生不滅不常不斷不去不來不住不行聲，大神通變化聲、加護三寶種聲，乃至大般涅槃聲、地獄畜生餓鬼人天苦五陰重擔聲、數數流轉生死與愛別離聲、一切有為流轉之獄如幻芭蕉水月響聲、信念精進忍及智慧十善業道護持聲、出彼流轉獄聲，於彼華雨出是無量百千種聲。",
        "translation": "There's the sound of sentient beings having no life, no nurturing, no recipients, such-and-such that aren't born, don't cease, aren't permanent, don't go away, don't come, don't stop, and don't function, the sound of great miraculous powers changing, the sound of the seeds of protection of the Three Treasures up to great parinirvāṇa, the sound of hell, animals, hungry ghosts, humans, and gods suffering the heavy burden of the five aggregates, the sound of separation from the many transmigration births and deaths and emotions, the sound of all the artificial transmigration hells resonating like illusory plantains and the water and moon, the sound of faith, effort, forbearance, and wisdom upholding the ten good actions, the sound of escaping those transmigration hells, and the immeasurable hundreds of thousands of sounds that rain down from those flowers.",
        "source": "T13n0397_047:0309a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸音聲，能令無量阿僧祇等阿修羅於三寶中深得敬信，尊重歸依生希有心，渴仰欲見釋迦牟尼，及欲聽法供奉眾僧，極甚驚怖，流轉生死與愛別離，悕望涅槃。",
        "translation": "Those sounds cause measureless incalculable asuras to deeply venerate the Three Treasures, respect and rely on them, become hopeful, long to see Śākyamuni, want to hear the Dharma and serve the saṃgha, become terrified, go through birth-and-death transmigration, part with what they love, and long for nirvāṇa.",
        "source": "T13n0397_047:0309a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸一切阿修羅等俱發聲言：「南無釋迦牟尼如來！",
        "translation": "All those asuras and others all uttered, \"Homage to the Śākyamuni Tathāgata!",
        "source": "T13n0397_047:0309a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南無釋迦牟尼如來！",
        "translation": "Homage to Śākyamuni the Tathāgata!",
        "source": "T13n0397_047:0309a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今往見於釋迦牟尼如來，禮拜供養故，聽法故，及供奉眾僧故，為看大集故，為求無上菩提乘故，為退落魔幢故，為建立法幢故，為三寶種不斷絕故，為聽第一義聖諦法門故，為休息煩惱道苦道故，為斷截魔縛故，為枯竭愛河故，為滿法海故，為入智海故，為成熟眾生海故，為供養諸佛海故。",
        "translation": "Now, we've gone to see the Śākyamuni Tathāgata, venerate and make offerings, listen to the Dharma, make offerings to the saṃgha, see the great assembly, pursue the unsurpassed vehicle of enlightenment, retreat from the demon's banner, build the Dharma banner, keep the seeds of the Three Treasures intact, listen to the Dharma teaching of the noble truth, rest from the path of affliction and suffering, sever the demon's fetters, dry up the river of craving, fill the ocean of the Dharma, enter the ocean of wisdom, mature the ocean of sentient beings, and make offerings to the oceans of buddhas.",
        "source": "T13n0397_047:0309a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，我等及諸眷屬往詣佛所，不為惡魔於我等中更得自在，我等從今不復重遭如是之苦。」",
        "translation": "Therefore, we and our retinues will go to the Buddha's place, not because Māra has gained more mastery over us, and we won't have to endure this kind of suffering again from now on.\"",
        "source": "T13n0397_047:0309b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，牟真隣陀阿修羅王復作是言：「我今亦與婦妾宮人男女大小，諸阿修羅婦女眷屬八萬四千，一切皆悉著青衣服青色莊嚴，青傘青蓋青幢青幡青車青華，青色摩尼琴瑟箜篌，青寶青鼓。",
        "translation": "It was then that the asura king Mucilinda again said, \"Now, I've also brought along my wife, concubine, palace staff, men, women, and children, and 84,000 members of my asura retinue, all of whom are wearing blue clothing, blue-colored adornments, blue umbrellas, blue canopies, blue banners, blue chariots, blue flowers, blue maṇi, lutes, harps, and blue drums.",
        "source": "T13n0397_047:0309b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今將諸五音作樂歌舞調戲第一莊嚴，及將眷屬而往見佛，恭敬禮拜聽受妙法，供奉眾僧，故往詣佛所。」",
        "translation": "Now, I've created music, dances, songs, sports, and the greatest adornment out of the five sounds, and I've gathered my retinue to see the Buddha, venerated, worshipped, and accepted the wonderful Dharma, made offerings to the monks, and therefore went to the Buddha.\"",
        "source": "T13n0397_047:0309b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，須質多羅阿修羅王復作是言：「我今亦與婦妾宮人、男女眷屬、九十九百千阿修羅婦女，一切皆著黃衣莊嚴，乃至供奉眾僧故往詣佛所。」",
        "translation": "It was then that King Sumeru Tārā asura again said, \"Now, I've also gone to the Buddha with my wife, concubine, palace staff, male and female retinues, and 99,000 asura women, all adorned in yellow robes, and I've made offerings to the saṃgha.\"",
        "source": "T13n0397_047:0309b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，睒婆羅阿修羅王復作是言：「我今亦與婦妾宮人、男女眷屬、百千億阿修羅婦女，一切皆悉著紺色衣瓔珞莊嚴，乃至供奉眾僧往詣佛所。」",
        "translation": "It was then that King Śubhakarasiṃha again said, \"Now, I, too, will go to the Buddha with my wife, concubine, palace staff, male and female retinues, and 10,000,000 asura women, all adorned in purple robes and jewelry, and I will make offerings to the saṃgha.\"",
        "source": "T13n0397_047:0309b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋持毘盧遮那阿修羅王復作是言：「我今亦與婦妾宮人、男女眷屬、九十九頻婆羅阿修羅婦女，一切悉著朱色衣服瓔珞莊嚴，乃至往詣佛所。」",
        "translation": "It was then that King Bhadrika Vairocana, the asura king, again said, \"Now, I, too, will go with my wife, concubine, palace staff, male and female retinues, and 99 asura women and men, all wearing vermilion-colored clothing and adorned with jewelry, even as we go to the Buddha's place.\"",
        "source": "T13n0397_047:0309b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘摩質多羅阿修羅王復作是言：「我今亦與婦妾宮人、男女眷屬、九十九惡初矣尼百千阿修羅婦女，一切悉著頗梨色衣瓔珞莊嚴，乃至往詣佛所。」",
        "translation": "It was then that King Vimalacitra asura again said, \"Now, I too will go with my wife, concubine, palace staff, male and female retinues, and the ninety-nine asuras and women of the first rank, all of whom will be adorned in pāri-colored clothing and jewelry, even as we go to the Buddha's place.\"",
        "source": "T13n0397_047:0309b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅睺羅阿修羅王復作是言：「我今亦與夫人婇女、男女眷屬，及土田主附庸王，并及長者、臣將、左右、城邑、聚落、所有人眾，如恒河沙等阿修羅婦女，一切悉著馬瑙色衣瓔珞莊嚴，復持馬瑙色衣，及與幢幡寶蓋、金縷、真珠、瓔珞、摩尼寶珠、香華、塗香及所乘車，皆悉同是馬瑙之色，并以鼓角、琴瑟、箜篌、簫笛、伎樂，如是等事皆馬瑙色，相與作樂歌舞戲笑，最勝莊嚴在於虛空，為欲見佛禮拜供養，及為聽法供奉眾僧故，往詣佛所。」",
        "translation": "爾時，羅睺羅阿修羅王復作是言：「我今亦與夫人婇女、男女眷屬，及土田主附庸王，并及長者、臣將、左右、城邑、聚落、所有人眾，如恒河沙等阿修羅婦女，一切悉著馬瑙色衣瓔珞莊嚴，復持馬瑙色衣，及與幢幡寶蓋、金縷、真珠、瓔珞、摩尼寶珠、香華、塗香及所乘車，皆悉同是馬瑙之色，并以鼓角、琴瑟、箜篌、簫笛、伎樂，如是等事皆馬瑙色，相與作樂歌舞戲笑，最勝莊嚴在於虛空，為欲見佛禮拜供養，及為聽法供奉眾僧故，往詣佛所。」",
        "source": "T13n0397_047:0309c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，皆悉嚴備彼諸色相，第一微妙希有未有，昔來未聞如是等大莊嚴事，從彼阿修羅所居處出住在空中。",
        "translation": "They were all resplendent in their appearance as described above, the most subtle and rare of them all, and such great adornments had never been heard of in the past, and they emerged from where that asura lived and stayed in the air.",
        "source": "T13n0397_047:0309c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘摩質多羅阿修羅王，及與眷屬五音作樂歌舞戲笑，詣羅睺羅阿修羅王於前而引。",
        "translation": "At the time, King Vimalacitra asura and his retinue were making music with five tones, singing, dancing, and laughing, and they went to King Rāhula asura and led him in front of them.",
        "source": "T13n0397_047:0309c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，波羅陀阿修羅王，及與眷屬皆大嚴持，到羅睺羅阿修羅王右廂而引。",
        "translation": "It was then that the king of the asuras of Bārādhara and his retinue, all of whom were greatly adorned, went to the right of the king of the asuras of Rāhula and led him there.",
        "source": "T13n0397_047:0309c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋持毘盧遮那阿修羅王，并與眷屬亦復如是具大莊嚴，到羅睺羅阿修羅王左廂而引。",
        "translation": "At the time, King Bhadrapāla asura and his retinue were likewise greatly adorned as they went to the left of King Rāhula asura and led him there.",
        "source": "T13n0397_047:0309c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，睒婆羅阿修羅王，及與眷屬亦悉嚴持，詣羅睺羅阿修羅王於後而引。",
        "translation": "At the time, King Śubhakarasiṃha, with his retinue and retinue also adorned, went to the rear of King Rāhula asura and led him there.",
        "source": "T13n0397_047:0309c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，牟真隣陀阿修羅王，及與眷屬亦大嚴駕，到羅睺羅阿修羅王在上而引。",
        "translation": "At the time, King Mucilinda asura and his retinue also took a great deal of care as they went up to King Rāhula asura and led them there.",
        "source": "T13n0397_047:0309c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，須質多羅阿修羅王，及與眷屬如是莊嚴，亦到羅睺羅阿修羅王在下而引。",
        "translation": "At the time, King Sumeru Tārā, the asura king and his retinue were thus adorned, and they also went to King Rāhula, the asura king, at the bottom and led them there.",
        "source": "T13n0397_047:0309c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，於中羅睺羅阿修羅王及與眷屬，如是色相以大莊嚴，五音伎樂一時俱作，歌舞戲笑音聲和合而詣佛所。",
        "translation": "At the time, the king of Rāhula asuras and his retinue were thus adorned in form and appearance, and they were accompanied by five musical instruments, singing, dancing, playful laughter, and a combination of sounds and voices as they went to the Buddha.",
        "source": "T13n0397_047:0309c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以兩手持種種寶華天鬘塗香，向佛方所遙散奉獻，到佉羅帝山上變作大雲空中而住。",
        "translation": "Holding in his two hands a variety of jewelry, flowers, and celestial garlands coated with incense, he scattered them far and wide, offered them up to the Buddha, and then he went up on Mount Kharādī and transformed into a great cloud in the sky and stayed there.",
        "source": "T13n0397_047:0310a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佉羅帝山牟尼諸仙所依住處，雨種種寶、種種華、種種天鬘、種種塗香。",
        "translation": "From that place on Mount Kharādī where the sages of Muni were staying, it rained down various treasures, flowers, celestial garlands, and scented incense.",
        "source": "T13n0397_047:0310a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有諸眾生作如是念：「欲有何事，是何等力先作此瑞？」",
        "translation": "At the time, some sentient beings in the assembly thought, \"What do you want to do, and what power did it have to create this auspicious event in the first place?\"",
        "source": "T13n0397_047:0310a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告慧命耶舍言：「汝等比丘當自正念繫心而住，勿得散亂。」",
        "translation": "It was then that the Bhagavān addressed Śrīlabdha, \"You monks should fix your minds and abide with correct mindfulness, so that you don't become distracted.\"",
        "source": "T13n0397_047:0310a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊復告慧命耶舍：「汝等比丘當以精勤繫念而住，勿得散亂，若能精勤繫念不散，則能休息煩惱之道及除苦道，能住第一義諦，能滿六波羅蜜，不久得成阿耨多羅三藐三菩提。",
        "translation": "The Bhagavān again addressed Śrīlabdha, \"You monks must diligently bind your mind and abide in mindfulness so as not to become distracted, for if you can diligently bind your mind and not become distracted, you'll be able to rest in the path of affliction and remove the path of suffering, abide in the supreme truth, fulfill the six perfections, and soon achieve supreme perfect enlightenment.",
        "source": "T13n0397_047:0310a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是諸阿修羅及與一切眷屬妓女而今欲來，并作五音妓樂和合而作莊嚴，為禮拜我供養聽法。",
        "translation": "Now, these asuras and all their retinues and prostitutes are about to come and make an obeisance by combining five sounds, music, and prostitutes to worship me and offer support for listening to the teaching.",
        "source": "T13n0397_047:0310a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等勿得散亂，繫念而住。」",
        "translation": "Don't get distracted, therefore, and stay focused and mindful.\"",
        "source": "T13n0397_047:0310a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，一切阿修羅及與眷屬，尋即來到佉羅帝山。",
        "translation": "At that point, all the asuras and their retinues looked around and immediately arrived at Mount Kharādī.",
        "source": "T13n0397_047:0310a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已，即時右遶其山，三匝訖已，將諸眷屬詣世尊所。",
        "translation": "When they arrived, they immediately circled the mountain to the right, and after three turns, they sent their retinues to the Bhagavān.",
        "source": "T13n0397_047:0310a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅睺羅阿修羅王向世尊頭面作禮，右遶三匝，於前住立，持梵天髻上光明艶色摩尼寶珠置於佛前；復用種種寶華、末香、幢幡、寶蓋，及以金縷、真珠、瓔珞；復以種種歌舞作樂而用供養，合掌向佛說偈讚曰：「心調士中最，　　能施一切樂，　法燈常法施，　　增長法智慧。",
        "translation": "At the time, Rāhula, the king of the asuras paid homage to the Bhagavān with his head and face, circled him three times to his right, stood in front of him, placed the brilliant-colored maṇi-jewel on top of the brahma heaven's topknot in front of the Buddha, used various kinds of precious flowers, incense, banners, and jeweled canopies, as well as gold thread, real beads, and jewelry, made offerings with various songs, dances, and music, put his palms together, and spoke to the Buddha in verse, praising him, \"He's the most disciplined of men, capable of bestowing all kinds of happiness, a constant donor of the Dharma lamp, and a proponent of the wisdom of the Dharma.",
        "source": "T13n0397_047:0310a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊然法炬，　　天人皆悉知，　了達悕望法，　　安住涅槃道。",
        "translation": "The Bhagavān blazes the torch of the Dharma, which is well known to gods and humans, comprehends desired qualities, and abides in the path to nirvāṇa.",
        "source": "T13n0397_047:0310a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯佛蔭諸眾，　　如蓋覆一切，　摧伏諸陰魔，　　死魔煩惱魔，　降魔及軍眾，　　并及惡心意，　稽首於世尊，　　勇健愍諸有。",
        "translation": "Only the Buddha overshadows them all, covering them all like a lid, destroying the aggregates and demons, the demon of death and affliction, subduing demons and armies, and evil thoughts, he bows before the Bhagavān, courageous and compassionate toward all sentient beings.",
        "source": "T13n0397_047:0310a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是魔極惡心，　　常行諸惡事，　此是彼戲笑，　　欲得眾生苦。",
        "translation": "That demon's extremely malevolent mind always does evil things, and these are his jokes, which seek to cause suffering in sentient beings.",
        "source": "T13n0397_047:0310b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此諸修羅宮，　　苦雲悉彌覆，　佛即起悲心，　　觸我諸修羅。",
        "translation": "These asura palaces are all covered by clouds of suffering, so the Buddha arouses compassion and touches us as asuras.",
        "source": "T13n0397_047:0310b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛為眾生故，　　修諸苦行訖，　多劫修檀戒，　　行忍及智慧。",
        "translation": "For the sake of sentient beings, the Buddha cultivates the completion of many painful practices, cultivates the precepts over many eons, and practices forbearance and wisdom.",
        "source": "T13n0397_047:0310b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊更不作，　　諸餘惡行事，　佛以如是事，　　足令我得樂。",
        "translation": "The Bhagavān does not do any other bad deeds, but the Buddha does such things that are sufficient for my happiness.",
        "source": "T13n0397_047:0310b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惟佛精進士，　　三界無等雙，　離諸煩惱縛，　　解脫於三有。",
        "translation": "Only a hero of Buddha's zeal, he has no equal in the three realms, is free of the bonds of affliction, and is liberated from the three existences.",
        "source": "T13n0397_047:0310b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛仍於眾生，　　慈悲而常轉，　禮佛不動山，　　慈心正安住。」",
        "translation": "Still regarding sentient beings, the Buddha is constantly transformed by compassion, pays homage to him on his unshaken mountain, and correctly abides in his compassionate mind.\"",
        "source": "T13n0397_047:0310b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘摩質多阿修羅王及與眷屬，頭面接足禮拜世尊，右遶三匝佛前住立，即以千斤閻浮檀金置於佛前。",
        "translation": "At the time, King Vimalacitra and his retinue bowed their heads, put their feet together, saluted the Bhagavān, circled him three times to his right, and stood in front of the Buddha, then placed a thousand catties of Jambudvīpa gold in front of him.",
        "source": "T13n0397_047:0310b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以日愛寶摩尼珠置在佛上，如是種種寶、種種香華，乃至種種歌舞伎樂而作供養，合掌恭敬，說偈讚曰：「釋梵大自在，　　輪王那羅延，　護世及波旬，　　悉無如是力。",
        "translation": "They also placed a jeweled maṇi-pearl, a sun-love jewel, on top of the Buddha, made offerings of various treasures, various kinds of fragrances, and various kinds of music and song, put their palms together in respect, and spoke a verse in praise, saying, \"The Śakra Devānām-Indra, the wheel-turning king Nārāyaṇa, and the guardians of the world and Pāpīyān all lack such power.",
        "source": "T13n0397_047:0310b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天龍夜叉等，　　人及阿修羅，　亦無如世尊，　　慈悲大勢力。",
        "translation": "Nor are there gods, dragons, yakṣas, humans, or asuras like the Bhagavān, with his great power of compassion.",
        "source": "T13n0397_047:0310b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惟佛眾生最，　　如地不瞋喜，　能忍一切惡，　　并作惡業者，　等視諸眾生，　　如母愛其子，　心平於一切，　　是故禮佛足。",
        "translation": "Only the Buddha is the greatest of sentient beings, like the earth that's not angered or delighted, able to tolerate all evil and those who do evil actions, and who regards all sentient beings equally, like a mother who loves her child, whose mind is at peace with everything; therefore, he salutes the Buddha's feet.",
        "source": "T13n0397_047:0310b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願護此一法，　　勿使魔更來，　不令彼得勝，　　作此惡惱害。",
        "translation": "May this one thing be guarded so that Māra won't come back, and Peter won't be allowed to overcome and cause such harmful harm.",
        "source": "T13n0397_047:0310b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切惡瞋怒，　　及以最極惡，　實語願說呪，　　降伏諸魔軍。",
        "translation": "He speaks truly and vows to recite a dhāraṇī to subdue the armies of Māra, despite all ill-will and anger and the most extreme evil.",
        "source": "T13n0397_047:0310c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人身無病，　　不求諸醫師，　如是阿修羅，　　無事不想佛。",
        "translation": "As a person without illness who doesn't seek doctors, such an asura doesn't want the Buddha for anything.",
        "source": "T13n0397_047:0310c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今甚歡喜，　　來詣於佛所，　願說清淨法，　　令到菩提道。",
        "translation": "Now, I'm so happy to come to the Buddha and wish to teach him pure dharmas that will lead him to the path of enlightenment.",
        "source": "T13n0397_047:0310c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　顯示諸賢聖，　　寂定如虛空，　遠離於諸惡，　　及離我我所。",
        "translation": "Showing the good and noble, their stillness and concentration are like space, they're free of evil and free of self and what belongs to self.",
        "source": "T13n0397_047:0310c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　速知於實際，　　能除諸煩惱，　速斷一切縛，　　得知最上道。」",
        "translation": "They quickly know the reality, remove the afflictions, quickly sever all fetters, and attain knowledge of the supreme path.\"",
        "source": "T13n0397_047:0310c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，波羅陀阿修羅王及與眷屬，頂禮佛足右遶三匝，持眾雜色種種寶樹，狀如波吒羅七寶之樹置於佛後。",
        "translation": "At the time, the king of the asuras of Pārata and his retinue bowed their heads at the Buddha's feet, circled him three times to his right, and placed behind him a multicolored, multi-colored, and multi-faceted jeweled tree that resembled the seven-jeweled tree of Pāṭaliputra.",
        "source": "T13n0397_047:0310c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種寶葉華果、金縷真珠瓔珞、天生寶鬘、天瓔衣服、指印環玔、寶蓋幢幡、手瓔珞、脚瓔珞、臂瓔珞，寶莊嚴具於佛頭上空中垂下，乃至種種歌舞作樂而供養佛。",
        "translation": "They placed behind the Buddha a variety of jeweled leaves, flowers, fruits, gold threaded beads, jewelry, garlands, fingerprints, rings, banners, banners with jeweled canopies, jewelry for hands, jewelry for feet, jewelry for arms, and other adornments of treasure dangling from the sky above his head, as well as various songs, dances, and music to make offerings to the Buddha.",
        "source": "T13n0397_047:0310c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心合掌，說偈讚曰：「眾生常為彼，　　煩惱火所燒，　求樂恒不得，　　不遇施樂者。",
        "translation": "Clasping his hands with one heart, he spoke a verse in praise, \"Sentient beings are always subject to them, burned by the fires of affliction, never able to find happiness, and don't meet those who give them joy.",
        "source": "T13n0397_047:0310c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切住惡道，　　惟佛眾生藥，　安住解脫道，　　能救一切苦。",
        "translation": "They all abide in evil destinies, but the Buddha is the medicine for sentient beings, abiding stably in the path of liberation, able to save all suffering.",
        "source": "T13n0397_047:0310c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惟佛賞人主，　　三有中更無，　愍進智慧水，　　眾德滿如海。",
        "translation": "Only the Buddha appreciates the lords of men, for there's nothing else among the three existences, advances the waters of wisdom, and fills the ocean with multitudes of virtues.",
        "source": "T13n0397_047:0310c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為盲失道者，　　安住於正路，　導引諸眾生，　　住勝涅槃道。",
        "translation": "For those blind and out of touch, he remains on the right path, guiding all sentient beings to abide in the path to transcend nirvāṇa.",
        "source": "T13n0397_047:0310c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡夫飢無厭，　　唯佛能充飽；　常為煩惱溺，　　唯佛能救拔。",
        "translation": "Ordinary beings are starved and have no trouble feeding themselves, and only the Buddha can rescue them from being constantly submerged in affliction.",
        "source": "T13n0397_047:0310c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遭溺之病苦，　　苦逼失其念，　如此苦苦者，　　導師為親救。",
        "translation": "Drowning in illness and suffering, they are forced to lose their mindfulness, and the guide personally rescues those who suffer such pain and suffering.",
        "source": "T13n0397_047:0310c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惡心眾生等，　　龍鬼諸羅剎，　見佛得正念，　　安住大悲心。",
        "translation": "Evil-minded sentient beings and others, dragons, ghosts, and rājasas see the Buddha and attain right mindfulness, abiding in great compassion.",
        "source": "T13n0397_047:0311a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯佛於三界，　　能作救護者，　我等已孤獨，　　悉為眾苦溺。",
        "translation": "Only the Buddha can be a protector in the three realms, for we've been left alone, and we're all sunken in suffering.",
        "source": "T13n0397_047:0311a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等皆一心，　　一切樂法住，　願說最上義，　　令我得菩提。",
        "translation": "We are all unified in our minds, all enjoying the abiding of the Dharma, and we wish to teach the supreme meaning so that I can attain enlightenment.",
        "source": "T13n0397_047:0311a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以得於佛眼，　　最上諸佛智，　速伏諸魔怨，　　願降正法雨。」",
        "translation": "Because we have attained the Buddha's eye and the highest Buddha's wisdom, we quickly quell Māra's enemies and wish to rain down the right Dharma.\"",
        "source": "T13n0397_047:0311a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋持毘盧遮那阿修羅王將諸眷屬，頂禮佛足右遶三匝，於佛右左積閻浮檀金；復以種種寶、種種華、種種末香、寶蓋、幢幡，及以金縷、真珠、瓔珞、歌舞作樂，合掌供養，說偈讚曰：「福田福德水，　　福種福德牙，　福樹福德枝，　　福條福德葉，　福華福味果，　　最上福味漿。",
        "translation": "At the time, King Bhadrapāla Vairocana the Asura gathered his retinue, bowed his head at the Buddha's feet, circled him three times to his right and left, accumulated gold from the river running through him, and offered offerings with various treasures, flowers, incense, jeweled canopies, banners, gold thread, real beads, jewelry, songs, dances, and music, all with his palms together, saying, \"Blessed are the fields of merit and water, the seeds of merit and teeth, the branches of merit and branches of merit, the stalks of merit and leaves, the flowers and fruits of merit, and the most excellent syrup of merit.",
        "source": "T13n0397_047:0311a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　福色福陰影，　　福德子成就，　佛福善堅固，　　福勇能伏他，　福色勇健士，　　福德不動山，　福華覆蓋土，　　福藥所依身。",
        "translation": "Blessed are the form and shadow of blessings, the accomplishments of the sons of merit, the fortune of the Buddha, who's resolute, courageous, able to subdue others, courageous in form and strength, an unshaken mountain of virtue, a land covered with blossoms, and a body on which fortune and medicine depend.",
        "source": "T13n0397_047:0311a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　福山最上頂，　　放福智慧水，　福德海甚深，　　福德眾生依，　妙福眾寶磺，　　福味如巨海。",
        "translation": "The highest peak of the mountain of merit releases the waters of blessed wisdom, the ocean of merit is deep, the merit of sentient beings depends on it, the marvelous merit of many treasures sinks, and the taste of merit is like a vast ocean.",
        "source": "T13n0397_047:0311a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　福器盛甘露，　　福願皆盛滿，　福商恒將向，　　無漏寶國土。",
        "translation": "Vessels of merit contain nectar, all vows of merit are fulfilled, and merchants of merit are constantly headed toward the land of untainted treasures.",
        "source": "T13n0397_047:0311a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等眾福盡，　　是故歸依佛，　福德賢寶瓶，　　願愍施我等。」",
        "translation": "Our many merits are exhausted; therefore, we rely on the Buddha, the precious vase of merit, and may he kindly bestow merit on us.\"",
        "source": "T13n0397_047:0311a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有阿修羅仙，名一切菩提鬘，具有大福大威德大智慧大苦行，以菩提心而作莊嚴，得五神通離諸塵垢，安住成就一切眾生，常化一切阿修羅等堪受彼供，是諸阿修羅無上導師，與九萬五千具足五通阿修羅仙，前後圍遶來詣佛所頂禮佛足，以真金瓶盛八功德水，置於佛前并獻寶杖；復與九萬五千眷屬各各執持異種寶蓋，以奉世尊右遶三匝，合掌向佛，說偈讚曰：「忍辱如大地，　　忍水常盈滿，　安住於淨忍，　　寧心無所失。",
        "translation": "At the time, there was once again an asura sage named the Garland of All Bodhisattvas, who possessed great merit, great authority, great wisdom, and great austerities, adorned himself with the mind of enlightenment, attained the five supernormal powers, freed himself from the defilement of innumerable things, abided in the accomplishment of all sentient beings, and constantly transformed all asuras and others into worthy recipients of his offerings.",
        "source": "T13n0397_047:0311a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　煩惱渴愛盡，　　安處於信財，　佛住慈悲心，　　置眾菩提道。",
        "translation": "Their afflictions and thirst for forbearance are ended, and they're placed in the wealth of faith, where the Buddha abides in compassion and sets out on the path to enlightenment for all.",
        "source": "T13n0397_047:0311b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說法猶如水，　　若聞如是法，　愛樂菩提心，　　能成第一義。",
        "translation": "Teaching the Dharma is like water, so if you hear such a teaching, you'll love the mind of enlightenment and be able to achieve the supreme truth.",
        "source": "T13n0397_047:0311b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大悲願調伏，　　此諸下劣行，　願受我修羅，　　所獻眾寶物。",
        "translation": "With great compassion, he vows to tame these inferior forms of behavior, accepting my assortment of treasures.",
        "source": "T13n0397_047:0311b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三界所有供，　　棄捨不求染，　唯佛無煩惱，　　堪受世供養。",
        "translation": "They abandon all offerings in the three realms and don't seek defilement, except for the Buddha, who has no afflictions and is capable of receiving worldly offerings.",
        "source": "T13n0397_047:0311b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛以大菩提，　　嚴三有眾生，　願說第一義，　　為得菩提故。",
        "translation": "With great bodhi, the Buddha glorifies the three existent sentient beings and wishes to teach the supreme truth in order to attain bodhi.",
        "source": "T13n0397_047:0311b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於拘留孫，　　曾聞第一義，　拘那含牟尼，　　迦葉佛亦然。",
        "translation": "I've heard of the supreme meaning at Kauṇḍinya, Kunāyamuni, and Kāśyapa, too.",
        "source": "T13n0397_047:0311b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我以自願力，　　應現阿修羅，　為化修羅故，　　修行菩提道。",
        "translation": "With my voluntary power, I should manifest as an asura and cultivate the path to enlightenment for the sake of transforming asuras.",
        "source": "T13n0397_047:0311b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞法獲德藏，　　復能轉示他，　降魔惡徒黨，　　熾然正法朋。",
        "translation": "I've heard the Dharma and gained a store of virtue, which I can then reveal to others, subdue a band of demons and evil disciples, and blaze a trail of the right Dharma.",
        "source": "T13n0397_047:0311b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於此濁惡世，　　難有功德人，　現佛境界事，　　是佛妙神力。」",
        "translation": "In this turbid and evil world, it's difficult to find someone of merit who demonstrates the things in the Buddha's realm, which are the Buddha's marvelous powers.\"",
        "source": "T13n0397_047:0311b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大集經卷第四十七",
        "translation": "(Daji jing, vol. 47)",
        "source": "T13n0397_047:0311b28_0",
        "is_bad_quality": false
    }
]