[
    {
        "source_sentence": "大方等大集經卷第四十一",
        "translation": "Dafangdengdaji jing, vol. 41",
        "source": "T13n0397_041:0270c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏那連提耶舍譯",
        "translation": "Translated by the Sui Tianzang Tripiṭaka Nālandīyaśas",
        "source": "T13n0397_041:0270c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎日藏分中星宿品第八之一",
        "translation": "Śīlâditya-sūtra, Chapter 8, Part 1",
        "source": "T13n0397_041:0270c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，欲界魔王波旬，悉見一切娑婆國土所有眾生及諸天宮合家眷屬在佛身中。",
        "translation": "It was then that Māra Pāpīyān, the demon king of the desire realm, saw all the sentient beings in the Saṃbha land and the families of the gods and palaces in the Buddha's body.",
        "source": "T13n0397_041:0270c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬見已悲泣涕淚橫流，心大懊惱遍身汗出，啼哭失聲稱怨大喚。",
        "translation": "After he saw them, Māra Pāpīyān wept and wept profusely, his heart was greatly distressed, and his body was covered in sweat as he cried and lost his voice, complaining and shouting.",
        "source": "T13n0397_041:0270c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或起、或立、或坐、或行，入出家居東西狂走，頻申欠呿怖懼慞惶，憤歎長歔喘息麁短，合眼張口吐舌舐身，露背現胸申臂縮脚，搖動頭項索手揩摩，種種施為受大苦惱，乃至一切魔之眷屬，心內愁憂亦復如是。",
        "translation": "He sometimes rises, stands, sits, or walks, enters or leaves his home, walks wildly from east to west, frequently yawns in fear and perplexity, laments and laments, panting and gasping for breath, closes his eyes and mouth, spits out his tongue and licks his body, bares his back and chest, extends his arms and legs, shakes his head and legs, tries to wipe his hands with his hands, and causes great suffering and distress in his heart, even as all of Māra's retinue grieve internally.",
        "source": "T13n0397_041:0270c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬有一軍主，名戒依止，見王身心如是煎迫，說偈問言：「何故愁惱獨行住，　　唱喚馳走似顛狂，　出入家居心不安？",
        "translation": "When Māra Pāpīyān had an army commander named Śīlabhadra, he saw how the king was suffering physically and mentally and asked in a verse, \"Why are you so troubled and distressed walking and staying alone, wailing and rushing about as if you were crazy, and your thoughts are disturbed when you leave and enter your home?",
        "source": "T13n0397_041:0270c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是因緣願王說。」",
        "translation": "For these reasons, may the king speak.\"",
        "source": "T13n0397_041:0270c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬聞是語已，倍更懊惱啼哭雨淚，說偈答言：「我今身體汗遍流，　　心中分裂如刀割，　啼哭眼中淚如血，　　為覩瞿曇現變通。",
        "translation": "After hearing those words, Māra Pāpīyān was doubly distressed and wept and rained tears down, saying, \"Now, my body is sweating all over, my heart is split like a knife, and I'm weeping and crying with tears like blood in my eyes, because I want to see the Gautama's manifestation of his powers.",
        "source": "T13n0397_041:0270c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其形廣大無有邊，　　剎土悉皆居腹內，　我失臣民及眷屬，　　境界宮殿悉空虛。",
        "translation": "Its size is vast and knows no bounds, and all of its bases reside inside its belly. I've lost my subjects and retinue, and all of my realms and palaces are empty.",
        "source": "T13n0397_041:0271a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有十方大眾來，　　充滿於此娑婆界，　各設無邊大供養，　　禮拜圍繞或往還，　令我自在無威力，　　伴侶眷屬歸於彼。",
        "translation": "Again, a multitude of people from ten directions comes and fills this sahāva realm, making limitless offerings, worshiping, surrounding, or returning, making me completely at ease without authority, and sending my companions and retinue there.",
        "source": "T13n0397_041:0271a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來有是大神力，　　云何令我心不愁？」",
        "translation": "With this great spiritual power of the Tathāgata, how does it keep my mind from wandering?\"",
        "source": "T13n0397_041:0271a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主為於波旬復說偈言：「我所統領諸軍眾，　　強壯勇健實難當，　刀輪奮擊擬如來，　　須臾破身令粉碎。」",
        "translation": "The great demon army leader Pāpīyān, who was then relying on the precepts, spoke again in verse for him, saying, \"The armies I lead are strong and courageous, and they're really hard to defeat; a fierce blow from a sword and a round blast from a tathāgata would quickly pulverize their bodies.\"",
        "source": "T13n0397_041:0271a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬說偈答言：「我等諸軍及眷屬，　　久已歸依佛世尊，　設欲自往生惡心，　　即見項邊帶枷鏁。」",
        "translation": "Māra Pāpīyān then spoke a verse in reply, \"Our army and retinue have long relied on the Bhagavān, but if they want to go on their own and give rise to bad thoughts, they'll see a fetter around their necks.\"",
        "source": "T13n0397_041:0271a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主復說偈言：「我今多設諸方便，　　誘誑於彼惡怨家，　詐現親善作知識，　　得便然後當摧滅。」",
        "translation": "The great army leader Māra Pāpīyān, who was then relying on the precepts, then spoke again in verse, \"Now, I've devised many ways to entice that bad enemy, deceive him into presenting himself as a good and friendly friend, and then I'll destroy him.\"",
        "source": "T13n0397_041:0271a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬說偈答言：「若我發起毒惡心，　　如是方便欲毀佛，　即見死屍繫頸下，　　如是臭惡難可看。」",
        "translation": "Māra Pāpīyān then spoke a verse in reply, \"If I arouse a poisonous and evil mind and thus deign to disparage the Buddha, I'll see a dead corpse tied up under my neck, and it'll stink like that, which is hard to see.\"",
        "source": "T13n0397_041:0271a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主復說偈言：「一切欲界屬於魔，　　唯有天人信歸佛，　諸惡毒龍亦王領，　　願勅速害瞿曇身。」",
        "translation": "The great demon army commander who relies on the precepts then spoke again in verse, \"All the desire realms belong to Māra, but only gods and humans believe in the Buddha, and those wicked, poisonous dragons are also the king's leaders; may I order you to quickly harm the Gautama body.\"",
        "source": "T13n0397_041:0271a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬復說偈答：「若審知龍有力能，　　我已荒迷汝自勅，　若實能壞瞿曇者，　　我還得土復本心。」",
        "translation": "Māra Pāpīyān then spoke again in verse, replying, \"If you knew the power of dragons, you'd tell me you're deluded, and if you could really destroy the Gautama, I'd be able to return to my original land and mind.\"",
        "source": "T13n0397_041:0271a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，戒依止大魔軍主即自念言：「世間難摧，謂三種毒：一者、天魔；二者、惡龍；三者、得定五通仙人。",
        "translation": "The great demon army leader who relies on morality then said to himself, \"There are three kinds of poison that are difficult to destroy in the world: first, celestial demons; second, evil dragons; and third, sages who have attained the five powers of concentration.",
        "source": "T13n0397_041:0271a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今魔宮已被破壞，唯龍境界牢固，光明照耀海中，威力自在眷屬圍繞不可思議。",
        "translation": "Now, after I destroyed the demon's palace, only the dragon's realm is strong, its light shines brightly in the ocean, and it's surrounded by an unfathomably powerful retinue.",
        "source": "T13n0397_041:0271a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍既屬魔其餘兵眾悉皆統領，今當為王約勅速往壞彼瞿曇。」",
        "translation": "Now, since the dragon belongs to Māra and the rest of his army is in command, I'll order the king to quickly destroy that Gautama.\"",
        "source": "T13n0397_041:0271a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔波旬言：「善哉！",
        "translation": "Māra Pāpīyān said, \"Good!",
        "source": "T13n0397_041:0271b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T13n0397_041:0271b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧軍主汝可疾去，到彼龍宮如是切勅，早與瞿曇共相鬪戰。」",
        "translation": "Wise army commander, you may leave quickly and go to that dragon palace and fight with the Gautama as soon as possible, just like I've told you.\"",
        "source": "T13n0397_041:0271b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主，辭王畢已即自舉手，普告無量百千軍眾唱如是言：「汝等宜應速整衣鉀，我今欲往彼龍王宮，令諸惡龍興發毒風，害瞿曇命使令破碎。」",
        "translation": "After he had excused himself from the king, the great demon army lord of moral discipline raised his hand and addressed an army of measureless hundreds of thousands, saying, \"You'd better quickly adjust your robes and potions; now, I want to go to that dragon king's palace and cause those bad dragons to generate a poisonous wind that will harm the Gautama's life and cause it to break.\"",
        "source": "T13n0397_041:0271b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是說已，一切軍眾悉不能動。",
        "translation": "After he said this, the whole army couldn't be moved.",
        "source": "T13n0397_041:0271b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其戒依止軍眾及身既不得前，眼中淚出身毛皆竪，合掌向魔波旬說言：「我等今者不能得去，沙門瞿曇姦偽多幻，知我等家繫縛於我，令我身內一切火燃焦沸熱惱猶如湯煮，我今如是力不自在，云何復欲假力於他？」",
        "translation": "When the army of those who relied on the precepts and their bodies couldn't reach them, tears welled up in their eyes, and their hair stood on end as they joined their palms and said to Māra Pāpīyān, \"Now, we can't leave because the ascetic Gautama is fraudulent and full of illusions, knows our family, and has bound us to him, making everything in my body burn and boil hot and distressing like boiling water.",
        "source": "T13n0397_041:0271b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬倍更懊惱憂愁不樂，令戒依止具以上事宣告諸龍：「汝當為我壞瞿曇身。」",
        "translation": "When Māra Pāpīyān was doubly distressed and upset, he told Vīryaśrī to do all of the above and proclaimed to the dragons, \"You will destroy the Gautama body for me.\"",
        "source": "T13n0397_041:0271b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸惡龍將欲飛空而不能去，語戒依止：「敬奉來命欲往毀壞，適生此心便不得往。」",
        "translation": "The evil dragons then wanted to fly into the sky but couldn't go, and they told Vipaśyin, \"I respectfully wish to go and destroy it, but if I suitably give rise to this thought, I won't be able to go.\"",
        "source": "T13n0397_041:0271b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止即生恐怖，作如是念：「若我今者現魔大力，令諸惡龍心生瞋忿，以瞋忿故則能破壞瞿曇之身。」",
        "translation": "Venerable Precepts then became frightened and had this thought, \"Now, I've shown Māra's great power to cause those bad dragons to become angry, and because of that anger, I'll be able to destroy the Gautama's body.\"",
        "source": "T13n0397_041:0271b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬及戒依止，化龍宮內作諸蚊虻、蠅疽、毒虫、死屍、人糞，臭處狼藉充滿其中。",
        "translation": "Māra Pāpīyān and the restraints of morality then transformed the palace of the dragons into a place filled with the stench of gnats, flies, poisonous insects, dead corpses, and human excrement.",
        "source": "T13n0397_041:0271b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸龍見已於自宮室心不甘樂，作是念言：「是誰化作此惡物也？」",
        "translation": "Seeing this, the dragons were displeased in their own palaces and had this thought, \"Who made this bad thing?\"",
        "source": "T13n0397_041:0271b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復思念莫知誰為。",
        "translation": "\"Even though he kept thinking about it, he didn't know who did it.",
        "source": "T13n0397_041:0271b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，一切四天下中諸大龍王及其男女大小眷屬悉生瞋忿，即出宮殿至須彌下佉羅坻山。",
        "translation": "At the time, all the great dragon kings and their male and female retinues, large and small, in the four heavens became angry and left their palaces and went to Mount Kharādī under Sumeru.",
        "source": "T13n0397_041:0271b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其山平坦，於山頂頭有大聖人先所居住，彼山周匝縱廣正等四萬由旬，一切莊嚴純是七寶，乃至難陀、優婆難陀龍王，亦與無量百千眷屬，捨自住宮往佉羅坻大聖人處請求救濟。",
        "translation": "On top of that flat mountain, there was a great sage who had previously lived there, and the circumference of that mountain was exactly 40,000 leagues wide, and all its ornamentation was purely made up of seven treasures, even as the dragon-king Nandana and Upananda and their countless hundreds of thousands of retinues left their palaces and went to the great sage at Kharādī to ask for help.",
        "source": "T13n0397_041:0271b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼龍奮身如須彌山，即到彼已，其身皆小猶如銅斫。",
        "translation": "The dragon rushed up like Mount Sumeru, and when he arrived, his body was as small as a bronze chopper.",
        "source": "T13n0397_041:0271b28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖如是知不能得語，各各自說我等欲往而不能動，即大憂愁瞋忿停坐。",
        "translation": "Although they knew it was like that, they couldn't speak, so they each said, \"We want to go but we can't move, so we stop and sit down in great sorrow and anger.",
        "source": "T13n0397_041:0271b29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有娑伽羅龍王，亦與無量億那由他百千眷屬，如是伊羅鉢龍王，如是善住龍王，如是德叉迦龍王，如是阿那婆達多龍王，如是目真隣陀龍王，如是海德龍王，如是婆婁那龍王，如是大德龍王，如是那吒達都龍王，如是阿鉢羅邏龍王，如是山德龍王，如是牛頭龍王，如是阿藍浮龍王，如是伊羅鉢多龍王，如是欝車伽臂龍王，如是婆羅刪那龍王，如是斯羅摩羅龍王，如是迦迦吒行龍王，如是稽羅綺龍王，如是水行龍王，如是安闍那殊致龍王，如是迦那迦賓闍那龍王，如是奢俱奢伏綺龍王，乃至閉眼龍王，乃至白象腋龍王，乃至天利龍王，乃至天婆婆遮羅龍王，乃至天迦龍王，乃至伊羅口龍王，乃至天眼赤龍王，乃至端正龍王，乃至光行龍王，乃至此間閻浮提地八十六千諸大龍王，時彼一切一一龍王，各有無量百千眷屬悉皆來詣此聖人處，請求救濟。",
        "translation": "爾時，復有娑伽羅龍王，亦與無量億那由他百千眷屬，如是伊羅鉢龍王，如是善住龍王，如是德叉迦龍王，如是阿那婆達多龍王，如是目真隣陀龍王，如是海德龍王，如是婆婁那龍王，如是大德龍王，如是那吒達都龍王，如是阿鉢羅邏龍王，如是山德龍王，如是牛頭龍王，如是阿藍浮龍王，如是伊羅鉢多龍王，如是欝車伽臂龍王，如是婆羅刪那龍王，如是斯羅摩羅龍王，如是迦迦吒行龍王，如是稽羅綺龍王，如是水行龍王，如是安闍那殊致龍王，如是迦那迦賓闍那龍王，如是奢俱奢伏綺龍王，乃至閉眼龍王，乃至白象腋龍王，乃至天利龍王，乃至天婆婆遮羅龍王，乃至天迦龍王，乃至伊羅口龍王，乃至天眼赤龍王，乃至端正龍王，乃至光行龍王，乃至此間閻浮提地八十六千諸大龍王，時彼一切一一龍王，各有無量百千眷屬悉皆來詣此聖人處，請求救濟。",
        "source": "T13n0397_041:0271c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至八十四萬諸海洲中，一一海洲則有無量億那由他百千諸龍，各捨宮宅為救濟故來佉羅坻大聖處。",
        "translation": "Thus, up to 840,000 ocean continents, there are measureless millions of nayutas and hundreds of thousands of dragons on each ocean continent that abandon their palaces and come to the great sage Kharādī for relief.",
        "source": "T13n0397_041:0271c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是欝單羅拘盧洲中，鼻擔比龍王、大遍龍王，彼二龍王各與無量億那由他百千諸龍眷屬圍繞，請求救濟故來到此聖人住處。",
        "translation": "Thus, on Uttarakuru, there are the dragon kings Bhītambī and Mahāprajñāpāramitā, each surrounded by a retinue of measureless hundreds of millions of nayutas and thousands of dragons, who come to this sage's dwelling place to ask for help.",
        "source": "T13n0397_041:0271c22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是弗婆毘提洲中，蘇摩婁叉龍王、婆斯目叉龍王，彼二龍王亦與無量億那由他百千諸眷屬圍繞，悉來到此求於救濟。",
        "translation": "Thus, on the continent of Pūrvavideha, the dragon kings Sumeruṣṭhaka and Vātsīmokṣa, each surrounded by measureless millions of nayutas and a hundred thousand other dragon retinues, came here to ask for help.",
        "source": "T13n0397_041:0271c25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是瞿耶尼洲中，曷賴多那龍王、瞿波羅婆龍王，彼二龍王亦與無量億那由他百千諸龍眷屬圍繞前後隨從，為求救濟故來到此大聖人處。",
        "translation": "Thus, on the island of Gayāni, the dragon king of Hāritana and the dragon king of Gopalāpatra, surrounded by measureless millions of nayutas and hundreds of thousands of their retinues, came to this great sage for relief.",
        "source": "T13n0397_041:0271c28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有此四天下八萬四千一切洲中，所有諸龍——卵生、胎生、濕生、化生如是諸龍——如在生處，龍婦、龍男、龍女、龍子，為救濟故一切悉來此大聖人牟尼處所，到已一切皆得小身譬如銅斫。",
        "translation": "At the time, there were also 84,000 dragons in all the continents of the four worlds, all of them-eggborn, wombborn, wet-born, and transformation-born, as it were, dragon-women, dragon-men, dragon-women, dragon-women, and dragon-children-who all came to this great sage Muni's place for relief, and when they arrived, they all attained a small body like a copper chop.",
        "source": "T13n0397_041:0272a02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼龍瞋忿各作是念：「我等本身如須彌山，今者云何如是細小？」",
        "translation": "Those dragons were angry and each thought, \"We ourselves are like Mount Sumeru, but why are we so small now?\"",
        "source": "T13n0397_041:0272a06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬見於諸龍，皆來入此牟尼處所悉受小身。",
        "translation": "Māra Pāpīyān then saw all the dragons that had come into this Muni place and received small bodies.",
        "source": "T13n0397_041:0272a08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已，波旬心中懊惱，亦生瞋忿怖畏不安，語其眾軍及眷屬言：「汝等看此一切諸龍，以我力故變其宮殿，化作一切蚊虻、毒蠅，及餘臭惡種種糞穢，皆捨自家來詣大山聖人處所，悉失勢力無復自在，不能毀壞沙門瞿曇。」",
        "translation": "After he saw that, Pāpīyān was distressed in his heart and became angry, fearful, and uneasy. He said to his army and retinue, \"Look at all these dragons that have been transformed by my power into their palaces and halls, turned into all the mosquitoes, poisonous flies, and other smelly, filthy things, abandoned their homes, and come to the sage on Mount Mahāyāna, where they've all lost their strength and are no longer at ease and can't destroy the ascetic Gautama.\"",
        "source": "T13n0397_041:0272a09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主白波旬言：「大王莫愁，願聽我語。",
        "translation": "The great demon army lord who relies on the precepts then said to Pāpīyān, \"Don't worry, great king, and listen to what I have to say.",
        "source": "T13n0397_041:0272a14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸龍受此身者，非是沙門瞿曇所化，龍自集會一處戲笑作於是身，望得方便害彼釋子。」",
        "translation": "Those dragons who received this body were not transformed by the ascetic Gautama, but they assembled themselves in one place, laughed, and created this body in hopes of getting a way to harm the Śākyamuni.\"",
        "source": "T13n0397_041:0272a15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔波旬言：「如是者善。",
        "translation": "Māra Pāpīyān said, \"Such is good.",
        "source": "T13n0397_041:0272a17_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可速去聽問彼龍，說何語言作何方便，可得令彼沙門瞿曇破壞離散？",
        "translation": "Would you quickly go and ask that dragon what words and methods he uses to cause the ascetic Gautama to break up and disperse?",
        "source": "T13n0397_041:0272a18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得碎者，我境界勝，龍宮亦全。」",
        "translation": "If I were to break it, my objective realm would be superior, and the dragon palace would be complete.\"",
        "source": "T13n0397_041:0272a19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主，前後導從百千萬眾欲往彼山，發於自家乘空而進。",
        "translation": "Relying on the great army commander Māra, he led a hundred million people from front to back who wanted to go to that mountain, and then he started off at his house and rode off into the sky.",
        "source": "T13n0397_041:0272a20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊宣揚過去一切諸願通達顯示究竟無餘，一切聖人現在世者，一切牟尼處所作證，一切眾生教化畢了，一切諸佛眷屬家生，奮迅境界皆已示現。",
        "translation": "At the time, the Bhagavān proclaimed that the penetration of all past vows had been fully revealed without remainder, that all sages now in the world, all munis in their place had been realized, all sentient beings had been taught and educated, and all the families of the Buddha's retinue had been born, and their realms of ardor had been revealed.",
        "source": "T13n0397_041:0272a22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩眾，所得壽命一種無差。",
        "translation": "All bodhisattvas, mahāsattvas, and their lives are indistinguishable from one another.",
        "source": "T13n0397_041:0272a25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切天、龍、夜叉、羅剎、人及非人，得見一切諸佛剎土，光明遍照種種莊嚴心皆歡喜。",
        "translation": "All gods, dragons, yakṣas, rājas, humans, and nonhumans rejoice when they see all the buddha bases, their lights shining everywhere, and their hearts adorned.",
        "source": "T13n0397_041:0272a26_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方一切餘佛剎中，此剎光明最勝巍巍，福德因緣得此殊勝。",
        "translation": "Of all the other buddha bases in the ten directions, this one has the most brilliant and majestic light, and the causes and conditions of good fortune have made it so special.",
        "source": "T13n0397_041:0272a28_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘佛剎中一切五道皆來此剎，供養禮拜釋迦如來。",
        "translation": "All five destinies in the other buddha buddhas came to this blaze to make offerings and venerate the Śākyamuni Tathāgata.",
        "source": "T13n0397_041:0272a29_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，佛神力故，此娑婆界及十方佛土一切眾生入佛身內，如是神通諸佛境界三摩提力。",
        "translation": "As a result of the Buddha's spiritual power, all the sentient beings in this sahā world and in the Buddha lands of the ten directions enter the Buddha's body with the power of the samādhi of the Buddha's realm as such a superb ability.",
        "source": "T13n0397_041:0272b01_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生見佛身光，出過十方一切諸佛世界，普皆充滿照曜殊特能蔽餘光。",
        "translation": "Those sentient beings see the Buddha's body as a radiance that transcends all the buddha-lands in the ten directions and is universally filled with radiance that shines brilliantly and obscures the other radiances.",
        "source": "T13n0397_041:0272b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於自坐處作如是說：「釋迦如來不可思議未曾聞見。」",
        "translation": "From where they were sitting, they said, \"The Śākyamuni Tathāgata is unfathomable and has never been heard or seen before.\"",
        "source": "T13n0397_041:0272b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩如是說已，各以種種華香寶衣袈裟纓絡種種音樂供養如來，供養畢已無量百千右繞禮拜，悉皆退坐。",
        "translation": "After they said this, the bodhisattvas each made an offering to the Tathāgata with various flowers, incense, precious robes, robes, and various music, and after making their offerings, they made measureless hundreds of thousands of right-handed prostrations as they retired from their seats.",
        "source": "T13n0397_041:0272b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此大眾，一切天、龍、夜叉、羅剎、阿修羅、迦婁羅、緊陀羅、摩睺羅伽、鳩槃茶、薜荔、多毘舍、遮富單那、迦吒富、單那，乃至一切人及非人，亦設種種供養，如前作禮右繞畢皆退坐，如是聽法。",
        "translation": "That large crowd of gods, dragons, yakṣas, rāṣas, asuras, garuḍas, khadira, khadira, mahoraga, kumbhāṇḍas, śrīs, dhāvas, cāpūtanas, kaṭapuṇḍas, and even all humans and non-humans also made various offerings, paid homage as before, circled to the right, withdrew, and sat down to listen to the teaching in this way.",
        "source": "T13n0397_041:0272b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主，將領眷屬在於閻浮地上遊行。",
        "translation": "The great demon army lord who was the basis of the precepts then led his retinue to promenade on the ground of Jambudvīpa.",
        "source": "T13n0397_041:0272b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，如來在眾中坐，示現常身安然不動。",
        "translation": "At the time, the Tathāgata was sitting in the midst of the crowd, displaying his eternal body in a peaceful and unmoving manner.",
        "source": "T13n0397_041:0272b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大魔軍主見已念言：「沙門瞿曇示現大身，今復本形在摩伽陀國端坐不異，或能見我大魔軍眾，怖畏失力無復神通。」",
        "translation": "After the army lord of Māra saw this, he thought, \"The ascetic Gautama has revealed a great body, and now he's sitting upright in his original form in the country of Magadha, not different from what he would have seen if he'd been able to see my army of Māra, fearful and powerless, with no more supernormal powers.\"",
        "source": "T13n0397_041:0272b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼戒依止大魔軍主復作是念：「沙門瞿曇多諸巧慧，或能於我欲生惡心，我今先當到瞿曇所，看彼道術方便因緣，試共談論觀其詐偽。」",
        "translation": "The Mahāmahārājan who relies on the precepts then again thought, \"The ascetic Gautama has lots of ingenuity and wisdom, and he might want to give rise to bad thoughts about me.",
        "source": "T13n0397_041:0272b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主，眷屬圍繞前至佛所，對如來立而說偈言：「未能度脫於自身，　　生死海中得出離，　何以誑他眾生類，　　云我安汝置涅槃。」",
        "translation": "Relying on the great army lord Māra and surrounded by his retinue, the precepts master went to the Buddha, stood up to the Tathāgata, and spoke in verse, saying, \"If you haven't been able to liberate yourself, why have you escaped from the ocean of birth-and-death? Why do you deceive other kinds of sentient beings, saying, 'I will put you in nirvāṇa.'\"",
        "source": "T13n0397_041:0272b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，如來答戒依止大魔軍主而說偈言：「我久超度流轉海，　　更不生於諸有中，　慈悲愍念諸群生，　　是故說於出要道。",
        "translation": "At that point, the Tathāgata answered the great army of Māra-dependents in moral discipline and spoke in verse, \"I have long since transcended the ocean of transmigration, never again will I be born among the living, and I compassionately consider all sentient beings; therefore, I explain the path to liberation.",
        "source": "T13n0397_041:0272b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝於往昔無數劫，　　已發最勝菩提心，　值遇然燈佛世尊，　　修行布施及持戒。",
        "translation": "In the countless eons of the past, you developed the supreme aspiration for enlightenment, met the World Honored One Randamāṇa Buddha, and cultivated generosity and observance of precepts.",
        "source": "T13n0397_041:0272b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是過去億千佛，　　悉已恭敬曾供養，　當得於此清淨乘，　　我今決定授汝記，　未來成佛還如我，　　云何乃說誑眾生？",
        "translation": "Thus, billions of buddhas in the past were all honored and worshipped, and they were once offered support; they will attain the pure vehicle.",
        "source": "T13n0397_041:0272c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今施汝智慧眼，　　可念前生行本末。",
        "translation": "'Now, I'll give you the eye of wisdom, so you can remember the fundamentals of your actions in previous lives.",
        "source": "T13n0397_041:0272c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時戒依止魔軍主，　　即得宿命識往身，　頭陀苦節習於禪，　　業果福德皆明了。」",
        "translation": "The demon army leader who then relies on the precepts immediately attains consciousness of past lives and past bodies, trains in the ascetic practice of meditation, and clearly understands the fruits of karma and fortune.\"",
        "source": "T13n0397_041:0272c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戒依止大魔軍主聞此偈已，念彼過去福德因緣，對於如來五體布地，眼中淚出，長跪合掌，作如是言：「如來世尊！",
        "translation": "After hearing this verse, the great demon army leader who relies on precepts remembered the causes and conditions of their past merits, bowed his knees to the Tathāgata with five bodies on the ground, tears welling up in his eyes, knelt down with his palms together, and said, \"Thus did the Bhagavān!",
        "source": "T13n0397_041:0272c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我大懊悔、我大慚愧，如大癡人如迷如醉如著鬼癲，我念過去經一阿僧祇劫，大精進力發阿耨多羅三藐三菩提心，行六波羅蜜，修習聖道作諸福德，值佛現在種種供養，聽受妙法發弘誓願。",
        "translation": "With great remorse and shame, like a great fool who's deluded, drunk, or possessed of a demon's insanity, I remembered that in the past, after one incalculable eon, I had made great effort to arouse the mind of unsurpassed, corrected the six perfections, cultivated the noble paths, produced merit, made various offerings to the Buddha in the present, listened to the wonderful Dharma, and made a great vow.",
        "source": "T13n0397_041:0272c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至迦葉如來法中有一比丘說聲聞法，有大乘人說菩薩法，我於爾時心錯、口惡謗此說人，言是魔語或魔眷屬，大乘人邊說小乘過。",
        "translation": "Even when there was a monk in the Kāśyapa Tathāgata's teaching who taught the śrāvaka teaching and a great vehicle person who taught the bodhisattva teaching, I mistakenly and verbally misrepresented the speaker, saying that it was the devil's words or the devil's retinue and that it was a mistake for a great vehicle person to teach the lesser vehicle at the margin.",
        "source": "T13n0397_041:0272c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是惡口說因緣故，我於彼中迦葉如來不授我記得阿耨多羅三藐三菩提。",
        "translation": "As a result of such harsh verbal expressions, the Tathāgata Kāśyapa wouldn't grant me the privilege of recollecting the unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_041:0272c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以彼惡口罪業因緣，我於彼死魔界中生，受是身來已經五十七億千歲。",
        "translation": "As a result of that bad speech, I was born in that demon realm of death and have been subjected to this body for 5,700,000,000 years.",
        "source": "T13n0397_041:0272c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_041:0272c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我寧更歷六百千年受地獄苦，終不一念失阿耨多羅三藐三菩提心，何況退於四梵行念？」",
        "translation": "I would go through another 6,000 years of suffering in hell and never lose the mind of unsurpassed, correct enlightenment in a single thought, so why would I retrogress from the four recitations of the religious practice?\"",
        "source": "T13n0397_041:0272c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一、第二如是懺悔，乃至第三如是懺悔，并餘眷屬亦復如是。",
        "translation": "Thus repenting the first and second, and thus repenting the third, and so will the rest of his retinue.",
        "source": "T13n0397_041:0272c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又過去世流轉際中，如是當來於生死海及在地獄，終不暫退阿耨多羅三藐三菩提心。」",
        "translation": "\"Again, in the course of their transmigration through the past, they will surely never temporarily retrogress from the mind of unsurpassed, correct enlightenment in the ocean of birth-and-death or in hell.\"",
        "source": "T13n0397_041:0272c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「軍主！",
        "translation": "The Buddha said, \"Lord Commander!",
        "source": "T13n0397_041:0272c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉，善哉！",
        "translation": "Bravo, bravo!",
        "source": "T13n0397_041:0272c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_041:0272c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，燃於大燈如須彌山，并七寶物於無量世供養諸佛，是福德聚不如有人至心慈悲發菩提心。",
        "translation": "\"If another person were to burn a great lamp like Mount Sumeru and make offerings to the buddhas with seven precious things throughout measureless time, this wouldn't be as valuable as someone who wholeheartedly compassionately arouses the mind of enlightenment.",
        "source": "T13n0397_041:0272c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_041:0273a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發是心者，乃是供養十方諸佛，彼過去福此最為勝。",
        "translation": "Such a person gives rise to this intention, which is to make offerings to the buddhas of the ten directions, and this is the most meritorious of them all in the past.",
        "source": "T13n0397_041:0273a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝善男子！",
        "translation": "You good sons!",
        "source": "T13n0397_041:0273a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今盡此罪更莫餘念，生死五陰一切有中得導師身。」",
        "translation": "Now, once these sins are ended, there's nothing left to think about, and I'll attain the body of a guide among the five aggregates of birth-and-death and all existence.\"",
        "source": "T13n0397_041:0273a02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時戒依止菩薩摩訶薩，即於坐處得法順忍，從坐而起頭面作禮繞佛三匝，即脫身上無價寶衣真珠瓔珞供養如來。",
        "translation": "At that point, the bodhisattva Mahāsattva, who relies on morality, immediately attained the patience of following the Dharma while sitting there, rose from his seat, paid homage with his head and face, and circled the Buddha three times, then took off his priceless precious garments and offered them to the Tathāgata as a gift of genuine pearls and jewelry.",
        "source": "T13n0397_041:0273a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脫布施已，說偈問言：「菩薩云何修諸法？",
        "translation": "After he had taken off the offering, he spoke in verse and asked, \"How do bodhisattvas cultivate the Dharma?",
        "source": "T13n0397_041:0273a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　達了一切悉皆空，　觀察世間如水泡，　　能盡諸有無明縛。",
        "translation": "He fully understands that all are empty, observes the world as a bubble of water, and is able to end the bonds of ignorance in all existences.",
        "source": "T13n0397_041:0273a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切惡見性非實，　　得勝無生順忍心，　常於菩提道中行，　　能令眾生得解脫。」",
        "translation": "All mistaken views are not real in nature, attain superior unborn compliance and forbearance, always walk in the path of enlightenment, and cause sentient beings to attain liberation.\"",
        "source": "T13n0397_041:0273a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊答戒依止而說偈言：「不動如山四種心，　　智慧之人乃能有，　無量億劫受諸苦，　　為愍一切諸眾生。",
        "translation": "It was then that the Bhagavān answered the question about the basis of the precepts and spoke the verse, \"There are four kinds of mind that don't budge like a mountain, which only a person of wisdom can have, and which are subject to suffering for measureless millions of eons in order to pity all sentient beings.",
        "source": "T13n0397_041:0273a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛說禁戒堅固持，　　乃至不破如一點，　一切三世佛正法，　　具足圓滿悉能行。」",
        "translation": "The Buddha teaches the resolute observance of the precepts, even when they aren't broken like a single point, and the perfect and complete fulfillment of all three worldly Buddha-right teachings.\"",
        "source": "T13n0397_041:0273a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，八萬四千魔軍及戒依止菩薩眷屬，聞戒依止得授記已心大歡喜，即於佛前至心悔過，一切皆發阿耨多羅三藐三菩提心，此菩提心名為三昧順菩提心。",
        "translation": "At the time, 84,000 troops of Māra and the retinue of bodhisattvas relying on the precepts rejoiced greatly when they heard that their reliance on the precepts had been given a prediction, and they all repented wholeheartedly before the Buddha and aroused the mind of unsurpassed, correct enlightenment, which is called the mind of samādhi and compliant enlightenment.",
        "source": "T13n0397_041:0273a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得此心已，歡喜踊躍，各各脫衣以用布施，布施已坐。",
        "translation": "After attaining this mind, they rejoiced and jumped for joy, each took off their robes and offered them as alms, and after making their offering, they sat down.",
        "source": "T13n0397_041:0273a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，波旬見其軍主并及眷屬已歸依佛，心生瞋忿苦惱不安，更大怖畏作如是言：「我今得出沙門腹中，復失眷屬，未知幾人於此得出？",
        "translation": "Seeing that his army commander and his retinue had returned to the Buddha, Pāpīyān was angered, distressed, and fearful, and said, \"Now that I've escaped from the belly of the ascetic and lost my retinue, I wonder how many people have escaped here?",
        "source": "T13n0397_041:0273a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作佛弟子有幾人在？",
        "translation": "How many people are disciples of the Buddha?",
        "source": "T13n0397_041:0273a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "速閉城門，莫放一人令其出外，自魔境界安隱住止。」",
        "translation": "Quickly shut the city gates, don't let a single person go outside, and stay calmly in the demon's realm.\"",
        "source": "T13n0397_041:0273a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊更為彼魔大眾眷屬說三種梵行，所謂眾生攀緣、法攀緣、離攀緣，如虛空眼品中說。",
        "translation": "At the time, the Bhagavān explained three kinds of religious practices for that large group of Māra's followers, which are called the clinging to sentient beings, the clinging to qualities, and freedom from clinging, as explained in the chapter on the eye of space.",
        "source": "T13n0397_041:0273a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，一切諸天龍王，悉皆集會佉羅坻山牟尼聖人處所中住，彼一切龍各見自形小如銅斫欲動不能，遊行絕望思念舊體，懊惱細身宛轉彼中，不得自在怖畏毛竪，一切相與向難陀、跋難陀王邊，禮拜作如是言：「大王！",
        "translation": "At the time, all the gods and dragon kings had gathered together on Mount Kharādī to stay at the sage's residence, and each of those dragons saw himself as small as a copper chopper, unable to move, staging a procession, desperate, longing for his old body, distressed, and fine-bodied, wandering about in that place, unable to attain independence, and terrified, with their hair standing on end, and they all bowed down to King Nanda and King Vānanda and said, \"Great king!",
        "source": "T13n0397_041:0273a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我龍國土，今者所有蚊虻、蒼蠅、毒虫、糞穢種種不淨，皆是瞿曇之所為也。",
        "translation": "\"In our land of dragons, all the gnats, flies, poisonous insects, and filth that are unclean are the work of the Gautama.",
        "source": "T13n0397_041:0273b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我等皆捨宮宅，來到此間求覓救濟，又不能得離於小身及以怖畏。",
        "translation": "That's why we all left our palaces and homes and came here to look for help, but we couldn't escape the small body and its fears.",
        "source": "T13n0397_041:0273b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能歸依佛世尊者可得免脫。」",
        "translation": "If we could rely on the Bhagavān, we could be freed.\"",
        "source": "T13n0397_041:0273b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，難陀、跋難陀龍王作如是言：「沙門瞿曇多諸方便種種幻術，能內一切娑婆佛剎安置身中，於我龍家亦復化作一切諸惡，令我怖畏來此求救。",
        "translation": "Thus did the dragon-rulers Nandana and Pūrṇa say, \"The ascetic Gautama is full of skillful illusions that can place all the śramaṇas and buddhas inside his body, and he also conjures up all kinds of evil in my dragon family, causing me to be frightened and come here to seek help.",
        "source": "T13n0397_041:0273b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者沙門自失勢力，無復方便神通道術，身今如本坐舊座中豈能救我？",
        "translation": "Now, since he has lost his own power and has no more skillful means, supernormal abilities, or techniques, can the ascetic save me while sitting in his old seat?",
        "source": "T13n0397_041:0273b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是小身既造此獄，安置於我皆不得去，何能救濟令無怖畏？",
        "translation": "Since such a small body has created this prison, and none of its placements with me can leave, how can it be rescued and made fearless?",
        "source": "T13n0397_041:0273b13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸龍繫屬波旬，欲界自在唯有魔力，今可禮拜求出此難，各各還家安隱而住。」",
        "translation": "All the dragons bound to Pāpīyān have sovereignty in the desire realm only through the power of magic, so now they can venerate him and ask to be freed from this difficulty, so they can each return home and live in comfort.\"",
        "source": "T13n0397_041:0273b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，伊羅婆龍王復作是言：「汝等諸龍莫生懊惱。",
        "translation": "It was then that the dragon king of Elāpattra again said, \"Don't be distressed, you dragons.",
        "source": "T13n0397_041:0273b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_041:0273b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門瞿曇已能降伏魔之眷屬，群臣人民作於弟子，唯魔王在喪失本心及其神力，云何當能救濟汝等？」",
        "translation": "After the ascetic Gautama has subdued Māra's retinue and made his ministers and people his disciples, how will he be able to rescue you while the king of Māra is deprived of his original mind and his spiritual powers?\"",
        "source": "T13n0397_041:0273b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸龍王，聞伊羅婆如是說已，或有禮拜四天王者，或有禮拜帝釋天者，或有禮拜須夜摩天，或有禮拜刪兜率陀，或有禮拜化樂天者，或有禮拜他化自在，或有禮拜大梵天者。",
        "translation": "After hearing this from Elāpattra, some of those dragon kings paid homage to the four heavenly kings, some to Śakra, some to Suyāma, some to Śāntūra, some to Nirmāṇarati, some to Paranirmitava, and some to Brahmā.",
        "source": "T13n0397_041:0273b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，娑伽羅龍王復語一切諸龍王言：「汝等不見彼諸天王、人及非人、聖賢雜類，禮拜供養沙門瞿曇而歸依耶？」",
        "translation": "It was then that the Sāgara-nāga-rāja again addressed all the dragon kings, saying, \"Haven't you seen those god kings, humans and nonhumans, and noble and wise types venerating and making offerings to the ascetic Gautama and taking refuge there?\"",
        "source": "T13n0397_041:0273b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸龍即復歸依其餘仙聖。",
        "translation": "The dragons then reverted to the other sages.",
        "source": "T13n0397_041:0273b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼山頂有六聖人：第一名蘇尸摩、第二名那籌、第三名阿收求多、第四名毘梨呵、第五名婆揭蒱、第六名殊致阿羅娑(隋言光味)。",
        "translation": "At the time, there were six sages on that mountain top: the first was Sushma, the second was Nācha, the third was Aśvakarṇa, the fourth was Vīrya, the fifth was Bhagavān, and the sixth was Jyotīrasa (Sui dialect for flavor of light).",
        "source": "T13n0397_041:0273b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一切龍，或有歸於蘇尸摩邊作禮拜者，或有歸依於那籌者，或有禮拜阿收求多，或有禮拜毘梨呵者，或有歸依婆揭蒱者，或有歸依殊致羅娑。",
        "translation": "Some of those dragons may have returned to worship at the edge of Sushma, some may have returned to Nādāra, some may have worshipped Aśvakarṇa, some may have worshipped Vīryha, some may have returned to the Vākāśyas, and some may have returned to Jyotīrasa.",
        "source": "T13n0397_041:0273c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一切龍，皆悉歸命此六聖人請求救濟，是六聖人得五神通，悉各在於雪山邊住。",
        "translation": "All those dragons then turn to these six sages for help, and these six sages attain five supernormal powers, each staying at the edge of Mount Snow.",
        "source": "T13n0397_041:0273c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼五聖人皆在殊致羅娑菩薩摩訶薩大聖人所，聽於正法。",
        "translation": "Those five sages were all staying at the place of the great sage Jyotirasa, the bodhisattva Mahāsattva, listening to the right teaching.",
        "source": "T13n0397_041:0273c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時殊致羅娑菩薩，亦以種種無量言辭，讚歎釋迦如來神德。",
        "translation": "At the time, Jyotīrasa praised the Śākyamuni Tathāgata's superb qualities with various and immeasurable words.",
        "source": "T13n0397_041:0273c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時五聖人悉聞一切龍王哭聲，求乞救濟。",
        "translation": "The five sages then heard the cries of all the dragon kings, begging for help.",
        "source": "T13n0397_041:0273c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞已即起，白殊致羅娑菩薩摩訶薩言：「大德頗聞彼龍啼哭、[口*睪]咷、求救聲不？」",
        "translation": "After hearing this, they rose and said to Jyotīrasa, the bodhisattva-mahāsattva, \"Great virtuous one, have you heard the cries and [mouth*testicle] trampling of those dragons, begging for help?\"",
        "source": "T13n0397_041:0273c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「已聞。」",
        "translation": "He replied, \"I've heard it.\"",
        "source": "T13n0397_041:0273c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大士！",
        "translation": "\"Maestro!",
        "source": "T13n0397_041:0273c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今聖人處，一切諸龍大懊惱心，我等聞知尚欲往救，況大德乎？",
        "translation": "Now, when we hear about the sages and all the dragons who are greatly distressed, we still want to rescue them, so why wouldn't we, the great virtuous ones?",
        "source": "T13n0397_041:0273c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願慈悲往至彼所，救一切龍與其解脫。」",
        "translation": "Please have mercy and go there to save and liberate all those dragons.\"",
        "source": "T13n0397_041:0273c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時殊致羅娑大聖人言：「汝等可往，我未及去。",
        "translation": "The great sage Jyotīrasa then said, \"You may go there, but I haven't yet left.",
        "source": "T13n0397_041:0273c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0397_041:0273c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中大天、龍王、夜叉，百千萬眾今對我坐，問離障礙四梵行法，彼心歡喜聽我所說。」",
        "translation": "Here, the great gods, dragon kings, and yakṣas, a hundred million of them, are sitting here facing me, asking about the four pure practices that are free of obstructions, and their hearts are glad to hear what I have to say.\"",
        "source": "T13n0397_041:0273c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時五聖人禮彼殊致羅娑大士三匝繞已，以神通力飛騰虛空，到佉羅坻大山頂頭牟尼聖人處所。",
        "translation": "After the five sages paid homage to that great man Jyotirasa and circled him three times, they soared through the sky with their supernormal powers and went to the place of the sage Muni at the top of Mount Kharādī.",
        "source": "T13n0397_041:0273c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼處一切龍王，見五聖人心生歡喜，恭敬禮拜作如是言：「汝等大仙福德之人，智慧方便一切莊嚴，於苦惱中已到彼岸，願救濟我出惡獄中令得解脫。」",
        "translation": "At the time, all the dragon kings there rejoiced when they saw the five sages, venerated them, and worshipped them, saying, \"You great men of merit and virtue, with your wisdom and skillful means and all their adornment, have reached the other shore in the midst of suffering and distress; may you rescue me from the evil hells and bring about my liberation.\"",
        "source": "T13n0397_041:0273c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼五聖人如是答言：「我等不能救濟汝等。",
        "translation": "The five sages thus replied, \"We won't be able to rescue you.",
        "source": "T13n0397_041:0273c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0397_041:0273c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現今雪山有大菩薩名殊致羅娑，諸聖人中最大智慧大解方便，彼菩薩能與汝解脫，汝可一心求哀勸請。」",
        "translation": "Now, there's a great bodhisattva on Mount Snow named Jyotīrasa, the most intelligent and greatly liberated of the sages, who can grant you liberation and whom you can single-mindedly seek out and respectfully persuade.\"",
        "source": "T13n0397_041:0273c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸龍聞已，如是異身同共合掌，遙向殊致羅娑聖人，恭敬禮拜皆唱是言：「大德聖人！",
        "translation": "After the dragons heard this, they joined their palms together as one body, paid respectful homage to Sage Jyotīrasa, and all said, \"Great sage!",
        "source": "T13n0397_041:0273c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願救濟我願憐愍我。」",
        "translation": "May I be rescued and may I have pity on you.\"",
        "source": "T13n0397_041:0273c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，殊致羅娑菩薩摩訶薩，聞彼龍王唱救濟聲，即與大天緊那羅等，夜叉羅剎百千萬人前後圍繞，以神通力發於雪山乘空而往，到佉羅坻山頂。",
        "translation": "Hearing that dragon king's call for relief, the Jyotīrasa bodhisattva Mahāsattva then, surrounded by the great celestial kiṃnara and others and the tens of millions of night-shark rājasasas, used their supernormal powers to ride up in the air on Mount Snowdon and reach the top of Mount Kharādī.",
        "source": "T13n0397_041:0273c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸龍王見彼聖人，各各恭敬合掌禮拜，一心同聲作如是言：「大仙聖人願救濟我，於此獄中與我解脫，令我自身及以眷屬，安隱還家離諸苦惱。」",
        "translation": "When the dragon kings saw that sage, they each bowed their heads with their palms together in respect, and with one voice they said, \"Great sage, may you rescue me, liberate me from this hell, and allow me and my retinue to return home safely, free of suffering and distress.\"",
        "source": "T13n0397_041:0274a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，殊致羅娑菩薩善解方便知世因緣，欲為諸龍說星宿法：「星宿法者，各有度數和合時節，合時則易、不合則難。",
        "translation": "At the time, Jyotīrasa wanted to explain the astrological principles to the dragons, understanding the causes and conditions of the world well and wanting to explain the astrological principles to them, \"Astrological principles each have a number of degrees and a time and place, and when they fit together, it's easy, but when they don't fit together, it's difficult.",
        "source": "T13n0397_041:0274a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時節未合不得解脫，諦聽次第，我當為汝分別解說。",
        "translation": "You can't be liberated until the time and period coincide, so listen closely to the order and I'll explain it for you in detail.",
        "source": "T13n0397_041:0274a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「今此月者名奢婆拏，星宿名為富那婆藪，富那婆藪屬此五月，此月復繫屬於日天。",
        "translation": "\"Now, this moon is called Śivaṇa, and the star constellation is called Punarvasu, and Punarvasu belongs to this fifth month, which is also bound to the sun god.",
        "source": "T13n0397_041:0274a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸龍王，與此星辰時未和合。」",
        "translation": "You dragon kings, you haven't been in tune with these stars for a while.\"",
        "source": "T13n0397_041:0274a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，娑伽羅龍王白殊致羅娑菩薩言：「大士！",
        "translation": "It was then that the dragon king Sāgara said to the bodhisattva Jyotīrasa, \"Maestro!",
        "source": "T13n0397_041:0274a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是星宿者本誰所說？",
        "translation": "\"Who originally taught this to the constellations?",
        "source": "T13n0397_041:0274a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰作大星、誰作小星、誰作日月？",
        "translation": "Who will be the great star, who will be the small star, and who will be the sun and moon?",
        "source": "T13n0397_041:0274a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何日之中何星在先？",
        "translation": "What star was first in the midst of what day?",
        "source": "T13n0397_041:0274a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於虛空中復誰安置三十日月、十二月年？",
        "translation": "Who else in space places the thirty days of the month and the twelve months of the year?",
        "source": "T13n0397_041:0274a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為時？",
        "translation": "What is the time?",
        "source": "T13n0397_041:0274a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫屬何處、姓何字誰？",
        "translation": "Where are they bound, and what is their family name and who is their name?",
        "source": "T13n0397_041:0274a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何善何惡、何食何施？",
        "translation": "What is good, what is evil, and what is food and charity?",
        "source": "T13n0397_041:0274a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為是晝若為是夜，日月星宿復若為行，何者名為月初一日、何者滿月？",
        "translation": "\"If it's day or night, and if the sun, moon, and stars continue in their courses, which is called the first day of the month and the full moon?",
        "source": "T13n0397_041:0274a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為時節若為行度，一一各幾？",
        "translation": "\"If it's the right time or the right practice, how much of each?",
        "source": "T13n0397_041:0274a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復若為停、幾許時行？",
        "translation": "\"Again, if we were to stop, how often would we do it?",
        "source": "T13n0397_041:0274a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是輕、何者是重？",
        "translation": "What is light and what is heavy?",
        "source": "T13n0397_041:0274a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是合、何者非合？",
        "translation": "What is combined and what is not combined?",
        "source": "T13n0397_041:0274a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何力多、云何力少？",
        "translation": "\"How much power does it have, and how little power does it have?",
        "source": "T13n0397_041:0274a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為日前後行？",
        "translation": "\"What is called the practice of going before and after?",
        "source": "T13n0397_041:0274a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上行幾影、下行幾影？",
        "translation": "How many shadows upward and how many shadows downward?",
        "source": "T13n0397_041:0274a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "影有幾步名曰為轉初轉？",
        "translation": "\"How many steps in the shadow are there that are called the first turn?",
        "source": "T13n0397_041:0274a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何月北月南？",
        "translation": "How is it that the moon is north and the moon is south?",
        "source": "T13n0397_041:0274a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何次第？",
        "translation": "What is the order of precedence?",
        "source": "T13n0397_041:0274a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大士！",
        "translation": "Mañjuśrī!",
        "source": "T13n0397_041:0274a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於諸聖第一最尊，願愍我龍具足解說，我等聞已脫苦奉行。」",
        "translation": "You are the most venerable of the sages, so kindly take care of us dragons and explain it fully; after hearing it, we'll escape suffering and hand it down.\"",
        "source": "T13n0397_041:0274a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，殊致羅娑菩薩告諸龍言：「大王！",
        "translation": "It was then that Jyotīrasa addressed the dragons, saying, \"Great king!",
        "source": "T13n0397_041:0274a26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去世時，此賢劫初有一大城名曰瞻波，彼中人民和合熾盛。",
        "translation": "In a past time, at the beginning of this good eon, there was a large city named Campā in which the people were united and flourishing.",
        "source": "T13n0397_041:0274a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一天子名大三摩多，端正少雙才智聰明正法行化，常樂寂靜不著世榮，為諸人民之所宗仰，恭敬禮拜而侍衛之。",
        "translation": "There was a celestial named Mahāsamatha, a correct, youthful man of rare intelligence, wise in the ways of right conduct, always happy and tranquil, and not attached to worldly prosperity, who was revered by the people, venerated, worshipped, and served them.",
        "source": "T13n0397_041:0274a28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼三摩多清淨慈悲，愍念眾生猶如赤子，不樂愛染常自潔身。",
        "translation": "That samādhi is pure and compassionate, pities sentient beings like a red child, and doesn't enjoy defiled love and always cleanses himself.",
        "source": "T13n0397_041:0274b02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有夫人多貪色欲，王既不幸無處遂心，曾於一時遊戲園苑，獨在林下止息自娛，見驢命群根相出現，慾心發動脫衣就之。",
        "translation": "The king has a wife who often lusts after sex, and when he's unhappy and has nowhere else to turn, he once played in a garden and was alone under a grove, taking a rest and enjoying himself, when he saw a donkey's life and the appearance of its many faculties, his desire arouse, and he took off his clothes and went to it.",
        "source": "T13n0397_041:0274b03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "驢見即交遂成胎藏，月滿生子，頭耳口眼悉皆似驢，唯身類人而復麁澁，[髟/公/心]毛被體與畜無殊。",
        "translation": "Seeing this, the donkey then has intercourse and becomes a womb, and when the moon is up, it gives birth to a child whose head, ears, mouth, and eyes all resemble a donkey, except that its body is humanoid and coarse, and its [shaggy/gong/heart] hair is covered with body no different from that of an animal.",
        "source": "T13n0397_041:0274b06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人見之心驚怖畏，即便委棄投於屏中，以福力故處空不墜。",
        "translation": "Frightened, the lady who sees it abandons it and throws it into a screen, but because of the power of good fortune, it doesn't fall into the air.",
        "source": "T13n0397_041:0274b08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時有羅剎婦名曰驢神，見兒不污念言：『福子。』",
        "translation": "\"Then, there was a Rāṣṭrapāla woman named Donkey God who saw her son and thought, 'Blessed son!'",
        "source": "T13n0397_041:0274b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂於空中接取洗持，將往雪山乳哺畜養，猶如己子等無有異。",
        "translation": "She then picked him up in the air, washed him, and sent him off to the snowy mountains to be nursed and raised like her own son, no different than him.",
        "source": "T13n0397_041:0274b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及至長成教服仙藥，與天童子日夜共遊。",
        "translation": "When he had grown up, he was taught to take immortal medicine and traveled with the celestial boy day and night.",
        "source": "T13n0397_041:0274b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有大天亦來愛護此兒，飲食甘果藥草身體轉異，福德莊嚴大光照耀，如是天眾同共稱美，號為佉盧虱吒(隋言驢脣)大仙聖人。",
        "translation": "\"Again, there are great gods who come to love and protect this child, feed him sweet fruit and medicinal herbs, transform his body, and shine with great splendor and fortune, and they all praise him as the sage Kharoshita (Sui word for donkey's lip).",
        "source": "T13n0397_041:0274b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣彼雪山中并及餘處，悉皆化生種種好華，種種好果，種種好藥，種種好香，種種清流，種種和鳥，在所行住並皆豐盈，以此藥果資益因緣，其餘形容麁相悉轉身體端正，唯脣似驢，是故名為驢脣仙人。",
        "translation": "Because of these causes and conditions, various kinds of good flowers, various kinds of good fruits, various kinds of good medicines, various kinds of good fragrances, various clear streams, and various kinds of harmonious birds are produced in the snow-capped mountains and elsewhere, and they all abound in their travels and abodes, which bring benefit and reward to their causes.",
        "source": "T13n0397_041:0274b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是驢仙人學於聖法，經六萬年翹於一脚，日夜不下無有倦心。",
        "translation": "\"Thus, the donkey-headed sage trains in the noble teaching and remains on one leg for 60,000 years, going day and night without tire.",
        "source": "T13n0397_041:0274b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天見大仙如是苦行，時諸梵眾及帝釋天，并餘上方欲色界等，和合悉來禮拜供養，乃至龍眾、修羅、夜叉一切雲集，所有仙聖修梵行人，皆來到此驢聖人邊。",
        "translation": "When the gods saw this great sage thus asceticizing, the Brahmans, Indra's gods, and the rest of the upper lust and form realms combined to venerate and make offerings to him, and even dragons, sūras, and yakṣas all gathered in clouds, so all the sages, sages, and practitioners of Brahmā came to this sage with a donkey's lips.",
        "source": "T13n0397_041:0274b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種供奉讚歎稱揚：『如是苦行生來未覩。』",
        "translation": "They make all kinds of offerings, praise, and commend him, saying, 'Such austerities have never been seen in his life.'",
        "source": "T13n0397_041:0274b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設供養已合掌問言：『大仙聖人欲求何等？",
        "translation": "Suppose he joins his palms after making an offering and asks, 'What does the sage want, great sage?'",
        "source": "T13n0397_041:0274b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願為我諸天說之，若我力能即當相與終不悋惜。』",
        "translation": "Please tell them for me, gods, and if I'm able, I'll give them to you and never hold back.'",
        "source": "T13n0397_041:0274b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，驢脣聞是語已，內心慶幸答諸天言：『必能稱我情所求者今當略說。",
        "translation": "\"After hearing these words, Donkey-paw rejoiced inwardly and answered the gods, 'I will explain in brief what I must be able to say about what my feelings desire.",
        "source": "T13n0397_041:0274b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念宿命，過去劫時見虛空中有諸列宿日月五星，晝夜運行各守常度，為於天下而作照明。",
        "translation": "When I was mindful of my past lives, I saw in the sky in eons past a series of constellations, the sun, moon, and five stars, each in constant motion by day and night, illuminating the world.",
        "source": "T13n0397_041:0274c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲了知分別識解，愍暗瞑故不憚劬勞。",
        "translation": "I wanted to know the understanding of discriminating consciousnesses, and I didn't trouble myself because I was concerned about the darkness.",
        "source": "T13n0397_041:0274c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫初無如是事，汝等一切諸天、龍神憐我故來，願說星辰日月法用，猶如過去置立安施，造作便宜善惡好醜，如我所願具足說之。』",
        "translation": "At the beginning of this good eon, there was nothing like this, so you gods, dragons, and goddesses have come to take pity on me and wish to explain the teaching of the Dharma and function of the stars, sun, and moon, just as you did in the past when you established and made offerings and created cheapness, goodness, badness, goodness, and ugliness, just as I have wished.'",
        "source": "T13n0397_041:0274c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一切天言：『大德仙人！",
        "translation": "\"All the gods said, 'Venerable sage!",
        "source": "T13n0397_041:0274c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事甚深非我境界。",
        "translation": "'This is a profound matter that's not my realm.",
        "source": "T13n0397_041:0274c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為憐愍一切眾生，如過去時願速自說。』",
        "translation": "If I were to have compassion for all sentient beings, I would like to quickly explain it myself, just as I did in the past.'",
        "source": "T13n0397_041:0274c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「◎爾時，佉盧虱吒仙人告一切天言：『初置星宿昴為先首，眾星輪轉運行虛空。』",
        "translation": "\"At the time, the sage Kashgar told all the gods, 'The first star constellation Pleiades is the leader, and the stars rotate and move through space.'",
        "source": "T13n0397_041:0274c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告諸天眾：『說昴為先其事是不？』",
        "translation": "He told the gods, 'Is it true that the Pleiades is said to be the first?'",
        "source": "T13n0397_041:0274c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，日天而作是言：『此昴宿者常行虛空歷四天下，恒作善事饒益我等，我知彼宿屬於火天。』",
        "translation": "The sun god then said, 'This Pleiades constellation always travels through space and under four heavens, always doing good works to benefit us, and I know that constellation belongs to the Fire God.'",
        "source": "T13n0397_041:0274c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時，眾中有一聖人名大威德，復作是言：『彼昴宿者我妹之子，其星有六形如剃刀，一日一夜歷四天下行三十時，屬於火天姓鞞耶尼，屬彼宿者祭之用酪。』",
        "translation": "\"Again, a sage named Mahātejas garuḍa said, 'That Pleiades is my sister's son, whose star has six forms like razors and travels under four heavens for 30 hours a day and night, and belongs to the Fire Goddess Vaiśālī, to whom he offers cheese for sacrifice.'",
        "source": "T13n0397_041:0274c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佉盧虱吒仙人語諸天曰：『如是，如是，如汝等言，我今以昴為初宿也。",
        "translation": "\"The sage Kashgar said to the gods, 'So it is, so it is, just as you said, I now take the Pleiades as my first constellation.",
        "source": "T13n0397_041:0274c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次置畢為第二宿，屬於水天，姓頗羅墮。",
        "translation": "\" 'Furthermore, he designated Pīrti as the second constellation, which belongs to the Water Celestial and is surnamed Bālādagupta.",
        "source": "T13n0397_041:0274c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畢有五星形如立叉，一日一夜行四十五時，屬畢宿者祭用鹿肉。",
        "translation": "Pi has five stars shaped like larks that travel forty-five hours a day and night, and those who belong to Pi are sacrificed for venison.",
        "source": "T13n0397_041:0274c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次置嘴為第三宿，屬於月天，即是月子，姓毘梨伽耶尼。",
        "translation": "\"'Furthermore, he designates the third constellation, Mouth, which belongs to the Moon Celestial, that's Yuezi, and his family name is Vṛjiyani.",
        "source": "T13n0397_041:0274c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "星數有三形如鹿頭，一日一夜行十五時，屬嘴宿者祭根及果。",
        "translation": "It has three stars shaped like the deer's head and travels 15 hours a day and night, and those who belong to the Mouth constellation sacrifice their roots and fruit.",
        "source": "T13n0397_041:0274c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置參為第四宿，屬於日天，姓婆私失絺。",
        "translation": "\"'Furthermore, it's referred to as the fourth constellation, which belongs to the Sun goddess and is surnamed Vasiṣṭha.",
        "source": "T13n0397_041:0274c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其性大惡多於瞋忿，止有一星如婦人黶，一日一夜行四十五時，屬參宿者祭用醍醐。",
        "translation": "He's very evil and anger-ridden in nature, has only one star like a woman's hair, and travels 45 hours a day and night; those who belong to the constellation Sensual make offerings of ghee.",
        "source": "T13n0397_041:0274c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置井為第五宿，屬於日天，姓婆私失絺。",
        "translation": "\"'Next, we'll place Wells as the fifth constellation, which belongs to the Sun God and is surnamed Vasiṣṭha.",
        "source": "T13n0397_041:0275a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有兩星形如脚跡，一日一夜行十五時，屬井宿者以粳米華和蜜祭之。",
        "translation": "It has two stars shaped like footprints that travel for 15 hours a day and night, and those who belong to the well constellation sacrifice millet, flowers, and honey to them.",
        "source": "T13n0397_041:0275a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置鬼為第六宿，屬歲星天，歲星之子，姓炮波那毘，其性溫和樂修善法。",
        "translation": "\"'Furthermore, he places a demon as the sixth constellation belonging to the Nāgasena Heaven, the son of Nāgasena, surnamed Nāpāṇapi, who is gentle by nature and enjoys cultivating good qualities.",
        "source": "T13n0397_041:0275a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有三星猶如諸佛胸前滿相，一日一夜行三十時，屬鬼星者亦以粳米華和蜜祭之。",
        "translation": "He has three stars that look like the full face of a Buddha's chest and travels 30 hours a day and night.",
        "source": "T13n0397_041:0275a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置柳為第七宿，屬於蛇天，即姓蛇氏。",
        "translation": "\"'Next, he places Willow as the seventh constellation belonging to the Snake Celestial, which is surnamed Snake.",
        "source": "T13n0397_041:0275a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止有一星如婦女黶，一日一夜行十五時，屬柳星者祭用乳糜。",
        "translation": "There's only one star like the female form, which travels for fifteen hours a day and night, and those who belong to the star Willow sacrifice milk and rice.",
        "source": "T13n0397_041:0275a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右此七宿當於東門。",
        "translation": "These seven constellations on the right should be at the east gate.",
        "source": "T13n0397_041:0275a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次置南方第一之宿名曰七星，屬於火天，姓賓伽耶尼。",
        "translation": "\"'Next, we name the first constellation in the south, the seven stars, which belong to the Fire God, and it's surnamed Piṅgāyani.",
        "source": "T13n0397_041:0275a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有五星，形如河岸，一日一夜行三十時，屬七星者宜用粳米烏麻作粥祭之。",
        "translation": "It has five stars that are shaped like the banks of a river and travel for 30 hours a day and night, so it's appropriate to sacrifice to those who belong to the seven stars by making porridge of millet and wool.",
        "source": "T13n0397_041:0275a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置張為第二宿，屬福德天，姓瞿曇彌。",
        "translation": "\"'Next, we'll name Zhang the second constellation, which belongs to the Potala Heaven and is surnamed Gautamī.",
        "source": "T13n0397_041:0275a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其星有二形如脚跡，一日一夜行三十時，屬張宿者毘羅婆果以用祭之。",
        "translation": "Its star has two shapes like footprints and travels for 30 hours a day and night, so those who belong to the Zhang constellation should sacrifice them with fruit of the vajra.",
        "source": "T13n0397_041:0275a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置翼為第三宿，屬於林天，姓憍陳如。",
        "translation": "\"'Next, he places Wing as the third constellation, which belongs to the Forest Heaven and is surnamed Kauṇḍinya.",
        "source": "T13n0397_041:0275a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有二星形如脚跡，一日一夜行十五時，屬翼星者用青黑豆煮熟祭之。",
        "translation": "It has two stars shaped like footprints that travel for 15 hours a day and night, and those who belong to the winged stars sacrifice them by boiling green and black soybeans.",
        "source": "T13n0397_041:0275a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置軫為第四宿，屬沙毘梨帝天，姓迦遮延，蝎仙之子。",
        "translation": "\"'Next, we'll place the fourth star of the night, which belongs to the god Śabridev and is surnamed Kātyāyana, son of the scorpion sage.",
        "source": "T13n0397_041:0275a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其星有五形如人手，一日一夜行三十時，屬軫星者作莠稗飯而以祭之。",
        "translation": "When his star has five forms like a human hand and travels 30 hours a day and night, those belonging to the stars of Aṣāḍhā make a meal of weeds and grass and offer it up as a sacrifice.",
        "source": "T13n0397_041:0275a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置角為第五宿，屬喜樂天，姓質多羅延尼，乾闥婆子。",
        "translation": "\"'Next, we'll place the horns of the fifth star, which belongs to the Nirmāṇarati Heaven and is surnamed Cintāraṇī, son of Gandhāra.",
        "source": "T13n0397_041:0275a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止有一星如婦人黶，一日一夜行十五時，屬於角者以諸華飯而用祭之。",
        "translation": "When there's only one star like a woman's hair, it travels fifteen hours a day and night, and those who belong to Cape Horn offer rice with flowers as a sacrifice.",
        "source": "T13n0397_041:0275a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置亢為第六宿，屬摩姤羅天，姓迦栴延尼。",
        "translation": "\"'Furthermore, he places hyper as the sixth constellation, which belongs to the Mākhyala Heaven and is surnamed Kātyāyanīputra.",
        "source": "T13n0397_041:0275a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有一星如婦人黶，一日一夜行十五時，屬亢星者當取菉豆和蘇蜜煮以用祭之。",
        "translation": "When there's a star like a woman's hair that travels fifteen hours a day and night, the person who belongs to the star Hyper will gather raspberries and boil them with soap and honey to offer them as a sacrifice.",
        "source": "T13n0397_041:0275a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置氐為第七宿，屬於火天，姓些吉利多耶尼。",
        "translation": "\"'Next, we'll designate Śākyamuni as the seventh star of the Fire Goddess, whose family name is Sāgirītāyanī.",
        "source": "T13n0397_041:0275b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "氐有二星形如脚跡，一日一夜行四十五時，屬氐宿者取種種華作食祭之。",
        "translation": "When the Śākyamuni star has two stars shaped like footprints and travels for 45 hours a day and night, those who belong to the Śākyamuni star take various flowers and make offerings to them.",
        "source": "T13n0397_041:0275b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右此七宿當於南門。",
        "translation": "These seven constellations on the right should be at the south gate.",
        "source": "T13n0397_041:0275b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次置西方第一之宿其名曰房，屬於慈天，姓阿藍婆耶尼。",
        "translation": "\"'Next, he places the first constellation in the west, which is named Fang and belongs to the Maitreya Heaven, whose family name is Alambhayani.",
        "source": "T13n0397_041:0275b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "房有四星形如纓絡，一日一夜行三十時，屬房宿者酒肉祭之。",
        "translation": "It has four stars shaped like a tassel that travel for 30 hours a day and night, and those who belong to the constellation of Bong are offered meat and wine as sacrifice.",
        "source": "T13n0397_041:0275b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置心為第二宿，屬帝釋天，姓迦羅延那。",
        "translation": "\"'Next, we'll name the mind the second constellation, which belongs to the Tishri Heaven and is surnamed Kālāyana.",
        "source": "T13n0397_041:0275b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心有三星形如大麥，一日一夜行十五時，屬心星者以粳米粥而用祭之。",
        "translation": "When there are three stars in his heart shaped like barley, he travels fifteen hours a day and night, and those who belong to the star in his heart offer rice gruel as sacrifice.",
        "source": "T13n0397_041:0275b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置尾為第三宿，屬獵師天，姓迦遮耶尼。",
        "translation": "\"'Next, he places the tail as the third constellation, which belongs to the Hunter Celestial and is surnamed Kātyāyanī.",
        "source": "T13n0397_041:0275b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尾有七星形如蝎尾，一日一夜行三十時，屬尾星者以諸果根作食祭之。",
        "translation": "Its tail has seven stars shaped like a scorpion's tail, and when it travels 30 hours a day and night, those who belong to the tail star make offerings of food made from the roots of fruits.",
        "source": "T13n0397_041:0275b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置箕為第四宿，屬於水天，姓特叉迦旃延尼。",
        "translation": "\"'Next, we'll name Pi the fourth constellation, which belongs to the Water Goddess and is surnamed Takṣa-Kātyāyanīputra.",
        "source": "T13n0397_041:0275b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "箕有四星形如牛角，一日一夜行三十時，屬箕宿者取尼拘陀皮汁祭之。",
        "translation": "It has four stars shaped like horns, and when it travels 30 hours a day and night, those belonging to the Minis take the juice of the skin of a nyagrodha and sacrifice it to them.",
        "source": "T13n0397_041:0275b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置斗為第五宿，屬於火天，姓摸伽邏尼。",
        "translation": "\"'Next, he places the fifth star in the Dipper, which belongs to the Fire God, and his family name is Moggalani.",
        "source": "T13n0397_041:0275b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斗有四星如人拓地，一日一夜行四十五時，屬斗宿者末粳米華和蜜祭之。",
        "translation": "When the Big Dipper has four stars like a man scaling the earth and travels 45 hours a day and night, those belonging to the Dipper constellation sacrifice millet, flowers, and honey to them.",
        "source": "T13n0397_041:0275b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置牛為第六宿，屬於梵天，姓梵嵐摩。",
        "translation": "\"'Next, we'll name the sixth star of the Bull constellation, which belongs to the Brahma Heaven and is surnamed Brahmā.",
        "source": "T13n0397_041:0275b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有三星形如牛頭，一日一夜行於六時，屬牛宿者以醍醐飯而用祭之。",
        "translation": "It has three stars shaped like the head of a bull and travels for six hours a day and night, and those belonging to the bull constellation sacrifice them with ghee and rice.",
        "source": "T13n0397_041:0275b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置女為第七宿，屬毘紐天，姓帝利迦遮耶尼。",
        "translation": "\"'Next, we'll name the woman the seventh constellation, which belongs to the Virūḍhaka Heaven and is surnamed Dṛgācāyani.",
        "source": "T13n0397_041:0275b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女有四星如大麥粒，一日一夜行三十時，屬女宿者以鳥肉祭之。",
        "translation": "She has four stars like grains of barley and travels 30 hours a day and night, and those who belong to the constellation Maiden sacrifice bird flesh to her.",
        "source": "T13n0397_041:0275b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右此七宿當於西門。",
        "translation": "These seven constellations on the right should be at the western gate.",
        "source": "T13n0397_041:0275b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次置北方第一之宿名為虛星，屬帝釋天，娑婆天子，姓憍陳如。",
        "translation": "\"'Next, we name the first constellation in the north Āśvakarṇa, which belongs to Tissa, the son of Śiva, and whose family name is Kauṇḍinya.",
        "source": "T13n0397_041:0275b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛有四星其形如烏，一日一夜行三十時，屬虛宿者煮烏豆汁而用祭之。",
        "translation": "The Āśvakas have four stars shaped like crows that travel 30 hours a day and night, and those who belong to the Āśvakas boil black soybean juice and offer it up for sacrifice.",
        "source": "T13n0397_041:0275b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置危為第二宿，屬多羅拏天，姓單那尼。",
        "translation": "\"'Next, we'll name Peril the second constellation, which belongs to the god Tarana and is surnamed Tānaṇī.",
        "source": "T13n0397_041:0275c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "危有一星如婦人黶，一日一夜行十五時，屬危宿者以粳米粥而用祭之。",
        "translation": "When there's a star on that peril that looks like a woman's hair, it travels 15 hours a day and night, and those who belong to the perilous constellation offer rice gruel as a sacrifice.",
        "source": "T13n0397_041:0275c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置室為第三宿，屬蛇頭天，蝎天之子，姓闍都迦尼拘。",
        "translation": "\"'Next, we'll name Muro the third constellation, which belongs to the Serpenthead Heaven and is the son of the Scorpion Heaven, surnamed Jātūghanīputra.",
        "source": "T13n0397_041:0275c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "室有二星形如脚跡，一日一夜行三十時，屬室星者肉血祭之。",
        "translation": "The chamber has two stars shaped like footprints that travel for 30 hours a day and night, and those who belong to the chamber star have their flesh and blood sacrificed to them.",
        "source": "T13n0397_041:0275c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置辟為第四宿，辟屬林天，婆婁那子，姓陀難闍。",
        "translation": "\"'Next, he places Vipa as the fourth constellation, which belongs to the Forest Sky, the son of Varuṇa, and his surname is Dhananjara.",
        "source": "T13n0397_041:0275c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辟有二星形如脚跡，行一日一夜四十五時，屬辟星者以肉祭之。",
        "translation": "Pārśva has two stars shaped like footprints that travel for 45 hours a day and night, and those who belong to Pārśva sacrifice their flesh to them.",
        "source": "T13n0397_041:0275c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置奎為第五宿，屬富沙天，姓阿虱吒排尼。",
        "translation": "\"'Next, we'll name Kui the fifth constellation, which belongs to the Pusa Heaven and is surnamed Aṣṭapāṇi.",
        "source": "T13n0397_041:0275c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奎有一星如婦女黶，一日一夜行三十時，屬奎宿者以酪祭之。",
        "translation": "When there's a star in Kui that looks like a woman's hair and travels 30 hours a day and night, those who belong to Kui sacrifice cheese to it.",
        "source": "T13n0397_041:0275c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復置婁為第六宿，屬乾闥婆天，姓阿舍婆。",
        "translation": "\"'Next, he places Rū as the sixth constellation belonging to the Ganymede Heaven, surnamed Āśva.",
        "source": "T13n0397_041:0275c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婁有三星形如馬頭，一日一夜行三十時，屬婁星者以大麥飯并肉祭之。",
        "translation": "When there are three stars in Uru shaped like a horse's head that travel for 30 hours a day and night, those who belong to Uru sacrifice barley and rice and meat to them.",
        "source": "T13n0397_041:0275c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『次復，置胃為第七宿，屬閻摩羅天，姓跋伽毘。",
        "translation": "\"'Furthermore, he places the stomach as the seventh constellation, which belongs to the Yamaṇa Heaven and is surnamed Bhagavān.",
        "source": "T13n0397_041:0275c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "胃有三星形如鼎足，一日一夜行三十時，屬胃宿者粳米烏麻及以野棗而用祭之。",
        "translation": "It has three stars shaped like tripods and travels 30 hours a day and night, and those who belong to the stomach constellation sacrifice rice, black flax, and wild jujubes to it.",
        "source": "T13n0397_041:0275c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右此七宿當於北門。",
        "translation": "These seven constellations on the right should be at the northern gate.",
        "source": "T13n0397_041:0275c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『二十八宿有五宿行四十五時，所謂畢、參、氐、斗、辟等。』",
        "translation": "\"'The twenty-eight constellations have five constellations that travel for forty-five hours, which are called Pi, Sen, Dou, and Pei.'",
        "source": "T13n0397_041:0275c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八宿言義廣多，難曉深趣不可具宣，我今略說。」",
        "translation": "The meaning of the twenty-eight constellations is so vast and detailed that it's difficult to understand their profundity or to explain them in detail, so I'll now explain them briefly.\"",
        "source": "T13n0397_041:0275c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是宿時，同聞諸天，皆悉歡喜。",
        "translation": "When he spoke about these constellations, the gods who heard it rejoiced.",
        "source": "T13n0397_041:0275c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大集經卷第四十一",
        "translation": "(Daji jing, vol. 41)",
        "source": "T13n0397_041:0275c23_5",
        "is_bad_quality": false
    }
]