[
    {
        "source_sentence": "大乘大集地藏十輪經卷第八",
        "translation": "Dasheng daji dizang shilun jing, vol. 8",
        "source": "T13n0411_008:0762a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T13n0411_008:0762a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善業道品第六之一",
        "translation": "The Sixth Chapter of the Path of Wholesome Activity, Part I",
        "source": "T13n0411_008:0762a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，金剛藏菩薩摩訶薩，復白佛言：「大德世尊！",
        "translation": "At that point, the Vajragarbha Bodhisattva Mahāsattva again said to the Buddha, \"Bhagavān!",
        "source": "T13n0411_008:0762a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，云何於聲聞乘得無誤失？",
        "translation": "How does a bodhisattva-mahāsattva attain freedom from error in the vehicle of the śrāvakas?",
        "source": "T13n0411_008:0762a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於聲聞乘補特伽羅得無誤失？",
        "translation": "\"How does the śrāvaka vehicle Potala attain freedom from error?",
        "source": "T13n0411_008:0762a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於獨覺乘得無誤失？",
        "translation": "How does the solitary realizer vehicle attain freedom from error?",
        "source": "T13n0411_008:0762a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於獨覺乘補特伽羅得無誤失？",
        "translation": "\"How does the solitary realizer vehicle pudgala attain freedom from error?",
        "source": "T13n0411_008:0762a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於大乘得無誤失？",
        "translation": "\"How can there be no error in the great vehicle?",
        "source": "T13n0411_008:0762a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於大乘補特伽羅得無誤失？",
        "translation": "How can there be no error or mistake in the great vehicle pudgala?",
        "source": "T13n0411_008:0762a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何常能熾然三寶種姓？",
        "translation": "\"How can the seed-nature of the Three Treasures always be blazed?",
        "source": "T13n0411_008:0762a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失？",
        "translation": "\"How do renunciant disciples of the Tathāgata, whether they are Dharma or non-Dharma vessels, down to those who wear a patchwork robe and shave their hair, attain freedom from error?",
        "source": "T13n0411_008:0762a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於大乘法，常得昇進，無有退轉？",
        "translation": "How can one always ascend and advance in the great vehicle teaching without ever turning back?",
        "source": "T13n0411_008:0762a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何利慧、勝福常得增長？",
        "translation": "How do the benefits of wisdom and superior merit always increase?",
        "source": "T13n0411_008:0762a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉？",
        "translation": "How do you quickly attain mastery over all concentrations, dhāraṇīs, and stages of forbearance, without ever turning back?",
        "source": "T13n0411_008:0762a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何常得值遇諸善知識，隨順而行？",
        "translation": "How can I always meet good teachers and follow them?",
        "source": "T13n0411_008:0762a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧？",
        "translation": "How do you always attain a view that's not separate from seeing all the buddhas, bodhisattvas, and śrāvaka disciples, that's not separate from hearing the Dharma, and that's not separate from becoming intimate with and making offerings to the saṃgha?",
        "source": "T13n0411_008:0762a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於諸善根常精進求，心無厭足？",
        "translation": "How do you always diligently pursue the good roots and not become satisfied with them?",
        "source": "T13n0411_008:0762a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何常於菩提種種行願，心無厭足？」",
        "translation": "How do you always conduct the various vows of enlightenment without having enough of them?\"",
        "source": "T13n0411_008:0762a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告金剛藏菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Vajragarbha Bodhisattva Mahāsattva, saying, \"Good sons!",
        "source": "T13n0411_008:0762a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有菩薩摩訶薩十輪，若菩薩摩訶薩成此十輪，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失；常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失；於大乘法，常得昇進，無有退轉；利慧、勝福、常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足；常於一切先所造作惡不善業，以聖金剛堅利法智，摧壞散滅，令無遺餘不受果報；更不造新惡不善業，心無厭倦，速能證得無上法輪。",
        "translation": "有菩薩摩訶薩十輪，若菩薩摩訶薩成此十輪，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失；常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失；於大乘法，常得昇進，無有退轉；利慧、勝福、常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足；常於一切先所造作惡不善業，以聖金剛堅利法智，摧壞散滅，令無遺餘不受果報；更不造新惡不善業，心無厭倦，速能證得無上法輪。",
        "source": "T13n0411_008:0762a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常勤修習七覺分寶，心無厭倦。",
        "translation": "He always diligently cultivates the seven treasures of awakening, and his mind isn't weary.",
        "source": "T13n0411_008:0762b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能除滅一切眾生諸煩惱病，心無厭倦；一切眾生依止存活。",
        "translation": "He's always able to remove the afflictive illnesses of all sentient beings, and he's not weary of it; all sentient beings rely on him for survival.",
        "source": "T13n0411_008:0762b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王具足七寶，凡所行動，輪寶導前、餘寶隨後，巡四大洲，普能除滅一切眾生身心濁穢，普能生長一切眾生身心安樂。",
        "translation": "Just as the wheel-turning king is fully endowed with the seven treasures, so whenever he acts, the wheel-treasure leads the way and the other treasures follow, touring the four continents, he's able to remove the physical and mental pollution from all sentient beings and generally produce physical and mental well-being in all sentient beings.",
        "source": "T13n0411_008:0762b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，於聲聞乘得無誤失，廣說乃至一切眾生依止存活。",
        "translation": "In the same way, the bodhisattva Mahāsattva accomplishes the ten wheels, attains the vehicle of the śrāvakas without error, and explains it in detail up to the point where all sentient beings rely on it for their survival.",
        "source": "T13n0411_008:0762b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大車輅具足四輪，多人乘之遊行大路，於其路上，土塊、瓦礫、草木、根莖、枝葉、華果、為輪所輾，皆悉摧壞不任受用。",
        "translation": "Like a large chariot with four wheels, many people ride it down a great road, and on its path, clods of earth, rubble, grass, trees, roots, branches, leaves, flowers, and fruits that are ground down by the wheels are all destroyed and won't be taken advantage of.",
        "source": "T13n0411_008:0762b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，悉能摧壞諸煩惱障、諸有情障、一切法障，令不受報。",
        "translation": "In the same way, the bodhisattva Mahāsattva accomplishes the ten wheels, which are capable of destroying the afflictive hindrances, the hindrances of sentient beings, and all the Dharma hindrances, so that they don't experience retribution.",
        "source": "T13n0411_008:0762b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如利劍輪，纔一投掣，能斬怨敵首及支節，令無勢用。",
        "translation": "Like a sharp sword wheel, it can cut off the head and limbs of an enemy with a single stroke, rendering them useless.",
        "source": "T13n0411_008:0762b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，能破一切，五趣牢獄，生死大苦，永斷一切煩惱、惡業，令不受報。",
        "translation": "In the same way, the bodhisattva Mahāsattva accomplishes the ten wheels, which are able to break through all the prisons of the five destinies and the great suffering of birth-and-death, and permanently end all afflictions and bad actions so that they don't have consequences.",
        "source": "T13n0411_008:0762b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如火災起，五日出時，遍四大洲一切河海水界津潤，無不枯竭。",
        "translation": "When a fire starts and rises for five days, the water in all the rivers and seas on the four continents is moistened, and nothing is left unconsumed.",
        "source": "T13n0411_008:0762b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，一切四因諸煩惱障、諸有情障、一切法障苦報根本，悉皆枯竭。",
        "translation": "In the same way, when the bodhisattva Mahāsattva completes the ten wheels, all four causes, the afflictive hindrances, the hindrances of sentient beings, and the root of the painful effects of all the Dharma hindrances are all dried up.",
        "source": "T13n0411_008:0762b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如風災起，四方猛風俱時頓發，一切世界大小諸山及諸大地，悉皆散滅。",
        "translation": "When a windstorm arises, a fierce wind suddenly arises in all directions, and all the world's large and small mountains and large lands all disintegrate.",
        "source": "T13n0411_008:0762c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，世間四倒、憍慢諸山，無不崩壞，一切眾生諸煩惱障、諸有情障、一切法障苦報根本，悉皆散滅。",
        "translation": "Similarly, when the bodhisattva Mahāsattva completes the ten wheels, the four errors and mountains of worldly conceit don't fail to crumble, and the afflictive hindrances of all sentient beings, the hindrances of sentient beings, and the root of the painful effects of all the Dharma hindrances all disintegrate.",
        "source": "T13n0411_008:0762c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如師子王吼聲一發，一切禽獸悉皆驚怖，飛落、走伏，無敢輒動。",
        "translation": "\"When the lion king roars, all the animals are terrified, fly off, and go into submission, not daring to move easily.",
        "source": "T13n0411_008:0762c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，法音一震，乃至一切外道、異學、惡知識等，悉皆驚怖，忘失言辯，無敢酬抗。",
        "translation": "So it is with the bodhisattva Mahāsattva, who accomplishes the ten wheels and shakes the Dharma sound, so much so that all the non-Buddhists, heretics, and bad teachers are terrified, forget their words, and don't dare to respond.",
        "source": "T13n0411_008:0762c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如天帝釋與阿素洛將欲戰時，天軍圍遶，手執金剛奔趣陣敵，諸阿素洛驚怖退散。",
        "translation": "When Indra and Asura are about to fight, they're surrounded by an army of gods who run toward their opponents with vajras in their hands, and the Asuras are terrified and scatter.",
        "source": "T13n0411_008:0762c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，一切倒見外道、異學、惡知識等，驚怖退散。",
        "translation": "Similarly, the bodhisattva Mahāsattva accomplishes the ten elements, and all wrong-headed non-Buddhists, heretics, and bad teachers are frightened and scattered.",
        "source": "T13n0411_008:0762c13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如如意珠置高幢上，能雨種種上妙珍寶，給施一切貧乏眾生。",
        "translation": "\"Like a wish-granting pearl placed on a high banner, it rains down a variety of wonderful treasures to bestow on all poor sentient beings.",
        "source": "T13n0411_008:0762c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，處淨戒幢，雨大法雨，給施一切無量眾生。",
        "translation": "So too, the bodhisattva Mahāsattva accomplishes the ten elements, places a banner of pure precepts, and rains down a great dharma rain to bestow on all sentient beings without measure.",
        "source": "T13n0411_008:0762c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如闇夜分，世間幽冥都無所見，迷失正道；滿月出已諸闇皆除，諸失道者皆見正路。",
        "translation": "\"Like the part of the night when it's dark, the world is dark and nothing is seen, and they're lost on the right path; after the full moon rises, all darkness is removed, and those who have lost the path all see the right path.",
        "source": "T13n0411_008:0762c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，若諸眾生無明昏闇，由此迷失八支聖道，菩薩為其宣說正法，除無明闇生法光明，開示顯現八支聖道，令斷諸漏盡諸苦際。",
        "translation": "In the same way, the bodhisattva Mahāsattva has accomplished the ten wheels, and if sentient beings are ignorant and darkened, and thus lose sight of the eight noble paths, the bodhisattva teaches them the right Dharma, removes ignorance and darkness to produce Dharma light, reveals and manifests the eight noble paths, and causes the contaminants to end the limits of suffering.",
        "source": "T13n0411_008:0762c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0762c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大日殿出現世間，一切苗稼悉皆增長，一切花葉悉皆敷榮，一切臭穢悉皆除歇，諸穀果藥悉皆成熟，雪山銷流諸河充溢，漸次轉注滿於大海。",
        "translation": "When the Hall of the Great Sun appears in the world, all the crops grow, all the flowers and leaves flourish, all the smells are removed, all the grains, fruits, and medicines ripen, and the snow-capped mountains and rivers overflow and are gradually filled to the brim with the ocean.",
        "source": "T13n0411_008:0762c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，成就十輪，依止增上布施、調伏、寂靜、尸羅、安忍、正勤、靜慮、般若，方便、慈悲、辯才、功德皆悉熾盛，為諸眾生宣說正法，由法威光，令諸眾生種種增上善根苗稼，悉皆增長；種種增上妙行華葉，悉皆敷榮；種種煩惱、惡業、惡行、悉皆除歇；善趣涅槃諸穀果藥，悉皆成熟；邪見、慢山、悉皆銷流；種種正信、戒、聞、捨、慧及諸定河，無不充溢，漸次盈滿大涅槃海；令諸有情，隨意所樂，趣入無畏涅槃之城。",
        "translation": "菩薩摩訶薩亦復如是，成就十輪，依止增上布施、調伏、寂靜、尸羅、安忍、正勤、靜慮、般若，方便、慈悲、辯才、功德皆悉熾盛，為諸眾生宣說正法，由法威光，令諸眾生種種增上善根苗稼，悉皆增長；種種增上妙行華葉，悉皆敷榮；種種煩惱、惡業、惡行、悉皆除歇；善趣涅槃諸穀果藥，悉皆成熟；邪見、慢山、悉皆銷流；種種正信、戒、聞、捨、慧及諸定河，無不充溢，漸次盈滿大涅槃海；令諸有情，隨意所樂，趣入無畏涅槃之城。",
        "source": "T13n0411_008:0762c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0763a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名菩薩摩訶薩十輪？",
        "translation": "What are the ten wheels of the bodhisattva-mahāsattva?",
        "source": "T13n0411_008:0763a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0763a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此十輪者非餘法也，當知即是十善業道。",
        "translation": "\"These ten wheels are not other things, but should be known as the ten wholesome courses of action.",
        "source": "T13n0411_008:0763a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就如是十種輪故，得名菩薩摩訶薩也。",
        "translation": "Because he accomplishes these ten kinds of wheels, he's called a bodhisattva-mahāsattva.",
        "source": "T13n0411_008:0763a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切惡皆能解脫，一切善法隨意成就，速能盈滿大涅槃海。",
        "translation": "He's able to liberate from all evil, accomplishes all good qualities as he wishes, and quickly fills the great ocean of nirvāṇa.",
        "source": "T13n0411_008:0763a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以大善巧方便智光，成熟一切眾生之類，皆令獲得利益安樂。",
        "translation": "With the light of great skillful expedient wisdom, he matures all types of sentient beings, causing them all to attain benefit and well-being.",
        "source": "T13n0411_008:0763a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_008:0763a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0763a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去一切諸佛世尊，皆悉遠離十惡業道，皆悉稱揚讚歎如是十善業道所得果報。",
        "translation": "All the buddhas and world-honored ones of the past have always kept clear of the ten bad courses of action and have always praised and commended the results obtained from such ten good courses of action.",
        "source": "T13n0411_008:0763a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，若能於此所說十善業道，隨守護一，乃至命終究竟無犯，必獲一切殊勝果報如前後說。",
        "translation": "Therefore, if you can guard one of these ten good courses of action as they're described and guard it until the end of your life, when it's ultimately not transgressed, you'll surely attain all the excellent results as explained above and below.",
        "source": "T13n0411_008:0763a16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_008:0763a18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，遠離殺生，即是施與一切眾生，無驚無怖。",
        "translation": "If a bodhisattva-mahāsattva can end his or her life span and be free of taking life, this is a gift to all sentient beings that has no fear or panic.",
        "source": "T13n0411_008:0763a18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令諸眾生，不生憂苦，離毛竪畏。",
        "translation": "That causes sentient beings not to become sad and distressed, and they're free from hair-raising fears.",
        "source": "T13n0411_008:0763a20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots will quickly ripen.",
        "source": "T13n0411_008:0763a21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因殺生故，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸壽命障，自作、教他、見聞隨喜，由此遠離殺生輪故，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All the five destinies of past transmigration and the river of birth-and-death that result from killing life, the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, all the hindrances of the Dharma, and the hindrances of life, as well as the rewards of self-creation, teaching others, and seeing and hearing, are all destroyed without remainder because they're free of the wheel of killing life, and they don't experience the results.",
        "source": "T13n0411_008:0763a21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人天等，皆共親愛。",
        "translation": "In the present body, all humans and gods are loved together.",
        "source": "T13n0411_008:0763a25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有猜慮，身心安樂，壽命長遠。",
        "translation": "Without apprehension, they are comfortable in body and mind and have a long life.",
        "source": "T13n0411_008:0763a26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When they reach the end of their lives, they won't be saddened by grief and suffering in body and mind, and they'll be surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0763a27_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of Māra King, but only agreeable people who are well-adjusted, well-maintained, wealthy in virtue, truly blessed, and good teachers, who are joyous in body and spirit and engender deep respect and faith.",
        "source": "T13n0411_008:0763a28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處無病長壽，端正聰明，安隱快樂。",
        "translation": "After his life ends, he's returned to life, his faculties are perfected, his limbs and body are complete, and wherever he's born, he has no illness and a long life, is correct and intelligent, and is peaceful and happy.",
        "source": "T13n0411_008:0763b01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They also meet a good teacher who's well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0763b03_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離殺生法，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Depending on them, they'll cultivate the state of freedom from killing, be able to end all bad and unskillful qualities, achieve all excellent good qualities, pursue all the teachings of the great vehicle, cultivate all the vows of the bodhisattvas, and gradually enter the ocean of deep and wide wisdom, until they realize unsurpassed bodhi.",
        "source": "T13n0411_008:0763b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土離諸兵器，無有怨害鬪戰之名，絕諸怖畏，安隱快樂，一切無病長壽有情來生其國。",
        "translation": "The buddha land where he lives is free of weapons, has no reputation for animosity or fighting, is free of fear, and is peaceful and happy, and all sentient beings without illness or longevity come to live in that land.",
        "source": "T13n0411_008:0763b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自壽無量無邊，為諸有情如應說法。",
        "translation": "The Tathāgata's own life span is limitless and unlimited, and he teaches the Dharma as it should be taught to sentient beings.",
        "source": "T13n0411_008:0763b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後正法久住，利益、安樂無量有情。",
        "translation": "After parinirvāṇa, the right teaching will long endure, benefiting and bringing comfort to measureless sentient beings.",
        "source": "T13n0411_008:0763b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0763b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第一遠離殺生輪也。",
        "translation": "This is called the bodhisattva-mahāsattva's first escape from the wheel of killing beings.",
        "source": "T13n0411_008:0763b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失；常能熾然三寶種性；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle, freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle, freedom from error in the pratyekabuddha vehicle pudgala, freedom from error in the great vehicle pudgala, freedom from error in the great vehicle pudgala, the ability to always blaze the seed nature of the Three Treasures, and freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma vessels, down to those who wear the patchwork reddish-brown robe and shave their hair.",
        "source": "T13n0411_008:0763b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大乘法，常得昇進，無有退轉；利慧、勝福、常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "In the great vehicle teaching, he always rises and advances without turning back, always attains growth in the benefits and wisdom and in the excellent merits, quickly attains freedom in all concentrations, dhāraṇīs, and stages of forbearance without turning back, always meets good teachers and conducts himself accordingly, always attains the ability not to part from seeing all the buddhas, bodhisattvas, and śrāvaka disciples, not to part from hearing the Dharma, and not to part from making offerings to the saṃgha, always makes effort to pursue the good roots without tire, and always conducts himself in the various vows of enlightenment without tire.",
        "source": "T13n0411_008:0763b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣如前說。",
        "translation": "The rewards they attain are as explained in detail earlier.",
        "source": "T13n0411_008:0763b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_008:0763b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，離不與取，即是施與一切眾生，無驚無怖、無有熱惱亦無擾動。",
        "translation": "\"If a bodhisattva-mahāsattva can end his or her life span and part with the taking of what's not given, that's generosity given to all sentient beings without fear or panic, without anguish, and without agitation.",
        "source": "T13n0411_008:0763b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於自所得如法財利，喜足而住，終不希求非法財利。",
        "translation": "They abide contentedly in the Dharma-granted wealth and benefits that they have acquired for themselves, and they never seek unlawful wealth and benefits.",
        "source": "T13n0411_008:0763c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots quickly mature.",
        "source": "T13n0411_008:0763c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因不與取，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸財寶障，自作、教他、見聞隨喜，由此遠離不與取輪，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All the past transmigration through the five destinies and into the river of birth-and-death that resulted from not apprehending, which created the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, all the hindrances of the Dharma, and the hindrances of possessions, which they themselves created, taught others, and rejoiced in when they saw and heard, are thus removed from the wheel of not apprehending and destroyed without remainder, and they don't experience the results.",
        "source": "T13n0411_008:0763c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人、天等皆共親愛，無所猜慮，身心安樂，財寶具足。",
        "translation": "In their present bodies, they're loved by humans and gods alike, have no misgivings, are comfortable in body and mind, and are fully endowed with possessions.",
        "source": "T13n0411_008:0763c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When they reach the end of their lives, they won't be saddened by grief and suffering in body and mind, and they'll be surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0763c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of the Māra King, but only the agreeable accomplishment of good qualities, full precepts, abundant virtue, a field of true merit, and a good teacher who's joyous in body and spirit and who inspires deep respect and faith.",
        "source": "T13n0411_008:0763c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處具大財寶，端正聰明，安隱快樂，不與五家共諸財寶。",
        "translation": "When he returns to life after his life ends, he's reborn among humans with perfect faculties, complete with the limbs and bodies, endowed with great wealth and possessions wherever he's born, correct and intelligent, peaceful and happy, and doesn't share his wealth and possessions with the five families.",
        "source": "T13n0411_008:0763c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They also meet a good teacher who is well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0763c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離不與取，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Cultivating that seclusion from taking what's not given, they're able to end all bad and unskillful qualities, achieve all excellent good qualities, pursue all the teachings of the great vehicle, cultivate all the vows of the bodhisattva, and gradually enter the ocean of deep and wide wisdom, until they realize unsurpassed bodhi.",
        "source": "T13n0411_008:0763c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土眾寶莊嚴，寶樹、寶池、寶臺殿等，無不充備。",
        "translation": "The buddha land where he lives is adorned with many treasures, including jeweled trees, jeweled ponds, and jeweled terraces and halls, and there's nothing that isn't abundant.",
        "source": "T13n0411_008:0763c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離我、我所，無所攝受一切具足嚴飾有情來生其國。",
        "translation": "Free of self and what belongs to self, there's nothing to take in all sentient beings in full ornamentation to be born in that land.",
        "source": "T13n0411_008:0763c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自身壽命無量，為諸有情如應說法，般涅槃後正法久住，利益、安樂無量有情。",
        "translation": "The Tathāgata has a limitless life span, teaches the Dharma as it should be taught for sentient beings, and maintains the true teaching long after parinirvāṇa to benefit and bring comfort to measureless sentient beings.",
        "source": "T13n0411_008:0763c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0763c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第二遠離不與取輪。",
        "translation": "This is called the second turning of the wheel of the bodhisattva-mahāsattva's freedom from attachment and non-acquisition.",
        "source": "T13n0411_008:0763c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle.",
        "source": "T13n0411_008:0763c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於聲聞乘補特伽羅，得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失；常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失。",
        "translation": "He attains freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle pudgala, freedom from error in the pratyekabuddha vehicle pudgala, freedom from error in the great vehicle pudgala, freedom from error in the great vehicle pudgala, always being able to blaze the seed lineage of the Three Treasures, and freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma followers, down to those who shave their hair and wear a patch of robes.",
        "source": "T13n0411_008:0763c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大乘法常得昇進，無有退轉；利慧、勝福常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "They can always advance in the great vehicle teaching without turning back, always increase in the benefits and wisdom and superior merits, quickly attain mastery over all meditations, dhāraṇīs, and stages of forbearance without turning back, always meet good teachers and conduct themselves accordingly, always attain a view of all buddhas, bodhisattvas, and śrāvaka disciples, never part from hearing the Dharma, and never part from making offerings to the saṃgha, always pursue the good roots with energy and without tire, and always conduct the various vows of enlightenment with energy and without tire.",
        "source": "T13n0411_008:0764a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣說如前。",
        "translation": "The rewards they attain are explained in detail as before.",
        "source": "T13n0411_008:0764a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_008:0764a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，離欲邪行，即是施與欲流所漂一切眾生，無驚、無怖、無嫉、無害，無有熱惱亦無擾動。",
        "translation": "If a bodhisattva-mahāsattva can end his or her life and part with wrong sexual behavior, that's when he or she gives to all sentient beings adrift in the current of desire, without fear, without jealousy, without harm, without anguish, and without agitation.",
        "source": "T13n0411_008:0764a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於己妻室喜足而住，終不希求非法色欲。",
        "translation": "They live contentedly in their wives' homes and never seek illicit forms or desires.",
        "source": "T13n0411_008:0764a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots quickly mature.",
        "source": "T13n0411_008:0764a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因欲邪行，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸室家障，自作、教他、見聞隨喜，由此遠離欲邪行輪，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All those who have been reborn in the five destinies and have fallen into the river of birth-and-death in the past, who have created the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, the hindrances of all things Dharma, and the hindrances of their homes, and who have created for themselves, taught others, and delighted in what they've seen and heard, are thus freed from the wheel of desire and wrong actions, which all break down and destroy without remainder and don't receive the results.",
        "source": "T13n0411_008:0764a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人天等皆共親愛，無所猜慮，身心安樂，妻室貞良。",
        "translation": "In their present lives, they're loved by humans and gods alike, have no misgivings, are physically and mentally comfortable, and have good wives and homes.",
        "source": "T13n0411_008:0764a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When they reach the end of their lives, they won't be saddened by grief and suffering in body and mind, and they'll be surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0764a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of the Māra King, but only the agreeable accomplishment of good qualities, full precepts, abundant virtue, a field of true merit, and a good teacher who's joyous in body and spirit and who inspires deep respect and faith.",
        "source": "T13n0411_008:0764a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處具諸眷屬，端正聰明，安隱快樂。",
        "translation": "After his life ends, he's returned to life, replete with the faculties, complete with limbs and bodies, with retinues in his place of birth, correct and intelligent, and peaceful and happy.",
        "source": "T13n0411_008:0764a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They also meet a good teacher who's well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0764a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離欲邪行，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Depending on them, they'll cultivate mistaken behavior free of desire, be able to end all bad and unskillful qualities, achieve all excellent good qualities, pursue all the teachings of the great vehicle, cultivate all the vows of the bodhisattvas, and gradually enter the ocean of deep and wide wisdom, until they realize unsurpassed enlightenment.",
        "source": "T13n0411_008:0764a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土無諸女人。",
        "translation": "In the Buddha land where he lives, there are no women.",
        "source": "T13n0411_008:0764b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離諸婬欲，具足第一梵行有情來生其國。",
        "translation": "Free of lust, they're perfected in the first religious practice, and sentient beings come to live in their country.",
        "source": "T13n0411_008:0764b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切有情，皆受化生，不處胞胎臭穢不淨。",
        "translation": "All sentient beings are born by transformation and don't live in a world that's smelly, dirty, and impure.",
        "source": "T13n0411_008:0764b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自身壽命無量，為諸有情如應說法。",
        "translation": "The Tathāgata has a limitless life span of his own, and he teaches the Dharma as it should be taught to all sentient beings.",
        "source": "T13n0411_008:0764b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後正法久住，利益、安樂無量有情。",
        "translation": "After parinirvāṇa, the right teaching will long endure, benefiting and bringing comfort to measureless sentient beings.",
        "source": "T13n0411_008:0764b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0764b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第三遠離欲邪行輪。",
        "translation": "This is called the third wheel of the bodhisattva-mahāsattva's freedom from the mistaken practice of desire.",
        "source": "T13n0411_008:0764b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle, freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle, freedom from error in the pratyekabuddha vehicle of the pratyekabuddhas, freedom from error in the great vehicle, and freedom from error in the pratyekabuddha vehicle of the great vehicle.",
        "source": "T13n0411_008:0764b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失。",
        "translation": "He's always able to blaze through the family of the Three Treasures, and he attains freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma vessels, down to those who wear a patchwork robe and shave their hair.",
        "source": "T13n0411_008:0764b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大乘法，常得昇進，無有退轉；利慧、勝福常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "In the great vehicle teaching, he always ascends and advances without turning back, always attains growth in sharp wisdom and excellent fortune, quickly attains mastery over all meditations, dhāraṇīs, and stages of forbearance without turning back, always meets good teachers and conducts himself accordingly, always attains a vision of all buddhas, bodhisattvas, and śrāvaka disciples, doesn't stop hearing the Dharma, and doesn't stop getting close to and making offerings to the saṃgha, always strives intently for the good roots without tire, and always conducts himself in the various vows of enlightenment without tire.",
        "source": "T13n0411_008:0764b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣說如前。",
        "translation": "The rewards they attain are explained in detail as before.",
        "source": "T13n0411_008:0764b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_008:0764b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，離虛誑語，一切眾生常共愛敬，所出言詞皆誠諦量，聞悉敬奉無所猜疑。",
        "translation": "If a bodhisattva-mahāsattva can end his or her life span and part with false speech, all sentient beings will always love and respect him or her, and the words they utter will be honest and well-considered, and those who hear them will respect them and have no doubts about them.",
        "source": "T13n0411_008:0764b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots quickly ripen.",
        "source": "T13n0411_008:0764b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因虛誑語，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸信言障，自作、教他、見聞隨喜，由此遠離虛誑語輪，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All those who have been reborn in the five destinies and have fallen into the river of birth-and-death in the past, who have created the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, all the hindrances of the Dharma, and the hindrances of faithful speech because of false speech, and who themselves create, teach, teach, and delight in what they see and hear, are thus freed from the false wheel of speech, which all breaks down and destroys without remainder and doesn't bring results.",
        "source": "T13n0411_008:0764b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人天等皆共親愛，無所猜慮，身心安樂，所出言詞他皆信奉。",
        "translation": "In the present body, they're all loved by humans and gods alike, have no misgivings, are comfortable in body and mind, and believe in the words they speak.",
        "source": "T13n0411_008:0764b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When they reach the end of their lives, their body and mind aren't stifled by grief and suffering, and they're surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0764b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of Māra King Hāra; he only sees the agreeable accomplishment of good qualities, full precepts, abundant virtue, and a true field of merit, and a good teacher who's joyous in body and spirit and who inspires deep respect and faith.",
        "source": "T13n0411_008:0764c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處所言誠諦，端正聰明，安隱快樂。",
        "translation": "After his life ends, he's returned to life, his faculties are perfected, his limbs are complete, he speaks sincerely according to the place where he was born, he's correct and intelligent, and he's peaceful and happy.",
        "source": "T13n0411_008:0764c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They also meet a good teacher who's well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0764c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離虛誑語，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Depending on that person's cultivation and seclusion from false speech, he'll be able to end all bad and unskillful qualities, achieve all excellent good qualities, pursue all great vehicle teachings, cultivate all bodhisattva vows, and gradually enter the ocean of deep and wide wisdom, until he realizes unsurpassed enlightenment.",
        "source": "T13n0411_008:0764c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土一切真實，離諸虛偽；妙香潔物之所莊嚴。",
        "translation": "The buddha land in which he resides is completely genuine, free of falsity, and adorned by marvelously fragrant and pure things.",
        "source": "T13n0411_008:0764c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諂、無誑、心行正真、希求純淨善法有情來生其國，香潔妙服寶飾莊嚴。",
        "translation": "Those sentient beings who come to that land without deceit or trickery, whose minds are true and whose conduct is correct, and who pursue pure and good qualities are adorned with fine fragrances and jewelry.",
        "source": "T13n0411_008:0764c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自身壽命無量，為諸有情如應說法，般涅槃後正法久住，利益安樂無量有情。",
        "translation": "The Tathāgata has a limitless life span, teaches sentient beings as they should, maintains the right teaching long after parinirvāṇa, and benefits and pleases measureless sentient beings.",
        "source": "T13n0411_008:0764c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0764c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第四遠離虛誑語輪。",
        "translation": "This is called the fourth wheel of the bodhisattva-mahāsattva's freedom from false speech.",
        "source": "T13n0411_008:0764c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle, freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle, freedom from error in the pratyekabuddha vehicle of the pratyekabuddhas, freedom from error in the great vehicle, and freedom from error in the pratyekabuddha vehicle of the great vehicle.",
        "source": "T13n0411_008:0764c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失。",
        "translation": "He's always able to blaze through the family of the Three Treasures, and he attains freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma vessels, down to those who wear a patchwork robe and shave their hair.",
        "source": "T13n0411_008:0764c21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大乘法，常得昇進，無有退轉；利慧、勝福常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧。",
        "translation": "In the great vehicle teaching, he always rises and advances without turning back, always attains growth in sharp wisdom and excellent fortune, quickly attains freedom in all concentrations, dhāraṇīs, and stages of forbearance without turning back, always meets good teachers and conducts himself accordingly, and always attains the ability not to part from seeing all the buddhas, bodhisattvas, and śrāvaka disciples, not to part from hearing the teaching, and not to part from making intimate offerings to the saṃgha.",
        "source": "T13n0411_008:0764c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "He always diligently pursues the good roots without tire, and he always conducts himself in the various vows of enlightenment without tire.",
        "source": "T13n0411_008:0764c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣說如前。",
        "translation": "The rewards they attain are explained in detail as before.",
        "source": "T13n0411_008:0765a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_008:0765a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，離離間語，一切眾生常共愛敬，所發言詞皆令和順，聞悉敬奉無所猜疑。",
        "translation": "If a bodhisattva-mahāsattva can end his or her life span and part with indirect speech, all sentient beings will always love and respect him or her, and whatever words are spoken will be made agreeable, and those who hear them will respect them and have no doubts about them.",
        "source": "T13n0411_008:0765a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots quickly mature.",
        "source": "T13n0411_008:0765a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因離間語，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸和敬障，自作、教他、見聞隨喜，由此遠離離間語輪，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All those who have been reborn in the five destinies and submerged in the river of birth-and-death in the past, who have created the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, all the hindrances of the Dharma, and the hindrances of harmony and respect, who themselves create, teach, and delight in what they see and hear, are thus removed from the wheel of free speech, which destroys and annihilates them without remainder, and don't experience the results.",
        "source": "T13n0411_008:0765a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人天等皆共親愛，無所猜慮，身心安樂，所發言詞皆令和順。",
        "translation": "In their present bodies, they're loved by humans and gods alike, have no misgivings, are comfortable in body and mind, and make all their speech agreeable.",
        "source": "T13n0411_008:0765a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When they reach the end of their lives, they aren't saddened by grief and suffering in body and mind, and they're surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0765a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of Māra King, but only agreeable people who are well-adjusted, possess precepts, are rich in virtue, and are truly a field of merit, and who are good teachers; they rejoice with body and mind and deeply respect them.",
        "source": "T13n0411_008:0765a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處所言和順。",
        "translation": "After his life ends, he's returned to life, his faculties are perfected, his limbs are complete, and he speaks smoothly wherever he's born.",
        "source": "T13n0411_008:0765a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "端正聰明，安隱快樂。",
        "translation": "They're upright, intelligent, peaceful, and happy.",
        "source": "T13n0411_008:0765a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They also meet a good teacher who's well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0765a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離離間語，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Depending on him and cultivating seclusion, he'll be able to end all bad and unskillful qualities, achieve all excellent good qualities, pursue all the teachings of the great vehicle, cultivate all the vows of the bodhisattvas, and gradually enter the ocean of deep and wide wisdom, until he realizes unsurpassed enlightenment.",
        "source": "T13n0411_008:0765a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土一切堅密，難可破壞，諸美妙物之所莊嚴。",
        "translation": "The Buddha land in which he resides is all too resolute to be destroyed and is adorned by beautiful things.",
        "source": "T13n0411_008:0765a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違、無競、善和諍訟、希求淳質善法有情來生其國。",
        "translation": "Without disagreement or rivalry, they resolve disputes well and seek the birth of sentient beings who simply desire the good Dharma in their land.",
        "source": "T13n0411_008:0765a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常修和敬，聽聞正法。",
        "translation": "They always cultivate harmony and respect, and they hear the right teaching.",
        "source": "T13n0411_008:0765a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自身壽命無量，為諸有情如應說法。",
        "translation": "The Tathāgata's own life is limitless, and he teaches the Dharma as it should be taught to all sentient beings.",
        "source": "T13n0411_008:0765a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後正法久住，利益安樂無量有情。",
        "translation": "Long after parinirvāṇa, the right Dharma abides, benefiting and comforting measureless sentient beings.",
        "source": "T13n0411_008:0765a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0765a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第五遠離離間語輪。",
        "translation": "This is called the bodhisattva-mahāsattva's fifth wheel of free speech that's free from interruptions.",
        "source": "T13n0411_008:0765a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle, freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle, freedom from error in the pratyekabuddha vehicle of the pratyekabuddhas, freedom from error in the great vehicle, and freedom from error in the pratyekabuddha vehicle of the great vehicle.",
        "source": "T13n0411_008:0765a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失。",
        "translation": "He's always able to blaze through the family of the Three Treasures, and he attains freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma vessels, down to those who wear a patchwork robe and shave their hair.",
        "source": "T13n0411_008:0765b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大乘法，常得昇進，無有退轉；利慧、勝福常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "In the great vehicle teaching, he always rises and advances without turning back, always attains growth in sharp wisdom and excellent fortune, quickly attains freedom in all concentrations, dhāraṇīs, and stages of forbearance without turning back, always meets good teachers and conducts himself accordingly, always attains a vision of all buddhas, bodhisattvas, and śrāvaka disciples, doesn't stop hearing the Dharma, and doesn't stop getting close to and making offerings to the saṃgha, always makes effort to pursue the good roots without tire, and always conducts himself in the various vows of enlightenment without tire.",
        "source": "T13n0411_008:0765b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣說如前。",
        "translation": "The rewards they attain are explained in detail as before.",
        "source": "T13n0411_008:0765b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_008:0765b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，離麁惡語，一切眾生常共愛敬，所發語言皆令歡悅，聞悉敬奉無所猜疑。",
        "translation": "If a bodhisattva-mahāsattva can end his physical life and part with harsh speech, all sentient beings will always love and respect him, and the words he utters will make them rejoice, and they'll listen and respect him without doubting anything.",
        "source": "T13n0411_008:0765b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots quickly ripen.",
        "source": "T13n0411_008:0765b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因麁惡語，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸調善障，自作、教他、見聞隨喜，由此遠離麁惡語輪，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All those who in the past transmigrated through the five destinies and crossed the river of birth-and-death because of harsh speech created the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, all the hindrances of the Dharma, and the hindrances of adjustment of goodness, which they themselves created, taught others, and rejoiced in when they saw and heard, are thus freed from the wheel of harsh speech, which all break down and annihilate without remainder and don't receive the results.",
        "source": "T13n0411_008:0765b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人天等皆共親愛，無所猜慮，身心安樂，所出言詞皆令歡悅。",
        "translation": "In their present bodies, they're loved by humans and gods alike, have no misgivings, are comfortable in body and mind, and make happy with the words they speak.",
        "source": "T13n0411_008:0765b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When they reach the end of their lives, they aren't saddened by grief and suffering in body and mind, and they're surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0765b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of Māra King, but only agreeable people who are well-adjusted, possess precepts, are rich in virtue, are truly a field of merit, and are good teachers, rejoice with body and mind, and give rise to deep respect and faith.",
        "source": "T13n0411_008:0765b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處所言柔軟，端正聰明，安隱快樂。",
        "translation": "After his life ends, he's returned to life, his faculties are perfected, his body is complete, and he follows the places where he's born, speaking softly, being correct and intelligent, and being peaceful and happy.",
        "source": "T13n0411_008:0765b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They also meet a good teacher who's well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0765b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離麁惡語，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Depending on their cultivation, they'll be free of harsh speech, able to end all bad and unskillful qualities, achieve all excellent good qualities, pursue all great vehicle teachings, cultivate all bodhisattva vows, and gradually enter the ocean of deep and wide wisdom, until they realize unsurpassed bodhi.",
        "source": "T13n0411_008:0765b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土遠離一切不可意聲；種種上妙如意和雅諸意樂聲、結集法聲，充滿其土。",
        "translation": "The buddha land where he lives is free of all unattractive sounds, and it's filled with the various wonderful, wishful, harmonious sounds of intentions and the sounds of the assembled Dharma.",
        "source": "T13n0411_008:0765c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具足念慧梵音清徹調善有情來生其國，常以軟語更相勸進。",
        "translation": "Possessing the wisdom of mindfulness, the Brahmā's voice is clear and penetrating, and it encourages and encourages good sentient beings to come to his land with gentle words.",
        "source": "T13n0411_008:0765c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自身壽命無量，為諸有情如應說法。",
        "translation": "The Tathāgata's own life span is limitless, and he teaches the Dharma as it should be taught to sentient beings.",
        "source": "T13n0411_008:0765c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後正法久住，利益安樂無量有情。",
        "translation": "Long after parinirvāṇa, the right teaching abides, benefiting and comforting measureless sentient beings.",
        "source": "T13n0411_008:0765c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0765c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第六遠離麁惡語輪。",
        "translation": "This is called the sixth wheel of the bodhisattva-mahāsattva's freedom from harsh speech.",
        "source": "T13n0411_008:0765c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle, freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle, freedom from error in the pratyekabuddha vehicle of the pratyekabuddhas, freedom from error in the great vehicle, and freedom from error in the pratyekabuddha vehicle of the great vehicle.",
        "source": "T13n0411_008:0765c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失。",
        "translation": "He's always able to blaze through the family of the Three Treasures, and he attains freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma vessels, down to those who wear a patchwork robe and shave their hair.",
        "source": "T13n0411_008:0765c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大乘法，常得昇進，無有退轉；利慧、勝福、常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "In the great vehicle teaching, he always rises and advances without turning back, always attains growth in the benefits and wisdom and in the excellent merits, quickly attains freedom in all concentrations, dhāraṇīs, and stages of forbearance without turning back, always meets good teachers and conducts himself accordingly, always attains the ability not to part from seeing all buddhas, bodhisattvas, and śrāvaka disciples, not to part from hearing the Dharma, and not to part from making offerings to the saṃgha, always makes effort to pursue the good roots without tire, and always conducts himself in the various vows of enlightenment without tire.",
        "source": "T13n0411_008:0765c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣說如前。",
        "translation": "The rewards they attain are explained in detail as before.",
        "source": "T13n0411_008:0765c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_008:0765c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，離雜穢語，一切眾生常共愛敬，所發言詞皆有義利，聞悉敬奉無所猜疑。",
        "translation": "If a bodhisattva-mahāsattva can end his physical life and part with impure speech, all sentient beings will always love and respect him, and the words he speaks will have meaning, and those who hear them will respect and have no doubts about them.",
        "source": "T13n0411_008:0765c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots quickly ripen.",
        "source": "T13n0411_008:0765c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因雜穢語，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸義利障，自作、教他、見聞隨喜，由此遠離雜穢語輪，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All those who have been reborn in the five destinies and plunged into the river of birth-and-death in the past, who have created the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, the hindrances of all dharmas, and the hindrances of benefit, who themselves create, teach, and delight in what they see and hear, are thus freed from the wheel of impure speech, which all breaks down and destroys without remainder, and don't experience the results.",
        "source": "T13n0411_008:0765c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人天等皆共親愛，無所猜慮，身心安樂，所發言詞皆成義利。",
        "translation": "In their present bodies, they're loved by humans and gods alike, have no misgivings, are comfortable in body and mind, and their speech is purposeful.",
        "source": "T13n0411_008:0766a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When they reach the end of their lives, their body and mind aren't stifled by grief and suffering, and they're surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0766a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of Māra King Hāra; instead, he sees the agreeable, well-adjusted, well-maintained precepts, abundant virtue, a field of true merit, and a good teacher who is joyous in body and spirit and inspires deep respect and faith.",
        "source": "T13n0411_008:0766a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處言必饒益，端正聰明，安隱快樂。",
        "translation": "After his life ends, he's returned to life, his faculties are perfected, his limbs are complete, and wherever he's born, he's said to be beneficial, correct, intelligent, and peaceful and happy.",
        "source": "T13n0411_008:0766a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They'll also meet a good teacher who's well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0766a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離雜穢語，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Depending on their cultivation and seclusion from impure speech, they'll be able to end all bad and unskillful qualities, achieve all excellent good qualities, pursue all the teachings of the great vehicle, cultivate all the vows of the bodhisattvas, and gradually enter the ocean of deep and wide wisdom, until they realize unsurpassed enlightenment.",
        "source": "T13n0411_008:0766a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土遠離一切無義利聲；種種上妙菩薩藏攝大法音聲周遍國土。",
        "translation": "The Buddha land in which he resides is free of all meaningless sounds, and the sounds of the great Dharma collected in the various wonderful bodhisattva stores pervade the land.",
        "source": "T13n0411_008:0766a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就無邊大願、妙智、能善辯說種種法義，如是有情來生其國。",
        "translation": "He accomplishes the limitless great vows, sublime wisdom, and the ability to skillfully explain the various meanings of the Dharma, so that sentient beings may come to live in his land.",
        "source": "T13n0411_008:0766a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自身壽命無量，為諸有情如應說法。",
        "translation": "The Tathāgata's own life span is limitless, and he teaches the Dharma as it should be taught for sentient beings.",
        "source": "T13n0411_008:0766a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後正法久住，利益安樂無量有情。",
        "translation": "Long after parinirvāṇa, the right teaching remains, benefiting and comforting measureless sentient beings.",
        "source": "T13n0411_008:0766a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0766a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第七遠離雜穢語輪。",
        "translation": "This is called the seventh wheel of the bodhisattva-mahāsattva's freedom from defiled speech.",
        "source": "T13n0411_008:0766a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle, freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle, freedom from error in the pratyekabuddha vehicle of the pratyekabuddhas, freedom from error in the great vehicle, and freedom from error in the pratyekabuddha vehicle of the great vehicle.",
        "source": "T13n0411_008:0766a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失；於大乘法，常得昇進，無有退轉；利慧、勝福、常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "They can always blaze through the family of the Three Treasures; attain freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma followers, down to those who shave their hair and wear a patchwork reddish robe; always ascend and advance in the great vehicle teaching without turning back; always increase in the benefits and wisdom and superior merits; quickly attain freedom from turning back in all concentrations, dhāraṇīs, and stages of forbearance; always meet good teachers and follow them; always attain the ability not to part from seeing all the buddhas, bodhisattvas, and śrāvaka disciples, not to part from hearing the Dharma, and not to part from making offerings to the saṃgha; always pursue the good roots with energy and without tire; and always conduct the various vows of enlightenment without tire.",
        "source": "T13n0411_008:0766a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣說如前。",
        "translation": "The rewards they attain are explained in detail as before.",
        "source": "T13n0411_008:0766b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_008:0766b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，能盡形壽，遠離貪欲，一切眾生常所愛重，其心清淨，離諸染濁。",
        "translation": "\"If a bodhisattva-mahāsattva can end his or her life span, become free of desire, which is always valued by all sentient beings, his or her mind is pure, and he or she is free of defilements.",
        "source": "T13n0411_008:0766b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此，善根速得成熟。",
        "translation": "As a result, their good roots quickly ripen.",
        "source": "T13n0411_008:0766b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有前際輪轉五趣沒生死河，因貪欲故，造身語意諸惡業障、諸煩惱障、諸有情障、一切法障、諸無貪障，自作、教他、見聞隨喜，由此遠離貪欲輪故，皆悉輾壞摧滅無餘，不受果報。",
        "translation": "All the previous transmigration through the five destinies and into the river of birth-and-death that resulted from desire, which created the hindrances of bad physical, verbal, and mental actions, the hindrances of affliction, the hindrances of sentient beings, all the hindrances of the Dharma, and the hindrances of lack of desire, created by themselves, taught others, and delighted in what they saw and heard, are all destroyed without remainder because they're free of the wheel of desire, and they don't experience the results.",
        "source": "T13n0411_008:0766b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現身中，諸人天等皆共親愛，無所猜慮，身心安樂，其心清淨離諸染濁。",
        "translation": "In their present bodies, they're loved by humans and gods alike, have no misgivings, and are comfortable in body and mind, and their minds are pure and free of defilements.",
        "source": "T13n0411_008:0766b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將命終時，身心不為憂苦逼切，所愛妻子眷屬圍遶。",
        "translation": "When their life is about to end, they aren't saddened by grief and suffering in body and mind, and they're surrounded by their beloved wives and retinues.",
        "source": "T13n0411_008:0766b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨命終時，不見可怖剡魔王使；唯見可意成調善法、具戒、富德、真實福田，為善知識；身心歡悅，深生敬信。",
        "translation": "When his life is about to end, he doesn't see the fearsome messengers of Māra King, but only the agreeable accomplishment of good qualities, full precepts, abundant virtue, a field of true merit, and a good teacher, who is joyous in body and spirit and inspires deep respect and faith.",
        "source": "T13n0411_008:0766b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既命終已還生人中，諸根圓滿支體具足，隨所生處，其心清淨，離諸染濁，端正聰明，安隱快樂。",
        "translation": "After his life ends, he's returned to life, his faculties are perfected, his limbs are complete, and wherever he's born, his mind is pure, freed from defilements, and he's upright, intelligent, peaceful, and happy.",
        "source": "T13n0411_008:0766b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復遇可意成調善法、具戒、富德、真實福田，為善知識。",
        "translation": "They also meet a good teacher who's well-adjusted, well-established in the ways of morality, rich in virtue, and a true field of merit.",
        "source": "T13n0411_008:0766b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼修學離貪欲法，能斷一切惡不善法，能成一切殊勝善法，能求一切大乘法義，能修一切菩薩願行，漸次趣入深廣智海，乃至證得無上菩提。",
        "translation": "Depending on him, he cultivates the state of freedom from desire, stops all bad and unskillful qualities, accomplishes all excellent good qualities, seeks all the meanings of the great vehicle dharma, cultivates all the bodhisattva vows, and gradually enters the ocean of deep and wide wisdom, until he realizes unsurpassed enlightenment.",
        "source": "T13n0411_008:0766b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居佛土地平如掌，眾寶充滿，種種寶樹行列莊嚴。",
        "translation": "The Buddha's land is as flat as the palm of his hand, filled with treasures, and adorned by a procession of various precious trees.",
        "source": "T13n0411_008:0766b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種寶衣、寶莊嚴具、寶幢幡蓋、金銀、真珠羅網等樹，處處皆有，甚可愛樂。",
        "translation": "There are trees everywhere that are filled with a variety of precious clothing, ornaments, banners, banners, banners, gold, silver, and real pearls, and so forth, which are very desirable.",
        "source": "T13n0411_008:0766b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離憍慢、顏貌端嚴、諸根無缺、其心平等，如是有情來生其國，無貪功德圓滿莊嚴。",
        "translation": "Free of pride, with a dignified appearance, unblemished faculties, and an equal mind, such sentient beings come to live in that country, adorned by the perfection of the merit of having no cravings.",
        "source": "T13n0411_008:0766b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自身壽命無量，為諸有情如應說法。",
        "translation": "The Tathāgata's own life span is limitless, and he teaches sentient beings as he should.",
        "source": "T13n0411_008:0766b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後正法久住，利益安樂無量有情。",
        "translation": "Long after parinirvāṇa, the right teaching abides, benefiting and comforting measureless sentient beings.",
        "source": "T13n0411_008:0766b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_008:0766c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩第八遠離貪欲輪也。",
        "translation": "This is called the eighth wheel of the bodhisattva-mahāsattva's freedom from desire.",
        "source": "T13n0411_008:0766c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩成就此輪故，於聲聞乘得無誤失；於聲聞乘補特伽羅得無誤失；於獨覺乘得無誤失；於獨覺乘補特伽羅得無誤失；於其大乘得無誤失；於其大乘補特伽羅得無誤失。",
        "translation": "\"Because the bodhisattva-mahāsattva accomplishes this wheel, he attains freedom from error in the śrāvaka vehicle, freedom from error in the śrāvaka vehicle pudgala, freedom from error in the pratyekabuddha vehicle, freedom from error in the pratyekabuddha vehicle of the pratyekabuddhas, freedom from error in the great vehicle, and freedom from error in the pratyekabuddha vehicle of the great vehicle.",
        "source": "T13n0411_008:0766c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能熾然三寶種姓；於諸如來出家弟子，若是法器、若非法器，下至一切被片袈裟剃鬚髮者，得無誤失。",
        "translation": "He's always able to blaze through the family of the Three Treasures, and he attains freedom from error for all the Tathāgata's renunciant disciples, whether they are Dharma or non-Dharma vessels, down to those who wear a patchwork robe and shave their hair.",
        "source": "T13n0411_008:0766c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大乘法，常得昇進，無有退轉；利慧、勝福常得增長；於一切定、諸陀羅尼、諸忍諸地，速得自在，無有退轉；常得值遇諸善知識，隨順而行；常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧；於諸善根常精進求，心無厭足；常於菩提種種行願，心無厭足。",
        "translation": "In the great vehicle teaching, he always rises and advances without turning back, always attains growth in sharp wisdom and excellent fortune, quickly attains freedom in all concentrations, dhāraṇīs, and stages of forbearance without turning back, always meets good teachers and conducts himself accordingly, always attains a vision of all buddhas, bodhisattvas, and śrāvaka disciples, doesn't stop hearing the Dharma, and doesn't stop getting close to and making offerings to the saṃgha, always makes effort to pursue the good roots without tire, and always conducts himself in the various vows of enlightenment without tire.",
        "source": "T13n0411_008:0766c09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得果報廣說如前。",
        "translation": "The rewards they attain are explained in detail as before.",
        "source": "T13n0411_008:0766c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘大集地藏十輪經卷第八",
        "translation": "Dasheng daji dizang shilun jing, vol. 8",
        "source": "T13n0411_008:0766c17_0",
        "is_bad_quality": false
    }
]