[
    {
        "source_sentence": "大乘大集地藏十輪經卷第六",
        "translation": "Dasheng daji dizang shilun jing, vol. 6",
        "source": "T13n0411_006:0751a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T13n0411_006:0751a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有依行品第四之二",
        "translation": "Fourth and Second Classes of Practicing with Reliance",
        "source": "T13n0411_006:0751a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0751a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝觀如是剎帝利等無量有情，親近如是破戒、惡行、非法器僧，退失一切所有善法，乃至當墮無間地獄。",
        "translation": "You've observed that countless sentient beings like these, such as those in Kārttiāli, have become close to such monks who break precepts, engage in bad behavior, and are not lawful servants, and have lost all their good qualities, so much so that they'll fall into an unremitting hell.",
        "source": "T13n0411_006:0751a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，欲得上妙生天涅槃樂者，皆應親近、承事供養勝道沙門，諮稟聽聞三乘要法；或求示道、命道沙門。",
        "translation": "Therefore, those who want to attain the happiness of the highest, most sublime birth in heaven or nirvāṇa should get close to and serve and support ascetics of the superior path, consult and present themselves to hear the essential teachings of the three vehicles, or seek ascetics who will show them the way or lead them to the path of life.",
        "source": "T13n0411_006:0751a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無如是三道沙門，當於污道沙門中求。",
        "translation": "If he doesn't have an ascetic of these three paths, he should seek one among the ascetics of the defiled path.",
        "source": "T13n0411_006:0751a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復戒壞而有正見，具足意樂及加行者，應往親近、承事供養、諮稟聽聞三乘要法。",
        "translation": "Those who have right view and are fully prepared and motivated to apply themselves even though their precepts have been broken should go and become intimate with, serve, support, present, and hear the essential teachings of the three vehicles.",
        "source": "T13n0411_006:0751a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應親近、承事供養加行意樂及見壞者。",
        "translation": "They shouldn't approach, serve, and support someone whose intentions, aspirations, and views are corrupted by applied practices.",
        "source": "T13n0411_006:0751b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼雖戒壞而無邪見，意樂、加行、見具足故。",
        "translation": "Although their precepts are broken, they don't have wrong views, and their aspirations, applied practices, and views are complete.",
        "source": "T13n0411_006:0751b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應詣其所，諮稟聽聞聲聞乘法、獨覺乘法及大乘法，不應輕毀。",
        "translation": "You should go to them, consult with them, and listen to the teachings of the śrāvaka vehicle, the pratyekabuddha vehicle, and the great vehicle, which you shouldn't disparage.",
        "source": "T13n0411_006:0751b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於三乘中，隨意所樂，發願精進隨學一乘，於所餘乘不應輕毀。",
        "translation": "Of the three vehicles, he should follow the desire, vow, and make effort to follow the study of one vehicle, and he shouldn't despise the others.",
        "source": "T13n0411_006:0751b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於三乘隨輕毀一下至一頌，不應親近、或與交遊、或共住止、或同事業。",
        "translation": "If he lightly disparages one verse or one verse of the three vehicles, he shouldn't become close to them, travel with them, live with them, or do business with them.",
        "source": "T13n0411_006:0751b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有親近、或與交遊、或共住止、或同事業，俱定當墮無間地獄。",
        "translation": "If they do become close to them, have social interactions, dwell together, or do cooperative actions, they'll surely fall into the hell of no-separation.",
        "source": "T13n0411_006:0751b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0751b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，若欲於三乘中隨依一乘，求出生死、欣樂安樂、厭危苦者，應於如來所說正法，或依聲聞乘所說正法，或依獨覺乘所說正法，或依大乘所說正法，普深信敬，勿生謗毀、障蔽、隱沒，下至一頌；常應恭敬、讀誦、聽聞，應發堅牢正願求證。",
        "translation": "Therefore, if someone wants to rely on one of the three vehicles to escape birth and death, rejoice in happiness and comfort, and become weary of suffering, they should deeply believe in and respect the right teaching taught by the Tathāgata, the right teaching taught by the śrāvaka vehicle, the right teaching taught by the pratyekabuddha vehicle, or the right teaching taught by the great vehicle, so as not to denigrate, obscure, or hide it down to a verse; they should always respect, recite, and listen to it, and they should make a firm and right vow to realize it.",
        "source": "T13n0411_006:0751b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謗毀三乘隨一法者，不應共住下至一宿，不應親近諮稟聽法。",
        "translation": "Those who denigrate the three vehicles and follow one teaching shouldn't live together down to the last night, and they shouldn't intimately consult or request to hear the teaching.",
        "source": "T13n0411_006:0751b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情，隨於三乘毀謗一乘，或復親近謗三乘人諮稟聽受，由此因緣，皆定當墮無間地獄，受大苦惱，難有出期。",
        "translation": "If sentient beings follow the three vehicles and denigrate the one vehicle, or if they even get close to someone who denigrates the three vehicles and consults, they'll surely fall into the hell of no-separation as a result, experience great suffering and distress, and have a difficult time escaping.",
        "source": "T13n0411_006:0751b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0411_006:0751b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_006:0751b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於過去修菩薩行，精勤求證無上智時，或為求請依聲聞乘所說正法，下至一頌，乃至棄捨自身手足、血肉、皮骨、頭目、髓腦。",
        "translation": "When I was cultivating the bodhisattva practice and diligently seeking to realize unsurpassed knowledge in the past, I might have sought to rely on the right teaching of the śrāvaka vehicle down to a verse, even to the point of discarding my own hands, feet, flesh, blood, skin, bones, head, eyes, and marrow.",
        "source": "T13n0411_006:0751b20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或為求請依獨覺乘所說正法，下至一頌，乃至棄捨自身手足、血肉、皮骨、頭目、髓腦。",
        "translation": "They might seek to rely on the right teaching given by the vehicle of the solitary realizers, down to a verse, and even abandon their hands, feet, flesh, skin, bones, head, eyes, and marrow.",
        "source": "T13n0411_006:0751b23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或為求請依於大乘所說正法，下至一頌，乃至棄捨自身手足、血肉、皮骨、頭目、髓腦。",
        "translation": "They might seek to rely on the right teaching of the great vehicle down to a verse, even to the point of abandoning their hands, feet, blood, flesh, skin, bones, head, eyes, and marrow.",
        "source": "T13n0411_006:0751b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勤苦，於三乘中，下至求得一頌法已，深生歡喜恭敬受持，如說修行時無暫廢。",
        "translation": "After such diligence and suffering, he goes down to seeking a verse of the teaching among the three vehicles, profoundly rejoices, respects, and upholds it, cultivating it as he's taught without lapse of time.",
        "source": "T13n0411_006:0751b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經無量劫，修行一切難行、苦行，乃證究竟無上智果。",
        "translation": "After enduring measureless eons of cultivating all the difficult and painful practices, he realized the ultimate fruit of unsurpassed knowledge.",
        "source": "T13n0411_006:0751b29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復為利益安樂有情，宣說開示三乘正法。",
        "translation": "Again, for the benefit and welfare of sentient beings, he proclaims and discloses the correct teaching of the three vehicles.",
        "source": "T13n0411_006:0751c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，不應謗毀、障蔽、隱沒，下至一頌；常應恭敬、讀誦、聽聞，應發堅牢正願求證「善男子！",
        "translation": "Because of this, you shouldn't denigrate, obscure, or conceal anything down to a single verse; you should always revere, recite, and listen to it, and you should make a firm and correct vow to realize it.",
        "source": "T13n0411_006:0751c02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三乘出要正法，一切過去、未來、現在過殑伽沙諸佛同說，大威神力共所護持，為欲拔濟一切有情生死大苦，為欲紹隆三寶種姓令不斷絕。",
        "translation": "\"Thus, these are the essential true teachings of the three vehicles, which were taught by all the buddhas of the past, future, and present that transcend the sands and are jointly upheld by their great authority and spiritual power, in order to rescue all sentient beings from the great suffering of birth and death and to promote the Three Treasures' lineage so that it won't be cut off.",
        "source": "T13n0411_006:0751c04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，於此三乘正法應普信敬，勿生謗毀、障蔽、隱沒；若有謗毀、障蔽、隱沒三乘正法下至一頌，決定當墮無間地獄。",
        "translation": "Therefore, you must universally believe in and revere the correct teaching of the three vehicles and not denigrate, obscure, or suppress it; if you denigrate, obscure, or suppress the correct teaching of the three vehicles down to the first verse, you'll surely fall into an unremitting hell.",
        "source": "T13n0411_006:0751c08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_006:0751c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世此佛土中，有剎帝利旃荼羅、婆羅門旃荼羅、宰官旃荼羅、居士旃荼羅、沙門旃荼羅、長者旃荼羅、茷舍旃荼羅、戍達羅旃荼羅，若男、若女，諂曲、愚癡、懷聰明慢；其性兇悖、懆厲、麁獷；不見、不畏後世苦果；好行殺生，乃至邪見、嫉妬、慳貪、憎背善友、親近惡友，非是三乘賢聖法器。",
        "translation": "In this Buddha land in the future, there will be a Kārttiari Candra, a Brāhmaṇa Candra, a Magistrate Candra, a Householder Candra, an ascetic Candra, an Elder Candra, a Householder Candra, and a śūdra Candra, whether male or female, who are flattering, deluded, and arrogant in their intelligence, whose nature is fierce, harsh, and crude, who don't see or fear the results of suffering in the afterlife, who like to kill, and who have wrong views, are jealous, are stingy, hate good friends, and are close to bad friends, and who aren't the three vehicles' worthy and noble Dharma vessels.",
        "source": "T13n0411_006:0751c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或少聽習聲聞乘法，便於諸佛共所護持獨覺乘法、無上乘法，誹謗、毀呰、障蔽、隱沒，不令流布。",
        "translation": "They may have little experience of the śrāvaka vehicle teaching and then denigrate, disparage, obscure, and hide the teachings of the solitary realizer vehicle and the unsurpassed vehicle taught by the common protectors of the buddhas, preventing their dissemination.",
        "source": "T13n0411_006:0751c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或少聽習獨覺乘法，便於諸佛共所護持聲聞乘法、無上乘法，誹謗、毀呰、障蔽、隱沒，不令流布。",
        "translation": "When they hear and study the solitary realizer vehicle teaching a little, they denigrate, disparage, obscure, and conceal the śrāvaka vehicle teaching and the unsurpassed vehicle teaching that are commonly upheld by the buddhas, and don't allow them to spread it.",
        "source": "T13n0411_006:0751c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或少聽習無上乘法，便於諸佛共所護持聲聞乘法、獨覺乘法，誹謗、毀呰、障蔽、隱沒，不令流布。",
        "translation": "Perhaps someone who has heard and practiced a little of the teachings of the unsurpassed vehicle will denigrate, disparage, obscure, and suppress the teachings of the śrāvaka vehicle and the pratyekabuddha vehicle that are upheld by the buddhas in common and won't allow them to be disseminated.",
        "source": "T13n0411_006:0751c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為求名利，唱如是言：『我是大乘，是大乘黨。",
        "translation": "Seeking fame and profit, they say, 'I am the great vehicle and I'm a member of the great vehicle party.",
        "source": "T13n0411_006:0751c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯樂聽習受持大乘，不樂聲聞、獨覺乘法，不樂親近學二乘人。』",
        "translation": "I only enjoy listening to, practicing, and upholding the great vehicle, not the teachings of the śrāvaka and pratyekabuddha vehicles, and I don't enjoy getting close to people who are training in the two vehicles.'",
        "source": "T13n0411_006:0751c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是詐稱大乘人等，由自愚癡憍慢勢力，如是謗毀、障蔽、隱沒三乘正法，不令流布；憎嫉修學三乘法人，誹謗毀辱令無威勢。",
        "translation": "Such people who falsely claim to be great vehicle practitioners are motivated by their own foolish pride to denigrate, obscure, and conceal the true teaching of the three vehicles and prevent its dissemination, and they hate people who train in the teachings of the three vehicles, denigrating and insulting them to make them lack authority.",
        "source": "T13n0411_006:0751c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0751c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切過去、未來、現在諸佛世尊，及諸菩薩摩訶薩，為欲利樂一切有情，以大悲力護持二事：一者、為欲紹隆三寶種姓常令不絕，捨俗出家，剃除鬚髮被服袈裟；二者、三乘出要四聖諦等相應正法。",
        "translation": "All the buddha-honored ones in the past, future, and present and all the bodhisattvas, mahāsattvas, and bodhisattvas wanting to bring benefit and joy to all sentient beings, they guard two things with the power of great compassion: first, in order to promote the family of the Three Treasures and make it permanent, they leave home, shave off their hair, and put on the reddish-brown robes; second, the correct teaching that corresponds to the four noble truths and so forth in the transcendent essentials of the three vehicles.",
        "source": "T13n0411_006:0752a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二事，唯佛世尊及大菩薩能善護持，非諸聲聞、獨勝覺等，亦非百千那庾多數大梵天王及天帝釋、王四大洲轉輪王等，所能護持。",
        "translation": "Only the Bhagavān and the great bodhisattvas can skillfully safeguard these two things, not śrāvakas or pratyekbuddhas, nor can they be safeguarded by a hundred thousand Nayutas, the great Brahma kings, Indra gods, or the wheel-turning kings of the king's four continents.",
        "source": "T13n0411_006:0752a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世此佛土中，有剎帝利旃荼羅王，見依我法而得出家剃除鬚髮被袈裟者，方便伺求所犯過失，以種種緣，呵罵、毀辱，或加鞭杖、或閉牢獄、或奪資具、或脫袈裟，廢令還俗，使作種種居家事業，或橫驅役、或濫擯遣、或斷飲食、或害身命。",
        "translation": "In this Buddha land in the future, there will be a Kārttika Caṇḍala King who sees someone who relies on my teaching and leaves home, shaves off their hair and puts on the reddish-brown robes, and then, for various reasons, ridicules and abuses them, sometimes scourges them, puts them behind bars, takes away their belongings, takes off their reddish-brown robes, abandons them, returns them to the secular world, causes them to do various household chores, sometimes harasses them, abusively expels them, cuts off their food and drink, and harms their bodies.",
        "source": "T13n0411_006:0752a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼剎帝利旃荼羅王，以己愚癡、憍慢、勢力，毀辱、謫罰諸佛菩薩以大悲力共所護持我諸弟子，誹謗、毀滅諸佛菩薩以大悲力共所護持我甚深法，於其三世諸佛菩薩共所護持三乘正法，障蔽、隱沒、不令流布。",
        "translation": "That Kārttikaṇḍala king, because of his foolishness, arrogance, and power, disparages and punishes my disciples, whom the buddhas and bodhisattvas jointly protect with the power of their great compassion, denigrates and disparages my profound teaching, which is jointly protected by the buddhas and bodhisattvas of the three times, and hinders, conceals, and prevents the dissemination of the correct teaching of the three vehicles.",
        "source": "T13n0411_006:0752a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有剎帝利旃荼羅王，乃至茷舍戍達羅等旃荼羅人，若男、若女，愚癡、憍慢，自號大乘。",
        "translation": "\"There are Kārttiari Caṇḍala kings and even many Śāśodharas and other Caṇḍalas, whether male or female, who are foolish and arrogant and who call themselves great vehicle.",
        "source": "T13n0411_006:0752a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人尚非聲聞、獨覺二乘法器，況是無上大乘法器！",
        "translation": "That person is not yet a Dharma vessel of the two vehicles of śrāvakas and pratyekbuddhas, so why would he be a Dharma vessel of the unsurpassed great vehicle?",
        "source": "T13n0411_006:0752a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為求利養、恭敬、名譽，誑惑世間愚癡雜類，自言我等是大乘人，謗毀如來二乘正法。",
        "translation": "Seeking profit, respect, and fame, they deceive the foolish sorts of the world, claiming to be great vehicle people and denigrating the Tathāgata's two-vehicle correct teaching.",
        "source": "T13n0411_006:0752a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是人等，愚癡、諂曲、憍慢、嫉妬、慳貪因緣，毀我法眼令速隱滅。",
        "translation": "Such people are foolish, flattering, arrogant, jealous, and stingy in their desire for the causes and conditions that disparage my vision of the Dharma and cause it to quickly disappear.",
        "source": "T13n0411_006:0752a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於三世一切諸佛犯大過罪；亦於三世一切菩薩犯大過罪；又於三世一切聲聞犯大過罪。",
        "translation": "They've committed a huge transgression against all the buddhas of the three times, a huge transgression against all the bodhisattvas of the three times, and a huge transgression against all the śrāvakas of the three times.",
        "source": "T13n0411_006:0752a25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不久便當支體廢缺，遭遇種種重惡疾病。",
        "translation": "Soon, their limbs will be wasted, and they'll experience various serious illnesses.",
        "source": "T13n0411_006:0752a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼剎帝利旃荼羅王，乃至茷舍戍達羅等旃荼羅人，若男、若女，由造惡業起倒見故，損斷一切所有善根。",
        "translation": "\"Whether it's a man or a woman, that Kārttiya Caṇḍala king or some of the Śāśodharas and other Caṇḍalas, as a result of creating bad karma and forming mistaken views, they'll be able to sap all their good roots.",
        "source": "T13n0411_006:0752a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復有時多修施福，於未來世，當生鬼趣、傍生趣中受富樂果，而彼身中，尚不能起色、無色界、下劣善根，況當能種聲聞、獨覺及無上乘無功用起一切智智善根種子！",
        "translation": "Even though there will be times when they often cultivate the virtues of giving and will be born in the future in the destinies of ghosts and animals and experience the fruit of prosperity, they still won't be able to produce the inferior good roots of the form and formless realms in their bodies, so why wouldn't they be able to plant the seeds of the good roots of knowledge of all things that arise from the effortlessness of the direct disciples, solitary realizers, and the unsurpassed vehicle?",
        "source": "T13n0411_006:0752b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又令其舌為病所害，於多日夜結舌不言，受諸苦毒痛切難忍，命終定當生於無間大地獄中。",
        "translation": "He also causes his tongue to become sick, to be tongue-tied for many days and nights without saying a word, to experience pain and suffering that's hard to bear, and to be certainly born in the great hell of unremitting hell when his life ends.",
        "source": "T13n0411_006:0752b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故，如來慈悲憐愍一切真善剎帝利王，乃至真善戍達羅等，若男、若女，令得長夜利益安樂，慇懃懇切作如是言：『汝等應當於歸我法剃除鬚髮被片袈裟出家人所，慎勿惱亂譏呵讁罰。",
        "translation": "\"Therefore, the Tathāgata has compassion and pity for all the truly good Śārdila Kings, even the truly good śūdra and others, whether male or female, so that they may attain benefit and happiness for a long time, and he earnestly and sincerely says, 'You must shave off your hair and put on a piece of the reddish-brown robe and leave home after you return to my teaching, so that you won't be disturbed, ridiculed, or punished.",
        "source": "T13n0411_006:0752b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我所說三乘正教，慎勿謗毀、障蔽、隱沒。",
        "translation": "Do not denigrate, obscure, or conceal the correct teaching of the three vehicles as I've taught it.",
        "source": "T13n0411_006:0752b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若違我言而故作者，所獲罪報如前廣說。』",
        "translation": "If you contradict my words and thus authorize it, the consequences of your actions will be as explained above.'",
        "source": "T13n0411_006:0752b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_006:0752b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此歸我法剃除鬚髮被赤袈裟出家形相，乃是過去、未來、現在諸佛菩薩大悲神力之所護持。",
        "translation": "\"This is a tribute to my teaching that shaving off one's hair and leaving home in a red robe is upheld by the great compassionate power of the buddhas and bodhisattvas of the past, future, and present.",
        "source": "T13n0411_006:0752b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此剃鬚髮被赤袈裟出家威儀，是諸賢聖解脫幢相；亦是一切聲聞乘人，受用解脫法味幢相；亦是一切獨覺乘人，受用解脫法味幢相；亦是一切大乘之人，受用解脫法味幢相。",
        "translation": "This shaving of the hair and leaving home in the red robe is a sign of liberation for the noble ones, a sign of the flavor of the Dharma of liberation for all those in the śrāvaka vehicle, a sign of the flavor of the Dharma of liberation for all those in the pratyekabuddha vehicle, and a sign of the flavor of the Dharma of liberation for all those in the great vehicle.",
        "source": "T13n0411_006:0752b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所說三乘正法，亦是三世諸佛菩薩大悲神力之所護持，是諸賢聖解脫依止；亦是一切聲聞乘人，受用解脫法味依止；亦是一切獨覺乘人，受用解脫法味依止；亦是一切大乘之人，受用解脫法味依止。",
        "translation": "The right Dharma of the three vehicles taught by the Tathāgata is also upheld by the great compassionate power of the buddhas and bodhisattvas of the three times, and it's a basis for the liberation of the noble ones, a basis for the flavor of the Dharma of liberation for all those in the śrāvaka vehicle, a basis for the flavor of the Dharma of liberation for all those in the pratyekabuddha vehicle, and a basis for the flavor of the Dharma of liberation for all those in the great vehicle.",
        "source": "T13n0411_006:0752b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0752b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故求解脫者，應當親近、恭敬、供養諸歸我法剃除鬚髮被赤袈裟出家之人，應先信敬聲聞乘法。",
        "translation": "Therefore, those who seek liberation should become intimate with, honor, and make offerings to those who renounce the Dharma, shave off their hair, put on the red robes, and leave home, and should first believe in and honor the śrāvaka vehicle teaching.",
        "source": "T13n0411_006:0752b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若自聽受教他聽受、若自讀誦教他讀誦、若自書寫教他書寫、若自施與教他施與、若自宣說教他宣說，思惟修行廣令流布。",
        "translation": "If you hear and accept it yourself, you should teach others to hear and accept it, if you recite it yourself, you should teach others to recite it, if you write it yourself, you should teach others to write it, if you give it yourself, you should teach others to give it, if you preach it yourself, you should teach others to preach it, and if you contemplate and practice it, you should spread it far and wide.",
        "source": "T13n0411_006:0752b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，信敬獨覺乘法，若自聽受教他聽受、若自讀誦教他讀誦、若自書寫教他書寫、若自施與教他施與、若自宣說教他宣說，思惟修行廣令流布。",
        "translation": "Thus, if someone believes and respects the teaching of the solitary realizer vehicle, if they hear and accept it themselves and teach others to hear and accept it, if they recite it themselves and teach others to recite it, if they write it themselves and teach others to write it, if they give it to themselves and teach others to give it, and if they preach it to themselves and teach others to preach it, they contemplate and cultivate it, making it spread far and wide.",
        "source": "T13n0411_006:0752c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，信敬於大乘法，若自聽受教他聽受、若自讀誦教他讀誦、若自書寫教他書寫、若自施與教他施與、若自宣說教他宣說。",
        "translation": "Thus, if you are faithful and respectful of the great vehicle teaching, then if you hear and accept it yourself, teach others to hear and accept it, if you recite it yourself, teach others to recite it, if you write it yourself, teach others to write it, if you give it yourself, teach others to give it, and if you expound it yourself, teach others to expound it.",
        "source": "T13n0411_006:0752c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟修行廣令流布。",
        "translation": "Contemplate and cultivate it, and then spread it broadly.",
        "source": "T13n0411_006:0752c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非器者，不應自聽、勿教他聽，乃至廣說，又應遠離一切惡法，應捨惡友、應親善友，應勤修習六到彼岸，應數懺悔一切惡業，應隨所宜勤發正願。",
        "translation": "If someone doesn't have the tools for it, they shouldn't listen to themselves or teach others to listen, and they should explain in detail that they should avoid all bad qualities, abandon bad friends and become close to good friends, diligently cultivate the six perfections, frequently repent of all bad actions, and diligently make the right vow as appropriate.",
        "source": "T13n0411_006:0752c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是斯有是處，現身得成聲聞乘器、或獨覺乘種子不退、或復大乘種子不退。",
        "translation": "If he can thus do this, there's a place where he'll become a vessel for the śrāvaka vehicle, a seed for the pratyekabuddha vehicle that doesn't regress, or a seed for the great vehicle that doesn't regress.",
        "source": "T13n0411_006:0752c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故三乘皆應修學，不應憍傲妄號大乘，謗毀聲聞、獨覺乘法。",
        "translation": "Therefore, they should all train in the three vehicles and shouldn't be proud and falsely call them the great vehicle and denigrate the teachings of the śrāvaka and pratyekabuddha vehicles.",
        "source": "T13n0411_006:0752c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先唯為大乘法器堅修行者，說如是言：『唯修大乘能得究竟。』",
        "translation": "I first spoke only to those who firmly cultivated the Dharma vessel of the great vehicle, saying, 'Only by cultivating the great vehicle can we reach the ultimate.'",
        "source": "T13n0411_006:0752c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故今昔說不相違。」",
        "translation": "Therefore, there's no discrepancy between what was said in the past and what was said in the present.\"",
        "source": "T13n0411_006:0752c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊重顯此義而說頌曰：「對諸大眾前，　　金剛藏問我：『云何勸供養，　　破戒惡苾芻，　失杜多功德，　　癡惡見所持，　非法器污道，　　而不聽讁罰？",
        "translation": "At the time, the Bhagavān expressed this meaning and spoke in verse, \"In front of the large crowd, the Vajrajogarbha asked me, 'How do you encourage support, break precepts, misbehave, lose much merit, hold deluded views, and defile the path with unlawful implements, but don't listen to punishment?'",
        "source": "T13n0411_006:0752c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復說從彼聞，　　三乘微妙法，　真解脫良藥，　　趣寂靜涅槃。",
        "translation": "\"Furthermore, it's said that from what I've heard from them, the subtle Dharma of the three vehicles is a true medicine for liberation that leads to quiescent nirvāṇa.",
        "source": "T13n0411_006:0752c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何故餘經言，　　一大乘解脫，　遮學二乘法，　　今復說三乘？",
        "translation": "Why do the other sutras say that the liberation of the One Great Vehicle precludes training in the teachings of the two vehicles, and now they also speak of the three vehicles?",
        "source": "T13n0411_006:0752c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　哀愍諸有情，　　令捨邪惡業，　得利益安樂，　　願為說除疑。』",
        "translation": "'Have compassion for sentient beings, causing them to abandon bad karma and attain benefit and happiness, and may you explain it to them to remove doubt.'",
        "source": "T13n0411_006:0752c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為益剎帝利，　　乃至戍達羅，　不聽惱苾芻，　　恐彼染大罪。",
        "translation": "For the benefit of the bhadras and even śūdras, I won't listen to troubled monks, for fear they'll become seriously sinned against.",
        "source": "T13n0411_006:0753a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　剃髮被袈裟，　　諸佛法幢相，　諸佛等護持，　　解脫道之眼。",
        "translation": "He shaves his hair and puts on the reddish-brown robes, which are marked by the buddhas' dharma-banners and are protected by the buddhas as the eyes of the path to liberation.",
        "source": "T13n0411_006:0753a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖破諸律儀，　　非永遮解脫，　能捨諸惡見，　　當速趣涅槃。",
        "translation": "Even though it breaks all the rules and regulations, it doesn't permanently obstruct liberation; it's able to abandon bad views and will quickly enter nirvāṇa.",
        "source": "T13n0411_006:0753a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如腐敗良藥，　　猶能療眾病，　如是破律儀，　　亦能滅他苦。",
        "translation": "Like a good medicine for decay that still cures many illnesses, so breaking the rules and regulations can end the suffering of others.",
        "source": "T13n0411_006:0753a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不聽彼苾芻，　　在布薩羯磨，　許為他說法，　　俱獲福無疑。",
        "translation": "Not listening to that monk who gives a sermon during the poṣadha kalpa, they'll both obtain merit without doubt.",
        "source": "T13n0411_006:0753a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若歸敬三寶，　　稱我為大師，　能棄捨眾惡，　　勝諸外道眾。",
        "translation": "If they revere the Three Treasures and call me their great teacher, they'll be able to cast off many evils and surpass the multitude of non-Buddhists.",
        "source": "T13n0411_006:0753a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如墮羅剎渚，　　商眾悉驚惶，　各執獸一毛，　　渡海得免難。",
        "translation": "Like falling into the island of Rāṣṭrapāla, the merchants are all terrified, and each one takes a hair of an animal and crosses the ocean to escape difficulty.",
        "source": "T13n0411_006:0753a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是破戒者，　　離諸惡邪見，　由一信為因，　　脫煩惱羅剎。",
        "translation": "Thus, someone who breaks the precepts is freed from bad and mistaken views, and because of a single faith as a cause, they're freed from the afflictions of Rājagṛha.",
        "source": "T13n0411_006:0753a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由護解脫相，　　諸佛等護持，　不惱破戒僧，　　能離諸重惡。",
        "translation": "Because they protect the mark of liberation and are upheld by the buddhas, they don't trouble monks who break the precepts and can part with serious evils.",
        "source": "T13n0411_006:0753a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸樂多福人，　　欣求真解脫，　等護器非器，　　證解脫無難。",
        "translation": "Those who are happy and full of merit long for true liberation, equally guard vessels and not vessels, and realize liberation without difficulty.",
        "source": "T13n0411_006:0753a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　癡慢號大乘，　　彼無有智力，　尚迷二乘法，　　況能解大乘！",
        "translation": "Those who are foolish and conceited enough to call it the great vehicle have no intelligence; they're still deluded about the teachings of the two vehicles, so how could they understand the great vehicle?",
        "source": "T13n0411_006:0753a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如闕壞眼，　　不能見眾色，　如是闕壞信，　　不能解大乘。",
        "translation": "Just as the eye is deficient, and it can't see forms, so faith is deficient, and it can't understand the great vehicle.",
        "source": "T13n0411_006:0753a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無力飲池河，　　詎能吞大海？",
        "translation": "Without the strength to drink from a pond or river, how could they swallow the ocean?",
        "source": "T13n0411_006:0753a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不習二乘法，　　何能學大乘？",
        "translation": "Without practicing the teachings of the two vehicles, how can one train in the great vehicle?",
        "source": "T13n0411_006:0753a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先信二乘法，　　方能信大乘，　無信誦大乘，　　空言無所益。",
        "translation": "\"First, I must believe in the teachings of the two vehicles before I can believe in the great vehicle, but without faith and recitation of the great vehicle, empty talk brings no benefit.",
        "source": "T13n0411_006:0753a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　內真懷斷見，　　妄自號大乘，　不護三業罪，　　壞亂我正法。",
        "translation": "With an internally held view of nihilism, they falsely claim to be the great vehicle, don't guard the three karmic sins, and disrupt our right teaching.",
        "source": "T13n0411_006:0753b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼人命終後，　　定墮無間獄，　故應觀機說，　　勿為非器者。",
        "translation": "After his life ends, he'll surely fall into an unremitting hell, so he should contemplate his abilities and not become someone who doesn't have the right tools.",
        "source": "T13n0411_006:0753b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憍傲無慈悲，　　暴惡志下劣，　智者應當知，　　是懷斷見者。",
        "translation": "He's arrogant, lacks compassion, and has a violent, ill-will that's low, which a wise person should know is harboring a view of nihilism.",
        "source": "T13n0411_006:0753b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非聲聞緣覺，　　亦非大乘器；　諂毀謗諸佛，　　必墮無間獄。",
        "translation": "He's not a direct disciple or a solitary realizer, nor is he a great vehicle vessel; he flatters and denigrates the buddhas and will surely fall into the unremitting hell.",
        "source": "T13n0411_006:0753b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持戒樂喧閙，　　慳法畏苦惡，　智者應當了，　　是名聲聞乘。",
        "translation": "Observing precepts and enjoying commotion, stingy with the Dharma and fearful of suffering and evil, a wise person should understand that this is called the śrāvaka vehicle.",
        "source": "T13n0411_006:0753b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂施觀生滅，　　常欣獨靜處，　智者應當了，　　是名獨覺乘。",
        "translation": "He enjoys generosity and observes birth and death, and always rejoices in solitude and quietude, which should be understood by a wise person and is called the solitary realizer vehicle.",
        "source": "T13n0411_006:0753b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具足諸善根，　　守護慈悲本，　常樂攝利物，　　是名為大乘。",
        "translation": "Possessing all the good roots, guarding the basis of compassion, and always delighting in gathering in the benefit of goods is called the great vehicle.",
        "source": "T13n0411_006:0753b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨身命護戒，　　不惱害眾生，　精進求空法，　　應知是大乘。",
        "translation": "He sacrifices his life to protect the precepts, doesn't harm sentient beings, and diligently pursues the teaching of emptiness, which should be known as the great vehicle.",
        "source": "T13n0411_006:0753b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心堪忍諸法，　　善言無祕悋，　於法常欣樂，　　應知是大乘。",
        "translation": "A mind that's tolerant of qualities, speaks well without secrecy, and is always delighted with qualities should be known as the great vehicle.",
        "source": "T13n0411_006:0753b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法器非法器，　　利樂心平等，　不染諸世法，　　應知是大乘。",
        "translation": "He's equal in benefit and joy with respect to the Dharma vessel and the non-dharma vessel, and he doesn't stain worldly dharmas, which should be known as the great vehicle.",
        "source": "T13n0411_006:0753b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故有智者，　　普敬說三乘，　不惱我僧徒，　　速成無上覺。",
        "translation": "Therefore, there are wise men who teach the three vehicles with universal respect, don't trouble our fellow monks, and quickly achieve unsurpassed enlightenment.",
        "source": "T13n0411_006:0753b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T13n0411_006:0753b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有真善剎帝利、真善婆羅門、真善宰官、真善居士、真善長者、真善沙門、真善茷舍、真善戍達羅，若男、若女，成就十種有依行輪，於現身中速能種殖聲聞乘種令不退失，或於現身成聲聞乘諸聖法器；非獨覺乘、大乘聖器。",
        "translation": "\"If there are really good bhadris, really good brāhmaṇas, really good rulers, really good householders, really good elders, really good ascetics, really good foliage, and really good śūdras, whether male or female, who accomplish the wheel of ten kinds of disciplines that have support, they'll quickly plant the seeds of the śrāvaka vehicle in their present body so that they don't falter, or they'll become the holy Dharma vessels of the śrāvaka vehicle in their present body; they aren't the holy vessels of the pratyekabuddha vehicle or the great vehicle.",
        "source": "T13n0411_006:0753b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0411_006:0753b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、具足淨信，信有一切善、惡業果；二者、具足慚愧，遠離一切惡友、惡見；三者、安住律儀，遠離殺生乃至飲酒；四者、安住慈心，遠離一切瞋恚、忿惱；五者、安住悲心，救拔一切羸弱有情；六者、安住喜心，遠離一切語四惡業；七者、安住捨心，遠離一切慳貪、嫉妬；八者、具正歸依，遠離一切妄執吉凶，終不歸依邪神外道；九者、具足精進，堅固勇猛修諸善法；十者、常樂寂靜，思求法義歡悅無倦。",
        "translation": "1. having perfect faith, believing in the fruit of all good and bad actions; 2. having perfect conscience, being free of all bad friends and bad views; 3. abiding steadfastly in restraint, being free of killing and even drinking alcohol; 4. abiding steadfastly in kindness, being free of all anger and wrath; 5. abiding steadfastly in pity, rescuing all weak sentient beings; 6. abiding steadfastly in joy, being free of all four bad activities of speech; 7. abiding steadfastly in equanimity, being free of all stinginess and jealousy; 8. having right reliance, being free of all false attachments to good and evil, and never relying on non-Buddhists who are wrong; 9. having perfect energy, being resolute and vigorous in cultivating good qualities; 10. always enjoying quiescence, rejoicing in the contemplation of the meaning of the teaching without tire.",
        "source": "T13n0411_006:0753b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_006:0753c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有真善剎帝利王，乃至真善戍達羅等，若男、若女，成此十種有依行輪，於現身中速能種殖聲聞乘種令不退失，或於現身證聲聞乘所有聖法，成聲聞乘諸聖法器；非證獨覺大乘聖法、非成獨覺大乘聖器。",
        "translation": "\"If there are truly good Śakra kings or truly good śūdras and so forth, whether male or female, who accomplish these ten kinds of dependent practice, they'll quickly plant śrāvaka seeds in their present bodies so they won't lose them, or they'll realize all the śrāvaka vehicle's noble principles in their present bodies and become the śrāvaka vehicle's noble Dharma vessels; they won't realize the noble principles of the pratyekabuddhas' great vehicle or become the pratyekabuddhas' great vehicle's noble vessels.",
        "source": "T13n0411_006:0753c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知此中獨覺、大乘皆如是說。",
        "translation": "You should know that both the pratyekabuddha vehicle and the great vehicle are thus explained.",
        "source": "T13n0411_006:0753c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_006:0753c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十種有依行輪，一切聲聞、獨覺、菩薩、諸佛如來，皆同共有。",
        "translation": "These ten kinds of dependent practice wheels are shared by all śrāvakas, pratyekbuddhas, bodhisattvas, and buddha-tathāgatas.",
        "source": "T13n0411_006:0753c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0753c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十種有依行輪，不共聲聞，唯與獨覺、菩薩、如來皆同共有。",
        "translation": "\"There are another ten kinds of disciplines that have supports, which are not shared with direct disciples but only with solitary realizers, bodhisattvas, and tathāgatas.",
        "source": "T13n0411_006:0753c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有真善剎帝利王，乃至真善戍達羅等，若男、若女，成此十種有依行輪，於現身中速能種殖獨覺乘種令不退失，或於現身證獨覺乘所有聖法，成獨覺乘諸聖法器。",
        "translation": "If there are truly good Śakra kings or truly good śūdras, whether male or female, who accomplish these ten kinds of dependent practice, they'll quickly plant the seeds of the pratyekabuddha vehicle in their present bodies so that they won't be lost, or they'll realize all the holy dharmas of the pratyekabuddha vehicle in their present bodies and become the holy Dharma vessels of the pratyekabuddha vehicle.",
        "source": "T13n0411_006:0753c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0411_006:0753c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、修行清淨身、語、意、業；二者、具足慚愧，厭患自身；三者、於五取蘊，深生怖畏；四者、見生死河，極為難渡；五者、常樂寂靜，離諸憒閙；六者、樂阿練若，不譏他失；七者、守護諸根，心常寂定；八者、善觀緣起，審察因果；九者、常樂勤修等持、靜慮；十者、於集起法，能善除滅。",
        "translation": "1. they cultivate the purification of body, speech, mind, and action; 2. they are fully conscientious and weary of themselves; 3. they have deep fear of the five appropriated aggregates; 4. they see the river of birth-and-death as extremely difficult to cross; 5. they always enjoy tranquility and are free of anxiety; 6. they enjoy araṇya and don't criticize others for their faults; 7. they guard their faculties and are always calm and collected in their minds; 8. they skillfully observe dependent arising and examine cause and effect; 9. they always enjoy diligently cultivating equanimity and meditation; 10. they are able to skillfully remove the factors that build up and give rise to phenomena.",
        "source": "T13n0411_006:0753c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0753c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有真善剎帝利王，乃至真善戍達羅等，若男、若女，成此十種有依行輪，於現身中速能種殖獨覺乘種令不退失，或於現身證獨覺乘所有聖法，成獨覺乘諸聖法器。",
        "translation": "\"If there are truly good Śakra kings or truly good śūdras and so forth, whether male or female, who accomplish these ten kinds of dependent practice, they'll quickly plant seeds of the vehicle of pratyekabuddha in their present bodies so that they won't be lost, or they'll realize all the noble teachings of the vehicle of pratyekabuddha in their present bodies and become the holy Dharma vessels of the vehicle of pratyekabuddha.",
        "source": "T13n0411_006:0753c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_006:0754a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名一切聲聞、獨覺有依行輪。",
        "translation": "This is called the wheel of practice that all śrāvakas and pratyekbuddhas have support for.",
        "source": "T13n0411_006:0754a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切聲聞及諸獨覺依止此輪，速能超渡三有大海，速能趣入般涅槃城。",
        "translation": "By relying on this wheel, all śrāvakas and solitary realizers can quickly transcend the ocean of the three existences and quickly enter the city of parinirvāṇa.",
        "source": "T13n0411_006:0754a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0754a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有依行輪，是何句義？",
        "translation": "\"What is the meaning of the phrase 'wheel of dependent arising'?",
        "source": "T13n0411_006:0754a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言有依者，名有執取、有我所依、有所攝受、有所繫屬。",
        "translation": "Those who say there are supports are called those who have appropriation, who have bases in self, who are collected, and who have attachments.",
        "source": "T13n0411_006:0754a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行謂：蘊行、界行、處行、有繫屬行。",
        "translation": "Actions are: aggregate actions, elemental actions, field actions, and actions with attachments.",
        "source": "T13n0411_006:0754a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輪謂：教授、教誡之輪；如轉輪王所乘車輪、或首行輪。",
        "translation": "The wheel is the wheel of instruction and guidance, like the wheel of a chariot or the first wheel of practice used by a wheel-turning king.",
        "source": "T13n0411_006:0754a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切聲聞、獨覺，依止此輪求涅槃道，故此二種非大乘器。",
        "translation": "Thus, all śrāvakas and solitary realizers rely on this wheel to pursue the path to nirvāṇa, so these two kinds are not great vehicle vessels.",
        "source": "T13n0411_006:0754a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_006:0754a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼依止下劣行故，非大乘器。",
        "translation": "Because they rely on inferior practices, they're not a great vehicle vessel.",
        "source": "T13n0411_006:0754a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼執取自諸蘊行，驚怖、厭患、自求解脫一切憂苦，不求解脫一切有情而修行，故非大乘器。",
        "translation": "Because they cling to the practice of their own aggregates, become frightened and disillusioned, seek their own liberation from all sorrow and suffering, and cultivate their practice without seeking the liberation of all sentient beings, they aren't great vehicle vessels.",
        "source": "T13n0411_006:0754a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼依止自諸界行，驚怖、厭患、自求解脫一切憂苦，不求解脫一切有情而修行，故非大乘器。",
        "translation": "Because they rely on their own formative practices in the elements, fear, disillusionment, and self-seeking liberation from all sorrow and suffering, and they don't seek liberation from all sentient beings in their practice, they aren't a vessel of the great vehicle.",
        "source": "T13n0411_006:0754a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼攝受自諸處行，驚怖、厭患、自求解脫一切憂苦，不求解脫一切有情而修行，故非大乘器。",
        "translation": "Because they take in their own practices in various places, become frightened and disillusioned, seek their own liberation from all sorrow and suffering, and cultivate their practices without seeking the liberation of all sentient beings, they aren't great vehicle vessels.",
        "source": "T13n0411_006:0754a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼繫屬有繫屬行，於諸有情不樂攝受，無有慈悲有繫屬，故非大乘器。",
        "translation": "Because they are bound to the practice of being bound, don't enjoy taking in sentient beings, and don't have compassionate bonds, they aren't a vessel of the great vehicle.",
        "source": "T13n0411_006:0754a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼觀他具受眾苦捨而不救，但為自身求解脫，故非大乘器。",
        "translation": "Because they observe the suffering of others, abandon and don't save them, and seek liberation for themselves, they are not a vessel of the great vehicle.",
        "source": "T13n0411_006:0754a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼自斷諸煩惱首，不樂斷除一切有情諸煩惱首，非大乘器。",
        "translation": "Because they stop the head of the afflictions themselves and don't wish to stop the head of the afflictions of all sentient beings, they aren't a vessel of the great vehicle.",
        "source": "T13n0411_006:0754a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼不能馭大乘輪趣菩提，故非大乘器。",
        "translation": "Because they can't harness the great vehicle wheel and head for enlightenment, they aren't a great vehicle vessel.",
        "source": "T13n0411_006:0754a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼不能隨大光輪趣菩提，故非大乘器。",
        "translation": "Because they can't follow the wheel of great radiance to enlightenment, they aren't a vessel of the great vehicle.",
        "source": "T13n0411_006:0754a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼憙樂獨一無侶入涅槃城而修行，故非大乘器。",
        "translation": "Because they are happy to enter the city of nirvāṇa alone and without a partner and practice, they aren't a vessel of the great vehicle.",
        "source": "T13n0411_006:0754a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0754a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸眾生，於聲聞乘、獨覺乘法，未作劬勞正勤修學，如是眾生根機未熟、根機下劣、精進微少。",
        "translation": "\"Are there sentient beings who haven't made the effort to correctly train in the teachings of the śrāvaka and pratyekabuddha vehicles, or are such sentient beings whose faculties are immature, whose faculties are weak, and whose effort is slight?",
        "source": "T13n0411_006:0754a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有為說微妙甚深大乘正法，說、聽二人俱獲大罪，亦為違逆一切諸佛。",
        "translation": "If someone teaches the subtle and profound true great vehicle teaching, it's a great offense for both the speaker and the listener, and it's also a violation of all the buddhas.",
        "source": "T13n0411_006:0754b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_006:0754b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生於聲聞乘、獨覺乘法，未作劬勞正勤修學，根機未熟、根機下劣、精進微少，而便聽受微妙甚深大乘正法，如是眾生實是愚癡自謂聰叡，陷斷滅邊，墜顛狂想，執無因論，於諸業果生斷滅想，撥無一切善作、惡作。",
        "translation": "\"If sentient beings correctly and diligently cultivate the teachings of the śrāvaka and pratyekabuddha vehicles without exerting themselves, and their faculties are immature, their faculties are weak, and their effort is slight, and yet they listen to the subtle and profound true great vehicle teaching, such sentient beings are really foolish and call themselves wise, fall to the extreme of nihilism, fall into delusional notions, hold to the theory of non-causation, give rise to notions of nihilism in regard to the results of actions, and dismiss all good actions and bad actions.",
        "source": "T13n0411_006:0754b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄說大乘壞亂我法，非法說法、法說非法，實非沙門說是沙門、實是沙門說非沙門，實非毘奈耶說是毘奈耶、實是毘奈耶說非毘奈耶。",
        "translation": "They falsely claim that the great vehicle corrupts self and confuses dharmas, teach what's not true and teach what's not true, claim to be an ascetic when they're not ascetics, claim to be an ascetic when they are ascetics, and claim to be something other than an ascetic when they're not Vinaya.",
        "source": "T13n0411_006:0754b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡、顛倒、憍慢、嫉妬、朋黨之心，於大乘法稱讚擁衛令廣流布，於聲聞乘、獨覺乘法，謗毀、障蔽，不令流布。",
        "translation": "Foolish, mistaken, arrogant, jealous, and partisan states of mind praise and defend the great vehicle teaching and cause it to spread widely, while denigrating and obstructing the teachings of the śrāvaka and pratyekabuddha vehicles and not allowing them to spread.",
        "source": "T13n0411_006:0754b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能如實依聲聞乘、或獨覺乘、或無上乘，捨俗出家受具足戒成苾芻性，亦不如實修集一切善法因緣。",
        "translation": "They can't truly rely on the śrāvaka vehicle, the pratyekabuddha vehicle, or the unsurpassed vehicle, leave the secular world, leave home, receive full ordination, or become a monk, nor do they truly cultivate all the causes and conditions of good qualities.",
        "source": "T13n0411_006:0754b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我弟子，或是法器、或非法器，謂：勤修行、學無學行，乃至證得最後極果真善異生，持戒、破戒、無戒者所，種種毀罵、呵嘖、惱亂、奪其衣鉢，不聽受用諸資生具，繫縛、禁閉。",
        "translation": "Whether they're a vessel of the Dharma or a vessel of the non-Dharma, my disciples diligently cultivate their practice, train in the practice of no-training, and realize the final ultimate fruit of genuine good rebirth, maintain precepts, break precepts, and abide in the absence of precepts, variously reviling, criticizing, upsetting, and taking away their clothing and bowls, and they aren't allowed to use the necessities of life, and they're bound and confined.",
        "source": "T13n0411_006:0754b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是撥無一切因果斷滅論者，雖在人中實是羅剎，於當來世無數大劫難得人身；寧在地獄受無量苦，不處人中起斷滅見。",
        "translation": "Such a person who rejects the theory that there are no causes and effects that lead to cessation will really be a rāṣṇa even though he's among humans, and it will be difficult to obtain a human body in an incalculably long future life; he'd rather suffer measureless pain in hell than give rise to a view of cessation while still among humans.",
        "source": "T13n0411_006:0754b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是癡人，不久便當支體廢缺，於多日夜結舌不言，受諸苦毒痛切難忍，命終定生無間地獄。",
        "translation": "\"Such a foolish man will soon lose his limbs and body, spend many days and nights tongue-tied and silent, experience pain and suffering that's hard to bear, and be certainly born in an unremitting hell when his life ends.",
        "source": "T13n0411_006:0754b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸惡趣輪轉往來受諸苦惱，難可救濟，多百千劫難復人身。",
        "translation": "They'll be subject to the pain and suffering of transmigration through the evil destinies, which are difficult to rescue, and it will be difficult to return to life for a hundred thousand eons.",
        "source": "T13n0411_006:0754b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖過無量、無數劫已，還得人身，而生五濁無佛世界，生盲、生聾、瘖啞無舌，種種重病常所嬰纏，或身矬醜人不憙見，言詞拙訥耳所惡聞，心常迷亂無所解了，生貧窮家眾事闕乏，不逢善友，隨惡友行樂作惡業，好執惡見造無間罪，復還重墮無間地獄，輪轉惡趣難有出期。",
        "translation": "Although they'll be reborn as human beings after countless and numerous eons, they'll be born in the five turbid unbuddha realms, become blind, deaf, dumb, and tongueless, be constantly beset by various serious illnesses, have a short, ugly body that people don't like to see, speak clumsily and have a bad ear, be constantly confused in their minds and have no understanding, be born in a poor family with few possessions, not meet good friends, follow the actions of bad friends, create bad karma, and hold to bad views that create unremitting sins, and then fall back again into an unremitting hell, where transmigration through the bad destinies is difficult to escape from.",
        "source": "T13n0411_006:0754b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是愚癡斷滅論者，壞亂毀滅我之正法，逼惱謫罰我諸弟子，持戒、破戒、及無戒者，皆令不安修諸善品。",
        "translation": "\"Such foolish nihilists disrupt and destroy my right teaching, harass and punish my disciples, and make them refrain from cultivating good qualities when they observe or violate the precepts or lack the precepts.",
        "source": "T13n0411_006:0754c05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，多百千劫沒眾惡趣，從闇入闇難有出期。",
        "translation": "As a result, they'll be submerged in many bad destinies for hundreds of thousands of eons, and it'll be difficult to escape from darkness into darkness.",
        "source": "T13n0411_006:0754c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生所有罪報，皆為未求聽習聲聞、獨覺乘法，先求聽習微妙甚深大乘正法。",
        "translation": "Such sentient beings are rewarded for all their sins because they haven't yet sought to study the teachings of the śrāvaka and pratyekabuddha vehicles and have first sought to study the subtle, profound, and great vehicle right teaching.",
        "source": "T13n0411_006:0754c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是愚癡斷滅論者，下劣人身尚難可得，況當能成賢聖法器！",
        "translation": "Such a foolish nihilist would find it difficult to attain a lowly human existence, so how could he attain the status of a worthy and noble Dharma vessel?",
        "source": "T13n0411_006:0754c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尚不能得聲聞、獨覺所證涅槃，況得廣大甚深無上正等菩提！",
        "translation": "How could one attain unsurpassed perfect enlightenment when one hasn't yet attained the nirvāṇa realized by the direct disciples and solitary realizers?",
        "source": "T13n0411_006:0754c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生所有過失，皆由未學聲聞乘法、獨覺乘法，先入大乘。",
        "translation": "All of these sentient beings' faults are caused by the fact that they haven't yet studied the teachings of the śrāvaka vehicle or the solitary realizer vehicle and have first entered the great vehicle.",
        "source": "T13n0411_006:0754c14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0754c15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如坯瓶多諸瑕隙，盛油乳等，盡皆滲漏，能盛、所盛二俱壞失。",
        "translation": "\"It's like a blank vase with many blemishes that contains oil and milk, and it's all leaking, and both what it can and can't be contained are destroyed.",
        "source": "T13n0411_006:0754c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_006:0754c17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "器有失故。",
        "translation": "\"Their capacity is impaired.",
        "source": "T13n0411_006:0754c17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，於聲聞乘、獨覺乘法，未作劬勞正勤修學，根機未熟、根機下劣、精進微少。",
        "translation": "Thus, sentient beings who correctly and diligently cultivate the teachings of the śrāvaka and pratyekabuddha vehicles without exerting themselves, have immature faculties, have weak faculties, and make little effort.",
        "source": "T13n0411_006:0754c17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有為說微妙甚深大乘正法，說、聽二人俱獲大罪，亦為違逆一切諸佛，所有過失廣說如前。",
        "translation": "If someone teaches the subtle and profound true great vehicle teaching, it's a great offense for both the speaker and listener, and it's a violation of all the buddhas, the faults of which are explained in detail as before.",
        "source": "T13n0411_006:0754c19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間庫藏頹穴，置諸寶貨多有散失。",
        "translation": "It's like the world's treasury, where treasures are often scattered.",
        "source": "T13n0411_006:0754c22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，於二乘法，謗毀不信、不肯修學，為說大乘不如實解，因此造罪輪轉無窮。",
        "translation": "Such sentient beings denigrate the teachings of the two vehicles, disbelieve them, refuse to train, and teach that the great vehicle isn't really understood, thus creating a cycle of sins that knows no limit.",
        "source": "T13n0411_006:0754c23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如舟船，多諸泄漏，不任乘載泛於大海。",
        "translation": "They're like boats that are riddled with leaks and don't ride out to sea.",
        "source": "T13n0411_006:0754c25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，多懷慳嫉，於二乘法未曾修學，妄號大乘實懷斷見，憍慢諂曲成泄漏身，不堪憑入一切智海。",
        "translation": "Such sentient beings are often stingy and jealous, haven't cultivated the teachings of the two vehicles, falsely claim that the great vehicle really harbors a view of elimination, and are proud and flattering enough to form a body that's contaminated and unable to enter the ocean of omniscience with pride.",
        "source": "T13n0411_006:0754c26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，其目盲瞽，不堪呈示種種珍寶。",
        "translation": "They're like a person whose eyes are blind and go blind, and they can't present various treasures.",
        "source": "T13n0411_006:0754c28_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，憍慢放逸，執著空見，不學二乘，盲無慧目，不任顯示無上大乘功德珍寶。",
        "translation": "Such a sentient being is arrogant, careless, attached to views of emptiness, doesn't train in the two vehicles, and is blind and lacks the eyes of wisdom, which makes it impossible for him to display the treasures of the unsurpassed great vehicle's attributes.",
        "source": "T13n0411_006:0754c29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，其身臭穢，雖以種種上妙香塗，而竟不能令身香潔。",
        "translation": "It's like a person whose body smells foul, and even though they apply various fine fragrances, they can't make it smell clean.",
        "source": "T13n0411_006:0755a02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，愚癡憍慢，於二乘法不樂勤修，不斷殺生乃至邪見，雖勤聽受無上大乘，而竟不能解甚深法。",
        "translation": "Such sentient beings are foolish and arrogant, don't enjoy diligently cultivating the teachings of the two vehicles, and don't stop killing or even hold mistaken views, and even though they diligently listen to and accept the unsurpassed great vehicle, they still can't understand its profound teaching.",
        "source": "T13n0411_006:0755a04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「譬如石田，雖殖好種勤加營耨，終無果實。",
        "translation": "\"It's like a field of rocks that never bears fruit even though you plant good seeds and work hard to cultivate them.",
        "source": "T13n0411_006:0755a06_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，於二乘法，憍慢懈怠不樂勤修，貪求五欲曾無厭倦，雖於彼身殖大乘種，精進勤苦終無所成。",
        "translation": "Thus, even though sentient beings are arrogant, lazy, and don't enjoy diligently cultivating the teachings of the two vehicles, and they never tire of craving the five desires, they plant the seeds of the great vehicle in their bodies and never attain anything despite their diligence and pain.",
        "source": "T13n0411_006:0755a07_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如甕器，先貯毒藥投少石蜜，不任食用。",
        "translation": "It's like a jar that's first stocked with poison and has a little rock honey thrown in, but it won't let you eat it.",
        "source": "T13n0411_006:0755a10_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，於二乘法不肯修學，執無因論，為說大乘終不能成自他利益。",
        "translation": "Such a sentient being refuses to train in the teachings of the two vehicles and adheres to the theory of non-causation, teaching the great vehicle for the sake of it will never achieve benefits for self and others.",
        "source": "T13n0411_006:0755a11_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如甕器，先貯石蜜投少毒藥，不任食用。",
        "translation": "They're like a jar that first stores rock honey and throws in a little poison, but they won't allow it to be eaten.",
        "source": "T13n0411_006:0755a13_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，精勤修學二乘正法猶未成就，為說大乘，二俱壞失。",
        "translation": "Such a sentient being diligently cultivates the right Dharma of the two vehicles but has yet to achieve it, and he teaches the great vehicle for the sake of it, and both are destroyed and lost.",
        "source": "T13n0411_006:0755a14_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，癡狂心亂，為作音樂，不能了知。",
        "translation": "It's like a person who's deluded and mentally disturbed, making music for the sake of it but unable to understand it.",
        "source": "T13n0411_006:0755a15_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，於二乘法未曾修學，貪、瞋、癡等猛利煩惱擾亂其心，執著無因及斷滅論，根機未熟，為說大乘，雖經多時而不能解。",
        "translation": "Such a sentient being has never cultivated the Second Vehicle teaching, is disturbed by intense afflictions like greed, anger, and delusion, is attached to the theory of non-causation and cessation, and has rudimentary faculties that haven't matured, and yet they're taught the Great Vehicle, even though they haven't been able to understand it for a long time.",
        "source": "T13n0411_006:0755a16_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人，不著甲冑、不持刀仗輙入陣中，必遭傷害受諸苦惱。",
        "translation": "It's like a person who enters a battlefield without wearing armor or carrying a sword or weapon and is sure to be harmed and suffer hardships.",
        "source": "T13n0411_006:0755a19_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，於二乘法未曾修學，智慧狹劣根器未成，為說大乘必生妄執，由此展轉造惡無窮。",
        "translation": "Such a sentient being has never cultivated the teachings of the two vehicles and has narrow wisdom and weak faculties that haven't yet matured, so teaching the great vehicle for them will surely give rise to deluded attachments, which will continue to do evil without limit.",
        "source": "T13n0411_006:0755a21_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是癡人，不久便當支體廢缺，於多日夜結舌不言，受諸苦毒痛切難忍，命終定生無間地獄。",
        "translation": "Such a foolish man will soon lose his limbs and body, spend many days and nights with his tongue tied shut and unable to speak, experience pain and suffering that's hard to bear, and be certainly born in an unremitting hell when his life ends.",
        "source": "T13n0411_006:0755a23_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸惡趣輪轉往來，應知如前次第廣說。",
        "translation": "Their transmigration through the negative destinies should be explained in the preceding sequence.",
        "source": "T13n0411_006:0755a25_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0755a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故智者先應觀察一切眾心，然後說法。",
        "translation": "\"Therefore, a wise person should first observe all minds before explaining the teaching.",
        "source": "T13n0411_006:0755a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先當發起慈心、悲心、喜心、益心、不懈怠心、能忍受心、不憍慢心、不嫉妬心、不慳悋心、等引定心，然後為他宣說正法。",
        "translation": "First, he must arouse the mind of kindness, pity, joy, benefit, noncontempt, tolerance, pride, jealousy, stinginess, and equanimity, and then explain the right teaching for others.",
        "source": "T13n0411_006:0755a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "終不令他諸眾生類，聞所說法，輪轉生死，墮大險難。",
        "translation": "Never will they cause other kinds of sentient beings who hear what's taught to be reborn in transmigration and fall into great danger.",
        "source": "T13n0411_006:0755b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，如來善達一切眾生心相，以無塵垢、無取行輪，為說正法。",
        "translation": "Therefore, the Tathāgata well understands the characteristics of the minds of all sentient beings and explains the right teaching with the dustless, unacquired wheel of practice.",
        "source": "T13n0411_006:0755b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具大甲冑一切菩薩摩訶薩眾，為他說法亦復如是，由悲愍故、為令斷滅諸煩惱故、為令超渡三有海故、為諸眾生於三乘中隨心所樂隨趣一乘速圓滿故，為說正法，終不令其輪轉生死，墮大險難。",
        "translation": "All the bodhisattvas, mahāsattvas, and others with great armor likewise explain the right teaching for others, so that they won't be led into birth-and-death transmigration and fall into great danger because of compassion, because they want to end the afflictions, because they want to cross the ocean of the three existences, and because they want sentient beings to quickly fulfill the One Vehicle according to their hearts' desire among the three vehicles.",
        "source": "T13n0411_006:0755b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名無塵垢行輪？",
        "translation": "\"What's called the immaculate active wheel?",
        "source": "T13n0411_006:0755b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無塵垢者，謂說法時，不為有蘊、不為有處、不為有界，不為有欲界、不為有色界、不為有無色界，不為有此世、不為有他世，不為有諸行、不為有受、不為有想、不為有思、不為有觸、不為有作意、不為有無明，乃至不為有老死、不為有行及不行故，為諸眾生宣說正法；唯為一切諸蘊、處、界，廣說乃至行與不行，皆寂滅故，為諸眾生宣說正法，以是義故，名無塵垢。",
        "translation": "\"Immaculate\" means that when the teaching is explained, it's correct to explain the teaching for sentient beings because there are no aggregates, no places, no realms, no desire realm, no form realm, no form realm, no other realm, no conditioned form, no feeling, no perception, no thought, no contact, no contemplation, no ignorance, and even no old age and death, no practice, and no lack of practice; it's only because all aggregates, places, and realms, explained in detail and up to and including practice and lack of practice, are stilled that the teaching is correct for sentient beings, and because of this meaning it's called immaculate.",
        "source": "T13n0411_006:0755b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者，所謂為能永斷死此生彼，為諸眾生宣說正法，為能永斷諸蘊、處、界，廣說乃至為能永斷行與不行，為諸眾生宣說正法，是名為行。",
        "translation": "Practice is called proclaiming the right teaching for sentient beings in order to permanently end death here and birth there, proclaiming the right teaching for sentient beings in order to permanently end the aggregates, fields, and realms, and explaining it in detail up to the point where it permanently ends practice and doesn't work, and proclaiming the right teaching for sentient beings.",
        "source": "T13n0411_006:0755b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輪者，所謂如滿月光清涼無礙，遍滿虛空，照觸一切無障境界。",
        "translation": "The wheel is called the light of the full moon that's cool and unobstructed, pervading space and illuminating all unobstructed realms.",
        "source": "T13n0411_006:0755b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，如來及諸菩薩，所有神通、記說、教誡三種勝輪，作用無礙遍諸世界，利樂一切所化眾生。",
        "translation": "Thus, the three excellent wheels of the Tathāgata and the bodhisattvas' supernormal powers, recordings, and instructions work without obstruction to pervade the worlds and bring benefit to all the sentient beings they transform.",
        "source": "T13n0411_006:0755b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令諸眾生不異歸趣，不共一切世間眾生，不共一切聲聞、獨覺，能令眾生斷滅生死諸苦惱法，證得安樂菩提涅槃，是名為輪。",
        "translation": "To cause sentient beings not to go to different destinies, not to share with all worldly beings, not to share with all śrāvakas and solitary realizers, and to cause sentient beings to cease the painful and tormenting factors of birth and death and realize the parinirvāṇa of enlightenment with well-being is called the wheel.",
        "source": "T13n0411_006:0755b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸佛、菩薩無塵垢行輪。",
        "translation": "Such is called the wheel of the immaculate actions of buddhas and bodhisattvas.",
        "source": "T13n0411_006:0755b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為無取行輪？",
        "translation": "\"What is called the wheel of practice without attachment?",
        "source": "T13n0411_006:0755b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於諸法無所罣礙，猶如日光普照一切，三乘根器隨其所宜，宣說正法無所執著。",
        "translation": "They are unobstructed by dharmas, like sunlight that shines universally on all, and they teach the right dharma according to the abilities of the three vehicles and their abilities, attaching to nothing.",
        "source": "T13n0411_006:0755b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸如來，為諸眾生說如是法，猶如虛空無差別相，以無量定遊戲自在莊嚴住持，為諸眾生說微妙法無所執著。",
        "translation": "Tathāgatas are like sentient beings who are taught such things as space without discriminating characteristics, who are unimpededly adorned with measureless concentration and play, and who teach subtle dharmas to sentient beings without attaching to them.",
        "source": "T13n0411_006:0755c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具大甲冑一切菩薩摩訶薩眾，為他說法亦復如是。",
        "translation": "All the bodhisattvas, mahāsattvas, and bodhisattvas in great armor likewise explain the Dharma for others.",
        "source": "T13n0411_006:0755c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂說諸法非有、非空；非即色空、非離色空，乃至非即識空、非離識空；非即眼空、非離眼空，乃至非即意空、非離意空；非即色空、非離色空，乃至非即法空，非離法空；非即眼識空、非離眼識空，乃至非即意識空、非離意識空。",
        "translation": "That is, they teach that all dharmas are not existent and not empty; that they are not empty of form and not free of form; that they are not empty of consciousness and not free of consciousness; that they are not empty of the eye and not free of the eye; that they are not empty of the mind and not free of the mind; that they are not empty of form and not free of form; that they are not empty of dharmas and not free of dharmas; that they are not empty of the eye consciousness and not free of the eye consciousness; and that they are not empty of consciousness and not free of consciousness.",
        "source": "T13n0411_006:0755c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非即欲界空、非離欲界空，乃至非即虛空無邊處空、非離虛空無邊處空，非即識無邊處空、非離識無邊處空，非即無所有處空、非離無所有處空，非即非想非非想處空、非離非想非非想處空。",
        "translation": "It's not emptiness of the desire realm and not emptiness free from the desire realm, and it's not emptiness of the infinite range of space and not emptiness free from the infinite range of space, not emptiness of the infinite range of consciousness and not emptiness free from the infinite range of consciousness, not emptiness of the sphere of nothing and not emptiness free from the sphere of nothing, not emptiness of the sphere of neither perception nor non-perception, and not emptiness free from the sphere of neither perception nor non-perception.",
        "source": "T13n0411_006:0755c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非即四念住空、非離四念住空，乃至非即八支聖道空、非離八支聖道空，非即緣起法空、非離緣起法空，非即三不護空、非離三不護空，非即四無所畏空、非離四無所畏空，非即十力空、非離十力空，非即十八不共法空、非離十八不共法空，非即大慈大悲大喜大捨空、非離大慈大悲大喜大捨空，非即涅槃空、非離涅槃空。",
        "translation": "非即四念住空、非離四念住空，乃至非即八支聖道空、非離八支聖道空，非即緣起法空、非離緣起法空，非即三不護空、非離三不護空，非即四無所畏空、非離四無所畏空，非即十力空、非離十力空，非即十八不共法空、非離十八不共法空，非即大慈大悲大喜大捨空、非離大慈大悲大喜大捨空，非即涅槃空、非離涅槃空。",
        "source": "T13n0411_006:0755c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名，如來及諸菩薩，為諸眾生宣說處中微妙正法。",
        "translation": "This is called the Tathāgata and the bodhisattvas proclaiming for sentient beings the subtle right teaching in their midst.",
        "source": "T13n0411_006:0755c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0755c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，為諸眾生，以無塵垢行輪說法；如滿月光，清涼無礙，遍滿虛空，照觸一切無障境界。",
        "translation": "Thus, the Tathāgata explains the teaching for sentient beings with a dustless wheel of action that's like the full-moon light that's cool and unobstructed, pervading space and illuminating all unobstructed realms.",
        "source": "T13n0411_006:0755c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至廣說，又以無取行輪說微妙法；於一切法無所罣礙，猶如日光普照一切，三乘根器隨其所宜，宣說正法無所執著。",
        "translation": "It's also explained in detail that he speaks the subtle Dharma with the practice wheel of nonattachment, which is like sunlight that shines universally on all things and which accords with the abilities of the three vehicles, and he proclaims the right Dharma without attachment.",
        "source": "T13n0411_006:0755c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸如來，為諸眾生說如是法，猶如虛空無差別相，以無量定遊戲自在莊嚴住持，為諸眾生說微妙法無所執著，令於三乘隨宜趣入。",
        "translation": "These tathāgatas explain such things for sentient beings as if space had no discriminating features, abide adorned with the sovereignty of measureless meditative play, explain the subtle Dharma for sentient beings without attachment, and cause the three vehicles to enter it as appropriate.",
        "source": "T13n0411_006:0756a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具大甲冑一切菩薩摩訶薩眾，為他說法亦復如是，令諸眾生聞此最勝甚深法已，於三乘中，隨其所樂隨趣一乘，種種善根皆得成熟；隨於一乘極善安住，終不令其於生死中增長種種惡、不善法，令於涅槃堅固不退。",
        "translation": "All bodhisattvas, mahāsattvas with great armor, likewise explain the teaching for others, causing sentient beings who hear this most excellent and profound teaching to follow the one vehicle among the three vehicles as they please, where their various good roots will all mature, and to abide most comfortably with the one vehicle, never allowing them to develop various bad and unskillful qualities in birth-and-death, so that they'll be resolute and not retrogress from nirvāṇa.",
        "source": "T13n0411_006:0756a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0756a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為斷無量無數眾生生死流轉，為他說法；聲聞、獨覺，但為自斷生死流轉，為他說法。",
        "translation": "\"The bodhisattva Mahāsattva explains the teaching for others in order to stop the flow of birth-and-death in measureless and incalculable sentient beings, whereas śrāvakas and pratyekbuddhas explain the teaching for others only to stop the flow of birth-and-death for themselves.",
        "source": "T13n0411_006:0756a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為令無量無數眾生渡四瀑流，為他說法；聲聞、獨覺，但為令己渡四瀑流，為他說法。",
        "translation": "The bodhisattva Mahāsattva explains the teaching for others in order to cause measureless and countless sentient beings to cross the four waterfalls, while śrāvakas and pratyekbuddhas explain the teaching for others in order to cause themselves to cross the four waterfalls.",
        "source": "T13n0411_006:0756a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為除無量無數眾生諸煩惱病，為他說法；聲聞、獨覺，但為自除諸煩惱病，為他說法。",
        "translation": "The bodhisattva Mahāsattva explains the teaching for others in order to remove the afflictive illnesses of measureless and incalculable sentient beings, while śrāvakas and pratyekbuddhas explain the teaching for others in order to remove their own afflictive illnesses.",
        "source": "T13n0411_006:0756a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為斷眾生諸蘊煩惱、習氣相續，令盡無餘，為他說法；聲聞、獨覺，但為自斷諸蘊煩惱、習氣相續，有餘不盡，為他說法。",
        "translation": "The bodhisattva Mahāsattva explains the teaching for others in order to end the afflictions and karmic continuities of the aggregates of sentient beings, so that there are no remainders, while the śrāvakas and solitary realizers explain the teaching for others in order to end the afflictions and karmic continuities of the aggregates themselves, so that there are remainders that don't end.",
        "source": "T13n0411_006:0756a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為成大悲等流果故，大悲為因，為他說法；聲聞、獨覺，不為大悲等流果故，無大悲因，為他說法。",
        "translation": "Bodhisattvas, mahāsattvas, teach for others because they have formed the result of the continuity of great compassion, and śrāvakas and solitary realizers teach for others because they don't have the cause of great compassion, which is the result of the continuity of great compassion.",
        "source": "T13n0411_006:0756a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，於諸眾生有所顧念，而為說法；聲聞、獨覺，於諸眾生無所顧念，而為說法。",
        "translation": "Bodhisattvas, mahāsattvas, and solitary realizers teach with some regard for sentient beings, whereas śrāvakas and pratyekbuddhas teach without any regard for sentient beings.",
        "source": "T13n0411_006:0756a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為息一切他眾生苦，為他說法；聲聞、獨覺，但為自息己所有苦，為他說法。",
        "translation": "Bodhisattvas, mahāsattvas, teach for others in order to quell the suffering of all other sentient beings, whereas śrāvakas and solitary realizers teach for others only to quell their own suffering.",
        "source": "T13n0411_006:0756a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為滿一切眾生法味，為他說法；聲聞、獨覺，但為自滿己身法味，為他說法。",
        "translation": "The bodhisattva Mahāsattva speaks for others in order to satisfy the taste of the Dharma of all sentient beings, whereas śrāvakas and solitary realizers speak for others only to satisfy their own taste of the Dharma themselves.",
        "source": "T13n0411_006:0756a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，為諸眾生得勝法明，為他說法；聲聞、獨覺，但為自己得勝法明，為他說法。",
        "translation": "Bodhisattvas, mahāsattvas, teach for others in order to give sentient beings insight into the Dharma that's superior, while śrāvakas and solitary realizers teach for others in order to give sentient beings insight into the Dharma that's superior for themselves.",
        "source": "T13n0411_006:0756a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0756b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以要言之，菩薩摩訶薩無量律儀，普為除滅一切眾生大無明闇、大怖畏事、一切衰損，得大光明及大名稱，如實覺悟一切智智，為他說法。",
        "translation": "To summarize, the measureless regulations of the bodhisattvas, the mahāsattvas, are designed to remove the great darkness of ignorance, great fears, and all debilitations in all sentient beings, obtain great radiance and great fame, truly awaken to the knowledge of all things, and expound the Dharma for others.",
        "source": "T13n0411_006:0756b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺少分律儀，但為滅除自無明闇，得小光明及小名稱，如實覺悟少分法智，為他說法。",
        "translation": "śrāvakas and solitary realizers follow a limited set of precepts designed only to extinguish the darkness of their own ignorance, attain a small light and a small name, and truly awaken to a small amount of knowledge of the Dharma, teaching it to others.",
        "source": "T13n0411_006:0756b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_006:0756b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、獨覺，無有於他實懷顧念，無有於他實懷悲惻，無有於他實不輕弄，無有於他實為利益，無有於他實為拔濟，無有於他實行薦舉，無有於他實欲稱歎，無有於他實無諂曲而行讚美，無有於他不顧己身令彼安樂，無有於他不起誤失身、語、意、業。",
        "translation": "There's no śrāvaka or pratyekabuddha who really cares for others, no one who really has compassion for others, no one who really doesn't despise others, no one who really benefits others, no one who really rescues others, no one who gives recommendation to others, no one who really wants to praise others, no one who really praises others without flattery, no one who causes their well-being without concern for themselves, and no one who doesn't misconstrue body, speech, mind, or action.",
        "source": "T13n0411_006:0756b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_006:0756b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住大乘者，無有於己實懷顧念，廣說乃至，無有於他發起誤失身、語、意業。",
        "translation": "\"Those who abide in the great vehicle have no concern for themselves, explaining it in detail up to the point where they don't give rise to misconstruing body, speech, or mind karma for others.",
        "source": "T13n0411_006:0756b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘大集地藏十輪經卷第六",
        "translation": "Dasheng daji dizang shilun jing, vol. 6",
        "source": "T13n0411_006:0756b17_0",
        "is_bad_quality": false
    }
]