[
    {
        "source_sentence": "大方等大集經卷第二十八",
        "translation": "Dafangdengdaji jing, vol. 28",
        "source": "T13n0397_028:0192a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋涼州沙門智嚴共寶雲譯",
        "translation": "Song Dynasty Liangzhou Śrīgupta Zhigyan co-translated by Baoyun",
        "source": "T13n0397_028:0192a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無盡意菩薩品第十二之二",
        "translation": "The Twelfth and Second Stages of the Bodhisattva Chapter of the Endless Mind",
        "source": "T13n0397_028:0192a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎爾時，舍利弗語無盡意言：「善哉，善哉！",
        "translation": "Śāriputra then spoke to Bṛhatphala, saying, \"Good, good!",
        "source": "T13n0397_028:0192a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯，善男子！",
        "translation": "Yes, good sons!",
        "source": "T13n0397_028:0192a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已快說菩薩羼提波羅蜜而不可盡。",
        "translation": "You've already quickly explained the inexhaustible perfection of bodhisattva kṣatriya.",
        "source": "T13n0397_028:0192a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願仁者，當說菩薩毘梨耶波羅蜜，如諸菩薩所得無盡毘梨耶波羅蜜。」",
        "translation": "Please, sir, explain the bodhisattva vīrya-pāramitā as the inexhaustible vīrya-pāramitā that bodhisattvas attain.\"",
        "source": "T13n0397_028:0192a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無盡意言：「唯，舍利弗！",
        "translation": "Mūlasarvâstivāda said, \"Yes, Śāriputra!",
        "source": "T13n0397_028:0192a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩具足八事，修行精進而不可盡。",
        "translation": "Bodhisattvas are fully equipped with eight things, and their cultivation and effort are inexhaustible.",
        "source": "T13n0397_028:0192a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T13n0397_028:0192b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發大莊嚴而無有盡，積集勇進而不可盡，修行諸善而不可盡，教化眾生而不可盡，助道功德而不可盡，助無上智而不可盡，助無上慧而不可盡，集助佛法而不可盡。",
        "translation": "There's no end to the great adornment that arises, no end to the courage and effort that's accumulated, no end to the cultivation of goodness, no end to the teaching of sentient beings, no end to the merits that aid the path, no end to the assistance of unsurpassed knowledge, no end to the assistance of unsurpassed wisdom, and no end to the collection of assistance to the Buddha's teaching.",
        "source": "T13n0397_028:0192b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩莊嚴無盡？",
        "translation": "\"How is a bodhisattva's adornment inexhaustible?",
        "source": "T13n0397_028:0192b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸生死心不疲倦，不計劫數當成佛道，若干劫在而作莊嚴，若干劫在不作莊嚴，菩薩莊嚴所經劫數不可稱計。",
        "translation": "Their minds aren't weary of birth-and-death, and they don't count the number of eons before they achieve the Buddhahood, the number of eons during which they adorn themselves, or the number of eons during which they don't adorn themselves, and the number of eons during which the bodhisattva adorns himself is incalculable.",
        "source": "T13n0397_028:0192b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如從今日至生死，本為一日一夜，如是三十日為一月，十二月為一歲，於是百千萬歲，一發道心一見如來，如是發心，所見諸佛如恒沙數。",
        "translation": "From today until birth and death, which used to be one day and one night, thus 30 days becomes one month, 12 months becomes one year, and so on for a hundred million years, once they arouse the aspiration for enlightenment, they'll see the Tathāgata once and thus arouse their aspiration, the buddhas they've seen are as numerous as the sands of the Ganges.",
        "source": "T13n0397_028:0192b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於爾所佛邊，方得知一眾生心行，如是遍知一切眾生心之所行猶不退沒，是則名曰不懈莊嚴無盡莊嚴。",
        "translation": "Only then, at the buddha's edge, does he learn the mind and actions of a single sentient being, and thus he fully knows the mind and actions of all sentient beings without ever fading back, which is called unremitting adornment and inexhaustible adornment.",
        "source": "T13n0397_028:0192b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經於如是見佛發心，知他眾生心所行時，常修具足檀波羅蜜、尸波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，修集一切助菩提法。",
        "translation": "When he thus sees the Buddha's arousal of mind and knows the mental actions of other sentient beings, he always cultivates the perfection of the perfection of donations, the perfection of morality, the perfection of kṣatriya, the perfection of vaiśeṣya, the perfection of meditation, and the perfection of prajñā, and he cultivates all the factors that aid in awakening.",
        "source": "T13n0397_028:0192b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具修相好、十力、無畏、不共之法，具修一切諸佛法故，是名不懈莊嚴無盡莊嚴。",
        "translation": "Being fully cultivated in the attributes, ten powers, fearlessness, and unique qualities, and being fully cultivated in all the buddha-teachings, this is called unremitting adornment and inexhaustible adornment.",
        "source": "T13n0397_028:0192b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩聞作是說，不驚不怖不畏，當知是菩薩不懈精進，是名菩薩莊嚴無盡。",
        "translation": "If a bodhisattva hears this teaching and isn't frightened or intimidated, you should know that this is a bodhisattva who makes unremitting effort, and this is called a bodhisattva whose adornment is inexhaustible.",
        "source": "T13n0397_028:0192b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩勇進無盡？",
        "translation": "\"How is the bodhisattva's bold effort inexhaustible?",
        "source": "T13n0397_028:0192b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界滿中盛火，為見佛故，要當從是火中而過。",
        "translation": "\"If the 3,000 great one-thousand worlds are filled with fire, then in order to see the Buddha, you must pass through that fire.",
        "source": "T13n0397_028:0192b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為聞法、教化眾生、安止眾生於善法故，亦應如是從火中過，是名菩薩勇進無盡。",
        "translation": "If they were to pass through that fire for the sake of hearing the Dharma, teaching sentient beings, and calming sentient beings in the good Dharma, this would be called a bodhisattva's courageous effort that knows no limit.",
        "source": "T13n0397_028:0192b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣故，名曰勇進？",
        "translation": "What are the causes and conditions that give rise to this expression courageous advancement?",
        "source": "T13n0397_028:0192b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常為他故，為靜他故，為調伏他故，為滅盡他故，常不懈慢堅牢不退，心善安止於大悲中，常勤精進而為眾生，故名勇進。",
        "translation": "Being always for the sake of others, for the sake of calming others, for the sake of disciplining others, and for the sake of ending others, always not being lazy or arrogant, resolute and nonretrogressing, with his mind well anchored in great compassion, and always diligently exerting himself for the sake of sentient beings, this is called courageous advancement.",
        "source": "T13n0397_028:0192b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩行時，步步御心悉向菩提，常觀眾生為化度故，雖作是觀不起煩惱，是名菩薩勇進無盡。",
        "translation": "When a bodhisattva practices, he directs every step of his mind toward enlightenment, always observes sentient beings in order to save them, and although he does so, he doesn't become afflicted; this is called the bodhisattva's courageous advancement that has no limit.",
        "source": "T13n0397_028:0192b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩修習無盡？",
        "translation": "\"How does a bodhisattva's cultivation know no limit?",
        "source": "T13n0397_028:0192c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如所發起一切善心，常願菩提，是名菩薩修集無盡。",
        "translation": "This is called a bodhisattva who cultivates and collects endlessly all good intentions as they are arisen and always wishes for bodhi.",
        "source": "T13n0397_028:0192c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_028:0192c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸善根迴向阿耨多羅三藐三菩提，初無盡故。",
        "translation": "Because these good roots are directed toward supreme perfect enlightenment, there's no end to them in the beginning.",
        "source": "T13n0397_028:0192c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0192c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如天雨，一渧之水墮大海中，其渧雖微終無滅盡。",
        "translation": "It's like a drop of water that falls into the ocean when it rains from the sky, even though the drop is tiny and never ends.",
        "source": "T13n0397_028:0192c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩善根願向菩提，亦復如是無有滅盡。",
        "translation": "So too, the bodhisattva's good roots that aspire to enlightenment will never cease.",
        "source": "T13n0397_028:0192c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修集善根者，所謂正迴向修集善根，為護眾生修集善根，為隨眾生諸所須故修集善根，為欲成就一切智故修集善根，是名菩薩修集無盡。",
        "translation": "Cultivating the good roots that are called cultivating the good roots of right dedication, cultivating the good roots of protecting sentient beings, cultivating the good roots of following the needs of sentient beings, and cultivating the good roots of wanting to achieve omniscience is called the endless cultivation of the good roots by the bodhisattvas.",
        "source": "T13n0397_028:0192c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩教化無盡？",
        "translation": "\"How is a bodhisattva's teaching inexhaustible?",
        "source": "T13n0397_028:0192c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生之性不可稱計，菩薩於中不應稱計。",
        "translation": "The nature of sentient beings is incalculable, and bodhisattvas shouldn't be able to calculate it.",
        "source": "T13n0397_028:0192c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言一日教化三千大千世界滿中眾生，如是計數乃至無量不可思議不可稱劫教化眾生者，雖作如是教化眾生，不可稱計不可思議，於眾生分猶未是教化百分千分百千分百千萬分，乃至算數譬喻所知眾生。",
        "translation": "If someone says that in one day they teach and transform 3,000 great thousand worlds full of sentient beings, or that they teach and transform sentient beings for an unfathomable, unfathomable, and immeasurable number of eons, even though they teach and transform sentient beings in this way, which is indescribable and unfathomable, they still haven't taught and transformed a hundred thousand parts, one hundred thousand parts, one hundred thousand million parts, or even known sentient beings by counting metaphors.",
        "source": "T13n0397_028:0192c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_028:0192c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是眾生性無量無邊，不可稱計、不可思議。",
        "translation": "\"The nature of these sentient beings is immeasurable and limitless, and it's indescribable and unfathomable.",
        "source": "T13n0397_028:0192c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩聞作是說，不驚不怖不畏，當知是菩薩勤修精進，是名菩薩教化無盡。",
        "translation": "If a bodhisattva hears this teaching and isn't frightened or intimidated, you should know that this is a bodhisattva who diligently cultivates and undertakes effort, and this is called a bodhisattva whose teaching is inexhaustible.",
        "source": "T13n0397_028:0192c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩助道無盡？",
        "translation": "\"How is the bodhisattva's assistance to the path inexhaustible?",
        "source": "T13n0397_028:0192c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所修助道功德無量無邊，菩薩於中不應限量。",
        "translation": "The merits of the paths that bodhisattvas cultivate as an aid are limitless and unlimited, and bodhisattvas shouldn't limit them there.",
        "source": "T13n0397_028:0192c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_028:0192c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生所有功德，若去來、現在，及聲聞緣覺所有功德，於佛世尊始是成就一毛孔功德。",
        "translation": "\"Regarding the merits of all sentient beings, whether past, future, present, or śrāvakas and pratyekbuddhas, this is the first time the Bhagavān has accomplished the merit of a single pore.",
        "source": "T13n0397_028:0192c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一一毛孔所有功德，乃至一切毛孔功德，聚集成就始成如來一隨形好。",
        "translation": "Thus, the merits of each pore and even the merits of all pores are gathered together to form the Tathāgata's single, conforming goodness.",
        "source": "T13n0397_028:0192c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一一隨形好等，乃至一切隨形好功德，聚集成就如是成就如來一相。",
        "translation": "Thus, the merits of each one of these minor marks and so forth, up to the merits of all minor marks, are gathered together to achieve the Tathāgata's single mark.",
        "source": "T13n0397_028:0192c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一一相至三十相，聚集如是三十相百倍功德，始成如來眉間毫相。",
        "translation": "Thus, from the one characteristic to the 30 characteristics, they gather a hundred times the merit of these 30 characteristics, and then the Tathāgata's tuft of hair between the eyebrows is formed.",
        "source": "T13n0397_028:0192c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至修集倍是毫相百千功德，始成如來無見頂相。",
        "translation": "It's until he cultivates the virtue of gathering a hundred times that amount of hairline features a thousand times over that amount of virtue that he'll achieve the Tathāgata's top-of-the-brow invisible feature.",
        "source": "T13n0397_028:0192c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩助道功德無盡。",
        "translation": "This is called the endless merit of the bodhisattva's auxiliary path.",
        "source": "T13n0397_028:0192c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩助智無盡？",
        "translation": "\"How is the bodhisattva's supportive wisdom inexhaustible?",
        "source": "T13n0397_028:0193a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所修助智無量無邊，菩薩於中不應限數。",
        "translation": "The wisdom that bodhisattvas cultivate as an aid is measureless and limitless, and bodhisattvas shouldn't limit the number of them.",
        "source": "T13n0397_028:0193a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生，如一信行所成就智，如是信行，比一法行所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000 great one-thousand worlds thus attain knowledge by the practice of faith, such practice of faith is compared to the knowledge attained by the practice of one teaching, which is 100,000 parts out of 100,000 parts out of 100,000,000,000,000,000,000,000 parts, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界眾生悉為法行，比一八人所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000 great one-thousand worlds practice the Dharma, it's 1,000 parts per hundred thousand, 1,000 parts per hundred million, or even beyond the reach of mathematical metaphors, compared to the knowledge attained by one of the eight people.",
        "source": "T13n0397_028:0193a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為八人智，比一須陀洹所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds are eight persons in wisdom, it's 1,000 parts in 100,000 parts in 10,000,000,000 parts compared to the wisdom attained by a single stream entrant, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為須陀洹智，比一斯陀含所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds are knowledgeable as streamers, that knowledge accomplished by one streamer is 1,000 parts in 100,000 parts in 10,000,000,000 parts, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為斯陀含智，比一阿那含所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds are once again full of the knowledge of the once-returner, that knowledge is 1,000 parts in 100,000 parts in 100,000,000,000,000 parts compared to the knowledge attained by one nonreturner, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為阿那含智，比一阿羅漢所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds are arhat-knowledge, it's 1,000 parts per hundred thousand, 1,000 parts per hundred million than the knowledge attained by a single arhat, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生，悉為阿羅漢智，比一緣覺所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds are arhat-wise, that's 1,000 parts per hundred thousand, 1,000 parts per million compared to the wisdom attained by a single pratyekabuddha, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生，悉成緣覺智，比一百劫菩薩所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds have become pratyekabuddha-wise, that's 1,000 parts in 100,000 parts in 100,000,000 million parts more than the wisdom attained by a bodhisattva in a hundred eons, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為百劫菩薩所成就智，比一得忍菩薩所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds have become bodhisattvas' accomplished wisdom for a hundred eons, that's 1,000 parts per hundred thousand parts per hundred thousand million parts compared to the bodhisattvas' accomplished wisdom for one attainment of forbearance, which is beyond the reach of even arithmetic metaphors.",
        "source": "T13n0397_028:0193a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為得忍菩薩所成就智，比一不退菩薩所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000,000 worlds are all endowed with the knowledge accomplished by the bodhisattva who attains forbearance, it's 1,000 parts per hundred thousand thousand parts per hundred thousand million parts compared to the knowledge accomplished by the bodhisattva who doesn't regress, even beyond the reach of mathematical metaphors.",
        "source": "T13n0397_028:0193a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉得不退菩薩智，比一補處菩薩所成就智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the 3,000 great one-thousand worlds have attained the nonretrogressing bodhisattva's knowledge, it's 1,000 parts per hundred thousand million compared to the knowledge attained by the bodhisattva of one remedial position, which is beyond the reach of even arithmetic metaphors.",
        "source": "T13n0397_028:0193b01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無量無邊世界眾生悉如補處所成就智，比一如來是處非處智，百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "If all the sentient beings in the measureless and infinite world have attained the wisdom accomplished by the bodhisattva in the complementary place, it's 1,000 parts in 100,000 parts in 100,000,000,000,000 parts compared to the knowledge of what the Tathāgata is and isn't, which is beyond the reach of even an arithmetic metaphor.",
        "source": "T13n0397_028:0193b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總說如來諸力、無畏、不共之法，亦復如是。",
        "translation": "The same goes for the Tathāgata's powers, fearlessness, and unique qualities when explained in general.",
        "source": "T13n0397_028:0193b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩聞作是說，不驚不怖不畏，當知是菩薩勤行精進。",
        "translation": "If a bodhisattva hears this teaching and isn't frightened or intimidated, you should know that the bodhisattva is diligently exerting himself.",
        "source": "T13n0397_028:0193b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩助智無盡。",
        "translation": "This is called the bodhisattva's aid to wisdom that has no limit.",
        "source": "T13n0397_028:0193b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩助慧無盡？",
        "translation": "\"How is a bodhisattva's supportive wisdom inexhaustible?",
        "source": "T13n0397_028:0193b10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生所有心行不可窮盡，菩薩於中不應計數。",
        "translation": "The mental functions of all sentient beings are inexhaustible, and a bodhisattva shouldn't count them.",
        "source": "T13n0397_028:0193b10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過去未來現在眾生所有心行，若有人於一念中具如是等三世眾生所有心行，如是念念皆亦如是具諸心行。",
        "translation": "If there are mental functions in the minds of sentient beings in the past, future, and present, and if there's someone who possesses these mental functions in the minds of sentient beings in the three worlds in a single thought, then this is how they'll possess mental functions in each recitation.",
        "source": "T13n0397_028:0193b11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一人心中所具心行，一切無量無邊眾生皆亦如是。",
        "translation": "As the mental conduct that exists in one person's mind, so do all sentient beings of measureless and limitless variety.",
        "source": "T13n0397_028:0193b14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過去未來現在眾生，所有貪婬瞋恚愚癡及諸煩惱，若有一人於一念中具如是等三世眾生所有煩惱，如是念念皆亦如是具諸煩惱無量無邊。",
        "translation": "If there are sentient beings in the past, future, and present who have craving, lust, anger, folly, and other afflictions, and if one person possesses in a single thought the afflictions of sentient beings in these three worlds, thus each recitation is likewise imbued with afflictions that are measureless and limitless.",
        "source": "T13n0397_028:0193b15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一人心中所具諸結，一切無量無邊眾生皆亦如是。",
        "translation": "If a single person's mind is riddled with the bonds, so are all sentient beings of measureless and unlimited duration.",
        "source": "T13n0397_028:0193b18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於中生慧光明，一念慧光無諸塵翳，悉照過去未來現在眾生煩惱諸心所緣境界生住滅相無有遺餘，是菩薩於諸眾生三世相應諸煩惱等無不盡知。",
        "translation": "When the bodhisattva produces the light of wisdom in this, that single moment of wisdom has no dust or obscuration and completely illuminates the past, future, and present sentient beings' afflictions, the objects of the mind, and the marks of arising, abiding, and ceasing without remainder, the bodhisattva has an inexhaustible knowledge of the afflictions and so forth that are associated with the three times of sentient beings.",
        "source": "T13n0397_028:0193b20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0193b23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空無所不覆，菩薩慧光亦復如是無所不照。",
        "translation": "Just as space is uncovered, so too is the light of a bodhisattva's wisdom unilluminating.",
        "source": "T13n0397_028:0193b23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩聞作是說，不驚不怖不畏，當知是菩薩勤行精進。",
        "translation": "If a bodhisattva hears this teaching and isn't frightened or intimidated, you should know that this is a bodhisattva who diligently undertakes exertion.",
        "source": "T13n0397_028:0193b25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩助慧無盡。",
        "translation": "This is called the endlessness of a bodhisattva's auxiliary wisdom.",
        "source": "T13n0397_028:0193b26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩修集助佛法無盡？",
        "translation": "\"How is a bodhisattva's cultivation of the collection of auxiliary buddha-teachings inexhaustible?",
        "source": "T13n0397_028:0193b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所行修助佛法無量無邊。",
        "translation": "The bodhisattvas' practice of cultivating the auxiliary buddha-teachings is measureless and limitless.",
        "source": "T13n0397_028:0193b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩於中不應限量，從初發心至坐道場，於其中間，修行具足六波羅蜜，修行具足諸助道法。",
        "translation": "If there's no limit to the number of times a bodhisattva cultivates the full six perfections from the time he first arouses his intention until he sits on the path, he cultivates the full range of things that aid the path.",
        "source": "T13n0397_028:0193b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切發心修行一切善根，不可稱計悉助佛法，是名菩薩修助佛法而無有盡。",
        "translation": "Thus, the cultivation of all good roots in all aspirations is an incalculable aid to the Buddha-dharma, which is called a bodhisattva's cultivation of the auxiliary Buddha-dharma that has no limit.",
        "source": "T13n0397_028:0193c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩八事修行精進無盡。",
        "translation": "This is called a bodhisattva's eightfold cultivation of effort that has no limit.",
        "source": "T13n0397_028:0193c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T13n0397_028:0193c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩精進亦不可盡。",
        "translation": "A bodhisattva's effort also can't be exhausted.",
        "source": "T13n0397_028:0193c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身善業、若口善業、若意善業常勤不住。",
        "translation": "If there's good physical action, good verbal action, or good mental action, it's always diligent and uninterrupted.",
        "source": "T13n0397_028:0193c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_028:0193c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所作精進，常與身口意相應。",
        "translation": "The effort that bodhisattvas make is always associated with body, speech, and mind.",
        "source": "T13n0397_028:0193c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖身口精進皆由於心，心為增上。",
        "translation": "Although physical and verbal exertion all come from the mind, the mind is the superior one.",
        "source": "T13n0397_028:0193c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩心精進耶？",
        "translation": "\"How is the bodhisattva's mental exertion?",
        "source": "T13n0397_028:0193c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂心始心終。",
        "translation": "It's called the beginning of the mind and the end of the mind.",
        "source": "T13n0397_028:0193c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初發心故；云何心終？",
        "translation": "It's because of the first arousal of the intention; what is the end of the intention?",
        "source": "T13n0397_028:0193c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提心寂滅故。",
        "translation": "\"It's because the mind of enlightenment is tranquil.",
        "source": "T13n0397_028:0193c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸眾生起大悲故；云何心終？",
        "translation": "Because of the great compassion that arises for all sentient beings, what is the end of the mind?",
        "source": "T13n0397_028:0193c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無我人故。",
        "translation": "It's because there's no self or person.",
        "source": "T13n0397_028:0193c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝眾生故；云何心終？",
        "translation": "What is the end of the mind that brings in sentient beings?",
        "source": "T13n0397_028:0193c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不取諸法故。",
        "translation": "It's because they don't grasp all dharmas.",
        "source": "T13n0397_028:0193c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不厭生死故；云何心終？",
        "translation": "What is the end of the mind because it's not disillusioned with birth and death?",
        "source": "T13n0397_028:0193c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無三界故。",
        "translation": "It's because there are no three realms.",
        "source": "T13n0397_028:0193c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨所有故；云何心終？",
        "translation": "\"What is the end of the mind because it is free from possessions?",
        "source": "T13n0397_028:0193c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所輕故。",
        "translation": "There's nothing to take lightly.",
        "source": "T13n0397_028:0193c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受持戒故；云何心終？",
        "translation": "What is the end of the mind because of the observance of the precepts?",
        "source": "T13n0397_028:0193c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不持戒故。",
        "translation": "It's because they don't observe the precepts.",
        "source": "T13n0397_028:0193c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行忍故；云何心終？",
        "translation": "It's because of the cultivation of forbearance; what is the end of the mind?",
        "source": "T13n0397_028:0193c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忿諍故。",
        "translation": "It's because there's no anger and dispute.",
        "source": "T13n0397_028:0193c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發行諸善故；云何心終？",
        "translation": "\"What is the end of the mind, because of the distribution of goodness?",
        "source": "T13n0397_028:0193c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨不雜故。",
        "translation": "It's because it's independent and unadulterated.",
        "source": "T13n0397_028:0193c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修集定故；云何心終？",
        "translation": "It's because of the concentration of the cultivation of accumulation; what is the end of the mind?",
        "source": "T13n0397_028:0193c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心清淨故。",
        "translation": "It's because the mind is purified.",
        "source": "T13n0397_028:0193c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多聞無厭故；云何心終？",
        "translation": "Because they have heard much and never tire of it, what is the end of the mind?",
        "source": "T13n0397_028:0193c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思惟故。",
        "translation": "It's because it's well-considered.",
        "source": "T13n0397_028:0193c19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "習問義故；云何心終？",
        "translation": "Because of the meaning of habitual questioning, what is the end of the mind?",
        "source": "T13n0397_028:0193c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法無言說故。",
        "translation": "It's because the teaching is inexpressible.",
        "source": "T13n0397_028:0193c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求智慧故；云何心終？",
        "translation": "What is the end of the mind that seeks wisdom?",
        "source": "T13n0397_028:0193c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷戲論故。",
        "translation": "It's because it stops conceptual proliferation.",
        "source": "T13n0397_028:0193c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修四梵行故；云何心終？",
        "translation": "What is the end of the mind because of the cultivation of the four pure practices?",
        "source": "T13n0397_028:0193c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨真智故。",
        "translation": "It's because they abandon true cognition.",
        "source": "T13n0397_028:0193c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具五通故；云何心終？",
        "translation": "Because they possess the five supernormal powers, what is the end of the mind?",
        "source": "T13n0397_028:0193c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具漏盡故。",
        "translation": "It's because the contaminants have ended.",
        "source": "T13n0397_028:0193c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發念處故；云何心終？",
        "translation": "What is the end of mind because of the mindfulness of the arousal of mindfulness?",
        "source": "T13n0397_028:0193c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念無思惟故。",
        "translation": "\"It's because of mindfulness and inconceivability.",
        "source": "T13n0397_028:0193c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of mind?",
        "source": "T13n0397_028:0193c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發正勤故；云何心終？",
        "translation": "What is the end of the mind because of the arousal of right effort?",
        "source": "T13n0397_028:0193c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脫善不善故。",
        "translation": "It's because they're liberating good and unwholesome.",
        "source": "T13n0397_028:0193c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發如意分故；云何心終？",
        "translation": "What is the end of the mind that gives rise to the aspect of thusness?",
        "source": "T13n0397_028:0193c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具報得故。",
        "translation": "It's because it's fully rewarding.",
        "source": "T13n0397_028:0193c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發諸根方便故；云何心終？",
        "translation": "It's because of the skillful means of producing the faculties; what is the end of the mind?",
        "source": "T13n0397_028:0193c27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀諸根法故。",
        "translation": "\"It's because they contemplate the faculties and dharmas.",
        "source": "T13n0397_028:0193c28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集諸力故；云何心終？",
        "translation": "It's because of the power of accumulation; what is the end of the mind?",
        "source": "T13n0397_028:0193c28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智不壞故。",
        "translation": "It's because cognition doesn't break down.",
        "source": "T13n0397_028:0193c29_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0193c29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發助菩提分故；云何心終？",
        "translation": "\"What is the end of the mind that arouses the factors of enlightenment?",
        "source": "T13n0397_028:0193c29_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知分別諸學方便故。",
        "translation": "It's because they well know how to discern the methods of training.",
        "source": "T13n0397_028:0194a01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求助道法故；云何心終？",
        "translation": "\"What is the end of the mind that seeks to help in the path?",
        "source": "T13n0397_028:0194a02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無進趣故。",
        "translation": "It's because there's no further entry.",
        "source": "T13n0397_028:0194a02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求寂滅故；云何心終？",
        "translation": "\"What is the end of the mind because of the search for extinction?",
        "source": "T13n0397_028:0194a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心永寂滅故。",
        "translation": "It's because the mind is permanently quiescent.",
        "source": "T13n0397_028:0194a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發起慧故；云何心終？",
        "translation": "It's because of the insight that arises; what is the end of the mind?",
        "source": "T13n0397_028:0194a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知法故。",
        "translation": "It's because they well understand the teaching.",
        "source": "T13n0397_028:0194a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覺知因故；云何心終？",
        "translation": "\"He perceives the cause; what is the end of his mind?",
        "source": "T13n0397_028:0194a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知因故。",
        "translation": "It's because they well understand the cause.",
        "source": "T13n0397_028:0194a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從他聞故；云何心終？",
        "translation": "Because they heard it from others, how did their minds end?",
        "source": "T13n0397_028:0194a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸法中無放逸故。",
        "translation": "It's because there's no dissipation in any dharma.",
        "source": "T13n0397_028:0194a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發嚴飾故；云何心終？",
        "translation": "What is the end of the mind because it is adorned?",
        "source": "T13n0397_028:0194a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知身性故。",
        "translation": "\"It's because they know the nature of the body.",
        "source": "T13n0397_028:0194a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莊嚴口故；云何心終？",
        "translation": "What is the end of the mind because of the adorned mouth?",
        "source": "T13n0397_028:0194a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖默然故。",
        "translation": "It's because the noble ones are silent.",
        "source": "T13n0397_028:0194a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行三脫故；云何心終？",
        "translation": "\"What is the end of the mind because of the practice of the three liberations?",
        "source": "T13n0397_028:0194a09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所作故。",
        "translation": "It's because there's nothing to do.",
        "source": "T13n0397_028:0194a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "降四魔故；云何心終？",
        "translation": "What is the end of the mind that subdues the four Māras?",
        "source": "T13n0397_028:0194a10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨結習故。",
        "translation": "It's because they're free of bondage and accumulation.",
        "source": "T13n0397_028:0194a11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the mind's beginning?",
        "source": "T13n0397_028:0194a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知方便故；云何心終？",
        "translation": "\"What is the end of the mind because of the knowledge of skillful means?",
        "source": "T13n0397_028:0194a11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了於慧故。",
        "translation": "It's because he understands it through wisdom.",
        "source": "T13n0397_028:0194a12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知發故；云何心終？",
        "translation": "What is the end of the mind because it is well understood and developed?",
        "source": "T13n0397_028:0194a12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知度故。",
        "translation": "It's because they well know how to measure up.",
        "source": "T13n0397_028:0194a13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What is the beginning of the mind?",
        "source": "T13n0397_028:0194a13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知世俗故；云何心終？",
        "translation": "What is the end of the mind because of knowledge of the conventional?",
        "source": "T13n0397_028:0194a13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知真諦故。",
        "translation": "It's because he well knows the true truth.",
        "source": "T13n0397_028:0194a14_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩心精進也。",
        "translation": "This is called the bodhisattva's mental exertion.",
        "source": "T13n0397_028:0194a14_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心具足精進無盡故說始終。",
        "translation": "This mind is fully energetic and inexhaustible, so it's said to be complete.",
        "source": "T13n0397_028:0194a14_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩具足如是作相，而心未常住於作業，是菩薩於諸業相知而故作。",
        "translation": "When a bodhisattva is fully equipped with the marks of such activity but his mind doesn't always abide in the activity, the bodhisattva knows the marks of actions and does them as a result.",
        "source": "T13n0397_028:0194a15_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩知而故作？",
        "translation": "How does a bodhisattva knowingly and deliberately do so?",
        "source": "T13n0397_028:0194a17_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸善根故。",
        "translation": "For the sake of the good roots, it's because of them that they cultivate great compassion.",
        "source": "T13n0397_028:0194a17_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸眾生修大悲故不離有為，為一切佛真妙智故不隨生死，是名菩薩摩訶薩毘梨耶波羅蜜而不可盡。」",
        "translation": "Not parting from existential activity because sentient beings cultivate great compassion, and not following birth and death because of the true and marvelous wisdom of all buddhas, this is called the inexhaustible bodhisattva-mahāsattva vīrya-pāramitā.\"",
        "source": "T13n0397_028:0194a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是法時，七十那由他諸天及人發阿耨多羅三藐三菩提心，三萬二千菩薩摩訶薩得無生法忍。",
        "translation": "When this teaching was given, seventy nayutas and humans aroused the mind of unsurpassed, correct enlightenment, and thirty-two thousand bodhisattvas and mahāsattvas attained the forbearance of the nonarising of the Dharma.",
        "source": "T13n0397_028:0194a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎爾時，舍利弗語無盡意言：「善哉，善哉！",
        "translation": "At that point, Śāriputra said to Maitreya, \"Good, good!",
        "source": "T13n0397_028:0194a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯，善男子！",
        "translation": "Yes, good sons!",
        "source": "T13n0397_028:0194a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁已快說菩薩毘梨耶波羅蜜而不可盡。",
        "translation": "You have quickly explained the inexhaustible perfection of bodhisattva meditation.",
        "source": "T13n0397_028:0194a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願仁者，當說菩薩禪波羅蜜，如諸菩薩所得無盡禪波羅蜜。」",
        "translation": "Please let him explain the perfection of bodhisattva meditation as the inexhaustible perfection of meditation attained by bodhisattvas.\"",
        "source": "T13n0397_028:0194a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無盡意言：「若菩薩摩訶薩以十六事修行禪定而無有盡，不與聲聞辟支佛共。",
        "translation": "Mukherjee said, \"If a bodhisattva Mahāsattva cultivates meditation in 16 ways that have no limit, they aren't shared by śrāvakas and pratyekabuddhas.",
        "source": "T13n0397_028:0194a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十六？",
        "translation": "What are the sixteen?",
        "source": "T13n0397_028:0194a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩修定無有吾我，具足如來諸禪定故；菩薩修定不味不著，不求己樂故；菩薩修定行於大悲，斷諸眾生煩惱結故；菩薩修定增益諸禪觀，見欲界諸過患故；菩薩修定具諸通業，為知眾生諸心行故；菩薩修定其心柔軟，於眾生中得自在故；菩薩修定諸禪三昧善知入出，過於色界無色界故；菩薩修定其心寂滅，勝於二乘諸禪三昧故；菩薩修定更無有發，畢竟已作故；菩薩修定無諸衰耗，善斷除滅諸習氣故；菩薩修定常入智慧，過諸世間到彼岸故；菩薩修定為知眾生心，度脫一切諸眾生故；菩薩修定不斷三寶種，具足無盡諸禪定故；菩薩修定無有退失，其心常定無諸錯謬故；菩薩修定而得自在，具足一切諸善法故；菩薩修定內善思惟，斷入出息得勝智故。",
        "translation": "菩薩修定無有吾我，具足如來諸禪定故；菩薩修定不味不著，不求己樂故；菩薩修定行於大悲，斷諸眾生煩惱結故；菩薩修定增益諸禪觀，見欲界諸過患故；菩薩修定具諸通業，為知眾生諸心行故；菩薩修定其心柔軟，於眾生中得自在故；菩薩修定諸禪三昧善知入出，過於色界無色界故；菩薩修定其心寂滅，勝於二乘諸禪三昧故；菩薩修定更無有發，畢竟已作故；菩薩修定無諸衰耗，善斷除滅諸習氣故；菩薩修定常入智慧，過諸世間到彼岸故；菩薩修定為知眾生心，度脫一切諸眾生故；菩薩修定不斷三寶種，具足無盡諸禪定故；菩薩修定無有退失，其心常定無諸錯謬故；菩薩修定而得自在，具足一切諸善法故；菩薩修定內善思惟，斷入出息得勝智故。",
        "source": "T13n0397_028:0194a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0194b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩以十六事修行禪定而無有盡，不與聲聞辟支佛共。",
        "translation": "This is called a bodhisattva who cultivates meditation with 16 practices that have no limit and aren't shared by śrāvakas and pratyekbuddhas.",
        "source": "T13n0397_028:0194b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名為菩薩修定，具諸通智故？",
        "translation": "\"What is called a bodhisattva's cultivation of meditation that's endowed with knowledge of all faculties?",
        "source": "T13n0397_028:0194b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為通？",
        "translation": "What is supernormal ability?",
        "source": "T13n0397_028:0194b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為智？",
        "translation": "What is cognition?",
        "source": "T13n0397_028:0194b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見諸色相是名為通，若知一切色盡法性而不證盡是名為智。",
        "translation": "If someone sees the characteristics of form, this is called supernormal ability, and if they know the full Dharma nature of all form and don't realize its fullness, this is called wisdom.",
        "source": "T13n0397_028:0194b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞音聲是名為通，解了三世一切音聲無言辭相是名為智。",
        "translation": "If someone hears sounds, this is called supernormal, and if they understand the wordlessness of all sounds in the three worlds, this is called cognition.",
        "source": "T13n0397_028:0194b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知一切眾生心行是名為通，若知心行悉皆滅盡不證於滅是名為智。",
        "translation": "If someone knows the mental functions of all sentient beings, this is called supernormal knowledge, and if they know that all mental functions cease and don't realize their cessation, this is called cognition.",
        "source": "T13n0397_028:0194b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若念過去是名為通，若知三世無有罣礙是名為智。",
        "translation": "If he's mindful of the past, this is called penetration, and if he knows that the three worlds are unobstructed, this is called wisdom.",
        "source": "T13n0397_028:0194b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能遍至諸佛世界是名為通，若知佛界同虛空相是名為智。",
        "translation": "If he can reach all the buddha-realms, this is called penetration, and if he knows that the buddha-realms are the same as the characteristics of space, this is called wisdom.",
        "source": "T13n0397_028:0194b23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若求諸法無破壞相是名為通，若不見法是名為智。",
        "translation": "It's called supernormal ability if one seeks the nondestructive characteristics of dharmas, and it's called wisdom if one doesn't see dharmas.",
        "source": "T13n0397_028:0194b24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不壞世間是名為通，若不雜行是名為智。",
        "translation": "If they don't destroy the world, this is called supernormal ability, and if they don't practice in a mixed way, this is called wisdom.",
        "source": "T13n0397_028:0194b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過梵釋護世天王是名為通，過於二乘學無學智，是名為智。",
        "translation": "If they surpass the Brahmā, Śakra, and Śubha Heavenly Kings, this is called penetration, and if they surpass the two vehicles in their knowledge of training and no training, this is called wisdom.",
        "source": "T13n0397_028:0194b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩修行禪定通智差別。",
        "translation": "This is called the distinction between a bodhisattva's cultivation of meditation, penetration, and wisdom.",
        "source": "T13n0397_028:0194b28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯，舍利弗！",
        "translation": "\"Yes, Śāriputra!",
        "source": "T13n0397_028:0194c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若知一切眾生煩惱亂心，是故修集諸禪定法，助成住心。",
        "translation": "\"If bodhisattvas know that the afflictions of all sentient beings disturb their minds, they therefore cultivate meditation techniques that help them form an abiding mind.",
        "source": "T13n0397_028:0194c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0194c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生煩惱心亂，菩薩於中善修聚集助成禪定，令此禪定住平等心，是名菩薩修行禪定。",
        "translation": "Thus, when the afflicted minds of sentient beings are disturbed, the bodhisattva skillfully cultivates the meditative concentration that's helped to create it, so that this meditative concentration abides in an equal mind, which is called the bodhisattva's cultivation of meditative concentration.",
        "source": "T13n0397_028:0194c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若住眾生平等智中，是名為定。",
        "translation": "\"If they abide in the knowledge that sentient beings are equal, this is called concentration.",
        "source": "T13n0397_028:0194c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心行平等，性相平等、畢竟平等、發行平等，是名為定。",
        "translation": "Equality of mind and action, equality of nature and characteristics, equality of finality, and equality of issuance is called concentration.",
        "source": "T13n0397_028:0194c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住於施戒忍辱精進禪定智慧及諸法等，是名為定。",
        "translation": "Abiding in generosity, morality, forbearance, effort, meditation, wisdom, and the various dharmas is called concentration.",
        "source": "T13n0397_028:0194c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如定等者則眾生等，眾生等者則諸法等，入如是等是名為定。",
        "translation": "Such equality of concentration then equals sentient beings, and such equality of sentient beings then equals all dharmas, and entering such equality is called concentration.",
        "source": "T13n0397_028:0194c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等定則等於空，等於空者則眾生等，眾生等者則諸法等，入如是等是名為定。",
        "translation": "Such-and-such concentration is equated with emptiness, and when it's equated with emptiness, then sentient beings are equated, and when sentient beings are equated, then the dharmas are equated, and entering such-and-such is called concentration.",
        "source": "T13n0397_028:0194c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如空等者則無相等，無相等者則無願等，無願等者則無作等，無作等者則眾生等，眾生等者則諸法等，入如是等是名為定。",
        "translation": "Such equality in emptiness then is absence of equality, absence of equality then is absence of desire, etc., absence of desire, etc., absence of action, etc., sentient beings, etc., and sentient beings, etc., then are dharmas, etc. Entering such equality is called concentration.",
        "source": "T13n0397_028:0194c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自心等故他心亦等，是名為定。",
        "translation": "To realize that because one's own mind is equal, the minds of others are also equal is called concentration.",
        "source": "T13n0397_028:0194c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切等者，所謂利衰如地水火風，得是等心心如虛空，無有高下常住不動，所行威儀常定不轉，本性自爾不恌不高，自在無畏寂默無言，知義知法知時非時，隨世所行不雜於世，捨世八法滅一切結，遠離憒閙樂於獨處。",
        "translation": "Equality of all things is called the benefit and loss that's like earth, water, fire, and wind, and the mind that attains such equality is like space, has no height, always abides, doesn't move, is always composed, doesn't evolve, is inherently unconfused and unhigh, is comfortable and fearless, is silent, knows the meaning and knows the teaching, knows when and when not, follows worldly practices without cluttering the world, abandons the eight worldly dharmas, ends all bonds, and is free from anxiety and happy in solitude.",
        "source": "T13n0397_028:0194c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩如是修行諸法，於諸禪定心安止住離世所作，是菩薩以方便慧入禪波羅蜜，入禪定時生大悲心為諸眾生，是名方便；其心永寂，是名為慧。",
        "translation": "\"When a bodhisattva thus cultivates qualities and abides calmly in the mind in meditation, secluded from worldly activities, this is called the method by which the bodhisattva enters the perfection of meditation with skillful means and wisdom, and when he enters meditation, he produces a mind of great compassion for sentient beings, which is called skillful means, and his mind is permanently still, which is called wisdom.",
        "source": "T13n0397_028:0194c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時念佛，是名方便；不依止禪，是名為慧。",
        "translation": "Being mindful of the Buddha when he enters is called skillful means, and not relying on stilling meditation is called wisdom.",
        "source": "T13n0397_028:0194c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時攝取一切善法，是名方便；不分別法性，是名為慧。",
        "translation": "To gather all good qualities when entering is called skillful means, and not discriminating the nature of dharmas is called wisdom.",
        "source": "T13n0397_028:0194c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時趣向莊嚴佛身，是名方便；於佛法身不生分別，是名為慧。",
        "translation": "Entering with the intention of adorning the Buddha's body is called skillful means, and not discriminating between the Buddha's Dharma body is called wisdom.",
        "source": "T13n0397_028:0194c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時念佛聲如梵音，是名方便；於法性中無言說相，是名為慧。",
        "translation": "This is called skillful means when he's mindful of the Buddha's voice as the voice of Brahmā, and this is called wisdom when there are no marks of verbal expression in the Dharma nature.",
        "source": "T13n0397_028:0194c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時受持心如金剛，是名方便；思惟諸法本性不亂，是名為慧。",
        "translation": "This is called skillful means when he enters, and this is called wisdom when he contemplates that the intrinsic nature of dharmas isn't disturbed.",
        "source": "T13n0397_028:0194c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時不捨本所誓願教化眾生，是名方便；於一切法思惟無我，是名為慧。",
        "translation": "This is called skillful means when he enters and doesn't abandon his original vow to teach sentient beings, and this is called wisdom when he contemplates that all things are without self.",
        "source": "T13n0397_028:0195a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時思惟一切善根，是名方便；思惟善根性無所住，是名為慧。",
        "translation": "This is called skillful means when he enters and contemplates that all good roots are intrinsically unstable, and this is called wisdom when he contemplates that the nature of good roots has no abode.",
        "source": "T13n0397_028:0195a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時遍觀諸佛世界，是名方便；見諸佛界同於虛空，是名為慧。",
        "translation": "This is called skillful means when he enters and completely contemplates the buddha-realms, and this is called wisdom when he sees that the buddha-realms are the same as space.",
        "source": "T13n0397_028:0195a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時莊嚴菩提道場，是名方便；觀所莊嚴同於寂滅，是名為慧。",
        "translation": "This is called skillful means when he enters to adorn the site of the path to enlightenment, and this is called wisdom when he observes that the adornment is the same as extinction.",
        "source": "T13n0397_028:0195a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時欲轉無上法輪，是名方便；思惟法輪無轉不轉，是名為慧。",
        "translation": "This is called skillful means when he wants to turn the unsurpassed wheel of the Dharma upon entry, and this is called wisdom when he contemplates that the wheel of the Dharma is unturned and doesn't turn.",
        "source": "T13n0397_028:0195a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入時一向修助覺分，是名方便；為知眾生諸熱惱心，是故修集如來禪定，知一切法相應不相應有相無相一切相續，隨順菩薩決定思惟，是名為慧。",
        "translation": "This is called the method of knowing the factors that aid awakening when entering, and this is called wisdom to cultivate the tathāgata's meditative concentration in order to know the various states of affliction of sentient beings, to know that the characteristics of all things should be unassociated, that there are characteristics and no characteristics, and that they are continuous, and to follow the bodhisattva's determined contemplation.",
        "source": "T13n0397_028:0195a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩入於禪定方便慧也。",
        "translation": "This is called the bodhisattva's expedient wisdom when entering meditation.",
        "source": "T13n0397_028:0195a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩，禪波羅蜜方便智慧，二事俱行得佛法器，一切諸魔不能破壞。」",
        "translation": "Thus, the bodhisattva's skillful wisdom of meditation and perfection of wisdom in two things at once attains the Buddha's Dharma implements, which all Māra cannot destroy.\"",
        "source": "T13n0397_028:0195a12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是法時，三萬二千菩薩得日燈三昧。",
        "translation": "When this teaching was given, 32,000 bodhisattvas attained the sunlamp samādhi.",
        "source": "T13n0397_028:0195a14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何因緣故名日燈三昧？",
        "translation": "\"What are the reasons why it's called sunlight samādhi?",
        "source": "T13n0397_028:0195a15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日出，燈火月光星宿諸明悉不復現。",
        "translation": "\"It's like when the sun rises, the light from a lamp, the moon, the stars, and the brightness of the constellations all cease to appear.",
        "source": "T13n0397_028:0195a15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩大士得是定已，先所修智一切二乘學與無學，及餘眾生所得諸智，皆亦如是悉不復現，是名日燈三昧。",
        "translation": "After the bodhisattva attains this concentration, the previously cultivated knowledge of all the two vehicles, trainees, and post-trainees, and the knowledge attained by other sentient beings is likewise not reappearing, which is called the concentration of the sun and lamp.",
        "source": "T13n0397_028:0195a16_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩住於禪波羅蜜，即於無量百千種種諸禪三昧而得自在，今於此中當說少分，其名曰：電燈三昧、淨三昧、月光三昧、淨莊嚴三昧、日光三昧、不可思議三昧、勇出三昧、照明三昧、無垢光明三昧、功德光明三昧、一切法中得自在三昧、吉道三昧、無憂三昧、堅稱三昧、勇出如須彌山等三昧、法炬三昧、法健三昧、法尊三昧、自在知一切法三昧、住法聚三昧、總持法淨三昧、隨知他心行三昧、法幢瓔珞三昧、燒一切煩惱三昧、破四魔力三昧、十力聲勇健三昧、無礙斷礙三昧、手燈三昧、施得名聞三昧、持地三昧、住無我如須彌山三昧、勝諸明智三昧、智焰三昧、生慧三昧、修禪三昧、無量自在三昧、心調伏無我無我所成就三昧、水月三昧、日聲三昧、無有高下如佛三昧、離相三昧、如善調象師子遊戲三昧、念佛三昧、念法得智自在無礙三昧、無退不退三昧、不眴三昧、勝淨光無我三昧、空三昧、無相三昧、無願三昧、住心平等三昧、金剛三昧、增上三昧、無能勝三昧、旋三昧、淨聲三昧、善分別三昧、離煩惱三昧、廣大如空三昧、入諸功德三昧、念意進覺三昧、勇慧三昧、辯無盡三昧、語無盡三昧、總持三昧、不忘三昧、善作三昧、觀一切世三昧、善知所樂三昧、生踊躍三昧、勇慈心淨三昧、大悲根本三昧、入喜三昧、捨離三纏三昧、法義三昧、法作三昧、智炬三昧、智海三昧、不波蕩三昧、一切心喜三昧、調伏三昧、解脫智三昧、已自在三昧、法場金剛幢三昧、蓮華三昧、蓮華增上三昧、離世法三昧、不動三昧、慧增上三昧、諸佛所念首楞嚴三昧、無諍三昧、火三昧、火明三昧、解脫勝智三昧、莊嚴佛身三昧、遍照三昧、入眾生心歡喜三昧、順助道三昧、莊嚴諸波羅蜜三昧、寶鬘三昧、與諸覺華三昧、與解脫果三昧、甘露三昧、速疾如風三昧、實際三昧、遮海濤三昧、山相搏三昧、廣大神足三昧、見無量諸佛三昧、聞持三昧、不亂三昧、一念智無量功德海淨三昧，如是等不可計那由他諸三昧，入禪波羅蜜時悉得清淨。",
        "translation": "「菩薩住於禪波羅蜜，即於無量百千種種諸禪三昧而得自在，今於此中當說少分，其名曰：電燈三昧、淨三昧、月光三昧、淨莊嚴三昧、日光三昧、不可思議三昧、勇出三昧、照明三昧、無垢光明三昧、功德光明三昧、一切法中得自在三昧、吉道三昧、無憂三昧、堅稱三昧、勇出如須彌山等三昧、法炬三昧、法健三昧、法尊三昧、自在知一切法三昧、住法聚三昧、總持法淨三昧、隨知他心行三昧、法幢瓔珞三昧、燒一切煩惱三昧、破四魔力三昧、十力聲勇健三昧、無礙斷礙三昧、手燈三昧、施得名聞三昧、持地三昧、住無我如須彌山三昧、勝諸明智三昧、智焰三昧、生慧三昧、修禪三昧、無量自在三昧、心調伏無我無我所成就三昧、水月三昧、日聲三昧、無有高下如佛三昧、離相三昧、如善調象師子遊戲三昧、念佛三昧、念法得智自在無礙三昧、無退不退三昧、不眴三昧、勝淨光無我三昧、空三昧、無相三昧、無願三昧、住心平等三昧、金剛三昧、增上三昧、無能勝三昧、旋三昧、淨聲三昧、善分別三昧、離煩惱三昧、廣大如空三昧、入諸功德三昧、念意進覺三昧、勇慧三昧、辯無盡三昧、語無盡三昧、總持三昧、不忘三昧、善作三昧、觀一切世三昧、善知所樂三昧、生踊躍三昧、勇慈心淨三昧、大悲根本三昧、入喜三昧、捨離三纏三昧、法義三昧、法作三昧、智炬三昧、智海三昧、不波蕩三昧、一切心喜三昧、調伏三昧、解脫智三昧、已自在三昧、法場金剛幢三昧、蓮華三昧、蓮華增上三昧、離世法三昧、不動三昧、慧增上三昧、諸佛所念首楞嚴三昧、無諍三昧、火三昧、火明三昧、解脫勝智三昧、莊嚴佛身三昧、遍照三昧、入眾生心歡喜三昧、順助道三昧、莊嚴諸波羅蜜三昧、寶鬘三昧、與諸覺華三昧、與解脫果三昧、甘露三昧、速疾如風三昧、實際三昧、遮海濤三昧、山相搏三昧、廣大神足三昧、見無量諸佛三昧、聞持三昧、不亂三昧、一念智無量功德海淨三昧，如是等不可計那由他諸三昧，入禪波羅蜜時悉得清淨。",
        "source": "T13n0397_028:0195a19_24",
        "is_bad_quality": true
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0195c01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩修行禪定而不可盡。」",
        "translation": "This is called a bodhisattva who cultivates meditation that's inexhaustible.\"",
        "source": "T13n0397_028:0195c01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利弗語無盡意言：「善哉，善哉！",
        "translation": "At that point, Śāriputra spoke to Inexhaustible Mind, \"Good, good!",
        "source": "T13n0397_028:0195c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_028:0195c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁已快說菩薩禪波羅蜜。",
        "translation": "\"Sir, you've quickly explained the perfection of bodhisattva meditation.",
        "source": "T13n0397_028:0195c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願仁者，當說菩薩般若波羅蜜，如諸菩薩所得無盡般若波羅蜜。",
        "translation": "May it please you, sir, to teach the perfection of bodhisattva meditation as the inexhaustible perfection of bodhisattvas' attainments.",
        "source": "T13n0397_028:0195c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_028:0195c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜，云何行？",
        "translation": "\"What is the practice of the perfection of wisdom?",
        "source": "T13n0397_028:0195c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何入？」",
        "translation": "How do we enter?\"",
        "source": "T13n0397_028:0195c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無盡意言：「唯，舍利弗！",
        "translation": "Mūlasarvâstivāda said, \"Yes, Śāriputra!",
        "source": "T13n0397_028:0195c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜，如聞修行善入思惟。」",
        "translation": "Prajñāpāramitā, as you've heard, cultivates skillful entry into deliberation.\"",
        "source": "T13n0397_028:0195c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「唯，善男子！",
        "translation": "Śāriputra said, \"Yes, good sons!",
        "source": "T13n0397_028:0195c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如聞修行？」",
        "translation": "How do you practice like you've heard?\"",
        "source": "T13n0397_028:0195c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無盡意言：「聞者具八十行。",
        "translation": "Maitreya said, \"A listener has eighty practices.",
        "source": "T13n0397_028:0195c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等八十？",
        "translation": "What are the eighty?",
        "source": "T13n0397_028:0195c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲修行順心行、畢竟心行、常發起行、親近善友行、無憍慢行、不放逸行、恭敬行、隨順教行、從善語行、數往法師所行、至心聽法行、善思惟行、不亂心行、勤進心行、生寶想行、起藥想行、除諸病行、念器行、進覺行、意喜行、入覺行、聞無厭行、增長捨行、調智行、親近多聞行、發歡喜行、身輕悅行、心柔和行、聞無疲倦行、聞義行、聞法行、聞威儀行、聞他說行、聞所未聞行、聞諸通行、不求餘乘行、聞諸波羅蜜行、聞菩薩藏行、聞諸攝法行、聞方便行、聞四梵行、聞念正智行、聞生方便行、聞無生方便行、觀不淨行、思惟慈行、觀因緣行、觀無常行、觀苦行、觀無我行、觀寂滅行、觀空行、觀無相行、觀無願行、觀無作行、作善行、持真實行、不失行、好惡住處防護心行、勤進無懈行、善分別諸法行、知諸煩惱非伴侶行、護諸善法自伴侶行、降伏煩惱非伴侶行、親近正法財行、斷諸貧窮行、智者所讚行、欣樂利根行、眾聖所勸行、令非聖者生歡喜行、觀諸諦行、觀陰過患行、思量有為多過患行、思義行、不作一切惡行、自利利他行、隨順增進諸善業行、進增上行、得一切佛法行。",
        "translation": "欲修行順心行、畢竟心行、常發起行、親近善友行、無憍慢行、不放逸行、恭敬行、隨順教行、從善語行、數往法師所行、至心聽法行、善思惟行、不亂心行、勤進心行、生寶想行、起藥想行、除諸病行、念器行、進覺行、意喜行、入覺行、聞無厭行、增長捨行、調智行、親近多聞行、發歡喜行、身輕悅行、心柔和行、聞無疲倦行、聞義行、聞法行、聞威儀行、聞他說行、聞所未聞行、聞諸通行、不求餘乘行、聞諸波羅蜜行、聞菩薩藏行、聞諸攝法行、聞方便行、聞四梵行、聞念正智行、聞生方便行、聞無生方便行、觀不淨行、思惟慈行、觀因緣行、觀無常行、觀苦行、觀無我行、觀寂滅行、觀空行、觀無相行、觀無願行、觀無作行、作善行、持真實行、不失行、好惡住處防護心行、勤進無懈行、善分別諸法行、知諸煩惱非伴侶行、護諸善法自伴侶行、降伏煩惱非伴侶行、親近正法財行、斷諸貧窮行、智者所讚行、欣樂利根行、眾聖所勸行、令非聖者生歡喜行、觀諸諦行、觀陰過患行、思量有為多過患行、思義行、不作一切惡行、自利利他行、隨順增進諸善業行、進增上行、得一切佛法行。",
        "source": "T13n0397_028:0195c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0196a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩如其所聞具八十行。",
        "translation": "This is called a bodhisattva who has completed the eighty practices as he's heard.",
        "source": "T13n0397_028:0196a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T13n0397_028:0196a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩，行般若波羅蜜，具三十二事善入思惟。",
        "translation": "When a bodhisattva-mahāsattva practices prajñā-pāramitā, he has thirty-two things that he well enters into contemplation.",
        "source": "T13n0397_028:0196a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三十二？",
        "translation": "What are the thirty-two?",
        "source": "T13n0397_028:0196a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善入受持定、善入分別慧、善入心柔和、善入身獨行、善入十二緣、善入不斷、善入不常、善入因緣生法、善入無眾生無命無人、善入無來去住處、善入無進不斷因果、善入空不懈、善入無相不廢、善入無願不捨、善入不證空無相無願、善入生諸禪三昧、善入不隨禪定生、善入生諸通智、善入不證無漏法、善入內觀法、善入不證決定、善入思量有為法過患、善入不著有為法、善入觀一切眾生無我而不捨大悲、善入一切趣諸怖畏處、善入雖生諸趣非業故生、善入離欲、善入不證離欲法、善入捨所樂欲、善入不捨法樂、善入捨一切戲論諸覺、善入不捨方便諸觀。",
        "translation": "善入受持定、善入分別慧、善入心柔和、善入身獨行、善入十二緣、善入不斷、善入不常、善入因緣生法、善入無眾生無命無人、善入無來去住處、善入無進不斷因果、善入空不懈、善入無相不廢、善入無願不捨、善入不證空無相無願、善入生諸禪三昧、善入不隨禪定生、善入生諸通智、善入不證無漏法、善入內觀法、善入不證決定、善入思量有為法過患、善入不著有為法、善入觀一切眾生無我而不捨大悲、善入一切趣諸怖畏處、善入雖生諸趣非業故生、善入離欲、善入不證離欲法、善入捨所樂欲、善入不捨法樂、善入捨一切戲論諸覺、善入不捨方便諸觀。",
        "source": "T13n0397_028:0196a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0196a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩行般若波羅蜜三十二事善入思惟。",
        "translation": "This is called a bodhisattva's practice of the thirty-two things of prajñā-pāramitā that are well-entered into contemplation.",
        "source": "T13n0397_028:0196a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復，善思惟者，所謂善順句。",
        "translation": "\"Furthermore, someone who well contemplates is called a phrase that's well-adhered to.",
        "source": "T13n0397_028:0196a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善順句者，是不始句，是不終句，是不住句，是無依句，是不動句，是不猗句，是平等句，是非等句，是真實句，是正真句，是不變句，是清淨句，是永寂句，是不然句，是不舉句，是不下句，是不滅句，是不增句，是不共句，是不戲論句，是如句，是不如句，是如非如句，是非如非不如句，是如實句，是三世平等句，是三際句，是不住色句，是不住受想行識句，是不住地大句，是不住水火風句，是不住眼界色界眼識界句，是不住耳界聲界耳識界句，是不住鼻界香界鼻識界句，是不住舌界味界舌識界句，是不住身界觸界身識界句，是不住意界法界意識界句，是念義句，是念智句，是了義經句，是念法句，是名菩薩善入思惟。",
        "translation": "善順句者，是不始句，是不終句，是不住句，是無依句，是不動句，是不猗句，是平等句，是非等句，是真實句，是正真句，是不變句，是清淨句，是永寂句，是不然句，是不舉句，是不下句，是不滅句，是不增句，是不共句，是不戲論句，是如句，是不如句，是如非如句，是非如非不如句，是如實句，是三世平等句，是三際句，是不住色句，是不住受想行識句，是不住地大句，是不住水火風句，是不住眼界色界眼識界句，是不住耳界聲界耳識界句，是不住鼻界香界鼻識界句，是不住舌界味界舌識界句，是不住身界觸界身識界句，是不住意界法界意識界句，是念義句，是念智句，是了義經句，是念法句，是名菩薩善入思惟。",
        "source": "T13n0397_028:0196a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復，善思惟者，所謂一切諸法若我、無我，如是諸法隨順觀察。",
        "translation": "\"Furthermore, someone who well contemplates means that if all things are self and selfless, they are thus observed in accordance with such things.",
        "source": "T13n0397_028:0196b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知眾生無有我者，即是隨順觀察諸法。",
        "translation": "If someone knows that sentient beings lack a self, this is to observe the dharmas accordingly.",
        "source": "T13n0397_028:0196b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀察即是善入思惟。",
        "translation": "Such observation is well-entered contemplation.",
        "source": "T13n0397_028:0196b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如善思惟，即是思惟生死涅槃同一法界，觀是二句無有差別，如是見者是名勤進善入思惟。",
        "translation": "To thus well contemplate is to contemplate that birth-and-death and nirvāṇa are the same reality realm, and to observe these two phrases without distinction; such a view is called diligently and well-involved contemplation.",
        "source": "T13n0397_028:0196b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀黑法及以白法二性平等無有差別，是名勤進善入思惟。",
        "translation": "If he observes that the two natures of black dharmas and white dharmas are equal without distinction, this is called diligently and skillfully entering into reflection.",
        "source": "T13n0397_028:0196b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀諸枙及以無枙不動不恃，是名勤進善入思惟。",
        "translation": "If he observes that the knotty and the ungodly are neither moved nor held in disbelief, this is called diligently advancing well-entered contemplation.",
        "source": "T13n0397_028:0196b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩起善思惟，為諸眾生而不捨離，於諸法相亦不分別，是名菩薩發善思惟。",
        "translation": "If a bodhisattva arouses good contemplation, doesn't abandon for the sake of sentient beings, and doesn't discriminate between the characteristics of dharmas, this is called a bodhisattva who arouses good contemplation.",
        "source": "T13n0397_028:0196b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0196b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如聞行者，如是得入報善思惟，是名為慧。",
        "translation": "Such a practitioner who hears and thus enters into the reward of good contemplation is called wisdom.",
        "source": "T13n0397_028:0196b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T13n0397_028:0196b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慧者，有十六法不於中住。",
        "translation": "\"Bodhisattva's wisdom is that there are 16 things that don't abide in the middle.",
        "source": "T13n0397_028:0196b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何十六？",
        "translation": "What are the sixteen?",
        "source": "T13n0397_028:0196b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不住無明、行、識、名色、六入、觸、受、愛、取、有、生、老死，乃至不住無明滅至生死滅；不住根本身見，乃至不住六十二見；不住高下，乃至不住世法、利衰、毀譽、稱譏、苦樂；不住慢慢、增上慢、勝慢、我慢、下慢、憍慢、邪慢，乃至不住二十煩惱；不住因貪所起諸結，若麁、若細、若上中下，乃至不住貪欲所起一切諸結；不住癡闇、覆蓋諸礙，乃至不住因癡所起一切諸結；不住婬欲、愛濁，不住陰死、煩惱、天魔，乃至不住因魔所起諸魔事等；不住我人、眾生、壽命、養育、士夫，乃至不住取眾生相；不住業障、報障、法障、煩惱障、諸見障，乃至不住一切習氣；不住思想、憶想、分別想、緣相想境界見聞覺知，乃至不住一切諸結；不住隨眾生心行智，乃至不住八萬四千法聚；不住慳貪、布施、破戒、持戒、瞋恚、忍辱、懈怠、精進、亂意、禪定、愚癡、智慧，乃至不住諸波羅蜜伴非伴等；不住定亂、邪正、善不善、世間、出世間、可作、不可作、有漏、無漏、有為、無為、黑法、白法、生死涅槃，乃至不住一切諸法伴非伴等；不住眾生異相、諸乘異相、佛界異相、諸佛異相、諸法異相、聖眾異相，乃至不住一切異相；不住知不知、識不識、世諦真諦，乃至不住一切諸相。",
        "translation": "不住無明、行、識、名色、六入、觸、受、愛、取、有、生、老死，乃至不住無明滅至生死滅；不住根本身見，乃至不住六十二見；不住高下，乃至不住世法、利衰、毀譽、稱譏、苦樂；不住慢慢、增上慢、勝慢、我慢、下慢、憍慢、邪慢，乃至不住二十煩惱；不住因貪所起諸結，若麁、若細、若上中下，乃至不住貪欲所起一切諸結；不住癡闇、覆蓋諸礙，乃至不住因癡所起一切諸結；不住婬欲、愛濁，不住陰死、煩惱、天魔，乃至不住因魔所起諸魔事等；不住我人、眾生、壽命、養育、士夫，乃至不住取眾生相；不住業障、報障、法障、煩惱障、諸見障，乃至不住一切習氣；不住思想、憶想、分別想、緣相想境界見聞覺知，乃至不住一切諸結；不住隨眾生心行智，乃至不住八萬四千法聚；不住慳貪、布施、破戒、持戒、瞋恚、忍辱、懈怠、精進、亂意、禪定、愚癡、智慧，乃至不住諸波羅蜜伴非伴等；不住定亂、邪正、善不善、世間、出世間、可作、不可作、有漏、無漏、有為、無為、黑法、白法、生死涅槃，乃至不住一切諸法伴非伴等；不住眾生異相、諸乘異相、佛界異相、諸佛異相、諸法異相、聖眾異相，乃至不住一切異相；不住知不知、識不識、世諦真諦，乃至不住一切諸相。",
        "source": "T13n0397_028:0196b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所謂菩薩思惟慧者，無聞、無行、無身、無相、無形、無為，如是真慧，不住一切憶想、思惟、心作、止住、名字異相。",
        "translation": "\"The so-called bodhisattva's contemplative wisdom that's unheard, unacted, unbodied, formless, and unconstructed is thus true wisdom that doesn't abide in all differences of recollection, contemplation, mental action, cessation, and name.",
        "source": "T13n0397_028:0196c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0196c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩真智慧者不住如是十六法中。",
        "translation": "This is called the true wisdom of a bodhisattva who doesn't dwell in these sixteen dharmas.",
        "source": "T13n0397_028:0196c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T13n0397_028:0196c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩慧者，處所具八方便？",
        "translation": "\"What are the eight skillful means available to the bodhisattva's wise one in his premises?",
        "source": "T13n0397_028:0196c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T13n0397_028:0196c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸陰方便、諸界方便、諸入方便、諸諦方便、諸緣方便、三世方便、諸乘方便、諸法方便。",
        "translation": "They are the skillful means of the aggregates, the skillful means of the elements, the skillful means of the sense-fields, the skillful means of the truths, the skillful means of the conditions, the skillful means of the three times, the skillful means of the vehicles, and the skillful means of the dharmas.",
        "source": "T13n0397_028:0196c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何諸陰方便？",
        "translation": "\"What are the skillful means of the aggregates?",
        "source": "T13n0397_028:0196c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說諸陰如沫如泡，如熱時焰，如芭蕉樹，如幻如夢，如呼聲響，如鏡中像，如影如化色，如水沫如水沫性，非我非眾生，非命非人，色亦如是，能如是知，是名菩薩觀色方便。",
        "translation": "If it's said that the aggregates are like foam like a bubble, like a flame when hot, like a plantain tree, like an illusion like a dream, like a cry and a sound, like an image in a mirror, like a shadow like a transformation form, like foam in water like the nature of foam in water, not self and not sentient beings, not life and not person, and form is likewise, and one can know it that way, this is called the bodhisattva's method of observing form.",
        "source": "T13n0397_028:0196c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「受喻如泡，想喻如焰，行如芭蕉，識喻如幻，如泡如焰如芭蕉幻性，無我無眾生，無命無人，受想行識亦復如是，能如是知，是名菩薩觀受想行識方便。",
        "translation": "\"Feeling is likened to a bubble, perception to a flame, volition to a plantain, and consciousness to an illusion, and like a bubble, a flame, or the illusory nature of a plantain, there's no self, no sentient beings, no life, and no person, and feeling, perception, volition, and consciousness are likewise, which can be thus known as the bodhisattva's method of observing feeling, perception, volition, and consciousness.",
        "source": "T13n0397_028:0196c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸陰如夢如響，如像如影，如化如化等性，無我無眾生無命無人，是諸陰等亦復如是，能如是知，是名菩薩觀陰方便。",
        "translation": "\"Aggregates are like dreams, like sounds, like images, like shadows, like transformations, and so forth, lacking self, sentient beings, lacking life, and lacking person, and so forth, and these aggregates are likewise, which can be thus known, and this is called the bodhisattva's method of observing aggregates.",
        "source": "T13n0397_028:0196c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所謂陰者即世間相，世間相者是可壞相。",
        "translation": "\"The so-called aggregates are worldly appearances, and worldly appearances are destructible appearances.",
        "source": "T13n0397_028:0197a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如可壞相即無常性、苦性、無我性、寂滅性。",
        "translation": "Such destructible marks are impermanence, suffering, selflessness, and extinction.",
        "source": "T13n0397_028:0197a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能如是知，是名菩薩觀陰方便。",
        "translation": "To know them in this way is called the bodhisattva's skill in observing aggregates.",
        "source": "T13n0397_028:0197a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩知界方便？",
        "translation": "\"What is the bodhisattva's skillful means of knowing the elements?",
        "source": "T13n0397_028:0197a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界、地界、水火風界，是法界中無有堅相濕相熱相動相，法界眼界耳界鼻舌身意界，是法界中無有見相聞相嗅相別相覺相知相。",
        "translation": "\"The realms of dharmas, earth realms, and water, fire, and wind realms are realms in which there are no hard, wet, or hot marks, and the realms of dharmas, eyes, ears, nose, tongue, body, and mind are realms in which there are no visible or audible marks, olfactory or distinctive marks, or perceptive or cognitive marks.",
        "source": "T13n0397_028:0197a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界色界聲香味觸法，是法界中，無眼可見相、耳可聞相、鼻可嗅相、舌可別相、身可覺相、意可知相。",
        "translation": "The Dharma realm of form, sound, smell, taste, and touch is a realm in which there are no visible marks of the eye, audible marks of the ear, audible marks of the nose, distinguishable marks of the tongue, audible marks of the body, or knowable marks of the mind.",
        "source": "T13n0397_028:0197a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界眼識界耳鼻舌身意識界，是法界中，無眼識知色，乃至無意識知法。",
        "translation": "The element of the Dharma realm of visual consciousness, the element of the ear, nose, tongue, and body, and the element of consciousness is the Dharma realm in which there's no visual consciousness that knows form ... and no consciousness that knows dharmas.",
        "source": "T13n0397_028:0197a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界色界法界非色作相，乃至法界亦復如是。",
        "translation": "The Dharma realm, form realm, and Dharma realm are not form-form-forming characteristics, and so is the Dharma realm.",
        "source": "T13n0397_028:0197a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界我界無二無別。",
        "translation": "The realm of dharmas, the self-realm, and the objective realm are not two, and there's no distinction between them.",
        "source": "T13n0397_028:0197a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界欲界色界無色界我界生死界涅槃界無二無別，法界虛空界，一切法界我界空界，無相無願無作不出不生無所有等如涅槃。",
        "translation": "The realm of desire, the realm of form, the realm of formlessness, the realm of self, the realm of birth-and-death, and the realm of nirvāṇa are not two and not distinct, and the realm of space in the Dharma realm and the realm of emptiness in all the Dharma realms are formless, wishless, unconstructed, unarisen, unowned, and so on, like nirvāṇa.",
        "source": "T13n0397_028:0197a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空涅槃及一切法，等無有二。",
        "translation": "There's no difference between the element of space and nirvāṇa and all dharmas.",
        "source": "T13n0397_028:0197a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量有為法界入無為界，能如是知如是說者，是名菩薩知界方便。",
        "translation": "Such an infinite number of existent realms entering into the realm of nothingness that can be thus known and thus explained is called a bodhisattva's skillful means of knowing the realm.",
        "source": "T13n0397_028:0197a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩觀入方便？",
        "translation": "\"What is the bodhisattva's method of observing and entering?",
        "source": "T13n0397_028:0197a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說，眼空、我空、我所空。",
        "translation": "As the Buddha has taught, the eye is empty, the self is empty, and what belongs to the self is empty.",
        "source": "T13n0397_028:0197a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_028:0197a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是眼性中無我無我所，耳鼻舌身意空亦復如是。",
        "translation": "\"While the nature of the eye is devoid of self and no object of self, the emptiness of the ear, nose, tongue, body, and mind is likewise.",
        "source": "T13n0397_028:0197a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀是入者見一切法，若善不善，無有二相，是名菩薩觀入方便。",
        "translation": "When someone observes this kind of entry, they see all things, whether good or not, without any two characteristics, which is called the bodhisattva's method of observing entry.",
        "source": "T13n0397_028:0197a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼入色入，若見眼色離欲，不證離欲法，是名菩薩觀入方便。",
        "translation": "If the eye enters form, and if he sees that the eye and form are free of desire and doesn't realize that they're free of desire, this is called the bodhisattva's method of observing entry.",
        "source": "T13n0397_028:0197a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳入聲入鼻入香入舌入味入身入觸入意入法入，若見離欲，不證離欲法，是名菩薩觀入方便。",
        "translation": "If he enters by ear, enters by sound, enters by nose, enters by smell, enters by tongue, enters by taste, enters by body, enters by touch, enters by mind, or enters by principle, and if he sees that he's free of desire and doesn't realize that he's free of desire, this is called the bodhisattva observing the skillful means of entry.",
        "source": "T13n0397_028:0197a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所謂入者，若聖入非聖入。",
        "translation": "\"This is called entry if it's holy entry and not holy entry.",
        "source": "T13n0397_028:0197a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何聖入？",
        "translation": "What's holy entry?",
        "source": "T13n0397_028:0197a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若修集道。",
        "translation": "\"If someone cultivates the path of accumulation, then what is the noble entry that doesn't cultivate the path of accumulation?",
        "source": "T13n0397_028:0197a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非聖入，不修集道？",
        "translation": "How can someone not practice the noble path of accumulation but not enter it?",
        "source": "T13n0397_028:0197a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住道，於不修道者生大悲心不捨入道，是名菩薩觀入方便。",
        "translation": "If a bodhisattva abides on the path and arouses great compassion for those who aren't cultivating it and doesn't abandon the path, this is called the bodhisattva method of observing and entering.",
        "source": "T13n0397_028:0197a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩觀諦方便？",
        "translation": "\"What is the bodhisattva's method of observing the truth?",
        "source": "T13n0397_028:0197b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂甚深難入。",
        "translation": "It's called very deep and difficult to enter.",
        "source": "T13n0397_028:0197b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何難入？",
        "translation": "How is it difficult to enter?",
        "source": "T13n0397_028:0197b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苦智、集智、滅智、道智。",
        "translation": "\"Suppose someone has knowledge of suffering, knowledge of arising, knowledge of cessation, and knowledge of the path.",
        "source": "T13n0397_028:0197b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦智者觀陰無生，集智者觀斷愛因，滅智者觀無明等諸煩惱無有和合，道智者得平等觀，於一切法無所倚著。",
        "translation": "Wisdom of suffering observes that aggregates are unarisen, wisdom of accumulation observes that the causes of craving are ended, wisdom of cessation observes that there's no confluence of afflictions like ignorance, and wisdom of the path attains the observation of equality, which is based on no attachment to all dharmas.",
        "source": "T13n0397_028:0197b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若於四聖諦中作如是觀，而不取證，為化眾生，是名菩薩觀諦方便。",
        "translation": "If a bodhisattva thus observes the four noble truths without acquiring their realization in order to teach sentient beings, this is called a bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有三諦。",
        "translation": "\"Again, there are three truths.",
        "source": "T13n0397_028:0197b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are the three?",
        "source": "T13n0397_028:0197b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俗諦、第一義諦、相諦。",
        "translation": "They are the conventional truth, the ultimate truth, and the truth of characteristics.",
        "source": "T13n0397_028:0197b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何俗諦？",
        "translation": "What are the conventional truths?",
        "source": "T13n0397_028:0197b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若世間所用語言、文字、假名法等。",
        "translation": "\"If there are words, letters, nominal dharmas, and so forth that are used in the world, what is the ultimate truth?",
        "source": "T13n0397_028:0197b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何第一義諦？",
        "translation": "What is the ultimate truth?",
        "source": "T13n0397_028:0197b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至無有心行，何況當有言語文字。",
        "translation": "\"Even if there's no mental activity, how could there be words and phrases?",
        "source": "T13n0397_028:0197b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何相諦？",
        "translation": "What is the truth of characteristics?",
        "source": "T13n0397_028:0197b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀一切相同於一相，一相者即是無相。",
        "translation": "\"He observes that all things are the same in terms of one characteristic, and that one characteristic is no characteristic at all.",
        "source": "T13n0397_028:0197b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩隨順俗諦而不厭倦，觀第一義諦而不取證，觀諸相諦一相無相，是名菩薩觀諦方便。",
        "translation": "The bodhisattva follows the conventional truth and doesn't tire of it, observes the cardinal truth and doesn't grasp its realization, and observes the characteristic truths as one mark and no mark, which is called the bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有二諦。",
        "translation": "\"Again, there are two truths.",
        "source": "T13n0397_028:0197b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等二？",
        "translation": "What are the two?",
        "source": "T13n0397_028:0197b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俗諦、第一義諦。",
        "translation": "The conventional truth is the ultimate truth.",
        "source": "T13n0397_028:0197b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等俗諦？",
        "translation": "What are the conventional truths?",
        "source": "T13n0397_028:0197b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說苦集道諦。",
        "translation": "\"If they say 'truth of suffering, arising, and the path,'",
        "source": "T13n0397_028:0197b14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若世間語言、文字、假名法等。",
        "translation": "If it's worldly language, words, nominal dharmas, and so forth.",
        "source": "T13n0397_028:0197b14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何第一義諦？",
        "translation": "What is the ultimate truth?",
        "source": "T13n0397_028:0197b15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於涅槃法終不忘失。",
        "translation": "\"If they never forget the teaching of nirvāṇa, why is that?",
        "source": "T13n0397_028:0197b15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_028:0197b16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如與法界其性常故，菩薩隨俗不生厭倦，觀第一義而不取證。",
        "translation": "Because the nature of suchness and the Dharma realm are constant, bodhisattvas follow the conventional and don't become weary of it, observing the supreme truth and not grasping its realization.",
        "source": "T13n0397_028:0197b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有一諦。",
        "translation": "\"Again, there's one truth.",
        "source": "T13n0397_028:0197b18_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為一？",
        "translation": "What's one?",
        "source": "T13n0397_028:0197b18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法無所倚著，為化眾生現有所著，是名菩薩觀諦方便。",
        "translation": "Being unattached to all dharmas and showing attachment to them for the sake of transforming sentient beings is called the bodhisattva's method of observing the truth.",
        "source": "T13n0397_028:0197b18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，五陰苦。",
        "translation": "\"Furthermore, the five aggregates are painful.",
        "source": "T13n0397_028:0197b20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見五陰苦相，是名為苦觀。",
        "translation": "If someone sees the five aggregates as painful, this is called the contemplation of suffering.",
        "source": "T13n0397_028:0197b20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦即空，是名苦智觀苦聖諦。",
        "translation": "When suffering is emptiness, this is called the noble truth of observing suffering with the knowledge that it's suffering.",
        "source": "T13n0397_028:0197b21_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀五陰諸煩惱愛因見因，是名為集。",
        "translation": "If one observes the five aggregates as causes of affliction and sees their causes, this is called accumulation.",
        "source": "T13n0397_028:0197b21_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀愛因見因，不取不著不希不求，是名集智觀集聖諦。",
        "translation": "If he observes loving causes and sees their causes and doesn't grasp or attach to them and doesn't wish or seek for them, this is called the noble truth of observing the noble truth of accumulation with the knowledge of accumulation.",
        "source": "T13n0397_028:0197b22_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五陰畢竟盡相，過去已滅，未來未生，現在不住，是名為滅，能如是知，是名滅智觀滅聖諦。",
        "translation": "If he observes the finality of the five aggregates, which have ceased in the past, will not arise in the future, and won't abide in the present, this is called cessation, and he can thus know it, which is called the noble truth of observing cessation with the knowledge of cessation.",
        "source": "T13n0397_028:0197b23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得道者證集滅智比智知已，是名為道。",
        "translation": "If someone who has attained the path realizes the knowledge of accumulation and cessation and knows it better than cognition, this is called the path.",
        "source": "T13n0397_028:0197b26_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是中悉見空性，是名道智觀道聖諦。",
        "translation": "If he fully sees emptiness in this, this is called the noble truth of the path with the knowledge of the path and the contemplation of the path.",
        "source": "T13n0397_028:0197b27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是觀四聖諦，是名菩薩觀諦方便。",
        "translation": "If he can thus observe the four noble truths, this is called the bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若一切受，是名為苦。",
        "translation": "\"If all sensations are experienced, this is called suffering.",
        "source": "T13n0397_028:0197b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於諸受思惟分別，是名苦智觀苦聖諦，受因和合是名為集。",
        "translation": "If one contemplates and discerns these feelings, this is called the noble truth of observing suffering with the knowledge that the causes of feelings are combined, which is called accumulation.",
        "source": "T13n0397_028:0197b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於受因知如真實，是名集智觀集聖諦。",
        "translation": "If the causes of feeling are known as they really are, this is called the noble truth of observing the noble truth of suffering with the knowledge of suffering.",
        "source": "T13n0397_028:0197c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若除諸受無受者受，觀受滅盡不證於滅，為化眾生，是名滅智觀滅聖諦。",
        "translation": "If he removes feelings and sensations without sensations, observes the cessation of sensations and doesn't realize cessation in order to convert sentient beings, this is called the noble truth of observing cessation with the knowledge of cessation.",
        "source": "T13n0397_028:0197c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有所受，是名為道。",
        "translation": "If there's sensation, this is called the path.",
        "source": "T13n0397_028:0197c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖有和合猶如筏喻，不為所受不求於道，是名道智觀道聖諦。",
        "translation": "Although it's a combination like a raft, it's not received and doesn't seek the path, which is called the noble truth of observing the path with the knowledge of the path.",
        "source": "T13n0397_028:0197c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是知，見四聖諦清淨平等，是名菩薩觀諦方便。",
        "translation": "To have this knowledge and see that the four noble truths are pure and equal is called the bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，略說生苦是名為苦。",
        "translation": "\"Furthermore, it's briefly explained that the suffering of birth is called suffering.",
        "source": "T13n0397_028:0197c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀於生，是名苦智觀苦聖諦。",
        "translation": "If someone observes birth, this is called the noble truth of observing suffering with the knowledge that it's painful.",
        "source": "T13n0397_028:0197c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生從因緣，是名為集。",
        "translation": "When birth comes from causes and conditions, this is called accumulation.",
        "source": "T13n0397_028:0197c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀有非有，是名集智觀集聖諦。",
        "translation": "If one observes that what exists and what isn't exists, this is called the noble truth of observing the noble truth of collection with the knowledge that it's collected.",
        "source": "T13n0397_028:0197c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切生非生，是即非滅，若法不生即無有滅，是名為滅。",
        "translation": "All that is produced and not produced is what's not ceased, and if things aren't produced, then there's no cessation, which is called cessation.",
        "source": "T13n0397_028:0197c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀此滅即是滅智觀滅聖諦。",
        "translation": "If he observes this cessation, this is the noble truth of observing cessation with the knowledge that it's cessation.",
        "source": "T13n0397_028:0197c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是等，推求稱量思惟分別，是名為道。",
        "translation": "If this is the case, then inferring, measuring, contemplating, discerning, and so forth is called the path.",
        "source": "T13n0397_028:0197c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若滅如是求稱量等，入法門者，是名道智觀道聖諦。",
        "translation": "If he thus ceases seeking to measure and so forth and enters the Dharma teaching, this is called the noble truth of observing the path with the knowledge of the path.",
        "source": "T13n0397_028:0197c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若住於智不證聖諦，是名菩薩觀諦方便。",
        "translation": "If someone abides in knowledge and doesn't realize the noble truth, this is called the bodhisattva method of observing the truth.",
        "source": "T13n0397_028:0197c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩觀緣方便？",
        "translation": "\"What is the bodhisattva's method of observing conditions?",
        "source": "T13n0397_028:0197c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集不善思惟故無明集，無明集故行集，行集故識集，識集故名色集，名色集故六入集，六入集故觸集，觸集故受集，受集故愛集，愛集故取集，取集故有集，有集故生集，生集故老死集，老死集故憂悲苦惱集。",
        "translation": "Because accumulation is not well contemplated, ignorance accumulates, ignorance accumulates, form accumulates, consciousness accumulates, form accumulates, name-and-form accumulates, six-entry accumulates, six-entry accumulates, touch accumulates, touch accumulates, feeling accumulates, craving accumulates, craving accumulates, grasping accumulates, existence accumulates, birth accumulates, old age and death accumulates, and grief and sorrow and suffering accumulate.",
        "source": "T13n0397_028:0197c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知如是諸苦聚集，是名菩薩觀緣方便。",
        "translation": "If someone knows such a collection of suffering, this is called a bodhisattva's method of observing conditions.",
        "source": "T13n0397_028:0197c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若住如是諸法聚集，則不長養，無所作，無諍訟，無有主，無所屬，無繫縛。",
        "translation": "If they abide in such a collection of qualities, then they won't be nurtured, have nothing to do, have no quarrels, have no subject, have no object, and have no fetters.",
        "source": "T13n0397_028:0197c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂若因善法、因不善法、因不動法、若因向涅槃法，如是等法如實分別。",
        "translation": "It means that if it's due to good qualities, due to unskillful qualities, due to immovable qualities, or due to qualities that lead to nirvāṇa, such things are truly discerned.",
        "source": "T13n0397_028:0197c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生根量齊限，因是諸根所作諸業，若有受報及非受報，善知其因聚集方便，是名菩薩觀緣方便。",
        "translation": "If the capacities of sentient beings are equally limited, and if there are rewards and non-rewards that result from the actions performed by these faculties, this is called the bodhisattva's method of observing conditions, which is to well understand the causes and methods of gathering them together.",
        "source": "T13n0397_028:0197c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不善思惟滅則無明滅，無明滅故行滅，行滅故識滅，識滅故名色滅，名色滅故六入滅，六入滅故觸滅，觸滅故受滅，受滅故愛滅，愛滅故取滅，取滅故有滅，有滅故生滅，生滅故老死滅，老死滅故憂悲苦惱諸苦聚滅。",
        "translation": "\"When unskillful contemplation ceases, ignorance ceases; when ignorance ceases, form ceases; when form ceases, consciousness ceases; when consciousness ceases, name-and-form ceases; when name-and-form ceases, the six sense-fields cease; when the six sense-fields cease, touch ceases; when touch ceases, feeling ceases; when feeling ceases, craving ceases; when craving ceases, apprehension ceases; when apprehension ceases, existence ceases; when existence ceases, birth ceases; when birth ceases, old age and death cease; and when old age and death cease, the grievous, painful, and distressing aggregates of suffering cease.",
        "source": "T13n0397_028:0197c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知如是諸苦聚滅，是名菩薩觀緣方便。",
        "translation": "If someone knows that such clusters of suffering cease, this is called a bodhisattva's method of observing conditions.",
        "source": "T13n0397_028:0198a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一切諸法屬因屬緣屬和合；若法屬因緣和合，是法則不屬我人眾生壽命；若法不屬我人眾生壽命則不入法數，能如是知是名菩薩觀緣方便。",
        "translation": "\"All dharmas are causes, conditions, and combinations, and if dharmas are causes, conditions, and combinations, then they don't belong to us as the life of sentient beings; if dharmas don't belong to us as the life of sentient beings, then they don't enter the Dharma category, and to know this is called a bodhisattva observing the skill of conditions.",
        "source": "T13n0397_028:0198a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩所修諸法，為助菩提安止菩提，如是諸緣悉見滅盡，而不取證為化眾生，是名菩薩觀緣方便。",
        "translation": "If bodhisattvas cultivate qualities that aid enlightenment, stabilize enlightenment, and see the cessation of such conditions without grasping their realization in order to convert sentient beings, this is called the bodhisattva's method of observing conditions.",
        "source": "T13n0397_028:0198a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何觀三世方便？",
        "translation": "\"What is the method of contemplating the three times?",
        "source": "T13n0397_028:0198a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若念過去己身他身，善不善心心數法，不善心法呵責毀呰，善心數法悉以迴向無上菩提，是名菩薩觀過去方便。",
        "translation": "If he's mindful of his own body and the bodies of others in the past, the mental factors of good and unskillful thoughts, the mental factors of unskillful thoughts that he rebukes and disparages, and the mental factors of good thoughts that he dedicates to unsurpassed enlightenment, this is called a bodhisattva observing the skillful means of the past.",
        "source": "T13n0397_028:0198a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世心心數法，一向專念菩提之道，若起善心願悉迴向無上菩提，所有不善心心數法不令入心，發如是願，是名菩薩觀未來方便。",
        "translation": "If in future lives his mind and mental factors are numbered, he's always focused on the path to enlightenment, and if he arouses good thoughts and vows to always dedicate them to unsurpassed enlightenment, he doesn't allow any unwholesome mental factors to enter his mind and makes this vow, this is called a bodhisattva observing the skillful means of the future.",
        "source": "T13n0397_028:0198a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若現在世心心數法，善思惟等所作諸業，悉以迴向無上菩提，是名菩薩觀現在方便。",
        "translation": "If the activities of mind and mental factors of the present world, such as good contemplation, are all directed toward unsurpassed enlightenment, this is called the bodhisattva observing the skillful means of the present.",
        "source": "T13n0397_028:0198a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是方便，是名菩薩觀三世方便。",
        "translation": "Performing such skillful means is called the bodhisattva's skillful means of observing the three times.",
        "source": "T13n0397_028:0198a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善解三世空無所有。",
        "translation": "\"Furthermore, it's a good understanding that the three times are empty and non-existent.",
        "source": "T13n0397_028:0198a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作是觀觀三世空智慧力故，若於三世諸佛所種無量功德，悉以迴向無上菩提方便力故，如是方便，是名菩薩觀三世方便。",
        "translation": "If this observation is made because of the power of wisdom in observing the emptiness of the three times, and if the measureless merits of the buddhas of the three times are all cultivated by the power of the method of converting them to unsurpassed bodhi, such a method is called a bodhisattva observing the skillful means of the three times.",
        "source": "T13n0397_028:0198a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，雖見過去盡法不至未來，而常修善精勤不懈；觀未來法雖無生出，不捨精進願向菩提；觀現在法雖念念滅，其心不忘發趣菩提。",
        "translation": "\"Furthermore, although he sees that the past is exhausted and won't reach the future, he always cultivates goodness and diligently works tirelessly; although he observes that future existences won't arise or arise, he doesn't abandon his effort and vow to achieve enlightenment; and although he observes that present existences are mindfully extinguished, his mind doesn't forget to aspire to enlightenment.",
        "source": "T13n0397_028:0198a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such skillful means are called the bodhisattva's skillful means of observing the three times.",
        "source": "T13n0397_028:0198a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去已滅、未來未至、現在不住，雖如是觀心心數法生滅散壞，而常不捨聚集善根助菩提法，如是方便，是名菩薩觀三世方便。",
        "translation": "Although he thus observes that mind and mental factors arise and cease, dissipate, and disintegrate, he always refrains from abandoning the cultivation of good roots that contribute to enlightenment, and this is called the bodhisattva observing the skillful means of the three times.",
        "source": "T13n0397_028:0198a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，若諸神通，念過去世所作善根，念已迴向無上菩提，念未來世未生善根，願心所圖如意成就，現在世中常生善根，專念不懈迴向無上菩提之道。",
        "translation": "\"Furthermore, suppose there are supernormal powers that are mindful of the good roots that were created in the past, are mindful of having turned toward unsurpassed bodhi, are mindful of the good roots that haven't yet arisen in future lives, accomplish what they wish, always produce good roots in the present life, and concentrate their thoughts unremittingly on turning toward the path to unsurpassed bodhi.",
        "source": "T13n0397_028:0198a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such skillful means are called the bodhisattva's skillful means of contemplating the three times.",
        "source": "T13n0397_028:0198b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，若化眾生，念過去世所作善根助道功德，所謂隨眾生心應可化者，如其所樂悉已化訖。",
        "translation": "\"Furthermore, if he converts sentient beings, he'll remember the virtues of the good roots that were created in the past to aid in the path, which are described as adaptable to the minds of sentient beings, and he'll have converted them all according to their wishes.",
        "source": "T13n0397_028:0198b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世所有眾生，或須見佛及諸聖人而得度者，隨形應適悉令得度。",
        "translation": "If there will be sentient beings in the future who need to see the Buddha and other noble people to be saved, they'll be saved according to their physical appearance and appropriateness.",
        "source": "T13n0397_028:0198b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若現在世所有眾生，若應聞法應見神力，亦隨所應皆悉化之，隨所教化諸眾生已，則於三世成自他利，如是之利悉為菩提具無礙智。",
        "translation": "If there are sentient beings in the present world who should hear the teaching and see the miraculous powers, they'll all be transformed according to what they should be, and after teaching and transforming them, they'll achieve self-improvement in the three worlds, and such benefits will all lead to bodhi with unimpeded knowledge.",
        "source": "T13n0397_028:0198b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such skillful means are called the bodhisattva's skillful means of contemplating the three times.",
        "source": "T13n0397_028:0198b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T13n0397_028:0198b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩觀諸乘方便？",
        "translation": "How do bodhisattvas contemplate the skillful means of the vehicles?",
        "source": "T13n0397_028:0198b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世有三乘。",
        "translation": "There are three vehicles in the world.",
        "source": "T13n0397_028:0198b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are the three?",
        "source": "T13n0397_028:0198b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞乘、緣覺乘、大乘。",
        "translation": "The śrāvaka vehicle, the pratyekabuddha vehicle, and the great vehicle.",
        "source": "T13n0397_028:0198b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有二乘。",
        "translation": "\"Again, there are the two vehicles.",
        "source": "T13n0397_028:0198b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等二？",
        "translation": "What are the two?",
        "source": "T13n0397_028:0198b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天乘、人乘。",
        "translation": "\"The celestial vehicle and the human vehicle.",
        "source": "T13n0397_028:0198b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩觀聲聞乘？",
        "translation": "How do bodhisattvas contemplate the vehicle of the śrāvakas?",
        "source": "T13n0397_028:0198b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛未出世無聲聞乘。",
        "translation": "Before the Buddha's appearance in the world, there was no śrāvaka vehicle.",
        "source": "T13n0397_028:0198b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_028:0198b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從他聞法生於正見。",
        "translation": "\"From hearing the teaching from others, right view arises.",
        "source": "T13n0397_028:0198b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂聞者持戒威儀，戒威儀具故戒聚具足，戒聚具足已定聚具足，定聚具足已慧聚具足，慧聚具足已解脫聚具足，解脫聚具足已解脫知見聚具足。",
        "translation": "It's called a hearer who maintains the precepts and conduct, and because the precepts and conduct are complete, the precepts aggregate is complete when the precepts aggregate is complete, the concentration aggregate is complete when the concentration aggregate is complete, the wisdom aggregate is complete when the concentration aggregate is complete, the liberation aggregate is complete when the liberation aggregate is complete, and the knowledge and vision of liberation are complete when the liberation aggregate is complete.",
        "source": "T13n0397_028:0198b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是方便，是名菩薩觀聲聞乘方便。",
        "translation": "Such skillful means are called the bodhisattva's skillful means of contemplating the śrāvaka vehicle.",
        "source": "T13n0397_028:0198b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，觀聲聞乘，若善不善及不動行，心常毀呰厭離三界，觀一切行無常苦無我寂滅涅槃，乃至一念不悕受生，常懷怖懼心不甘樂，觀陰如怨界如毒蛇，入如空聚，於一切趣不願受生。",
        "translation": "\"Furthermore, when observing the vehicle of the śrāvakas, if their actions are good, unskillful, and immovable, their minds are always disparaging and disillusioned with the three realms, observing that all conditioned things are impermanent, painful, selfless, tranquil, and nirvāṇa, up to the point where they don't expect to be born in a single thought, always harboring fear and discontent, observing that aggregates are like resentments, realms are like vipers, and formations are like clusters of emptiness, and they don't wish to be born in all destinies.",
        "source": "T13n0397_028:0198b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是開示分別，是名菩薩觀聲聞乘方便。",
        "translation": "If they can thus reveal and discern this, this is called the method by which a bodhisattva observes the vehicle of the śrāvakas.",
        "source": "T13n0397_028:0198b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩觀緣覺乘方便？",
        "translation": "\"What is the bodhisattva's method of observing the pratyekabuddha vehicle?",
        "source": "T13n0397_028:0198b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若緣覺出世，觀其所行如實知之，緣覺所行出過聲聞所有功德，欲精進不放逸，持戒少聞不多供養諸佛世尊給侍使令，以中根故。",
        "translation": "\"If a pratyekabuddha emerges from the world, he observes what he does and knows it as it really is, surpassing all the merits of the śrāvakas in what they do, wanting to make effort and not be careless, observing precepts and learning little, making few offerings to the world honored ones, and serving orders because of their middling faculties.",
        "source": "T13n0397_028:0198b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常有厭心，所作眾事皆悉尠少，厭患憒閙常樂遠離，獨住空閑威儀庠序，出入凝重安心靜默簡於人事，能為眾生現世福田，其心翫樂觀十二緣，常念一法出世涅槃，數遊禪定不從他聞，自然覺了少分境界，因緣悟道故名緣覺。",
        "translation": "He's always weary of it, does little of everything, gets tired of trouble and anxiety, always enjoys seclusion, lives alone in a quiet and dignified environment with peaceful and quiet demeanor, goes in and out of meditation, is at ease, is quiet and concise about people, is a field of merit for sentient beings in the present life, takes delight in contemplating 12 conditions in his mind, is always mindful of the one dharma that transcends the world and nirvāṇa, travels frequently in meditation and doesn't listen to others, naturally perceives a small part of the realm, and is called a pratyekabuddha because he's awakened to the path as a result of conditioning.",
        "source": "T13n0397_028:0198b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是開示分別，是名菩薩觀緣覺乘方便。",
        "translation": "If they can thus reveal and discern, this is called the method by which a bodhisattva observes the vehicle of the solitary realizers.",
        "source": "T13n0397_028:0198c05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩觀大乘方便？",
        "translation": "\"What is the bodhisattva's method of observing the great vehicle?",
        "source": "T13n0397_028:0198c06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其乘無量，今於此中當說少分。",
        "translation": "\"The vehicle is measureless, and I'll explain a small part of it here.",
        "source": "T13n0397_028:0198c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是乘無量，悉能容受一切眾生，無罣礙故；是乘增長一切善根，令無量眾生得受用故；是乘具足諸波羅蜜，能隨眾生心行化故；是乘能過助道之法，進趣無礙至道場故；是乘平等無礙光明照於一切，無量眾生悉堪受故；是乘無畏過怯弱道，悉能示現諸佛法故；是乘能壞一切諸魔外道邪眾，了十二緣，建立佐助菩提幢故；是乘能除一切諸邊有無斷常因緣諸見所起煩惱障礙，覆蓋疑網調戲，得佛無礙真智慧故；是乘富足具諸珍寶，真實不虛能益眾生，大悲勇猛本願成就故；是乘具足十力無畏不共之法，相好嚴身身口意故。",
        "translation": "是乘無量，悉能容受一切眾生，無罣礙故；是乘增長一切善根，令無量眾生得受用故；是乘具足諸波羅蜜，能隨眾生心行化故；是乘能過助道之法，進趣無礙至道場故；是乘平等無礙光明照於一切，無量眾生悉堪受故；是乘無畏過怯弱道，悉能示現諸佛法故；是乘能壞一切諸魔外道邪眾，了十二緣，建立佐助菩提幢故；是乘能除一切諸邊有無斷常因緣諸見所起煩惱障礙，覆蓋疑網調戲，得佛無礙真智慧故；是乘富足具諸珍寶，真實不虛能益眾生，大悲勇猛本願成就故；是乘具足十力無畏不共之法，相好嚴身身口意故。",
        "source": "T13n0397_028:0198c07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是方便，是名菩薩觀大乘方便。",
        "translation": "Such skillful means are called the bodhisattva's observance of the great vehicle's skillful means.",
        "source": "T13n0397_028:0198c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩觀一切法方便？",
        "translation": "\"What's the bodhisattva's method of observing all dharmas?",
        "source": "T13n0397_028:0198c20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂若有為、若無為，菩薩於中善知方便。",
        "translation": "It's called the method by which a bodhisattva well knows whether something is existent or nothing.",
        "source": "T13n0397_028:0198c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何善觀有為方便？",
        "translation": "What's the skillful observation of the means of becoming?",
        "source": "T13n0397_028:0198c22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有身善業、口善業、意善業，願以迴向無上菩提，是名有為方便。",
        "translation": "Vowing to direct all good physical, verbal, and mental actions toward unsurpassed bodhi is called artificial skillful means.",
        "source": "T13n0397_028:0198c22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀身口意業同菩提相，迴向菩提，是名菩薩觀無為方便。",
        "translation": "If someone observes that the physical, verbal, and mental actions are the same as the marks of enlightenment and dedicates themselves to enlightenment, this is called a bodhisattva observing the method of doing nothing.",
        "source": "T13n0397_028:0198c24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，有為方便，若能聚集五波羅蜜，是名有為方便。",
        "translation": "\"Furthermore, if existential skillful means can gather the five perfections, this is called an existential skillful means.",
        "source": "T13n0397_028:0198c25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖知般若波羅蜜其性無為，於所聚集終無厭賤，要欲具足諸波羅蜜，深解善根同無漏菩提，而猶願成一切種智，是名菩薩無為方便。",
        "translation": "Even though he knows that the nature of the perfection of wisdom is uncontaminated, he never tires of gathering them, wants to fully possess them, deeply understands that their good roots are the same as untainted bodhi, and still wishes to achieve omniscience, which is called the bodhisattva's unconstructed method.",
        "source": "T13n0397_028:0198c27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，有為方便，住於無礙平等心中，以四攝法攝取眾生，是名有為方便。",
        "translation": "\"Furthermore, this is called the existential method of abiding in the mind of unhindered equality and taking sentient beings in by means of the four methods of collecting them.",
        "source": "T13n0397_028:0199a01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無為方便？",
        "translation": "What's unconstructed skillful means?",
        "source": "T13n0397_028:0199a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善解眾生無我無人無所悕求，知四攝法同無為解脫，而能迴向一切種智，是名無為方便。",
        "translation": "To well understand that sentient beings lack self, lack persons, and lack expectations, to know that the four collectives are the same as aimless liberation, and to be able to dedicate oneself to the knowledge of all kinds is called aimless skillful means.",
        "source": "T13n0397_028:0199a03_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，有為方便，若諸煩惱生死相續斷令不起，所有善根助菩提者令不斷絕，乃至不行少煩惱分，是名有為方便。",
        "translation": "\"Furthermore, if existential skillful means are to stop the continuity of birth-and-death afflictions so that they don't arise, and to make those whose good roots contribute to bodhi not cease, even if they don't cultivate the lesser part of affliction, this is called existential skillful means.",
        "source": "T13n0397_028:0199a05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無為方便？",
        "translation": "What's unconstructive skillful means?",
        "source": "T13n0397_028:0199a07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖觀空無相無願，知此三空即助道方便故能不證，是名無為方便。",
        "translation": "Although they observe emptiness, have no characteristics, and have no wishes, they know that these three kinds of emptiness are the skills that aid in the path and therefore can't realize them, which is called unconstructed skillful means.",
        "source": "T13n0397_028:0199a08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，有為方便，雖在三界不為三界煩惱所污，是名有為方便。",
        "translation": "\"Furthermore, although existent skillful means are in the three realms, they aren't defiled by the afflictions of the three realms, which is called existent skillful means.",
        "source": "T13n0397_028:0199a09_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無為方便？",
        "translation": "What is the method of noncontrivance?",
        "source": "T13n0397_028:0199a11_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖出三界不證於出，是名無為方便。",
        "translation": "Even though they emerge from the three realms, they don't realize their escape, which is called the method of doing nothing.",
        "source": "T13n0397_028:0199a11_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說，知諸法方便則能具足一切種智。",
        "translation": "As the Buddha explains, knowing the methods of all things then makes it possible to fully possess the cognition of all kinds.",
        "source": "T13n0397_028:0199a12_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故，一切種智無量無邊，具足正念慧方便故，是故名為一切法方便。",
        "translation": "Why is that, since all kinds of cognition are measureless and limitless, and because it's complete with the skill of right mindfulness and wisdom, it's called the skillful means of all things.",
        "source": "T13n0397_028:0199a13_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0199a15_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩智慧所緣八方便也。",
        "translation": "These are called the eight skillful means that are the objects of a bodhisattva's wisdom.",
        "source": "T13n0397_028:0199a15_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T13n0397_028:0199a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是八方便能攝菩薩無盡智慧。",
        "translation": "These eight skillful means can subsume a bodhisattva's inexhaustible wisdom.",
        "source": "T13n0397_028:0199a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0199a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是慧能解，觀了善法不善法故；是慧如箭，善射法故；是慧財行，聖法現在故；是慧真解，斷除諸見煩惱障礙諸覆蓋故；是慧定願，悉能滿足本所求故；是慧消融，能除煩惱諸焦熱故；是慧悅豫，不斷法樂故；是慧正念，了所緣義故；是慧安住，具三十七助道法故；是慧得相，如所行乘能具足故；是慧解相，性智照故；是慧能度，過諸流故；是慧能進，成正定決定故；是慧正見，具足一切諸善法故；是慧歡喜，墮煩惱者能拔濟故；是慧殊勝，得頂法故；是慧微妙，自然覺故；是慧不行，不近三世故；是慧攝取，具一切方便故；是慧能斷，過諸思想故；是慧不放逸，捨離闇曚故；是慧初始，發行一切諸善法故；是慧能發，具諸乘故；是慧照明，除無明網故；是慧與眼，一切眾生如其所解得明了故；是慧無依，過眼色故；是慧第一義，出真實故；是慧無諍，善分別故；是慧明了，向智門故；是慧無盡，能遍行故；是慧不逆，見十二緣故；是慧解脫，諸纏繫縛悉善斷故；是慧不雜，離於一切障礙法故。",
        "translation": "是慧能解，觀了善法不善法故；是慧如箭，善射法故；是慧財行，聖法現在故；是慧真解，斷除諸見煩惱障礙諸覆蓋故；是慧定願，悉能滿足本所求故；是慧消融，能除煩惱諸焦熱故；是慧悅豫，不斷法樂故；是慧正念，了所緣義故；是慧安住，具三十七助道法故；是慧得相，如所行乘能具足故；是慧解相，性智照故；是慧能度，過諸流故；是慧能進，成正定決定故；是慧正見，具足一切諸善法故；是慧歡喜，墮煩惱者能拔濟故；是慧殊勝，得頂法故；是慧微妙，自然覺故；是慧不行，不近三世故；是慧攝取，具一切方便故；是慧能斷，過諸思想故；是慧不放逸，捨離闇曚故；是慧初始，發行一切諸善法故；是慧能發，具諸乘故；是慧照明，除無明網故；是慧與眼，一切眾生如其所解得明了故；是慧無依，過眼色故；是慧第一義，出真實故；是慧無諍，善分別故；是慧明了，向智門故；是慧無盡，能遍行故；是慧不逆，見十二緣故；是慧解脫，諸纏繫縛悉善斷故；是慧不雜，離於一切障礙法故。",
        "source": "T13n0397_028:0199a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T13n0397_028:0199b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生所有心行，如是智慧悉能照達，如眾生心行慧思智、諸煩惱門，如是智慧皆悉觀了。",
        "translation": "\"Such wisdom fully illuminates the mental functions of all sentient beings, and such wisdom fully observes the mental functions, wisdom, deliberation, and understanding of the various afflictive gates of sentient beings.",
        "source": "T13n0397_028:0199b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聲聞、緣覺、菩薩、如來所有智慧，是菩薩悉能遍學。",
        "translation": "If there's wisdom of śrāvakas, pratyekbuddhas, bodhisattvas, and tathāgatas, this is the kind of wisdom that bodhisattvas can thoroughly study.",
        "source": "T13n0397_028:0199b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T13n0397_028:0199b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩無盡之慧，以是無盡慧具無盡智。」",
        "translation": "This is called the inexhaustible wisdom of a bodhisattva, and because of this inexhaustible wisdom comes inexhaustible knowledge.\"",
        "source": "T13n0397_028:0199b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是法時，三萬二千菩薩善根熟者得無生法忍。",
        "translation": "When this teaching was given, 32,000 bodhisattvas with well-established roots attained the patient acceptance of the nonarising of the Dharma.",
        "source": "T13n0397_028:0199b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經卷第二十八",
        "translation": "Dafangdengdaji jing, vol. 28",
        "source": "T13n0397_028:0199b15_0",
        "is_bad_quality": false
    }
]