[
    {
        "source_sentence": "大方等大集經卷第十八",
        "translation": "Dafangdengdaji jing, vol. 18",
        "source": "T13n0397_018:0122a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Translated by the Tripiṭaka of Northern Liang and India, Dharmakṣema",
        "source": "T13n0397_018:0122a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎虛空藏菩薩品第八之五",
        "translation": "Ākāśagarbha-bodhisattva-pin 8-5",
        "source": "T13n0397_018:0122a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此偈已。",
        "translation": "After speaking this verse, Māra Pāpīyān arrived at the Buddha's place in the form of an elder and bowed his feet to him.",
        "source": "T13n0397_018:0122a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬嚴四種兵來詣佛所，到已化作長者形，前禮佛足，在一面立，而白佛言：「希有，世尊！",
        "translation": "Māra Pāpīyān, who had arrived with four kinds of troops, took the form of an elder, bowed his head at the Buddha's feet, stood to one side, and said to him, \"It's rare, Bhagavān!",
        "source": "T13n0397_018:0122a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸大士乃能成就如是不可思議種種神變，又能示現不可思議莊嚴之事。",
        "translation": "These great men are capable of accomplishing such unfathomable miracles and of displaying unfathomable adornments.",
        "source": "T13n0397_018:0122a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0122a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世有幾所眾生，聞此不可思議神變而得開悟，決定不疑者也？」",
        "translation": "How many sentient beings in the future will hear of this unfathomable miracle and become enlightened and definitely not doubt it?\"",
        "source": "T13n0397_018:0122a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告魔波旬言：「於未來世中，少有眾生若一、若二，聞此不可思議神變經典，得信解者少耳。",
        "translation": "The Buddha told Māra Pāpīyān, \"In a future life, few sentient beings, whether one or two, will hear this unfathomable miraculous sūtra and come to believe it.",
        "source": "T13n0397_018:0122a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0122a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻如一毛析為百分，以一分毛於大海中取一渧水，於汝意云何，取者多耶？",
        "translation": "It's like dividing a hair into parts, and using one part of a hair to extract one drop of water from the ocean, what do you think, does it take more?",
        "source": "T13n0397_018:0122a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在者多耶？」",
        "translation": "Are there many of them here?\"",
        "source": "T13n0397_018:0122a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬言：「世尊！",
        "translation": "Pāpīyān said, \"Bhagavān!",
        "source": "T13n0397_018:0122a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取者甚少，在者甚多。」",
        "translation": "Those who take it are very little, and those who remain are very numerous.\"",
        "source": "T13n0397_018:0122a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告波旬言：「如海中所取水甚少，眾生聞是不可思議神變經典，能信解者少亦如是。",
        "translation": "Again, the Buddha told Pāpīyān, \"Just as the water taken from the ocean is very little, so are the few sentient beings who hear this inconceivable miraculous sūtra and are able to believe and understand it.",
        "source": "T13n0397_018:0122a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大海中水在者甚多，不信解不可思議神變經典者，多亦如是。」",
        "translation": "Just as there's a lot of water in the ocean, so are there many who don't believe and understand this inconceivable miraculous sūtra.\"",
        "source": "T13n0397_018:0122a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告波旬：「若有一人於恒河沙等劫，日日以滿三千大千世界，滿中珍寶持用布施，不如善男子、善女人聞是不可思議神變經典，能信解者其福甚多。",
        "translation": "Again, the Buddha told Pāpīyān, \"If one person filled 3,000 great thousand worlds with treasures and gave them away day by day for eons as great as the sands of the Ganges, that wouldn't be as good as a good man or woman who hears this unfathomable scripture of miraculous power and is able to believe and understand it, that person would be very fortunate.",
        "source": "T13n0397_018:0122a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0397_018:0122a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0122a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有信解是經典者，則知其人親從釋迦牟尼如來聞是經典信解無疑。",
        "translation": "\"If someone has faith and understanding of this sūtra, then they know that they've heard this sūtra from the Tathāgata Śākyamuni personally and have no doubts about their faith and understanding.",
        "source": "T13n0397_018:0122a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_018:0122a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0122a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未種善根眾生聞此世所難信經典，能信解者無有是處。",
        "translation": "If sentient beings who haven't yet cultivated good roots hear this scripture that's difficult to believe in the world, there's no place for those who can believe and understand it.",
        "source": "T13n0397_018:0122a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「波旬！",
        "translation": "\"Pāpīyān!",
        "source": "T13n0397_018:0122a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我般涅槃後法欲滅時，多有憍慢眾生。",
        "translation": "When I was about to extinguish the Dharma after parinirvāṇa, there were many conceited sentient beings.",
        "source": "T13n0397_018:0122a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生著我所說文字，不知方便故，各各生於諍競，捨思惟法，捨已正行為利養名譽衣服飲食，自纏縛故，樂論世俗種種諸事及世典文辭，而不論第一實義、不樂翫習佛無上道，反向他人譏論如是等真實深妙經典，則為誹謗諸佛，積集無量大苦惱聚。",
        "translation": "Those sentient beings cling to the words I've taught them, don't know the way, become contentious, abandon contemplation of the Dharma, abandon their right behavior for the sake of gaining fame, clothing, and food, and because they're bound by themselves, they delight in discussing various worldly affairs and worldly texts, disregard the ultimate truth, dislike the cultivation of the Buddha's unsurpassed path, and criticize others for speaking ill of such truly profound and subtle sūtras, which denigrate the buddhas and accumulate measureless great gathers of suffering and anguish.",
        "source": "T13n0397_018:0122a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔神諸天佐助彼人，為利養恭敬及名聞故，重增放逸慠慢。",
        "translation": "Māra spirits and gods assist those people, and for the sake of nurturing respect and fame, they repeatedly increase their dissipation and arrogance.",
        "source": "T13n0397_018:0122b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸人等以慠慢故，若見有持戒賢行比丘受持讀誦此經典者，而輕慢憎嫉橫生謗毀。",
        "translation": "Because of their arrogance, if those people see a monk who upholds precepts and conducts himself in a virtuous way accepting the reading and recitation of this sūtra, they despise, hate, and hate it, and they denigrate it.",
        "source": "T13n0397_018:0122b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸愚人則為現世破犯禁戒，其中或有畏不活者，或慚耻於人者，假被袈裟，或有捨戒還附俗者，如是等人身壞命終，墮阿鼻地獄受諸苦報。」",
        "translation": "Those foolish people then break the prohibited precepts for the present life, and some of them may become afraid not to live, or they may be ashamed of others, falsely wearing robes, or they may abandon the precepts and return to the secular world; thus, when their bodies break up and their lives end, they'll fall into the avīci hell and receive the painful consequences.\"",
        "source": "T13n0397_018:0122b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告波旬：「於未來世中，若有求菩薩乘眾生，著諸因緣善根微淺，新發道意但著文字不能了義。",
        "translation": "The Buddha again told Pāpīyān, \"In the future, if there are sentient beings seeking the bodhisattva vehicle who are attached to various causes and conditions and have shallow good roots, and who have newly arisen the intention to follow the path but are attached to words, they won't be able to grasp its meaning.",
        "source": "T13n0397_018:0122b11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於如是等甚深經典，受持讀誦為人說時，則為他人所見輕賤陵蔑。",
        "translation": "When they retain, read, and recite such a profound sūtra and tell it to others, they'll be despised and belittled in the eyes of others.",
        "source": "T13n0397_018:0122b14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以為他人所輕賤陵蔑故，便捨如是等甚深經典，讀誦聲聞辟支佛相應經典。",
        "translation": "Because they despise and belittle others, they abandon such profound sūtras and recite sūtras associated with śrāvakas and pratyekbuddhas.",
        "source": "T13n0397_018:0122b15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為利養名譽種種所須之所纏縛故，反誹謗毀呰如是真實甚深經典；又復輕賤受持讀誦此經典者，乃至不欲以眼觀之，常樂卑行退失菩薩大乘之法，所謂退失淳至心及深心。",
        "translation": "Because they're tied up by the various necessities of gain and fame, they denigrate and disparage such truly profound sūtras, despise those who read and recite them, don't even want to look at them with their eyes, and always enjoy humble behavior and regress from the bodhisattva's great vehicle teaching, which is called regressing from a simple and profound mind.",
        "source": "T13n0397_018:0122b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔神諸天得如是等人便故，勤作方便壞亂其心，乃至使令不聞如是等經。",
        "translation": "Because demons and gods get an advantage over people like this, they diligently work to disrupt their minds, even to the point of causing them not to hear such sūtras.",
        "source": "T13n0397_018:0122b21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設當聞者，生大誹謗無有信心。",
        "translation": "Even if someone were to hear them, they would become a great reproach and have no faith.",
        "source": "T13n0397_018:0122b23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人亦復積集無量罪聚，成就破法重業，永離三寶，不得見佛聞法及供養僧。",
        "translation": "That person also accumulates an incalculable amount of sins, creates heavy karma that breaks the teachings, and is permanently separated from the Three Treasures, unable to see the Buddha, hear the Dharma, or make offerings to the saṃgha.",
        "source": "T13n0397_018:0122b23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0397_018:0122b25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0122b25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以於如來所說法律中生疑猶豫故。」",
        "translation": "It's because he has doubts and hesitations about the teaching of the Tathāgata.\"",
        "source": "T13n0397_018:0122b26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔波旬自見有過憂愁惶恐，前禮佛足在一面立。",
        "translation": "Then, Māra Pāpīyān, seeing himself troubled and frightened, bowed his head at the Buddha's feet and stood to one side.",
        "source": "T13n0397_018:0122b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時虛空藏菩薩問魔波旬言：「汝何以憂愁憔悸戰慄悚息，狀如失志人，在一面立耶？」",
        "translation": "The Ākāśagarbha Bodhisattva then asked Māra Pāpīyān, \"Why are you so sad and anxious, frightened and frightened, with the appearance of a man who's lost his mind, standing at one side?\"",
        "source": "T13n0397_018:0122b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔波旬答言：「善男子！",
        "translation": "Māra Pāpīyān replied, \"Good sons!",
        "source": "T13n0397_018:0122c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從如來聞說如是等可畏之事，是故以為憂愁恐怖，當墮何趣？",
        "translation": "I've heard from the Tathāgata about such frightening things, so I'm sad and frightened because of them.",
        "source": "T13n0397_018:0122c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當救我？",
        "translation": "Who will save me?",
        "source": "T13n0397_018:0122c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於如來所說法律之中，數作無量諸留難事，是故憂耳。」",
        "translation": "I have repeatedly done measureless difficult things within the Tathāgata's explanation of the Dharma, so I'm sad.\"",
        "source": "T13n0397_018:0122c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏言：「波旬！",
        "translation": "Ākāśagarbha said, \"Pāpīyān!",
        "source": "T13n0397_018:0122c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛法之中有出罪法，汝可來至世尊所，可誠心懺悔所作諸惡，更莫復作。",
        "translation": "Among the Buddha's teachings is the teaching to get rid of sins, so you can come to the Bhagavān and sincerely repent of the bad deeds you've done and never do them again.",
        "source": "T13n0397_018:0122c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是可獲善利，為不空過。」",
        "translation": "If you can do so, you'll obtain a good benefit, which is not an empty mistake.\"",
        "source": "T13n0397_018:0122c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天魔波旬即前五體投地，禮世尊足下，仰視如來流淚涕泣而白佛言：「世尊！",
        "translation": "At that point, Māra Pāpīyān threw himself five times to the ground, bowed his head at the Bhagavān's feet, looked up at the Tathāgata, wept, and said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0122c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今誠心懺悔，從昔以來於如來所說法律之中，數作無量諸留難事。",
        "translation": "I now sincerely repent that since the distant past, I've repeatedly done countless difficult things within the laws taught by the Tathāgata.",
        "source": "T13n0397_018:0122c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊起大悲心，以慈愍故願受懺悔。」",
        "translation": "Please let the Bhagavān have great compassion and accept my repentance out of kindness.\"",
        "source": "T13n0397_018:0122c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T13n0397_018:0122c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0122c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝乃能自見所作諸惡，為上善哉！",
        "translation": "Is it good that you can see for yourself the evils that you do?",
        "source": "T13n0397_018:0122c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能如是悔過罪者，於佛法中則為弘廣如來法藏，諸佛亦受其人悔過，是故汝今勿更復作。」",
        "translation": "Those who thus repent of their transgressions will help to expand the Tathāgata's Dharma treasury within the Buddha's teachings, and the buddhas will accept their repentance; therefore, you mustn't do it again now.\"",
        "source": "T13n0397_018:0122c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告眾菩薩言：「諸賢士！",
        "translation": "It was then that the Bhagavān addressed the bodhisattvas, \"Good men!",
        "source": "T13n0397_018:0122c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等各說過魔界行法，為生憐愍魔波旬故。」",
        "translation": "Each of you has told us about the practices in the Māra realm, so we can have compassion for Māra Pāpīyān.\"",
        "source": "T13n0397_018:0122c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾中有一菩薩名金山王，在眾中坐即白佛言：「世尊！",
        "translation": "At the time, there was a bodhisattva named King of Gold who was sitting among the crowd and said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0122c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有防護內界者，則為未過魔界。",
        "translation": "If someone guards the internal realm, then they haven't yet surpassed the demonic realm.",
        "source": "T13n0397_018:0122c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有菩薩見一切諸界同佛界者，知此佛界即是非界，是為菩薩能過魔界。」",
        "translation": "If another bodhisattva sees that all the elements are the same as the Buddha's element and knows that the Buddha's element is what's not the element, this is a bodhisattva who's able to transcend the Māra's element.\"",
        "source": "T13n0397_018:0122c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，寶德菩薩白佛言：「世尊！",
        "translation": "It was then that the Baode bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0122c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有依倚樔窟者，是為魔界。",
        "translation": "If someone relies on a cave, this is the demon realm.",
        "source": "T13n0397_018:0122c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩不倚樔窟，知一切法無得相者，則能為諸眾生，說斷倚樔窟法，是為菩薩能過魔界。」",
        "translation": "If there's a bodhisattva who doesn't rely on a cave and knows that all things lack characteristics, then he can explain to sentient beings the way to end reliance on a cave, and this is a bodhisattva who can surpass the demonic realm.\"",
        "source": "T13n0397_018:0122c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，寶手菩薩白佛言：「世尊！",
        "translation": "It was then that the Jewel-Armed Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0122c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有取我我所者，是為魔界。",
        "translation": "\"If there's someone who takes self and self-as-possession, this is the demon realm.",
        "source": "T13n0397_018:0122c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩不取我我所者，則無諍競。",
        "translation": "If there are bodhisattvas who don't grasp to self and what belongs to self, then there's no strife.",
        "source": "T13n0397_018:0122c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無諍競故則無心行，況當有魔界耶！",
        "translation": "Because there's no strife, then there's no mental activity, so how could there be a demonic realm?",
        "source": "T13n0397_018:0122c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩能過諸魔界。」",
        "translation": "This is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0122c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，無諍勇菩薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Without Doubt said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0122c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有觸有離則有諍訟，有諍訟者魔得其便。",
        "translation": "If there's touch and separation, then there's a dispute, and when there's a dispute, Māra gets an advantage over it.",
        "source": "T13n0397_018:0122c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無觸無離自不諍訟，亦不令他諍訟，以得無我故無惱行者，能過魔界。」",
        "translation": "If there's no touch and no separation, he doesn't argue on his own, and he doesn't cause others to argue; he's able to surpass the realm of Māra because he has attained selflessness and therefore has unconflicted practice.\"",
        "source": "T13n0397_018:0123a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，寶思菩薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Baosi said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有妄想分別則是煩惱，及有煩惱處則是魔界。",
        "translation": "If there's deluded conceptual discrimination, then it's an affliction, and where there's an affliction, it's the realm of Māra.",
        "source": "T13n0397_018:0123a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩知一切諸法無相貌者，於諸煩惱則無妄想。",
        "translation": "If a bodhisattva knows that all things are without characteristics, then he has no deluded conceptions about the afflictions.",
        "source": "T13n0397_018:0123a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若內若外亦不別知，去離一切妄想分別故，是為菩薩能過魔界。」",
        "translation": "Whether it's internal or external and not known separately, this is a bodhisattva who's able to transcend the realm of Māra because he's free of all deluded conceptual discrimination.\"",
        "source": "T13n0397_018:0123a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，樂作菩薩白佛言：「世尊！",
        "translation": "At that point, the bodhisattva Pārśva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有樂不樂處，則有憎有愛。",
        "translation": "If there's a place of pleasure and displeasure, then there's hatred and craving.",
        "source": "T13n0397_018:0123a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有憎有愛，則是魔界。",
        "translation": "If there's hatred and craving, then it's the realm of Māra.",
        "source": "T13n0397_018:0123a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩去離憎愛平等行者，於諸法中則無二想，得入不可思議界，是為菩薩能過魔界。」",
        "translation": "If there are bodhisattvas who practice equally, free of craving and abhorrence, then they have no dualistic perceptions among dharmas and can enter the unfathomable realm, which is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0123a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，離諍菩薩白佛言：「世尊！",
        "translation": "At that point, the bodhisattva Free From Strife said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔界由我而起，若菩薩能知我者，得無我忍即知我淨，知我淨故知一切法淨，知一切法淨故，知諸法性淨如虛空，是為菩薩能過魔界。」",
        "translation": "The realm of Māra arises from the self; if a bodhisattva can know the self, attaining the tolerance of selflessness means knowing that the self is purified; knowing that the self is purified means knowing that all things are purified; knowing that all things are purified means knowing that the nature of all things is pure like space; this is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0123a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，法自在菩薩白佛言：「世尊！",
        "translation": "At that point, the bodhisattva Dharma Freely Embracing said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若順煩惱法為愛所使者，魔則得其便。",
        "translation": "If he follows the afflictive forces and becomes an envoy of desire, then Māra gets an advantage over him.",
        "source": "T13n0397_018:0123a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0123a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩於諸法中最得自在自然開悟，以為諸佛之所授記，於菩提法終不退轉，是為菩薩能過魔界。」",
        "translation": "If there's a bodhisattva who has attained the most unimpeded spontaneous enlightenment among all dharmas, who has been predicated by the buddhas, and who never turns back from the teaching of enlightenment, this is a bodhisattva who can surpass the demonic realm.\"",
        "source": "T13n0397_018:0123a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，山相擊音菩薩白佛言：「世尊！",
        "translation": "It was then that the Mountain Sound Blaster Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若心有缺漏，則是魔界。",
        "translation": "If there are deficiencies in the mind, then it's the realm of Māra.",
        "source": "T13n0397_018:0123a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩戒無缺漏、心無缺漏，成就一切諸空法行者，是為菩薩能過魔界。」",
        "translation": "If a bodhisattva's precepts are uncontaminated, his mind is uncontaminated, and he accomplishes the practice of all the qualities of emptiness, this is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0123a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，喜見菩薩白佛言：「世尊！",
        "translation": "It was then that the joyful-viewing bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有不見佛、不聞法者，魔得其便。",
        "translation": "\"If there are people who don't see the Buddha and don't hear the Dharma, Māra gets an advantage over them.",
        "source": "T13n0397_018:0123a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩常見諸佛而不著色像，常聽諸法而不著文字，以見法故則為見佛，以無言說故能聽諸法，是為菩薩能過魔界。」",
        "translation": "If there's a bodhisattva who sees the buddhas without attaching to form and always listens to the Dharma without attaching to words, and it's because of seeing the Dharma that he sees the buddhas and because of the absence of language that he can listen to the Dharma, this is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0123a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，帝網菩薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Tib. net said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有恃有動，則是魔界。",
        "translation": "If there's reliance and agitation, then it's the realm of Māra.",
        "source": "T13n0397_018:0123b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩善相順精進，知一切法究竟無成就相故不恃不動，是為菩薩能過魔界。」",
        "translation": "If a bodhisattva well conducts himself with effort and knows that all things are ultimately without accomplished characteristics and therefore aren't relied upon or moved, this is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0123b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，德明王菩薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva King of Virtue and Light said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有行二法者，則魔得其便。",
        "translation": "If there are people who practice two things, then Māra gets an advantage over them.",
        "source": "T13n0397_018:0123b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩知一切法同於法性，則不見魔界與法性有異解。",
        "translation": "If a bodhisattva knows that all things are the same as the Dharma nature, then he won't see any difference between the Māra realm and the Dharma nature.",
        "source": "T13n0397_018:0123b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知法性與魔界等，以不二相故，是為菩薩能過魔界。」",
        "translation": "Knowing that the nature of reality and the realm of Māra are the same because they aren't two things, this is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0123b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，香象菩薩白佛言：「世尊！",
        "translation": "It was then that the Fragrant Elephant Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩性弱畏甚深法者，則魔得其便。",
        "translation": "If there are bodhisattvas who are weak in nature and fear the profound Dharma, then Māra gets an advantage over them.",
        "source": "T13n0397_018:0123b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若勇健菩薩善能通達三解脫門，於甚深法不驚不畏，以能現前證知諸法實性故，是為菩薩能過魔界。」",
        "translation": "If a courageous bodhisattva well penetrates the three gates of liberation and isn't frightened or intimidated by profound dharmas because he can directly realize the true nature of dharmas, this is a bodhisattva who can surpass the realm of Māra.\"",
        "source": "T13n0397_018:0123b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒菩薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻如大海中水同一鹹味，佛法海中亦復如是，同一法味，所謂解脫味、離欲味。",
        "translation": "It's like the water in the ocean has the same salty taste, and so does the ocean of the Buddha's teaching have the same taste of the teaching, which is called the taste of liberation and the taste of freedom from desire.",
        "source": "T13n0397_018:0123b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩善解一味法者，是為菩薩能過魔界。」",
        "translation": "If a bodhisattva well understands the taste of one taste of the Dharma, this is a bodhisattva who can surpass the demonic realm.\"",
        "source": "T13n0397_018:0123b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，虛空藏菩薩白佛言：「世尊！",
        "translation": "At that point, the Ākāśagarbha Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻如虛空究竟無垢、究竟明淨、究竟不為，一切煙塵雲霧之所干繞。",
        "translation": "It's likened to space that's ultimately undefiled, ultimately clear, and ultimately unobstructed by all the smoke, dust, and clouds that surround it.",
        "source": "T13n0397_018:0123b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩亦復如是，心如虛空，知一切法性常清淨，亦復不為客塵煩惱之所干繞，得度般若波羅蜜彼岸，離諸闇冥，於諸法得慧光明者，是為菩薩能過魔界。」",
        "translation": "So too, a bodhisattva whose mind is like space, who knows that the nature of all things is always pure, who isn't obstructed by the afflictions of visitors and dust, who has crossed to the other shore of prajñāpāramit, who is free of darkness, and who has attained the wisdom and light of those things, is a bodhisattva who is able to transcend the realm of Māra.\"",
        "source": "T13n0397_018:0123b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，文殊師利法王子菩薩白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī, Prince of the Dharma, said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有言語，則有滯礙；若有滯礙，則是魔界。",
        "translation": "If there's speech, then there's obstruction, and if there's obstruction, then it's the demonic realm.",
        "source": "T13n0397_018:0123b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法不為一切言說所表者，乃無滯礙。",
        "translation": "If the Dharma isn't expressed in all speech, then there are no obstructions.",
        "source": "T13n0397_018:0123b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂法不可言說？",
        "translation": "What's meant by a dharma that's inexpressible?",
        "source": "T13n0397_018:0123b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂第一義，其第一義中亦無文字及義。",
        "translation": "It's called the ultimate truth, and there are no words or meanings in that ultimate truth.",
        "source": "T13n0397_018:0123b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩能行第一義諦，於一切法盡無所行，是為菩薩能過魔界，無所過故。」",
        "translation": "If a bodhisattva can practice the truth of the ultimate truth and do nothing with respect to all things, this is because a bodhisattva can transcend the demonic realm and have nothing to transcend.\"",
        "source": "T13n0397_018:0123b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告波旬言：「汝聞說過魔界法不也？」",
        "translation": "It was then that the Bhagavān addressed Pāpīyān, \"Have you heard that you've talked about the teaching of the demonic realm?\"",
        "source": "T13n0397_018:0123c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬白佛言：「世尊！",
        "translation": "Pāpīyān said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0123c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然已聞。」",
        "translation": "Yes, I've heard it.\"",
        "source": "T13n0397_018:0123c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「波旬！",
        "translation": "The Buddha said, \"Pāpīyān!",
        "source": "T13n0397_018:0123c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有行如是等法者，一切諸魔無如之何？",
        "translation": "If someone practices such a thing, what would all the Māras do?",
        "source": "T13n0397_018:0123c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有諸魔欲於行人起魔事者，終不能辦，而更成就無量罪聚。",
        "translation": "If there are demons who want to do demonic things to humans, they'll never be able to do them, and they'll create an incalculable amount of sins.",
        "source": "T13n0397_018:0123c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，波旬！",
        "translation": "Therefore, Pāpīyān!",
        "source": "T13n0397_018:0123c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可發阿耨多羅三藐三菩提心，於如是過魔界法，應堅持奉行。",
        "translation": "\"You may give rise to the mind of unsurpassed, correct, and complete enlightenment, and you should insist on practicing such a method that transcends the realm of Māra.",
        "source": "T13n0397_018:0123c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能如是行者，則能過一切諸魔國界。",
        "translation": "If you can thus practice it, you'll be able to surpass all the realms of Māra.",
        "source": "T13n0397_018:0123c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0123c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻如百千年垢膩可於一日浣令鮮淨，如是於百千劫中所集諸不善業，以佛法力故善順思惟，於一日一時盡能消滅。",
        "translation": "It's like a hundred thousand years of dirt and grime that can be cleaned up in a single day, and thus the unwholesome actions collected over a hundred thousand eons can be completely extinguished in a single day by skillfully contemplating them because of the power of the Buddha's teaching.",
        "source": "T13n0397_018:0123c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0123c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有乾草[卄/積]大如須彌，以少火投中速能燒盡。",
        "translation": "\"Suppose there's a dry blade of grass [20/grain] as large as a sumac that can be quickly burned up with a little fire thrown into it.",
        "source": "T13n0397_018:0123c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是以少慧力故，能除滅無量諸闇冥聚。",
        "translation": "Thus, by the power of a little wisdom, it can remove measureless piles of darkness and ignorance.",
        "source": "T13n0397_018:0123c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_018:0123c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T13n0397_018:0123c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧明勇猛故，無明劣弱故。」",
        "translation": "It's because the insight of wisdom is bold and vigorous, and ignorance is weak.\"",
        "source": "T13n0397_018:0123c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬即作是念：「大慈世尊今憐愍我，而能為我說菩提心法，我今宜應於如來所種少善根。」",
        "translation": "Māra Pāpīyān then had this thought, \"Now that the Bhagavān has pity on me and can teach me the Dharma of the mind of enlightenment, I should plant a few good roots in the Tathāgata's place.\"",
        "source": "T13n0397_018:0123c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，波旬即化作八萬四千殊妙寶蓋及無量華鬘、瓔珞、末香、塗香，而告己眷屬言：「諸佛、世尊出世甚難，卿等諸人咸應共來至世尊所，為供養故。」",
        "translation": "Pāpīyān then transformed himself into 84,000 exquisitely jeweled canopies and measureless flowers, jewelry, powdered incense, and smeared incense, and told his followers, \"It's very difficult for the buddhas and the Bhagavān to appear in the world, so all of you should come together to the Bhagavān's place to make offerings.\"",
        "source": "T13n0397_018:0123c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔天眷屬中有八萬四千眾及魔波旬，各共持殊妙寶蓋及無量華香、瓔珞、末香、塗香，至世尊所設供養已，皆發阿耨多羅三藐三菩提心。",
        "translation": "At the time, 84,000 of the Māra gods' retinue and the Māra Pāpīyān each carried a magnificent jeweled lid and measureless amounts of flowers, jewelry, powdered incense, and smeared incense, and after making their offerings to the Bhagavān, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_018:0123c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸餘魔眷屬諸天不發菩提心者，形相嗤笑譏論波旬，復言：「希有波旬，乃能於沙門瞿曇前，詐現如是篤信之相，狀如至親。",
        "translation": "The rest of Māra's retinue of gods who hadn't aroused the intention to achieve enlightenment were ridiculing Pāpīyān and saying, \"Rarely, Pāpīyān, could he fraudulently display such a faithful appearance before the ascetic Gautama, behaving like a close relative.",
        "source": "T13n0397_018:0123c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，波旬或欲於沙門瞿曇所學呪幻方術，是故今於面前，現善讚譽耳。」",
        "translation": "That's because Pāpīyān might have wanted to learn the magic spells and techniques from the ascetic Gautama, so he gave them a good reputation in front of him.\"",
        "source": "T13n0397_018:0123c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔子醜面及餘魔子等，悉無信心各說是言：「假使沙門瞿曇以諸方術迴轉魔王者，我等共當設諸方便令如是等經不得流布。",
        "translation": "At the time, Māra Boy Ugly Face and the other Māra Boys all had no faith and each said, \"Suppose the ascetic Gautama uses some technique to turn the tables on the demon king, then we will work together to prevent the dissemination of such a scripture.",
        "source": "T13n0397_018:0123c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使流布者，亦當令少有護助，信受行者亦令甚少，當為多人之所薄賤輕弄，常墮邊方不令中國之所宣傳。",
        "translation": "Even if we were to distribute them, they would have few supporters and few faithful practitioners, and they would be despised by many people and always fall into a remote place where they wouldn't be publicized in China.",
        "source": "T13n0397_018:0124a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯使諸無威德貧窮眾生當得聞之，常為諸大威德豪富之人不信誹謗也。」",
        "translation": "Only those poor sentient beings without authoritative qualities will hear them, and they'll always be disbelieved and denigrated by wealthy people with great authoritative qualities.\"",
        "source": "T13n0397_018:0124a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎爾時，世尊告虛空藏菩薩言：「賢士！",
        "translation": "It was then that the Bhagavān addressed the Ākāśagarbha Bodhisattva, saying, \"Good man!",
        "source": "T13n0397_018:0124a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝聞此諸魔子出是惡言不耶？」",
        "translation": "Have you heard this bad speech from these Māra children?\"",
        "source": "T13n0397_018:0124a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏白佛言：「唯然已聞。」",
        "translation": "The Ākāśagarbha said to the Buddha, \"Yes, I've heard it.\"",
        "source": "T13n0397_018:0124a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T13n0397_018:0124a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝當安慰護助此妙經典，為降伏諸魔神故。」",
        "translation": "Therefore, you must comfortably support this wonderful sūtra in order to subdue the demons.\"",
        "source": "T13n0397_018:0124a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，虛空藏菩薩即白佛言：「諸佛世尊皆已護持如是等經，我等亦當安慰受持。」",
        "translation": "Thereupon, the Ākāśagarbha Bodhisattva said to the Buddha, \"The buddhas and world-honored ones have safeguarded such sūtras, so we will also comfortably uphold them.\"",
        "source": "T13n0397_018:0124a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，虛空藏菩薩即說呪曰，所謂：「阿跋低(一)　跋低(二)　毘跋低(三)　婆醯多[少/兔]散提(四)　頭樓陀羅尼(五)　涅伽多涅伽多尼(六)　鉢伽多尼(七)　迷羅育低(八)　伽樓那涅耐提(九)　薩遮跋低(十)　浮多勒差(十一)　達摩涅折低(十二)　達摩勒差(十三)　郁鳩離(十四)　尸鳩離(十五)　咻樓咻樓咻樓德迦攡(十六)　多婆婆帝低(十七)　尸羅[少/兔]婆帝低(十八)　阿叉夜涅涕池(十九)　枳奢婆迦利拖(二十)　佛駄遏提魅低(二十一)　達摩蔚耆羅泥(二十二)　僧伽[少/兔]銅咩(二十三)　阿[少/兔]頭隷(二十四)　不可濟度(二十五)　壞魔眷屬(二十六)　若犯此者(二十七)　無諸刀杖(二十八)　順已處行(二十九)　聖眾所住(三十)　吉吉等句(三十一)　順流解脫(三十二)　破諸外論(三十三)　降伏魔眾(三十四)「四王常護，　　及天帝釋，　　梵王世主，　奉佛諸天。",
        "translation": "爾時，虛空藏菩薩即說呪曰，所謂：「阿跋低(一)　跋低(二)　毘跋低(三)　婆醯多[少/兔]散提(四)　頭樓陀羅尼(五)　涅伽多涅伽多尼(六)　鉢伽多尼(七)　迷羅育低(八)　伽樓那涅耐提(九)　薩遮跋低(十)　浮多勒差(十一)　達摩涅折低(十二)　達摩勒差(十三)　郁鳩離(十四)　尸鳩離(十五)　咻樓咻樓咻樓德迦攡(十六)　多婆婆帝低(十七)　尸羅[少/兔]婆帝低(十八)　阿叉夜涅涕池(十九)　枳奢婆迦利拖(二十)　佛駄遏提魅低(二十一)　達摩蔚耆羅泥(二十二)　僧伽[少/兔]銅咩(二十三)　阿[少/兔]頭隷(二十四)　不可濟度(二十五)　壞魔眷屬(二十六)　若犯此者(二十七)　無諸刀杖(二十八)　順已處行(二十九)　聖眾所住(三十)　吉吉等句(三十一)　順流解脫(三十二)　破諸外論(三十三)　降伏魔眾(三十四)「四王常護，　　及天帝釋，　　梵王世主，　奉佛諸天。",
        "source": "T13n0397_018:0124a11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　護菩提者，　　如是等神，　常當擁護，　　降伏諸魔。",
        "translation": "Such guardians of enlightenment as these gods will always support and subdue Māra.",
        "source": "T13n0397_018:0124a26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　利眾生故，　受持正法，　　護說法師，　　盡當擁護。」",
        "translation": "For the benefit of sentient beings, they'll uphold the right teaching and protect Dharma preachers, and they'll safeguard them as much as possible.\"",
        "source": "T13n0397_018:0124a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏菩薩說此呪已。",
        "translation": "After the Ākāśagarbha Bodhisattva spoke this dhāraṇī, he said.",
        "source": "T13n0397_018:0124a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時，此妙寶莊嚴堂及三千大千世界六變振動。",
        "translation": "Immediately, this wonderful jeweled adornment hall and the 3,000 great thousand worlds were shaken by six transformations.",
        "source": "T13n0397_018:0124a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸魔子見上虛空中有五百密迹執金剛杵，熾然如火甚可怖畏。",
        "translation": "The Māras then saw five hundred hidden images in the sky carrying a vajra that was blazing like fire and very frightening.",
        "source": "T13n0397_018:0124b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸密迹唱如是言：「若有魔子及諸魔神，若聞此呪，其有不發阿耨多羅三藐三菩提心者，吾等當擊破其頭令作七分。」",
        "translation": "The hidden handlers then called out, \"If Māra and the demon spirits hear this dhāraṇī and don't arouse the mind of unsurpassed, correct enlightenment, we'll smash their heads into seven parts.\"",
        "source": "T13n0397_018:0124b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，魔子及諸眷屬，驚怖戰悚身毛皆竪，即合掌禮佛，而白佛言：「我等今發阿耨多羅三藐三菩提心。",
        "translation": "At that point, the demon son and his retinue, frightened and terrified, had their hair standing on end, saluted the Buddha with their palms together, and said to him, \"Now, we have aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_018:0124b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉，世尊！",
        "translation": "Good, Bhagavān!",
        "source": "T13n0397_018:0124b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願救我等離此恐怖得無畏樂。」",
        "translation": "May you save us from this fear and attain fearlessness and happiness.\"",
        "source": "T13n0397_018:0124b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告侍者阿難言：「如向此諸魔子所說言，我等當於來世於此經典作留難者，必當稱其本誓而作留難如斯經典。",
        "translation": "It was then that the Bhagavān addressed his attendant Ānanda, saying, \"As we've told these demons, we will make this sūtra difficult for them in the next life, and we will surely praise their original vow and make it difficult for them to read this sūtra.",
        "source": "T13n0397_018:0124b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯當以佛神力及諸菩薩受持故，當得流布於世，而無有多人受持讀誦分別解說。」",
        "translation": "Only because of the Buddha's supernormal power and the bodhisattvas' upholding it will it be spread throughout the world without many people upholding, reading, reciting, discerning, and explaining it.\"",
        "source": "T13n0397_018:0124b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告阿難：「汝見此諸魔子為脫恐怖故，發阿耨多羅三藐三菩提心不？」",
        "translation": "Again, the Buddha told Ānanda, \"Do you see these Māra children generating the mind of unsurpassed, correct, and complete enlightenment for the sake of freedom from fear?\"",
        "source": "T13n0397_018:0124b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0124b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然已見。」",
        "translation": "Only so have I seen it.\"",
        "source": "T13n0397_018:0124b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告阿難言：「此語即為諸魔子當作離魔事因，以不深心發菩提故。」",
        "translation": "Again, the Buddha told Ānanda, \"These words will serve as a cause for demons to part with the things that demons do because they don't have a profound mind to arouse bodhi.\"",
        "source": "T13n0397_018:0124b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告阿難：「於未來世，當有佛出現於世，名無垢相如來、應、正遍知，此魔波旬於彼佛所乃當不退轉發阿耨多羅三藐三菩提心。",
        "translation": "Again, the Buddha told Ānanda, \"In a future life, there will appear in the world a Buddha named Tathāgata of Immaculate Appearance, Worthy of Offerings, and Perfectly Omniscient, and this Māra Pāpīyān will never retrogress from that Buddha's presence and give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_018:0124b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T13n0397_018:0124b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼無垢相如來，知其深心成就故，當授阿耨多羅三藐三菩提記。",
        "translation": "Knowing his profound accomplishment of mind, the Tathāgata of the Immaculate Conception will grant him the mark of unsurpassed, correct enlightenment.",
        "source": "T13n0397_018:0124b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當于爾時，亦當作魔王，深心敬信於如來正法。",
        "translation": "At that point, he'll also become a demon king who has deep-rooted faith in the Tathāgata's right teaching.",
        "source": "T13n0397_018:0124b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彌勒出時，有魔王名曰導師，深心敬信佛法聖眾。",
        "translation": "Just like when Maitreya emerged, there was a Māra king named Tutor who had deep-rooted faith in the noble congregation of the Buddha's teachings.",
        "source": "T13n0397_018:0124b23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸五百魔子，亦當於彼生於魔中，當於彼佛所為菩提故種諸善根，乃至波旬成佛之時，當與授阿耨多羅三藐三菩提記。」",
        "translation": "These 500 children of Māra will also be born among Māra, and they will plant good roots in that Buddha's place for the sake of enlightenment, up to the point where Pāpīyān will be given the assurance of unsurpassed, correct enlightenment when he becomes a buddha.\"",
        "source": "T13n0397_018:0124b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難言：「此魔波旬，今雖發菩提心，猶豫不定，如少疊毳。",
        "translation": "The Buddha told Ānanda, \"Even though this Māra Pāpīyān has aroused the intention to achieve enlightenment, he's hesitant and uncertain, like a small amount of red clay.",
        "source": "T13n0397_018:0124b27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖爾，當漸漸成就無量功德，為世之尊如今我身。」",
        "translation": "Even so, he will gradually achieve measureless merit and become a world-honored one like me now.\"",
        "source": "T13n0397_018:0124b28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾中有無量無邊諸天世人、釋梵護世，聞授魔波旬記當得成佛，歡喜踊躍怪未曾有，合掌向佛，而作是言：「甚奇，希有！",
        "translation": "At the time, an infinite and unlimited number of gods, gods and humans, and Śākyamunis among the multitude heard that Māra Pāpīyān had been given the assurance that he would become a buddha, rejoiced and jumped for joy like never before, joined their palms to the Buddha, and said, \"How marvelous, how rare!",
        "source": "T13n0397_018:0124c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其見佛者必得成就無量功德法寶之聚。",
        "translation": "Those who see the Buddha will surely achieve an innumerable stock of merit and Dharma treasure.",
        "source": "T13n0397_018:0124c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，或有不信眾生，為欲撓亂如來故，而得見佛。",
        "translation": "That's why there might be unbelieving sentient beings who want to disturb the Tathāgata and then see the Buddha.",
        "source": "T13n0397_018:0124c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有遇會得見佛者，即為彼眾生作因，乃至令得涅槃。」",
        "translation": "If someone meets with them and gets to see the Buddha, they'll be the cause for those sentient beings, right up to the point of attaining nirvāṇa.\"",
        "source": "T13n0397_018:0124c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又白佛言：「世尊！",
        "translation": "He also said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0124c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自除如來、應、正遍知，誰能如是分別知眾生根？」",
        "translation": "Who is able to discern the faculties of sentient beings in this way except the Tathāgata, the Worthy One, and the Perfectly Omniscient One?\"",
        "source": "T13n0397_018:0124c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸天人言：「如汝等所言，其有得見如來者，無不蒙益。",
        "translation": "The Buddha addressed the gods and humans, \"As you say, no one who has seen the Tathāgata will be unbenefited.",
        "source": "T13n0397_018:0124c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知，或有眾生善根都盡，於無量阿僧祇那由他劫無人身分者，如是眾生見如來故，即便得作善因乃至涅槃，如來乃能如是作無量不可思議無上福田。」",
        "translation": "You should know that there are sentient beings whose good roots are all exhausted and who have no human identity for measureless incalculably long eons. Thus, because sentient beings see the Tathāgata, even though they can create good causes up to nirvāṇa, the Tathāgata can thus create an unfathomably unfathomable field of unsurpassed merit.\"",
        "source": "T13n0397_018:0124c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告諸天人言：「心性常淨，而凡愚眾生不能如實知見，以不能如實知見故言是垢；能正知見故便言是淨。",
        "translation": "The Buddha again told the gods, \"The mind is always pure in nature, but ordinary foolish sentient beings can't really know and see it, so they say it's defiled because they can't really know and see it; they say it's pure because they can correctly know and see it.",
        "source": "T13n0397_018:0124c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而第一實義中，無有一法可淨可污。",
        "translation": "In the ultimate true meaning, however, there's not a single thing that's pure or defiled.",
        "source": "T13n0397_018:0124c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知，諸煩惱者，無方無處非內非外，以不善順思惟故便生煩惱；善順思惟故則無煩惱。",
        "translation": "You should know that the afflictions have no direction or place, are neither internal nor external, and afflictions arise because they aren't well contemplated; when they are well contemplated, they're not afflicted.",
        "source": "T13n0397_018:0124c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增減不等則生煩惱；無增減者則無煩惱。",
        "translation": "When increase and decrease aren't equal, then affliction arises; when there's no increase or decrease, then there's no affliction.",
        "source": "T13n0397_018:0124c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛偽妄想便是煩惱；無有妄想則無煩惱。",
        "translation": "False and deluded conceptions are afflictions, and when there are no deluded conceptions, then there are no afflictions.",
        "source": "T13n0397_018:0124c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我言：如實知邪見則是正見，而邪見亦不即是正見。",
        "translation": "Therefore, I say, \"Truly knowing wrong views is right view, and wrong views are not right views.",
        "source": "T13n0397_018:0124c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能如實知者，則無虛妄、增減、取著，是故名為正見。」",
        "translation": "When someone can truly know this, there's no falsity, increase or decrease, or attachment, and it's therefore called right view.\"",
        "source": "T13n0397_018:0124c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告諸天人言：「喻如大地依水界住，大水依風界住，大風依虛空住，虛空無所依住。",
        "translation": "The Buddha again addressed the celestials, \"It's like the great earth standing on the water element, great water standing on the wind element, and great wind standing on space, which has no support.",
        "source": "T13n0397_018:0124c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是大地無所依住，而假有依住之名。",
        "translation": "Thus, the earth has no support, but it nominally has the name of support.",
        "source": "T13n0397_018:0124c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，汝等當如是知之，苦依於業、業依於結，而苦、業、結都無所依，以心性常淨故。",
        "translation": "Therefore, you should thus know that suffering depends on actions and actions depend on bonds, but suffering, actions, and bonds have no support because the mind is always pure in nature.",
        "source": "T13n0397_018:0124c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是當知，一切諸法無有根本，都無所住，以假言說故言有，而實無也。",
        "translation": "Thus, you should know that all dharmas have no root and no abode, and they're said to exist because they're spoken of falsely, but they really don't.",
        "source": "T13n0397_018:0124c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說一切法本性常淨，究竟無生無起。」",
        "translation": "Therefore, it's said that all things are eternally pure in nature and ultimately unarisen and unarisen.\"",
        "source": "T13n0397_018:0124c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告諸天人言：「是故汝等當知，此法門名為性常淨法門。",
        "translation": "The Buddha again addressed the gods and humans, \"Therefore, you should know that this dharma-gate is called the dharma-gate of eternal purity of nature.",
        "source": "T13n0397_018:0125a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩通達此門者，不為一切煩惱之所染污，而亦不恃此清淨門。",
        "translation": "When a bodhisattva fully comprehends this gate, he isn't stained by all the afflictions and doesn't rely on this pure gate.",
        "source": "T13n0397_018:0125a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以捨一切諸恃動故，便得平等道，能過魔界入於佛界，亦能得入諸眾生界，而不動法界；知一切法無界無非界，而能速生一切智界。」",
        "translation": "Because they abandon all agitation, they then attain the path of equality, can pass beyond the realm of Māra and enter the realm of the Buddha, and can enter the realm of sentient beings without moving the Dharma realm; knowing that all things lack realms and lack non-realms, they can quickly give rise to the realm of omniscience.\"",
        "source": "T13n0397_018:0125a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當說此法時，有五百菩薩得無生法忍。",
        "translation": "When this teaching was explained, five hundred bodhisattvas attained the forbearance of the nonarising of the Dharma.",
        "source": "T13n0397_018:0125a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，申越長者在於眾中，從座而起頂禮佛足，白佛言：「世尊！",
        "translation": "At the time, the elder Shen Yue was among the people, got up from his seat, bowed his head at the Buddha's feet, and said to him, \"Bhagavān!",
        "source": "T13n0397_018:0125a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我故說如是等甚深經典，我先為觸惱世尊故，作大火坑及設毒飯，而大聖如來是不可害者，故我於佛生信敬心。",
        "translation": "\"For my sake, I explained such a profound sūtra; I first made a huge fire pit and set up a poisoned meal to offend the Bhagavān, but the Tathāgata is a great sage who can't be harmed, so I developed faith and respect for the Buddha.",
        "source": "T13n0397_018:0125a09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自爾以來，疑悔心結常未能除滅，今者從佛聞此甚深微妙經典，疑悔即除，心無障礙得安樂行。",
        "translation": "Since then, I've never been able to remove the fetters of doubt and remorse, but now, after hearing this profound and subtle sūtra from the Buddha, my doubts and remorse were removed, and my mind was unobstructed, and I was able to practice with well-being.",
        "source": "T13n0397_018:0125a12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0125a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我信敬心轉復增長。",
        "translation": "That's why my faith and respect will grow again.",
        "source": "T13n0397_018:0125a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我家中多諸財寶，當以供佛法僧及諸沙門、婆羅門、貧窮孤獨、下賤乞兒。",
        "translation": "Now, I have a lot of wealth and treasure at home that I will give to the Buddha, Dharma, and Saṃgha, ascetics, orphans, and beggars of lowly means.",
        "source": "T13n0397_018:0125a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0125a17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當聞是斷一切縛甚深經典，而於一切諸物生貪著者乎？」",
        "translation": "Who would hear of this profound scripture that ends all fetters and yet become attached to all things?\"",
        "source": "T13n0397_018:0125a17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，虛空藏菩薩白佛言：「世尊！",
        "translation": "At that point, the Ākāśagarbha Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0125a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來無上菩提，甚為甚深難可測知。",
        "translation": "The unsurpassed enlightenment of the buddha-tathāgatas is so great and deep that it's hard to fathom.",
        "source": "T13n0397_018:0125a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩於未來世，捨己身命及利養名譽，而能侍佛菩提者，甚為難有。」",
        "translation": "It would be difficult to find a bodhisattva who would sacrifice his own life and reputation for profit in a future life and be able to serve the buddhas' enlightenment.\"",
        "source": "T13n0397_018:0125a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾中有六十八億菩薩，從座而起合掌向佛，一時同聲而說偈言：「世尊滅後，　　我等能忍，　　捨身壽命，　為護正法。",
        "translation": "At the time, six billion, eighty-eight million bodhisattvas in the crowd rose from their seats, joined their palms to the Buddha, and spoke in one voice, saying, \"After the Bhagavān's death, we'll be able to tolerate it and sacrifice our lives to protect the right teaching.",
        "source": "T13n0397_018:0125a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　捨利名譽，　　離諸貪著，　願護正法，　　為佛智故。",
        "translation": "Renouncing fame and renown, we're free of attachment, and we want to protect the right teaching for the sake of the Buddha's wisdom.",
        "source": "T13n0397_018:0125a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　罵詈呵責，　及譏刺語，　　護正法故，　　當忍受之。",
        "translation": "They ridicule, berate, and speak harshly, but they'll tolerate it because they protect the right teaching.",
        "source": "T13n0397_018:0125a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　輕賤毀弄，　　唱說惡名，　　當以慈忍，　為護此經。",
        "translation": "They despise and mock them, and they speak harsh words, but they will protect this sūtra with kindness and patience.",
        "source": "T13n0397_018:0125a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　來世比丘，　　計著諸有，　與魔為黨，　　誹謗正法，　　毀禁行惡，　樂著俗累，　　為利所覆，　　不樂正法，　恃翫俗典，　　憍慢放逸，　　高歎己利，　蔑正行者，　　常捨閑靜，　　樂處憒閙，　習世文辭，　　計著吾我；　　不營教化，　不業智慧，　　捨離坐禪，　　不親三寶，　無有智慧，　　群黨求利，　　動與結俱，　樂受他供；　　他慈心施，　　惜猶己有，　數往到彼，　　說諸世事；　　田宅居業，　及販賣事，　　勤求息利，　　猶言沙門。",
        "translation": "In a later age, monks became attached to existence, collaborated with Māra, denigrated the right teaching, violated prohibitions and behaved badly, became attracted to worldly encumbrances, were hindered by profit, didn't enjoy the right teaching, relied on the appreciation of worldly texts, were proud and carefree, exalted their own interests, disdained right practitioners, abandoned quietude, enjoyed boisterous situations, cultivated worldly speech, became attached to self, didn't teach, didn't practice wisdom, abandoned sitting meditation, weren't close to the Three Treasures, lacked wisdom, sought profit in groups, moved into bonds, enjoyed accepting offerings from others, gave with kindness to others, cherished their own possessions, frequently went there, and spoke of worldly affairs, farmed, lived, and sold, and diligently sought to make a profit, just as if they were ascetics.",
        "source": "T13n0397_018:0125a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慠慢著有，　　依邪嶮見，　　聞性空法，　當大驚怖。",
        "translation": "He's arrogant, attached to existence, and relying on a wrong and dangerous view, he'll be terrified when he hears the teaching of emptiness in nature.",
        "source": "T13n0397_018:0125b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　言後長遠，　　但求現報，　當虛妄說，　　非法言法。",
        "translation": "He says he'll seek only present rewards in the long run, and he'll falsely explain the teaching that's not true.",
        "source": "T13n0397_018:0125b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是大災，　弊惡比丘，　　魔及魔子，　　復當佐助。",
        "translation": "Such a great calamity will be aided by bad monks, Māra, and Māra's sons.",
        "source": "T13n0397_018:0125b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　經文是一，　　說義各異，　　各是己論，　愚者當爾。",
        "translation": "The text of the sūtras is the same, but their meanings differ, and each is an argument of its own, so foolish people should follow suit.",
        "source": "T13n0397_018:0125b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸深妙經，　　能與解脫，　當擁遏之，　　及說淺事。",
        "translation": "Those profound and wonderful sūtras that bring about liberation should be embraced and explained in simple terms.",
        "source": "T13n0397_018:0125b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我勝汝劣，　由勝得果，　　於佛法中，　　當如是競。",
        "translation": "I'm superior to you and you're inferior, and because of that superiority I've attained fruition, I will compete like this in the Buddha's teaching.",
        "source": "T13n0397_018:0125b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是競時，　　眾生數壞，　　為非法王，　之所惱逼。",
        "translation": "When we compete like this, the number of sentient beings will decrease, and they'll be harassed by non-Buddhist kings.",
        "source": "T13n0397_018:0125b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於是末世，　　壞甚可畏，　我持正法，　　救世所說。",
        "translation": "In this final age, when destruction is so frightening, I maintain the right teaching to save the world.",
        "source": "T13n0397_018:0125b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我常慈心，　不捨法律，　　生正大悲，　　為世作護。",
        "translation": "I'm always compassionate, don't abandon the law, and generate right compassion to protect the world.",
        "source": "T13n0397_018:0125b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　毀禁作惡，　　不住正法，　　墜墮何道，　我常憂愍。",
        "translation": "I'm always sympathetic when someone violates the prohibitions and does evil, doesn't abide in the right teaching, and falls into whatever path they're in.",
        "source": "T13n0397_018:0125b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　見故作惡，　　謗毀正者，　我終不共，　　與為親黨。",
        "translation": "I'll never share with anyone who sees the evil that's done and denigrates what's right, and I'll make them my intimate friend.",
        "source": "T13n0397_018:0125b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　常任我力，　善護口過，　　見無用人，　　不說其短。",
        "translation": "I'll always allow my strength to guard my words well, and I'll see a useless person and not speak of their faults.",
        "source": "T13n0397_018:0125b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我住聖種，　　頭陀護戒，　　處定習慧，　常勤修行。",
        "translation": "I abide in the noble lineage, ascetically guard the precepts, abide in meditation and cultivate wisdom, and always diligently cultivate it.",
        "source": "T13n0397_018:0125b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　離世憒閙，　　樂處閑靜，　無著如鹿，　　善調知足。",
        "translation": "Free from worldly anxieties, I enjoy quietude, am unattached like a deer, and am well adjusted and contented.",
        "source": "T13n0397_018:0125b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若至聚落，　攝根少語，　　見說法者，　　共論正法。",
        "translation": "If I go to a village, gather my faculties and speak little, I'll meet a Dharma preacher and discuss the right Dharma together.",
        "source": "T13n0397_018:0125b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愛語利益，　　以化眾生，　　又與說法，　令斷惡行。",
        "translation": "He speaks lovingly and beneficially to convert sentient beings and teaches the Dharma, causing them to end bad habits.",
        "source": "T13n0397_018:0125c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我為正法，　　極遠當往，　為彼說法，　　利益眾故。",
        "translation": "I will go there from afar because it's the right teaching, and I'll teach it for the benefit of all of them.",
        "source": "T13n0397_018:0125c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若見凡愚，　有缺失者，　　但當自護，　　住法行忍。",
        "translation": "If you see a foolish man with deficiencies, you must guard yourself and abide in the practice of forbearance with regard to the teaching.",
        "source": "T13n0397_018:0125c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　毀辱恭敬，　　當如須彌，　　不染世法，　為世導師。",
        "translation": "They should be like Sumeru, undefiled by worldly phenomena, and a guide to the world, honoring disrespect and humiliation.",
        "source": "T13n0397_018:0125c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　毀禁比丘，　　若來呵責，　自省己行，　　將是業報。",
        "translation": "If a disrespectful monk comes to rebuke him, reflecting on your own actions will be the result of your actions.",
        "source": "T13n0397_018:0125c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當為是等，　嫉惡眾生，　　先意善言，　　現為恭敬。",
        "translation": "For these jealous sentient beings, they first thought well of speaking, and now they're being respectful.",
        "source": "T13n0397_018:0125c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼即生念，　　我亦沙門，　　成就是德，　無若干惡。",
        "translation": "They then give rise to the thought, \"I, too, am an ascetic who has achieved this virtue and has no measure of evil.",
        "source": "T13n0397_018:0125c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸毀禁等，　　如失志人，　聞是經憂，　　如劓照鏡。",
        "translation": "Those who violate the prohibitions are like people who lose their minds and are sad to hear this sūtra, like a wakeshot mirror.",
        "source": "T13n0397_018:0125c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其作方便，　不欲聞之，　　復教餘人，　　言非正法；　又教國王，　　壞臣民心，　　誹謗正法，　言非佛說。",
        "translation": "They make it a point not to want to hear it and then teach others to say what's not the right teaching; they also teach kings to disrupt the minds of their subjects, denigrate the right teaching, and speak what's not the Buddha's teaching.",
        "source": "T13n0397_018:0125c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我等於時，　　以佛力故，　為持正法，　　不惜身命。",
        "translation": "At the time, we, because of the Buddha's power, spared no life for the sake of upholding the right teaching.",
        "source": "T13n0397_018:0125c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世尊知我，　言無有二，　　當堅護持，　　住是正法。",
        "translation": "The Bhagavān knows that I say there's no difference, so I will firmly defend and maintain this right teaching.",
        "source": "T13n0397_018:0125c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作誠實語，　　如說而行，　　悅可諸佛，　乃成菩提。」",
        "translation": "We will speak honestly, practice as we've been taught, and please the buddhas so that we can achieve enlightenment.\"",
        "source": "T13n0397_018:0125c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，虛空藏菩薩讚諸菩薩言：「善哉，善哉！",
        "translation": "At that point, the Ākāśagarbha Bodhisattva praised the bodhisattvas, saying, \"Good, good!",
        "source": "T13n0397_018:0125c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大士！",
        "translation": "Great Masters!",
        "source": "T13n0397_018:0125c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等乃能發誠實願，受持如來甚深微妙無上大法，甚為快也。」",
        "translation": "It's very pleasant for you all to make a sincere vow to accept the Tathāgata's profound, subtle, and unsurpassed great teaching.\"",
        "source": "T13n0397_018:0125c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏菩薩白佛言：「世尊！",
        "translation": "The Ākāśagarbha Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0125c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有善男子、善女人，受持讀誦此經典者，得幾所福？」",
        "translation": "How much merit will there be for good men and good women who retain and recite this sūtra?\"",
        "source": "T13n0397_018:0125c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告虛空藏言：「賢士！",
        "translation": "The Buddha addressed the Ākāśagarbha, saying, \"Good man!",
        "source": "T13n0397_018:0125c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如東方十三千大千世界，南西北方、四維上下，各十三千大千世界，盡末為微塵，以爾所塵集為一聚。",
        "translation": "\"It's like the 13,000 great thousand worlds in the east, the 13,000 great thousand worlds in the south, west, north, and four dimensions up and down, each of which is reduced to a tiny particle at the end, and that particle is gathered into a single clump.",
        "source": "T13n0397_018:0125c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有一人成就神足無量威德，壽命長遠，此人持諸微塵，過東方爾所塵數世界乃下一塵，如是展轉東行，盡此塵聚，而諸世界猶不可盡。",
        "translation": "Suppose there's a person who has achieved miraculous abilities and measureless virtue and has a long life span, and that person carries this tiny particle of dust past that number of dusty worlds in the east and then drops it into a single particle, and they move eastward in this way, exhausting this dusty cluster while the worlds remain inexhaustible.",
        "source": "T13n0397_018:0125c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如東方世界，南西北方、四維上下，亦過爾所佛土乃下一塵，如是展轉諸方世界，盡此塵聚而諸世界猶不可盡。",
        "translation": "As in the eastern world, he passes through the buddha-lands of the south, west, north, four counterpoints, and up and down, and then he drops down a single particle, thus spreading out over the worlds in all directions, and he exhausts this dust cloud, yet the worlds are still inexhaustible.",
        "source": "T13n0397_018:0126a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏！",
        "translation": "Ākāśagarbha!",
        "source": "T13n0397_018:0126a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T13n0397_018:0126a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸世界寧為多不？」",
        "translation": "Are these worlds rather numerous?\"",
        "source": "T13n0397_018:0126a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏白佛言：「甚多，甚多！",
        "translation": "The Ākāśagarbha said to the Buddha, \"Very much, very much!",
        "source": "T13n0397_018:0126a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0126a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無邊不可計知。」",
        "translation": "It's countless and limitless, and cannot be calculated.\"",
        "source": "T13n0397_018:0126a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「賢士！",
        "translation": "The Buddha said, \"Good man!",
        "source": "T13n0397_018:0126a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸世界微塵所著處及不著處，盡此微塵所及世界已還為一大城，縱廣高下悉皆同等，於其城中滿葶藶子。",
        "translation": "\"After exhausting the places where tiny bits of the world attach and the places where they don't attach, the world covered by these tiny bits of dust is returned to a large city, even though it's equal in breadth and height, and its interior is filled with sculptures.",
        "source": "T13n0397_018:0126a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢士！",
        "translation": "Good man!",
        "source": "T13n0397_018:0126a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸葶藶子，可數知不？」",
        "translation": "Can you count these scape children?\"",
        "source": "T13n0397_018:0126a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏白佛言：「世尊！",
        "translation": "The Ākāśagarbha said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0126a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假設譬喻猶不能了，況可數知！",
        "translation": "It is difficult to fathom a hypothetical metaphor, how much more so when it can be counted!",
        "source": "T13n0397_018:0126a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯除如來無能數者。」",
        "translation": "There's only the Tathāgata, and there's no one who can be counted.\"",
        "source": "T13n0397_018:0126a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告虛空藏言：「如是，如是！",
        "translation": "The Buddha told Ākāśagarbha, \"So it is, so it is!",
        "source": "T13n0397_018:0126a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言，唯如來能知是諸葶藶子，若百數千數百千萬數。」",
        "translation": "As you say, the Tathāgata alone can know these scape children, whether they are hundreds or thousands or tens of millions.\"",
        "source": "T13n0397_018:0126a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「賢士！",
        "translation": "The Buddha said, \"Good man!",
        "source": "T13n0397_018:0126a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有一人成就神足無量威德，能以口吹是諸葶藶布散十方，一葶藶子墮一佛世界，終不過一。",
        "translation": "Suppose there's one person who has achieved the miraculous power and measureless authority to blow these scapes by mouth and scatter them in ten directions, and there's never more than one scape bearer who falls into a single Buddha-realm.",
        "source": "T13n0397_018:0126a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢士！",
        "translation": "Good man!",
        "source": "T13n0397_018:0126a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T13n0397_018:0126a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸葶藶所及世界，寧為多不？」",
        "translation": "Wouldn't the world reached by these scapes be too numerous?\"",
        "source": "T13n0397_018:0126a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏白佛言：「世尊！",
        "translation": "The Ākāśagarbha said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0126a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸世界，乃非心力所能分別。",
        "translation": "These worlds are beyond the power of the mind to discern.",
        "source": "T13n0397_018:0126a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設分別者，令人心迷錯亂。」",
        "translation": "If we try to discriminate them, our minds will be confused and distracted.\"",
        "source": "T13n0397_018:0126a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢士！",
        "translation": "\"Good man!",
        "source": "T13n0397_018:0126a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今告汝，若有行菩薩道善男子、善女人，日日以滿爾所等世界無量珍寶持用布施，無有休廢不營餘事。",
        "translation": "Now, I'm telling you, if there are good men and good women who practice the bodhisattva path and give day by day with measureless treasures that fill up the world like this, there's nothing to lose and nothing to work for.",
        "source": "T13n0397_018:0126a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有善男子、善女人，受持讀誦書寫此甚深經典，不求利養為菩提故，乃至為一人說，使其人聞已，勸令於阿耨多羅三藐三菩提，乃至發一善念，欲令正法久住世故。",
        "translation": "Suppose there's another good man or woman who accepts, reads, recites, and writes this very profound sūtra, not seeking profit for the sake of enlightenment, and even speaks it for one person so that after hearing it, that person is encouraged to attain supreme perfect enlightenment and even gives rise to a single good thought, wanting to make the right teaching last a long time in the world.",
        "source": "T13n0397_018:0126a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人功德復過於彼布施者上，百倍千倍百千萬倍，乃至非算數譬喻所及，何況能令住阿耨多羅三藐三菩提者！",
        "translation": "That person's merit is a hundredfold, thousandfold, one hundred thousand millionfold greater than that person's generosity, and it's beyond the ability of mathematical metaphors, much less someone who can cause people to abide in unsurpassed, correct enlightenment!",
        "source": "T13n0397_018:0126a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_018:0126a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢士！",
        "translation": "Bhadrayān!",
        "source": "T13n0397_018:0126a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以能說如是無量善根成就諸菩薩，為護持正法故。",
        "translation": "It's because bodhisattvas who can explain such measureless accomplishments of good roots guard the right teaching.",
        "source": "T13n0397_018:0126a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢士！",
        "translation": "Good man!",
        "source": "T13n0397_018:0126a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不見菩薩更有餘法能過於是，堅固正行攝諸善法，教化眾生者也。」",
        "translation": "I don't see another bodhisattva who can surpass this, who resolutely and correctly conducts himself in collecting good qualities and teaching sentient beings.\"",
        "source": "T13n0397_018:0126a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，虛空藏菩薩白佛言：「世尊！",
        "translation": "At that point, the Ākāśagarbha Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0126b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有如來不可思議，如來大法亦不可思議。",
        "translation": "\"The rare Tathāgata is unfathomable, and the Tathāgata's great teaching is also unfathomable.",
        "source": "T13n0397_018:0126b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如如來大法不可思議，其受持此經典者，所得功德亦不可思議。",
        "translation": "As the Tathāgata's great teaching is unfathomable, so is the merit that someone who accepts and maintains this sūtra will obtain.",
        "source": "T13n0397_018:0126b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊護持此經，為當來世令受持此正法，諸善男子、善女人手得是經，執在胸懷不離是經。",
        "translation": "May the Bhagavān protect this sūtra and cause it to be accepted as the right teaching for future generations, so that good men and good women will get hold of it in their hands, carry it in their chests, and not part from it.",
        "source": "T13n0397_018:0126b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若應離生死者，不從他聞，自然得悟菩提，悟菩提已，廣為他說。」",
        "translation": "Those who should part with birth and death and hear it not from others will naturally attain enlightenment, and after awakening to enlightenment, they'll explain it widely for others.\"",
        "source": "T13n0397_018:0126b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「賢士！",
        "translation": "The Buddha said, \"Good man!",
        "source": "T13n0397_018:0126b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen closely, listen closely!",
        "source": "T13n0397_018:0126b09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之。",
        "translation": "Consider it well.",
        "source": "T13n0397_018:0126b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為護此經故，當說章句召護世四天王天、帝釋、梵天王等諸神。",
        "translation": "'For the sake of protecting this sūtra, I will explain the phrases and summon the gods of the four heavenly kings, Indra, and Brahma kings who protect the world.'",
        "source": "T13n0397_018:0126b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此章句召故，護世四天王天、帝釋、梵天王，皆當擁護諸說法師持此經者，說此世所難信甚深經典時，使無能作留難：所謂若王大臣駈遣出國，若得重病，若鬪諍時起，若國土疾疫，如是等事起時，以呪術力故，即令消滅不得成就。",
        "translation": "Because of this invocation, the four heavenly kings, Indra, and Brahma kings who protect the world will support those Dharma preachers who hold this sūtra and expound this profound scripture that's difficult for the world to believe, so that they won't be able to make things difficult, such as when a king or minister is sent away from the country, when he gets seriously ill, when a fight breaks out, or when a disease strikes the land, or when such things arise, they'll be made to disappear and won't be accomplished because of the power of the spell.",
        "source": "T13n0397_018:0126b11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為呪術章句？",
        "translation": "What are the rules and regulations of a spell?",
        "source": "T13n0397_018:0126b16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：「頭頭麗(一)　提提麗(二)　陀夜簸帝(三)　陀夜羅伽羅(四)　泥帝提(五)　毘婆知(六)　賒咩(七)　賒彌多毘(八)　目仚(九)　羶帝低(十)　尼[山*耆]弩禰(十一)　阿[少/兔]多麗(十二)　鳴多羅尼(十三)　婆簸斯(十四)　鉢他輸陀尼(十五)　鉢陀[少/兔]枳(十六)　鉢陀散提(十七)　般若牟麗(十八)　阿娑究麗(十九)　浮陀勒差(二十)　伊那薩枝(二十一)　多婆薩枝(二十二)　多婆鉢低(二十三)「隨佛意，　順法性，　恭敬僧，　世主信。",
        "translation": "所謂：「頭頭麗(一)　提提麗(二)　陀夜簸帝(三)　陀夜羅伽羅(四)　泥帝提(五)　毘婆知(六)　賒咩(七)　賒彌多毘(八)　目仚(九)　羶帝低(十)　尼[山*耆]弩禰(十一)　阿[少/兔]多麗(十二)　鳴多羅尼(十三)　婆簸斯(十四)　鉢他輸陀尼(十五)　鉢陀[少/兔]枳(十六)　鉢陀散提(十七)　般若牟麗(十八)　阿娑究麗(十九)　浮陀勒差(二十)　伊那薩枝(二十一)　多婆薩枝(二十二)　多婆鉢低(二十三)「隨佛意，　順法性，　恭敬僧，　世主信。",
        "source": "T13n0397_018:0126b17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護世四王，　為諸佛子，　受持此呪，　護說法者。」",
        "translation": "The four guardian kings of the world, for the sake of the Buddha's sons, will accept this dhāraṇī and protect those who expound the Dharma.\"",
        "source": "T13n0397_018:0126b25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，四天王即從座起，合掌向佛而白佛言：「世尊！",
        "translation": "At that point, the four heavenly kings rose from their seats, joined their palms to the Buddha, and said to him, \"Bhagavān!",
        "source": "T13n0397_018:0126b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等當護此諸佛子受持經者。」",
        "translation": "We will protect these disciples as they accept and uphold the sūtras.\"",
        "source": "T13n0397_018:0126b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說呪曰：「首鞞(一)　首婆鉢低(二)　首提帝(三)　因哆擁(四)　陀梨擁(五)　陀羅尼(六)　頗耽麋(七)　阿丘擁怯卑(八)　阿目仚(九)　阿羅尼陀擁(十)　藪首曬婆醯那(十一)　脾提脾陀賴散提(十二)　三咩(十三)　婆夜咩(十四)　三摩賴彌(十五)　波扇多[口*第](十六)　休休(十七)　醯醯(十八)　丘樓丘麗(十九)」於時四大天王自在者，說此不可犯呪已。",
        "translation": "He then spoke the dhāraṇī, saying, \"Śubhakara(i) Śubhapatana(ii) Śuddhidī(iii) Indraṭṭṭhā(iv) Dhṛtaṭhā(v) Dhāraṇī(vi) Bhadraṭṭṭhā(vii) Āqiuṭṭhapī(viii) Āmuṣṭhā(ix) Ārāṇidhā(x) Śubhakaraṇī(xi) Śuddhakaraṇī(xii) Śuddhakaraṇī(xii) Samāramitra(xiv) Pāṭaliputra[mouth*di](xvi) Hugh(xvii) Hyeha(xviii) Churuchuli(xix).\"",
        "source": "T13n0397_018:0126b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天帝釋即從座起心淨悅豫，合掌向佛，而說偈言：「末世飢饉時，　　大稱諸賢士，　受持說此經，　　我當為給侍。」",
        "translation": "At that point, Śakra rose from his seat, pure in heart and mind, put his palms together, and addressed the Buddha, saying, \"At the end of the age when there's famine, the great praises the good men who accept and expound this sūtra, and I will be your servant.\"",
        "source": "T13n0397_018:0126c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，帝釋說此偈已，即說呪曰：「彌低(一)　首脾(二)　摩訶彌低(三)　達摩彌低(四)　天多加麗(五)　三摩彌低(六)　薩遮彌低(七)　那提咩(八)　阿[少/兔]多麗(九)　阿[少/兔]頭離(十)　阿[少/兔]勒差(十一)　薩婆薩埵阿[少/兔]伽醯(十二)　阿那[少/兔]多卑(十三)　修冀低(十四)　阿毘盧提(十五)　阿毘伽醯(十六)　浮提菩舍咩(十七)　膩魑(十八)　遏他尼低(十九)　泥提羅尼(二十)　阿那他婆差帝(二十一)　咩低(二十二)　咩低闍耶私(二十三)　修莎羅(二十四)「汝等起禪樂，　　來護持法者，　諸世界世尊，　　皆悉共受持。」",
        "translation": "於是，帝釋說此偈已，即說呪曰：「彌低(一)　首脾(二)　摩訶彌低(三)　達摩彌低(四)　天多加麗(五)　三摩彌低(六)　薩遮彌低(七)　那提咩(八)　阿[少/兔]多麗(九)　阿[少/兔]頭離(十)　阿[少/兔]勒差(十一)　薩婆薩埵阿[少/兔]伽醯(十二)　阿那[少/兔]多卑(十三)　修冀低(十四)　阿毘盧提(十五)　阿毘伽醯(十六)　浮提菩舍咩(十七)　膩魑(十八)　遏他尼低(十九)　泥提羅尼(二十)　阿那他婆差帝(二十一)　咩低(二十二)　咩低闍耶私(二十三)　修莎羅(二十四)「汝等起禪樂，　　來護持法者，　諸世界世尊，　　皆悉共受持。」",
        "source": "T13n0397_018:0126c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，梵自在天王即從座起，讚彼釋梵護世諸天言：「善哉，善哉！",
        "translation": "At that point, Brahmā, the king of the Brahmadeva gods, rose from his seat and praised those Śakra Devānām-Indra gods, saying, \"Good, good!",
        "source": "T13n0397_018:0126c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等乃能為護正法持法說法者故，發大莊嚴。",
        "translation": "You then are able to give rise to great adornment because you protect the right teaching, maintain the teaching, and preach the teaching.",
        "source": "T13n0397_018:0126c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等正應如是，甚得其宜。",
        "translation": "It's fitting that you should do just that.",
        "source": "T13n0397_018:0126c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨如來法律住世久近，於爾所時中當有識別正行法行；於爾所時中諸天世人，甚當熾盛充滿宮宅。",
        "translation": "As the Tathāgata's law continues to abide in the world for a long time, there will be discernment of the right conduct of the Dharma during that time, and gods and people will flourish and fill their palaces during that time.",
        "source": "T13n0397_018:0126c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法滅後，諸天世人轉當減少，宮宅空荒。」",
        "translation": "After this Dharma ceases, the gods and people will decrease in number, and their mansions will be deserted.\"",
        "source": "T13n0397_018:0126c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告彌勒菩薩言：「彌勒！",
        "translation": "It was then that the Bhagavān addressed Maitreya Bodhisattva, \"Maitreya!",
        "source": "T13n0397_018:0126c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝受持此甚深經典，讀誦書寫廣為人說。",
        "translation": "You should memorize this profound sūtra, recite it, write it down, and explain it to others.",
        "source": "T13n0397_018:0126c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T13n0397_018:0126c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今以如斯等甚深經典囑累於汝，令此大法久住世故，降伏諸魔故，為利益一切眾生故，令一切外道不得便故，教勅一切菩薩，使親近此經不遠離故，欲令佛法大明久住於世不衰滅故，使佛法僧種不斷絕故。」",
        "translation": "Now, I've entrusted you with such a profound scripture to make this great teaching long-lasting, to subdue Māra, to benefit all sentient beings, to make it impossible for all non-Buddhists to get around, to teach all bodhisattvas to become intimate with this scripture and not to stray from it, to make the great knowledge of the Buddha's teaching long-lasting and not decay, and to cause the seed of the Buddha, Dharma, and Saṃgha to be incessantly extinguished.\"",
        "source": "T13n0397_018:0126c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒菩薩即白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0127a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於如來在世及滅度後，常當受持此甚深經典廣宣流布。",
        "translation": "During the Tathāgata's lifetime and after his death, I will always accept this very profound sūtra and disseminate it.",
        "source": "T13n0397_018:0127a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0397_018:0127a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受持此法者，則為受持過去未來現在諸佛正法，非但受一如來法也。",
        "translation": "\"When someone retains this teaching, they're retaining the right Dharma of the buddhas of the past, future, and present, not just the Dharma of the Tathāgata.",
        "source": "T13n0397_018:0127a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0127a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦為自護己法故。",
        "translation": "\"I also protect my own principles.",
        "source": "T13n0397_018:0127a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0127a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常與諸天人眾，普會處兜率天宮，每為廣說如是等甚深經典。",
        "translation": "I always meet with a multitude of gods and humans in the palace of Tuṣita Heaven and explain these very profound sūtras in detail.",
        "source": "T13n0397_018:0127a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我復當令人中受持讀誦此經典者，使手得是經執在胸懷不離經卷。",
        "translation": "I'll also have people among them memorize and recite this sūtra, so that they can hold it in their hands, carry it in their chests, and not part from the scroll.",
        "source": "T13n0397_018:0127a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0127a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復末世法欲滅時，其有受持此經轉為人說者，當知皆是彌勒威神之所建立。",
        "translation": "\"If there are people who accept this sūtra and turn it around for others when the Dharma of the final age is about to end, you should know that it was established by Maitreya's authoritative power.",
        "source": "T13n0397_018:0127a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0127a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於爾時，雖多諸魔事嬈亂行人，諸說法者依煩惱魔為魔所持故，不樂此經不勤修習，互相是非。",
        "translation": "At the time, although many demonic forces were disturbing practitioners, the preachers of the Dharma relied on the afflictive demons and were held by the demons, so they didn't enjoy this sūtra, didn't diligently cultivate it, and made distinctions among themselves.",
        "source": "T13n0397_018:0127a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等俱當勤作方便，令說法者愛樂是經，常勤修習讀誦通利，廣為人說。」",
        "translation": "We will all work diligently to cause Dharma preachers to delight in this sūtra, always diligently cultivate it, read and recite it fluently, and explain it widely to people.\"",
        "source": "T13n0397_018:0127a17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚彌勒菩薩言：「善哉，善哉！",
        "translation": "It was then that the Bhagavān praised Maitreya, saying, \"Good, good!",
        "source": "T13n0397_018:0127a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T13n0397_018:0127a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝乃能為護持正法故作師子吼，汝不但今於我前作師子吼，亦於過去無量阿僧祇諸佛前作師子吼，護持正法。」",
        "translation": "You then can make a lion's roar in order to safeguard the right teaching, and you've not only made a lion's roar in front of me now, but you've also made a lion's roar in front of measureless incalculable buddhas in the past to safeguard the right teaching.\"",
        "source": "T13n0397_018:0127a20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告大德阿難言：「阿難！",
        "translation": "It was then that the Bhagavān addressed the great virtuous Ānanda, saying, \"Ānanda!",
        "source": "T13n0397_018:0127a23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝受持此經耶？」",
        "translation": "Do you accept and uphold this sūtra?\"",
        "source": "T13n0397_018:0127a23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言：「唯然，世尊！",
        "translation": "Ānanda said to the Buddha, \"Yes, Bhagavān!",
        "source": "T13n0397_018:0127a24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以佛神力故，我已受持。」",
        "translation": "Because of the Buddha's supernormal power, I've accepted and maintained it.\"",
        "source": "T13n0397_018:0127a24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T13n0397_018:0127a25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝常當廣為四眾分別解說，若有先種善根樂勝法者，如是等人聞已，則能信解受持讀誦廣為人說，其人則得無量無邊不可思議大功德聚。」",
        "translation": "You must always explain it clearly and distinctly for the four groups of people, and if someone with previously cultivated good roots enjoys the superior teaching, then after hearing it, they'll be able to believe and understand it, retain it, read and recite it, and explain it to others, and that person will attain a measureless and limitless cluster of unfathomably great merits.\"",
        "source": "T13n0397_018:0127a25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難即白佛言：「世尊！",
        "translation": "Ānanda then said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0127a28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當何名斯經？",
        "translation": "What will be the name of this scripture?",
        "source": "T13n0397_018:0127a29_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you uphold it?\"",
        "source": "T13n0397_018:0127a29_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言阿難：「此經名『勸發菩薩莊嚴菩提』，當如是奉持之。」",
        "translation": "The Buddha said to Ānanda, \"This sūtra is called 'Encouragement of Bodhisattvas to Adorn Enlightenment,' so you must thus uphold it.\"",
        "source": "T13n0397_018:0127a29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，功德莊嚴菩薩在於眾中即從座起，右膝著地，合掌向佛，白佛言：「希有，世尊！",
        "translation": "At that point, the Bodhisattva Adorned with Merit rose from his seat among the crowd, knelt on his right knee, put his palms together, and bowed his head to the Buddha, saying, \"It's rare, Bhagavān!",
        "source": "T13n0397_018:0127b02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來為擁護正法及說法者故，善能如是快讚此經。",
        "translation": "The Tathāgata is well able to praise this sūtra quickly and in this way because it protects the right teaching and the speaker of the teaching.",
        "source": "T13n0397_018:0127b04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0127b05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸新學菩薩為菩提故種諸善根，以種種華香瓔珞末香塗香勤供養如來，而不受持此經，是人頗成以第一供養供如來不？」",
        "translation": "Would newly trained bodhisattvas who have planted good roots for the sake of bodhi and who diligently make offerings to the Tathāgata with various kinds of flowers, fragrances, jewelry, and powdered incense make offerings to the Tathāgata but don't accept and maintain this sūtra?\"",
        "source": "T13n0397_018:0127b05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T13n0397_018:0127b08_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不成第一供養如來，亦不能以此因緣得無量功德，不如善男子、善女人，受持此經者功德甚多。」",
        "translation": "They don't become the first to make offerings to the Tathāgata, nor can they attain measureless merit based on these causes and conditions, unlike good sons and good women who accept and uphold this sūtra with great virtue.\"",
        "source": "T13n0397_018:0127b08_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「我以佛眼，　　所見佛剎，　　周遍十方，　廣大無邊。",
        "translation": "It was then that the Bhagavān spoke in verse, \"With the Buddha's eye, I see buddha-blocs that range over the ten directions and are limitless in their vastness.",
        "source": "T13n0397_018:0127b10_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　爾所諸界，　　盛滿珍寶，　菩薩以此，　　恒用布施。",
        "translation": "Those realms are filled with treasures that bodhisattvas constantly use to make donations.",
        "source": "T13n0397_018:0127b13_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有於此，　甚深妙經，　　無所得法，　　諸佛所說，　而能受持，　　為人演說，　　此人功德，　復多於彼。",
        "translation": "If there's a profound and wonderful sūtra here, an unobtainable Dharma that's taught by the buddhas and that can be accepted and explained for others, that person's merit is greater than theirs.",
        "source": "T13n0397_018:0127b14_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　華香瓔珞，　　塗香末香，　寶蓋幢幡，　　上妙衣服，　　以是供具，　普滿諸界，　　供養如來，　　迴向佛道。",
        "translation": "Floral incense, diadem, powdered incense, jeweled canopies, banners, and fine clothing are among the offerings that completely fill the world, making offerings to the Tathāgata and leading him back to the Buddha's path.",
        "source": "T13n0397_018:0127b17_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若後末世，　　法欲滅時，　　於救世法，　勤修護助，　　受持正法，　　不放逸行，　此功德聚，　　復多於彼。",
        "translation": "If, in a latter, terminal age when the Dharma is about to cease, he diligently works to aid in saving the Dharma of the world, maintains the right Dharma, and doesn't practice carelessly, this accumulation of merit will be greater than that.",
        "source": "T13n0397_018:0127b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　十方世界，　一切巨海，　　盡盛滿中，　　上妙香油，　作大燈炷，　　猶如須彌，　　然以供養，　一切諸佛。",
        "translation": "In the worlds of the ten directions, all the vast oceans are filled to the brim with the finest fragrant oil, which makes a great wick like Sumeru, and then it's used to make offerings to all the buddhas.",
        "source": "T13n0397_018:0127b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　法炬若欲，　　斷滅之時，　知世眾生，　　無明所覆。",
        "translation": "When the torch of the Dharma is desired to cease, sentient beings of the world will know that they're covered by ignorance.",
        "source": "T13n0397_018:0127b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若能然此，　大法炬者，　　此人功德，　　復勝於彼。",
        "translation": "If he can do this, the great dharma-torch, this person's virtue is superior to theirs.",
        "source": "T13n0397_018:0127b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我之所見，　　無量諸佛，　　雖億千劫，　種種供養。",
        "translation": "I've seen measureless buddhas, hundreds of millions of eons old, making all kinds of offerings.",
        "source": "T13n0397_018:0127b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸天上妙，　　適意供養，　不能受持，　　此妙經典。",
        "translation": "They are marvelous from the heavens, and they make offerings as they see fit, but they can't accept or maintain this wonderful scripture.",
        "source": "T13n0397_018:0127b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若於諸佛，　知有重恩，　　擁護三寶，　　為報恩故，　為欲饒益，　　一切眾生，　　受持此經，　福勝於彼。",
        "translation": "If I knew the buddhas were deeply grateful and protected the Three Treasures, and I wanted to repay that kindness and benefit all sentient beings, I'd be more blessed than they are if I were to accept this sūtra.",
        "source": "T13n0397_018:0127c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我以佛眼，　　所見眾生，　若有能教，　　盡成釋梵。",
        "translation": "With the Buddha's eye, I see all sentient beings, and if there's someone who can teach them, they'll all become Śākyamunis.",
        "source": "T13n0397_018:0127c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所得功德，　不如書寫，　　持此經者，　　功德甚多。",
        "translation": "The merit attained isn't as great as that achieved by writing, but the virtues of someone who holds this sūtra are abundant.",
        "source": "T13n0397_018:0127c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大千世界，　　所有眾生，　　若有能教，　盡成二乘。",
        "translation": "For all the sentient beings in the great chiliocosm, if there were someone who could teach them, they'd all become two vehicles.",
        "source": "T13n0397_018:0127c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有能發，　　菩提心者，　護持此經，　　功德復勝。",
        "translation": "If there's someone who can give rise to the mind of enlightenment and protects this sūtra, their merit will be even greater.",
        "source": "T13n0397_018:0127c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　持經功德，　假令是色，　　悉當充滿，　　十方世界。",
        "translation": "The merit of upholding the sūtra, even if it were in form, would completely fill the worlds in the ten directions.",
        "source": "T13n0397_018:0127c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯除如來，　　無上大智，　　更無能知，　此功德者。",
        "translation": "Except for the Tathāgata's unsurpassed great wisdom, there's no one else who can know this merit.",
        "source": "T13n0397_018:0127c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如如來智，　　無有邊際，　虛空法界，　　亦無邊際。",
        "translation": "Just as the Tathāgata's wisdom has no limit, so does the reality realm of space have no limit.",
        "source": "T13n0397_018:0127c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　能持如來，　此經法者，　　功德無邊，　　亦復如是。」",
        "translation": "So is the person who can uphold the Tathāgata's teaching of this sūtra, whose merit is limitless.\"",
        "source": "T13n0397_018:0127c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，功德莊嚴菩薩白佛言：「世尊！",
        "translation": "At that point, the Bodhisattva of Vairocana said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_018:0127c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今者信解如來所說義趣，後五百歲法欲滅時，諸發大乘眾生，其不受此經法者，將知是等為魔所持墮佛法外。",
        "translation": "If I now believe and understand the Tathāgata's explanation of his aim, then in the next 500 years, when the teaching is about to die out, sentient beings who have arisen in the great vehicle and don't accept the teaching of this sūtra will know that they've been held by Māra and fallen outside the Buddha's teaching.",
        "source": "T13n0397_018:0127c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_018:0127c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今堪任如來滅後受持此經，欲令佛法久住世故。」",
        "translation": "Now, I'm entrusted with the maintenance of this sūtra after the Tathāgata's death because I want the Buddha's teaching to last a long time in the world.\"",
        "source": "T13n0397_018:0127c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為囑累此經法故，放大光明，普照十方無量阿僧祇諸佛世界。",
        "translation": "At the time, the Bhagavān, because he had entrusted this sūtra with his teaching, radiated a bright light that shone universally on measureless incalculably bright buddha-worlds in the ten directions.",
        "source": "T13n0397_018:0127c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸如來，亦為囑累此經法故，皆放眉間白毫相光，普照十方一切世界，無不周遍。",
        "translation": "Because they had also entrusted the teaching of this sūtra, the tathāgatas all emitted a white-haired radiance between their eyebrows that universally illuminated all the worlds in the ten directions, spanning them without fail.",
        "source": "T13n0397_018:0127c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此經已，如來以大神力放光明。",
        "translation": "After speaking this sūtra, the Tathāgata radiated that light with great supernormal power.",
        "source": "T13n0397_018:0127c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時無量阿僧祇諸佛世界，六變振動，有無量阿僧祇眾生發無上道心，無量阿僧祇菩薩得無生法忍。",
        "translation": "At that time, measureless incalculable buddha-worlds were shaken by six transformations, measureless incalculable sentient beings aroused the aspiration for the unsurpassed path, and measureless incalculable bodhisattvas attained the forbearance of the nonarising of the Dharma.",
        "source": "T13n0397_018:0127c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量阿僧祇菩薩，得一生補處善根；又復過是無量阿僧祇眾生，得聲聞乘住學無學地。",
        "translation": "Measureless numbers of incalculable bodhisattvas also attain the wholesome root of a lifetime of mending places, and measureless numbers of incalculable sentient beings also attain the stage of training and no-training in the śrāvaka vehicle.",
        "source": "T13n0397_018:0127c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經已。",
        "translation": "After the Buddha spoke the sūtras, the Ākāśagarbha Bodhisattva and the Mahāsaṃgha Bodhisattva declared.",
        "source": "T13n0397_018:0127c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏菩薩、大德阿難、諸菩薩大眾，及諸聲聞、諸天世人，聞佛所說皆大歡喜。",
        "translation": "The Ākāśagarbha Bodhisattva, the great virtuous Ānanda, the great assembly of bodhisattvas, the śrāvakas, gods, and humans who heard what the Buddha taught rejoiced greatly.",
        "source": "T13n0397_018:0127c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經卷第十八",
        "translation": "Dafangdengdaji jing, vol. 18",
        "source": "T13n0397_018:0128a02_0",
        "is_bad_quality": false
    }
]