[
    {
        "source_sentence": "大方等大集經卷第二十三",
        "translation": "Dafangdengdaji jing, vol. 23",
        "source": "T13n0397_023:0162c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Translated by the Tripiṭaka of Northern Liang and India, Dharmakṣema",
        "source": "T13n0397_023:0162c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空目分第十之二中世間目品第二",
        "translation": "Akṣobhya-vision, Tenth and Second Categories of Medium-Life Vision, Second Chapter",
        "source": "T13n0397_023:0162c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即放眉間白毫相光，悉蔽十方諸佛世界日月星宿、珠火燈明所照之處，一切石山諸惡刺棘為不復現。",
        "translation": "At that point, the Bhagavān then radiated a white-haired light from between his eyebrows that completely blinded the sun, moon, stars, and pearls, fire, and lamps in the Buddha's world in ten directions, so that all the rocks and mountains and harsh thorns would no longer appear.",
        "source": "T13n0397_023:0162c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方無量恒河沙等世界眾生見是光已，各各繫念思惟善事。",
        "translation": "After seeing this light, sentient beings in measureless Ganges sands worlds in the ten directions each fix their thoughts and contemplate good deeds.",
        "source": "T13n0397_023:0162c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中諸佛見是光已，各告己眾而作是言：「善男子！",
        "translation": "When the buddhas there saw this light, they each addressed their congregation and said, \"Good sons!",
        "source": "T13n0397_023:0162c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過於無量恒河沙世界，彼有世界名曰娑婆，具足五滓。",
        "translation": "\"Beyond the numberless worlds of the Ganges, there's a world called Sāva that's replete with the five dregs.",
        "source": "T13n0397_023:0162c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛出世，號釋迦牟尼如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "There's a Buddha who appears in the world and is called the Śākyamuni Tathāgata, Worthy, Perfectly Omniscient, Perfect in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Trainer, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T13n0397_023:0162c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量世界無量菩薩、無量聲聞，悉集彼土坐彼佛前，彼佛即為宣說法行法目陀羅尼門。",
        "translation": "Measureless bodhisattvas and measureless śrāvakas from measureless worlds gathered in that land and sat down before that Buddha, who then explained the Dhāraṇī teaching of the practice of the Dharma and the eye of the Dharma.",
        "source": "T13n0397_023:0162c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸聲聞，說法行已放大光明，將欲演說淨目法門陀羅尼法。",
        "translation": "After teaching Dharma practices for the śrāvakas, he magnified his light and was about to teach the Dhāraṇī Method of the Pure Eyes.",
        "source": "T13n0397_023:0162c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為中乘者得緣覺果，為諸菩薩莊嚴成就阿耨多羅三藐三菩提，具足十地如來十八不共之法，轉不退輪壞三惡趣，令修八聖得無上果。」",
        "translation": "It would be for those in the middle vehicle to attain the fruit of pratyekabuddha, for bodhisattvas to adorn and accomplish supreme perfect enlightenment, for the tenth ground to be replete with the eighteen distinctive qualities of the tathāgatas, for the irreversible wheel to turn and destroy the three bad destinies, and for the cultivation of the eight sages to attain the unsurpassed fruit.\"",
        "source": "T13n0397_023:0162c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，十方恒河沙等世界諸眾聞是語已，各各白佛言：「世尊！",
        "translation": "After hearing these words, the multitudes of people in the Ganges River world in the ten directions each said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0162c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲往彼娑婆世界至說法處，聽受如是淨目法門。」",
        "translation": "I want to go to that place in the Saṃbha world where the Dharma is explained and listen to this pure eye-opening teaching.\"",
        "source": "T13n0397_023:0162c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，無量諸菩薩眾，悉共來詣娑婆世界，到於佛所頭面禮拜却坐一面。",
        "translation": "At the time, measureless crowds of bodhisattvas all visited the Saṃbha world, went to the Buddha, paid homage with their heads, and withdrew to sit at one side.",
        "source": "T13n0397_023:0162c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此世界無量梵天，往至佛所供養恭敬却坐一面。",
        "translation": "Measureless brahma gods from this world then went to the Buddha, offered their support and respect, and withdrew to sit at one side.",
        "source": "T13n0397_023:0162c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百億魔天、百億化自在天、百億兜率天、百億夜摩天、百億帝釋天、百億四天王天、百億日月天、百億自在天、百億閻羅王、百億地鬼、四百億阿修羅、四百億龍王，如是等眾悉向佛所，恭敬供養却坐一面。",
        "translation": "Tens of millions of Māra gods, tens of millions of Mahêśvara gods, tens of millions of Tuṣita gods, tens of millions of Yama gods, tens of millions of Śiva gods, tens of millions of Sun and Moon gods, tens of millions of Ārya kings, tens of millions of earth spirits, tens of millions of asuras, and tens of millions of dragon kings, all of these people went to the Buddha, paid their respects, made offerings, and withdrew to sit at one side.",
        "source": "T13n0397_023:0162c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量沙門及婆羅門悉得神通，來向佛所恭敬供養却坐一面。",
        "translation": "Countless ascetics and priests attained supernormal powers, came to the Buddha, paid their respects, made offerings, and withdrew to sit at one side.",
        "source": "T13n0397_023:0163a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸世界中外道相師，見光明時，作是思惟：「如是光者，非是日月星宿之明，必是異光，如是不久七日並出，當焦四海須彌山王一切草木，其後欲界火災當出。」",
        "translation": "When the foreign and domestic preceptors of the world see that light, they think, \"Such a light is not the brightness of the sun, moon, stars, or constellations; it must be a different light that will soon emit seven days together and scorch all the vegetation on Sumeru the king of mountains in the four seas and will be followed by a conflagration in the desire realm.\"",
        "source": "T13n0397_023:0163a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復有言：「却後不久必當雨毒害於一切。」",
        "translation": "Again, some people say, \"Soon after that, it will rain poison on everything.\"",
        "source": "T13n0397_023:0163a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復有言：「却後不久必當雨刀害諸人物，惡時將至誰能救之？」",
        "translation": "Another person might say, \"Soon after it's over, it will rain a sword that will harm people, and who will be able to save them when the bad times come?\"",
        "source": "T13n0397_023:0163a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復有言：「瞿曇沙門憐愍一切，唯是能救施其壽命。」",
        "translation": "Some people also say, \"The Gautama monk has compassion for all people and is the only one who can save and give them life.\"",
        "source": "T13n0397_023:0163a09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，一切無量眾生至心念佛；念已即見是大寶坊，以佛力故即至坊中。",
        "translation": "At the time, measureless sentient beings wholeheartedly remembered the Buddha, and after they did so, they saw this great jeweled palace, and it was because of the Buddha's power that they arrived there.",
        "source": "T13n0397_023:0163a10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，波斯匿王以佛神力故亦見寶坊，以佛力故得到坊中。",
        "translation": "At the time, King Prasenajit also saw the jeweled palace because of the Buddha's spiritual power, and he was able to get inside it because of the Buddha's power.",
        "source": "T13n0397_023:0163a12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憂填耶那王、惡性王、輸頭檀王、摩醯陀王、修陀奢那王、頻婆娑羅王，如是等王亦因佛力得見寶坊，悉至坊中，供養禮拜，次第而坐，各作是念：「今此眾中有大仙人，有佛、世尊，此光因緣今當問誰？",
        "translation": "King Āryayaṇa, King Malignant, King Śuddhodana, King Mahêndra, King Śuddhacana, and King Bimbisāra, all of these kings also saw the place of treasure because of the Buddha's power, went to the place, made offerings, venerated, and sat down in order, each thinking, \"Now, there's a great sage among this congregation, a Buddha, or a Bhagavān, and whom should I ask about the causes and conditions of this light?",
        "source": "T13n0397_023:0163a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當問仙人？",
        "translation": "Will you ask the sages?",
        "source": "T13n0397_023:0163a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問佛可耶？」",
        "translation": "Is it okay to ask the Buddha?\"",
        "source": "T13n0397_023:0163a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，須陀舍那王言：「我今有大婆羅門師，名曰電髮，善知相法能解能說，是最可問。」",
        "translation": "It was then that King Sudarśana said, \"Now, I have a great Brāhmaṇa teacher named Dīpaṃkara who well knows signs and dharmas, and who can understand and explain them, which is most worthy of inquiry.\"",
        "source": "T13n0397_023:0163a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "電髮聞已即作是言：「我所博覽一切相書都無此事，我實不能解此光瑞，閻浮提中一切相師其數五百悉不能解。」",
        "translation": "After hearing this, Densha said, \"None of the books on characteristics that I've read have this in them, and I really can't understand this radiant vision; all 500 of the masters of characteristics in Jambudvīpa can't understand it.\"",
        "source": "T13n0397_023:0163a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，頻婆娑羅王語諸王言：「汝何故狂？",
        "translation": "It was then that King Bimbisāra said to the kings, \"Why are you crazy?",
        "source": "T13n0397_023:0163a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此大眾中有佛、世尊，號釋迦牟尼，具一切智，善知世間出世間相，了十二月善相之書，大悲憐愍一切眾生，實語正語，唯佛能說是光報應。」",
        "translation": "Among this great multitude is the Buddha, the Bhagavān, called Śākyamuni, who possesses omniscience, well knows worldly and transmundane appearances, comprehends the December book of good appearances, has great compassion for all sentient beings, and speaks truly and correctly, which only the Buddha can explain as the reward of light.\"",
        "source": "T13n0397_023:0163a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸王及諸大眾一切宗仰，共白佛言：「世尊！",
        "translation": "It was then that the kings and the great assembly, all of whom looked up to the Buddha, said, \"Bhagavān!",
        "source": "T13n0397_023:0163a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來為我等說十二月相書。」",
        "translation": "Please let the Tathāgata explain the December sūtras for us.\"",
        "source": "T13n0397_023:0163a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大王！",
        "translation": "The Buddha said, \"Great king!",
        "source": "T13n0397_023:0163a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此大會不應宣說世間相書。」",
        "translation": "This assembly shouldn't preach about worldly appearances.\"",
        "source": "T13n0397_023:0163a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頻婆娑羅王白佛言：「世尊！",
        "translation": "King Bimbisāra said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0163b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此會中有諸眾生，不信如來所有功德，又不信是一切智人，唯願破壞如是疑心而宣說之。",
        "translation": "Now, there are sentient beings in this assembly who don't believe in the Tathāgata's abilities and don't believe he's a person of omniscience, so I wish to destroy such doubt and explain it.",
        "source": "T13n0397_023:0163b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生若得聞已心生喜信，生信心已，乃可為說出世之道。",
        "translation": "If these sentient beings hear this, they'll be delighted and believe in it, and after they have faith, then they'll be able to explain the way out of this world for them.",
        "source": "T13n0397_023:0163b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生，亦當樂受易可調伏。」",
        "translation": "Such sentient beings will also be delighted to accept it as easy to subdue.\"",
        "source": "T13n0397_023:0163b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言大王：「至心諦聽，我當說之。",
        "translation": "The Buddha said to the king, \"Listen closely with all your heart, and I will explain it.",
        "source": "T13n0397_023:0163b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T13n0397_023:0163b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔雪山有一仙人，名婆伽婆，食果草根修集慈心，而不能除諸煩惱結，不能調伏貪欲之心。",
        "translation": "Once upon a time, there was an immortal named Bhagavān who ate fruit and grass roots and cultivated kindness, but he couldn't remove the bonds of affliction or tame desire.",
        "source": "T13n0397_023:0163b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼住處有一雌虎，即共行欲，虎便懷妊。",
        "translation": "At the time, there was a female tiger living there who shared her desires, and the tiger became pregnant.",
        "source": "T13n0397_023:0163b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日月已滿，至此人所產十二子。",
        "translation": "When the sun and moon were full, she gave birth to twelve sons.",
        "source": "T13n0397_023:0163b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時仙人心憐愍故，即取洗浴而哺養之，虎母心愛隨時乳養。",
        "translation": "Because of his kindness, the sage took them, washed them, and nursed them, and the tiger's mother loved them and nursed them at any time.",
        "source": "T13n0397_023:0163b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時仙人各為立名：一名竭伽、二名跋伽婆、三名為虎、四名師子、五名擔重、六名婆羅墮闍、七名步行、八名婆羅奴、九名健食、十名惡性、十一名師子擔、十二名健行。",
        "translation": "The sage then designated each one by name: one Kakuda, two Bhagavān, three Tiger, four Shizi, five Tantra, six Bharadja, seven Walk, eight Bharanu, nine Kingyo, ten Nasty, 11 Shizi Tantra, and 12 Kingyo.",
        "source": "T13n0397_023:0163b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是十二子年始七歲，食草根華果。",
        "translation": "\"These twelve sons were seven years old when they first ate grass, roots, flowers, and fruit.",
        "source": "T13n0397_023:0163b16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時父母俱時命終，時十二子心懷愁惱，仰天號哭：『如何一旦無所歸依？』",
        "translation": "When both their parents' lives ended, the twelve sons were distressed and looked up to heaven, crying, 'How could there be no refuge once I'm gone?'",
        "source": "T13n0397_023:0163b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有樹神聞是聲已，作如是言：『諸童子且莫啼哭，有歸依處，所謂梵天憐愍眾生，汝等應當晝夜六時淨自洗浴，向於虛空至心禮拜求哀梵天。",
        "translation": "When a tree spirit heard this sound, he said, \"Children, don't weep; there's a refuge, which is called Brahmā's kindness to sentient beings; you must cleanse yourselves six times a day and six times a night, venerate the sky with your whole hearts, and beg for mercy from Brahmā.",
        "source": "T13n0397_023:0163b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天當以無礙天耳聞汝等聲，聞已當來至汝住處，以憐愍故。",
        "translation": "Brahmā will hear your voices with the unobstructed divine ear, and after hearing them, he'll come to your dwelling place out of pity.",
        "source": "T13n0397_023:0163b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "來已當壞汝等癡闇施慧光明，得智慧已，一切諸天當供養汝，況世間人！』",
        "translation": "After coming, they will destroy your delusion and give you the light of wisdom, and when they attain wisdom, all the gods will make offerings to you, much less people in the world!'",
        "source": "T13n0397_023:0163b24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時十二子聞是語已，如教而行經十二年。",
        "translation": "After hearing those words, the twelve sons did as they were taught for twelve years.",
        "source": "T13n0397_023:0163b25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後梵天乃聞其聲，即來下至三十三天。",
        "translation": "Then the Brahmadeva gods heard their voices and descended to the Trāyastriṃśa Heaven.",
        "source": "T13n0397_023:0163b26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，帝釋見梵天來即前供養，既供養已，即復白言：『大士！",
        "translation": "\"Śākyamuni then saw the Brahmā coming and offered his support, and after making his offerings, he then said, \"Maestro!",
        "source": "T13n0397_023:0163b27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？』",
        "translation": "Where do you want to go?'",
        "source": "T13n0397_023:0163b29_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『憍尸迦！",
        "translation": "'Kauśika!",
        "source": "T13n0397_023:0163b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝不見彼雪山之中十二仙耶？",
        "translation": "Have you not seen the twelve sages in the snowy mountains?",
        "source": "T13n0397_023:0163b29_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦可共往彼。』",
        "translation": "Kauśika, we can go there together.'",
        "source": "T13n0397_023:0163c01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時釋提桓因與無量天，相隨俱下至雪山中。",
        "translation": "Śakra Devānām-Indra and measureless gods then descended together into the snowy mountains.",
        "source": "T13n0397_023:0163c01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時十二仙見梵天來，歡喜踊躍禮拜供養。",
        "translation": "When the twelve sages saw Brahmā coming, they rejoiced and leaped for joy, venerating and making offerings.",
        "source": "T13n0397_023:0163c02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時梵天王告十二童子：『汝等何故，十二年中精勤苦行供養於我？",
        "translation": "\"The Brahma King then addressed the twelve sages, \"Why have you worked so hard and painstakingly for twelve years to make offerings to me?",
        "source": "T13n0397_023:0163c03_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所求？",
        "translation": "What do you desire?",
        "source": "T13n0397_023:0163c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為求名聲、色力、財寶、聖道、智慧諸天身耶？』",
        "translation": "Do you seek the bodies of the gods for fame, form, power, wealth, the noble path, and wisdom?'",
        "source": "T13n0397_023:0163c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時竭伽仙白梵天言：『大士！",
        "translation": "The Śākyamuni said to Brahmā, 'Maestro!",
        "source": "T13n0397_023:0163c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今不求如是等事，我欲求智慧，為眾生故。",
        "translation": "Now, I don't seek such things; I want to seek wisdom for the sake of sentient beings.",
        "source": "T13n0397_023:0163c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等孤稚，少失覆蔭，自隨其心，無教告者。",
        "translation": "We're orphaned and young, with little shade, and we follow our own minds, with no one to teach and tell.",
        "source": "T13n0397_023:0163c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願大士施我智慧，令我識知善惡等業，及了眾生善惡等業，亦知眾生、國土、城邑、剎利、婆羅門、毘舍、首陀、男女、大小善惡等相受苦樂事。",
        "translation": "Please let the great man give me wisdom so that I can know good and bad actions, understand the good and bad actions of sentient beings, and know the suffering and happiness of sentient beings, lands, cities, bhadras, brāhmaṇas, piśās, śūdras, men and women, and the characteristics of good and bad in large and small.",
        "source": "T13n0397_023:0163c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸王貪國無厭足者，興兵相伐衰盛等相，若我知已，當以方便教滅惡相，令得受樂。』」",
        "translation": "Kings who covet their countries and have no trouble with them raise armies to suppress declines and prosperity, and so forth, if I knew that, I would teach and extinguish bad appearances with skillful means to make them enjoyable.\"",
        "source": "T13n0397_023:0163c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經虛空目分中彌勒品第三爾時，彌勒菩薩即於佛前，心念說偈，問於如來：「非有途路，　　而有輪轉；　　如來亦不　住一切道，　　非道見道，　　道見非道。」",
        "translation": "It was then that Maitreya addressed the Tathāgata in the third rank of the Maitreya Chapter of the Xukongmu Section of the Mahāprajñāpāramitā-sūtra, mentally speaking in verse, and asked the Tathāgata, \"There's no path, yet there's transmigration; nor does the Tathāgata abide in all paths, seeing neither the path nor the path as not the path.\"",
        "source": "T13n0397_023:0163c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T13n0397_023:0163c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非道者即是不出不滅，不住非智，非智境界，非明非闇，非常非斷，非善非惡，非是色陰乃至識陰，是名實性，是名法性，名一切行，名真實際，是名非道，如是中道。",
        "translation": "\"Not the path is that which is neither abiding nor ceasing, which is neither abiding nor cognition, which is not the cognitive realm, which is neither light nor dark, which is neither permanent nor interrupted, which is neither good nor bad, which is not the aggregate of form and even the aggregate of consciousness, which is called the true nature, which is called the Dharma nature, which is called all conditioned things, which is called the true reality, which is called not the path, and which is thus the middle way.",
        "source": "T13n0397_023:0163c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來轉於法輪，而不貪著如是諸道。",
        "translation": "The buddha-tathāgatas turn the wheel of the Dharma and don't cling to paths like this.",
        "source": "T13n0397_023:0163c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，道見非道、非道見道，如是眾生不能達於道與非道及知三道。",
        "translation": "If there are sentient beings who see what's not the path and who don't see the path, such sentient beings can't understand what's the path and what's not the path and know the three paths.",
        "source": "T13n0397_023:0163c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來悉能分別解說，及以斷道。",
        "translation": "The Tathāgata is fully able to discern and explain them, and he ends the paths.",
        "source": "T13n0397_023:0163c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0163c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、世尊於無道中而轉法輪，為壞眾生三種道故。",
        "translation": "The Tathāgata and the Bhagavān turn the wheel of the Dharma in the absence of a path in order to destroy three kinds of paths for sentient beings.",
        "source": "T13n0397_023:0163c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三道？",
        "translation": "What are the three kinds of paths?",
        "source": "T13n0397_023:0163c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、煩惱道；二者、苦道；三者、業道。",
        "translation": "1. the path of affliction; 2. the path of suffering; and 3. the path of karma.",
        "source": "T13n0397_023:0163c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "業道者，所謂行有；煩惱道者，所謂無明愛取；苦道者，所謂識名色、六入、觸受生老死等。",
        "translation": "The path of karma is called formative existence; the path of affliction is called nescience, craving, and grasping; and the path of suffering is called consciousness, name, form, the six sense-fields, contact, sensation, birth, old age, and death.",
        "source": "T13n0397_023:0163c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三道，何因緣有？",
        "translation": "What are the causes and conditions for the existence of these three paths?",
        "source": "T13n0397_023:0164a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸緣故有。",
        "translation": "It exists because of contact.",
        "source": "T13n0397_023:0164a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0164a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因眼見色而生愛心，愛心者即是無明，為愛造業即名為行，至心專念名之為識，識共色行是名名色，六處生貪是名六入，因入求受名之為觸，貪著心者即名為愛，求是等法名之為取，如是法生是名為有，次第不斷名之為生，次第斷故名之為死，生死因緣眾苦所逼名之為惱，乃至識法因緣生貪，亦復如是。",
        "translation": "The mind that craves form because of the eye's vision gives rise to mind, which is nescience; the mind that creates actions because of craving is called action; the mind that focuses on mindfulness is called consciousness; the mind that shares form and action is called form; the six sense-fields that give rise to craving are called the six sense-fields; the mind that's attached to craving because of sense-fields is called contact; the mind that seeks these things is called craving; the mind that seeks these things is called grasping; the mind that gives rise to such things is called being; the mind that continuously produces these things in sequence is called birth; the mind that's stopped in sequence is called death; the cause and condition of birth and death that's oppressed by many sufferings is called affliction; and the cause and condition of consciousness that gives rise to craving is likewise.",
        "source": "T13n0397_023:0164a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十二因緣，一人一念皆悉具足。",
        "translation": "Thus, these twelve causes and conditions are all present in one person and one thought.",
        "source": "T13n0397_023:0164a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「出有三種：一者、因出；二者、初出；三者、道出。",
        "translation": "\"There are three kinds of emancipation: first, emancipation by cause; second, emancipation in the beginning; and third, emancipation by path.",
        "source": "T13n0397_023:0164a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘修行法行，觀察所有愛心相貌。",
        "translation": "Suppose there's a monk who cultivates the practice of the Dharma and observes the appearance of all loving states of mind.",
        "source": "T13n0397_023:0164a12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當觀，若有愛心即是無明，無明之體能出二過：一者、出行；二者、出識。",
        "translation": "That monk should observe that if there's a mind that longs for something, that's ignorance, and the body of ignorance can produce two faults: one, traveling; and two, escaping consciousness.",
        "source": "T13n0397_023:0164a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識亦有二：一者、出名；二者、出色。",
        "translation": "There are also two kinds of consciousness: one, famous; and two, outstanding.",
        "source": "T13n0397_023:0164a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名色亦二：一者、無住；二、住六入。",
        "translation": "There are also two kinds of name-and-form: one, lacking abiding; and two, abiding in the six sense-fields.",
        "source": "T13n0397_023:0164a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六入亦二：一、不厭欲；二、能生觸。",
        "translation": "There are also two kinds of the six sense-fields: one that's not disillusioned with desire; and two that give rise to contact.",
        "source": "T13n0397_023:0164a16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸亦有二：一、生受心；二者、求受。",
        "translation": "There are also two kinds of contact: 1. the mind that produces sensation; and 2. the mind that seeks sensation.",
        "source": "T13n0397_023:0164a17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受亦有二：一、受苦樂；二、生貪愛。",
        "translation": "There are also two kinds of sensation: 1. sensation of pain and pleasure; and 2. the arising of craving.",
        "source": "T13n0397_023:0164a17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛亦有二：一者、繫縛堅固；二者、求取。",
        "translation": "There are also two kinds of craving: 1. a strong bond; and 2. seeking to acquire.",
        "source": "T13n0397_023:0164a18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取亦有二：一者、貪心；二者、求有。",
        "translation": "Also, there are two kinds of apprehending: 1. desire; and 2. seeking to have.",
        "source": "T13n0397_023:0164a19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有亦有二：一者、樂住；二、生因緣。",
        "translation": "Also, there are two kinds of becoming: one, pleasant abiding; and two, the production of causes and conditions.",
        "source": "T13n0397_023:0164a20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生亦有二：一者、生老；二者、苦緣。",
        "translation": "Also, there are two kinds of birth: first, birth into old age; and second, the causes of suffering.",
        "source": "T13n0397_023:0164a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "老亦有二：一、壞壯色；二、作死因。",
        "translation": "There are also two kinds of old age: 1. the destruction of good form; and 2. the causes of death.",
        "source": "T13n0397_023:0164a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "死亦有二：一、壞壽命；二、愛別離，是名出因。",
        "translation": "There are also two kinds of death: 1. the destruction of life; and 2. separation from what's loved, which is called the cause of emancipation.",
        "source": "T13n0397_023:0164a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何初出？",
        "translation": "\"What is the first emancipation?",
        "source": "T13n0397_023:0164a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘修集法行，觀如是法亦出亦滅，是名初出。」",
        "translation": "If a monk cultivates the practice of gathering dharmas and observes that such dharmas also emanate and cease, this is called the first emanation.\"",
        "source": "T13n0397_023:0164a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告憍陳如：「云何道出？",
        "translation": "It was then that the Bhagavān addressed Kauṇḍinya, \"What is the path to emancipation?",
        "source": "T13n0397_023:0164a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘見道有二種：一者、行行；二者、慧行。",
        "translation": "\"If a monk sees that there are two kinds of paths, one is the practice of practice, and the other is the practice of wisdom.",
        "source": "T13n0397_023:0164a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_023:0164a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝頗知是行行慧行耶？」",
        "translation": "Do you know that this is the practice of practice and the practice of wisdom?\"",
        "source": "T13n0397_023:0164a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍陳如言：「未知。",
        "translation": "Kauṇḍinya said, \"I don't know.",
        "source": "T13n0397_023:0164a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_023:0164a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來為觀十二因緣比丘得大智慧壞諸煩惱，分別解說，比丘聞已當具受持。」",
        "translation": "May it be the Tathāgata's wish that the monk observing the twelve causes and conditions attain great wisdom and destroy the afflictions by discerning and explaining them, and that the monk who hears them will fully embrace them.\"",
        "source": "T13n0397_023:0164a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告寶幢童子：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Boy with the Banner of Treasures, \"Good sons!",
        "source": "T13n0397_023:0164b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝頗能知息出入不？」",
        "translation": "Will you be able to know when you're breathing in and out?\"",
        "source": "T13n0397_023:0164b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不也。",
        "translation": "\"No.",
        "source": "T13n0397_023:0164b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T13n0397_023:0164b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0164b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法行比丘先觀無明乃至老死。",
        "translation": "\"A monk who practices the Dharma first observes nescience ... old age and death.",
        "source": "T13n0397_023:0164b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為觀於無明？",
        "translation": "What is called the observation of nescience?",
        "source": "T13n0397_023:0164b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先觀中陰，於父母所生貪愛心，愛因緣故四大和合，精血二渧合成一渧，大如豆子名歌羅羅。",
        "translation": "First, they look at the intermediate aggregate, the desire mind that arises from a father and mother, and the combination of the four major forces as a result of that desire, which combines two drops of semen and blood into a single drop as large as a bean called a kalala.",
        "source": "T13n0397_023:0164b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是歌羅羅有三事：一命、二識、三煖。",
        "translation": "This kalala has three things: 1. life, 2. consciousness, and 3. warmth.",
        "source": "T13n0397_023:0164b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去世中業緣果報，無有作者及以受者，初息出入是名無明。",
        "translation": "The result of karma in a past life has no author and no recipient, and the first breath that comes in and out is called ignorance.",
        "source": "T13n0397_023:0164b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歌羅羅時氣息入出，有二種道：所謂隨母氣息上下、七日一變。",
        "translation": "During kalala, there are two ways that breath enters and exits: it's called going up and down with the mother's breath and changing once every seven days.",
        "source": "T13n0397_023:0164b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "息入出者名為壽命，是名風道；不臭不爛，是名為煖；是中心意，名之為識。",
        "translation": "Breath entering and exiting is called life, which is called the wind path; it doesn't smell or rot, which is called warmth; and it's called the central idea, which is called consciousness.",
        "source": "T13n0397_023:0164b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0164b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有欲得辟支佛果，當觀如是十二因緣，後觀三受因緣：五陰、十二入、十八界。",
        "translation": "\"If there's someone who wants to attain the fruit of the pratyekabuddha, they should examine these 12 causes and conditions, followed by the three causes and conditions of sensation: the five aggregates, 12 sense-fields, and 18 elements.",
        "source": "T13n0397_023:0164b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為觀？",
        "translation": "What is this contemplation?",
        "source": "T13n0397_023:0164b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨於念心觀息出息入，觀於內身皮膚肌肉筋骨髓腦如空中雲。",
        "translation": "\"As he mindfully observes his breath exiting and entering, he observes the internal body's skin, muscles, sinews, bones, marrow, and brains as clouds in the sky.",
        "source": "T13n0397_023:0164b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是身中風亦復如是，有風能上，有風能下，有風能滿，有風能焦，有能增長，是故息之出入名為身行；以出入息從覺觀生，故名意行；和合出聲名為口行。",
        "translation": "Thus, the wind in his body is likewise capable of rising, descending, filling, scorching, and growing, so the movement of breath is called bodily action; because the movement of breath in and out arises from perception and contemplation, it's called mental action; and the combination of sounds produced is called verbal action.",
        "source": "T13n0397_023:0164b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是等三行因緣，故有識生。",
        "translation": "Because of these three activities as causes and conditions, consciousness arises.",
        "source": "T13n0397_023:0164b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識因緣故則有四陰及以色陰，故名名色。",
        "translation": "As a result of the causes and conditions of consciousness, there are the four aggregates and the aggregates of form, which are therefore called form.",
        "source": "T13n0397_023:0164b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五陰因緣行六處，故名六入。",
        "translation": "Because the five aggregates have causes and conditions for the six sense-fields, they're called the six sense-fields.",
        "source": "T13n0397_023:0164b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "情塵相對故名為觸。",
        "translation": "Because the sense-fields are in direct opposition, they're called touch.",
        "source": "T13n0397_023:0164b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸因緣故念色至念法，是名為受。",
        "translation": "Because of contact as a cause and condition, mindfulness of form ... mindfulness of dharmas is called sensation.",
        "source": "T13n0397_023:0164b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪著於色乃至於法，是名為愛。",
        "translation": "To be addicted to form ... and even to dharmas is called craving.",
        "source": "T13n0397_023:0164b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛因緣故四方求覔，故名為取。",
        "translation": "Because of craving, they seek to be consulted in all directions, which is called grasping.",
        "source": "T13n0397_023:0164b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取因緣故受於後身，故名為有。",
        "translation": "Because of appropriation as a cause and condition, he experiences a subsequent body, which is therefore called existence.",
        "source": "T13n0397_023:0164b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有因緣故有生老死種種諸苦。",
        "translation": "As a result of becoming, there are the various kinds of suffering of birth, old age, and death.",
        "source": "T13n0397_023:0164b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名五陰、十二入、十八界，十二因緣之大樹也。",
        "translation": "These are called the five aggregates, 12 sense-fields, 18 elements, and the great tree of 12 causes and conditions.",
        "source": "T13n0397_023:0164b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故緣出入息，能生一切諸苦煩惱，是故凡夫生時，亦為煩惱繫縛，死時亦爾；終不能得身心自在，不得三昧，不盡諸漏。",
        "translation": "\"Therefore, depending on movement in and out, all painful afflictions can arise, so when ordinary people are born, they're also bound by afflictions, and so is death; ultimately, they can't attain freedom of body and mind, don't attain concentration, and don't end the contaminants.",
        "source": "T13n0397_023:0164b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘觀入出息，如空中風無我我所，無有作者及以受者，從緣而生從緣而滅，無相無物無有覺觀；眾生風者亦復如是，共四大行，生歌羅羅九孔乃至九萬九千諸孔出入，無作無受，是風出入如是肉段，以是因緣故，有無明乃至老死眾苦聚集。",
        "translation": "If a monk observes breathing in and out like the wind in the sky, which has no self and nothing, no author, and no recipient, arises and ceases from conditions, has no characteristics or objects, and has no perception or contemplation, the winds of sentient beings are likewise, sharing the four great formations and giving rise to the nine orifices of the kalala up to 99,000 orifices that flow in and out without being created or received, which flow in and out like this section of flesh, and because of this cause, there's nescience and even the numerous sufferings of old age and death that accumulate.",
        "source": "T13n0397_023:0164b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0164c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空無物無我，出入諸息、地水火風、壽命煖識、無明乃至生老病死，亦復如是。",
        "translation": "Just as space has no object and no self, so does breath, earth, water, fire, wind, life, warmth, consciousness, ignorance, and even birth, aging, illness, and death.",
        "source": "T13n0397_023:0164c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生顛倒，於非我中而橫見我，於如是等同虛空法，作陰界入想，一切凡夫因是顛倒，輪轉生死無有窮已。",
        "translation": "Being mistaken, sentient beings horizontally see a self that's not a self and conceptualize aggregates, elements, and realms as equivalent to space, and because of this mistakenness, all ordinary people transmigrate through birth and death without limit.",
        "source": "T13n0397_023:0164c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法行比丘，觀是息冷則舉身冷，觀是息煖則舉身煖，是身爾時隨意隨風。",
        "translation": "If a monk who practices the Dharma observes that this breath is cold, then he raises his body to be cold, and observes that this breath is warm, then he raises his body to be warm, and at that point this body follows his mind and wind.",
        "source": "T13n0397_023:0164c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀冷時不得禪定不入定聚，是人則墮冷地獄中。",
        "translation": "If he doesn't meditate and doesn't enter the concentration cluster when he observes coldness, that person falls into the cold hell.",
        "source": "T13n0397_023:0164c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀煖時不得禪定不入定聚，是人則墮熱地獄中。",
        "translation": "If he doesn't meditate and doesn't enter the concentration cluster when observing warmth, that person falls into the hot hell.",
        "source": "T13n0397_023:0164c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛弟子修集法行，觀察出入息冷煖等時則得正道。",
        "translation": "If a disciple of the Buddha cultivates the practice of the Dharma and observes that when he's exhaling, he's cold and warm, then he attains the right path.",
        "source": "T13n0397_023:0164c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法行比丘如實觀察無明乃至生老病死，心不顛倒，是名淨目陀羅尼也。",
        "translation": "A monk who correctly observes ignorance ... birth, age, illness, and death, and whose mind isn't mistaken, is called a dhāraṇī of pure eyes.",
        "source": "T13n0397_023:0164c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0164c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能受是陀羅尼，即是真實觀入出息。」",
        "translation": "If you can accept this dhāraṇī, it's the true contemplation of entering, exiting, and breathing.\"",
        "source": "T13n0397_023:0164c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶幢菩薩白佛言：「世尊！",
        "translation": "The Ratnaketu Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0164c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛境界不可思議，非是聲聞緣覺所及。」",
        "translation": "The realms of the buddhas are unfathomable and beyond the reach of śrāvakas and pratyekbuddhas.\"",
        "source": "T13n0397_023:0164c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，四天王白佛言：「世尊！",
        "translation": "It was then that the four heavenly kings said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0164c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨是經典所流布處，我等要當隨侍守護，所有惡事悉令消滅。」",
        "translation": "Wherever these sūtras are disseminated, we must follow and guard them, so that all bad deeds are extinguished.\"",
        "source": "T13n0397_023:0164c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經虛空目分中四無量心",
        "translation": "The four immeasurable states of mind in the Ākāśagarbha section of the Mahāprajñāpāramitā-sūtra",
        "source": "T13n0397_023:0164c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "品第四",
        "translation": "fourth rank of the class",
        "source": "T13n0397_023:0164c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，頻婆娑羅王白佛言：「世尊！",
        "translation": "It was then that King Bimbisāra said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0164c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因諸聲聞辟支佛等修行法行，令閻浮提無有疾疫飢饉惡事。",
        "translation": "Because śrāvakas and pratyekabuddhas cultivate the practice of the Dharma, there's no epidemic or famine in Jambudvīpa.",
        "source": "T13n0397_023:0164c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_023:0164c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩修四無量心，若有四姓供養恭敬，得幾所福？」",
        "translation": "How much merit does a bodhisattva-mahāsattva attain when he cultivates the four immeasurable mental states and if he is offered support and respect by the four families?\"",
        "source": "T13n0397_023:0164c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大王：「若有菩薩修四無量，隨所住國具八上事：一者、其土人民供養父母、增長慚愧，恭敬沙門諸婆羅門耆舊有德，受持禁戒。",
        "translation": "The Buddha told the king, \"Suppose a bodhisattva cultivates the four immeasurables and performs eight excellent things in the country where he lives: first, the people of that land support their parents, develop a sense of shame, revere ascetics, priests, old and virtuous men, and accept the observance of the precepts.",
        "source": "T13n0397_023:0164c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T13n0397_023:0165a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸國土有諸菩薩修四無量，其土人民，則能成就如是初事。",
        "translation": "If there are bodhisattvas in various lands who cultivate the four immeasurables, the people of those lands will be able to accomplish such preliminary things.",
        "source": "T13n0397_023:0165a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大王！",
        "translation": "\"Furthermore, Great King!",
        "source": "T13n0397_023:0165a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國其土人民，修集慈心遠離殺害，其心調柔無有濁心瞋恚之心，平等無二，是名為二。",
        "translation": "\"If a bodhisattva cultivates the four immeasurables, cultivates kindness and seclusion from killing as he follows the people of the country where he lives, and his mind is tempered and free of turbid and angry thoughts, this is called the second.",
        "source": "T13n0397_023:0165a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大王！",
        "translation": "Furthermore, Great King!",
        "source": "T13n0397_023:0165a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國其土人民，不貪財寶，樂為惠施，呵責盜竊，是名為三。",
        "translation": "If a bodhisattva cultivates the four immeasurables, follows the people of the country where he lives, doesn't crave possessions and treasures, is happy to bestow gifts, and rebukes theft, this is called the third.",
        "source": "T13n0397_023:0165a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大王！",
        "translation": "Furthermore, Great King!",
        "source": "T13n0397_023:0165a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國，其土人民自足妻色，遠離非法，呵責欲心，是名為四。",
        "translation": "If a bodhisattva cultivates the four immeasurables and follows the people of the country where he lives to find a wife who's self-sufficient in form, secludes himself from unlawful behavior, and rebuffs desire, this is called the fourth.",
        "source": "T13n0397_023:0165a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大王！",
        "translation": "Furthermore, Great King!",
        "source": "T13n0397_023:0165a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國其土人民，真語實語、無破壞語，常修善語，是名為五。",
        "translation": "If a bodhisattva cultivates the four immeasurables, follows the people of the land in which he lives, speaks truly and honestly, doesn't speak destructively, and always cultivates good speech, this is called the fifth.",
        "source": "T13n0397_023:0165a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大王！",
        "translation": "Furthermore, Great King!",
        "source": "T13n0397_023:0165a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國，其土人民無有嫉妬濁惡之心，是名為六。",
        "translation": "If a bodhisattva cultivates the four immeasurables and follows the people of the country where he lives without jealousy or impurity, this is called the sixth.",
        "source": "T13n0397_023:0165a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大王！",
        "translation": "Furthermore, Great King!",
        "source": "T13n0397_023:0165a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國其土人民，正見不謬無有邪見，是名為七。",
        "translation": "If a bodhisattva cultivates the four immeasurables, and the people of the land in which he lives have right views that aren't mistaken and don't have wrong views, this is called the seventh.",
        "source": "T13n0397_023:0165a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大王！",
        "translation": "Furthermore, Great King!",
        "source": "T13n0397_023:0165a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國其土人民，一切供養恭敬三寶，遠離惡見，是名為八。",
        "translation": "If a bodhisattva cultivates the four immeasurables, makes all offerings to and respects the Three Treasures according to the people of the country where he lives, and secludes himself from bad views, this is called the eighth.",
        "source": "T13n0397_023:0165a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T13n0397_023:0165a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國其土人民，具足如是八種功德。",
        "translation": "If a bodhisattva cultivates the four immeasurables, the people of the land in which he lives will be supplied with these eight virtues.",
        "source": "T13n0397_023:0165a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大王！",
        "translation": "\"Great king!",
        "source": "T13n0397_023:0165a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國，其土無有八怖畏事。",
        "translation": "\"If a bodhisattva cultivates the four immeasurables, then according to the country where he lives, there are no eight fears in his land.",
        "source": "T13n0397_023:0165a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T13n0397_023:0165a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、無內外軍畏；二者、無諸惡鬼畏；三者、無惡星宿畏；四者、無諸惡病畏；五者、無諸惡獸畏；六者、無諸惡賊畏；七者、無諸旱澇畏；八者、無諸穀難畏。",
        "translation": "1. no fear of internal or external armies; 2. no fear of bad spirits; 3. no fear of bad stars; 4. no fear of bad diseases; 5. no fear of bad animals; 6. no fear of bad thieves; 7. no fear of drought or flood; and 8. no fear of grain hardships.",
        "source": "T13n0397_023:0165a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T13n0397_023:0165a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國，其土無有如是八畏。",
        "translation": "\"If a bodhisattva cultivates the four immeasurables, then whatever country he lives in will have none of these eight fears.",
        "source": "T13n0397_023:0165a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大王！",
        "translation": "\"Great king!",
        "source": "T13n0397_023:0165a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國，其土具足八大丈夫。",
        "translation": "\"If a bodhisattva cultivates the four immeasurables, then whatever country he lives in will have a land that's replete with eight great beings.",
        "source": "T13n0397_023:0165a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T13n0397_023:0165a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、有諸眾生已於過去無量佛所，深種善根，如是之人樂生其土。",
        "translation": "1. There are sentient beings who have deeply planted good roots in measureless buddha-places in the past, and such people are delighted to be born in their land.",
        "source": "T13n0397_023:0165a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、復有眾生已於過去無量世中，修戒多聞，如是之人樂生其土。",
        "translation": "2. \"Again, there are sentient beings who have cultivated precepts and are well-versed throughout countless past lives, and such people are delighted to be born in their land.",
        "source": "T13n0397_023:0165b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、復有眾生已於過去無量世中，供養父母、師長、和上、耆舊有德，如是之人樂生其土。",
        "translation": "3. \"Again, there are sentient beings who have supported their parents, teachers, gods, and senior citizens of virtue in countless past lives, and such people are delighted to be born in their land.",
        "source": "T13n0397_023:0165b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、復有眾生已於過去無量世中，成就天業，當受天身，故轉天身來生其土。",
        "translation": "4. \"Again, there are sentient beings who have accomplished celestial karma in measureless past lives and will receive celestial bodies, so they will transform into celestial bodies and be born in their land.",
        "source": "T13n0397_023:0165b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者、復有眾生能壞一切三惡道業，如是之人樂生其土。",
        "translation": "5. \"Again, there are sentient beings who are capable of destroying the actions of all three bad destinies, and such people are delighted to be born in their land.",
        "source": "T13n0397_023:0165b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者、復有眾生具聲聞乘，如是之人樂生其土。",
        "translation": "6. Again, there are sentient beings who possess the vehicle of the śrāvakas, and such a person is happy to be born in their land.",
        "source": "T13n0397_023:0165b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者、復有眾生樂緣覺乘，如是之人來生其土。",
        "translation": "7. Again, there are sentient beings who are delighted with the vehicle of the solitary realizers, and such a person is delighted to be born in their land.",
        "source": "T13n0397_023:0165b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者、復有眾生，已於過去無量世中，修六波羅蜜，如是之人樂生其土。",
        "translation": "Eight, there are sentient beings who have cultivated the six perfections in measureless past lives, and such people are delighted to be born in their land.",
        "source": "T13n0397_023:0165b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T13n0397_023:0165b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國，其土具足如是八人。",
        "translation": "\"If a bodhisattva cultivates the four immeasurables, then whatever country he lives in will have a land full of these eight people.",
        "source": "T13n0397_023:0165b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大王！",
        "translation": "\"Great king!",
        "source": "T13n0397_023:0165b13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國，其地具足上地水味、無上法味、眾生之味，一切眾生心相親愛，如是眾生捨是身已復生天上，乃至鳥獸亦復如是。",
        "translation": "If a bodhisattva cultivates the four immeasurables and follows the country where he lives, his land is replete with the taste of the waters of the higher ground, the taste of the unsurpassed Dharma, and the taste of sentient beings, and all sentient beings are dear to their hearts, such sentient beings will be reborn up in the heavens after abandoning this body, even as the birds and animals are likewise.",
        "source": "T13n0397_023:0165b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T13n0397_023:0165b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如一筐盛四種香：一者、沈水；二者、多伽羅；三者、牛頭栴檀；四者、多摩羅葉，如是四香合有四兩。",
        "translation": "\"Suppose a basket contains four kinds of fragrance: one, sinking water; two, tagara; three, oxhead sandalwood; and four, tamālapatra, such that the four fragrances are four taels each.",
        "source": "T13n0397_023:0165b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四姓人，以四種衣置之筐中，經數日已各自齎去，而是四香銖兩不折，然是衣中各各有香。",
        "translation": "A person from four families puts four kinds of clothing in the basket, and after several days they each carry the four kinds of fragrance, yet each of the four fragrances remains in the clothing without breaking a single tael.",
        "source": "T13n0397_023:0165b19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T13n0397_023:0165b21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修四無量，隨所住國其土人民，各各成就種種功德，而於菩薩無所損減。」",
        "translation": "If a bodhisattva cultivates the four immeasurables, the people of the land in which he lives will each attain various virtues, and nothing will be lost for the bodhisattva.\"",
        "source": "T13n0397_023:0165b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，頻婆娑羅王白佛言：「世尊！",
        "translation": "It was then that King Bimbisāra said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0165b23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩修四無量心不可思議。",
        "translation": "It's inconceivable that a bodhisattva-mahāsattva cultivates the four immeasurable states of mind.",
        "source": "T13n0397_023:0165b24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_023:0165b25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩自身修集，能令無量無邊眾生得大利益。」",
        "translation": "The bodhisattva Mahāsattva's own cultivation can cause measureless and limitless sentient beings to attain great benefit.\"",
        "source": "T13n0397_023:0165b25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有一菩薩名曰淨光，告無勝菩薩言：「善男子！",
        "translation": "At the time, there was a bodhisattva named Jingguang in the assembly who addressed the peerless bodhisattva, saying, \"Good sons!",
        "source": "T13n0397_023:0165b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今已得無上利益。",
        "translation": "\"Now, you've attained unsurpassed benefit.",
        "source": "T13n0397_023:0165b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_023:0165b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝常修集四無量心。」",
        "translation": "You must always cultivate the four immeasurable states of mind.\"",
        "source": "T13n0397_023:0165b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無勝菩薩言：「善男子！",
        "translation": "The unsurpassed bodhisattva said, \"Good man!",
        "source": "T13n0397_023:0165b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今云何得大利益？",
        "translation": "How have I received great benefit now?",
        "source": "T13n0397_023:0165b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是法中無作無受、無覺無見無知、無此無彼。",
        "translation": "Thus, there's nothing made, nothing felt, nothing felt, nothing seen, nothing known, and nothing here or there in this teaching.",
        "source": "T13n0397_023:0165c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0165c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人自言能畫虛空瓔珞莊嚴。",
        "translation": "\"It's like a person who says they can paint a sky adorned with diaphanous jewels.",
        "source": "T13n0397_023:0165c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖有是言，真實不能。",
        "translation": "Even though they say that, they really can't.",
        "source": "T13n0397_023:0165c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法亦復如是，無出無壞，無生無滅，無有處所，無有覺觀，淨三解脫無相無作無願。",
        "translation": "\"So it is with all dharmas, which lack emanation and decay, lack birth and cessation, lack a location, lack perception and contemplation, and are pure, triple-liberation, formless, unconstructed, and without wish.",
        "source": "T13n0397_023:0165c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如爾法界，無轉無散，無合無礙，無濁無邊，猶如虛空無有和合，無欲無性，無見無說。",
        "translation": "Thus, the Dharma realm is without turning or scattering, without confluence or obstruction, without turbidity or limit, like space without combination, without desire or nature, and without views or explanations.",
        "source": "T13n0397_023:0165c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性無數，無少無多，無有境界，無二無著，無量無色，無聲寂靜，無變無量，猶如虛空。",
        "translation": "The nature of dharmas is numberless, neither few nor many, lacking in objects, without duality or attachment, without measure or form, without sound or stillness, and without change or measure, just like space.",
        "source": "T13n0397_023:0165c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無比無勝，無常無斷，難見難知，難可思惟，堅固無行，無有瞋恚，攝諸佛界，是名梵行，名四無量。",
        "translation": "Incomparable and unsurpassed, impermanent and uninterrupted, difficult to see and know, difficult to contemplate, resolute and without practice, devoid of anger, and containing the buddha-realm, this is called the religious practice, which is called the four immeasurables.",
        "source": "T13n0397_023:0165c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來修集，心無厭足，勤行精進，是名佛法，大信大念，大不放逸，至心不忘。",
        "translation": "Such a collection of cultivations, unsatisfied mind, and diligent effort are called the Buddha's teaching, great faith and mindfulness, great nonfrivolity, and utmost nonretrogression.",
        "source": "T13n0397_023:0165c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修集如是四無量心，即是菩薩修行菩薩甚深法界。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates these four immeasurable qualities, this is the bodhisattva's cultivation of the bodhisattva's profound experiential realm.",
        "source": "T13n0397_023:0165c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩將欲近入無生法忍，行六波羅蜜護諸佛法，已近第三如法順忍，真見佛身。",
        "translation": "Thus, the bodhisattva will want to nearly enter the forbearance of the nonarising of dharmas, practice the six perfections to protect the Buddha's teachings, and has nearly reached the third level of compliant forbearance according to the teaching, truly seeing the Buddha's body.",
        "source": "T13n0397_023:0165c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能摧魔眾及壞邪道，度生死河入大智海，通達一切諸佛境界，具足莊嚴諸佛功德。",
        "translation": "He'll be able to destroy Māra's multitude and corrupt wrong paths, cross the river of birth-and-death and enter the ocean of great wisdom, penetrate all the buddha-realms, and fully adorn the buddhas' attributes.",
        "source": "T13n0397_023:0165c17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸所有色種姓財物，勝諸眾生，次第當坐如來法座，具足一切三昧總持，不為一切聖人所輕。",
        "translation": "They are endowed with possessions of various types and castes that are superior to those of sentient beings, will sit sequentially on the Tathāgata's Dharma throne, are fully endowed with the mastery of all samādhis, and aren't despised by all the sages.",
        "source": "T13n0397_023:0165c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸緣覺之所讚歎，常為諸佛之所護念，能解一切國土眾生種種語言。",
        "translation": "He's praised by the pratyekabuddhas, always guarded by the buddhas, and able to understand the various languages of sentient beings in all lands.",
        "source": "T13n0397_023:0165c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸法中，不見受者及以施者，亦無說者及聽法者，無有作者及以受者，猶如虛空。」",
        "translation": "Among all the teachings, there's no recipient or donor, no speaker or listener, and no author or recipient, just like space.\"",
        "source": "T13n0397_023:0165c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨光言：「善男子！",
        "translation": "Jingguang said, \"Good sons!",
        "source": "T13n0397_023:0165c25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我言，汝今成就無量功德。",
        "translation": "That's why I say, \"Now, you've achieved measureless merit.",
        "source": "T13n0397_023:0165c25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_023:0165c26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已於無量無邊世中勤修集故。",
        "translation": "That's because they've diligently cultivated their accumulation in measureless and limitless worlds.",
        "source": "T13n0397_023:0165c26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0165c27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛獲得十力無畏一切佛法，出家苦行逮成正覺，轉妙法輪示大神通入大涅槃，如是等事悉皆因修四無量心，如是即是四無量果。",
        "translation": "If a Buddha attains the ten powers and fearlessness of all the Buddha's teachings, leaves home and ascetic practices, acquires perfect awakening, turns the wonderful wheel of the Dharma, demonstrates great supernormal powers, and enters great nirvāṇa, such things all result from cultivating the four immeasurable states of mind, and thus are the four immeasurable fruits.",
        "source": "T13n0397_023:0165c27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，諸善男子及善女人，應當修集四無量心。」",
        "translation": "For this reason, good sons and good women should cultivate the four immeasurable states of mind.\"",
        "source": "T13n0397_023:0166a01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是法時，二萬眾生得隨慈忍，無量眾生具四無量心，一切大眾咸供養佛。",
        "translation": "When this teaching was given, 20,000 sentient beings attained the tolerance of following kindness, measureless sentient beings became endowed with the four immeasurable minds, and all the masses made offerings to the Buddha.",
        "source": "T13n0397_023:0166a02_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經虛空目分中淨目品第五爾時，有一菩薩童子名無勝意，長跪合掌白佛言：「世尊！",
        "translation": "At the time, there was a bodhisattva boy named Wushengyi who knelt down and put his palms together and said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0166a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈無量心有何等相？",
        "translation": "\"What are the characteristics of the immeasurable mind of kindness?",
        "source": "T13n0397_023:0166a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何等體？",
        "translation": "What is its essence?",
        "source": "T13n0397_023:0166a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等因緣？",
        "translation": "What are the causes and conditions?",
        "source": "T13n0397_023:0166a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等果報？",
        "translation": "What kind of rewards?",
        "source": "T13n0397_023:0166a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何具足？」",
        "translation": "How are they complete?\"",
        "source": "T13n0397_023:0166a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T13n0397_023:0166a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0166a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能問如是甚深之義？」",
        "translation": "Can you ask about the meaning of such a profound statement?\"",
        "source": "T13n0397_023:0166a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，如來即入三昧，其三昧名調伏眾生無所畏懼。",
        "translation": "At that point, the Tathāgata then entered a samādhi whose name is \"disciplining sentient beings without fear.",
        "source": "T13n0397_023:0166a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入三昧已，從其肉髻放大光明，其光猛盛有種種色，遍照無量無邊世界，復出妙音而說偈言：「淤泥之中生芙蓉，　　亦復生於種種華，　眾生以之供養佛，　　并及一切諸天神。",
        "translation": "After entering samādhi, a great radiance radiates from his topknot, and its radiance is so powerful and multi-colored that it shines throughout the measureless and limitless world. Again, a wonderful voice emanates, and he speaks in verse, saying, \"From the mud grows a lotus, and from it also grows various flowers with which sentient beings make offerings to the Buddha and to all the gods.",
        "source": "T13n0397_023:0166a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切惡國亦如是，　　生諸聖人大菩薩，　能調難調不調眾，　　猶如眾生華供養。",
        "translation": "So it is in all the bad lands, giving rise to sages and great bodhisattvas who are capable of taming the difficult and irreconcilable, just like the flowers that sentient beings offer in tribute.",
        "source": "T13n0397_023:0166a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　娑婆世界惡土地，　　釋迦住中宣說法，　若欲獲得無量利，　　應當往彼娑婆界。」",
        "translation": "In the evil land of the sahā world, where the Śākyas live and preach, if you want to reap measureless benefits, you should go to the sahā world.\"",
        "source": "T13n0397_023:0166a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量世界所有眾生，聞是偈已，各各供養其土世尊。",
        "translation": "After hearing this verse, all the sentient beings of measureless worlds each made offerings to the Bhagavān of their land.",
        "source": "T13n0397_023:0166a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既供養已，乘佛神力，悉來集會娑婆世界。",
        "translation": "Once they had made their offerings, they all gathered in the Śāvaka world by virtue of the Buddha's spiritual power.",
        "source": "T13n0397_023:0166a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於佛所，頭面禮拜，却坐一面。",
        "translation": "They bowed their heads and faces to the Buddha and withdrew to sit at one side.",
        "source": "T13n0397_023:0166a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此界大寶坊中，無量眾生具足彌滿，是諸眾生各作是念：「獨我至此供養如來，獨在佛前諮問正法，如來獨為我一人說。」",
        "translation": "At the time, this world was filled with measureless sentient beings in the great jeweled palace, and each of those sentient beings thought, \"I alone have come here to make offerings to the Tathāgata, and I alone have asked about the right teaching before the Buddha, and the Tathāgata speaks for me alone.\"",
        "source": "T13n0397_023:0166a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告無勝意童子：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Boy Without Superlatives, \"Good sons!",
        "source": "T13n0397_023:0166a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈有三種：一、眾生緣；二者、法緣；三者、無緣。",
        "translation": "There are three kinds of kindness: first, the condition of sentient beings; second, the condition of the Dharma; and third, no condition.",
        "source": "T13n0397_023:0166a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0166a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生緣者緣於五有，若有法行菩薩，欲得具足六波羅蜜大慈大悲菩薩十地，速得成就阿耨多羅三藐三菩提，轉正法輪，調伏無量無邊眾生，令度無邊生死大河，欲壞無量惡魔伴黨入大涅槃。",
        "translation": "\"Conditioned by the five existences, if there's a bodhisattva who practices the Dharma and wants to perfect the six perfections of the bodhisattva ten stages of great kindness and compassion, quickly achieve unsurpassed, correct enlightenment, turn the wheel of the Dharma, tame measureless and limitless sentient beings, cause them to cross the great river of limitless birth-and-death, and wish to destroy measureless evil demon companions and enter great nirvāṇa, then that bodhisattva should cultivate the four immeasurable states of mind.",
        "source": "T13n0397_023:0166a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩，應當修集四無量心。",
        "translation": "Thus, bodhisattvas should cultivate the four immeasurable states of mind.",
        "source": "T13n0397_023:0166b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應云何修？",
        "translation": "How should they cultivate them?",
        "source": "T13n0397_023:0166b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，為下方眾生乃至上方一切眾生修集是慈，視諸眾生如父如母，如師和上，如佛、世尊、聲聞、緣覺。",
        "translation": "\"Suppose a bodhisattva Mahāsattva cultivates this kindness for sentient beings below and for all sentient beings above, viewing them as father and mother, as teacher and superior, and as buddhas, world-honored ones, śrāvakas, and pratyekbuddhas.",
        "source": "T13n0397_023:0166b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，應作如是思惟：『若有眾生，橫於我所起諸惡事。",
        "translation": "At that point, they should think in this way, 'Suppose sentient beings transgress and do bad things to me.'",
        "source": "T13n0397_023:0166b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時應作是念：「若我瞋是惡眾生者，則為十方諸佛所見，是大可恥。",
        "translation": "At that point, the bodhisattva should think, 'If I were to anger at this bad sentient being, then I'd be seen by the buddhas in the ten directions, which would be greatly shameful.",
        "source": "T13n0397_023:0166b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當見呵責：云何是人為阿耨多羅三藐三菩提，而自不能調伏其心？",
        "translation": "You should see and rebuke him, 'How is it that this person can't control his own mind for the sake of the unsurpassed, correct enlightenment?'",
        "source": "T13n0397_023:0166b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人無有脚足而欲趣彼欝單曰土，如無目者而欲讀書，如無手者而欲執作，遠離慈心而欲獲得阿耨多羅三藐三菩提者，亦復如是。",
        "translation": "It's like a person who wants to go to that Uttarakuru land without legs, who wants to read without eyes, who wants to work without hands, and who wants to attain unsurpassed, correct enlightenment while being detached from kindness.",
        "source": "T13n0397_023:0166b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不能斷如是瞋心，尚不能得聲聞菩提，何況阿耨多羅三藐三菩提？",
        "translation": "If they can't cut off such anger, they still can't attain śrāvaka enlightenment, so why wouldn't they attain unsurpassed, correct enlightenment?",
        "source": "T13n0397_023:0166b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我不能調伏自心，當為諸佛聲聞緣覺天龍八部之所呵責。",
        "translation": "If I fail to control my own mind, I'll be rebuked by the buddhas, śrāvakas, pratyekbuddhas, gods, dragons, and the eight groups.",
        "source": "T13n0397_023:0166b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我不能調伏自心，當得大罪受地獄苦，不得現在未來利益，是故應當修集慈心。」』",
        "translation": "If I can't control my own mind, I'll be condemned to suffer in hell and won't receive any present or future benefit; therefore, you must cultivate a compassionate mind.\"",
        "source": "T13n0397_023:0166b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『若有於我已作諸惡，始作欲作，或以惡事加於我親，以利養事益於我怨，亦復如是。』",
        "translation": "Again, he thought, 'It's likewise if there are evils that I've done or that I want to do in the beginning, or if I were to inflict bad deeds on my relatives or to benefit my enemies with nurturing deeds.'",
        "source": "T13n0397_023:0166b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀已，菩薩先於一方眾生修集慈心，二三四方四維上下亦復如是。",
        "translation": "After observing this, the bodhisattva first cultivates kindness toward sentient beings on one side, and so do the second, third, fourth, fourth, and upper and lower dimensions.",
        "source": "T13n0397_023:0166b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0166b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩慈緣眾生。」",
        "translation": "This is called a bodhisattva who compassionately considers sentient beings.\"",
        "source": "T13n0397_023:0166b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有一天子名曰明星，白佛言：「世尊！",
        "translation": "At the time, there was a celestial named Xingxing in the assembly who said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0166b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩初修慈心，如是慈心有何等果？",
        "translation": "If a bodhisattva-mahāsattva first cultivates kindness, what is the result of such kindness?",
        "source": "T13n0397_023:0166b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是現在，為在未來，具足成就幾所福德？",
        "translation": "How much merit will be fully achieved in the present and in the future?",
        "source": "T13n0397_023:0166b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_023:0166b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩修集慈心，頗復當墮三惡道不？」",
        "translation": "Wouldn't a bodhisattva who thus cultivates kindness fall into the three evil destinies?\"",
        "source": "T13n0397_023:0166b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T13n0397_023:0166b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0166b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已於昔供養恭敬無量諸佛，是故今能發如是問；已種善子善根堅固，無量世中修集慈心，不與聲聞辟支佛共，為欲利益無量眾生，是故今者能作是問。",
        "translation": "You've made offerings to and venerated measureless buddhas in the past, so now you're able to ask this question; you've planted good sons with strong good roots, cultivated compassion throughout measureless lifetimes, didn't share the desire to benefit measureless sentient beings with the śrāvakas and pratyekabuddhas, and are therefore able to ask this question now.",
        "source": "T13n0397_023:0166b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0166c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen closely, listen closely!",
        "source": "T13n0397_023:0166c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當為汝分別解說。",
        "translation": "Now, I will explain it for you in detail.",
        "source": "T13n0397_023:0166c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩，能如我先所說修慈，是人則得臥安寤安不見惡夢，資生所須無所乏少。",
        "translation": "If a bodhisattva cultivates kindness as I've explained before, that person will be able to lie down and sleep soundly, not see bad dreams, and have nothing lacking in the necessities of life.",
        "source": "T13n0397_023:0166c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天守護，人天樂見，不聞惡聲，身不惡病，常樂寂靜，勤行精進，樂受正法，知見無我，常為國主、沙門、梵志、男女、大小，乃至鳥獸之所供養，親近善友，所謂聲聞緣覺諸佛菩薩，樂行惠施能度眾生。",
        "translation": "Guarded by gods, delighted by humans and gods, he doesn't hear bad sounds, doesn't suffer from bad illnesses, always enjoys tranquility, diligently practices exertion, enjoys the right teaching, knows and sees that there's no self, is always supported by lords of countries, ascetics, priests, men and women, large and small, and even birds and animals, and becomes close to the good friends called śrāvakas, pratyekabuddhas, and bodhisattvas who gladly practice generosity and are able to save sentient beings.",
        "source": "T13n0397_023:0166c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有善心，不為三毒之所破壞，善名好譽流布四方。",
        "translation": "Their good intentions aren't damaged by the three poisons, and their good reputation spreads in all directions.",
        "source": "T13n0397_023:0166c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能療眾生所有惡病，能令眾生遠離眾苦，能解眾生一切繫縛，能調眾生諸惡煩惱，能壞一切惡邪異見，能與眾生信心念心。",
        "translation": "They can treat all the bad illnesses of sentient beings, free sentient beings from all suffering, free sentient beings from all fetters, tame their bad afflictions, destroy all wrong and mistaken views, and have faith and mindfulness of sentient beings.",
        "source": "T13n0397_023:0166c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大智慧心，心住大乘無能傾動，不隨他語，能壞眾生身口意惡，能滅眾生三種障業，唯除五逆，誹謗正法賢聖之人、劫招提僧物。",
        "translation": "That mind of great wisdom, mind abiding in the great vehicle that's untouchable and doesn't follow the words of others, destroys the physical, verbal, and mental evils of sentient beings, destroys the three kinds of hindering karma in sentient beings, and removes only the five heinous crimes, those who denigrate the right Dharma, noble people, and the property of monks who invite eons to come.",
        "source": "T13n0397_023:0166c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0166c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若能如是修慈，當捨命時，面見十方諸佛、世尊手摩其頭，佛手觸故心則歡喜，心歡喜故，尋得往生其佛國土，亦聞如是善妙之言：所謂『莫生怖畏，莫生怖畏。",
        "translation": "If a bodhisattva thus cultivates kindness, when he dies, he'll see the buddhas and world-honored ones in the ten directions face to face, touch his head with their hands, and his heart will rejoice when the buddhas' hands touch it; his heart will rejoice as a result, and he'll be able to be reborn in his buddha land and hear these wonderful words, 'Don't become afraid; don't become afraid.'",
        "source": "T13n0397_023:0166c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝是修慈純善之人，定當得生淨佛世界，覲見無量諸佛、世尊，離三惡道必入涅槃，亦聞法緣、無緣之慈，亦得具足四無量心，乃至獲得阿耨多羅三藐三菩提。』」",
        "translation": "You, who cultivate the pure virtue of kindness, will surely be born in a pure buddha-land, meet measureless buddhas and world-honored ones, leave the three evil destinies and surely enter nirvāṇa, hear about kindness in terms of dharmas and lack of conditions, and attain the fulfillment of the four immeasurable states of mind, up to the point of attaining unsurpassed, correct enlightenment.\"",
        "source": "T13n0397_023:0166c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，明星天子聞是法時，於諸禪定出入自在。",
        "translation": "When the young star god heard this teaching, he moved freely in and out of meditation.",
        "source": "T13n0397_023:0166c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無勝意童子白佛言：「世尊！",
        "translation": "The boy of unsurpassed mind said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0166c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是天子，以何力故，於禪定中速入速出？」",
        "translation": "Thus, Prince of the gods, what is the power that causes you to enter and exit meditation so quickly?\"",
        "source": "T13n0397_023:0166c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T13n0397_023:0166c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是天子者，已於無量諸如來所殖諸善根，無量世中修法緣慈，本願力故生四天處。",
        "translation": "\"This is a divine son who has cultivated the good roots of measureless tathāgatas and cultivated the conditioned kindness of the Dharma throughout measureless lifetimes, and it was by the power of his original vow that he was born in one of the four heavenly realms.",
        "source": "T13n0397_023:0166c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在日天前十千由旬，所住宮殿縱廣三萬二千由旬，琉璃所成，前後左右滿十由旬。",
        "translation": "He lives 10,000 leagues before the sun and occupies a palace 32,000 leagues across that's made of beryl and filled with 10 leagues of glass from front to back and from side to side.",
        "source": "T13n0397_023:0167a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天男女而共圍遶，是人在中離其眷屬三由旬所獨坐寶床，出入禪定一日一夜。",
        "translation": "Surrounded by gods and men, he's separated from his retinue for three leagues and sits alone on a jeweled bed, going in and out of meditation for a day and a night.",
        "source": "T13n0397_023:0167a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四天下有八十天處，六十龍處，四阿修羅處，四迦樓羅處，五十二緊那羅處，四十六摩睺羅伽處，八拘辦荼處，三十富餓鬼處，三十毘舍遮處。",
        "translation": "Under these four heavens, there are 80 heavenly realms, 60 nāga realms, four asura realms, four garuḍa realms, 52 kiṃnara realms, 46 mahoraga realms, 8 kovidāra realms, 30 rich hungry ghost realms, and 30 piśācī realms.",
        "source": "T13n0397_023:0167a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於如是處，悉能調伏如是眾生，以本願力故。",
        "translation": "In all these places, he's able to subdue such sentient beings because of the power of his past vows.",
        "source": "T13n0397_023:0167a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔發願，此閻浮提夜五分過，餘一分在，當在日前十千由旬，先當破壞閻浮提闇而作明相。",
        "translation": "In the past, he vowed that five parts of the night in Jambudvīpa would pass away while the other part would remain, and that 10,000 leagues beforehand, he would first destroy the darkness of Jambudvīpa and make it visible.",
        "source": "T13n0397_023:0167a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若閻浮提諸善眾生欲度生死修禪定者，當為是人除去睡眠施其念力。",
        "translation": "If there are good sentient beings in Jambudvīpa who want to save themselves from birth and death and cultivate meditation, they will remove their drowsiness and give them the power of mindfulness.",
        "source": "T13n0397_023:0167a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲見我，我當於夢現作和上師長父母。",
        "translation": "If they want to see me, I'll be a superior teacher, a parent, and a parent in a dream-like appearance.",
        "source": "T13n0397_023:0167a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有凡夫修集外道，我當破壞其人邪心示以正道。",
        "translation": "If there's a worldling cultivating a non-Buddhist path, I'll destroy that person's wrong mind and show them the right path.",
        "source": "T13n0397_023:0167a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生於世間事及出世事，生懈怠者，覩見我已除去懈怠勤修事業。",
        "translation": "If there are sentient beings who become lazy in worldly or supramundane tasks, then they'll see me and remove their laziness and work diligently.",
        "source": "T13n0397_023:0167a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生迷失正路，得見我時則還見道。",
        "translation": "If sentient beings are lost on the right path, then when they see me, they'll return to the path.",
        "source": "T13n0397_023:0167a17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生身遇重病，得見我者苦痛休息，身得安眠受大快樂。",
        "translation": "If sentient beings are seriously ill, then when they see me, their pain and suffering are relieved, and they can sleep soundly and experience great happiness.",
        "source": "T13n0397_023:0167a18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有老人身受眾苦心多忘誤，得見我者還得念心，然我出時能令眾生繫心念善。",
        "translation": "If there are elderly people who are suffering from many hardships and whose minds are often forgetful, and they get to see me, they can still be mindful of their minds, but when I emerge, I can cause sentient beings to bind their minds to mindfulness of goodness.",
        "source": "T13n0397_023:0167a19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生命將欲盡，最後一念，我當為說大乘經典，彼既聞已面見佛像，捨身得生淨佛世界。",
        "translation": "If there are sentient beings who are about to reach the end of their lives and are mindful at the last moment, I will explain the great vehicle sūtras for them, and after they hear them and see the Buddha's image, they'll abandon their bodies and be born in the pure Buddha world.",
        "source": "T13n0397_023:0167a21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有欲求辟支佛者，我當為說辟支佛乘。",
        "translation": "If there's someone who wants to pursue the pratyekabuddha vehicle, I'll explain the pratyekabuddha vehicle for them.",
        "source": "T13n0397_023:0167a23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有欲求聲聞乘者，我亦當為說聲聞乘。",
        "translation": "If there's someone who wants to pursue the śrāvaka vehicle, I'll also teach the śrāvaka vehicle for them.",
        "source": "T13n0397_023:0167a24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，有三惡業，聞我說法惡業即滅。",
        "translation": "If there are sentient beings with the three bad actions, then they'll hear me teach the Dharma and their bad actions will cease.",
        "source": "T13n0397_023:0167a25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_023:0167a26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先行於閻浮提國，然後次行於瞿陀尼，瞿陀尼後次欝單曰欝單曰後，次弗婆提。",
        "translation": "First, I went to Jambudvīpa, then I went to Gautama next, and after Gautama, I went to Uttarakuru, then Uttarakuru, and then Pūrvavideha.",
        "source": "T13n0397_023:0167a26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是等本願力故，常得修行六波羅蜜，乃至得成阿耨多羅三藐三菩提。」",
        "translation": "Because of the power of such former vows, I'll always be able to cultivate the six perfections ... and achieve unsurpassed, correct enlightenment.\"",
        "source": "T13n0397_023:0167a28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，明星天子白佛言：「世尊！",
        "translation": "It was then that the young star god said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0167b01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今為欲利益一切眾生故，說此陀羅尼：「『盧遮羅(一)　盧遮羅(二)　盧遮那(三)　娑羅叉婆(四)　娑羅叉婆(五)　娑羅叉[(口*皮)/女](六)　阿[(口*皮)/女]呵呵(七)　阿[(口*皮)/女]特荼(八)　阿婆闍婆(九)　阿婆叉那(十)　阿叉叉叉(十一)　富羅婆邏(十二)　阿婆叉叉(十三)　闍婆闍婆(十四)　摩呵迦波(十五)　阿婆阿婆(十六)　摩呵娑摩(十七)　頻豆(十八)　莎闍羯波(十九)　阿鞾(二十)　阿鞾(二十一)　呵呵尼摩(二十二)　沫邏莎律闍(二十三)　迦留那闍邏(二十四)　莎呵』「世尊！",
        "translation": "我今為欲利益一切眾生故，說此陀羅尼：「『盧遮羅(一)　盧遮羅(二)　盧遮那(三)　娑羅叉婆(四)　娑羅叉婆(五)　娑羅叉[(口*皮)/女](六)　阿[(口*皮)/女]呵呵(七)　阿[(口*皮)/女]特荼(八)　阿婆闍婆(九)　阿婆叉那(十)　阿叉叉叉(十一)　富羅婆邏(十二)　阿婆叉叉(十三)　闍婆闍婆(十四)　摩呵迦波(十五)　阿婆阿婆(十六)　摩呵娑摩(十七)　頻豆(十八)　莎闍羯波(十九)　阿鞾(二十)　阿鞾(二十一)　呵呵尼摩(二十二)　沫邏莎律闍(二十三)　迦留那闍邏(二十四)　莎呵』「世尊！",
        "source": "T13n0397_023:0167b01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘、比丘尼、優婆塞、優婆夷，若男、若女、若大、若小，若有至心念我事者，是人則得淨於諸業，神通施戒忍辱精進禪定智慧，解脫佛土四無礙智。",
        "translation": "If there are monks, nuns, laymen, or laywomen, great or small, who wholeheartedly remember my actions, that person will attain purification of karma, the supernormal powers, morality, forbearance, humility, diligence, meditation, wisdom, and the four unhindered cognitions of the Buddha's land of liberation.",
        "source": "T13n0397_023:0167b10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸人不得成就如是事者，我則欺誑十方諸佛，於未來世，亦莫令我得阿耨多羅三藐三菩提。」",
        "translation": "If such a person doesn't accomplish such a thing, I'll deceive the buddhas of the ten directions, and I won't be allowed to attain supreme perfect enlightenment in the future.\"",
        "source": "T13n0397_023:0167b13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，無勝意童子白佛言：「世尊！",
        "translation": "It was then that the Boy Without Superlatives said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0167b15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方佛土所有人民，常作是言：『娑婆世界雜穢不淨。』",
        "translation": "All the people of the Buddha-lands of other lands often say, 'The sahā world is defiled and impure.'",
        "source": "T13n0397_023:0167b16_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我今者常見清淨。」",
        "translation": "But I now often find it to be pure.\"",
        "source": "T13n0397_023:0167b17_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是，如是。",
        "translation": "The Buddha said, \"So it is, so it is.",
        "source": "T13n0397_023:0167b18_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0167b18_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "As you've said.",
        "source": "T13n0397_023:0167b18_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此世界諸菩薩等，或作天像調伏眾生，或作龍像，或作鬼像，或阿修羅像，或迦樓羅像，或緊那羅像，或摩睺羅像，或夜叉像，或拘辦荼像，毘舍闍像，薜荔陀像，人像，畜生像，鳥獸之像，遊閻浮提，教化如是種類眾生。",
        "translation": "Furthermore, the bodhisattvas of this world sometimes make images of gods to tame sentient beings, images of dragons, images of ghosts, images of asuras, images of garuḍas, images of kiṃnaras, images of mahoras, images of yakṣas, images of kovidāra, images of piśāca, images of velīta, images of humans, images of animals, and images of birds and beasts, and they travel to Jambudvīpa to teach and transform such kinds of sentient beings.",
        "source": "T13n0397_023:0167b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0167b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為人天調伏眾生，是不為難。",
        "translation": "\"If they subdue sentient beings for humans and gods, it's not difficult.",
        "source": "T13n0397_023:0167b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為畜生調伏眾生，是乃為難。",
        "translation": "If they subdue sentient beings for animals, this would be difficult.",
        "source": "T13n0397_023:0167b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0167b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提外，南方海中有琉璃山，名之為潮。",
        "translation": "Outside of Jambudvīpa, there's a beryl mountain in the southern sea that's called Tidal Wave.",
        "source": "T13n0397_023:0167b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高二十由旬，具種種寶，其山有窟名種種色，是昔菩薩所住之處，縱廣一由旬高六由旬，有一毒蛇在中而住，修聲聞慈。",
        "translation": "It's 20 leagues high and full of various treasures, and there's a cave on that mountain named Various Colors that used to be where the bodhisattvas lived, even though it's a league wide and six leagues high, and there's a viper living in it that cultivates śrāvaka compassion.",
        "source": "T13n0397_023:0167b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名曰無死，縱廣高下亦復如是，亦是菩薩昔所住處，中有一馬修聲聞慈。",
        "translation": "Another cave named 'deathless', even though it's wide and high, is likewise. It's also where the bodhisattva used to live, and there's a horse in it cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名曰善住，縱廣高下亦復如是，亦是菩薩昔所住處，中有一羊修聲聞慈。",
        "translation": "There's another cave named Shanzhai, which is the same in height and breadth as that where the bodhisattva used to live, and there's a sheep cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其山樹神名曰無勝，有羅剎女名曰善行，各有五百眷屬圍遶，是二女人常共供養如是三獸。",
        "translation": "There's a mountain tree god named Wuxiang and a Rāṣṭrapāla woman named Shanxing, each surrounded by 500 retinues, and these two women always make offerings to these three animals together.",
        "source": "T13n0397_023:0167c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0167c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提外西方海中有頗梨山，高二十由旬，其山有窟，名曰上色，縱廣高下亦復如是，亦是菩薩昔所住處，有一獼猴修聲聞慈。",
        "translation": "Outside of Jambudvīpa there's Mount Phāli in the western sea, 20 yojanas high, and there's a cave on that mountain named 'Upward Form,' which is likewise wide and high and low, and it's also where the bodhisattva used to live, and there's a monkey cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名曰誓願，縱廣高下亦復如是，亦是菩薩昔所住處，中有一雞修聲聞慈。",
        "translation": "There's another cave named Vow, which is the same in height and breadth as it was in the past, where the bodhisattvas used to live, and there's a chicken cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名曰法床，縱廣高下亦復如是，亦是菩薩昔所住處，中有一犬修聲聞慈。",
        "translation": "There's another cave named Dharma Bed, both large and small, which is the same as the bodhisattva's former dwelling place, and there's a dog cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中有火神，有羅剎女，名曰眼見，各有五百眷屬圍繞，是二女人常共供養是三鳥獸。",
        "translation": "There's a fire deity and a Rāṣṭrapāla woman named Eyesight, each surrounded by 500 retinues, and these two women always make offerings to these three birds and animals together.",
        "source": "T13n0397_023:0167c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0167c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提外北方海中有一銀山，名菩提月，高二十由旬，中有一窟名曰金剛，縱廣高下亦復如是，亦是菩薩昔所住處，中有一猪修聲聞慈。",
        "translation": "On the northern sea outside of Jambudvīpa there's a silver mountain named Bodhidharma, 20 leagues high, in which there's a cave called Vajra, even though it's the same in height and breadth, where the bodhisattva used to live, and there's a pig cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名香功德，縱廣高下亦復如是，亦是菩薩昔所住處，中有一鼠修聲聞慈。",
        "translation": "There's another cave named Fragrant Merit, even though it's wide and high, and so it is; it's also where the bodhisattva used to live, and there's a mouse cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名高功德，縱廣高下亦復如是，亦是菩薩本所住處，中有一牛修聲聞慈。",
        "translation": "*There's another cave named Gao gongde, both high and low, which is the same in breadth and height, and it's where the bodhisattva used to live, and there's a cow cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山有風神名曰動風，有羅剎女名曰天護，各有五百眷屬圍繞，是二女人常共供養如是三獸。",
        "translation": "There's a mountain wind god named Shifu and a Rāṣṭrapāla woman named Tianhuo, each surrounded by 500 retinues, and these two women always make offerings to these three animals together.",
        "source": "T13n0397_023:0167c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0167c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提外東方海中有一金山，名功德相，高二十由旬，中有一窟名曰明星，縱廣高下亦復如是，亦是菩薩昔所住處，有一師子修聲聞慈。",
        "translation": "Outside of Jambudvīpa there's a mountain in the eastern sea named Gongsang, which is 20 leagues high, and there's a cave named Xingxing, which is the same in height and breadth as the bodhisattva's former dwelling place, and there's a lion cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名曰淨道，縱廣高下亦復如是，亦是菩薩昔所住處，中有一兔修聲聞慈。",
        "translation": "There's another cave named Jingdao, which is likewise wide and high and low, and it's also where the bodhisattva used to live, and there's a rabbit cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0167c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一窟名曰喜樂，縱廣高下亦復如是，亦是菩薩昔所住處，中有一龍修聲聞慈。",
        "translation": "There's another cave named Pleasure, which is likewise wide and high, and it's the same as the bodhisattva's former dwelling place, where there's a dragon cultivating śrāvaka compassion.",
        "source": "T13n0397_023:0168a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山有水神名曰水天，有羅剎女名修慚愧，各有五百眷屬圍遶，是二女人常共供養如是三獸。",
        "translation": "On a mountain, there's a water spirit named Varuṇa, and there's a Rāṣṭrapāla woman named Cunda, each surrounded by 500 retinues, and these two women always make offerings to these three animals together.",
        "source": "T13n0397_023:0168a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是十二獸，晝夜常行閻浮提內，天人恭敬，功德成就，已於諸佛所發深重願。",
        "translation": "\"These twelve animals travel around Jambudvīpa day and night, commanding the respect of gods and humans and accomplishing their virtues, and they have made a profound vow to visit the buddhas.",
        "source": "T13n0397_023:0168a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一日一夜常令一獸遊行教化，餘十一獸安住修慈，周而復始。",
        "translation": "Each day and night, he always causes one of the animals to parade around and teach the others 11 animals, abiding calmly and cultivating kindness as he goes from day to day.",
        "source": "T13n0397_023:0168a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七月一日鼠初遊行，以聲聞乘教化一切鼠身眾生，令離惡業勸修善事。",
        "translation": "On the first day of the seventh month, the first rat parades around, teaching and transforming all sentient beings in rat bodies with the vehicle of the śrāvakas, causing them to part with bad karma and encouraging them to cultivate good deeds.",
        "source": "T13n0397_023:0168a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是次第至十三日，鼠復還行，如是乃至盡十二月。",
        "translation": "From this sequence up to the thirteenth day, the mouse again travels, and so on through December.",
        "source": "T13n0397_023:0168a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至十二歲，亦復如是，常為調伏諸眾生故。",
        "translation": "Until the twelfth year, it's likewise, always working to tame sentient beings.",
        "source": "T13n0397_023:0168a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故此土多有功德，乃至畜生亦能教化，演說無上菩提之道，是故他方諸菩薩等，常應恭敬此佛世界。」",
        "translation": "Because this land is so full of merit that even animals can be taught and educated and the path to unsurpassed enlightenment explained, bodhisattvas in other directions should always revere this Buddha's world.\"",
        "source": "T13n0397_023:0168a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有一優婆塞名曰淨德，白佛言：「世尊！",
        "translation": "At the time, there was an Upāsaka in the assembly named Jingde who said to the Buddha, \"Bhagavān!",
        "source": "T13n0397_023:0168a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今可得覩見如是十二獸不？」",
        "translation": "May I now see such twelve animals?\"",
        "source": "T13n0397_023:0168a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘、比丘尼、優婆塞、優婆夷，欲得覩見是十二獸，欲得大智大念大定大神通力，欲受一切所有典籍、四無量心，欲行正道得奢摩他，欲得寂靜，欲增善法，是人當以白土作山，縱廣七尺高十二尺，種種香塗金薄薄之，四邊周匝二十尺，所散瞻婆華當以銅器盛，諸種種非時之漿置之四面，清淨持戒日三洗浴敬信三寶。",
        "translation": "If a monk, nun, layman, or laywoman wishes to see these twelve animals, to attain great wisdom, great mindfulness, great concentration, and great supernormal powers, to receive all the scriptures and the four immeasurable states of mind, to practice the right path and attain calm abiding, and to increase the number of good qualities, he or she should make a mountain of white clay seven feet wide and twelve feet high, coat it with various kinds of incense and thin gold, surround it with twenty feet on all sides, fill it with the campaka flower, place various kinds of untimely fluids on its four sides, purify it, observe precepts, bathe it three times a day, and venerate the Three Treasures.",
        "source": "T13n0397_023:0168a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離山三丈正東向立，誦如是呪：「◎戰陀羅呵(一)　修利蛇比摩(二)　其羅[月*兄](三)　沸己牟邏(四)　若蛇牟邏(五)　阿呵希(六)　娑呵囉希(七)　若蛇呵希(八)　薩婆復多呵(九)　梨蛇婆呵休(十)　摩莎車婆牟梨(十一)　迦[(口*皮)/女]浮(十二)　邏奢浮(十三)　修邏蛇牟(十四)　呿迦那(十五)　摩希叉婆(十六)　迦婆摩訶(十七)　阿叉比婆邏(十八)　多波比莎(十九)　沙持因持利蛇鞞莎(二十)　阿闍牟他婆(二十一)　婆盧婆叉(二十二)　槃陀哆(二十三)　遮羅叉婆希(二十四)　呵迦比牟(二十五)　哆比勒搜(二十六)　散遮勒搜(二十七)　[(口*皮)/女]婆浮(二十八)　娑邏[(口*皮)/女]叉搜(二十九)　沸己遮(三十)　哆莎賴莎(三十一)　陀叉邏莎(三十二)　波利波遮(三十三)　修羅修(三十四)　搜婆莎彌(三十五)　希邏莎(三十六)　[(口*皮)/女]邏牟莎邏莎(三十七)　牟莎邏私(三十八)　邏婆邏娑(三十九)　頻婆思邏莎(四十)　[(口*皮)/女][(口*皮)/女]邏娑(四十一)　陀摩盧遮那邏娑(四十二)　富囊挫蘭呵邏娑(四十三)　首陀盧遮那邏娑(四十四)　[(口*皮)/女]摩摩邏娑(四十五)　比摩盧遮那呿伽(四十六)　薩顛摩邏娑(四十七)　阿利耶盧遮那耨耨(四十八)　比摩牟(四十九)　婆羅呵芒[(口*皮)/女]呵邏私[少/兔][少/兔](五十)　阿由比目猛(五十一)　牟尼邏提致汦(五十二)　莎呵「住十五日，當於山上見初月像。",
        "translation": "離山三丈正東向立，誦如是呪：「◎戰陀羅呵(一)　修利蛇比摩(二)　其羅[月*兄](三)　沸己牟邏(四)　若蛇牟邏(五)　阿呵希(六)　娑呵囉希(七)　若蛇呵希(八)　薩婆復多呵(九)　梨蛇婆呵休(十)　摩莎車婆牟梨(十一)　迦[(口*皮)/女]浮(十二)　邏奢浮(十三)　修邏蛇牟(十四)　呿迦那(十五)　摩希叉婆(十六)　迦婆摩訶(十七)　阿叉比婆邏(十八)　多波比莎(十九)　沙持因持利蛇鞞莎(二十)　阿闍牟他婆(二十一)　婆盧婆叉(二十二)　槃陀哆(二十三)　遮羅叉婆希(二十四)　呵迦比牟(二十五)　哆比勒搜(二十六)　散遮勒搜(二十七)　[(口*皮)/女]婆浮(二十八)　娑邏[(口*皮)/女]叉搜(二十九)　沸己遮(三十)　哆莎賴莎(三十一)　陀叉邏莎(三十二)　波利波遮(三十三)　修羅修(三十四)　搜婆莎彌(三十五)　希邏莎(三十六)　[(口*皮)/女]邏牟莎邏莎(三十七)　牟莎邏私(三十八)　邏婆邏娑(三十九)　頻婆思邏莎(四十)　[(口*皮)/女][(口*皮)/女]邏娑(四十一)　陀摩盧遮那邏娑(四十二)　富囊挫蘭呵邏娑(四十三)　首陀盧遮那邏娑(四十四)　[(口*皮)/女]摩摩邏娑(四十五)　比摩盧遮那呿伽(四十六)　薩顛摩邏娑(四十七)　阿利耶盧遮那耨耨(四十八)　比摩牟(四十九)　婆羅呵芒[(口*皮)/女]呵邏私[少/兔][少/兔](五十)　阿由比目猛(五十一)　牟尼邏提致汦(五十二)　莎呵「住十五日，當於山上見初月像。",
        "source": "T13n0397_023:0168a24_4",
        "is_bad_quality": true
    },
    {
        "source_sentence": "爾時則知見十二獸，見已所願隨意即得。",
        "translation": "At that point, they'll know that they've seen 12 animals, and after seeing them, they'll obtain whatever they desire.",
        "source": "T13n0397_023:0168b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0168b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是修行苦行，即得眼見是十二獸。」",
        "translation": "If you can thus cultivate asceticism, you'll be able to see these 12 animals with your eyes.\"",
        "source": "T13n0397_023:0168b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，淨德優婆塞語明星菩薩言：「善男子！",
        "translation": "At that point, the pure virtue of Upāsaka said to the star bodhisattva, \"Good man!",
        "source": "T13n0397_023:0168b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能教化調伏眾生。",
        "translation": "\"You can teach and discipline sentient beings to tame them.",
        "source": "T13n0397_023:0168b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何調伏？",
        "translation": "How do you tame them?",
        "source": "T13n0397_023:0168b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為以身耶？",
        "translation": "Why is it based on the body?",
        "source": "T13n0397_023:0168b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "口耶意耶？」",
        "translation": "Is it the mouth, or is it the mind?\"",
        "source": "T13n0397_023:0168b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我非身口，唯以心業。」",
        "translation": "I don't do this with body or speech, but only with mind.\"",
        "source": "T13n0397_023:0168b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是心業，為過去耶？",
        "translation": "If this is mental activity, is it the past?",
        "source": "T13n0397_023:0168b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來耶？",
        "translation": "What is the future?",
        "source": "T13n0397_023:0168b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在乎？」",
        "translation": "Do you care now?\"",
        "source": "T13n0397_023:0168b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦非去來，唯是現在，制現在心不令作惡。」",
        "translation": "It's not past or future, but present, and it controls the present mind so that it doesn't do evil.\"",
        "source": "T13n0397_023:0168b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝猶不能令現在心獲得解脫？",
        "translation": "Are you still unable to bring about the liberation of the present mind?",
        "source": "T13n0397_023:0168b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何而能調伏眾生？」",
        "translation": "How can they tame sentient beings?\"",
        "source": "T13n0397_023:0168b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明星答言：「我今受持四無礙智淨目持力故，能調伏一切眾生。」",
        "translation": "The star replied, \"Now, I'm able to tame all sentient beings because I'm endowed with the pure eye-holding power of the four unhindered knowledges.\"",
        "source": "T13n0397_023:0168b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨德言：「四無礙智淨目持者，亦復不能調伏眾生。",
        "translation": "Jingde said, \"The four unhindered cognitions and the clear eye hold are also incapable of disciplining sentient beings.",
        "source": "T13n0397_023:0168b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故！",
        "translation": "Why is that?",
        "source": "T13n0397_023:0168b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無覺觀故，云何而言能調眾生？」",
        "translation": "Without perception and contemplation, how can we say that we can tame sentient beings?\"",
        "source": "T13n0397_023:0168b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今問汝，隨意見答。",
        "translation": "Now, I'll ask you, and you can answer as you see fit.",
        "source": "T13n0397_023:0168b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0168b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝入繫縛解脫清淨道及寂靜，雖復平等亦不平等。",
        "translation": "\"Although it's equal, it's also not equal when it comes to gathering in the pure path of liberation from fetters and tranquility.",
        "source": "T13n0397_023:0168b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是平等及不平等，何因緣生？",
        "translation": "What causes and conditions give rise to such equality and inequality?",
        "source": "T13n0397_023:0168b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣出？",
        "translation": "What are the causes and conditions for escape?",
        "source": "T13n0397_023:0168c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣增長？",
        "translation": "What are the causes and conditions for growth?",
        "source": "T13n0397_023:0168c01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝寧不知乎？」",
        "translation": "How could you not know?\"",
        "source": "T13n0397_023:0168c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨德答言：「善男子！",
        "translation": "Jingde replied, \"Good man!",
        "source": "T13n0397_023:0168c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等事，因我我所生出增長。」",
        "translation": "Such things as these are produced by the growth of I and mine.\"",
        "source": "T13n0397_023:0168c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明星菩薩言：「善男子！",
        "translation": "The star bodhisattva said, \"Good man!",
        "source": "T13n0397_023:0168c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我我所何因緣生？」",
        "translation": "What are the causes and conditions for the birth of this self and mine?\"",
        "source": "T13n0397_023:0168c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我我所風因緣生。」",
        "translation": "It's the cause and condition of the wind in me and mine.\"",
        "source": "T13n0397_023:0168c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明星菩薩言：「風住何處？」",
        "translation": "The star bodhisattva said, \"Where does the wind stand?\"",
        "source": "T13n0397_023:0168c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0397_023:0168c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風住虛空。」",
        "translation": "The wind dwells in space.\"",
        "source": "T13n0397_023:0168c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「虛空為何所住？」",
        "translation": "Again, he asked, \"Where does space reside?\"",
        "source": "T13n0397_023:0168c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「虛空住於至處。」",
        "translation": "He answered, \"Space abides in the ultimate place.\"",
        "source": "T13n0397_023:0168c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「至處復何所住？」",
        "translation": "Again, he asked, \"Where does the ultimate place abide?\"",
        "source": "T13n0397_023:0168c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「至處何處住者不可宣說。",
        "translation": "He replied, \"Up to where he's staying cannot be explained.",
        "source": "T13n0397_023:0168c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T13n0397_023:0168c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離一切諸處所故，一切處所所不攝故，非數非稱不可量故。",
        "translation": "It's because he's removed from all premises, because he doesn't include all premises, and because he's not numbered or known, and he can't be measured.",
        "source": "T13n0397_023:0168c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非覺非觀，非有非無，非行非生，非出非滅，非有增長，非字非念，非作非受，非闇非明，非增非減，非壯非老，真實之性是一切法無罣礙門，是故至處無有住處。」",
        "translation": "Not perceived or observed, not existent or nonexistent, not practiced or produced, not emanating or ceasing, not growing or existing, not worded or thought, not made or felt, not dark or wise, not increasing or decreasing, and not robust or old, their true nature is the unobstructed gate to all things, and therefore the ultimate place has no abode.\"",
        "source": "T13n0397_023:0168c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明星菩薩言：「善男子！",
        "translation": "The star bodhisattva said, \"Good sons!",
        "source": "T13n0397_023:0168c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是即是四無礙智淨目陀羅尼。",
        "translation": "Thus, this is the dhāraṇī of the pure eye of the four unhindered cognitions.",
        "source": "T13n0397_023:0168c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩修集如是陀羅尼者，一切煩惱則為爛敗，入法緣慈，一切法中無有疑心。」",
        "translation": "If a bodhisattva cultivates such a dhāraṇī, all afflictions will be rotten, and he'll enter into compassion with respect to the Dharma and have no doubts in all things.\"",
        "source": "T13n0397_023:0168c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是法時十方世界無量眾生得法緣慈，無量眾生得近四無礙智淨目陀羅尼。",
        "translation": "When this teaching was given, measureless sentient beings in the world in the ten directions attained compassion in relation to the Dharma, and measureless sentient beings attained the dhāraṇī of the pure eyes that are close to the four unhindered cognitions.",
        "source": "T13n0397_023:0168c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚是二人：「善哉，善哉！",
        "translation": "At that point, the Bhagavān praised these two people, \"Good, good!",
        "source": "T13n0397_023:0168c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_023:0168c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能如法問，能如法答，是陀羅尼因緣力故。",
        "translation": "Being able to ask questions and answer answers according to the teaching is the result of the power of the dhāraṇī's causes and conditions.",
        "source": "T13n0397_023:0168c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天王等！",
        "translation": "The four heavenly kings and so forth!",
        "source": "T13n0397_023:0168c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我滅後能守護法。」",
        "translation": "After I cease, I'll be able to safeguard the Dharma.\"",
        "source": "T13n0397_023:0168c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經卷第二十三",
        "translation": "Dafangdengdaji jing, vol. 23",
        "source": "T13n0397_023:0168c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『戰阿羅呵(一)　修利蛇比摩(二)　其羅貶(三)　佛已牟邏(四)　若蛇牟邏(五)　阿呵希(六)　婆呵囉希(七)　若蛇呵希(八)　薩婆復多呵希(九)　梨咃婆呵休(十)　摩沙車婆牟梨(十一)　迦[(口*皮)/女]浮(十二)　邏奢浮(十三)　修邏蛇牟(十四)　呿迦那(十五)　摩希叉婆(十六)　迦婆摩呵(十七)　阿叉比婆邏(十八)　多波比婆(十九)　沙持因持利蛇鞞婆(二十)　阿闍牟他婆(二十一)　婆盧婆叉(二十二)　槃陀哆(二十三)　遮羅叉婆希(二十四)　呵迦比牟(二十五)　哆比勒搜(二十六)　散遮勒搜(二十七)　嘙嘙浮(二十八)　婆羅婆叉搜(二十九)　佛已遮(三十)　哆紗賴沙(三十一)　陀叉邏娑(三十二)　波利波遮(三十三)　修邏修(三十四)　搜婆娑彌(三十五)　希邏(三十六)　嘙羅牟娑羅娑(三十七)　牟娑邏私(三十八)　羅婆邏婆(三十九)　頻婆思邏娑(四十)　嘙嘙邏娑(四十一)　陀摩盧遮那邏娑(四十二)　富囊挫蘭呵邏婆(四十三)　首陀盧遮那邏娑(四十四)　嘙摩摩邏娑(四十五)　比摩盧遮那呿伽(四十六)　薩顛摩邏娑(四十七)　阿利那遮那褥褥(四十八)　比摩牟(四十九)　婆遮呵芒嘙呵邏私葂葂(五十)　阿由比目醯(五十一)　牟尼邏提致沙(五十二)　娑呵(五十三)』」",
        "translation": "「『戰阿羅呵(一)　修利蛇比摩(二)　其羅貶(三)　佛已牟邏(四)　若蛇牟邏(五)　阿呵希(六)　婆呵囉希(七)　若蛇呵希(八)　薩婆復多呵希(九)　梨咃婆呵休(十)　摩沙車婆牟梨(十一)　迦[(口*皮)/女]浮(十二)　邏奢浮(十三)　修邏蛇牟(十四)　呿迦那(十五)　摩希叉婆(十六)　迦婆摩呵(十七)　阿叉比婆邏(十八)　多波比婆(十九)　沙持因持利蛇鞞婆(二十)　阿闍牟他婆(二十一)　婆盧婆叉(二十二)　槃陀哆(二十三)　遮羅叉婆希(二十四)　呵迦比牟(二十五)　哆比勒搜(二十六)　散遮勒搜(二十七)　嘙嘙浮(二十八)　婆羅婆叉搜(二十九)　佛已遮(三十)　哆紗賴沙(三十一)　陀叉邏娑(三十二)　波利波遮(三十三)　修邏修(三十四)　搜婆娑彌(三十五)　希邏(三十六)　嘙羅牟娑羅娑(三十七)　牟娑邏私(三十八)　羅婆邏婆(三十九)　頻婆思邏娑(四十)　嘙嘙邏娑(四十一)　陀摩盧遮那邏娑(四十二)　富囊挫蘭呵邏婆(四十三)　首陀盧遮那邏娑(四十四)　嘙摩摩邏娑(四十五)　比摩盧遮那呿伽(四十六)　薩顛摩邏娑(四十七)　阿利那遮那褥褥(四十八)　比摩牟(四十九)　婆遮呵芒嘙呵邏私葂葂(五十)　阿由比目醯(五十一)　牟尼邏提致沙(五十二)　娑呵(五十三)』」",
        "source": "T13n0397_023:0168c23_0",
        "is_bad_quality": true
    }
]