[
    {
        "source_sentence": "大方等大集經賢護分卷第一",
        "translation": "Dafangdengdaji jing xianhu fen, roll 1",
        "source": "T13n0416_001:0872a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T13n0416_001:0872a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟品第一",
        "translation": "Most Eminent in the Chapter on Contemplation",
        "source": "T13n0416_001:0872a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在王舍城迦蘭陀竹園精舍，與大比丘眾五百人俱，皆是阿羅漢——諸漏已盡，無復煩惱，咸得自在；心善解脫、慧善解脫，調伏一切猶如大龍；所作已辦、眾行具備，棄捨重擔不受後生；行於平等獲真己利，安住正教得到彼岸——唯除長老阿難一人。",
        "translation": "Thus I have heard: One time, the Buddha was staying at the Kalandaka's Bamboo Park monastery in Rājagṛha with a large assembly of 500 monks, all of whom were arhats-arhats whose contaminants had ended, who had no more afflictions, and who had attained freedom; whose minds were well liberated, whose wisdom was well liberated, who disciplined all things like a great dragon; whose works had been accomplished, whose practices were complete, whose heavy burdens had been discarded, and who were not subject to later birth; whose practice was equal to obtain true self-benefit, and whose abiding in the correct teaching had brought them to the other shore-except for one, the elder Ānanda.",
        "source": "T13n0416_001:0872a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有五百諸比丘，於晨朝時各從住處詣世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, another five hundred monks each went from their residence to the Bhagavān in the morning, put their palms together in respect, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，尊者舍利弗、尊者大目連在舍衛城夏安居已，亦與五百諸比丘俱，次第遊行城邑聚落至王舍城，入迦蘭陀竹園精舍詣世尊所。",
        "translation": "At the time, Venerable Śāriputra and Venerable Mahāmaudgalyāyana had finished their summer retreat in Śrāvastī and had also joined 500 other monks who had marched one by one from their towns and villages to Rājagṛha and entered the Kalandaka's Bamboo Park Monastery to go to the Bhagavān.",
        "source": "T13n0416_001:0872a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已，恭敬頂禮佛足，退坐一面。",
        "translation": "When they arrived, they paid homage to the Buddha's feet and withdrew to sit at one side.",
        "source": "T13n0416_001:0872a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以神通力放大威光，令彼諸國城邑聚落一切所有諸比丘眾咸各來詣王舍大城，入迦蘭陀竹園精舍至世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, the Bhagavān used his supernormal powers to magnify his awe-inspiring light, causing all the monks in the cities and towns of those countries to come to the great city of Rājagṛha, enter the Kalandaka Bamboo Park monastery, go to the Bhagavān, put their palms together in respect, bow at the Buddha's feet, and withdraw to sit at one side.",
        "source": "T13n0416_001:0872a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，迦蘭陀竹園精舍有百千數諸比丘等，承佛威光皆已雲集至世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, a hundred thousand monks from the Kalandaka Bamboo Grove monastery who had responded to the Buddha's authoritative glow gathered at the Bhagavān's residence, put their palms together in reverence, saluted the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有彼摩訶波闍波提比丘尼——亦承世尊威神力故——亦與二萬比丘尼俱，悉皆大集，入迦蘭陀竹園精舍詣世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, another monk named Mahāprajāpatī, also endowed with the authority and power of the Bhagavān, along with 20,000 other monks and nuns, all gathered in great numbers, entered the Kalandaka Bamboo Grove Monastery, went to the Bhagavān, joined their palms in respect, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王舍大城有優婆塞名曰賢護，為眾上首，亦與五百優婆塞俱——受持五戒、具足威儀，是大菩薩，久已住於阿耨多羅三藐三菩提行；本願力故，常隨世尊、樂聞正法；恒懃精進，為滿一切助道法故——於朝旦時，承佛威神，從本住處入迦蘭陀竹園精舍至世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, there was an Upāsaka in the great city of Rājagṛha named Bhadrapāla, who was the head of the group, and he was joined by 500 Upāsakas - a great bodhisattva who had long abided in the practice of unsurpassed, perfected, and dignified morality, who had always followed the Bhagavān and enjoyed hearing the right teaching because of the power of his former vows, who was constantly striving and diligent in order to fulfill all the factors that aid in the path - and who, in response to the Buddha's authoritative power, entered the Kalandaka's Bamboo Park Monastery at sunrise and went to the Bhagavān, joined their palms in reverence, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘耶離大城有一離車子名曰寶生，為眾上首，亦與二萬八千諸離車俱，於晨朝時，承佛神力，皆自彼城發，來入此迦蘭陀園至如來所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, there was a charioteer named Baosheng in the large city of Vaiśālī who was the head of the crowd and was accompanied by 28,000 other charioteers. During the morning sunrise, because of the Buddha's authoritative power, they all left that city, entered Kalandaka Park, went to the Tathāgata's residence, joined their palms in respect, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，瞻婆城有一長者子名曰星藏，為眾上首，亦與二萬八千長者子俱，於晨朝時，承佛神力，自瞻婆城發，來入此迦蘭陀園至世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, there was an elder son of Campā named Xingzang who was the head of the group, and he and 28,000 other elder sons who, by the Buddha's spiritual power, had arisen in Campā during the morning morning commemoration, gone from Campā, entered Kalandaka Park, gone to the Bhagavān, put their palms together in respect, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有一摩那婆(隋言淨持，亦云少年，亦云仁童子等)名那羅達多，為眾上首，亦與二萬八千人俱，於晨朝時自本住處發，來入此迦蘭陀園詣世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, another man named Naradatta (the Sui word for purifier, also called a youth, and also called a renunciant boy), the head of the group, along with 28,000 other people, started off from his previous residence during the morning morning commemoration, went into this Kalandaka Park and visited the Bhagavān, put his palms together in respect, bowed his head at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍衛國復有長者名大善商主并彼給孤獨長者，為眾上首，亦與二萬八千人俱，自彼舍衛國詣王舍城入迦蘭陀園至世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, another elder from Śrāvastī named the Great Good Merchant and that orphaned elder who was the head of the group, along with 28,000 others, traveled from Śrāvastī to the city of Rājagṛha, entered the Kalandaka Park, went to the Bhagavān, put their palms together in respect, saluted the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王舍大城復有長者名曰水天，為最上首，亦與二萬八千人俱，從本住處發，來入此迦蘭陀園詣世尊所，恭敬合掌，頂禮佛足，退坐一面。",
        "translation": "At the time, another elder named Varuṇa, the foremost of the elders from the great city of Rājagṛha, along with 28,000 others, had come from their previous abode, entered Kalandaka Park, went to the Bhagavān, joined their palms in respect, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，摩伽陀國主韋提希子、阿闍世王，亦與百千諸眷屬俱，於晨朝時亦來入此迦蘭陀園詣世尊所，頂禮佛足，退坐一面。",
        "translation": "At the time, Vaidehīputra, the lord of Magadha, King Ajātaśatru, along with a hundred thousand of his retinue, also entered Kalandaka Park at dawn and went to the Bhagavān, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有四大天王及天帝釋，乃至欲界一切天眾，各與無量百千億那由他眷屬天眾俱，亦於晨朝悉來入迦蘭陀園至如來所，頂禮佛足，退坐一面。",
        "translation": "At the time, the four great celestial kings, Indra, and all the gods of the desire realm, each with an incalculable 100,000,000,000 nayutas of retinue, also entered Kalandaka Park in the morning and went to the Tathāgata's abode, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有娑婆世界主大梵天王，亦與無量百千億那由他眷屬天眾俱，於晨朝時悉入迦蘭陀園至如來所，頂禮佛足，退坐一面。",
        "translation": "At the time, another great brahma king, lord of the sahā world, along with a multitude of 100,000,000,000,000 nayutas who were members of the heavenly family, also entered Kalandaka Park in the morning and went to the Tathāgata, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有大自在天王，亦與無量百千淨居諸天眾俱，於晨朝時悉入迦蘭陀園，頂禮佛足，退坐一面。",
        "translation": "At the time, another Mahêśvara god king accompanied by a multitude of hundreds of thousands of gods who lived in a pure abode all entered Kalandaka Park during the morning morning commemoration, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有四阿脩羅王，各與無量百千眷屬阿脩羅眾俱，亦於晨朝入迦蘭陀園詣如來所，頂禮佛足，退坐一面。",
        "translation": "At the time, there were four other Ashura kings, each with a multitude of hundreds of thousands of Ashura retinues, who also entered Kalandaka Park in the morning, went to the Tathāgata's residence, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有難陀龍王及跋難陀龍王，各與無量百千眷屬諸龍眾俱，亦於晨朝入迦蘭陀園詣如來所，頂禮佛足，退坐一面。",
        "translation": "It was then that Rājagṛha and Rājagṛha of Nandanavana, each with a multitude of hundreds of thousands of dependent nāgas, also entered Kalandaka's Park in the morning and went to the Tathāgata, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，復有娑伽羅龍王、阿那婆達多龍王，及摩那斯龍王、伊跋羅龍王等，各與無量百千眷屬諸龍眾俱，亦於晨朝入迦蘭陀園詣如來所，頂禮佛足，退坐一面。",
        "translation": "At the time, another Dragon-King Sāgara, Dragon-King Anavatapta, Dragon-King Manas, Dragon-King Ippala, and so forth, each with a multitude of hundreds of thousands of dependent dragons, also entered the Kālāndārāma Park in the morning and went to the Tathāgata, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此三千大千世界一切諸比丘、比丘尼、優婆塞、優婆夷，及以一切天、龍、夜叉、乾闥婆、阿脩羅、迦樓羅、緊那羅、摩睺羅伽，乃至人非人及諸王等信如來者，為聽法故，一切皆集迦蘭陀園詣如來所，頂禮佛足，各坐一面。",
        "translation": "At the time, all the monks, nuns, laymen, and laywomen of the 3,000 great one-thousand worlds, as well as all the gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans and nonhumans, and other kings who believed in the Tathāgata and listened to the teaching gathered at Kālānta's Park, bowed their heads at the Buddha's feet, and withdrew to sit at one side.",
        "source": "T13n0416_001:0872c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，迦蘭陀園其地弘廣如此，三千大千世界所有地方大眾充滿，無空缺處若杖頭許而不遍者。",
        "translation": "At the time, the grounds of Kālānta Park were so vast that there was no place in the 3,000 great thousand world that was not filled with people, even if there was a spot that could be filled with the heads of sticks.",
        "source": "T13n0416_001:0872c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，上至有頂、下逮梵宮，所有一切大威德神通諸天大眾，乃至一切諸龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，皆來集會。",
        "translation": "Thus, from the highest part of existence down to the Brahma palace, all the gods and goddesses of great authority and superknowledge, as well as all the dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and nonhumans came to assemble.",
        "source": "T13n0416_001:0872c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，賢護菩薩摩訶薩即從座起，偏袒右肩，右膝著地，合掌向佛白佛言：「世尊！",
        "translation": "At that point, the Bodhisattva Bhadrapāla Mahāsattva rose from his seat, bared his right shoulder, knelt on his right knee, put his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T13n0416_001:0873a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者欲得諮問如來、應供、等正覺心中所疑，不審世尊見垂聽不？」",
        "translation": "Now, I would like to ask the Tathāgata, Worthy of Offerings, and Completely Enlightened about the doubts in my mind, but don't you think the Bhagavān would see and hear me?\"",
        "source": "T13n0416_001:0873a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復告賢護菩薩言：「賢護！",
        "translation": "At that point, the Bhagavān again addressed Bhadrapāla, saying, \"Bhadrapāla!",
        "source": "T13n0416_001:0873a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、世尊隨汝所疑，恣汝所問，為汝宣釋，令汝歡喜。」",
        "translation": "The Tathāgata, the Bhagavān, follows your doubts and gives you permission to ask questions, explaining them for you and making you happy.\"",
        "source": "T13n0416_001:0873a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼賢護菩薩既蒙聽許，復白佛言：「世尊！",
        "translation": "Having heard and accepted this, that Bhadrapāla replied to the Buddha, \"Bhagavān!",
        "source": "T13n0416_001:0873a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩具足成就何等三昧而能得彼大功德聚？",
        "translation": "What kind of samādhi has the bodhisattva-mahāsattva fully achieved that makes it possible to attain that great stock of merit?",
        "source": "T13n0416_001:0873a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何得入多聞大海獲智慧藏，問無疑惑故？",
        "translation": "How can I enter the ocean of many learners and obtain the store of wisdom by asking, \"Are there no doubts?",
        "source": "T13n0416_001:0873a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何復得無意戒聚不失成就，於阿耨多羅三藐三菩提無退減故？",
        "translation": "\"How can it be that the group of mindless precepts is not lost and is not subject to retrogression from the unsurpassed, correct enlightenment?",
        "source": "T13n0416_001:0873a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復云何得不生愚癡，邪見空處故？",
        "translation": "\"Again, how can delusion not arise from a mistaken view of the abode of emptiness?",
        "source": "T13n0416_001:0873a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得宿命智，遍知去來故？",
        "translation": "\"How will knowledge of past lives be attained, given the pervasive knowledge of past and future?",
        "source": "T13n0416_001:0873a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不離奉見諸佛、世尊，聽聞正法乃至夢中故？",
        "translation": "How will it be possible not to part from seeing the buddhas and world-honored ones and hearing the right teaching even in a dream?",
        "source": "T13n0416_001:0873a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得殊特端正上妙色身、具足威儀，眾生樂見故？",
        "translation": "How will you attain a body of exceptional, correct, and excellent appearance, complete with dignity, that sentient beings will enjoy seeing?",
        "source": "T13n0416_001:0873a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得常生大姓之家、尊貴之位，見者恭敬故？",
        "translation": "How will it be possible to be permanently born into a great family or a position of honor, and for those who see it to respect you?",
        "source": "T13n0416_001:0873a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何復得父母、兄弟、宗親、眷屬及以知識左右圍遶，恒無別離故？",
        "translation": "How else can you be surrounded by parents, brothers, clansmen, retinues, and friends who are always without distinction?",
        "source": "T13n0416_001:0873a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得廣達博通，所為殊異亦終無缺減於阿耨多羅三藐三菩提心故？",
        "translation": "How will it be possible to fully understand and comprehend, and how will the differences between them never be diminished in the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T13n0416_001:0873a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得正念、正行，節度不移、心知足故？",
        "translation": "How will right mindfulness and right conduct be attained, so that moderation isn't shifted and the mind is satisfied?",
        "source": "T13n0416_001:0873a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得常生慚愧，遠離恥辱故？",
        "translation": "How will it be possible to always feel conscience and be free of shame?",
        "source": "T13n0416_001:0873a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得正智謙恭，降伏我慢故？",
        "translation": "\"How will right knowledge and humility be attained, which will subdue self-conceit?",
        "source": "T13n0416_001:0873a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得策懃精進，遠離懈怠故？",
        "translation": "How will you be able to exert yourself and avoid laziness?",
        "source": "T13n0416_001:0873a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得大慈、大悲、大喜、大捨，平等與樂故？",
        "translation": "How will great kindness, great compassion, great joy, and great equanimity be attained, based on equality and happiness?",
        "source": "T13n0416_001:0873a24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得聞說甚深真空、無相、無願法時，一切無有驚怖、退沒故？",
        "translation": "How is it that when one hears the teaching of the profound dharma of vacuum, signlessness, and wishlessness, there's no fear or retrogression?",
        "source": "T13n0416_001:0873a25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不樂懶惰，攝受正法故？",
        "translation": "How will it be possible to not enjoy laziness and to take in the right teaching?",
        "source": "T13n0416_001:0873a27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得智慧通達，明了一切無與等者故？",
        "translation": "How will it be possible to comprehend wisdom and understand that there is nothing like it?",
        "source": "T13n0416_001:0873a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得於一切佛剎隨意得生故？",
        "translation": "\"How will it be possible to be born at will in all the buddha-bodies?",
        "source": "T13n0416_001:0873a29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不為一切外道所摧壞故？",
        "translation": "How will it be possible for them not to be destroyed by all non-Buddhists?",
        "source": "T13n0416_001:0873a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如海，能受納眾問疑、釋難，無減、無盡故？",
        "translation": "How will it be like an ocean that's able to accept a multitude of questions and resolve difficulties without decrease or exhaustion?",
        "source": "T13n0416_001:0873a30_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如月滿白淨，法具足故？",
        "translation": "How will it be like the moon being full and white and pure, when the Dharma is complete?",
        "source": "T13n0416_001:0873b01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如日初出，破諸闇冥故？",
        "translation": "How will it be like the first appearance of the sun, which breaks through the darkness?",
        "source": "T13n0416_001:0873b02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如燈炬，光明照了故？",
        "translation": "\"How will it be like a torch, so that its light shines through?",
        "source": "T13n0416_001:0873b03_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如虛空性，無有罣礙故？",
        "translation": "\"How will it be like the nature of space, because there are no obstructions?",
        "source": "T13n0416_001:0873b04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無所住著，心如虛空故？",
        "translation": "How will it be possible to have no abiding attachment, since the mind is like space?",
        "source": "T13n0416_001:0873b04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如金剛穿徹，通達一切法故？",
        "translation": "How will you attain penetration like the adamantine penetration and penetrate all dharmas?",
        "source": "T13n0416_001:0873b05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如須彌山，不可動搖故？",
        "translation": "\"How will it be like Mount Sumeru, which cannot be shaken?",
        "source": "T13n0416_001:0873b06_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如門閫，一切正住故？",
        "translation": "\"How will you attain the gate like insight, because everything is correctly abiding?",
        "source": "T13n0416_001:0873b07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如猫、狗、獸等，心業成就故？",
        "translation": "\"How will it be like a cat, dog, or animal, etc., when the mind's activity is accomplished?",
        "source": "T13n0416_001:0873b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無為，一切諸法中故？",
        "translation": "\"How will it be possible to be nothing, since it's in all dharmas?",
        "source": "T13n0416_001:0873b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如飛鳥，隨意而去故？",
        "translation": "\"How will it be possible to be like a bird that flies away at will?",
        "source": "T13n0416_001:0873b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得摧折憍慢，如旃陀羅子故？",
        "translation": "How will it be possible to destroy pride, like the son of Candra?",
        "source": "T13n0416_001:0873b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得住阿蘭若，如諸獸、獼猴等不樂城邑聚落，一切出家、在家不相參亂故？",
        "translation": "\"How will it be possible to live in a forest, like animals and monkeys that don't enjoy cities and towns, so that all the religious and lay people aren't mixed up?",
        "source": "T13n0416_001:0873b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得統領大眾，教詔導示故？",
        "translation": "How will it be possible to lead the masses and instruct and guide them?",
        "source": "T13n0416_001:0873b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不樂生一切眾生中，不動於一切眾生故？",
        "translation": "How will it be possible not to delight in being born among all sentient beings and not to be moved by all sentient beings?",
        "source": "T13n0416_001:0873b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不為一切外道，降伏天魔惑亂故？",
        "translation": "How will it be possible not to subdue the afflictions of Māra for all the non-Buddhists?",
        "source": "T13n0416_001:0873b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得大辯才，於一切法決了知故？",
        "translation": "\"How will great eloquence be attained, so that you can know all dharmas with certainty?",
        "source": "T13n0416_001:0873b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得於一切佛法，不隨他行故？",
        "translation": "\"How will it be possible to practice all the Buddha's teachings without following others?",
        "source": "T13n0416_001:0873b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得大堅固信，無可毀壞故？",
        "translation": "How will great, resolute faith be attained that is not destructible?",
        "source": "T13n0416_001:0873b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得大慈力，信不可動故？",
        "translation": "\"How will the power of great compassion be obtained, because faith is unshakeable?",
        "source": "T13n0416_001:0873b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得深入信，無所行故？",
        "translation": "How will deep faith be attained, because there's nothing to do?",
        "source": "T13n0416_001:0873b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得潤澤信，於一切法中多歡喜故？",
        "translation": "\"How will you attain nurturing faith, which makes you rejoice in all dharmas?",
        "source": "T13n0416_001:0873b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得最勝信，供養承事一切諸佛無厭足故？",
        "translation": "\"How will you attain the highest level of faith, so that you can make offerings to and serve all buddhas without tire?",
        "source": "T13n0416_001:0873b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得種種入信，種諸善根故？",
        "translation": "How will various kinds of entry into faith be attained, based on the planting of good roots?",
        "source": "T13n0416_001:0873b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得真妙信，增長無虛偽行故？",
        "translation": "\"How will true and marvelous faith be attained, so that the practice of falsity will not increase?",
        "source": "T13n0416_001:0873b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得淨喜信，除滅一切嫉妬故？",
        "translation": "\"How will pure joyful faith be attained, which removes all jealousy?",
        "source": "T13n0416_001:0873b23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得清淨信，得一切種智光明故？",
        "translation": "\"How will pure faith be attained and the light of omniscience attained?",
        "source": "T13n0416_001:0873b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得喜樂行信，除滅諸蓋、障惡故？",
        "translation": "How can joyful practice and faith be attained, which removes obscurations and hindrances to evil?",
        "source": "T13n0416_001:0873b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得智喜信，攝受諸佛境界故？",
        "translation": "\"How will you attain the joyful faith of knowing and taking in the objects of the buddhas?",
        "source": "T13n0416_001:0873b25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得莊嚴行信，勝一切世間瓔珞莊嚴佛國清淨成就故？",
        "translation": "\"How will you attain the faith of adorned practice, which is superior to all worldly jewels that adorn the pure accomplishment of the Buddha's kingdom?",
        "source": "T13n0416_001:0873b26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得清淨戒行，永滅一切聲聞、辟支佛心故？",
        "translation": "How will the practice of pure precepts be attained, so that it will permanently extinguish the minds of all śrāvakas and pratyekabuddhas?",
        "source": "T13n0416_001:0873b28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得莊嚴大誓，一切所作皆究竟故？",
        "translation": "\"How will you attain the great vow of adornment, so that everything you do will be accomplished?",
        "source": "T13n0416_001:0873b29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得為一切眾生中上首，欲行諸善法故？",
        "translation": "\"How will it be possible to be the best of all sentient beings and want to practice good qualities?",
        "source": "T13n0416_001:0873c01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無有疲倦，為欲教授一切菩薩所學諸波羅蜜故？",
        "translation": "\"How will it be possible to have no weariness in order to teach all the perfections that bodhisattvas have trained?",
        "source": "T13n0416_001:0873c02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不退轉，多求一切佛法故？",
        "translation": "How will it be possible to not turn back and to repeatedly seek all the Buddha's teachings?",
        "source": "T13n0416_001:0873c03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不可壞，不為一切外道邪師所破故？",
        "translation": "How will it become indestructible and not be refuted by the mistaken teachers of all non-Buddhist paths?",
        "source": "T13n0416_001:0873c04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得深信一切諸佛，不捨此念常見諸佛故？",
        "translation": "\"How will it be possible to have deep faith in all the buddhas and not abandon this mindfulness so that we can see them all?",
        "source": "T13n0416_001:0873c05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如父想，紹隆一切佛法故？",
        "translation": "How can you think like a father and promote all the Buddha's teachings?",
        "source": "T13n0416_001:0873c06_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得佛力加持，於一切佛法光明中生故？",
        "translation": "How will it be possible to obtain the Buddha's power and blessing and have it arise in the light of all the Buddha's teachings?",
        "source": "T13n0416_001:0873c07_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無障礙，一切佛法悉現在前故？",
        "translation": "How will it be possible to have no obstructions and have all the Buddha's teachings fully present in front of you?",
        "source": "T13n0416_001:0873c08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如幻人，於一切法無思念故？",
        "translation": "How will it be possible to be like an illusory person who has no thoughts about all dharmas?",
        "source": "T13n0416_001:0873c09_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如化者，觀一切法無生、滅故？",
        "translation": "\"How will those who are thus transformed observe that all dharmas are without arising or ceasing?",
        "source": "T13n0416_001:0873c10_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如夢，觀察三世無來、去故？",
        "translation": "How will it be possible to observe the three times as dreams, since there is no coming or going?",
        "source": "T13n0416_001:0873c11_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如鏡像，一切世界斯現身中故？",
        "translation": "How will it be like a mirror image, where all the worlds are present in the body?",
        "source": "T13n0416_001:0873c12_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如響聲，一切法無作、無為，因緣生故？",
        "translation": "\"How will it sound like a resonant sound, when all things are uncreated and unmanifest and arise from causes and conditions?",
        "source": "T13n0416_001:0873c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如形影，於一切生法自無心取捨故？",
        "translation": "\"How will it be possible to be like a shape and a shadow, since one has no mind to take or reject all the things that arise?",
        "source": "T13n0416_001:0873c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得空無所有，遠離一切諸物想故？",
        "translation": "\"How will you attain emptiness and nothingness and become free of all conceptions of things?",
        "source": "T13n0416_001:0873c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無相，觀一切法無有二故？",
        "translation": "How will it be possible to observe that all dharmas are without duality because they are without marks?",
        "source": "T13n0416_001:0873c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得法界邊際，菩提心無限量故？",
        "translation": "How will the limit of the Dharma realm be reached, since the mind of enlightenment has no limit?",
        "source": "T13n0416_001:0873c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不起著，一切世界性無分別故？",
        "translation": "\"How will it be possible not to become attached, since the nature of all the worlds is without discrimination?",
        "source": "T13n0416_001:0873c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無礙行，遍遊一切諸佛剎中故？",
        "translation": "\"How will you attain unobstructed mobility and travel throughout all the buddha-bhūmis?",
        "source": "T13n0416_001:0873c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得諸陀羅尼，聞一知萬，善達一切文字分別說故？",
        "translation": "How will you attain the dhāraṇīs, hearing one and knowing ten thousand, and skillfully comprehending all words and discourses?",
        "source": "T13n0416_001:0873c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如諸法師，善知一切佛法故？",
        "translation": "\"How will you attain good knowledge of all the Buddha's teachings, just like all Dharma masters?",
        "source": "T13n0416_001:0873c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切諸佛所護念，一切佛威力加持故？",
        "translation": "\"How will you obtain the protection and mindfulness of all the buddhas and the authoritative support of all of them?",
        "source": "T13n0416_001:0873c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得雄猛不怯弱，出聲如大牛王及大師子王步故？",
        "translation": "How will it be possible to be vigorous and not fainthearted, producing a sound like a great bull king or a great man king in step?",
        "source": "T13n0416_001:0873c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無畏，令一切世間歡喜故？",
        "translation": "\"How will fearlessness be attained, so that all the world will be delighted?",
        "source": "T13n0416_001:0873c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無疑惑，於一切佛平等無二故？",
        "translation": "\"How will it be possible to have no doubt that all buddhas are equal and not two?",
        "source": "T13n0416_001:0873c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得通達如如滅除疑惑，不著諸法故？",
        "translation": "How will it be possible to comprehend thus and so eliminate doubt and confusion and not be attached to dharmas?",
        "source": "T13n0416_001:0873c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得證深法界，善能解釋所問義故？",
        "translation": "\"How will you realize the profound Dharma realm and be able to skillfully explain the meaning of the questions?",
        "source": "T13n0416_001:0873c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得師利益他，具足大慈故？",
        "translation": "How will the teacher attain the benefit of others, given the fulfillment of great compassion?",
        "source": "T13n0416_001:0873c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得滅除懶惰，恒樂說法故？",
        "translation": "How will it be possible to eliminate laziness and explain the teaching with constant joy?",
        "source": "T13n0416_001:0873c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如法住，不捨一切眾生故？",
        "translation": "\"How will you attain abiding in the Dharma as it is and not abandon all sentient beings?",
        "source": "T13n0416_001:0873c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不諂曲，性淳直故？",
        "translation": "How can it be obtained because it's not flattering and its nature is straightforward?",
        "source": "T13n0416_001:0874a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如眼目，為一切世間燈明故？",
        "translation": "\"How will you attain the eye-like vision that serves as a lamp for all the world?",
        "source": "T13n0416_001:0874a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不可輕蔑，勝出一切三界故？",
        "translation": "How will it become something to be despised, something that transcends all three realms?",
        "source": "T13n0416_001:0874a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無諍論，如教說行故？",
        "translation": "How will it be possible to have no debate and to practice as instructed?",
        "source": "T13n0416_001:0874a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無艱難，行無住著故？",
        "translation": "\"How will it be possible to have no difficulty and practice without abiding attachment?",
        "source": "T13n0416_001:0874a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得知於實際，不分別諸法故？",
        "translation": "\"How should you know the reality and not discriminate among dharmas?",
        "source": "T13n0416_001:0874a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得說一切語言智，令諸眾生住於大乘故？",
        "translation": "How will it be possible to speak the wisdom of all languages so that sentient beings will abide in the great vehicle?",
        "source": "T13n0416_001:0874a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得至無畏處，遠離恐怖，永無一切毛竪等事故？",
        "translation": "How will you attain the state of fearlessness, be free of terror, and never have any hair standing on end?",
        "source": "T13n0416_001:0874a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得知佛方便說，善達一切修多羅等故？",
        "translation": "\"How should you know the Buddha's teaching of skillful means, because he well understands all the sūtra and so forth?",
        "source": "T13n0416_001:0874a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不空生世間，恒入一切眾中獲利故？",
        "translation": "How will it be possible to be born in the world without being empty and to constantly enter all of them to obtain benefit?",
        "source": "T13n0416_001:0874a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得為一切智首，於一切世間應受供養大名聞故？",
        "translation": "\"How will he attain the status of head of omniscience, which is based on great renown and learning that should be offered in all worlds?",
        "source": "T13n0416_001:0874a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得無邊讚歎功德，為一切眾生福田故？",
        "translation": "How will limitless praiseworthy merit be attained for the benefit of all sentient beings?",
        "source": "T13n0416_001:0874a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得大歡喜踊躍無量，常在諸如來師子座下故？",
        "translation": "\"How will you attain great joyful exuberance and measurelessness while remaining under the lion's seat of the Tathāgatas?",
        "source": "T13n0416_001:0874a12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得勝上辯才，能問一切佛法故？",
        "translation": "How will you attain superior eloquence, so that you can ask about all the Buddha's teachings?",
        "source": "T13n0416_001:0874a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得意不怯弱辯才，於一切大眾中無怖畏故？",
        "translation": "\"How will you attain the eloquence of a mind that's not fainthearted and has no fear in all the people?",
        "source": "T13n0416_001:0874a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切論議辯如師子王，降伏一切外道、攝受諸異論師故？",
        "translation": "How will it be possible to speak eloquently in all discussions like a lion king who subdues all the non-Buddhists and admits scholars who differ in their theories?",
        "source": "T13n0416_001:0874a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不壞本誓莊嚴，欲摧一切邪異朋黨故？",
        "translation": "How will it be possible to preserve the adornment of the original vow and destroy all those who hold to it differently?",
        "source": "T13n0416_001:0874a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得善巧說法、常處師子座，一切諸佛印可故？",
        "translation": "How will you attain skillful discourse and remain in the lion's seat, which will be endorsed by all the buddhas?",
        "source": "T13n0416_001:0874a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得遠離一切世間無義語言，以通達一切正教故？",
        "translation": "How will it be possible to be free of all worldly, pointless speech in order to understand all the correct teachings?",
        "source": "T13n0416_001:0874a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得深愛一切諸佛法，於諸如來生處行故？",
        "translation": "\"How can one deeply love all the buddha-dharmas and practice in the birthplace of all tathāgatas?",
        "source": "T13n0416_001:0874a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得樂欲真法，知諸如來不生故？",
        "translation": "\"How will one attain the true dharma of delighting in desires and knowing that the tathāgatas are unarisen?",
        "source": "T13n0416_001:0874a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不懈慢，善承事知識故？",
        "translation": "How will it be possible to not be lazy or conceited and to serve a good teacher?",
        "source": "T13n0416_001:0874a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不染著，遊行一切世界故？",
        "translation": "How can one attain freedom from defiled attachment and travel through all the worlds?",
        "source": "T13n0416_001:0874a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得願行具足，為教化一切眾生故？",
        "translation": "\"How will the fulfillment of vows and practices be attained for the purpose of teaching and transforming all sentient beings?",
        "source": "T13n0416_001:0874a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如珊瑚，得諸相故？",
        "translation": "How will it be like coral, because of the various characteristics obtained?",
        "source": "T13n0416_001:0874a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如虛空，一切法無得相故？",
        "translation": "\"How will it be like space, because all things lack attainable characteristics?",
        "source": "T13n0416_001:0874a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得如菩薩，不斷佛種故？",
        "translation": "How will it be possible to be like a bodhisattva and not stop at the buddha-seed?",
        "source": "T13n0416_001:0874a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得不休息行，諸菩薩道未曾遠離大乘故？",
        "translation": "\"How will it be possible to practice without rest, since the bodhisattva path has never been free of the great vehicle?",
        "source": "T13n0416_001:0874a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得著大鎧甲，諸佛廣大戒中決定住故？",
        "translation": "How will it be possible to wear great armor, given the certainty of abiding in the vast precepts of the buddhas?",
        "source": "T13n0416_001:0874a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切諸佛所讚、灌頂，住於諸如來十力地中故？",
        "translation": "\"How will you attain the praise and consecration of all the buddhas and abide in the ten stages of power of the tathāgatas?",
        "source": "T13n0416_001:0874a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切所想，通達一切諸法行故？",
        "translation": "How will it be possible to conceptualize and comprehend all things and to practice all dharmas?",
        "source": "T13n0416_001:0874b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切算數，巧方便知故？",
        "translation": "How can all calculations be skillfully and conveniently known?",
        "source": "T13n0416_001:0874b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得善知一切成壞，遠離一切障礙行故？",
        "translation": "How will it be possible to well understand all formation and decay and to avoid all obstructive behavior?",
        "source": "T13n0416_001:0874b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切不住行，不取、不捨故？",
        "translation": "\"How will it be possible to practice everything without stopping, without grasping and without abandoning?",
        "source": "T13n0416_001:0874b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切大施主，能施無悔故？",
        "translation": "\"How will it be possible for all great givers to give without regret?",
        "source": "T13n0416_001:0874b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得入諸法海，能施勝上法寶藏故？",
        "translation": "\"How will it be possible to enter the ocean of all dharmas and be able to bestow a treasure house of superior dharmas?",
        "source": "T13n0416_001:0874b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一切世間行，能捨世間諸相故？",
        "translation": "\"How will all worldly practices be attained, so that they can be free of worldly appearances?",
        "source": "T13n0416_001:0874b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得廣大神通，隨順諸佛神通滿足歡喜故？",
        "translation": "\"How will you attain vast supernormal powers and rejoice in the fulfillment of the Buddha's supernormal abilities?",
        "source": "T13n0416_001:0874b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得一剎那時間行即能遍至一切諸佛前故？",
        "translation": "\"How will it be possible to practice in a single moment of time and immediately reach all the buddhas?",
        "source": "T13n0416_001:0874b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復云何當得住此佛剎遍見一切十方諸佛、聽聞正法、供養眾僧，非但未得出世六通、而實未得世間五通，而亦未捨此世界身、亦無生彼諸佛國土、唯住此土見餘世界諸佛、世尊，悉聞諸佛所宣正法、一切聽受如說修行？",
        "translation": "\"Furthermore, how could someone live in this buddha-stage and see all the buddhas of the ten directions, hear the right teaching, make offerings to the saṃgha, and not only have they not attained the six supramundane powers but really haven't attained the five supramundane powers, nor have they abandoned the body of this world or been born in one of the buddha-lands but only live in this world and see the buddhas and world-honored ones in the other worlds, hear the right teaching proclaimed by the buddhas, and listen to and accept everything as it's taught and cultivated?",
        "source": "T13n0416_001:0874b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T13n0416_001:0874b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如今時聖者阿難於世尊前親聞法已，皆悉受持、如說奉行；彼諸菩薩身居此土不至彼界而能遍覩諸佛、世尊，聽聞法已悉能受持、如說修行，亦復如是。",
        "translation": "For example, now, after the noble Ānanda personally heard the teaching from the Bhagavān, he fully accepted it, taught it, and approved of it; likewise, those bodhisattvas who live in this land and don't go to other realms but can universally see the buddhas and the Bhagavān and hear the teaching, they can all accept it and practice it as it's taught.",
        "source": "T13n0416_001:0874b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是已後，一切生處常不遠離諸佛、世尊，聽聞正法，乃至夢中咸若斯也。」",
        "translation": "From then on, all places of birth are always not separate from the buddhas and world-honored ones, and they hear the right teaching, even up to the point where it's like this in a dream.\"",
        "source": "T13n0416_001:0874b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告賢護菩薩摩訶薩言：「善哉，善哉。",
        "translation": "It was then that the Bhagavān addressed Bhagavān, the Bodhisattva Mahāsattva, saying, \"Good, good!",
        "source": "T13n0416_001:0874b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢護！",
        "translation": "Bhadrapāla!",
        "source": "T13n0416_001:0874b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今乃能請問如來如是妙義，汝為利益一切世間諸眾生故、亦為安樂諸眾生故、復為憐愍諸天人故、復為攝受未來世中諸菩薩故。",
        "translation": "Now, are you able to ask the Tathāgata such a wonderful question, for the sake of benefiting all sentient beings in the world, for the welfare of sentient beings, for the pity of gods and humans, and for the inclusion of bodhisattvas in future generations?",
        "source": "T13n0416_001:0874b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0874b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而汝往昔已曾供養無量諸佛、種諸善根、聽聞正法、受持正法、愛樂正法、敬重正法；汝今但以摩訶迦葉教化行故，少欲知足，恒樂閑靜阿蘭若處——或居塚間、或在樹下、亦露地坐，常坐不臥，一敷不移，受乞食法，一食不再，或一坐食、或唯一摶，唯畜三衣及糞掃衣，讚歎頭陀，勸請諸菩薩、教菩薩行法、令諸菩薩喜、訶責諸菩薩、教示諸菩薩、成就諸菩薩，能為利益行大慈悲，於諸眾生生平等心。",
        "translation": "而汝往昔已曾供養無量諸佛、種諸善根、聽聞正法、受持正法、愛樂正法、敬重正法；汝今但以摩訶迦葉教化行故，少欲知足，恒樂閑靜阿蘭若處——或居塚間、或在樹下、亦露地坐，常坐不臥，一敷不移，受乞食法，一食不再，或一坐食、或唯一摶，唯畜三衣及糞掃衣，讚歎頭陀，勸請諸菩薩、教菩薩行法、令諸菩薩喜、訶責諸菩薩、教示諸菩薩、成就諸菩薩，能為利益行大慈悲，於諸眾生生平等心。",
        "source": "T13n0416_001:0874b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸得自在到於彼岸，隨意得見一切諸佛，發廣大願、行深妙行，樂一切智菩提梁柱，善能隨順如來種性，發菩提心猶如金剛。",
        "translation": "They all attain freedom to reach the other shore, freely see all the buddhas as they wish, make vast vows, perform profound and subtle actions, enjoy the pillars of enlightenment with omniscience, skillfully follow the Tathāgata's seed nature, and generate the mind of enlightenment like adamant.",
        "source": "T13n0416_001:0874c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通達世間眾生所念，廣大妙行不可校算、不可稱量，常在一切諸佛目前。",
        "translation": "He penetrates the thoughts of worldly beings, has vast and marvelous practices that are incalculable and immeasurable, and is always present in the presence of all the buddhas.",
        "source": "T13n0416_001:0874c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢護！",
        "translation": "Bhadrapāla!",
        "source": "T13n0416_001:0874c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝功德中未說少分也。",
        "translation": "You haven't explained even a small part of your virtue.",
        "source": "T13n0416_001:0874c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0874c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今有菩薩三昧名曰思惟諸佛現前三昧。",
        "translation": "\"Now, there's a bodhisattva concentration called contemplating the buddhas' present samādhi.",
        "source": "T13n0416_001:0874c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩具足修習如是三昧，當得成就如上所問諸功德等。",
        "translation": "If a bodhisattva fully cultivates such a concentration, he'll attain the qualities and so forth that were asked above.",
        "source": "T13n0416_001:0874c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢護當知，更有無量無邊勝上功德，說不可盡。」",
        "translation": "Bhadrapāla, you should know that there are measureless and limitless superior qualities that cannot be explained.\"",
        "source": "T13n0416_001:0874c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，賢護菩薩復白佛言：「善哉，世尊！",
        "translation": "It was then that the Bodhisattva Bhadrapāla again said to the Buddha, \"Good, Bhagavān!",
        "source": "T13n0416_001:0874c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願說此菩薩念一切佛現前三昧，令此世間天、人、梵、魔、沙門、婆羅門、諸龍、夜叉、乾闥婆、阿脩羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，多獲利益、多受安樂故，亦令當來無量眾生多得利益受安樂故，又為未來諸菩薩輩作大光明承受威力故。",
        "translation": "May this bodhisattva's mindfulness of all the buddhas in their present samādhi cause gods, humans, Brahmā, Māra, ascetics, priests, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, mahoragas, humans and nonhumans in this world to obtain many benefits and experience much comfort, and cause measureless sentient beings in the future to obtain many benefits and experience comfort, and create a great radiant bearing for the bodhisattva community in the future.",
        "source": "T13n0416_001:0874c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又，願現在、未來諸菩薩等普得聞此念一切佛現前三昧；彼既聞已皆悉受持；既受持已一切皆當如實修學、如教奉行；既學行已，當令得不退轉於阿耨多羅三藐三菩提，現前即能具足成就如是功德及餘勝上功德等。」",
        "translation": "Also, may all present and future bodhisattvas hear this mindfulness of the present samādhi of all buddhas; once they hear it, they'll all memorize it; once they memorize it, they'll all truly train and conduct themselves according to the teaching; once they train and conduct themselves, they'll attain irreversibility and unsurpassed perfect enlightenment, and they'll be able to fully achieve such virtues and other surpassing virtues right now.\"",
        "source": "T13n0416_001:0874c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復告賢護菩薩言：「賢護！",
        "translation": "It was then that the Bhagavān again addressed Bhadrapāla Bodhisattva Bhadrapāla, \"Bhadrapāla!",
        "source": "T13n0416_001:0874c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝言者，汝當諦聽，善思念之，吾今為汝分別解脫。」",
        "translation": "If it's just what you say, listen closely, consider it well, and I will now discern your liberation for you.\"",
        "source": "T13n0416_001:0874c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢護復言：「善哉，世尊！",
        "translation": "Again, Xianhu said, \"Good, Bhagavān!",
        "source": "T13n0416_001:0875a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我深樂聞如來所說。」",
        "translation": "I'm deeply delighted to hear what the Tathāgata teaches.\"",
        "source": "T13n0416_001:0875a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告言：「賢護！",
        "translation": "The Buddha again told them, \"Bhadrapāla!",
        "source": "T13n0416_001:0875a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為菩薩思惟一切諸佛現前三昧？",
        "translation": "\"What is called the samādhi of a bodhisattva's contemplation of all the buddhas in their present state?",
        "source": "T13n0416_001:0875a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩具足成就此三昧者，即獲如前諸功德事，亦得其餘殊異功德，所謂心念諸佛皆現在前，其心不亂、不捨作業。",
        "translation": "If a bodhisattva fully accomplishes this concentration, he'll attain the previously meritorious qualities and also attain the other extraordinary qualities, which are described as mindfulness of the buddhas all being present in front of him, his mind not being distracted, and not abandoning his work.",
        "source": "T13n0416_001:0875a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求勝上智勇猛精勤，荷負重擔度脫眾生。",
        "translation": "Seeking superior knowledge, he diligently undertakes the heavy burden of liberating sentient beings.",
        "source": "T13n0416_001:0875a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "承事、供給諸善知識，常修空寂廣大思惟。",
        "translation": "He serves and makes offerings to good teachers and always cultivates the contemplation of emptiness and vast serenity.",
        "source": "T13n0416_001:0875a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親善知識、滅除諸蓋，遠離惡友、息世語言、塞諸根門。",
        "translation": "He becomes intimate with good teachers, extinguishes hindrances, parts with bad friends, stops worldly talk, and closes the doors to his faculties.",
        "source": "T13n0416_001:0875a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初、中、後夜減損睡眠，不貪衣服、食飲、湯藥、堂房、屋宇、床座、眾具，恒樂空閑，住阿蘭若。",
        "translation": "He slows down sleep during the first, middle, and last nights, doesn't crave clothing, food and drink, hot water and medicine, halls, buildings, seats, and utensils, and always enjoys staying in a forest.",
        "source": "T13n0416_001:0875a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不愛己身、不重我命，不著形色、不縱其心，修以慈心、薰以悲行、一切時喜、常行捨心。",
        "translation": "He doesn't crave his own body, doesn't value his own life, doesn't attach to form, doesn't indulge his mind, cultivates kindness, perfumes compassionate behavior, rejoices at all times, and always conducts himself with equanimity.",
        "source": "T13n0416_001:0875a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破壞煩惱，成就諸禪，於中思惟不著滋味。",
        "translation": "He destroys the afflictions and accomplishes meditation, contemplating them without attaching to taste.",
        "source": "T13n0416_001:0875a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀察色想唯得空心，不亂正念、不取諸陰、不著諸入、不思諸界、不貪生處。",
        "translation": "He observes form and perception and attains only an empty mind, doesn't distract from right mindfulness, doesn't grasp the aggregates, doesn't attach to the sense fields, doesn't contemplate the elements, and doesn't crave the birthplace.",
        "source": "T13n0416_001:0875a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "調伏慢高，不妬他財，為諸世間多作饒益。",
        "translation": "He tames conceit and pride, doesn't acquire the wealth of others, and often works for the benefit of the world.",
        "source": "T13n0416_001:0875a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸眾生起平等心、又於眾生生父母想、亦於眾生所作一子心。",
        "translation": "He arouses the mind of equality among sentient beings, gives rise to the notion of parents, and creates the mind of one child among sentient beings.",
        "source": "T13n0416_001:0875a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法中無有諍想，雖念持戒而不執著，常在禪定亦無躭染。",
        "translation": "There are no contentious thoughts about any dharmas, and even though he's mindful of upholding the precepts, he doesn't cling to them and remains in meditation without being defiled.",
        "source": "T13n0416_001:0875a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "好樂多聞，不起分別，戒聚不缺、定聚不動、智聚不妄。",
        "translation": "Enjoying and learning much, he doesn't discriminate, and his precepts are not deficient, his concentration is not disturbed, and his wisdom is not false.",
        "source": "T13n0416_001:0875a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法無疑，不背諸佛、不謗正法、不壞眾僧、不好乖離。",
        "translation": "They have no doubts about the Dharma, don't renege on the buddhas, don't denigrate the right Dharma, don't undermine the saṃgha, and don't tolerate deviation.",
        "source": "T13n0416_001:0875a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親近眾聖、遠離愚癡，不志求出世。",
        "translation": "He draws near to the sages, parts with foolishness, and doesn't aspire to transcend the world.",
        "source": "T13n0416_001:0875a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖聞語言，意不樂聽，亦不耽著世間六味。",
        "translation": "Even though he hears words, his mind doesn't delight in listening, and he doesn't cling to the six flavors of the world.",
        "source": "T13n0416_001:0875a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "習近熏修五解脫法，除滅十惡、念修十善，斷滅眾生九種惱處、心常不離九想觀門，常思棄捐八種懈怠、一心修習八大人覺，不著禪味、不恃多聞，摧伏我慢，一心聽受。",
        "translation": "He cultivates the five liberating qualities, removes the ten bad qualities, cultivates the ten good qualities with mindfulness, ends the nine places of affliction in sentient beings, never departs from the nine contemplative approaches, always considers relinquishing the eight kinds of laziness, single-mindedly cultivates the eight kinds of human awakening, doesn't get attached to the taste of meditation, doesn't rely on being well-versed, destroys self-conceit, and single-mindedly listens and accepts them.",
        "source": "T13n0416_001:0875a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求法慇重修道證知，憐愍眾生離我分別，求壽命想畢竟難得、觀察諸陰無有物想，不住涅槃、不著生死。",
        "translation": "He seeks to realize the path by cultivating reverence for the Dharma, pities sentient beings and frees them from discrimination of self, conceives of life as ultimately difficult to attain, observes the aggregates as devoid of material concepts, and doesn't abide in nirvāṇa or cling to birth and death.",
        "source": "T13n0416_001:0875a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸行煩惱輪，發大恐怖想；諸陰，怨家想；諸入，空宅想；諸界，毒蛇想；三界，衰惱想；涅槃，利安想。",
        "translation": "He arouses thoughts of great fear when he trains in the wheel of affliction, thoughts of enemies in the aggregates, thoughts of empty homes in the sense of entry, thoughts of vipers in the realms, thoughts of decay in the three realms, and thoughts of well-being in nirvāṇa.",
        "source": "T13n0416_001:0875a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀諸欲惡猶如唾涕，深樂出家，不違佛教。",
        "translation": "Observing desires and evils as spiteful, he deeply enjoys leaving home and doesn't disobey Buddhism.",
        "source": "T13n0416_001:0875b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於眾生所勸行功德、於諸世界無復染心。",
        "translation": "They are encouraged by the virtues of sentient beings to practice, and they have no more defiled thoughts in the world.",
        "source": "T13n0416_001:0875b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見一切佛皆悉現前、受一切身皆若幻夢，一切諸相觀察滅除，思惟往來不見三世。",
        "translation": "He sees all buddhas in full view, experiences all bodies as illusory and dreamlike, observes the disappearance of all characteristics, and contemplates the past and future without seeing the three worlds.",
        "source": "T13n0416_001:0875b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於信清淨深信真妙，念一切佛三世平等，無有動轉而能持諸善根。",
        "translation": "With faith that's pure and deeply believed to be genuine and marvelous, he's mindful of the equality of the three times of all buddhas and is able to maintain their good roots without agitation.",
        "source": "T13n0416_001:0875b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸佛三昧自在，終不染著諸佛相身。",
        "translation": "He is at ease in the samādhi of all the buddhas and never becomes defiled by the characteristics of the buddha-bodies.",
        "source": "T13n0416_001:0875b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法皆悉平等，不與一切世間共諍。",
        "translation": "He's equal in all dharmas and doesn't engage in common disputes with the whole world.",
        "source": "T13n0416_001:0875b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所可應作不相違背，通達甚深十二因緣，窮盡一切如來道地，得勝上忍入真法界。",
        "translation": "He doesn't contradict what's possible, comprehends the profound twelve causes and conditions, exhausts all the tathāgatas' stages of enlightenment, and attains superior tolerance and enters the true Dharma realm.",
        "source": "T13n0416_001:0875b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見眾生界性無生滅、見涅槃界本來現前，慧眼清淨，觀法無二。",
        "translation": "Seeing that the nature of the realm of sentient beings is without arising or ceasing, and seeing the realm of nirvāṇa as originally manifested, their eyes of wisdom are purified, and they observe that there are no two dharmas.",
        "source": "T13n0416_001:0875b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩提心無中、無邊，一切諸佛體無差異。",
        "translation": "Their mind of enlightenment has no middle or limit, and there's no difference between the bodies of all the buddhas.",
        "source": "T13n0416_001:0875b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入於無礙清淨智門，明見菩提自然覺智。",
        "translation": "Entering through the gate of unobstructed pure cognition, he clearly sees the naturally enlightened wisdom of bodhi.",
        "source": "T13n0416_001:0875b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善知識起諸佛想、於菩薩所不念乖離。",
        "translation": "They give rise to perceptions of the buddhas in the presence of good teachers and don't part with mindfulness of the bodhisattva's place.",
        "source": "T13n0416_001:0875b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已於生死破壞魔軍，一切眾事皆悉如化。",
        "translation": "Having destroyed the army of Māra in birth and death, all things are transformed accordingly.",
        "source": "T13n0416_001:0875b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸如來如鏡中像，應當求彼菩提之心。",
        "translation": "Seeing the tathāgatas as images in a mirror, you should seek their minds for enlightenment.",
        "source": "T13n0416_001:0875b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸波羅蜜莫不平等，實際無盡集佛功德。",
        "translation": "None of the perfections are equal, and there's really no limit to the collection of Buddha merit.",
        "source": "T13n0416_001:0875b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0875b18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩思惟諸佛現前三昧。",
        "translation": "\"This is the samādhi of a bodhisattva contemplating the present appearances of the buddhas.",
        "source": "T13n0416_001:0875b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有菩薩摩訶薩欲具成就如是三昧，當先成就如是功德。",
        "translation": "If a bodhisattva wishes to fully achieve such a concentration, he or she must first achieve such virtue.",
        "source": "T13n0416_001:0875b19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢護當知，更有無量功德然亦緣此三昧而生。」",
        "translation": "Bhadrapāla should know that there are measureless merits that nonetheless arise from this samādhi.\"",
        "source": "T13n0416_001:0875b20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告賢護言：「是中何等三昧能生如是諸功德行？",
        "translation": "Again, the Buddha told Bhadrapāla, \"Which of these samādhis can produce such meritorious actions?",
        "source": "T13n0416_001:0875b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂菩薩思惟諸佛現前三昧能生如是諸功德法。",
        "translation": "This is called the bodhisattva's contemplation of the buddhas' present samādhi, which produces such meritorious qualities.",
        "source": "T13n0416_001:0875b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，賢護！",
        "translation": "\"Furthermore, Bhadrapāla!",
        "source": "T13n0416_001:0875b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為菩薩思惟諸佛現前三昧也？",
        "translation": "\"What is called the samādhi of bodhisattvas contemplating the manifestation of the buddhas?",
        "source": "T13n0416_001:0875b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢護！",
        "translation": "Bhadrapāla!",
        "source": "T13n0416_001:0875b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘、比丘尼、優婆塞、優婆夷，清淨持戒、具足諸行，獨處空閑如是思惟：『於一切處隨何方所即若西方阿彌陀如來、應供、等正覺？』",
        "translation": "Suppose there are monks, nuns, laymen, and laywomen who observe the precepts with purity and fulfillment of practices, and who stand alone in an empty forest and thus contemplate, 'In all places, where is the place that is like the Tathāgata Amitâbha of the West, Worthy of Offerings, and Perfectly Enlightened?'",
        "source": "T13n0416_001:0875b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人爾時如所聞已，即應自作如是想念：『如我所聞：彼阿彌陀如來、應供、等正覺今在西方，經途去此過百千億諸佛國土，彼有世界名曰安樂。",
        "translation": "After hearing this, that person should then think to himself, 'As I've heard, the Tathāgata Amitâbha, Worthy of Offerings, and Perfectly Enlightened One is now in the West, passing through a hundred thousand billion Buddha-lands that are called Anāthapiṇḍada.",
        "source": "T13n0416_001:0875b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，如來今現在彼為諸菩薩周匝圍遶，處大眾中說法教化。』",
        "translation": "Thus, the Tathāgata is now there, surrounded by bodhisattvas, in the midst of a great crowd, teaching and preaching.'",
        "source": "T13n0416_001:0875c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然而是人依所聞故，繫念、思惟、觀察不已了了分明，終獲見彼阿彌陀如來、應供、等正覺也。",
        "translation": "Still, depending on what he hears, this person's fixation, reflection, and observation haven't been fully comprehended, and he's finally attained a vision of that Amitâbha Tathāgata, Worthy of Offerings, and Equally Enlightened.",
        "source": "T13n0416_001:0875c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，賢護！",
        "translation": "\"Furthermore, Bhadrapāla!",
        "source": "T13n0416_001:0875c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間若男、若女，於睡夢中見種種事——所謂金、銀、眾寶、珍財、倉庫，或見朋友、諸知識輩，或見覺時心不樂者——是人夢中所對境界，或違、或順，或憂、或喜，有時語言歡欣極樂、有時躁慼盡意悲哀，是人寤已思惟、憶念，如夢所見為他廣宣，追念夢中便生憂喜。",
        "translation": "\"Suppose there's a man or woman in the world who sees various things in a dream while sleeping - things like gold, silver, various treasures, valuable possessions, or storage, or who sees friends or people of knowledge, or who sees someone who's unhappy at the time of awakening - and the object they confront in that dream is either disagreeable, agreeable, sad, or joyous, sometimes overjoyed with words, and sometimes agitated and full of sadness.",
        "source": "T13n0416_001:0875c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，賢護！",
        "translation": "Thus, Bhadrapāla!",
        "source": "T13n0416_001:0875c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子、善女人端坐繫念，專心想彼阿彌陀如來、應供、等正覺如是相好、如是威儀、如是大眾、如是說法。",
        "translation": "\"That good man or woman sits calmly and fixes his or her attention, concentrating his or her mind on the Tathāgata Amitâbha, Worthy of Offerings, and Completely Awakened One, thus behaving, thus mannered, thus composed, and thus expounding the Dharma.",
        "source": "T13n0416_001:0875c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如聞繫念，一心相續次第不亂，或經一日、或復一夜、如是或至七日七夜，如先所聞具足念故，是人必覩阿彌陀如來、應供、等正覺也。",
        "translation": "As she hears and fixes her attention, she continues to single-mindedly sequence without distraction for a day, or another night, or so on for seven days or nights, and because she fully recollects what she's heard before, this person will surely see Amitâbha as the Tathāgata, Worthy of Offerings, and Equally Enlightened.",
        "source": "T13n0416_001:0875c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於晝時不能見者，若於夜分或睡夢中阿彌陀佛必當現也。",
        "translation": "If he can't see them during the day, then Amitâbha Buddha will surely appear during the nighttime hours or while he's asleep and dreaming.",
        "source": "T13n0416_001:0875c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，賢護！",
        "translation": "\"Furthermore, Bhadrapāla!",
        "source": "T13n0416_001:0875c19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如世間若男、若女，遠行他國，於睡夢中見本居家，時實不知為晝、為夜，而亦不知為內、為外。",
        "translation": "\"It's like a man or woman in the world who travels to another country and sees his or her original home in a dream when he or she really doesn't know whether it's day or night and doesn't know whether it's inside or outside.",
        "source": "T13n0416_001:0875c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人爾時所有眼根，墻壁、石山終不能障，乃至幽冥、黑闇亦不為礙也。",
        "translation": "At the time, that person's visual faculty is never obstructed by walls or mountains of stone, nor is it obstructed by darkness or obscuration.",
        "source": "T13n0416_001:0875c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0875c23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩心無障礙亦復如是，當正念時，於彼所有佛剎中間，凡是一切須彌山王，及鐵圍山、大鐵圍山，乃至自餘諸黑山等，不能與此眼根為障，而亦不能覆蔽此心。",
        "translation": "\"So too, when the bodhisattva-mahāsattva's mind is unobstructed, when he's correctly mindful, whatever Sumeru the king of mountains, the iron-encircled mountains, the great iron-encircled mountains, and even the other black mountains in the midst of all those buddha bases can't obstruct his eye faculty or obscure his mind.",
        "source": "T13n0416_001:0875c23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然是人者，其實未得天眼能見彼佛、亦無天耳聞彼法音、復非神通往彼世界、又亦不於此世界沒生彼佛前，而實但在此世界中積念熏修、久觀明利故，終得覩彼阿彌陀如來、應、等正覺僧眾圍遶菩薩會中，或見自身在彼聽法，聞已憶念、受持、修行；或時復得恭敬、禮拜、尊承供養彼阿彌陀如來、應、等正覺已。",
        "translation": "Still, this person really hasn't attained the divine eye to see that Buddha, doesn't have the divine ear to hear his Dharma voice, doesn't have supernormal access to that world, and isn't reborn in this world in front of that Buddha, but really only accumulates mindfulness and cultivation in this world and observes the insights over time.",
        "source": "T13n0416_001:0875c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人然後起此三昧；其出觀已，次第思惟，如所見聞為他廣說。",
        "translation": "That person then produces this samādhi, and after observing it, they sequentially contemplate it and explain it in detail for others as they've seen and heard it.",
        "source": "T13n0416_001:0876a05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，賢護！",
        "translation": "\"Furthermore, Bhadrapāla!",
        "source": "T13n0416_001:0876a06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此摩伽陀國有三丈夫：其第一者聞毘耶離城有一婬女名須摩那、彼第二人聞有婬女名菴羅波離、彼第三人聞有婬女名蓮華色。",
        "translation": "\"Thus, in the country of Magadha, there are three men: the first of them hears that there's a woman named Somaña in Vaiśālī, the second hears that there's a woman named Amrapāli, and the third he hears that there's a woman named Lianhuash.",
        "source": "T13n0416_001:0876a06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼既聞已，各設方便繫意懃求，無時暫廢。",
        "translation": "After hearing about it, they each set out to pursue it with skillful means, and they didn't stop for a while.",
        "source": "T13n0416_001:0876a09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼三人實未曾覩如是諸女，直以遙聞即興欲心，專念不息。",
        "translation": "However, those three people had never actually seen such women before, but just because they heard about them from a distance, they immediately became desirous and concentrated their thoughts.",
        "source": "T13n0416_001:0876a10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後因夢已，在王舍城與彼女人共行欲事；欲事既成，求心亦息，希望既滿遂便覺寤；寤已追念夢中所行，如所聞見、如所證知、如是憶念，來詣汝所、具為汝說者，汝應為彼方便說法、隨順教化，令其得住不退轉地、究竟成就阿耨多羅三藐三菩提。",
        "translation": "After they awoke, they recalled what they had done in the dream, as they had heard and seen, as they had realized, and as they had recollected it, and they came to you and explained it to you, so you should skillfully explain it to them and teach them accordingly, so that they may stand in the ground of irreversibility and ultimately achieve supreme perfect enlightenment.",
        "source": "T13n0416_001:0876a12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於當來必得成佛，號曰善覺如來、應供、等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "They will surely become buddhas in the future and be called Sunetra Tathāgata, Worthy of Offerings, Completely Enlightened, Perfectly Awakened, Perfectly Practiced, Well Gone, Understander of the World, Unsurpassed Person, Trainer, Teacher of Gods and People, Buddha, or World Honored One.",
        "source": "T13n0416_001:0876a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，三人既得忍已，還復憶念往昔諸事了了分明也。",
        "translation": "Thus, once these three people have attained patience, they'll also recall past events clearly and distinctly.",
        "source": "T13n0416_001:0876a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0876a21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子、善女人等，若欲成就菩薩摩訶薩思惟一切諸佛現前三昧亦復如是，其身常住此世界中，暫得聞彼阿彌陀如來、應供、等正覺名號，而能繫心相續思惟，次第不亂，分明覩彼阿彌陀佛，是為菩薩思惟、具足成就諸佛現前三昧。",
        "translation": "\"Suppose good sons and good women who want to achieve the concentration of a bodhisattva's contemplation on the manifestation of all buddhas likewise want to abide in this world and momentarily hear the name Amitâbha as the Tathāgata, Worthy of Offerings, and Completely Awakened One, and then they can fix their minds on contemplating them continuously, without being distracted by their order, and clearly see the Amitâbha Buddha, this is a bodhisattva's contemplation and accomplishment of the concentration of the manifestation of all buddhas.",
        "source": "T13n0416_001:0876a21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「因此三昧得見佛故，遂請問彼阿彌陀佛言：『世尊！",
        "translation": "\"Because he had thus seen the Buddha in this samādhi, he then asked Amitâbha, \"Bhagavān!",
        "source": "T13n0416_001:0876a26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩等成就何法而得生此佛剎中耶？』",
        "translation": "What have the bodhisattvas accomplished that would allow them to be born in this buddha's bhava?'",
        "source": "T13n0416_001:0876a27_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿彌陀佛語是菩薩言：『若人發心求生此者，常當繫心正念相續阿彌陀佛，便得生也；既得生已，世尊於是知彼心故亦即念彼，彼方得見佛、世尊耳。』",
        "translation": "At that point, Amitâbha Buddha said to this bodhisattva, 'If someone has the intention of seeking birth here, they must always bind their mind in correct remembrance of Amitâbha Buddha and then they'll be born; once they've been born, the Bhagavān then knows their thoughts and therefore also remembers them, and then they'll be able to see the Buddha, the Bhagavān.'",
        "source": "T13n0416_001:0876a28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0876b03_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼阿彌陀如來、應、等正覺告彼人言：『諸善男子！",
        "translation": "Then the Tathāgata Amitâbha, the Worthy and Completely Enlightened One, addressed them, saying, 'Good sons!",
        "source": "T13n0416_001:0876b03_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當正念、精懃修習、發廣大心，必生此也。』",
        "translation": "Be rightly mindful, diligently cultivate it, and give rise to a vast aspiration, and you will surely be born here.'",
        "source": "T13n0416_001:0876b04_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0876b05_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼菩薩復白阿彌陀佛言：『世尊！",
        "translation": "The bodhisattva then again said to Amitâbha Buddha, 'Bhagavān!",
        "source": "T13n0416_001:0876b05_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中云何念佛、世尊、精懃修習、發廣大心得生此剎耶？』",
        "translation": "How then is this mindfulness of the Buddha, the Bhagavān, diligent cultivation, and the arousal of a vast resolve given rise to this blaze?'",
        "source": "T13n0416_001:0876b06_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0876b07_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼阿彌陀佛復告彼言：『諸善男子！",
        "translation": "Amitâbha then again addressed them, saying, 'Good sons!",
        "source": "T13n0416_001:0876b07_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若汝今欲正念佛者，當如是念：「今者，阿彌陀如來、應、等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊具有如是三十二相、八十隨形好，身色光明如融金聚，具足成就眾寶輦轝，放大光明坐師子座，沙門眾中說如斯法——其所說者，謂一切法本來不壞亦無壞者，如不壞色乃至不壞識等諸陰故，又如不壞地乃至不壞風等諸大故，又不壞色乃至不壞觸等諸入故，又不壞梵乃至不壞一切世主等；如是，乃至不念彼如來、亦不得彼如來。」",
        "translation": "若汝今欲正念佛者，當如是念：「今者，阿彌陀如來、應、等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊具有如是三十二相、八十隨形好，身色光明如融金聚，具足成就眾寶輦轝，放大光明坐師子座，沙門眾中說如斯法——其所說者，謂一切法本來不壞亦無壞者，如不壞色乃至不壞識等諸陰故，又如不壞地乃至不壞風等諸大故，又不壞色乃至不壞觸等諸入故，又不壞梵乃至不壞一切世主等；如是，乃至不念彼如來、亦不得彼如來。」",
        "source": "T13n0416_001:0876b08_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作如是念如來已，如是次第得空三昧。",
        "translation": "After thus mindful of the Tathāgata, he attains the samādhi of emptiness in this order.",
        "source": "T13n0416_001:0876b18_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0416_001:0876b19_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名正念諸佛現前三昧也。』",
        "translation": "This is called the samādhi of right mindfulness of the buddhas in their present state.'",
        "source": "T13n0416_001:0876b19_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「賢護！",
        "translation": "\"Bhadrapāla!",
        "source": "T13n0416_001:0876b20_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼菩薩從三昧起已，來詣汝所說此三昧相者，汝時即應為彼說法、隨順教化，令於阿耨多羅三藐三菩提得不退轉。",
        "translation": "At that point, when that bodhisattva rises from samādhi and comes to you to explain the characteristics of this samādhi, you should then teach that person and follow their lead, so that they will attain irreversibility in the unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0416_001:0876b20_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢護菩薩所問經卷第一",
        "translation": "Sutra of the Questions of Bhadrapāla Bodhisattva, Volume 1",
        "source": "T13n0416_001:0876b24_0",
        "is_bad_quality": false
    }
]