[
    {
        "source_sentence": "大乘大集地藏十輪經卷第二",
        "translation": "Dasheng daji dizang shilun jing, vol. 2",
        "source": "T13n0411_002:0728a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T13n0411_002:0728a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十輪品第二",
        "translation": "second of the ten wheel-turning classes",
        "source": "T13n0411_002:0728a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，地藏菩薩摩訶薩從座而起，整理衣服，頂禮佛足，偏袒一肩，右膝著地，合掌恭敬，而白佛言：「我今問世尊，　　無量功德海，　唯願賜開許，　　為解釋除疑。」",
        "translation": "At that point, Kṣitigarbha Bodhisattva Mahāsattva rose from his seat, adjusted his robes, bowed his head at the Buddha's feet, bared one shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, \"Now, I'd like to ask the Bhagavān about the limitless ocean of merit, please grant permission to explain it to him and remove my doubts.\"",
        "source": "T13n0411_002:0728a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝真善士！",
        "translation": "The Bhagavān told him, \"You're really a good person!",
        "source": "T13n0411_002:0728b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法智見無礙，為欲饒益他有情，故請問如來。",
        "translation": "Unimpeded in their knowledge and vision of all things, they want to benefit other sentient beings, so they ask the Tathāgata about it.",
        "source": "T13n0411_002:0728b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨汝意問，吾當為汝分別解說，令汝心喜。」",
        "translation": "Ask as you wish, and I will explain it clearly for you so that you'll be pleased.\"",
        "source": "T13n0411_002:0728b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是地藏菩薩摩訶薩，以頌問曰：「我曾十三劫，　　已勤修苦行，　為一切有情，　　除三災五濁。",
        "translation": "Thereupon, Kṣitigarbha Bodhisattva Mahāsattva asked with a verse, \"For 13 eons, I've diligently cultivated austerities to remove the three calamities and five defilements for all sentient beings.",
        "source": "T13n0411_002:0728b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多俱胝佛所，　　已設無邊供，　曾見大集會，　　清信眾和合；　聰哲勤精進，　　皆來同會集，　未曾見如是，　　無諸雜穢眾。",
        "translation": "I've made limitless offerings to many of the many tortuous buddha-places, seen great assemblies where pure faith is united, and wise and diligent people all came together to assemble, and I've never seen such a thing, not a multitude of defilements.",
        "source": "T13n0411_002:0728b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何此佛國，　　穢惡損淨善，　智者皆遠離，　　惡行者同居；　多造無間罪，　　誹謗於正法，　毀聖起惡見，　　妄說斷常論；　具造十惡業，　　不畏後世苦，　多遠離三乘，　　臭穢向惡趣；　無明蔽其目，　　貪嫉多姦矯？",
        "translation": "How is it that in this Buddha land, filth and evil impair the pure and good, wise men all avoid it, and those who engage in bad behavior dwell together; that they often commit unremitting crimes, denigrate the true teaching, disparage the noble ones, hold bad views, and falsely teach nihilism; that they create ten bad karmas, aren't afraid of the suffering of the latter life, are often removed from the three vehicles, are smelly, and head for a bad destiny; that ignorance blinds them, and that they are greedy and adulterous?",
        "source": "T13n0411_002:0728b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何轉佛輪，　　度此眾生類？",
        "translation": "\"How do you turn the Buddha's wheel and liberate this class of sentient beings?",
        "source": "T13n0411_002:0728b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何破相續，　　如金剛煩惱？",
        "translation": "\"How do you break through continuity like the adamantine afflictions?",
        "source": "T13n0411_002:0728b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何得總持，　　果能如是忍？",
        "translation": "\"How can a person attain total maintenance and thus attain forbearance?",
        "source": "T13n0411_002:0728b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今我見導師，　　大集甚希有，　未曾見餘處，　　具如是眾德。",
        "translation": "\"Now, I've seen a guide, a rare and great collection, unseen anywhere else, who possesses such a variety of virtues.",
        "source": "T13n0411_002:0728b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具杜多功德，　　勤修菩提道。",
        "translation": "Endowed with many virtues, he diligently cultivates the path to enlightenment.",
        "source": "T13n0411_002:0728b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何處愚眾，　　能開示佛輪？」",
        "translation": "Where are the foolish people who can reveal the Buddha's wheel?\"",
        "source": "T13n0411_002:0728b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「善哉，善哉！",
        "translation": "The Bhagavān told them, \"Good, good!",
        "source": "T13n0411_002:0728b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0728b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於過去殑伽沙等諸佛世界，五濁惡時，已曾請問殑伽沙等諸佛世尊，如是法義。",
        "translation": "In the past, when the five turbidities were bad in sands and other buddha-worlds, you've asked sons of sands and other buddha-worlds about the meaning of such a teaching.",
        "source": "T13n0411_002:0728b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於如是所問法義，已作劬勞，已善通達，已到圓滿眾行彼岸；已得善巧方便妙智。",
        "translation": "You've labored over such questions about the meaning of the Dharma, have well comprehended them, have reached the perfection of all practices, and have attained the marvelous knowledge of skillful means.",
        "source": "T13n0411_002:0728b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今為成熟一切有情，令得利益、安樂事故；為令一切菩薩摩訶薩，善巧、方便、聖行、伏藏、施等六種波羅蜜多，成熟一切有情，勝行一切智智，功德大海速圓滿故；為轉一切剎帝利王諸暴惡行，使不墮落三惡趣故；為令此土三寶種姓，威德熾盛，久住世故；復問如來如是法義。",
        "translation": "Now, in order to ripen all sentient beings for their benefit and well-being, in order to cause all bodhisattvas, mahāsattvas, to ripen all sentient beings with the six perfections of skillful means, noble actions, restraints, and generosity, to mature all sentient beings, to surpass the practice of omniscience, and to quickly complete the ocean of merit; in order to convert all the violent and unwholesome actions of the bhadra kings so that they won't fall into the three bad destinies; and in order to cause the Three Treasures family of this land to flourish in prestige and abide in the world for a long time, you'll again ask the Tathāgata about the meaning of such a teaching.",
        "source": "T13n0411_002:0728c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽諦聽，善思念之！",
        "translation": "Listen closely, listen closely, and consider it well!",
        "source": "T13n0411_002:0728c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝，分別解說。」",
        "translation": "I will explain it clearly for you.\"",
        "source": "T13n0411_002:0728c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯然！",
        "translation": "\"Yes!",
        "source": "T13n0411_002:0728c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0411_002:0728c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T13n0411_002:0728c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告地藏菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Buddha addressed Kṣitigarbha Bodhisattva Mahāsattva, saying, \"Good sons!",
        "source": "T13n0411_002:0728c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來由本願力，成就十種佛輪。",
        "translation": "By virtue of his original vow, the Tathāgata has accomplished ten kinds of the Buddha-wheel.",
        "source": "T13n0411_002:0728c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居此佛土五濁惡世一切有情，退沒一切白淨善法、匱乏所有七聖財寶、遠離一切聰敏智者、斷常羅網之所覆蔽；常好乘馭諸惡趣車，於後世苦不見怖畏；常處遍重無明黑闇，具足十種不善業道，造五無間、誹謗正法、毀呰賢聖、離諸善法、具諸惡法。",
        "translation": "All sentient beings living in the five turbid bad worlds of this Buddha land are deprived of all the white and pure good qualities, deprived of all the seven noble possessions, removed from all the wise and intelligent ones, and covered by the net of permanence; they always prefer to ride the chariots of bad destinies, don't see or fear the suffering of later lifetimes; they're always in the darkness of pervasive ignorance, are replete with the ten unwholesome karmic paths, create the five kinds of unremitting, denigrate the right teaching, disparage the good and noble, part with the good qualities, and embody the bad qualities.",
        "source": "T13n0411_002:0728c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我住如是雜惡土中，得安隱住、得無驚恐、得無所畏。",
        "translation": "Living in such a mixed-up evil land, I've attained a peaceful dwelling, fearlessness, and fearlessness.",
        "source": "T13n0411_002:0728c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，降諸天魔、外道、邪論，摧滅一切諸眾生類，猶如金剛堅固煩惱，隨其所樂，安置一切有力眾生，令住三乘不退轉位。",
        "translation": "Claiming to be in the position of a great sage, I turn the Buddha's wheel, subdue demons, non-Buddhists, and mistaken theories, destroy all types of sentient beings, become like a vajra that hardens afflictions, and place all powerful sentient beings in the irreversible position of the three vehicles according to their pleasure.",
        "source": "T13n0411_002:0728c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0728c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有國，時虛君位，其中所有一切人民、自軍、他軍、更相侵害，憂愁擾亂，人眾不安。",
        "translation": "Suppose there's a country that's in the position of virtual ruler at the time, and all the people in it, their own troops and others' troops, are constantly at odds with each other, distressed and troubled, and the people are uneasy.",
        "source": "T13n0411_002:0728c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有無量種鬪訟違諍、互相欺凌，諂言、妄語、麁惡、乖離、誣誷、矯亂；種種疾病、盲瞖昏闇、寒熱瘧疾、溫氣疫癘、癲癎乾枯、飲食不消；其心狂亂，諸根不具，支體缺減，乏少種種衣食資具，一切所有皆不可樂。",
        "translation": "There are countless kinds of disputes, quarrels, mutual mistreatment, flattery, false speech, harshness, misconstrual, false accusations, and confusion, various illnesses, blindness, fever, malaria, warmth, epidemics, convulsions, dryness, and lack of food and drink, and their minds are deranged, their faculties aren't equipped, their limbs are weakened, and they lack various necessities for food and clothing, all of which are unpleasant.",
        "source": "T13n0411_002:0728c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有情類，歸依種種外道邪神，惡見、惡心及惡意樂，皆悉熾盛，迷失正道，臨墮惡趣。",
        "translation": "As a result, all sentient beings who rely on various non-Buddhist evil spirits have bad views, bad thoughts, and ill-will that are all raging, lose the right path, and are about to fall into a bad destiny.",
        "source": "T13n0411_002:0728c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼國中有諸耆舊，聰明、多智、博學、平恕、威嚴、整肅，相與謀議，運諸籌策，即便召集國邑人民，共所薦推取一王子。",
        "translation": "\"At the time, there were some elders in that country who were wise, knowledgeable, learned, forgiving, dignified, and respectful, who consulted with each other, formulated various plans, and then gathered the people of the country together to recommend a prince.",
        "source": "T13n0411_002:0729a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先具多種布施、調伏、寂靜、尸羅、精進、勇猛、難行、苦行，一切備滿。",
        "translation": "He's endowed with a variety of generosity, restraint, tranquility, morality, effort, courage, difficult actions, and ascetic practices, all of which are complete.",
        "source": "T13n0411_002:0729a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具諸殊勝福德之相，諸根圓滿，支體無缺，身形長大，相好端嚴，成就最勝美妙容色。",
        "translation": "He possesses characteristics of exceptional merit, perfected faculties, a limb that's without defect, a body that's long and graceful, and a most excellent and beautiful appearance.",
        "source": "T13n0411_002:0729a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常為一切尊重恭敬，率土人民無不親愛，稟性淳質，常懷慈悲，博學多才，備諸伎藝。",
        "translation": "Always honored and respected by all, he's beloved by the people of the land, simple in nature, always compassionate, well-versed, and skilled in many arts and crafts.",
        "source": "T13n0411_002:0729a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "柔和忍辱，莊嚴其心。",
        "translation": "He's gentle, patient, and adorned in spirit.",
        "source": "T13n0411_002:0729a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大后妃所生嫡子，以諸妙香熏、清淨水、調和冷暖，沐浴其身。",
        "translation": "That firstborn son of the great queen consort bathes his body in a bath made of fine perfumes, pure water, and seasoned cold and warmth.",
        "source": "T13n0411_002:0729a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著於種種上妙香熏、眾寶、莊嚴、鮮淨、衣服，末尼珠寶置在髻中，金寶華鬘冠飾其首，素練輕繒束於髮際。",
        "translation": "He's adorned with a variety of fine fragrances, numerous treasures, adornments, and fresh, clean clothing, placed with mani jewels in his topknot, a crown of gold and jewelry, and a headdress, and a bundle of coarse, lightweight silken fabric at the ends of his hair.",
        "source": "T13n0411_002:0729a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以種種末尼真珠、金、銀、等寶，共所合成、珥璫、瓔珞、環玔印等，眾妙寶飾，莊嚴其身。",
        "translation": "He also adorns his body with a variety of precious maṇi beads, gold, silver, and other treasures, which are all combined together, including jewels, jewelry, jewelry, rings, seals, and other wonderful adornments.",
        "source": "T13n0411_002:0729a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織成寶履下承其足，眾寶傘蓋上覆其頂，安置古昔一切天仙所護持座。",
        "translation": "Weaving a jeweled footstool to support his feet and covering his head with a canopy of jewels, he places it on the seat protected by all the sages of yore.",
        "source": "T13n0411_002:0729a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "趣入一切天帝同許共所護持善巧營搆殊妙大殿，登自先王所昇尊座。",
        "translation": "He enters a large, beautiful hall that's skillfully maintained by the mutual support of all the gods and ascends to the seat of honor elevated by his predecessor as king.",
        "source": "T13n0411_002:0729a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "紹王位已，扣擊一切天帝、龍帝、藥叉、神帝、阿素洛帝、鳩畔荼帝，各所護持廣大鍾鼓，其聲振響周遍國界。",
        "translation": "After ascending to the king's throne, he strikes the vast bell and drum guarded by each of the gods, the dragon gods, the yakṣas, the gods, the asura gods, and the kumbhāṇḍa gods, and the sound of it resounds throughout the whole world.",
        "source": "T13n0411_002:0729a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「剎帝利等四大種姓，無量人眾，沐浴其身，著淨衣服，執持種種妙寶、繒綵、傘蓋、幢幡、末尼真珠、金銀、螺貝、璧玉、珊瑚、茷琉璃等，生色可染，無量珍奇，奉獻新王，以呈嘉瑞。",
        "translation": "\"An incalculable multitude of people from the four great castes, including the Kārttiyas, bathe themselves, dress themselves in pure clothing, and carry various wonderful treasures, silks, umbrellas, banners, mani-pads, gold and silver, conch shells, jade, coral, and lapis lazuli that are colored and dyed, and have measureless treasures, which they present to the new king as an auspicious gift.",
        "source": "T13n0411_002:0729a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貴族淨行博學多才諸婆羅門，以無量種微妙讚頌、歌詠帝德，種種善事呪願於王，以諸吉祥散灑王頂。",
        "translation": "Brahmins of noble purification and conduct who were learned and versatile offered the king measureless subtle praises, sang songs of the emperor's virtue, and vowed various good deeds, scattering the king's head with all manner of good fortune.",
        "source": "T13n0411_002:0729a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先王所重宿望貴族，博學多藝，性直賢明，隨其所應，授以種種職位、官僚、理諸王事。",
        "translation": "The noble men of long-standing standing who were valued by the previous king as being well-versed and artistic, straightforward and wise in nature were given various positions and offices and managed the king's affairs as they saw fit.",
        "source": "T13n0411_002:0729a29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先於國境自軍、他軍、更相侵害，今皆令息。",
        "translation": "In the past, he allowed his own army and the armies of others to invade his kingdom, but now he has caused them all to stop.",
        "source": "T13n0411_002:0729b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦令一切怨敵、惡友、能為害者，皆悉殄滅。",
        "translation": "They'll also cause all enemies, bad friends, and those who can do harm to be destroyed.",
        "source": "T13n0411_002:0729b03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "損除自國一切黑品，增益自國一切白品。",
        "translation": "They'll remove all the dark elements in their own country and increase all the white elements in their own country.",
        "source": "T13n0411_002:0729b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0729b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王，成就如是第一王輪。",
        "translation": "\"The great king of the consecration of the Kārttiari lineage has accomplished thus the first royal wheel.",
        "source": "T13n0411_002:0729b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此輪故，於自國土得安樂住，能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "Because of this wheel, he'll live in comfort in his own land, subdue all enemies and bad friends, and guard his body well so that his life will increase.",
        "source": "T13n0411_002:0729b06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0729b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是雜染、五濁惡世、索訶佛土，空無佛時，其中所有一切眾生，為自心中，隨眠纏垢，自軍、他軍、惱害侵逼，愁憂擾亂，愚冥不安，起無量種，執著斷常、鬪訟、違諍、互相輕蔑、起貪、瞋、癡、諂、誑言等，具足十種不善業道。",
        "translation": "In this defiled, five defiled bad worlds and the Soha Buddha Land, when it's empty and lacks a Buddha, all the sentient beings in it are tethered by latent defilements in their own minds, are beset by self and other armies, are troubled by afflictions, are disturbed by grief, are confused, and give rise to measureless kinds of attachments, cut off permanence, fight, disagree, despise each other, become greedy, angry, deluded, flattering, and speak deceptively, and so on, which are full of the ten unwholesome courses of action.",
        "source": "T13n0411_002:0729b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "執著有情紛擾世界，成就種種煩惱、疾病，闕正法眼，忿恨燒惱，常不思惟真實正法，棄正法味，譏毀善行，乏少所受憙樂滋味，常為種種煩惱羅網之所覆蔽，歸依六種外道邪師，迷失聖道，向三惡趣。",
        "translation": "They become attached to the world of the disturbances of sentient beings, which causes various afflictions and illnesses, lack the right eye for the Dharma, become angry and burned, often don't contemplate the true and right Dharma, abandon the taste of the right Dharma, denigrate good actions, lack the taste of the joys they experience, are constantly hindered by the web of various afflictions, and turn to six kinds of non-Buddhist mistaken teachers, losing the noble path and heading for the three bad destinies.",
        "source": "T13n0411_002:0729b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於此土中，有諸菩薩摩訶薩，已於過去親近、供養無量諸佛，已入諸佛功德大海，已住諸佛本所行道，皆共集會來至我所，同謂我言：『汝於過去，已修無量布施、調伏、寂靜、尸羅、精進、勇猛，難行、苦行、一切備滿。",
        "translation": "\"In this land, there are bodhisattvas, mahāsattvas, who have drawn near to and made offerings to measureless buddhas in the past, have entered the ocean of their merits, and have stayed on the paths originally practiced by the buddhas, all gathered together and came to me, saying, 'In the past, you cultivated measureless generosity, restraint, tranquility, morality, effort, and courage, and you completed all difficult and painful actions.",
        "source": "T13n0411_002:0729b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸微妙，福慧、方便、大慈悲等，共所莊嚴大功德藏，是一切定、總持、安忍、諸地功德，圓滿大海，無諂、無誑。",
        "translation": "These subtleties, merits, wisdom, skillful means, and great compassion collectively adorn the store of great virtue, which is a vast ocean of all meditations, masteries, patience, and the virtues of the stages, all of which are perfected without deceit or deception.",
        "source": "T13n0411_002:0729b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身形長大，相好圓滿，忍辱柔和，端正殊妙。",
        "translation": "His body is long and large, his features are perfectly proportioned, and he's tolerant, gentle, correct, and marvelous.",
        "source": "T13n0411_002:0729b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不復依他修菩提道，一切智海已得圓滿，成就最勝美妙容色。",
        "translation": "Not depending on others to cultivate the path to enlightenment, he has perfected the ocean of omniscience and achieved the most beautiful appearance.",
        "source": "T13n0411_002:0729b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能為一切聲聞、獨覺、作大導師；亦能安慰一切生死怖畏眾生，與作親友；大慈悲等無量功德，共所莊嚴。",
        "translation": "He can be a great teacher to all śrāvakas and pratyekbuddhas, and he can comfort and be a friend to all sentient beings who are fearful of birth and death, adorned by measureless virtues such as great kindness and pity.",
        "source": "T13n0411_002:0729b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是羯洛迦孫駄、羯諾迦牟尼、迦葉波如來等，父之真子，於此賢劫，當得作佛，一切菩薩摩訶薩中，最為上首。",
        "translation": "These true sons of Kālaka Sundarī, Kāṇḍaka Muni, and Kāśyapa Tathāgata, their fathers, will become buddhas in these good eons, the highest of all bodhisattvas and mahāsattvas.",
        "source": "T13n0411_002:0729b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸功德，種種妙香熏奢摩他、毘鉢舍那清淨之水，而自沐浴，著慚愧衣，清淨法界為髻中珠，冠飾諸佛所行境界，廣大華鬘，束以解脫殊妙素練。",
        "translation": "He bathes himself in the pure waters of śamatha and vipaśyanā with all the virtues and various wonderful scents, wears robes of shame, pearls in his topknot made from the pure Dharma realm, adorns the sphere of the buddhas' activities with a vast garland of flowers, and bundles himself with the marvelous veil of liberation.",
        "source": "T13n0411_002:0729c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以種種，一切智智、無生忍等，功德珍寶而自莊嚴。",
        "translation": "He adorns himself with the treasures of various merits, such as omniscience and cognition and the patient acceptance of nonarising.",
        "source": "T13n0411_002:0729c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈、悲、喜、捨以為寶履，能覆三界。",
        "translation": "Kindness, pity, joy, and equanimity are treasured footprints that cover the three realms.",
        "source": "T13n0411_002:0729c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三種妙行，圓滿聖因，以為傘蓋。",
        "translation": "These three wondrous actions and perfectly noble causes serve as an umbrella.",
        "source": "T13n0411_002:0729c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安置古昔諸佛天仙，共所護持金剛定座。",
        "translation": "It's placed on the adamantine seat of meditation, which was guarded by the buddhas and sages of yore.",
        "source": "T13n0411_002:0729c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "趣入一切聲聞、獨覺恭敬護持四種念住。",
        "translation": "He enters the four bases of mindfulness that all śrāvakas and solitary realizers respect and uphold.",
        "source": "T13n0411_002:0729c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "坐先諸佛所敷之座，證得無上正等菩提一切智位。",
        "translation": "Sitting on the seat spread out by the buddhas of yore, he realizes the stage of unsurpassed correct enlightenment and omniscience.",
        "source": "T13n0411_002:0729c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令一切三寶種姓不斷絕故，轉於法輪擊法鍾鼓，妙法音聲遍滿三界，令諸天、龍、藥叉、羅剎、阿素洛、揭路荼、緊捺洛、莫呼洛伽、鳩畔荼、彌荔多、畢舍遮、布怛那、羯吒布怛那、人、非人等，於四聖諦皆得明解，三轉十二行相法輪。",
        "translation": "In order to cause all the seeds of the Three Treasures to be uninterrupted, he turns the Dharma wheel, beats the Dharma bell and drum, and the sound of the wonderful Dharma pervades the three realms, causing gods, dragons, yakṣas, rājas, asuras, garuḍas, khadhāras, mahoragas, kumbhāṇḍas, mṛta, piśācīs, pūtanas, kāṭapūtanas, humans, nonhumans, and so forth to attain insight about the four noble truths and turn the Dharma wheel three times with 12 defining activities.",
        "source": "T13n0411_002:0729c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世間所有沙門，若婆羅門、諸天、魔、梵、人、非人等，所不能轉。",
        "translation": "All the ascetics of the world, such as brāhmaṇas, gods, Māra, Brahmā, humans, and nonhumans, are unable to turn it.",
        "source": "T13n0411_002:0729c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲利益、安樂世間無量天人，令得殊勝廣大義利，昔所未轉，而今轉之。』",
        "translation": "They want to benefit and comfort measureless gods and humans in the world and cause them to attain excellent and vast benefits that hadn't been turned in the past but are now turning it.'",
        "source": "T13n0411_002:0729c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0729c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第一佛輪。",
        "translation": "\"I've become the first buddha-wheel in this way.",
        "source": "T13n0411_002:0729c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此輪故，如實了知此世、他世、是處、非處，得安隱住、得無驚恐、得無所畏，降諸天魔、外道、邪論，轉大梵輪成大梵行。",
        "translation": "Because of this wheel, I truly know this world, other worlds, and right and wrong places, attain peaceful abiding, become fearless, and become fearless, subdue demons, non-Buddhists, and mistaken beliefs, and turn the great brahma wheel into the great brahma practice.",
        "source": "T13n0411_002:0729c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我應住此雜染世界，五濁惡時，處大眾中正師子吼。",
        "translation": "I should live in this defiled world when the five turbidities are bad and be in the midst of a great multitude when the lion's roar is correct.",
        "source": "T13n0411_002:0729c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅諸有情五無間業，廣說乃至諸不善根，摧滅一切諸眾生類堅如金剛相續煩惱，建立一切永盡諸漏解脫妙果，隨其所樂，安置一切有力眾生，令住三乘不退轉位。",
        "translation": "He'll extinguish the five kinds of unremitting activity in sentient beings, explain in detail even the unwholesome roots, destroy the continuous afflictions of all sentient beings who are resolute as adamant, establish the wonderful fruit of liberation that permanently ends all contaminants, and place all powerful sentient beings in the irreversible position of the three vehicles according to their desires.",
        "source": "T13n0411_002:0729c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0729c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王初登王位，受帝職已，觀察過去、未來、現在諸王法道，於其種種王業輪中，以善觀察因果報智，隨其所應，建立一切輔臣、僚佐，普及國邑愚智人民三種業輪。",
        "translation": "Suppose the Kātyāyana consecrated great king first ascends to the throne, then after assuming the position of emperor, he observes the past, future, and present paths of the kings, and within those various karmic circles of karma, he uses his knowledge of the effects of cause and effect to establish, as he sees fit, all of his ministers and assistants and to popularize the three kinds of karmic circles of the country's stupid and wise people.",
        "source": "T13n0411_002:0729c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此業輪，率土眾生長夜受用。",
        "translation": "From these wheels of karma, they lead the people of the land into long-term enjoyment.",
        "source": "T13n0411_002:0730a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有種種適意資具、喜樂增長，能滅一切怨敵、惡友。",
        "translation": "It provides various desirable necessities and produces joy and happiness, and it's able to extinguish all enemies and bad friends.",
        "source": "T13n0411_002:0730a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為三種業輪？",
        "translation": "What are the three kinds of wheels of karma?",
        "source": "T13n0411_002:0730a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、建立帝王業輪，謂善教習軍陣鬪戰，降他兵眾，撫育人民。",
        "translation": "1. the wheel of activity that builds emperors and kings, which is to teach well about fighting in battle, subduing other soldiers, and nurturing the people.",
        "source": "T13n0411_002:0730a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、建立田宅業輪，謂善教習造舍營農，令得安隱，飲食充足。",
        "translation": "2. the wheel of activity that builds farming, which is to teach and train well the building of dwellings and farms, so that they may be made comfortable and have enough to eat.",
        "source": "T13n0411_002:0730a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、建立財寶業輪，謂善教習工商雜藝，令得種種珍玩資財，隨意受用，增諸快樂。",
        "translation": "Third, it's the wheel of activity that builds wealth and treasure, which is to teach and cultivate commerce, industry, and miscellaneous arts well, so that they can acquire various treasures and possessions, enjoy them as they like, and increase their happiness.",
        "source": "T13n0411_002:0730a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0730a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王，成就如是第二王輪。",
        "translation": "\"The great king of the consecration of the Kārttiari line accomplishes this second royal wheel.",
        "source": "T13n0411_002:0730a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此輪故，於自國土得安樂住，能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "Because of this wheel, he'll live in comfort in his own land, subdue all enemies and bad friends, and guard his body well so that his life will increase.",
        "source": "T13n0411_002:0730a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0730a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，初成佛果，得無上智，觀察過去、未來、現在諸佛法眼。",
        "translation": "Thus, the Tathāgata, when he first became a buddha, attained unsurpassed knowledge and observed the past, future, and present Dharma eyes of the buddhas.",
        "source": "T13n0411_002:0730a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以善觀察，諸業法受因果報智，建立一切所化有情三種業輪。",
        "translation": "With the wisdom to well observe the causal consequences of karma and dharmas, he establishes the three kinds of karmic circles of all the sentient beings he transforms.",
        "source": "T13n0411_002:0730a16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此業輪，能令三寶、種姓、法眼長夜不滅，無上正法熾盛流通。",
        "translation": "From these karmic wheels, they cause the Three Treasures, lineages, and Dharma eyes to never cease overnight, and the unsurpassed true teaching to flourish and circulate.",
        "source": "T13n0411_002:0730a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令諸有情，長受種種生天涅槃安隱快樂，及令一切外道邪論不能降伏我正法眼，而能如法摧彼邪論。",
        "translation": "It causes sentient beings to experience the long-lasting peace and happiness of various kinds of birth in heaven and nirvāṇa, and it causes all the heretical theories of non-Buddhists to be unable to subdue my right eye for the Dharma and to destroy their heretical theories according to the Dharma.",
        "source": "T13n0411_002:0730a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0730a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為三種業輪？",
        "translation": "What are the three kinds of karmic wheels?",
        "source": "T13n0411_002:0730a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、建立修定業輪。",
        "translation": "1. establishes the karmic wheel of cultivation and concentration.",
        "source": "T13n0411_002:0730a22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、建立習誦業輪。",
        "translation": "2. establishes the wheel of karma for practicing recitation ...",
        "source": "T13n0411_002:0730a22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、建立營福業輪。",
        "translation": "Three, it establishes the wheel of karma for cultivating merit.",
        "source": "T13n0411_002:0730a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0730a23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來修定業輪？",
        "translation": "\"How does the Tathāgata cultivate the wheel of determined karma?",
        "source": "T13n0411_002:0730a23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "定有十種。",
        "translation": "There are definitely ten kinds.",
        "source": "T13n0411_002:0730a24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0411_002:0730a24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂正觀察諸有識身六種境界，我、我所執以為其因，業為良田，無明覆蓋，愛為滋潤，無有自在，依他而立繫屬眾緣。",
        "translation": "It's the correct observation of the six objects of the body of consciousness, which are caused by the attachment to self and what's mine, have good karma, are covered by ignorance, are nourished by craving, have no freedom, and are contingent on others for their tethers.",
        "source": "T13n0411_002:0730a24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲斷滅，業、煩惱、苦三種流故，如是觀察，云何業流？",
        "translation": "In order to stop the three streams of action, affliction, and suffering, what are the streams of action when observed in this way?",
        "source": "T13n0411_002:0730a27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸有情所行諸行。",
        "translation": "\"These are the various actions that sentient beings perform.",
        "source": "T13n0411_002:0730a28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若此諸行，所由無明及愛為因，能生諸有，名煩惱流。",
        "translation": "If these conditioned activities, which are caused by ignorance and craving, can give rise to existence, they're called the stream of affliction.",
        "source": "T13n0411_002:0730a29_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由煩惱，識為其因，眾緣和合，名色生起。",
        "translation": "If the afflictions are the cause, consciousness is their cause, and name and form arise when the various conditions combine.",
        "source": "T13n0411_002:0730b01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名色為因，眾緣和合，六處生起。",
        "translation": "When name-and-form is the cause, the six sense-fields arise from the confluence of many conditions.",
        "source": "T13n0411_002:0730b02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六處為因，眾緣和合，觸受後有，生、老死等次第生起，是名苦流。",
        "translation": "When the six sense-fields are the cause and the combination of causes and conditions brings about subsequent existence by contact and sensation, birth, old age, and death arise in sequence, which is called the stream of suffering.",
        "source": "T13n0411_002:0730b03_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三流，業為良田，無明為因，愛為滋潤，而得生長。",
        "translation": "Thus, these three streams grow with karma as a fertile ground, ignorance as a cause, and craving as nourishment.",
        "source": "T13n0411_002:0730b04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲枯涸，業為良田，無明為因，愛為滋潤，三種流故，於五取蘊，觀為無常及苦、無我，愚鈍無動，如幻、如焰、如水中月、如夢所見，空無所有、無相、無願、無所造作、無生、無起、無出、無像、寂靜遠離、無所出生。",
        "translation": "Because desire dries up, actions are a good field, ignorance is the cause, and love nourishes these three streams, the five appropriated aggregates are observed to be impermanent, painful, and without self, dull and unmoving, illusory, flaming, like the moon in water, and like what's seen in a dream, empty, without existence, without marks, without wish, without creation, without arising, without emanation, without appearance, quiescent and free, and without birth.",
        "source": "T13n0411_002:0730b05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於五取蘊如是觀察，能順空忍、順無相忍、順無願忍。",
        "translation": "Thus observing the five appropriated aggregates, they can conform to the tolerance of emptiness, conform to the tolerance of signlessness, and conform to the tolerance of wishlessness.",
        "source": "T13n0411_002:0730b10_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲隨順，觀五取蘊，復方便修入出息觀，即是修習，持來去念。",
        "translation": "In order to conform, observe the five appropriated aggregates and then skillfully cultivate the contemplation of entering and exiting, which is to cultivate and maintain mindfulness of coming and going.",
        "source": "T13n0411_002:0730b11_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何由念如實觀察入息、出息？",
        "translation": "\"How are inhaling and exhaling truly observed through mindfulness?",
        "source": "T13n0411_002:0730b13_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂正觀察，數故、隨故、止故、觀故、轉故、淨故。",
        "translation": "It's correctly observed as being numerical, consequential, calming, observing, transforming, and purifying.",
        "source": "T13n0411_002:0730b14_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知此中，數能造作二種事業：一、能為依伏諸尋伺，二、能取於入出息相。",
        "translation": "You should know that, of these, the number creates two kinds of actions: 1. that they subdue discursive searches for support, and 2. that they grasp the aspects of entering, exiting, and breathing.",
        "source": "T13n0411_002:0730b15_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨能造作二種事業：一、依出離捨諸尋伺，二、能善取入出息相。",
        "translation": "Accordingly, it creates two kinds of actions: 1. that which depends on escape and free from discursive inquiry, and 2. that which is well-acquired in the aspect of inhaling and exhaling.",
        "source": "T13n0411_002:0730b16_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止能造作二種事業：一、能示現入出息滅，二、能安住勝三摩地。",
        "translation": "Cessation creates two kinds of actions: 1. the ability to manifest the cessation of breathing in and out, and 2. the ability to abide in superior samādhi.",
        "source": "T13n0411_002:0730b18_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀能造作二種事業：一、能示現入出息盡，二、能安住心及心法別異觀察。",
        "translation": "Observation creates two kinds of tasks: 1. it shows the cessation of breathing in and out, and 2. it's a way to abide in the mind and the discriminating observation of mind and mental factors.",
        "source": "T13n0411_002:0730b19_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉能造作二種事業：一、能方便捨諸取蘊，二、能方便趣入聖地。",
        "translation": "Transformation creates two kinds of works: 1. it's a method of abandoning the appropriated aggregates and 2. it's a method of entering the noble stages.",
        "source": "T13n0411_002:0730b21_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨能造作二種事業：一、能捨結，二、能淨見。",
        "translation": "Being pure creates two kinds of works: 1. the ability to abandon fetters, and 2. the ability to purify views.",
        "source": "T13n0411_002:0730b22_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是六種方便修習入出息觀，便能隨順觀五取蘊。",
        "translation": "By cultivating the contemplation of entering and exiting breath in these six ways, they'll be able to observe the five appropriated aggregates in a compliant way.",
        "source": "T13n0411_002:0730b23_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_002:0730b25_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是入息、出息自性，名色取蘊。",
        "translation": "Thus, the own-nature of inhaling and exhaling is called the aggregate of form-taking.",
        "source": "T13n0411_002:0730b25_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是入息、出息領納，名受取蘊。",
        "translation": "Thus, the apprehension of income and exhale is called the appropriation aggregate of feeling.",
        "source": "T13n0411_002:0730b26_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是入息、出息取相，名想取蘊。",
        "translation": "Thus, the taking of form by inhaling and exhaling is called the aggregate of apprehension of perception.",
        "source": "T13n0411_002:0730b26_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是入息、出息造作，名行取蘊。",
        "translation": "thus inhaling and exhaling and creating, which is called the aggregate of appropriation of volition.",
        "source": "T13n0411_002:0730b27_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是入息、出息了別，名識取蘊。",
        "translation": "Thus, the discernment of income and exhale is called the aggregate of grasping by consciousness.",
        "source": "T13n0411_002:0730b28_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說五種取蘊，各各別異，互不相似，新新非故，無住、無積、不可言說。",
        "translation": "The five grasping aggregates thus described are each distinct, dissimilar, new, and non-existent, lacking abiding, lacking accumulation, and inexpressible.",
        "source": "T13n0411_002:0730b29_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀察五種取蘊，能除三行。",
        "translation": "Observing the five grasping aggregates in this way removes three practices.",
        "source": "T13n0411_002:0730c01_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若能如是究竟隨觀三種行盡，便能於此諸有識身六種境界，究竟隨觀我、我所執，於無明、愛因田覆潤一切皆盡。",
        "translation": "\"If he can thus completely observe the end of the three kinds of actions, he'll be able to completely observe the six realms of the body of consciousness and completely observe the attachment to self and what belongs to self, which completely end ignorance and the causal overlay of the field of craving.",
        "source": "T13n0411_002:0730c02_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是修習四種念住，皆得圓滿。",
        "translation": "Cultivating the four bases of mindfulness in this way will lead to their fulfillment.",
        "source": "T13n0411_002:0730c05_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至修習八支聖道，皆得圓滿。",
        "translation": "Cultivating the eightfold noble path will lead to their fulfillment.",
        "source": "T13n0411_002:0730c05_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至，修習十八不共佛法，皆得圓滿。",
        "translation": "Thus and so forth, the cultivation of the 18 distinctive characteristics of the Buddha will all result in their consummation.",
        "source": "T13n0411_002:0730c06_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至，修一切種無生法忍，首楞伽摩三摩地等，皆得圓滿。",
        "translation": "Thus and so forth, the cultivation of all kinds of patient acceptance of the nonarising of things, the śūraṃgama-samādhi, and so forth are all brought to completion.",
        "source": "T13n0411_002:0730c07_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是修習持來去念入諸靜慮，名住正法勝義有情、名為真實修習靜慮、名為真實供養三世諸佛世尊、名一切佛心中之子從佛口生，是法所成，是法所化。",
        "translation": "Thus cultivating the maintenance of the mindfulness of coming and going into meditations is called abiding in the right Dharma for supreme beings, truly cultivating meditation, truly making offerings to the three worldly buddhas, and being called the son in the mind of all buddhas who arises from the Buddha's mouth, which is accomplished by this teaching and is created by this teaching.",
        "source": "T13n0411_002:0730c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，如是修習漸漸退轉，乃至漏盡成阿羅漢具六神通。",
        "translation": "Sometimes a bodhisattva thus cultivates gradual regression ... until the contaminants are ended and he becomes an arhat with the six supernormal powers.",
        "source": "T13n0411_002:0730c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，如是修習漸漸增長，功德圓滿成大菩薩，乃至十八不共佛法，一切種智修習圓滿，此人不久當得無上正等菩提。",
        "translation": "If there's a bodhisattva who thus cultivates gradual growth and consummates merit to become a great bodhisattva, up to the point where he cultivates the 18 distinctive characteristics of the Buddha and consummates all kinds of cognition, this person will soon attain unsurpassed correct perfect enlightenment.",
        "source": "T13n0411_002:0730c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0730c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以如是諸業法受因果報智，觀察三世諸佛法眼安立有情，於此十種修定業輪令其修習。",
        "translation": "With the knowledge that these karmic phenomena are the results of causation, I observe the Dharma-eye of the buddhas of the three times and establish sentient beings in these ten kinds of cultivation of the determined wheel of activity and cause them to cultivate it.",
        "source": "T13n0411_002:0730c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0730c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名如來修定業輪。",
        "translation": "This is called the tathāgata cultivating the wheel of determined action.",
        "source": "T13n0411_002:0730c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0730c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來習誦業輪？",
        "translation": "\"How does the Tathāgata practice the wheel of karma?",
        "source": "T13n0411_002:0730c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸苾芻、或苾芻尼、鄔波索迦、鄔波斯迦，或復淨信諸善男子、或善女人，善根微薄，依世俗諦，根機未熟。",
        "translation": "Suppose there are monks, nuns, upāsaka, or upāsikās, or even pure faithful men or women with weak good roots who rely on the conventional truth and whose faculties are not yet ripe.",
        "source": "T13n0411_002:0730c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當安置如是有情，令其習誦，初夜、後夜精勤無怠。",
        "translation": "I will place such sentient beings in a position to make them study and recite it, diligently and without laziness during the first and last nights.",
        "source": "T13n0411_002:0730c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情，求無上智，我當安置純淨大乘，令其自讀、或教他讀，令其自誦、或教他誦，令其自說、或教他說，於大乘中令其自習、或教他習，為令自身及他身中大煩惱眾皆除滅故；為令證得無上智故；為除一切有情苦故；為令趣入無畏城故。",
        "translation": "If sentient beings seek unsurpassed knowledge, I will place them in the pure great vehicle, cause them to read it by themselves or teach it to others, cause them to recite it by themselves or teach it to others, cause them to teach it by themselves or teach it to others, and cause them to practice it by themselves or teach it to others in the great vehicle in order to rid themselves and others of the great afflictions in their bodies, to realize unsurpassed knowledge, to remove the suffering of all sentient beings, and to enter the city of fearlessness.",
        "source": "T13n0411_002:0730c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情求緣覺乘，我當安置諸緣起法，令其習誦。",
        "translation": "If sentient beings pursue the vehicle of the pratyekabuddhas, I will place the teachings on dependent arising for them to memorize.",
        "source": "T13n0411_002:0731a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情求聲聞乘，我當安置百千文頌四阿笈摩、百千文頌毘奈耶藏、百千文頌阿毘達磨及毘婆沙，令其習誦。",
        "translation": "If sentient beings pursue the vehicle of the śrāvakas, I'll place 1,000 verses on the four āgamas, 1,000 verses on the Vinaya collection, and 1,000 verses on the abhidharma and vibhāṣā for them to study and recite.",
        "source": "T13n0411_002:0731a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0731a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名如來習誦業輪。",
        "translation": "This is called the tathāgata's wheel of karmic practice of chanting.",
        "source": "T13n0411_002:0731a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來營福業輪？",
        "translation": "\"How does the Tathāgata operate a wheel of meritorious activity?",
        "source": "T13n0411_002:0731a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸有情，根機愚鈍，未種善根，智慧微劣，懈怠失念，染著種種受用資具，遠離善友。",
        "translation": "It means there are sentient beings whose faculties are dull, who haven't yet cultivated good roots, whose wisdom is weak, who are lazy and lose mindfulness, who are defiled by various requisites for enjoyment, and who are far removed from good friends.",
        "source": "T13n0411_002:0731a06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當安置如是有情，使營福業，謂令修作佛、法、僧事，及親教師、軌範師事。",
        "translation": "I will place such sentient beings in positions to create beneficial karma, which is to say, to cultivate the service of buddhas, Dharma, and saṃgha, as well as the service of pro-teachers and role-modeling teachers.",
        "source": "T13n0411_002:0731a08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0731a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名如來營福業輪。",
        "translation": "This is called the Tathāgata's wheel of meritorious activity.",
        "source": "T13n0411_002:0731a10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731a10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第二佛輪。",
        "translation": "\"I've become the second buddha-wheel in this way.",
        "source": "T13n0411_002:0731a10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此輪故，以其無上三世業智，如實了知一切有情，諸業法受因及果報。",
        "translation": "Because of this wheel, my unsurpassed knowledge of the three karmic activities truly understands the causes and effects of the karma of all sentient beings.",
        "source": "T13n0411_002:0731a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，立三業輪，成熟一切所化有情，得安隱住、得無驚恐、得無所畏、摧諸天魔、外道、邪論，轉大梵輪成大梵行，如實了知眾生因報。",
        "translation": "According to their desires, they establish the three wheels of karma, ripen all the sentient beings they create, attain peaceful abiding, become fearless, become fearless, destroy demons, non-Buddhists, and mistaken beliefs, turn the great brahma wheel into the great brahma practice, and truly know the causes and consequences of sentient beings.",
        "source": "T13n0411_002:0731a13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，成善巧智，觀察一切沙門、婆羅門、剎帝利、茷舍、戍達羅等，種種功德、多聞、勇健、工巧伎藝。",
        "translation": "\"Suppose the great king of the bodhisattva consecration accomplishes skillful knowledge and observes all the ascetics, brāhmaṇas, bhadras, kṣatriyas, śūdras, and so forth, their various virtues, their learning, their courage, and their skillful techniques.",
        "source": "T13n0411_002:0731a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生富有功德，成巧便智，精進、勇猛、堅固不退，種種福德而自莊嚴，此剎帝利灌頂大王隨彼所應，給施珍寶、財穀、田宅、奴婢、僕使。",
        "translation": "If sentient beings are rich in virtue, have developed skilful wisdom, are diligent, courageous, resolute, and don't retreat, and adorn themselves with various merits, the great king of the bhadra consecration will give them whatever they desire, including treasures, provisions, land and homes, servants, and menials.",
        "source": "T13n0411_002:0731a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於自國土，若諸眾生德藝輕微，功業尠薄，此剎帝利灌頂大王隨彼所應，微加賑恤。",
        "translation": "If the virtues of sentient beings in his land are slight and their works are weak, the great King Bactria consecrated by this bodhisattva will offer modest compassion as he sees fit.",
        "source": "T13n0411_002:0731a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於自國土，若諸眾生功德薄劣，少於精進，懈怠懶惰，忘失正念，無慈悲心，不知恩報，於後世苦不見怖畏，沒居家泥，積諸惡行，此剎帝利灌頂大王隨彼所應，種種讁罰，或以言教、苦切、呵責，或奪種種珍寶、資財，或奪受用如意、產業，或罰鞭杖、或禁牢獄、或斷支節、或斬身首，如是無量隨應讁罰。",
        "translation": "If sentient beings in their own land have weak virtues, little effort, are lazy, forget correct mindfulness, lack compassion, don't know the rewards of kindness, don't see and fear suffering in later lifetimes, go into the mire of their homes, and accumulate bad deeds, the great king consecrated by this bhadrika will punish them in various ways as he sees fit, whether by verbal instruction, bitter persecution, chastisement, the taking of various treasures and possessions, the taking of enjoyment wishes and property, punishment with a whip, imprisonment, the severing of limbs, the cutting off of their heads, or a myriad of such appropriate punishments.",
        "source": "T13n0411_002:0731a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0731b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王成就如是第三王輪，由此輪故，令自國土增長安樂，能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "Thus has the great king of the Kārttiari consecration accomplished the third royal wheel, which causes his land to grow in well-being, subdues all enemies and bad friends, guards his body well, and increases his life expectancy.",
        "source": "T13n0411_002:0731b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，成就善巧，知根機智。",
        "translation": "\"Thus, the Tathāgata has accomplished skillful, organic knowledge of the faculties.",
        "source": "T13n0411_002:0731b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸弟子，遠離福慧巧方便智，及以布施、調伏、寂靜，失念心亂，來至我所，歸依於我，而我善知彼根意樂，隨眠勝解。",
        "translation": "If disciples who are free of the knowledge of skillful means of merit, wisdom, generosity, restraint, and tranquility lose their mindfulness and become distracted, come to me and rely on me, and I well know their faculties, aspirations, and resolve to dwell accordingly, then I'll explain the punishing vaiñayas as appropriate.",
        "source": "T13n0411_002:0731b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，為說治罰毘奈耶法。",
        "translation": "According to their capacities, I'll explain the vinaya method of punishment.",
        "source": "T13n0411_002:0731b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生其性佷戾，於諸學處不能奉持，為令久住我之聖教多有所作，或為制立憶念治罰、或以言教恐怖呵責、或暫驅擯、或令折伏歸誠禮拜、或不與語不共同利、或如草布、或復滅擯。",
        "translation": "If sentient beings are so perverse in nature that they can't adhere to their places of training, they often do things to make my noble teaching last, whether by establishing mindfulness as a punishment, teaching terror with words, rebuking, temporarily expelling, subduing, returning to sincerity, venerating, not sharing words, not sharing benefits, spreading grass, or extinguishing.",
        "source": "T13n0411_002:0731b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以妙智，知諸有情補特伽羅根機、意樂、隨眠、勝解，如應讁罰，為令皆破廣大積聚無義黑闇枯竭煩惱諸瀑流故、令得生天涅槃樂故、為行惡道補特伽羅得調伏故、隨其所應，說治罰法。",
        "translation": "With subtle knowledge, I know the faculties, abilities, aspirations, latencies, and resolve of individual human beings and punish them as they deserve in order to break down the vast accumulation of meaningless darkness and dried-up afflictions and waterfalls, to make them attain the joy of birth in heaven and the nirvāṇa, and to bring restraint to individual human beings who are engaged in bad paths, and I explain the methods of punishment as they arise.",
        "source": "T13n0411_002:0731b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀察黑說大說差別，隨其所應，授與治罰行惡道法。",
        "translation": "He observes the distinctions between what's said in black and what's said in large, and he gives them the methods of punishment and restraint for those who practice the evil path as they see fit.",
        "source": "T13n0411_002:0731b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以妙智，知諸有情，具足成就，增上信敬，純淨意樂。",
        "translation": "With subtle knowledge, I know that all sentient beings are fully accomplished, have increased faith and respect, and have pure intentions.",
        "source": "T13n0411_002:0731b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，為說種種善品差別，令其修學，乃至令彼一切善根，皆得圓滿，入無畏城。",
        "translation": "According to their capacities, I'll explain various kinds of distinctions in good qualities for them to cultivate, so that all their good roots will be perfected and they'll enter the city of fearlessness.",
        "source": "T13n0411_002:0731b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第三佛輪，由此輪故，知諸有情補特伽羅種種根機、意樂、隨眠，及與勝解諸業法受。",
        "translation": "I have thus completed the third buddha-wheel, and as a result of that wheel, I know the various faculties, aspirations, and latencies of sentient beings in the pudgala and the karmic and Dharma sensations that come with excellent understanding.",
        "source": "T13n0411_002:0731b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，利益安樂，得安隱住、得無驚恐、得無所畏。",
        "translation": "According to their desires, they are benefited and made comfortable, attaining peaceful abiding, fearlessness, and fearlessness.",
        "source": "T13n0411_002:0731b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "He claims to be in the position of a great sage, turning the Buddha's wheel, destroying demons, non-Buddhists, and mistaken beliefs, and correctly addressing the lion's roar among the masses.",
        "source": "T13n0411_002:0731b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，知自國土，有無量有情補特伽羅，歸依種種邪神外道，起於邪信及起邪見，學邪禁戒、執著修治邪吉凶相，具受種種無利益苦。",
        "translation": "\"Suppose the great king Kārttivādin knows that in his own land there are measureless sentient beings in the pudgala who have turned to various mistaken spirits and heretics, developed mistaken beliefs and mistaken views, studied mistaken prohibitions and precepts, and clung to cultivating mistaken fortune and ill fortune, and suffered various kinds of fruitlessness.",
        "source": "T13n0411_002:0731b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王知已，數數召集，以其先王治國正法，開悟示現，教習誡勅，令其捨除、倒信倒見，修學先王，正直舊法。",
        "translation": "Knowing this, the king repeatedly summons his predecessor to rule his country correctly, enlightens and shows him, teaches and admonishes him, causing him to abandon mistaken belief and mistaken views and train in the old, correct ways of his predecessor.",
        "source": "T13n0411_002:0731c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令自國土一切有情，一趣、一歸、一意、一欲、一切和合，同依先王正法，而轉聽受詔命隨順奉行，率土和同，作所應作。",
        "translation": "That way, all sentient beings in their own land, with one destination, one refuge, one intention, one desire, and all in harmony, will rely on the former king's right teaching, and they'll listen to and accept the imperial decree to follow and practice it, leading the land to be unified and doing what should be done.",
        "source": "T13n0411_002:0731c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時剎帝利灌頂大王，常與群臣數數集會，共味嘉餚，受諸快樂、嬉戲、遊行，不相猜貳，咸共疇咨理諸王務。",
        "translation": "At the time, the great king Kārttivādin always gathered with his ministers several times, sharing delicious foods, enjoying pleasures, playing, and processions, without any mutual suspicion, and consulting with them about the king's affairs.",
        "source": "T13n0411_002:0731c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王，成就如是第四王輪，由此輪故，令自國土增長安樂，能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "The great king of the consecration of the Kārttiari line accomplishes this fourth royal wheel, which causes his land to grow in well-being, subdues all enemies and bad friends, guards his body well, and increases his life expectancy.",
        "source": "T13n0411_002:0731c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，成就善巧，知勝解智。",
        "translation": "\"Thus, the Tathāgata has accomplished the skillful knowledge and understanding of superior understanding.",
        "source": "T13n0411_002:0731c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸世間種種邪歸、邪見、邪意、樂著邪法行、邪業行，由是因緣受無量苦。",
        "translation": "He sees the various ways in which the world has mistakenly believed, mistaken views, mistaken intentions, and the delightful attachment to the practice of mistaken things and the practice of mistaken actions, and as a result, he experiences measureless suffering.",
        "source": "T13n0411_002:0731c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來見已，數數召集於大眾前，以其過去諸佛世尊、三寶、種姓因果、六種波羅蜜多、瑜伽依因、三律儀等諸因果法，開悟示現，慶慰誡勅一切眾會。",
        "translation": "After he saw this, the Tathāgata summoned the great assembly several times and showed them the causes and effects of past buddhas, the Three Treasures, the causes and effects of lineage, the six perfections, the causes of yoga, the three rules, and so forth, to enlighten and comfort and admonish the entire assembly.",
        "source": "T13n0411_002:0731c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令其解脫諸顛倒見，建立正見，安置十善正直舊道，共諸有情數數同修，法隨法行，方便引攝因果等流。",
        "translation": "He causes them to be freed from mistaken views, establish right views, set out on the ten good and right old paths, repeatedly cultivate them with sentient beings, practice the Dharma according to the Dharma, and skillfully draw in the same stream of cause and effect.",
        "source": "T13n0411_002:0731c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸有情，四眾和合，同修一切殊勝善行，便共遊戲四種念住，於三摩地、解脫智見、諸道品中，歡娛受樂，為令聖教久住世故、紹三寶種不斷絕故，便共遊戲四正勤、四神足、五根、五力、七等覺支、八聖道支，於其種種勝三摩地、解脫智見、諸道品中，歡娛受樂。",
        "translation": "For the sake of sentient beings and the merging of the four groups, they'll cultivate together all the excellent good qualities, then they'll play together the four abodes of mindfulness, rejoice and be delighted in samādhi, views of liberation and the factors of the path, and play together the four correct endeavors, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight factors of the noble path in order to make the noble teaching long-lasting and to introduce the seeds of the Three Treasures that won't be cut off.",
        "source": "T13n0411_002:0731c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0731c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第四佛輪。",
        "translation": "I've become thus the fourth buddha-wheel.",
        "source": "T13n0411_002:0731c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此輪故，知諸有情補特伽羅種種勝解，歸趣意樂，諸業法受。",
        "translation": "Because of this wheel, I know the various ways in which sentient beings in the pudgala attain superior understanding, return to their aspirations, and experience the qualities of karma.",
        "source": "T13n0411_002:0731c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，利益安樂，得安隱住、得無驚恐、得無所畏。",
        "translation": "According to their desires, they are benefited and made comfortable, attaining a peaceful dwelling, becoming fearless, and attaining fearlessness.",
        "source": "T13n0411_002:0732a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "Proclaiming myself to be in the position of great sage, I turn the Buddha's wheel, destroy demons, non-Buddhists, and mistaken beliefs, and correctly address the lion's roar among the masses.",
        "source": "T13n0411_002:0732a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，知自國土或他國土，有無量有情補特伽羅，於自財色耽染無厭，於他財色貪求追愛。",
        "translation": "\"Suppose a great king consecrated by a Kārttiari knows that there are measureless sentient beings in his own land or in the lands of others who are addicted to and never tire of their own possessions and who crave the possessions of others.",
        "source": "T13n0411_002:0732a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便安置堅固城郭、村坊戍邏、國邑王宮，廣說乃至舍羅鸚鵡、防守眾具，令無損失。",
        "translation": "He then makes sure to place a sturdy city, a village fortress, a king's palace, and a wide range of precepts, such as the śāla parrot, and defensive gear, so that they don't lose anything.",
        "source": "T13n0411_002:0732a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0732a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王成就如是第五王輪，由此輪故，令自國土增長安樂，能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "Thus has the great king of the Kārttiari consecration accomplished the fifth royal wheel, which causes his land to grow in well-being, subdues all enemies and bad friends, guards his body well, and increases his life expectancy.",
        "source": "T13n0411_002:0732a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，成就善巧，知諸性智。",
        "translation": "\"Thus, the Tathāgata has accomplished the skillful knowledge of knowing natures.",
        "source": "T13n0411_002:0732a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知諸惡魔、及九十五眾邪外道，并餘無量眾魔外道所惑有情，於自財色耽染無厭、於他財色貪求追愛、於我自身及我徒眾深生憎嫉。",
        "translation": "He knows that the evil demons, the 95 wrong kinds of non-Buddhists, and countless other demons and non-Buddhists delude sentient beings who are addicted to their own possessions and form, crave the possessions of others, and become deeply resentful of himself and his disciples.",
        "source": "T13n0411_002:0732a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為害我故，假設珍饌雜以毒藥、闇置火坑偽敷床座，或推山石、或放狂象、拔劍追逐，散坌塵穢、謗行婬欲、毀是不男、或謂非人、或言幻化，以是諸惡而相誹毀。",
        "translation": "To harm me, they assemble a feast of delicacies mixed with poison, build a fire pit in the dark and pretend it's a seat, push a mountain or rock, set loose an elephant, draw a sword, chase after it, scatter dust, denigrate sexual desires, denigrate the unmanly, call it inhuman, or call it an illusion, and denigrate each other with these kinds of evils.",
        "source": "T13n0411_002:0732a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於佛、法、僧亦起無量種種誹謗、罵詈、毀辱。",
        "translation": "They also revile, ridicule, and disparage the Buddha, Dharma, and Saṃgha in countless ways.",
        "source": "T13n0411_002:0732a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我近住聲聞弟子，嫉妬因緣起諸毀謗。",
        "translation": "My close-staying śrāvaka disciples are jealous of the causes and conditions that give rise to these denigrations.",
        "source": "T13n0411_002:0732a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來知已，善守六根、依四梵住、具四辯才，為諸聲聞宣說法要，安立清淨三解脫門。",
        "translation": "After the Tathāgata knew this, he well guarded the six faculties, relied on the four abodes of purity, and possessed the four eloquence abilities to teach the essentials of the Dharma for the śrāvakas and establish the pure gate of the three liberations.",
        "source": "T13n0411_002:0732a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以如是世、出世間知諸性智，如實了知一切眾生種種無量諸性差別。",
        "translation": "With this knowledge of worldly and transmundane knowables, I truly understand the various and immeasurable distinctions in the natures of all sentient beings.",
        "source": "T13n0411_002:0732a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，為作饒益。",
        "translation": "I then work to benefit them as they see fit.",
        "source": "T13n0411_002:0732a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第五佛輪，由此輪故，以世、出世知諸性智，知諸有情補特伽羅種種無量諸性差別。",
        "translation": "\"Thus have I become the fifth buddha-wheel, and as a result of this wheel, I know the nature of all sentient beings with the knowledge of their worldly and transmundane natures, knowing the various and immeasurable distinctions in the nature of the pudgala.",
        "source": "T13n0411_002:0732a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，利益安樂，得安隱住、得無驚恐、得無所畏。",
        "translation": "According to their capacities, they are benefited and made comfortable, attaining peaceful abiding, fearlessness, and fearlessness.",
        "source": "T13n0411_002:0732a28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "Proclaiming myself to be in the position of a great sage, I turn the Buddha's wheel, destroy demons, non-Buddhists, and mistaken beliefs, and correctly address the lion's roar among the masses.",
        "source": "T13n0411_002:0732b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，安置一切堅固城郭、村坊戍邏、國邑王宮，廣說乃至舍羅鸚鵡、防守具已，處自宮中與諸眷屬、后妃、婇女而自圍遶，遊戲五欲種種樂具，放恣六根受諸喜樂。",
        "translation": "Suppose the great king Kārttivādin places all the strong cities, villages, garrisons, and royal palaces, explains it in detail up to the level of the śāla parrot, and provides for its defense, then goes to his palace and surrounds himself with his retinue, wives, and daughters, plays with the five pleasures and various implements, and indulges his six senses to experience joy and happiness.",
        "source": "T13n0411_002:0732b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0732b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王成就如是第六王輪，由此輪故，令自國土增長安樂，能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "Thus has the great king of the Kārttiari consecration accomplished the sixth royal wheel, which causes his own land to grow in well-being, subdues all enemies and bad friends, and guards his body well so that his life span increases.",
        "source": "T13n0411_002:0732b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，與諸菩薩摩訶薩眾及大聲聞，安置一切堅固聖教防守之事，即便現入最初靜慮，乃至現入第四靜慮，現入無邊虛空處定，廣說乃至現入非想非非想定，如是乃至現入一切佛所行定。",
        "translation": "Thus, the Tathāgata, along with the bodhisattvas, mahāsattvas, and great śrāvakas, places all the things that are firmly defended by the noble teaching, even as he enters into the first concentration, enters into the fourth concentration, enters into the concentration of the infinite space, explains in detail until he enters into the concentration of neither perception nor non-perception, and so on until he enters into the concentration of all the buddhas' activities.",
        "source": "T13n0411_002:0732b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入此定已，無量百千俱胝那庾多天龍、藥叉、羅剎、健達縛、阿素洛、揭路荼、緊捺洛、莫呼洛伽、彌荔多、畢舍遮、布怛那、羯吒布怛那等，於諸眾生常懷毒、惡、損害之心，無慈、無悲，於後世苦不見怖畏。",
        "translation": "After entering this concentration, measureless hundreds of thousands of gods, dragons, yakṣas, rājas, gandharvas, asuras, garuḍas, kiṃnara, mahoraga, preta, piśācī, pūtanā, and kāṭapūtanā always harbor poisonous, evil, and harmful thoughts toward sentient beings, lack kindness and compassion, and don't see fear in the suffering of later lifetimes.",
        "source": "T13n0411_002:0732b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼見我入於一切佛所行定，皆於我所生大歡喜，起淨信心於三寶中，皆生最勝歡喜淨信，尊重、恭敬得未曾有；於一切惡慚愧發露，深心悔過，誓願永斷。",
        "translation": "When they see me enter the meditation practiced by all the buddhas, they all become very happy with me, give rise to pure faith among the Three Treasures, become most delighted and pure in faith, respect and venerate them like never before, and reveal their conscience about all the evils, deeply repent, and vow to permanently end them.",
        "source": "T13n0411_002:0732b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，一剎那頃，無量無數諸煩惱障、業障、法障，皆得銷滅；無量無數福慧資糧，皆得成滿；背離生死趣向涅槃，護持如來無上正法。",
        "translation": "As a result, in a single moment, measureless and countless afflictive hindrances, karmic hindrances, and Dharma hindrances all cease, measureless and countless accumulations of merit and wisdom all become complete, they part with birth and death and head for nirvāṇa, and they safeguard the Tathāgata's unsurpassed true teaching.",
        "source": "T13n0411_002:0732b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第六佛輪，由此輪故，如來遊戲、靜慮、解脫、等持、等至，無量百千微妙深定，以淨智隨轉，滅諸有情無量煩惱。",
        "translation": "I've accomplished this sixth buddha-wheel, and as a result of that wheel, the Tathāgata's play, meditation, liberation, equipoise, and equipoise, as well as measureless hundreds of thousands of subtle and profound concentrations, are followed by pure knowledge that extinguishes measureless afflictions in sentient beings.",
        "source": "T13n0411_002:0732b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所應，利益安樂，得安隱住、得無驚恐、得無所畏。",
        "translation": "According to their desires, they are benefited and made comfortable, attaining a peaceful dwelling, becoming fearless, and attaining fearlessness.",
        "source": "T13n0411_002:0732b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "Proclaiming myself to be in the position of great sage, I turn the Buddha's wheel, destroy demons, non-Buddhists, and mistaken beliefs, and correctly address the masses with the lion's roar.",
        "source": "T13n0411_002:0732c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，與諸群臣領四兵眾，周巡觀察一切自國城邑、聚落、山川、谿澗、園苑、田澤、陂河、池沼、曠野、叢林、鎮邏等處。",
        "translation": "\"Suppose the great king Kārttivādin and his ministers lead a group of four soldiers around to observe all of his country's cities, towns, villages, mountains, rivers, streams, hills, gorges, gardens, fields, rivers, marshes, open fields, jungles, towns, and other places.",
        "source": "T13n0411_002:0732c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨彼所在，國界諸方，嶮阻多難、不任營理，有疑、有怖，堪容外境怨敵、惡友投竄藏伏。",
        "translation": "Wherever they are, their national boundaries and regions are dangerous, difficult, and unreliable, and there's doubt and fear, they can allow enemies and bad friends from outside the world to flee and hide.",
        "source": "T13n0411_002:0732c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此剎帝利灌頂大王，隨其力能，方便安置種種修理堅固防守，令彼諸方，平坦無難、堪任營理，無疑、無怖，遮其外境怨敵、惡友投竄藏伏。",
        "translation": "According to his ability, the great king of the Kārttivādin consecration skillfully places various repairs in a sturdy defense, making those places smooth and unobstructed, suitable for camping, without doubt or fear, and able to prevent external enemies and bad friends from fleeing and hiding.",
        "source": "T13n0411_002:0732c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安撫自國一切人民皆離眾苦，受諸快樂。",
        "translation": "He pacifies all the people of his country, ensuring that they are freed from suffering and experience happiness.",
        "source": "T13n0411_002:0732c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0732c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王成就如是第七王輪，由此輪故，令自國土增長安樂。",
        "translation": "Thus has the great king of the Kārttiari consecration accomplished the seventh royal wheel, which causes his own land to grow in well-being.",
        "source": "T13n0411_002:0732c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "He's able to subdue all enemies and bad friends, guard his body well, and increase his life expectancy.",
        "source": "T13n0411_002:0732c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0732c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，以其佛眼，如實了知，一切有情補特伽羅有貪、有瞋、有癡心等，如實了知是諸有情種種煩惱病行差別。",
        "translation": "\"Thus, the Tathāgata truly knows with the Buddha's eye that all sentient beings in the pudgala have craving, anger, deluded thought, and so forth, and he truly knows that these sentient beings have various distinctions in the way they act with their afflictive illnesses.",
        "source": "T13n0411_002:0732c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來知已，便起無量精進、勇猛、方便勢力，隨其所宜，授以種種修定妙藥，令諸有情精勤修學，除煩惱病。",
        "translation": "Knowing this, the Tathāgata then gives rise to measureless efforts, boldness, and the power of skillful means to bestow various wonderful medicines for cultivating concentration as appropriate, causing sentient beings to diligently cultivate them and remove the afflictive disorders.",
        "source": "T13n0411_002:0732c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情，宜修不淨除煩惱病，即便授以修不淨藥；若諸有情，宜修梵住除煩惱病，即便授以修梵住藥；若諸有情，宜修緣起除煩惱病，即便授以修緣起藥；若諸有情，宜修息念除煩惱病，即便授以修息念藥；若諸有情，宜可修於三解脫門除煩惱病，即便授以修於三種解脫門藥；若諸有情，宜修靜慮除煩惱病，即便授以修靜慮藥；若諸有情，宜修無色除煩惱病，即便授以修無色藥；若諸有情，乃至宜修首楞伽摩諸三摩地除煩惱病，即便授以首楞伽摩三摩地藥。",
        "translation": "若諸有情，宜修不淨除煩惱病，即便授以修不淨藥；若諸有情，宜修梵住除煩惱病，即便授以修梵住藥；若諸有情，宜修緣起除煩惱病，即便授以修緣起藥；若諸有情，宜修息念除煩惱病，即便授以修息念藥；若諸有情，宜可修於三解脫門除煩惱病，即便授以修於三種解脫門藥；若諸有情，宜修靜慮除煩惱病，即便授以修靜慮藥；若諸有情，宜修無色除煩惱病，即便授以修無色藥；若諸有情，乃至宜修首楞伽摩諸三摩地除煩惱病，即便授以首楞伽摩三摩地藥。",
        "source": "T13n0411_002:0732c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以如來授諸有情如是法藥，不令一切所化有情，為四魔怨之所繫攝。",
        "translation": "Therefore, the Tathāgata grants such medicine to sentient beings so that they won't be tied up by the four Māra-enemies.",
        "source": "T13n0411_002:0733a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不令一切所化有情，背人、天乘，向諸惡趣。",
        "translation": "It doesn't cause all the sentient beings it creates to depart from the human and heavenly vehicles and head for the bad destinies.",
        "source": "T13n0411_002:0733a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不令如來無上法眼、三寶種姓速疾壞滅。",
        "translation": "It won't cause the Tathāgata's unsurpassed Dharma eye and the Three Treasures' family to quickly perish.",
        "source": "T13n0411_002:0733a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是如來授諸有情，如是法藥。",
        "translation": "Thus, the Tathāgata gives sentient beings this kind of Dharma medicine.",
        "source": "T13n0411_002:0733a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0733a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第七佛輪，由此輪故，以其無上遍行行智，授諸眾生種種法藥，令勤修學除煩惱病，得安隱住、得無驚恐、得無所畏。",
        "translation": "I have thus accomplished the seventh buddha-wheel, and as a result of that wheel, I use my unsurpassed knowledge of the gamut of actions and practices to give sentient beings various medicines, cause them to diligently train to remove the disease of affliction, and attain peaceful abiding, fearlessness, and fearlessness.",
        "source": "T13n0411_002:0733a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "He claims to be in the position of a great sage, turning the Buddha's wheel, destroying demons, non-Buddhists, and mistaken beliefs, and correctly addressing the lion's roar among the masses.",
        "source": "T13n0411_002:0733a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0733a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，憶念自他本昔種姓，初生童子嬉戲等事。",
        "translation": "\"Suppose a great king consecrated by a kṣatriya recalls his own past lineage and how he was first born a child who played and so forth.",
        "source": "T13n0411_002:0733a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂憶自他於如是處，初生沐浴、懷抱、乳哺、按摩支節，乃至戲笑、或弄灰土、或與侍從種種遨遊、或習伎藝、或復修營種種事業、或遊他國夙夜栖泊、或奉事王、或理王務、或為太子、或登王位，得大自在，受諸快樂，廣大名稱遍諸方維。",
        "translation": "That is, it's remembering how he himself was first born, was bathed, carried, nursed, massaged, laughed, made dust, roamed with his attendants, practiced tricks, further cultivated various occupations, traveled to other countries, stayed at home long after midnight, served the king, managed the king's affairs, became a prince, or ascended to the king's throne, attained great freedom, enjoyed many pleasures, and was widely known throughout the world.",
        "source": "T13n0411_002:0733a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念是事已，安立先王所遵正法，撫育一切國土人民，守護自國不侵他境。",
        "translation": "After remembering this, they establish the right principles followed by their predecessors, nurture the people of all their lands, and guard their own country from invading others.",
        "source": "T13n0411_002:0733a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0733a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王成就如是第八王輪，由此輪故，令自國土增長安樂。",
        "translation": "Thus has the great king of the Kārttiari consecration accomplished the eighth royal wheel, which causes his own land to grow in well-being.",
        "source": "T13n0411_002:0733a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "He's able to subdue all enemies and bad friends, guard his body well, and increase his life expectancy.",
        "source": "T13n0411_002:0733a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0733a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，處大眾會，憶念自他宿世所經無量種事。",
        "translation": "Thus, the Tathāgata, when present in a large assembly, recalls measureless events from past lives of self and others.",
        "source": "T13n0411_002:0733a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂憶一生、或二、或三，乃至無量百千生事，或憶成劫、或憶壞劫、或憶無量、成劫壞劫，曾於過去，住如是處、如是名字、如是種姓、如是種類、如是飲食、如是領納苦受樂受、如是壽量、如是久住、如是極於壽量邊際，從彼處沒來生此間，復從此沒往生彼處。",
        "translation": "That is, it's recalling a lifetime, or two, or three, or measureless hundreds of thousands of events, or eons of formation, eons of decay, or measureless eons of formation and decay, in which he once lived in the past, such as this place, such names, such castes, such kinds, such foods, such acceptance of painful feelings, such pleasant feelings, such a lifespan, such a long abiding, and such an extreme of a lifespan, from which he was sunken into this world and from which he was sunken into another world.",
        "source": "T13n0411_002:0733a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憶念宿世如是等事，無量無邊，隨諸眾生根性差別，建立正法為作饒益。",
        "translation": "Remembering that such things in prior lives are numberless and limitless, he establishes the right teaching for the benefit of sentient beings according to their differences in nature.",
        "source": "T13n0411_002:0733b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0733b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第八佛輪，由此輪故，利益安樂無量有情，得安隱住、得無驚恐、得無所畏。",
        "translation": "I have thus accomplished the eighth buddha-wheel, and as a result of that wheel, I've benefited and comforted measureless sentient beings, attaining a peaceful dwelling, becoming fearless, and attaining fearlessness.",
        "source": "T13n0411_002:0733b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "Claiming to be in the position of a great sage, I turn the Buddha's wheel, destroy demons, non-Buddhists, and mistaken beliefs, and correctly address the lion's roar among the masses.",
        "source": "T13n0411_002:0733b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0733b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，隨念觀察自國有情、種姓、伎藝及諸事業，死此生彼，因果勝劣差別不同。",
        "translation": "\"Suppose the great king of the Kārttika consecration mindfully observes the differences in causes and effects between the sentient beings of his country who die here and are born there, and the superiority and inferiority of those causes and effects.",
        "source": "T13n0411_002:0733b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知彼有情生如是家，其身勇健、或復怯弱，於諸伎藝已學、未學，所有事業善作、惡作，富貴、貧賤、端正、醜陋。",
        "translation": "He knows that those sentient beings are born in such homes, whether they're strong or weak, whether they've learned or not learned the arts, whether their undertakings are good or bad, and whether they're rich or poor, upright or ugly.",
        "source": "T13n0411_002:0733b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等類乃至命終，或有自業未盡而死、或有自業已盡而死、或犯王法刑戮而死、或有遞相殘害而死、或因鞭杖捶楚而死、或因囹圄幽縶而死、或因習學伎藝而死、或因戰陣傷殺而死、或因鬪諍毆擊而死、或因財寶貪悋而死、或因色欲耽湎而死、或因忿恨結憤而死、或因勞倦頓弊而死、或因飢渴乏絕而死、或有過死、或無過死、或耆年死、或壯年死、或幼年死、或作種種善業而死、或作種種惡業而死。",
        "translation": "Such people may die before their lives are up, or they may die after their activities have ended, or they may die after violating the king's laws and punishments, or they may die from the passing of cruelty, or they may die from being whipped and beaten, or they may die in prison or in seclusion, or they may die from learning the arts, or they may die from being wounded and killed in battle, or they may die from fighting and assault, or they may die from craving for possessions, or from indulgence in sexual desires, or they may die from anger and rage, or they may die from exhaustion and fatigue, or they may die from hunger and thirst, or they may die with or without faults, or they may die in old age, or in the prime of life, or in their youth, or they may die from performing various good actions, or they may die from performing various bad actions.",
        "source": "T13n0411_002:0733b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知諸有情，行善行者，身壞命終當往善趣。",
        "translation": "They know that sentient beings who do good actions will go to a good destiny when their bodies break up and their lives end.",
        "source": "T13n0411_002:0733b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知諸有情，行惡行者，身壞命終當往惡趣。",
        "translation": "They know that sentient beings who do bad actions will go to a bad destiny when their bodies break up and their lives end.",
        "source": "T13n0411_002:0733b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知是事已，復自思惟：『我當正勤修身善行、修語善行、修意善行；我當施設種種方便、修行、布施、調伏、寂靜；身壞命終，當往善趣，勿墮惡趣。』",
        "translation": "After knowing this, he then thinks to himself, 'I will correctly and diligently cultivate good physical conduct, good verbal conduct, and good mental conduct; I will devise various methods, practices, generosity, moderation, and tranquility; and when my body breaks up and my life ends, I will go to a good destiny and not fall into a bad destiny.'",
        "source": "T13n0411_002:0733b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「此剎帝利灌頂大王，思惟是已，勇猛、精進，修身、語、意三種善行；常行布施，一切所有飲食、衣服、象馬騎乘、臥具、醫藥、房舍、燈明，及餘資具、奴婢、僮僕、種種珍財頭目、手足，乃至身命無所悋惜；及離殺生、離不與取、離欲邪行、離虛誑語、離麁惡語、離離間語、離雜穢語、離諸貪欲、離諸瞋恚、離諸邪見。",
        "translation": "\"After he considered this, the great king of the Kārttika consecration energetically and vigorously cultivated the three good qualities of body, speech, and thought; he always made alms of all food, clothing, elephant and horse riding, bedding, medicine, housing, lighting, and other necessities, slaves, servants, various valuables, heads, eyes, hands, and feet, and even his body and life; he parted with killing, parted with taking what wasn't given, parted with desiring wrong behavior, parted with false speech, parted with harsh speech, parted with indirect speech, parted with defiled speech, parted with craving, parted with anger, and parted with mistaken views.",
        "source": "T13n0411_002:0733b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，此剎帝利灌頂大王，當獲十種功德勝利。",
        "translation": "Because of these reasons, this great king of the Zetri consecration will attain ten kinds of merits and victories.",
        "source": "T13n0411_002:0733c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T13n0411_002:0733c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、具大名稱，二者、具大財寶，三者、具妙色相，四者、具多眷屬，五者、少病少惱，六者、朋友眷屬聰慧多聞，七者、正至正行親近供養，八者、廣美聲譽流振十方，九者、大威德天神常隨衛護，十者、身壞命終當生天上，常居善趣安樂國土。",
        "translation": "1. great renown, 2. great wealth, 3. marvelous appearance, 4. many dependents, 5. few illnesses and few afflictions, 6. friends and dependents who are intelligent and well-versed, 7. right attainment and right conduct who are close and supportive, 8. a reputation for beauty that spreads throughout the ten directions, 9. a god of great authority who always guards and protects, and 10. when his body breaks up and his life ends, he'll be born up in heaven and always reside in a land of well-being and happiness.",
        "source": "T13n0411_002:0733c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0733c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王成就如是第九王輪，由此輪故，令自國土增長安樂。",
        "translation": "Thus has the great king of the Kārttiari consecration accomplished the ninth royal wheel, which causes his own land to grow in well-being.",
        "source": "T13n0411_002:0733c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能伏一切怨敵、惡友，善守護身，令增壽命。",
        "translation": "He's able to subdue all enemies and bad friends, guard his body well, and increase his life expectancy.",
        "source": "T13n0411_002:0733c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0733c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，如實了知一切有情死生等事。",
        "translation": "\"Thus, the Tathāgata truly knows such things as the death and birth of all sentient beings.",
        "source": "T13n0411_002:0733c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂如實知，若諸有情，成身惡行、成語惡行、成意惡行、誹謗賢聖，具足邪見，邪見業因身壞命終，墮諸惡趣、或生地獄、或生傍生、或生餓鬼。",
        "translation": "It's the true knowledge that if sentient beings develop bad physical conduct, develop bad verbal conduct, develop bad mental conduct, denigrate the good and the noble, and are fully endowed with wrong views, the actions of wrong views cause their bodies to break up and their lives to end, and they're born in the bad destinies, or in hell, or in the evening life, or in a hungry ghost.",
        "source": "T13n0411_002:0733c17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情，成身善行、成語善行、成意善行，不謗賢聖，具足正見、正見業因，身壞命終昇諸善趣，或生天上、或生人中、或盡諸漏。",
        "translation": "If sentient beings develop good physical conduct, develop good verbal conduct, develop good mental conduct, don't denigrate the good and noble, and are fully equipped with right view and the causes of right view actions, they are destined to ascend to good destinies when their bodies break up and their lives end, or they're born in heaven, among humans, or they end the contaminants.",
        "source": "T13n0411_002:0733c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來如是如實知已，於彼眾生起大慈悲，勇猛、精進，現三神變，令彼眾生歸趣佛法，教誡安置成立世間、出世間信。",
        "translation": "After truly knowing this, the Tathāgata shows great compassion for those sentient beings, is courageous and energetic, manifests three miraculous powers, causes those sentient beings to return to the Buddha's teaching, and instructs and places them in a position to establish worldly and transmundane faith.",
        "source": "T13n0411_002:0733c23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T13n0411_002:0733c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、神通變現。",
        "translation": "One is a manifestation of a superknowledge.",
        "source": "T13n0411_002:0733c26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、記說變現。",
        "translation": "2. evocative manifestations.",
        "source": "T13n0411_002:0733c26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、教誡變現。",
        "translation": "3. manifestations of instruction.",
        "source": "T13n0411_002:0733c27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是三種變現威力，勸發有情教誡安置成立世間、出世間信，令於一切有趣死生皆得解脫。",
        "translation": "Because of the power of these three manifestations, they encourage sentient beings to establish worldly and transmundane faith by teaching and placing them in positions of admonition, so that all birth through interesting death will be liberated.",
        "source": "T13n0411_002:0733c27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0733c29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第九佛輪，由此輪故，利益安樂無量有情，得安隱住、得無驚恐、得無所畏。",
        "translation": "I have thus accomplished the ninth buddha-wheel, and as a result of that wheel, I've benefited and comforted measureless sentient beings, attained peaceful abiding, become fearless, and become fearless.",
        "source": "T13n0411_002:0734a01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "Claiming to be in the position of a great sage, I turn the Buddha's wheel, destroy demons, non-Buddhists, and mistaken beliefs, and correctly address the lion's roar among the masses.",
        "source": "T13n0411_002:0734a03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0734a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如剎帝利灌頂大王，為除四洲無量有情種種身病，棄捨王位。",
        "translation": "\"Suppose the great king Kārttivādin gives up his position as king to remove the various physical illnesses of measureless sentient beings on the four continents.",
        "source": "T13n0411_002:0734a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸香湯沐浴身首，著鮮淨衣，端坐思惟。",
        "translation": "He washes his body and head with scented baths, puts on fresh and pure clothing, and sits correctly in thought.",
        "source": "T13n0411_002:0734a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸眾生，其心平等，慈悲護念。",
        "translation": "He was equal in mind toward all sentient beings and compassionately guarded their thoughts.",
        "source": "T13n0411_002:0734a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令解脫一切病故，以其種種香花、伎樂及餘供具，供養一切大威德天神。",
        "translation": "In order to free them from various illnesses, he offered various flowers, music, and other offerings to all the celestials of great authority.",
        "source": "T13n0411_002:0734a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，一切天帝、龍帝乃至莫呼洛伽神帝，知是事已，各相謂言：『此剎帝利灌頂大王，具諸功德，有大威神應作輪王，統四洲渚。",
        "translation": "Knowing this, all the gods, the dragon gods, and even the god Mahoraga said to each other, 'This great king Zetri's consecration is full of merit and has a great authoritative power that should make him a wheel-turning king over the four continents and islets.",
        "source": "T13n0411_002:0734a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等宜應共往建立，令復王位，統四洲渚，令諸眾生無病安樂。』",
        "translation": "Perhaps we should go together to establish him as king and rule the four continents and isles, so that sentient beings will be free of illness and happy.'",
        "source": "T13n0411_002:0734a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸天帝乃至莫呼洛伽神帝，即便共往，立剎帝利灌頂大王轉輪王位，令具七寶，統四大洲，皆得自在。",
        "translation": "The gods and goddesses of the heavens and even the god Mahoraga then went together to establish the position of wheel-turning king of the consecrated great king Zātiri, making him complete with seven treasures and ruling the four continents, where he would attain mastery.",
        "source": "T13n0411_002:0734a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "千子具足，勇健端正，能摧怨敵，跨王大地，亘窮海際，謫罰皆停，刀杖不舉，咸修正法，普受安樂。",
        "translation": "Complete with a thousand sons, they're courageous and upright, able to crush enemies, straddle the great kingdom and reach the limit of the ocean, stop punishment, and refrain from carrying swords and blows, all cultivate the Dharma and experience universal well-being.",
        "source": "T13n0411_002:0734a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_002:0734a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎帝利種灌頂大王成就如是第十王輪，由此輪故，於四大洲爰及八萬四千小渚，安立其中諸有情類，十善業道，善守護身，令增壽命，身壞命終當生天中，受諸妙樂。",
        "translation": "Thus has the great king of the Kārttiari consecration accomplished the tenth royal wheel, and as a result of that wheel, he's established sentient beings on the four great continents and 84,000 small islands therein, performing the ten good actions and guarding their bodies well, increasing their life spans, and when their bodies break up and their lives end, they'll be born in the heavens and experience marvelous happiness.",
        "source": "T13n0411_002:0734a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0734a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，昔菩薩位，知自他身有無量種諸煩惱病，以定香水洗浴其身，及以諦法大慈大悲灌沐其首，著慚愧衣。",
        "translation": "Thus, when he was a bodhisattva, he knew that his body and the bodies of others were afflicted with measureless diseases, so he washed his body with concentrated perfume, bathed his head with the truth and great compassion, and put on robes of shame.",
        "source": "T13n0411_002:0734a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方一切諸佛世尊，以諸靜慮、等持、精進、方便、智意、慈悲護念，咸作是言：『如是大士！",
        "translation": "All the buddhas and world-honored ones in the ten directions, with their meditation, equipoise, effort, skillful means, wisdom, and compassionate mindfulness, said, 'Thus, great man!",
        "source": "T13n0411_002:0734a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大福慧莊嚴寶器！",
        "translation": "It is a jeweled vessel of great adornment of merit and wisdom!",
        "source": "T13n0411_002:0734a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堪容一切三種不護、四無所畏、如來十力，及與十八不共佛法，堪得無上一切智智，大慈、大悲無不具足；常欣利樂一切眾生，是求佛寶商人導首，能救有情生死眾苦，能施有情涅槃大樂。",
        "translation": "He is capable of tolerating all three kinds of non-guards, the four forms of fearlessness, the Tathāgata's ten powers, and the 18 distinctive characteristics of the Buddha, of attaining unsurpassed omniscience and knowledge, and of having unsurpassed kindness and compassion; he always seeks the welfare of all sentient beings, is the leader of merchants who seek the Buddha's treasures, can save sentient beings from the many sufferings of birth and death, and can bestow on sentient beings the great happiness of nirvāṇa.",
        "source": "T13n0411_002:0734a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等一切諸佛世尊，應以誠言，與其所願，令成如來，應正等覺，得無上法，為大法王。』",
        "translation": "We, the world-honored buddhas, should sincerely say and grant them what they desire, so that they may become tathāgatas, arightful and perfectly enlightened, attain the unsurpassed Dharma, and become great dharma kings.'",
        "source": "T13n0411_002:0734b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於爾時，依福慧力勇猛精進，於四聖諦如實知已，證得無上正等菩提。",
        "translation": "At the time, I courageously and vigorously applied myself based on the power of merit and wisdom, and after truly knowing the four noble truths, I realized unsurpassed correct perfect enlightenment.",
        "source": "T13n0411_002:0734b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0734b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王統四大洲，皆得自在。",
        "translation": "\"As the wheel-turning king who rules the four continents, he attains mastery over them all.",
        "source": "T13n0411_002:0734b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，於四靜慮、四無色定、四種梵住、四無礙解、四聖諦觀、四無所畏、如來十力，及與十八不共佛法，一切種智皆得自在。",
        "translation": "Thus, the Tathāgata attains mastery over the four meditations, the four formless concentrations, the four abodes of Brahma, the four unhindered understandings, the four contemplations of the noble truths, the four fearlessnesses, the Tathāgata's ten powers, and the 18 distinctive characteristics of the Buddha-dharma, all of which are supported by various kinds of cognition.",
        "source": "T13n0411_002:0734b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王，具足七寶。",
        "translation": "He's like a wheel-turning king who's fully endowed with the seven treasures.",
        "source": "T13n0411_002:0734b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，成就七種菩提分寶。",
        "translation": "Thus, the Tathāgata has accomplished seven kinds of the treasures of enlightenment.",
        "source": "T13n0411_002:0734b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王，千子具足，勇健端正，能伏怨敵。",
        "translation": "Like the wheel-turning king, he's replete with a thousand sons, courageous and correct, and able to subdue enemies.",
        "source": "T13n0411_002:0734b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，有阿若多憍陳那為最初、蘇跋陀羅蘇剌多為最後，諸大聲聞，從佛心生、從佛口生、從法化生，得佛法分，諸漏永盡，名為勇健。",
        "translation": "Thus, the Tathāgata, with Ājñāta-kauṇḍinya as the first and Subhadra-sūrta as the last, and all the great śrāvakas who arise from the Buddha's mind, from the Buddha's mouth, and from the teaching, attain the Buddha's portion of the teaching and permanently end the contaminants, are called courageous and robust.",
        "source": "T13n0411_002:0734b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具四梵住，名為端正，能伏一切天魔、外道、異論、怨敵。",
        "translation": "Possessing the four abodes of Brahmā, he's called correct and able to subdue all demons, non-Buddhists, non-Buddhist philosophers, and enemies.",
        "source": "T13n0411_002:0734b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王，化及八萬四千小渚。",
        "translation": "He's like a wheel-turning king who transforms 84,000 small islands.",
        "source": "T13n0411_002:0734b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來，於百俱胝南贍部洲、於百俱胝西瞿陀尼洲、於百俱胝東毘提訶洲、於百俱胝北俱盧洲、於百俱胝諸大溟海、於百俱胝諸妙高山、於百俱胝四大王天、於百俱胝乃至非想非非想天、於百俱胝大輪圍山、於此高廣一佛土中，言音施化，皆得自在。",
        "translation": "Thus, the Tathāgata freely discerns words and sounds to teach and transform people in the one hundred southern Jambudvīpa continents, the hundred western Gautama continents, the hundred eastern Videha continents, the hundred northern Kulo continents, the hundred drizzling seas, the hundred wonderful high mountains, the hundred four great king gods, the hundred non-perception and non-conception gods, and the hundred great wheel-top mountains, all within the single, high, and wide Buddha land.",
        "source": "T13n0411_002:0734b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0734b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是第十佛輪，由此輪故，如實了知自身、他身、諸漏永盡，利益安樂無量有情，得安隱住、得無驚恐、得無所畏。",
        "translation": "I've thus accomplished the tenth buddha-wheel, and as a result of that wheel, I truly know myself, other bodies, and the contaminants that are permanently ended, which benefits and pleases measureless sentient beings and allows them to live in comfort, without fear or trepidation, and without fear.",
        "source": "T13n0411_002:0734b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，摧諸天魔、外道、邪論，處大眾中正師子吼。",
        "translation": "He claims to be in the position of great sage, turning the Buddha's wheel, destroying demons, non-Buddhists, and mistaken beliefs, and correctly addressing the lion's roar among the masses.",
        "source": "T13n0411_002:0734b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T13n0411_002:0734c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我成如是十種佛輪，本願力故，居此佛土五濁惡世，一切有情，損減一切白淨善法、匱乏所有七聖財寶、遠離一切聰慜智者、斷常羅網之所覆蔽；常好乘馭諸惡趣車，於後世苦不見怖畏；常處遍重無明黑闇，具十惡業，造五無間、誹謗正法、毀呰賢聖、離諸善法、具諸惡法；我於其中，成就如是佛十輪故，得安隱住、得無驚恐、得無所畏。",
        "translation": "Because I've accomplished these ten kinds of Buddha-wheels, and because of the power of my original vow, I've lived in the five turbid and evil worlds of this Buddha land, where all sentient beings are diminished in all wholesome and pure good qualities, deprived of all the seven noble assets, separated from all the wise and intelligent, and covered by the net of permanence; I've always ridden the chariot of evil destinies, never seeing or fearing the suffering of later generations; I've always been in the pervasive darkness of ignorance, with ten bad karmas, created five kinds of unremitting hell, denigrated the right teaching, disparaged the good and noble, parted with good qualities, and possessed bad qualities; and because I've accomplished these ten Buddha-wheels, I've been able to live safely, without fear or trepidation, and without fear.",
        "source": "T13n0411_002:0734c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自稱我處大仙尊位，轉於佛輪，降諸天魔、外道、邪論，摧滅一切諸有情類猶如金剛堅固煩惱。",
        "translation": "Claiming to be in the position of a great sage, I turn the Buddha's wheel, subdue demons, non-Buddhists, and mistaken beliefs, and destroy all sentient beings as if they were adamantine and resolute in their afflictions.",
        "source": "T13n0411_002:0734c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其所樂，安立一切有力眾生，令住三乘不退轉位。」",
        "translation": "According to their desire, I will establish all powerful sentient beings in the stage of nonretrogression in the three vehicles.\"",
        "source": "T13n0411_002:0734c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中一切菩薩摩訶薩眾、一切聲聞、一切天龍，廣說乃至一切羯吒布怛那眾、人、非人等，皆大歡喜，同唱善哉，雨大香雨、雨大花雨、雨眾寶雨、雨大衣雨，一切大地皆悉震動。",
        "translation": "At the time, all the bodhisattvas, all the śrāvakas, all the gods and dragons in the assembly, all the proclaimed and even all the congregations of kaṭapūtanā, humans and nonhumans rejoiced greatly and together sang, 'Good!' as they rained down great incense, flowers, treasures, and robes, and the whole earth shook.",
        "source": "T13n0411_002:0734c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞說如是十種佛輪，於眾會中，有八十四百千那庾多菩薩摩訶薩得無生法忍。",
        "translation": "Upon hearing the teaching of these ten kinds of Buddha-wheels, 814,000 Nayuta bodhisattvas and Mahāsattvas attained the patient acceptance of the nonarising of the Dharma in the congregation.",
        "source": "T13n0411_002:0734c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量菩薩摩訶薩獲得種種諸陀羅尼、三摩地忍。",
        "translation": "Measureless other bodhisattvas, mahāsattvas, and bodhisattvas attain the tolerance of various dhāraṇīs and samādhis.",
        "source": "T13n0411_002:0734c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量無數有情，初發無上正等覺心得不退轉。",
        "translation": "There are measureless and countless other sentient beings who first awaken to the mind of the unsurpassed correct enlightenment and then don't regress.",
        "source": "T13n0411_002:0734c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量無數有情，逮得果證。",
        "translation": "There are measureless and countless other sentient beings who have attained the realization of the fruit.",
        "source": "T13n0411_002:0734c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘大集地藏十輪經卷第二",
        "translation": "Dasheng daji dizang shilun jing, vol. 2",
        "source": "T13n0411_002:0734c22_0",
        "is_bad_quality": false
    }
]