[
    {
        "source_sentence": "持世經卷第二",
        "translation": "Dhṛtarāṣṭra-sūtra, Vol. 2",
        "source": "T14n0482_002:0648c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姚秦龜茲三藏鳩摩羅什譯",
        "translation": "Yaoqin Guzi Sanzang Kumārajīva Translation",
        "source": "T14n0482_002:0648c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世經五陰品第二之二",
        "translation": "Second of Five Aggregates in the Sutra on Holding the World",
        "source": "T14n0482_002:0648c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「◎持世！",
        "translation": "\"Śrīlabdha!",
        "source": "T14n0482_002:0648c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩摩訶薩正觀察選擇識陰？",
        "translation": "What is meant by the bodhisattva-mahāsattva correctly observing the aggregate of the discriminating consciousness?",
        "source": "T14n0482_002:0648c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩觀非陰是識陰，顛倒陰是識陰，虛妄陰是識陰。",
        "translation": "The bodhisattvas, mahāsattvas, observe that the nonexistent aggregate is the aggregate of consciousness, the erroneous aggregate is the aggregate of consciousness, and the false aggregate is the aggregate of consciousness.",
        "source": "T14n0482_002:0648c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0648c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "world-holder!",
        "source": "T14n0482_002:0648c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是識陰從顛倒起，虛妄緣所繫，從先業有，現在緣所繫，屬眾因緣，虛妄無所有，憶想分別起，從識而生，有所識故名之為識。",
        "translation": "\"This consciousness aggregate arises from error, is tied up by false conditions, exists from prior actions, is tied up by present conditions, belongs to numerous causes and conditions, is false and lacks existence, arises from recollection and discrimination, arises from consciousness, and has consciousness; therefore, it's called consciousness.",
        "source": "T14n0482_002:0648c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從憶想分別覺觀生，假借而有，有所識故數名為識。",
        "translation": "It arises from memory, conception, discrimination, perception, and contemplation, and it exists nominally, and it's called consciousness because it has consciousness.",
        "source": "T14n0482_002:0648c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以識諸物故，以起心業故，以思惟故，眾緣生相故，起種種思惟故，數名識陰。",
        "translation": "It's because they are conscious of things, because they give rise to mental activity, because they are contemplated, because they have many conditions that give rise to characteristics, and because they give rise to various kinds of contemplation that they are repeatedly called the aggregate of consciousness.",
        "source": "T14n0482_002:0648c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從有所識，有識像出，示心業故，攝思惟故，數名識陰。",
        "translation": "From the fact that there's a consciousness, there are images of consciousness that arise from mental activity and are collected into deliberation, which are sometimes called the consciousness aggregate.",
        "source": "T14n0482_002:0648c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或名為心，或名為意，或名為識，皆是意業分別故，識陰所攝，識相識行識性示故，數名識陰。",
        "translation": "Whether it's called mind, mindfulness, or consciousness, they are all included in the aggregate of consciousness because of mental activity discrimination, and consciousness forms, consciousness actions, and consciousness nature are shown, which are then repeatedly called the aggregate of consciousness.",
        "source": "T14n0482_002:0648c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是非陰是識陰，不生不起不作，但以顛倒相應緣虛妄識故，數名識陰。",
        "translation": "As the aggregate of right and wrong is the aggregate of consciousness, it's not produced, unarisen, or created, but it's called the aggregate of consciousness because it's a false consciousness with mistakenly concomitant conditions.",
        "source": "T14n0482_002:0648c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0648c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是識陰從眾因緣生無自性，次第相續生，念念生滅，是識緣不生陰相。",
        "translation": "\"The aggregate of consciousness arises from a variety of causes and conditions, has no self-nature, arises in sequence, and is produced and extinguished from moment to moment; this is the aggregate of consciousness that doesn't arise as a condition.",
        "source": "T14n0482_002:0648c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0648c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是識陰生相不可得，決定相亦不可得。",
        "translation": "\"The arising aspect of the aggregate of consciousness is unobtainable, and the determined aspect is also unobtainable.",
        "source": "T14n0482_002:0648c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生相不可得故，決定相不可得故，根本無所有故，自相無故，牢堅不可得故，智者正觀察選擇通達非陰是識陰。",
        "translation": "Because the arisen aspect is unobtainable, the determined aspect is unobtainable, the root has nothing, the self-subject is absent, and the firmness is unobtainable, a wise person correctly observes and discerns and comprehends that the non-aggregate is the aggregate of consciousness.",
        "source": "T14n0482_002:0648c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「凡夫於非識陰生識陰相，以覺觀分別憶想顛倒相應虛妄所縛，強名為識陰，貪著是識陰，依止所識，依止識種種示思惟故生起識陰。",
        "translation": "\"Ordinary people who give rise to the aspect of the aggregate of consciousness that's not the aggregate of consciousness are falsely bound by perception and contemplation, mistakenly associated with discriminating memory, which is forcefully called the aggregate of consciousness, and they become attached to the aggregate of consciousness, which arises based on the consciousnesses that are supported and the various ways consciousnesses are expressed and contemplated.",
        "source": "T14n0482_002:0648c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人種種分別，貪著內識，貪著外識，貪著內外識，貪著遠識，貪著近識，以識相故分別起識陰。",
        "translation": "That person discriminates variously, clings to internal consciousness, clings to external consciousness, clings to internal and external consciousness, clings to distant consciousness, and clings to near consciousness, and the aggregate of consciousness arises from discrimination based on the characteristics of consciousness.",
        "source": "T14n0482_002:0649a01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人以憶想分別若心若意若識，假借強名是心是意是識，如是知種種心相生。",
        "translation": "That person discerns whether mind, intention, or consciousness by means of recollection, using the strong name mind, intention, or consciousness, and thus knows the various mental factors that arise.",
        "source": "T14n0482_002:0649a03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是凡夫貪著識陰，為識陰所縛，心意識合故，起種種識陰。",
        "translation": "These ordinary people are addicted to the aggregate of consciousness, are bound by the aggregate of consciousness, and because their minds and consciousnesses merge, various kinds of aggregate of consciousness arise.",
        "source": "T14n0482_002:0649a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別虛妄事故，以一相故，以決定相故，能得是心是意是識，能得分別愛著。",
        "translation": "They discriminate falsehoods, and because of a single characteristic and because of determined characteristics, they can attain this mind, this intention, and this consciousness, and they can discriminate and become attached to them.",
        "source": "T14n0482_002:0649a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人依止識陰深貪識故，亦得過去識陰貪著念有，亦得未來識陰貪著念有，亦得現在識陰貪著念有。",
        "translation": "Because this person relies on the consciousness aggregate as a deeply desiring consciousness, he also attains the mindfulness of attachment to the aggregate of consciousness in the past, the mindfulness of attachment to the aggregate of consciousness in the future, and the mindfulness of attachment to the aggregate of consciousness in the present.",
        "source": "T14n0482_002:0649a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸凡夫於見聞覺知法中，計得識陰貪著念有，是人貪著見聞覺知法，為識陰所縛，貴其所知，以心意識合繫故馳走往來。",
        "translation": "\"Ordinary people who conceptualize the consciousness aggregate as being addicted to the mindfulness of existence in the things they see, hear, and perceive imagine that this person is addicted to the things they see, hear, and perceive, is bound by the consciousness aggregate, prizes what they know, and rushes back and forth because his mind is united with his consciousness.",
        "source": "T14n0482_002:0649a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂從此世至彼世，從彼世至此世，皆識陰所縛故。",
        "translation": "From this life to that life and from that life to this life, they're all bound by the aggregate of consciousness.",
        "source": "T14n0482_002:0649a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能如實知識陰，識陰是虛妄不實顛倒相應，因見聞覺知法起，此中無有實識者；若不能如是實觀，或起善識，或起不善識，或起善不善識，是人常隨識行，不知識所生處，不知識如實相。",
        "translation": "If someone can't truly know the aggregate of consciousness, which is false and insubstantial, and it arises from seeing, hearing, perceiving, and knowing things, there's no true consciousness in it; if they can't truly observe it that way, sometimes a good consciousness arises, sometimes an unskillful consciousness arises, and sometimes a good and unskillful consciousness arises, this person will always act according to consciousness, not knowing where consciousness arises or the true characteristics of consciousness.",
        "source": "T14n0482_002:0649a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0649a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩於此中如是正觀，知識陰從虛妄識起，所謂見聞覺知法中眾因緣生，無法生法想故貪著識陰。",
        "translation": "In this way, the bodhisattvas, mahāsattvas, correctly observe that the knowledge aggregate arises from false consciousness, that there are many causes and conditions for seeing, hearing, perceiving, and knowing things, and that it's impossible to give rise to conceptions of things and therefore to cling to the aggregate of consciousness.",
        "source": "T14n0482_002:0649a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等不應隨凡夫學人，我等當如實正觀察選擇識，如實正觀察選擇識陰。",
        "translation": "We shouldn't follow ordinary trainees, but we should truly and correctly observe and select consciousness, and truly and correctly observe and select the consciousness aggregate.",
        "source": "T14n0482_002:0649a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩如實觀時，知識陰虛妄不實，從本已來常不生相，知非陰是識陰，像陰是識陰，幻陰是識陰。",
        "translation": "When they truly observe them, bodhisattvas come to know that the aggregate of knowledge is false and insubstantial, that it's always been unarisen since the beginning, and they know that the non-aggregate aggregate is the aggregate of consciousness, the aggregate of images is the aggregate of consciousness, and the illusory aggregate is the aggregate of consciousness.",
        "source": "T14n0482_002:0649a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如幻所化人，識不在內亦不在外，亦不在中間，識性亦如是；如幻性虛妄緣生，從憶想分別起，無有實事如機關木人，識亦如是，從顛倒起虛妄因緣和合故有。",
        "translation": "Like an illusory person who's created by an illusion, consciousness isn't inside, isn't outside, and isn't in the middle, and so is the nature of consciousness; just as the illusory nature arises from false conditions, it arises from memory, perception, and discrimination, has no real thing, like a wooden man at a gate, so does consciousness arise from delusion and the confluence of false causes and conditions.",
        "source": "T14n0482_002:0649a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀時，知識皆無常苦不淨無我，知識相如幻，觀識性如幻。",
        "translation": "When they observe it this way, knowledge is impermanent, painful, impure, and without self, the characteristics of knowledge are illusory, and the nature of consciousness is illusory when observed.",
        "source": "T14n0482_002:0649a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩爾時作是念：『世間甚為狂癡，所謂從憶想分別識起於世間，與心意識合，三界但皆是識，是心意識亦無形無方，不在法內不在法外。",
        "translation": "\"The bodhisattva then thinks, \"The world is very crazy, for what's called the consciousness that arises in the world from memory, conception, discrimination, and the mental consciousness are all consciousnesses in the three realms, and this mental consciousness is also without form or direction, not within or outside the Dharma.",
        "source": "T14n0482_002:0649b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫為虛妄相應所縛故，於識陰中貪著若我若我所，是人貪著識陰在內，貪著識陰在外，貪著識陰在內外，貪著識陰在彼我，是人貴此識陰，為識陰所縛，受識陰味，說識陰相，所謂若心若意若識，隨味行故貪受識陰，是人為識所縛，識陰合故為心意識所牽。",
        "translation": "Because a worldling is fettered by false concomitance, he clings to what's self and what belongs to self in the aggregate of consciousness. This person clings to the aggregate of consciousness internally, clings to the aggregate of consciousness externally, clings to the aggregate of consciousness internally and externally, clings to the aggregate of consciousness internally and externally, clings to the aggregate of consciousness internally and externally, and clings to the aggregate of consciousness internally and externally, clings to the aggregate of consciousness internally and externally, clings to the aggregate of consciousness internally and externally, clings to the aggregate of consciousness internally and externally, clings to the aggregate of consciousness internally and externally, clings to the aggregate of consciousness internally and externally, and clings to the aggregate of consciousness internally and externally, and clings to the aggregate of consciousness internally and externally.",
        "source": "T14n0482_002:0649b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以心意識因緣力故生是凡夫，若起下思得下身，若起上思得上身，若起中思得中身，是人隨心意識力故生，依止諸入，貪著識陰故，不脫生老病死憂悲苦惱。』",
        "translation": "This is a mortal who arises because of the causal power of the mind's consciousness, and if he gives rise to lower thoughts and gets a lower body, if he gives rise to higher thoughts and gets a higher body, and if he gives rise to middle thoughts and gets a middle body, this person arises because of the mind's consciousness power, relies on the sense-fields, and clings to the aggregate of consciousness, so he isn't freed from the grief, sorrow, pain, and vexation of birth, age, sickness, and death.'",
        "source": "T14n0482_002:0649b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩於此中如實正觀選擇識陰，如實正觀識陰無常相故，過去識陰不貪不著不念，知非陰是識陰。",
        "translation": "\"Here, the bodhisattva truly and correctly observes the consciousness aggregate of choice, and because he truly and correctly observes the consciousness aggregate's impermanent nature, he doesn't crave or cling to the past consciousness aggregate and doesn't think about it, knowing that what's not an aggregate is the consciousness aggregate.",
        "source": "T14n0482_002:0649b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世識陰亦不貪不著不念，知非陰是識陰。",
        "translation": "In future lives, the aggregate of consciousness won't be craved, attached, or mindful, and he'll know that what's not an aggregate is the aggregate of consciousness.",
        "source": "T14n0482_002:0649b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在識陰亦不依止。",
        "translation": "The aggregate of consciousness in the present also doesn't depend on it.",
        "source": "T14n0482_002:0649b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如實知識陰無常相，如實知識陰生滅相。",
        "translation": "He truly knows the marks of impermanence of the aggregates and truly knows the marks of arising and ceasing of the aggregates.",
        "source": "T14n0482_002:0649b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是思惟正觀識陰，是名正觀入識陰道。",
        "translation": "If someone thus contemplates and correctly observes the aggregate of consciousness, this is called correctly observing the path into the aggregate of consciousness.",
        "source": "T14n0482_002:0649b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂如實知識，如實知識集，如實知識滅，如實知識滅道，是人如實觀識陰集滅相，能壞識陰，能斷一切相，知識陰集滅相，亦通達識陰集滅相。",
        "translation": "This refers to true knowledge, true knowledge of the arising and ceasing of knowledge, true knowledge of cessation, and true knowledge of the path to cessation, which means that someone who truly observes the arising and ceasing aspects of the consciousness aggregate can destroy the consciousness aggregate, cut off all its aspects, and understand the arising and ceasing aspects of the consciousness aggregate.",
        "source": "T14n0482_002:0649b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時亦不生識陰，亦不滅識陰，是識陰從本已來無生，如是觀時不分別識滅相，通達識陰無生相。",
        "translation": "At that point, the bodhisattva also doesn't give rise to the consciousness aggregate and doesn't extinguish the consciousness aggregate, which has been unarisen since the beginning, and when he thus observes it, he doesn't discern the aspect of the extinction of consciousness and fully comprehends the aspect of the nonarising of the consciousness aggregate.",
        "source": "T14n0482_002:0649b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0649b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "world-holder!",
        "source": "T14n0482_002:0649b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是識陰無生無相無成，是識陰生性虛妄故，入在無生相中。",
        "translation": "\"The aggregate of consciousness is unarisen, markless, and unformed, and because the aggregate of consciousness is false in nature, it enters into the mark of unarisenness.",
        "source": "T14n0482_002:0649b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "World-holder!",
        "source": "T14n0482_002:0649b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識陰終不有生成相，是識陰相從眾因緣生。",
        "translation": "The aggregate of consciousness never has a form that arises; it's the form of the aggregate of consciousness that arises from a variety of causes and conditions.",
        "source": "T14n0482_002:0649b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold the line!",
        "source": "T14n0482_002:0649b28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是觀因緣法，非陰是識陰，觀察選擇信解證知通達諸所有識悉皆知實。",
        "translation": "Thus, the bodhisattva thus observes the law of causes and conditions, which is not the aggregate of the aggregate of consciousness, and observes, selects, understands, recognizes, and comprehends that all consciousnesses are known to be real.",
        "source": "T14n0482_002:0649b28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩知識陰實故，如是一切所緣知皆破壞。",
        "translation": "Because the bodhisattva knows the aggregate of knowledge to be real, he thus knows that all perceptual objects are destroyed.",
        "source": "T14n0482_002:0649c01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0649c02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是觀識陰，知是識陰無生者，無作者無起者，無受者無所受者，但以眾緣生，眾緣合故有，緣見聞覺識法故繫有，從本已來常畢竟空。",
        "translation": "Thus, the bodhisattva thus observes the aggregate of consciousness and knows that it's nothing that arises, nothing that's produced, nothing that's arisen, nothing that's received, and nothing that's received but arises from a multitude of conditions, exists because the conditions combine, and is bound to existence by the condition of seeing, hearing, feeling, and consciousness, which has always been ultimately empty since the distant past.",
        "source": "T14n0482_002:0649c03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀識陰時，即知識陰是無作無起相，不貴不著。",
        "translation": "When he thus observes the aggregate of consciousness, he knows that the aggregate of knowledge is uncreated and unarisen, and he doesn't value or attach to it.",
        "source": "T14n0482_002:0649c06_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0649c07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是正觀察選擇入識陰。",
        "translation": "\"The bodhisattva Mahāsattva thus correctly observes the aggregate of consciousness as he chooses to enter it.",
        "source": "T14n0482_002:0649c07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩能如是方便入五陰，能如是方便正觀五陰，是名通達入五陰集滅道，皆能斷諸陰相，真知五陰方便。",
        "translation": "If a bodhisattva can thus skillfully enter the five aggregates and can thus correctly observe the five aggregates, this is called a person who fully comprehends the path to the accumulation and cessation of the five aggregates, is able to eliminate the characteristics of those aggregates, and truly knows the five aggregates skillfully.",
        "source": "T14n0482_002:0649c08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是方便故，於五受陰中，不貪不著不縛不繫，如實知色無常相，是菩薩若於色有欲染則能除斷；亦如實知受想行識，亦如實知受想行識無常相，若於受想行識中，有欲染則能除斷。",
        "translation": "Because of this skill, he doesn't crave or get attached or bound or tied to the five acquired aggregates, and he truly knows that form is impermanent, which enables him to remove desire defilement if it exists in form; he truly knows feeling, perception, volition, and consciousness, and he truly knows that feeling, perception, volition, and consciousness are impermanent, which enables him to remove desire defilement if it exists in feeling, perception, volition, and consciousness.",
        "source": "T14n0482_002:0649c11_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於五受陰中除斷欲染故，隨順通達決定五陰方便，如是觀時，能知五受陰細微生滅相。",
        "translation": "Because he has removed desire defilement from the five acquired aggregates, the bodhisattva follows the skillful means of comprehending the five aggregates, and when he thus observes them, he can know the subtle arising and ceasing aspects of the five acquired aggregates.",
        "source": "T14n0482_002:0649c15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0649c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩摩訶薩能觀察選擇五受陰細微生滅相？",
        "translation": "What is meant by a bodhisattva, a mahāsattva, being able to observe the subtle arising and ceasing aspects of the five acquired aggregates?",
        "source": "T14n0482_002:0649c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩觀眾生初入胎歌羅羅時，先五陰滅即更有五陰生。",
        "translation": "When the bodhisattva Mahāsattva observes that when sentient beings first enter the womb during the kalala, the first five aggregates cease, and then there are five more aggregates that arise.",
        "source": "T14n0482_002:0649c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是已來觀五陰生滅相，雖先識滅亦知五陰非斷滅相識，雖依止歌羅羅，亦知五陰不至不常。",
        "translation": "From then on, when they observe the arising and ceasing of the five aggregates, even though the first consciousness ceases, they know that the five aggregates aren't cessation-producing consciousnesses, and even though they rely on kalala, they know that the five aggregates don't reach impermanence.",
        "source": "T14n0482_002:0649c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀初入胎一念五受陰生滅相，從歌羅羅乃至出生，及後增長乃至死時，觀此五受陰念念生滅相，如是觀察選擇五受陰微細生滅相。",
        "translation": "Thus, they observe the arising and ceasing of the five acquired aggregates in the first moment of entering the womb, observe the arising and ceasing of these five acquired aggregates in each moment from kalala up to birth, and later when they grow and die, and thus observe the subtle arising and ceasing of the five acquired aggregates.",
        "source": "T14n0482_002:0649c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0649c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是五受陰微細生滅相者，所謂先五受陰滅，次第無物有至胎，識初合時五陰即有生滅，因歌羅羅五受陰假名為人。",
        "translation": "\"This is the subtle aspect of arising and ceasing of the five acquired aggregates, which is called the cessation of the five acquired aggregates, followed by the nonarising of nothing up to the womb, and the arising and ceasing of the five aggregates when consciousness first joins, which is the reason the five acquired aggregates of Kerala are nominally called human beings.",
        "source": "T14n0482_002:0649c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0649c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "world-holder!",
        "source": "T14n0482_002:0649c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識無所依則不能住，識所依者五受陰是。",
        "translation": "Without a basis for consciousness, it can't stand, and the five acquired aggregates are the bases of consciousness.",
        "source": "T14n0482_002:0649c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "World-holder!",
        "source": "T14n0482_002:0650a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無色界中諸天，五受陰細微生滅相亦應如是知。",
        "translation": "\"The subtle arising and ceasing aspects of the five acquired aggregates of the gods in the formless realm should also be known like this.",
        "source": "T14n0482_002:0650a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0650a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是細微五受陰生滅相，辟支佛智慧所不能及，何況聲聞智慧？",
        "translation": "Such subtle forms of arising and ceasing of the five acquired aggregates are beyond the ability of the wisdom of the solitary realizers, let alone the wisdom of the direct disciples.",
        "source": "T14n0482_002:0650a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟諸佛如來善知五受陰，從初入胎細微生滅相，及無色天諸陰念念生滅，所謂一切智慧，出一切世間智慧。",
        "translation": "\"Only the buddha-tathāgatas well know the subtler aspects of the five acquired aggregates that arise and cease from the first moment of womb entry and the formless heavens where the aggregates arise and cease from moment to moment, which is called omniscience and supramundane wisdom.",
        "source": "T14n0482_002:0650a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩得無生法忍，至佛慧境界，是人雖如是觀察選擇五受陰細微相，從初入胎乃至無色天，亦不能究盡如諸佛所知。",
        "translation": "Even though the bodhisattva Mahāsattva has attained the forbearance of the nonarising of the Dharma and has reached the realm of Buddha's wisdom, this person can't completely investigate and select the subtle aspects of the five acquired aggregates from the first moment of womb entry up to the formless heaven as the buddhas know them, even though they've thus observed them.",
        "source": "T14n0482_002:0650a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0650a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來無有隨他智慧，自然得一切智慧方便，得阿耨多羅三藐三菩提。",
        "translation": "Without following the wisdom of others, the buddha-tathāgatas naturally attain all the wisdom and skillful means to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T14n0482_002:0650a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛智慧無所不達，諸佛無礙智慧於一切法中得決定慧，於一切法中得自在力。",
        "translation": "There's nothing about the buddhas' wisdom that isn't reached, and the buddhas' unimpeded wisdom attains the wisdom of certainty in all things and the power of mastery in all things.",
        "source": "T14n0482_002:0650a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0650a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無量無數千萬億阿僧祇劫行於深法故。",
        "translation": "That's because they've practiced the profound Dharma for measureless, incalculable, and trillion incalculable eons.",
        "source": "T14n0482_002:0650a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0650a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫不能如是方便觀五受陰，何況觀五受陰細微生滅相？",
        "translation": "All worldlings are unable to contemplate the five acquired aggregates in this way, so how could they contemplate the five acquired aggregates in their subtle aspect of arising and ceasing?",
        "source": "T14n0482_002:0650a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0650a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸凡夫人不能知五受陰如實，凡夫不知取，不知受陰。",
        "translation": "Ordinary people can't know the five acquired aggregates as they really are, and ordinary people don't know grasping or the acquired aggregates.",
        "source": "T14n0482_002:0650a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0650a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為取？",
        "translation": "What is meant by grasping?",
        "source": "T14n0482_002:0650a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取名我取、眾生取、見取、戒取、五陰取、十八性取、十二因緣取，是名為取。",
        "translation": "Appropriation is called the appropriation of self, the appropriation of sentient beings, the appropriation of views, the appropriation of precepts, the appropriation of the five aggregates, the appropriation of the 18 natures, and the appropriation of 12 causes and conditions.",
        "source": "T14n0482_002:0650a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至所有法，若內若外，所謂欲取，有取，見聞覺識取，我我所取。",
        "translation": "Even all things, whether internal or external, are called grasping by desire, grasping by existence, grasping by seeing, hearing, perceiving, and consciousness, and grasping by self and what's mine.",
        "source": "T14n0482_002:0650a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it, world!",
        "source": "T14n0482_002:0650a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫於此虛妄取不知不見，顛倒因緣而取諸法，是人為取所繫，無明因緣取諸行，諸行因緣取識，識因緣取名色，名色麁相眾生染著歸趣。",
        "translation": "Ordinary people who don't know or see this false grasping and mistakenly grasp things by their causes and conditions are bound by grasping, grasping actions by the causes and conditions of nescience, grasping consciousness by the causes and conditions of actions, grasping name-and-form by the causes and conditions of consciousness, and grasping name-and-form by the crude characteristics of sentient beings who are defiled by attachment and return to destinies.",
        "source": "T14n0482_002:0650a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂色取色合色縛，及取四無色陰，受想行識分別為名。",
        "translation": "This is called taking form, combining form and binding to form, taking the four formless aggregates, and discriminating names for feelings, perceptions, volitions, and consciousness.",
        "source": "T14n0482_002:0650a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0650a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無諸佛，眾生則無所知無所見，不能正觀五受陰。",
        "translation": "Without the buddhas, sentient beings would have no knowing and no seeing, and wouldn't be able to correctly contemplate the five acquired aggregates.",
        "source": "T14n0482_002:0650a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛出於世間，壞眾生依止色，壞依止受想行識，壞和合一相故。",
        "translation": "When the buddhas come into the world, they destroy the form that sentient beings rely on, destroy the form that they rely on in feeling, perception, volition, and consciousness, and destroy the characteristic of unity.",
        "source": "T14n0482_002:0650a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來作如是分別說：『汝等所依所歸，是名為色，是色但以四大和合，受想行識但有名字，名色相成就故說五受陰；汝等眾生莫貪歸此不牢堅五受陰。』",
        "translation": "The buddha-tathāgatas make this kind of distinction, saying, 'What you rely on and take refuge in is called form, which is nothing but the combination of the four elements, and feeling, perception, volition, and consciousness have only names; it's because the characteristics of name and form are accomplished that the five acquired aggregates are described; you sentient beings mustn't crave and take refuge in these five acquired aggregates, which are not firmly established.'",
        "source": "T14n0482_002:0650a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0650b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來何故說五受陰？",
        "translation": "Why does the Tathāgata speak of the five acquired aggregates?",
        "source": "T14n0482_002:0650b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "world-holder!",
        "source": "T14n0482_002:0650b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是凡夫人從顛倒生入無明網，馳走往來何所歸趣？",
        "translation": "Are these ordinary people born from delusion into the web of ignorance, and where do they go from there?",
        "source": "T14n0482_002:0650b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪受五受陰相，作是念：『我依止此當以得樂。』",
        "translation": "They crave the characteristics of the five acquired aggregates and think, 'This will be my basis for attaining happiness.'",
        "source": "T14n0482_002:0650b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人以是樂想貪歸五陰，以苦想以不苦不樂想貪歸五陰。",
        "translation": "That person desires to belong to the five aggregates with these pleasant thoughts, and they desire to belong to the five aggregates with painful thoughts and thoughts that are neither pleasant nor painful.",
        "source": "T14n0482_002:0650b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫人所歸所依止處，是名五陰。",
        "translation": "These are called the five aggregates, which are the places to which ordinary people return and rely.",
        "source": "T14n0482_002:0650b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0650b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸凡夫人從生以來，盲不知五陰為是何等，不知五陰從何所來，不知五陰如實故，貪受五陰，是故說名受陰。",
        "translation": "Since birth, ordinary people have been blinded by not knowing what the five aggregates are, not knowing where they come from, and not knowing them as they really are, and they crave the five aggregates, which is why they're called the acquired aggregates.",
        "source": "T14n0482_002:0650b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此中誰有受者？",
        "translation": "Who is there a recipient of these?",
        "source": "T14n0482_002:0650b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中受者不可得，但以顛倒貪著分別虛妄自縛無明癡闇故，取我取我所，取此彼，是故說受陰是五陰，無有取者亦無決定相。",
        "translation": "Here, feeling is unobtainable, but because of mistaken attachment, discrimination, false self-bonding, ignorance, delusion, and darkness, one takes self, takes what's mine, and takes this and that, it's because of this that the feeling aggregates are said to be the five aggregates, and there's no taking and no definite character.",
        "source": "T14n0482_002:0650b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，智者知非陰是五受陰，顛倒陰是五受陰，無明陰是五受陰，凡夫於此為所繫縛，貪歸五取陰。",
        "translation": "Therefore, wise people know that the nonacquired aggregates are the five acquired aggregates, the mistaken aggregates are the five acquired aggregates, and the aggregate of ignorance is the five acquired aggregates, and worldlings are bound by this, clinging to the five acquired aggregates.",
        "source": "T14n0482_002:0650b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以貪歸故不知何等是取？",
        "translation": "Because they crave them, they don't know what is grasped.",
        "source": "T14n0482_002:0650b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是取陰？",
        "translation": "What is the aggregate of grasping?",
        "source": "T14n0482_002:0650b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但為貪著所歸五陰，往來生死，貪著是五陰故馳走諸趣。",
        "translation": "It's simply because they're addicted to the five aggregates, which are the causes of birth and death in the past, that they run away from the destinies because they're addicted to those five aggregates.",
        "source": "T14n0482_002:0650b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「貪歸何等？",
        "translation": "\"To what does greed belong?",
        "source": "T14n0482_002:0650b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪歸見、貪歸聞、貪歸覺、貪歸識、貪歸愛、貪歸無明。",
        "translation": "Greed goes to views, greed goes to hearing, greed goes to awakening, greed goes to consciousness, greed goes to love, and greed goes to ignorance.",
        "source": "T14n0482_002:0650b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸凡夫為愛縛所縛，貪愛五受陰，為諸蓋所覆入無明闇冥，不知不覺我等今為貪歸何處？",
        "translation": "Bound by the bond of desire, these ordinary people crave the five acquired aggregates, are covered by hindrances, and enter the darkness of ignorance, not knowing or realizing where our craving now belongs.",
        "source": "T14n0482_002:0650b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫縛何處？",
        "translation": "Where is the fetter?",
        "source": "T14n0482_002:0650b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不知故，往來地獄、畜生、餓鬼、人天道中，生死所縛，貪歸生死不放不捨，不斷五陰亦不能知五陰如實相。",
        "translation": "Because they don't know it, they've been bound by birth and death in hell, animals, hungry ghosts, and the human and celestial realms, and their desire to be born and die doesn't release or abandon them.",
        "source": "T14n0482_002:0650b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不如實知故，為種種苦惱所害，墮虛空獄不知出處。",
        "translation": "Because they don't truly know them, they're harmed by various afflictions and fall into the prison of space without knowing where they've emerged.",
        "source": "T14n0482_002:0650b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人不見出道故，於無始生死道中受諸生死，是故不能得脫生老病死憂悲苦惱，亦不得度無量生死險道，亦不得脫諸大苦聚，還復歸趣於苦，貪著於苦，為苦所使。",
        "translation": "Because this person doesn't see the way out, they're subject to birth-and-death in the beginningless path of birth-and-death, so they can't escape birth, old age, illness, death, grief, sorrow, pain, and vexation, can't cross the numberless perils of birth-and-death, can't escape the great masses of suffering, and return to suffering, cling to suffering, and are made to suffer.",
        "source": "T14n0482_002:0650b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為苦？",
        "translation": "What's suffering?",
        "source": "T14n0482_002:0650b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五受陰是，生時但苦生，滅時但苦滅。",
        "translation": "The five acquired aggregates are nothing but painful birth when they arise and painful cessation when they cease.",
        "source": "T14n0482_002:0650c01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Sustain the world!",
        "source": "T14n0482_002:0650c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以是因緣故，為弟子說法。",
        "translation": "It's for this reason that I preach to my disciples.",
        "source": "T14n0482_002:0650c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T14n0482_002:0650c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當正觀色陰，亦當如實知色無常相。",
        "translation": "You should correctly examine the aggregate of form, and you should also truly know that form is impermanent in nature.",
        "source": "T14n0482_002:0650c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等！",
        "translation": "All of you!",
        "source": "T14n0482_002:0650c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於色中有欲染者，當疾除斷；汝等當正觀受想行識，亦當如實知受想行識無常相，若於受想行識中有欲染者，當疾除斷，除斷欲染故心得正解脫。",
        "translation": "If there's defilement by desire in form, you must quickly remove it; you must correctly examine feeling, perception, volition, and consciousness, and you must also truly know that feeling, perception, volition, and consciousness are impermanent in nature; if there's defilement by desire in feeling, perception, volition, and consciousness, you must quickly remove it, and because you've removed defilement by desire, you'll attain right liberation.",
        "source": "T14n0482_002:0650c03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0650c07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人知我所說法義如是，能如說修行，當得脫生老病死憂悲苦惱。",
        "translation": "\"If someone knows the meaning of the teaching I've explained thus and can practice it as I've explained it, they'll be freed from the grief, sorrow, pain, and suffering of birth, age, sickness, and death.",
        "source": "T14n0482_002:0650c07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人不能如說修行，為色縛所縛，為愛繫所繫，入無明闇冥貪取五陰，是人貪取五陰故，不能得脫生死險道。",
        "translation": "If someone doesn't cultivate it as I've taught, they'll be bound by form and bound by craving, and they'll enter ignorance and darkness and cling to the five aggregates, and because they cling to the five aggregates, they won't be able to escape the perilous path of birth-and-death.",
        "source": "T14n0482_002:0650c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold on to the world!",
        "source": "T14n0482_002:0650c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，我說世間與我諍，我不與世間諍。",
        "translation": "For this reason, I say the world is in conflict with me, and I don't fight the world.",
        "source": "T14n0482_002:0650c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為世間？",
        "translation": "What's the world?",
        "source": "T14n0482_002:0650c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂貪著五受陰者，為世間所攝，是人貪歸五陰，為五陰所縛。",
        "translation": "\"Someone who's addicted to the five acquired aggregates is taken in by the world, and this person's addiction is to the five aggregates, which bind them.",
        "source": "T14n0482_002:0650c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知五陰性，不知五陰空相，而與我諍。",
        "translation": "They don't know the nature of the five aggregates or the emptiness of the five aggregates, and they argue with me.",
        "source": "T14n0482_002:0650c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人違逆佛語，與佛共諍，故墮大衰惱。",
        "translation": "That person disobeys the Buddha's words and shares a dispute with him, which causes great misfortune.",
        "source": "T14n0482_002:0650c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人於佛在世若佛滅後，能如是觀虛妄五受陰空無所有，從顛倒無明闇冥起，虛誑妄想但誑凡夫，非五陰似五陰，如是之人不與佛諍，不逆佛語故，得脫地獄、畜生、餓鬼、苦惱。",
        "translation": "If someone thus observes that the five falsely acquired aggregates are empty and non-existent while the Buddha is still alive or after he ceases, and that they arise from the darkness of mistaken ignorance, falsely conceived but ordinary people, and don't resemble the five aggregates, such a person won't argue with the Buddha and won't disobey his words, and they'll be freed from hell, animals, hungry ghosts, and suffering and distress.",
        "source": "T14n0482_002:0650c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0650c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛不與人諍，斷一切諍訟名之為佛，但為眾生演說實法，作是言：『汝等！",
        "translation": "The buddhas do not engage in disputes with people, and they are called buddhas when they end all disputes but explain the true teaching to sentient beings, saying, 'You!",
        "source": "T14n0482_002:0650c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先所取者皆是顛倒，一切眾生顛倒力故，貪歸五陰往來世間。』",
        "translation": "'Whatever is grasped in the past is mistaken, and it's because of the power of their mistakenness that all sentient beings cling to the five aggregates and go back to the world.'",
        "source": "T14n0482_002:0650c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人貪歸五陰已，起種種邪見，貪歸種種名字，貪歸種種憂悲苦惱，是人為種種邪見煩惱、種種憂悲苦惱之所殘害，無有能為作救作舍作歸作趣，唯佛能救。",
        "translation": "After someone clings to the five aggregates, they develop various mistaken views, cling to various names, and cling to various forms of grief, sorrow, and suffering.",
        "source": "T14n0482_002:0650c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫小心小智慧故貪嗜五欲，依止多過五陰，是凡夫人與救者歸者依者脫一切苦惱者，而共諍訟。",
        "translation": "Because of their small amount of wisdom, ordinary people crave the five desires and rely on more than the five aggregates, so ordinary people and those who save, return, and rely on them to escape all suffering and distress are in dispute.",
        "source": "T14n0482_002:0650c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it world!",
        "source": "T14n0482_002:0650c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今舉手其有見五陰者，見陰相者，貪五陰者，我則不與是人為師，是人亦非我弟子，不隨我出家，不隨我行，不歸依我，是人入於邪道，入虛妄道取不實者，是為顛倒不知佛意，不知佛隨宜說五陰，不知佛第一義，是人不受佛教，不應受供養而受。",
        "translation": "Now, when I raise my hand and tell someone who sees the five aggregates, sees the characteristics of the aggregates, and longs for the five aggregates, I won't be that person's teacher, and that person isn't my disciple who leaves home with me, doesn't practice with me, and doesn't rely on me; that person enters a wrong path, enters a false path, and apprehends what's not real.",
        "source": "T14n0482_002:0650c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人我尚不聽出家，何況當得受人供養？",
        "translation": "I wouldn't listen to such a person leaving home, so how could he accept offerings from others?",
        "source": "T14n0482_002:0651a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0651a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之人是外道徒黨，所謂生五陰相者，貪著歸趣五陰者。",
        "translation": "Such a person is a follower of a non-Buddhist sect, which calls them someone who gives rise to the characteristics of the five aggregates and who is addicted to the five aggregates as their destination.",
        "source": "T14n0482_002:0651a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0651a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當來之世後五百歲法欲滅時，於我法中出家多是生五陰相者，決定說五陰相，深著五陰入虛妄邪道，於我法中而得出家，袈裟繞咽，常樂往來白衣居家，當知是人與外道無異，亦以我法多為眾人恭敬供養。",
        "translation": "When the Dharma is about to cease in the next 500 years of the future, many of those who leave home in my Dharma will give rise to the characteristics of the five aggregates, will definitely explain the characteristics of the five aggregates, will be deeply attached to the five aggregates, and will enter a false and mistaken path; if they leave home in my Dharma, wrap their robes around their throats, and always happily go back and forth to their homes in white robes, you should know that they are no different from heretics and will often be respected and offered up by people because of my Dharma.",
        "source": "T14n0482_002:0651a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0651a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我說是見五陰者，決定說五陰者，貪著五陰者，不聽受人一[木*盃]之水。",
        "translation": "I say it's someone who sees the five aggregates, someone who's determined to talk about the five aggregates, and someone who's addicted to the five aggregates who won't listen to a [wooden*cup] of water from a person.",
        "source": "T14n0482_002:0651a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0651a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人於我法中，乃至無有柔順法忍，是人違逆我法，背捨聖行。",
        "translation": "That person has no tolerance for pliable principles in my teaching, and they disobey my teaching and abandon noble behavior.",
        "source": "T14n0482_002:0651a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World keeper!",
        "source": "T14n0482_002:0651a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩於後惡世，應如是發大誓願，於我如是甚深經典當共護持，亦斷眾生五陰見故而為說法。",
        "translation": "Therefore, in a latter bad age, the bodhisattvas, mahāsattvas, should thus make a great vow to guard this profound sūtra of mine and preach it because it will end the five views of the aggregates in sentient beings.",
        "source": "T14n0482_002:0651a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Sustain the world!",
        "source": "T14n0482_002:0651a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是經中說破一切陰相、離貪著陰相。",
        "translation": "\"This is a sūtra in which I explain that I've destroyed all the characteristics of the aggregates and parted with the characteristic of attachment to the aggregates.",
        "source": "T14n0482_002:0651a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，多有在家出家聞如是等經，起於諍訟不生實相。",
        "translation": "At the time, many laypeople and renunciant monks who heard such sūtras became argumentative and didn't give rise to true characteristics.",
        "source": "T14n0482_002:0651a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩於此中應發大誓願：『我等於後惡世貪著五陰邪見眾生，作大利益，所謂度脫貪著見五陰眾生，隨宜方便以法利益。』",
        "translation": "Here, the bodhisattvas, mahāsattvas, should make a great vow, 'We will create a great benefit for sentient beings in a later bad age who are attached to the five aggregates and mistaken views, which is to liberate sentient beings with attached views of the five aggregates and to benefit them with the Dharma according to appropriate methods.'",
        "source": "T14n0482_002:0651a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，持世！",
        "translation": "Therefore, Prajñāpāramitā!",
        "source": "T14n0482_002:0651a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩若欲得善知諸法實相，亦善分別諸法章句，欲得念力，欲得轉身成就不斷念，乃至得阿耨多羅三藐三菩提，應常觀是五陰無常相、苦相、無我相、虛妄相、不堅牢相、畢竟空相、從本已來不生相。",
        "translation": "If bodhisattvas, mahāsattvas, want to attain good knowledge of the true characteristics of dharmas, good discrimination of the rules and regulations of dharmas, the power of mindfulness, the accomplishment of turning the body around without stopping mindfulness, and even the attainment of unsurpassed, correct observation of the five aggregates as impermanent, painful, selfless, false, insubstantial, ultimately empty, and unarisen from the beginning.",
        "source": "T14n0482_002:0651a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常正觀時，五受陰中所有欲染則能除斷，亦得如是等深法中方便。",
        "translation": "When you always correctly observe them, you'll be able to remove all defilement of desire from the five acquired aggregates and attain such profound methods in the Dharma.",
        "source": "T14n0482_002:0651b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0651b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去無量阿僧祇劫，爾時有佛名大意山王如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "In the incalculably long eon of the past, there was a Buddha named Mahêśvara Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge, Well Gone, Understander of the World, Unsurpassed Person, Tamer of Beings, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T14n0482_002:0651b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "World-holder!",
        "source": "T14n0482_002:0651b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大意山王佛，有八十億那由他聲聞眾，皆是阿羅漢，諸漏已盡，及八十億那由他學地阿那含。",
        "translation": "\"This is the Mountain King Buddha of Great Intention, a śrāvaka congregation of eight billion nayutas who are arhats and have ended the contaminants and eight billion nayutas who are nonreturners at the stage of training.",
        "source": "T14n0482_002:0651b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂菩薩摩訶薩眾四十億那由他。",
        "translation": "That's 4 billion nayutas of the bodhisattva-mahāsattva community.",
        "source": "T14n0482_002:0651b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大意山王佛壽八萬歲。",
        "translation": "This is the Mountain King of Great Intent Buddha, whose life span is 80,000 years.",
        "source": "T14n0482_002:0651b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0651b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有王名為德益，是德益王有二萬大城，具足豐樂人民充滿。",
        "translation": "It was then that there was a king named Deyi, and this king Deyi had a great city of 20,000 people filled with plenty of happiness.",
        "source": "T14n0482_002:0651b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城七重縱廣十二由旬，四寶合成有七重塹，皆有欄楯七重行樹，諸寶羅網遍覆其上。",
        "translation": "Seven layers of the city measured 12 leagues across, and there were seven moats made of four jewels, each with a railing and seven rows of trees, and they were covered by a web of jewels.",
        "source": "T14n0482_002:0651b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城塹諸樹及上羅網，皆以黃金琉璃車渠馬瑙四寶合成。",
        "translation": "The moats, trees, and upper webs are all made of the four treasures of gold and beryl, chariots, drains, and coral.",
        "source": "T14n0482_002:0651b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一大城各有五百園林，皆有七寶衣樹充滿其中。",
        "translation": "Each large city has 500 groves filled with seven-jeweled robe trees.",
        "source": "T14n0482_002:0651b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一園林各有五百寶池，八功德水皆滿其中。",
        "translation": "Each grove has 500 jeweled pools, and they're filled with the water of eight excellent qualities.",
        "source": "T14n0482_002:0651b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0651b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是德益王有八萬婇女，其大夫人有二子：一名無量意、二名無量力。",
        "translation": "\"Thus, King Deyi had 80,000 concubines, and his eldest wife had two sons: one with immeasurable mind and two with immeasurable power.",
        "source": "T14n0482_002:0651b16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "Hold the world!",
        "source": "T14n0482_002:0651b18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二王子各年十六，夢中見佛端正無比如閻浮檀金幢，見大歡喜，覺已各說偈曰，其一人言：「『我今夢見二足尊，　　金色百福相莊嚴，　　成就無量諸功德，　　見已心得大歡喜。』",
        "translation": "Those two princes, each 16 years old, saw the Buddha in a dream, perfectly correct and formless, with a golden banner of jambu trees, and were overjoyed at the sight.",
        "source": "T14n0482_002:0651b18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第二人言：「『我夢見佛明如日，　　端正姝妙第一尊，　　猶如須彌眾山王，　　巍巍高顯見歡喜。』",
        "translation": "\"The second person said, 'I dreamt I saw a Buddha as bright as the sun, the most distinguished in appearance and beauty, like the Sumeru king of mountains, so lofty and prominent that I rejoiced.'",
        "source": "T14n0482_002:0651b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0651b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時無量意、無量力二子，詣父母所具說是事，白父母言：『今我二人於夢中見佛，惟願父母，當聽我等俱詣佛所。",
        "translation": "Immediately, the two sons, Amitâbha and Amitâbha, went to their parents and explained these things in detail, saying to them, \"Now, we two saw the Buddha in a dream, and we hope our parents will listen to us as we both go to the Buddha.",
        "source": "T14n0482_002:0651b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛久出世，我等放逸不能覺知，沒五欲泥，為色縛所縛，為受想行識縛所縛。",
        "translation": "The Buddha has been around for a long time, but we are careless and unable to perceive it, so we're caught in the mire of the five desires, bound by form, and bound by the fetters of feeling, perception, volition, and consciousness.",
        "source": "T14n0482_002:0651b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等在家，以放逸故，不能見佛。』",
        "translation": "Because we're at home, we're careless and can't see the Buddha.'",
        "source": "T14n0482_002:0651c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0651c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二王子為父母說是事已，即詣大意山王佛所。",
        "translation": "After these two princes explained these things to their parents, they went to the Buddha of Mahêśvara.",
        "source": "T14n0482_002:0651c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已，頭面禮佛足，請佛及僧三月四事供養衣服飲食臥具醫藥。",
        "translation": "When they arrived, they bowed their heads to the Buddha's feet and invited him and the saṃgha to make four offerings of clothing, food, bedding, and medicine for three months.",
        "source": "T14n0482_002:0651c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大城邊莊嚴德益王所遊園林，懸繒幡蓋寶華覆地，奉佛及僧令止其中。",
        "translation": "They decorated the park at the edge of the great city where King Deyi had visited, covered the ground with silken banners and shrouds, and stayed there under the orders of the Buddha and Saṃgha.",
        "source": "T14n0482_002:0651c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其二王子三月之中，以一切樂具供佛及僧，供養已畢，於佛法中俱共出家。",
        "translation": "For three months, those two princes made offerings to the Buddha and Saṃgha with all their requisites, and after making their offerings, they both left home together within the Buddhist order.",
        "source": "T14n0482_002:0651c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0651c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其大意山王佛知此二王子深心所願，而為廣說是五陰十二入十八性菩薩方便經，於四萬歲中終不睡眠，常不滿腹食亦不傾臥，若坐若經行。",
        "translation": "Knowing these two princes' profound wishes, the Mahāmati Mountain King Buddha explained in detail this scripture on the five aggregates, the twelve sense-fields, and the eighteen natures of the bodhisattva's skillful means, saying that during 40,000 years he would never sleep, would never eat from his belly or lie down, and would sit or practice scriptures.",
        "source": "T14n0482_002:0651c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於四萬歲中不念餘事，但念五受陰虛妄空相，知是五受陰從顛倒起，通達是五受陰相畢，其年壽常修梵行，命終即生兜率天上。",
        "translation": "During those 40,000 years, he doesn't think of anything else but the illusory emptiness of the five acquired aggregates, knowing that they arise from delusion, comprehending the five acquired aggregates in their final aspect, always cultivating the religious practice during his life, and then being born in Tuṣita Heaven when his life ends.",
        "source": "T14n0482_002:0651c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於佛滅後，還生閻浮提大居士家。",
        "translation": "After the Buddha's death, he was reborn at the home of a great householder in Jambudvīpa.",
        "source": "T14n0482_002:0651c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至年十六復夢見佛，為說五陰十八性菩薩從方便經。",
        "translation": "When he was 16 years old, he again saw the Buddha in a dream and taught him the Sutra on the Five Aggregates and Eighteen Natures of the Bodhisattva's Subordination to Skillful Means.",
        "source": "T14n0482_002:0651c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是法已，即覺驚怖，復於佛法滿萬歲中常修梵行；亦復方便深觀五陰十二入十八性菩薩所行方便經，命終生於忉利天上。",
        "translation": "After hearing this teaching, he was terrified and again cultivated the religious practice for the full 10,000 years of the Buddha's teachings; he also skillfully and deeply studied the sutra on the five aggregates, 12 formations, and 18 natures of the bodhisattva's practice of skillful means, and was born in the Heaven of Thirty-three at the end of his life.",
        "source": "T14n0482_002:0651c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畢天之壽，生閻浮提大姓婆羅門家。",
        "translation": "After finishing his life in heaven, he was born in Jambudvīpa to a great family of Brāhmaṇas.",
        "source": "T14n0482_002:0651c19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大意山王佛法末後千歲之中，其二人以本因緣故復得出家，學問廣博其智如海，亦善觀察選擇是五陰性入法，如實通了，於其世中教化二萬人及二十億天於阿耨多羅三藐三菩提。",
        "translation": "During the thousand years after the end of the Buddha's teachings, those two men, who had reborn because of their previous causes, had extensive learning and wisdom like an ocean, and had skillfully observed and selected the nature of the five aggregates and the eighteen buddha-natures, accurately comprehending them, taught 20,000 people and 2 billion gods to attain supreme perfect enlightenment in their lifetime.",
        "source": "T14n0482_002:0651c20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0651c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二菩薩從是已後，世世同心，共值十億那由他佛，然後乃得無生法忍。",
        "translation": "From that point on, these two bodhisattvas were united from generation to generation, and they together attained one billion nayutas before attaining the forbearance of the nonarising of the Dharma.",
        "source": "T14n0482_002:0651c25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得法忍已，復值一億那由他佛，然後得阿耨多羅三藐三菩提。",
        "translation": "After attaining the patience of the Dharma, they again attained 100 million nayutas, and then they attained supreme perfect enlightenment.",
        "source": "T14n0482_002:0651c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二人共劫次第作佛：一名無量音、二名無量光。",
        "translation": "Those two people share the same eon and become buddhas in sequence: one is called Amitâbha and the other is called Amitâbha.",
        "source": "T14n0482_002:0651c28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0651c29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩，若欲疾得阿耨多羅三藐三菩提，當於是清淨無染法中，勤行修集此陰入性，及餘有為法中說實知見相。",
        "translation": "Therefore, if a bodhisattva wishes to quickly attain supreme, perfect enlightenment, he or she should diligently cultivate the nature of these aggregates and formations and explain the true nature of knowing and seeing the characteristics of other existent things.",
        "source": "T14n0482_002:0651c29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世經十八性品第三",
        "translation": "Sutra of the Enduring World, Eighteen Qualities, Chapter 3",
        "source": "T14n0482_002:0652a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World of Holding!",
        "source": "T14n0482_002:0652a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩摩訶薩善知十八性？",
        "translation": "What is meant by a bodhisattva-mahāsattva's good knowledge of the eighteen natures?",
        "source": "T14n0482_002:0652a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩方便正觀十八性，作是念：『眼性，眼性中不可得，是眼性無我無我所，無常無堅自性空故，眼性中眼性不可得故，眼性虛妄無所有，從憶想分別起，眼性無有決定相，虛空性是眼性。",
        "translation": "The bodhisattva Mahāsattva skillfully and correctly observes the eighteen natures and thinks, 'The nature of the eye, which is unobtainable within the nature of the eye, is selfless and without self, impermanent and insubstantial in its own nature because it's empty, the nature of the eye within the nature of the eye because it's unobtainable, the nature of the eye is false and lacks existence, and it arises from the discrimination of conceptions, the nature of the eye has no definite marks, and the nature of space is the nature of the eye.'",
        "source": "T14n0482_002:0652a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空無決定相，無根本故，眼性亦如是，無決定相亦無根本故。",
        "translation": "Just as space has no definite marks and no root, so too is the nature of the eye, which has no definite marks and no root.",
        "source": "T14n0482_002:0652a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼性中實事不可得故。",
        "translation": "\"The real thing in the nature of the eye is therefore unobtainable.",
        "source": "T14n0482_002:0652a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼性無處無方，不在內不在外不在中間，眼性無決定相，以無事故。",
        "translation": "The nature of the eye has no place and no direction, isn't internal, isn't external, and isn't in the middle, and the nature of the eye has no definite marks because there are no accidents.",
        "source": "T14n0482_002:0652a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼性事不可得，眾因緣生故。",
        "translation": "The things in the nature of the eye are unobtainable because they arise from numerous causes and conditions.",
        "source": "T14n0482_002:0652a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼性不過去不未來不現在，眼性眼相不可得，眼性但以先業果報，屬現在緣故數名眼性。",
        "translation": "The nature of the eye is neither past, nor future, nor present, and the nature of the eye's eye shape is unobtainable; the nature of the eye is called the nature of the eye only by virtue of the effects of prior actions and conditions that are present.",
        "source": "T14n0482_002:0652a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼性者即是無性，眼性中眼性不可得，識行處故數名眼性。",
        "translation": "The nature of the eye is the absence of nature, and within the nature of the eye, the nature of the eye is unobtainable, and it's the locus of consciousness formation that makes it repeatedly called the nature of the eye.",
        "source": "T14n0482_002:0652a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『若眼根清淨，色在可見處，意根相應，以三事因緣合，說名為眼性；眼性中無決定眼性相，智者通達無眼性是眼性性。』",
        "translation": "\"'If the eye faculty is purified, form is in the visible realm, and the mind faculty is associated with it, it's called the nature of the eye based on the combination of three causes and conditions; there's no definite mark of the nature of the eye in the nature of the eye, and a wise person understands that the absence of the nature of the eye is the nature of the eye.'",
        "source": "T14n0482_002:0652a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World keeper!",
        "source": "T14n0482_002:0652a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩若能如是觀察選擇眼性，即通達無性是色性。",
        "translation": "If a bodhisattva-mahāsattva can thus observe the nature of the discriminating eye, he or she will understand that the absence of nature is the nature of form.",
        "source": "T14n0482_002:0652a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色性中色性不可得，是色性不合不散，色無決定相故說名色性。",
        "translation": "Of the nature of form, form is unobtainable, which is the nature of form that doesn't fit together and doesn't disperse, and form has no definite characteristics so it's called the nature of form.",
        "source": "T14n0482_002:0652a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色無根本、無分別，何況色性？",
        "translation": "Form has no root and no discrimination, so how could it be the nature of form?",
        "source": "T14n0482_002:0652a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色性則是亦無根本，色性不在色內、不在色外、不在中間，但以憶想分別。",
        "translation": "The nature of form, then, is also fundamental, and the nature of form isn't within form, outside form, or in between, but is discerned by recollection.",
        "source": "T14n0482_002:0652a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色在可見處，眼根清淨，以意識相應，見現在色故數名色性。",
        "translation": "When form is in the visible realm, the eye faculty is purified, and it's called form nature because it's associated with the conscious mind that sees present form.",
        "source": "T14n0482_002:0652a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鏡中面像，若鏡明淨則生色相，鏡中色無決定相。",
        "translation": "It's like a portrait of a face in a mirror; if the mirror is clear and pure, then form will appear, and form in the mirror has no definite form.",
        "source": "T14n0482_002:0652a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鏡中無人而見色像，但以外有鏡，內起色相，如是眼性清淨所緣之色在可見處。",
        "translation": "An image of form is seen without a person in the mirror, but there's a mirror outside, and form arises within it, so the form that's the object of the eye's purified nature is in the visible realm.",
        "source": "T14n0482_002:0652b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如鏡中像數名色性，色無性相無形性，無決定性是名色性，諸色相無我故數名色性，隨眾生所知故，說名色性。",
        "translation": "Such images in a mirror are called form nature, form has no nature or form, has no definite character, and is called form nature; because form and form are without self, they are called form nature in number and are called form nature according to what sentient beings know.",
        "source": "T14n0482_002:0652b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩知是色性，即知無性是色性，無生性是色性，無作性是色性。",
        "translation": "\"If bodhisattvas know this is the nature of form, they know that the naturelessness is the nature of form, the nature of nonarising is the nature of form, and the nature of nonconduct is the nature of form.",
        "source": "T14n0482_002:0652b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是色性不過去不未來不現在，示無所有性，示虛妄性，示假名性，名為色性。",
        "translation": "It's the nature of form that's neither past nor future nor present, that shows nothingness, that shows falsity, and that shows a nominal nature, which is called the nature of form.",
        "source": "T14n0482_002:0652b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀察選擇色性，是菩薩正觀察選擇眼識性。",
        "translation": "Thus observing and selecting the nature of form, the bodhisattva is correctly observing and selecting the nature of the eye consciousness.",
        "source": "T14n0482_002:0652b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所謂眼識中無眼識，無眼識性無有常性，眼識性無有根本、無決定法，眼識性無所示。",
        "translation": "\"It's called the eye consciousness in which there's no eye consciousness, the nature of the eye consciousness has no permanence, the nature of the eye consciousness has no root, no determined dharmas, and the nature of the eye consciousness has no indication.",
        "source": "T14n0482_002:0652b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是眼識性非合非散無有根本，但以先業因緣起，屬現在緣，繫色緣故數名眼識性，隨凡夫顛倒心故數名眼識性，賢聖通達眼識性即是非性。",
        "translation": "The nature of visual consciousness is neither combined nor dispersed, has no root, but arises from the causes and conditions of prior actions, belongs to present conditions, is tied to the conditions of form, and is therefore variously called the nature of visual consciousness, and follows the mistaken minds of worldlings, which are good and noble people who understand the nature of visual consciousness as non-nature.",
        "source": "T14n0482_002:0652b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識性無決定故，從眾因緣生，屬諸因緣故數名眼識性。",
        "translation": "Because the nature of the visual consciousness is indeterminate, it arises from a variety of causes and conditions, and it's counted among those causes and conditions and called the nature of the visual consciousness.",
        "source": "T14n0482_002:0652b15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識所行處是眼識性，是識無決定故。",
        "translation": "The locus of consciousness' activity is the nature of the visual consciousness, and it's because consciousness is indeterminate.",
        "source": "T14n0482_002:0652b16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說無決定相，無生故，示虛妄故，能分別色相故，能示緣故。",
        "translation": "It's said to be indeterminate in its characteristics, unarisen, false, capable of discerning form, and capable of indicating conditions.",
        "source": "T14n0482_002:0652b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「說是眼識性，隨眾生所知，如來方便分別，破壞和合一相故。",
        "translation": "\"It's said to be the nature of the visual consciousness, which follows what sentient beings know and what the Tathāgata discerns skillfully to destroy and unify characteristics.",
        "source": "T14n0482_002:0652b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是十八性示識無決定相，但眼清淨能知色相，二法和合故說眼識性，示眼識實相故說眼識性。",
        "translation": "It's called the nature of the eighteen natures that show that consciousness has no definite characteristics but that the eye is pure and can know form, and it's called the nature of eye consciousness because the two things are combined, and it's called the nature of eye consciousness because it shows the true characteristics of eye consciousness.",
        "source": "T14n0482_002:0652b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識性者示眼所行處，能識色是眼識，性即是說無性。",
        "translation": "The nature of the eye consciousness shows where the eye acts, and the form that can be conserved is the eye consciousness, whose nature is said to be non-nature.",
        "source": "T14n0482_002:0652b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者眼識性中，求眼識性相不可得，眼識性中，亦不得眼識性根本。",
        "translation": "\"In the nature of the eye consciousness of a wise person, it's not possible to seek the nature and characteristics of the eye consciousness, and in the nature of the eye consciousness, it's not possible to get the root of the nature of the eye consciousness.",
        "source": "T14n0482_002:0652b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無決定性是眼識性，眼識性者以假名說，所說性者即是說不取義，能有所見處是眼識，意業起是眼識相，故名為眼識。",
        "translation": "The indeterminate nature is the nature of visual consciousness, and the nature of visual consciousness is described in terms of a nominal name, which is to say that the meaning is not grasped, that the locus of views is visual consciousness, and that the arising of mental activity is the characteristic of visual consciousness; therefore, it's called the visual consciousness.",
        "source": "T14n0482_002:0652b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「眼性、色性、眼識性，以是性門，說三事和合，以知諸緣相故，即是離諸性義。",
        "translation": "\"The nature of the eye, the nature of form, and the nature of visual consciousness are explained in terms of their natures, which are the combination of three things in order to know the characteristics of the conditions, which is to say that they are free of the meaning of natures.",
        "source": "T14n0482_002:0652b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂是眼性、是色性、是眼識性，有如是數，得令眾生入於實道。",
        "translation": "They are called the nature of the eye, the nature of form, and the nature of eye consciousness, and there are such numbers that can cause sentient beings to enter the true path.",
        "source": "T14n0482_002:0652c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中實無眼性、色性、眼識性，諸如來說是知見諸性相，方便分別說是諸性。",
        "translation": "There's really no nature of the eye, form, or visual consciousness here, which the tathāgatas say are the properties of knowing and seeing the characteristics of the natures and which are described as the natures by skillful discrimination.",
        "source": "T14n0482_002:0652c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人通達是諸性方便者，則知三性無性。",
        "translation": "If someone comprehends these natures skillfully, then they'll know that the three natures are without nature.",
        "source": "T14n0482_002:0652c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸性中無性相故，諸性中相不可得故。",
        "translation": "\"It's because there's no nature and marks in natures, and because marks in natures can't be obtained.",
        "source": "T14n0482_002:0652c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳性、聲性、耳識性，鼻性、香性、鼻識性，舌性、味性、舌識性，身性、觸性、身識性，皆亦如是。",
        "translation": "So it is with the nature of the ear, the nature of sound, and the nature of ear consciousness, the nature of the nose, the nature of odor, and the nature of nose consciousness, the nature of the tongue, the nature of taste, and the nature of tongue consciousness, and the nature of the body, the nature of touch, and the nature of body consciousness.",
        "source": "T14n0482_002:0652c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0652c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩摩訶薩觀擇意性？",
        "translation": "What is meant by the bodhisattva-mahāsattva's contemplation of the nature of the discriminating mind?",
        "source": "T14n0482_002:0652c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是念：『意性無決定，根本無所有故，意性中無意性，無決定性是意性。』",
        "translation": "The bodhisattva thinks, 'The nature of intention is undetermined; it's simply lacking in existence; within intention, there's no intention; and indeterminate is the nature of intention.'",
        "source": "T14n0482_002:0652c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如諸種子種於大地，因於水潤，得日得風，漸漸芽出。",
        "translation": "It's like a seed planted in the earth that, because it's nourished by water and given sunlight and wind, gradually sprouts.",
        "source": "T14n0482_002:0652c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "芽不從種子出，種子亦不與芽和合，芽生則種子壞，種子不離芽，芽不離種子，芽中無種子。",
        "translation": "The sprouts don't emerge from the seeds, and the seeds don't merge with the sprouts; when sprouts arise, the seeds decay; the seeds don't part from the sprouts, the sprouts don't part from the seeds, and there are no seeds in the sprouts.",
        "source": "T14n0482_002:0652c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意性亦如是，能起意業故，示意識故，如種示芽，得名意性。",
        "translation": "The nature of mind is likewise; it's because it generates mental activity and shows mental consciousness, just as a seed shows a sprout, that it gets the name mind nature.",
        "source": "T14n0482_002:0652c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離意性則無意，意性不能知意，假名字故說為意性。",
        "translation": "Apart from mindfulness, there's no mind, and mindfulness can't be known as mindfulness, which is called mindfulness because it's called by a false name.",
        "source": "T14n0482_002:0652c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是意性不在意內、不在意外、不在中間，但以先業因緣故起，識是意業故，知所緣故，諸性名字合故，現在緣起故，數名意性，即是不決定意業相，即是眾緣和合相。",
        "translation": "This mind-nature isn't in the mind, isn't accidental, and isn't in the middle, but it arises because of the causes and conditions of prior actions, because consciousness is the action of intention, because it knows the perceptual objects, because the natures are named together, and because it's conditioned by the present, it's called the mind-nature, which is the characteristic of indeterminate intentional action and the characteristic of the conjunction of conditions.",
        "source": "T14n0482_002:0652c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦說意性從和合起，隨眾生所知，於第一義中無有意性。",
        "translation": "It's also said that the nature of intention arises from confluence according to what sentient beings know, and there's no intentional nature in the ultimate truth.",
        "source": "T14n0482_002:0652c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0652c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本無所有故，無生是意性，生無所有故。",
        "translation": "Because the root has nothing, nonarising is intentional, and birth has nothing.",
        "source": "T14n0482_002:0652c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意性即是世俗語，第一義中決定無意性，過去未來現在不可得。",
        "translation": "The mind-nature is worldly talk, which determines that there's no mind-nature in the ultimate truth, and that the past, future, and present are unobtainable.",
        "source": "T14n0482_002:0652c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者通達無性是意性。",
        "translation": "Wise people comprehend that the absence of nature is the nature of intention.",
        "source": "T14n0482_002:0652c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸菩薩觀擇法性，無性是法性，法性無自性，自性不可得，無決定性是法性，法性根本不可得故，決定事亦不可得故。",
        "translation": "\"When bodhisattvas examine the nature of dharmas, the absence of nature is the nature of dharmas, dharmas lack self-nature, self-nature is unobtainable, indeterminate nature is the nature of dharmas, the fundamental nature of dharmas is unobtainable, and definite substances are unobtainable.",
        "source": "T14n0482_002:0652c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但為起顛倒眾生虛妄結縛，有所知故，說言法性，欲令眾生入無性故，故說是法性。",
        "translation": "However, it's because sentient beings who are mistakenly fettered falsely and have knowledge that they're called Dharma nature, and they want to cause sentient beings to enter into non-nature, so they say it's Dharma nature.",
        "source": "T14n0482_002:0652c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性中無法性相，是法性從眾緣生，眾緣生法即無自性，諸因緣中無有自性，諸因緣皆從眾緣和合顛倒故相續而生。",
        "translation": "\"The nature of dharmas has no nature or characteristics, and it's the nature of dharmas that arise from various conditions, the dharmas that arise from various conditions that have no self-nature, the lack of self-nature in causes and conditions, and the continuous arising of causes and conditions that result from the confusion of various conditions.",
        "source": "T14n0482_002:0653a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來於此欲教化眾生說是法性，以世俗語言示無性法，是法性不在內不在外不在中間，但令眾生知見善不善法，以法性說離一切法相知見，畢竟空相故。",
        "translation": "Here, the Tathāgata wants to teach sentient beings that this is the nature of reality, so he uses conventional language to show them the natureless dharma that's not internal, not external, and not in the middle, but only to cause sentient beings to know and see what's good and not good, and he explains that the nature of reality is free of knowing and seeing the characteristics of all dharmas and is ultimately empty.",
        "source": "T14n0482_002:0653a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說畢竟空即是法性。",
        "translation": "He explains that ultimate emptiness is the nature of dharmas.",
        "source": "T14n0482_002:0653a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所有是法性，法性中無決定有相。",
        "translation": "'Nothingness is the nature of dharmas, and the nature of dharmas has no definite marks.'",
        "source": "T14n0482_002:0653a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空無決定相而數名虛空，法性亦如是無決定相。",
        "translation": "Just as space is called space because it has no definite characteristics, so the nature of dharmas has no definite characteristics.",
        "source": "T14n0482_002:0653a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破法相故說名法性，法性即是無性。",
        "translation": "Because it refutes the characteristics of dharmas, it's called the nature of dharmas, and the nature of dharmas is the absence of nature.",
        "source": "T14n0482_002:0653a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法性不在過去不在未來不在現在，但屬眾緣與緣合故，數名法性說名法性，如眾生所知故。",
        "translation": "\"This Dharma nature isn't in the past, isn't in the future, and isn't in the present, but belongs to the conjunction of many conditions and objects, so it's called the Dharma nature and is explained as the Dharma nature because it's known to sentient beings.",
        "source": "T14n0482_002:0653a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者證知無性是法性，法性非合非散，法性中無法性相無多無少，以示性方便故，說法性名為性。",
        "translation": "A wise person realizes that the absence of nature is the nature of dharmas, that the nature of dharmas is not combined or dispersed, that the absence of nature in the nature of dharmas is neither numerous nor few, and that it's because of the skillful way of showing the nature that the nature of dharmas is called nature.",
        "source": "T14n0482_002:0653a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若行者實通達是法性相，即知見無性，是三界法性中無分別相，眾因緣和合故，分別諸法故，說是法性，示無決定性是法性。",
        "translation": "\"If practitioners really comprehend that this is the characteristic of Dharma nature, then they know and see that it's the absence of nature, that it's the absence of discriminated characteristics in the Dharma nature of the three realms, that it's the result of the confluence of many causes and conditions, that it's the result of discriminating qualities, that it's called Dharma nature, and that it's the Dharma nature that's shown to be inconclusive.",
        "source": "T14n0482_002:0653a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者非以法性相故見法性，法性是無生相。",
        "translation": "It's not because of the characteristics of the Dharma nature that a wise person sees the Dharma nature; the Dharma nature is the mark of nonarising.",
        "source": "T14n0482_002:0653a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性中無有相。",
        "translation": "\"In the Dharma nature, there are no marks.",
        "source": "T14n0482_002:0653a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者通達無相是法性，法性中無分別相，無相無分別故說名法性。",
        "translation": "Wise people understand that signlessness is the nature of dharmas, that there are no discriminating marks in the nature of dharmas, and that signlessness and nondiscrimination are why they're called the nature of dharmas.",
        "source": "T14n0482_002:0653a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性中無有住處，無處無起無住無依止，是法性從本已來不生故，是法性無有生者。",
        "translation": "There's no abode in the Dharma nature, and there's no place, no arising, no abiding, and no support, so the Dharma nature from the beginning doesn't arise, and there's nothing that arises from the Dharma nature.",
        "source": "T14n0482_002:0653a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性中無性故。",
        "translation": "\"The nature of dharmas is therefore absent in their nature.",
        "source": "T14n0482_002:0653a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又法性不以合故有，無合無散，無作無決定，名為法性。",
        "translation": "Furthermore, the Dharma nature that doesn't exist by virtue of being united, that has no unity and no distraction, and that is uncreated and undetermined is called the Dharma nature.",
        "source": "T14n0482_002:0653a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩觀擇法性如是，所謂無性是法性。",
        "translation": "The bodhisattva Mahāsattva observes and discerns the nature of dharmas as such, which is called the absence of nature that is the nature of dharmas.",
        "source": "T14n0482_002:0653a25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0653a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩摩訶薩觀擇意識性？",
        "translation": "What is meant by the bodhisattva-mahāsattva's contemplation of the nature of the discriminating consciousness?",
        "source": "T14n0482_002:0653a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩作是念：『不生性是意識性，不決定性是意識性，意識性無根本，無有定法，以意識性示無性相。",
        "translation": "The bodhisattva Mahāsattva thinks, 'The unarisen nature is the nature of consciousness, the indeterminate nature is the nature of consciousness, the nature of consciousness has no root, there's no set dharma, and the nature of consciousness reveals the mark of non-nature.'",
        "source": "T14n0482_002:0653a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意識性中，意識性不可得，是意識性虛妄無所有，顛倒相應以意為首，識諸法故名為意識，隨凡夫所行故，說意識性。』",
        "translation": "'Of the nature of consciousness, the nature of consciousness is unobtainable, which is false and lacking in existence, mistakenly associated with mind as the head, consciousness is called consciousness because it's aware of all things, and it's called the nature of consciousness because it follows the actions of worldlings.'",
        "source": "T14n0482_002:0653b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢聖觀知非性是意識性，虛妄無所有是意識性。",
        "translation": "Good sages observe that knowing what's not nature is the nature of consciousness and that what's false and lacking in existence is the nature of consciousness.",
        "source": "T14n0482_002:0653b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但示因緣法故，以意為首故，識諸緣合故，說為意識性，隨眾生所知故如是說。",
        "translation": "It's simply shown that it's the nature of consciousness because of the causal conditioned dharmas, because mind is the leader, and because consciousnesses combine conditions, and it's thus explained according to what sentient beings know.",
        "source": "T14n0482_002:0653b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「智者知非性是意識性，從眾因緣生，憶想分別起，無有性相，即是第一義中無性相義。",
        "translation": "\"Those who know it know that what's not nature is the nature of consciousness, that it arises from various causes and conditions, that it's discriminated by recollection, and that it has no nature or marks, which is the meaning of no nature or marks in the ultimate truth.",
        "source": "T14n0482_002:0653b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世俗法中為引導眾生故，說是意識性，欲令眾生知無性是意識性，但以小法壞離諸性故，說是意識性。",
        "translation": "It's called the nature of consciousness in order to guide sentient beings in secular dharmas, and it's called the nature of consciousness in order to make sentient beings know that the absence of nature is the nature of consciousness, but it's called the nature of consciousness because the lesser dharmas are destroyed and free of nature.",
        "source": "T14n0482_002:0653b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖人求之不可得，意識性不在意識性內，不在意識性外，不在中間，智者通達不合性是意識，意識不知意性，意性不知意識，但眾因緣生，從顛倒起，以意為首，知於諸緣二事和合故，著虛妄故，從覺觀起示眾生識相故，說名意識性。",
        "translation": "The nature of consciousness is not within the nature of thinking consciousness, not outside the nature of thinking consciousness, and not in the middle.",
        "source": "T14n0482_002:0653b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是意識不在過去不在未來不在現在，是意識無所從來亦無所去無有住處，從本已來不生相。",
        "translation": "This consciousness doesn't exist in the past, isn't in the future, and isn't in the present; it comes from nowhere, goes to nowhere, has no abode, and hasn't had any marks since the beginning.",
        "source": "T14n0482_002:0653b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意識中無根本定法。",
        "translation": "There's no fundamental concentration in consciousness.",
        "source": "T14n0482_002:0653b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是意識性相即是無二相，即是無相，是相不以二相故有，無所示性是意識性。",
        "translation": "\"The characteristic of the nature of consciousness is that there are no two characteristics, that there are no characteristics, that characteristics don't exist because of two characteristics, and that the nature of nothingness is the nature of consciousness.",
        "source": "T14n0482_002:0653b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「智者通達意識性，是意識性，不在一切法中，無處無方，不與法若合若散。",
        "translation": "\"Wise people understand that the nature of consciousness is consciousness, that it's consciousness that's not in all dharmas, has no place and no direction, and doesn't combine or disperse with dharmas.",
        "source": "T14n0482_002:0653b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖人通達不生相是意識性，是意識性無來無去無緣。",
        "translation": "Noble people understand that the mark of nonarising is the nature of consciousness, and that the nature of consciousness has no coming or going and no conditions.",
        "source": "T14n0482_002:0653b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一義中意識性無緣，不可得不可示故。",
        "translation": "In the ultimate truth, the nature of consciousness has no cognition and is unobtainable and unmanifest.",
        "source": "T14n0482_002:0653b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者通達意識性，是不作是意識性，作者不可得故，無生是意識性，生相無所有故。",
        "translation": "A wise person understands the nature of consciousness, that unacted consciousness is the nature of consciousness, that authorship is unobtainable, and that unarisen consciousness is the nature of consciousness, and that the marks of arising are nonexistent.",
        "source": "T14n0482_002:0653b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0653b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是觀擇意識性。",
        "translation": "\"The bodhisattvas thus observe the nature of discriminating consciousness.",
        "source": "T14n0482_002:0653b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩作是觀時，觀擇欲界、色界、無色界，皆是無生性無所有性。",
        "translation": "When bodhisattvas thus observe, they observe and discern that the desire realm, the form realm, and the formless realm are all unborn and unowned.",
        "source": "T14n0482_002:0653b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為觀？",
        "translation": "What is contemplation?",
        "source": "T14n0482_002:0653b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂欲界中無欲界，色界中無色界，無色界中無無色界。",
        "translation": "It means there's no desire realm in the desire realm, no form realm in the form realm, and no form realm in the formless realm.",
        "source": "T14n0482_002:0653c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以界示無界法，為取欲界相者示是欲界，為取色界相者示是色界，為取無色界相者示是無色界。",
        "translation": "To use a realm to show a realmless dharma, he shows it as the desire realm for those who take on the characteristics of the desire realm, the form realm for those who take on the characteristics of the form realm, and the formless realm for those who take on the characteristics of the formless realm.",
        "source": "T14n0482_002:0653c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以界寄說無界，如智者所知，無所有界是欲界、色界、無色界。",
        "translation": "Using the realms to refer to the formless realm, a wise person knows that the formless realm is the desire realm, the form realm, and the formless realm.",
        "source": "T14n0482_002:0653c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者不得欲界、色界、無色界，是三界皆無根本無有定法，從眾緣起，是故智者知見無界是三界。",
        "translation": "The wise man doesn't know that the desire realm, the form realm, or the formless realm are all fundamentally without set dharmas and arise from numerous conditions; therefore, the wise man knows and sees that the formless realm is the three realms.",
        "source": "T14n0482_002:0653c05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中無有界相，是三界皆虛妄合顛倒行。",
        "translation": "There are no characteristics of the elements here, and these three elements are false and combine mistaken behavior.",
        "source": "T14n0482_002:0653c08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653c09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者不得三界，不說三界，若過去若未來若現在。",
        "translation": "\"A wise person doesn't understand the three realms and doesn't speak of the three realms as past, future, or present.",
        "source": "T14n0482_002:0653c09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢聖通達是三界虛妄無所有，無自性離諸法，但是顛倒起，為斷眾生顛倒故，知見三界故，如來分別說三界相，欲令眾生知無界義故，說三界非以性相有，智者知見三界相是無界相。",
        "translation": "Good sages understand that the three realms are false and lacking in existence, lack self-nature, and are free of dharmas, but are produced by error. In order to end sentient beings' error and to know and see the three realms, the Tathāgata discerns the characteristics of the three realms and, because he wants sentient beings to know the meaning of no realm, explains that the three realms don't exist by nature and characteristics, and that a wise person who knows and sees the characteristics of the three realms is the characteristic of no realm.",
        "source": "T14n0482_002:0653c10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0653c14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是觀時，觀眾生性、我性即是虛空性、無所有性、無生性。",
        "translation": "When bodhisattvas, mahāsattvas thus observe that the viewer's nature of birth and selfhood is empty, ungraspable, and unarisen.",
        "source": "T14n0482_002:0653c14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653c16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生性、我性、虛空性無別無異，如是諸性皆虛空出，但從眾緣生故名之為性，此中決定無性相。",
        "translation": "The natures of sentient beings, the nature of self, and the nature of space are not distinct or different, and such natures all arise in space but are called natures because they arise from many conditions, which are definitely without nature or characteristics.",
        "source": "T14n0482_002:0653c16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0653c18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空中無一定性相，是諸性相皆入虛空，是無所有義。",
        "translation": "\"There's no definite nature and marks in space, and these natures and marks all enter space, which is the meaning of having nothing.",
        "source": "T14n0482_002:0653c19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空無性，是法畢竟離相無所有相，一切諸性亦如是離性相，諸性中無性相，性相不在內不在外不在中間。",
        "translation": "Just as space has no nature, and this dharma is ultimately free of marks and lacks all marks, so all natures are free of marks, and there are no marks in natures, and marks are not within, outside, or in between.",
        "source": "T14n0482_002:0653c20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性中無有性，性中不攝性，性不依止性，一切性無所依止，一切性不生。",
        "translation": "There's no nature in the nature, the nature doesn't include the nature, the nature doesn't depend on the nature, all natures have no support, and all natures don't arise.",
        "source": "T14n0482_002:0653c22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者於諸性中，不得生性，不得滅性，不得住性，一切諸性，不生不起不住，從本已來不可得。",
        "translation": "Among these natures, the wise man can't allow the nature to arise, the nature to cease, or the nature to abide, and all natures that don't arise, don't arise, don't arise, and don't abide are unobtainable from the beginning.",
        "source": "T14n0482_002:0653c24_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者不貪不著諸性假名，不受不念，是故智者，通達知見一切諸性皆是無生相。",
        "translation": "Because he doesn't crave or cling to the provisional names of natures and doesn't receive or think about them, the wise man fully understands and sees that all natures are in their unarisen aspect.",
        "source": "T14n0482_002:0653c26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是無生相即無有滅，第一義中一切諸性不可得，世俗法故分別說諸性，第一義中不說諸性，智者知見通達一切諸性如第一義。",
        "translation": "If they are unarisen, then there's no cessation, and in the first meaning all natures are unobtainable.",
        "source": "T14n0482_002:0653c28_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0654a02_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是觀擇通達十八性，及三界眾生性、我性、虛空性。",
        "translation": "\"Bodhisattvas thus observe, analyze, and comprehend the 18 natures, as well as the natures of sentient beings in the three realms, the nature of self, and the nature of space.",
        "source": "T14n0482_002:0654a02_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩如是觀擇通達時，不得性不見性，亦通達一切諸性假名字，亦信解諸入一切性是無性，亦知分別諸性。",
        "translation": "When bodhisattvas thus observe and comprehend them, they don't see the nature and don't comprehend the nominal names of all natures, are confident that all natures entering are without nature, and know how to discern natures.",
        "source": "T14n0482_002:0654a04_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以世俗故分別說諸性，令一切諸性入第一義中，亦善通達無性方便，亦為眾生分別說諸性，亦令眾生善住諸性。",
        "translation": "He discerns natures for worldly reasons, causes all natures to enter the ultimate truth, skillfully comprehends the method of non-nature, discerns natures for sentient beings, and causes sentient beings to well abide in natures.",
        "source": "T14n0482_002:0654a06_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以世俗語言為眾生說無性法，亦不以二相示諸性，雖知一切諸性無二，亦以方便說諸性從因緣起。",
        "translation": "He teaches sentient beings the Dharma of no-nature using conventional speech, and he doesn't show the natures in terms of two characteristics, even though he knows that all natures are without duality, and he teaches that natures arise from causes and conditions using skillful means.",
        "source": "T14n0482_002:0654a09_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖以世俗言說引導眾生，而示眾生第一義，雖善知分別諸性，而信解通達一切諸性無所有。",
        "translation": "Although he guides sentient beings with worldly speech and shows them the ultimate truth, and although he well knows and discerns natures, he understands and comprehends with confidence that all natures are nonexistent.",
        "source": "T14n0482_002:0654a11_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0654a13_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "world-holder!",
        "source": "T14n0482_002:0654a13_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來以第一義故，於性無所得，亦不得諸性相。",
        "translation": "Because the Tathāgata is the ultimate truth, he has nothing to gain from nature, and he doesn't obtain the characteristics of nature.",
        "source": "T14n0482_002:0654a13_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"World-holder!",
        "source": "T14n0482_002:0654a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於諸性無所斷無所壞，得阿耨多羅三藐三菩提。",
        "translation": "\"In my nature, nothing is ended, nothing is destroyed, and I attain supreme perfect enlightenment.",
        "source": "T14n0482_002:0654a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0654a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一義中無諸性，一切諸性無所有無決定，一切性同虛空，一切性入虛空，一切性無生相，如來通達一切性如是。",
        "translation": "\"In the ultimate truth, there are no natures, all natures lack existence and are undetermined, all natures are the same as space, all natures enter space, all natures have no marks of birth, and the Tathāgata comprehends all natures as they are.",
        "source": "T14n0482_002:0654a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0654a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來不說諸性相，亦不說諸法力勢。",
        "translation": "The Tathāgata doesn't talk about the nature and characteristics of things, and he doesn't talk about the powers and strengths of things.",
        "source": "T14n0482_002:0654a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0482_002:0654a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法無所有，不應更說無所有性相。",
        "translation": "If a dharma is without existence, it shouldn't be further explained that it has the character of non-existence.",
        "source": "T14n0482_002:0654a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "World-holder!",
        "source": "T14n0482_002:0654a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦說無所有性相，此中實無所說性相。",
        "translation": "The Tathāgata also says that there are no essential nature and characteristics, but there really are no essential characteristics that are explained here.",
        "source": "T14n0482_002:0654a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世！",
        "translation": "World-holder!",
        "source": "T14n0482_002:0654a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名善分別諸性。",
        "translation": "This is called skillful discrimination of natures.",
        "source": "T14n0482_002:0654a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩得是善分別，能知一切諸性假名，能知世俗相，能知第一義相，能知諸性決定，能知世諦，能分別諸相，能知隨宜，能知諸相合，能知諸相旨趣，能知諸相所入，能分別諸相，能知諸相無性，能令一切諸性同虛空性，亦於諸性不作差別。",
        "translation": "Attaining this good discrimination, the bodhisattva Mahāsattva can know all the natures by their nominal names, can know their worldly aspects, can know their cardinal meaning, can know that they are determined, can know the conventional truth, can discern characteristics, can know what's appropriate, can know the confluence of characteristics, can know the purpose of characteristics, can know what characteristics enter, can discern characteristics, can know that characteristics are without nature, can make all characteristics the same as the nature of space, and doesn't discriminate among them.",
        "source": "T14n0482_002:0654a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸性中不得差別不說差別，亦為眾生善說破壞諸性。",
        "translation": "He doesn't discriminate among natures and doesn't explain the difference, and he well explains the destruction of natures for sentient beings.",
        "source": "T14n0482_002:0654a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0654a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如工幻師能示眾生種種幻事，令知種種幻相。",
        "translation": "\"It's like an expert illusionist who can show sentient beings various illusory things and make them know various illusory characteristics.",
        "source": "T14n0482_002:0654a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有知識親友，語言是幻，說幻實事，是幻虛妄，示顛倒眾生，若有智者則知是幻。",
        "translation": "If there are friends and relatives who speak illusory words and tell illusory stories about real things that are illusory and false, they'll show mistaken sentient beings that would be known as illusory if they were wise.",
        "source": "T14n0482_002:0654b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold it down, world!",
        "source": "T14n0482_002:0654b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間性如幻，諸菩薩摩訶薩入此幻法中，知世間是幻性，世間所行如幻，是人以方便力，示眾生世間如幻。",
        "translation": "\"The nature of the world is illusory, and bodhisattvas, mahāsattvas, enter into this illusory dharma, knowing that the world is illusory and that what's done in the world is illusory, and this person shows sentient beings that the world is illusory by the power of skillful means.",
        "source": "T14n0482_002:0654b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有知此世間如實相，為說世間虛妄如幻。",
        "translation": "If someone knows the world as it really is, they'll explain that the world is false and illusory.",
        "source": "T14n0482_002:0654b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有深智利根，不開示之自能得知，知諸法空如幻無實無有根本，知一切法皆誑凡夫，一切法皆繫虛妄緣中。",
        "translation": "If someone has deep Chilean faculties, they'll be able to know without being shown, knowing that all things are empty and illusory, have no substance and no root, knowing that all things are available to worldlings, and that all things are tied up in false and illusory conditions.",
        "source": "T14n0482_002:0654b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持世！",
        "translation": "\"Hold the world!",
        "source": "T14n0482_002:0654b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故諸菩薩摩訶薩若欲入如是諸性方便，於如是等深經無染無得，說一切諸性知見相，說一切諸性無文字無和合，亦說諸性方便智慧，亦說因緣所作旨趣，亦說一切諸法如實相。",
        "translation": "Therefore, if bodhisattvas, mahāsattvas, and those who want to enter into the skillful means of such natures, at such profound sūtras as these, they are undefiled and unobtainable, they explain the knowable and visible aspects of all natures, explain that all natures are without words or combinations, explain the wisdom of the skillful means of natures, explain the purpose of making causes and conditions, and explain the true characteristics of all dharmas.",
        "source": "T14n0482_002:0654b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂世間出世間，有為無為，繫不繫，善知方便旨趣，說第一義世俗義，了義經未了義經，種種因緣解說，於是甚深經中，應勤精進。」",
        "translation": "They are worldly, transmundane, acquired, unacquired, and unacquired, and they well understand the purpose of skillful means, expound the conventional meaning of the ultimate truth, comprehend the meaning of sūtras and uncomprehended sūtras, and explain the various causes and conditions, and they should diligently pursue diligence in these very profound sūtras.\"",
        "source": "T14n0482_002:0654b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世經卷第二",
        "translation": "Sutra of World Preservation, Volume 2",
        "source": "T14n0482_002:0654b17_0",
        "is_bad_quality": false
    }
]