[
    {
        "source_sentence": "佛說七女經",
        "translation": "Sutra on the Seven Maidens",
        "source": "T14n0556_001:0907c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吳月支國居士支謙譯",
        "translation": "Translated by Zhi Qian, a householder of Wu Yuezhi country",
        "source": "T14n0556_001:0907c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛遊於拘留國，在分儒達樹園，與千羅漢俱，菩薩有五百人，及諸天、龍、鬼神。",
        "translation": "Thus I have heard: One time, the Buddha traveled to the country of Detention and stayed at the Bṛhatphala Park with a thousand arhats, 500 bodhisattvas, and gods, dragons, and spirits.",
        "source": "T14n0556_001:0907c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時拘留國中有婆羅門，名摩訶蜜，慳貪，不信佛法。",
        "translation": "At the time, there was a Brāhmaṇa named Mahāmī in the country of Detention who was stingy and greedy and didn't believe in the Buddha's teachings.",
        "source": "T14n0556_001:0907c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大豪富，珍奇、珠寶、牛馬、田宅甚眾多；智慧無雙，為是國中作師，常有五百弟子，復為國王、大臣所敬遇。",
        "translation": "He was very wealthy, had a great deal of treasures, jewelry, cattle, horses, and land; his wisdom was unsurpassed, and he served as a teacher in that country, always had 500 disciples, and was also respected by the king and his ministers.",
        "source": "T14n0556_001:0907c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是婆羅門有七女，大端正無比，黠慧言語；從頭至足皆著金銀、白珠、瓔珞，隨時被服；常與五百女人俱，憙自貢高，恃怙端正，憍慢眾人；倚於富貴謂呼有常；每與國中人民共說義理，常得其勝。",
        "translation": "That brāhmaṇa had seven women of unsurpassed dignity and intelligent speech; they were dressed from head to toe in gold, silver, white pearls, and jewelry, and they wore robes at all times; they were always with five hundred women, held themselves in high esteem, relied on their integrity, and were arrogant and conceited of many people; they relied on wealth and power and called it eternal; and whenever they shared a teaching of the truth with the people of that country, they always won their victory.",
        "source": "T14n0556_001:0907c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有迦羅越，名曰分儒達，聞此女大好，便至婆羅門所，謂言：「卿家中自呼是女端正，雖爾，當遍將至國中示人。",
        "translation": "It was then that a man named Fenrutta of Kālapatra heard that this woman was very nice, so he went to the Brāhmaṇa and said, \"Even though you yourself call this woman respectable, you must go around the country and show her to people.",
        "source": "T14n0556_001:0907c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人呵此女者，卿當雇我五百兩金；若不呵者，我當雇卿五百兩金。」",
        "translation": "If someone ridicules her, you'll hire me for 500 taels of gold; if not, I'll hire you for 500 taels of gold.\"",
        "source": "T14n0556_001:0907c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是募九十日遍至國中，無有道此女醜者。",
        "translation": "Thus, he recruited her and went around the country for ninety days, but no one told him that she was ugly.",
        "source": "T14n0556_001:0907c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時婆羅門即得五百兩金。",
        "translation": "It was then that the Brāhmaṇa received five hundred taels of gold.",
        "source": "T14n0556_001:0907c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分儒達告婆羅門：「今佛近在祇樹園。",
        "translation": "Bṛhatphala told the Brāhmaṇa, \"Now, the Buddha is near at Jeta's Park.",
        "source": "T14n0556_001:0907c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知當來、過去、今現在事。",
        "translation": "The Buddha knows things in the future, in the past, and in the present.",
        "source": "T14n0556_001:0907c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復至誠，終不妄言。",
        "translation": "He's also sincere and never lies.",
        "source": "T14n0556_001:0908a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當將往示佛。」",
        "translation": "You'll go there and show the Buddha.\"",
        "source": "T14n0556_001:0908a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「大善！」",
        "translation": "The brāhmaṇa said, \"That's very good!\"",
        "source": "T14n0556_001:0908a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即與眷屬五百婆羅門，國中復有五百女人俱，相隨至佛所。",
        "translation": "He then went to the Buddha with his retinue of five hundred brāhmaṇas and another five hundred women in the country.",
        "source": "T14n0556_001:0908a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛時為無數千人說法。",
        "translation": "The Buddha then taught the Dharma to countless thousands of people.",
        "source": "T14n0556_001:0908a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各前為佛作禮，却坐一面。",
        "translation": "Each of them paid homage to the Buddha and withdrew to sit at one side.",
        "source": "T14n0556_001:0908a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門前白佛言：「瞿曇常遊諸國，寧見有好人端正如是女者不？」",
        "translation": "The brāhmaṇas then said to the Buddha, \"Has the Gautama ever traveled to any country and seen a good and decent woman like this?\"",
        "source": "T14n0556_001:0908a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛便逆呵之：「此女不好，皆醜，無有一好處。」",
        "translation": "The Buddha then rebuked him, \"This woman is not nice, she's ugly, and there's not a single nice thing about her.\"",
        "source": "T14n0556_001:0908a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門問佛：「是女一國中人無有道此女醜。",
        "translation": "The Brāhmaṇa asked the Buddha, \"No one in this woman's one country says she's ugly.",
        "source": "T14n0556_001:0908a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今瞿曇何以獨道此女醜？」",
        "translation": "Why does the Gautama now say that she's ugly alone?\"",
        "source": "T14n0556_001:0908a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門問佛言：「世間人以何為好？」",
        "translation": "The Brāhmaṇa asked the Buddha, \"What do people in the world regard as good?\"",
        "source": "T14n0556_001:0908a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「世間人眼不貪色，耳不聽受惡聲，是則為好；鼻不嗅香，口不甞味，是則為好；身不貪細滑，意不念惡，是則為好；手不盜取人財物，口不說人惡，是則為好；不貢高、綺語，知生所從來，死有所趣，是則為好；信布施後當得其福，是則為好；信佛，信法，信比丘僧，是則為好。」",
        "translation": "The Buddha said, \"It's good when people of the world don't crave form with their eyes and don't listen to bad sounds with their ears; it's good when their nose doesn't smell and their mouth doesn't taste; it's good when their body doesn't crave fine and smooth things and their mind doesn't think bad thoughts; it's good when their hands don't steal people's property and their mouth doesn't speak badly about people; it's good when they don't make lofty claims and speak elegantly; it's good when they know where birth comes from and where death leads; it's good when they believe in the merit that will follow generosity; it's good when they believe in the Buddha, believe in the Dharma, and believe in the monks and nuns.\"",
        "source": "T14n0556_001:0908a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「顏色好，不為好；身體好，不為好；衣服好，不為好；二言、綺語，不為好；心端意正此乃為好。」",
        "translation": "The Buddha told the Brāhmaṇa, \"Good color is not good; good body is not good; good clothing is not good; two kinds of speech and fancy language are not good; and this is good when the mind is correct.\"",
        "source": "T14n0556_001:0908a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分儒達即自還得五百兩金。",
        "translation": "Bṛhatphala then returned the five hundred taels of gold to himself.",
        "source": "T14n0556_001:0908a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「昔者有城，名波羅奈，從地底去，佛、諸當來佛皆於是上坐。",
        "translation": "The Buddha told the Brāhmaṇa, \"Once there was a city named Vārāṇasī that went down from the bottom of the earth, and the Buddha and the buddhas of the future were sitting on it.",
        "source": "T14n0556_001:0908a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有國王，名機惟尼，作優婆塞，大明經，為佛作精舍。",
        "translation": "At the time, there was a king named Givani who became an upāsaka and made a sūtra with great insight, and he made a monastery for the Buddha.",
        "source": "T14n0556_001:0908a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有女，悉為優婆夷，明經智慧，端正無雙，身上皆著金銀、琥珀、珠寶，被服甚好。",
        "translation": "The king had daughters, all of whom were upāsikās, who knew the sūtras and had wisdom, were correct, and had gold, silver, amber, and jewelry on their bodies, and were well clothed.",
        "source": "T14n0556_001:0908a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一女字羞耽，第二女字須耽摩，第三女字比丘尼，第四女字比丘羅輜，第五女字沙門尼，第六女字沙門密，第七女字僧大薩耽，常以佛正法齋戒、布施訖竟，七女便相將至父王正殿，白言：『我曹姊弟欲相隨到塚間遊觀。』",
        "translation": "When the first woman, Sanatana, the second woman, Sutama, the third woman, Bhikṣuṇī, the fourth woman, Bhikṣu Lākṣuṇī, the fifth woman, Śrāmaṇerī, the sixth woman, Śrāmaṇerī, and the seventh woman, Saṃdhasatra, had finished observing the precepts and making alms according to the Buddha's true teaching, the seven women went together to the king's main hall and said, 'We, my sisters and brothers, would like to accompany each other to the tomb to see what's going on.'",
        "source": "T14n0556_001:0908a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王言：『塜間大可畏，但有死人骨髮，形骸狼藉，支散在地；諸悲哀者、啼哭者滿其間；有虎、狼、野獸、鵄梟主噉死人肉血。",
        "translation": "\"The king said, 'The graveyard is very frightening, for there are the bones and hair of dead people, their bodies are in disarray and scattered on the ground, and there are sad people and lamenters filling the area; tigers, wolves, wild animals, and thieves devour the flesh and blood of the dead.",
        "source": "T14n0556_001:0908a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝曹姊弟何為塚間？",
        "translation": "What kind of mounds do you sisters and brothers live in?",
        "source": "T14n0556_001:0908b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我宮中有園觀、浴池，中有飛鳥、鴛鴦相隨而鳴；中有眾華，五色光目；芝草奇樹，眾果清涼，恣意所食，極可遊觀。",
        "translation": "In my palace there's a garden and a bathing pond, where flying birds and mandarin ducks sing together, and there are flowers with five colored eyes and lights, wonderful trees with iris and grasses, and cool fruits that you can eat at will and are very enjoyable to watch.",
        "source": "T14n0556_001:0908b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝曹姊弟何為塚間？』",
        "translation": "Why don't you sisters and brothers go to the stūpa?'",
        "source": "T14n0556_001:0908b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「七女即報言：『大王！",
        "translation": "\"Seven women then reported, 'Great king!",
        "source": "T14n0556_001:0908b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾果、美食何益萬分？",
        "translation": "What is the benefit of all the fruits and delicacies?",
        "source": "T14n0556_001:0908b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見世間人老時命日趣死，人生無有不死者。",
        "translation": "I've seen how people in this world live to die every day when they're old, and there's no life that isn't dead.",
        "source": "T14n0556_001:0908b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我曹非小兒，嘗為餘食所惑！",
        "translation": "We're not children, but we've been tempted by leftover food!",
        "source": "T14n0556_001:0908b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王哀念我姊弟者，當聽我曹姊弟到城外觀死人。』",
        "translation": "The king who sympathizes with my sister and brother will listen to my sister and brother as they go outside the city to look at the dead.'",
        "source": "T14n0556_001:0908b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是至三。",
        "translation": "It's like this up to the third time.",
        "source": "T14n0556_001:0908b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王言：『大善！",
        "translation": "\"The king said, 'Very good!",
        "source": "T14n0556_001:0908b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽汝姊弟所為。』",
        "translation": "Listen to what your sisters and brothers are doing.'",
        "source": "T14n0556_001:0908b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時七女即與五百婇女嚴駕出宮門。",
        "translation": "\"It was then that the seven women and their five hundred maidens escaped from the palace gates in full carriage.",
        "source": "T14n0556_001:0908b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七女即解頸下瓔珞散地。",
        "translation": "The seven women then untied their necklaces and scattered them on the ground.",
        "source": "T14n0556_001:0908b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國中時有千餘人見之，隨後拾取珠寶。",
        "translation": "More than a thousand people in the country saw them and then picked up the jewelry.",
        "source": "T14n0556_001:0908b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歡喜遂到城外塚間，大臭，處不淨，但聞啼哭聲。",
        "translation": "Rejoicing, they then went to a tomb outside the city that smelled bad and was impure, and they heard lamentation.",
        "source": "T14n0556_001:0908b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婇女及人民身體肅然，衣毛為竪。",
        "translation": "The women and people are solemn in body, and their robes and hair stand on end.",
        "source": "T14n0556_001:0908b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七女直前視諸死人，中有斷頭者，中有斷手足者，中有斷鼻耳者，中有已死者，或有未死者，中有梓棺者，有席中裹者，有繩縛者。",
        "translation": "Seven women looked straight ahead at the dead, some with severed heads, some with severed arms and legs, some with severed noses and ears, some who had died, some who hadn't yet died, some who were coffined, some who were wrapped in mats, and some who were bound with cords.",
        "source": "T14n0556_001:0908b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "家室啼哭，皆欲令解脫。",
        "translation": "Their families cried out, wanting to free them.",
        "source": "T14n0556_001:0908b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七女左右顧視死人眾多。",
        "translation": "Seven women look around and examine the many dead people.",
        "source": "T14n0556_001:0908b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有持死人從四面來者，飛鳥、走獸共爭來食之。",
        "translation": "There's another person who carries the dead man from the four sides, and birds and animals scramble to feed on him.",
        "source": "T14n0556_001:0908b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "死人膖脹，膿血流出，數萬億蟲從腹中出，臭處難可當。",
        "translation": "The dead man was bloated, with pus and blood flowing out, and trillions of worms were coming out of his belly, making the stench unbearable.",
        "source": "T14n0556_001:0908b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七女亦不覆鼻，直前繞之一匝，即自相與言：『我曹姊弟身體不久皆當復爾。』",
        "translation": "Without covering their noses, the seven women go straight ahead and circle one another, saying to each other, 'It won't be long before the bodies of my sisters and brothers will be the same.'",
        "source": "T14n0556_001:0908b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第一女言：『寧可各作一偈，救死人魂魄耶？』",
        "translation": "\"The first woman said, 'Would it be possible for each of us to write a verse to save the souls of the dead?'",
        "source": "T14n0556_001:0908b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六女皆言：『大善！』",
        "translation": "The six women all said, 'Great!'",
        "source": "T14n0556_001:0908b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第一女言：『此人生時好香塗身，著新好衣；行步眾中，細目綺視；於人中作姿，則欲令人觀之。",
        "translation": "\"The first woman said, 'When this person was born, they were smeared with a nice scent and dressed in new, fine clothing; they walked among people, looked closely at them, and made gestures among them that they wanted to be watched.",
        "source": "T14n0556_001:0908b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今死在地，日炙、風飄。",
        "translation": "Now, he's dead on the ground, scorched by the sun and blown about by the wind.",
        "source": "T14n0556_001:0908b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主作姿則者，今為所在？』",
        "translation": "Where is the master who made that gesture now?'",
        "source": "T14n0556_001:0908b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第二女言：『雀在瓶中，覆蓋其口，不能出飛。",
        "translation": "\"The second woman said, 'The finch was in the vase, and it covered its mouth, so it couldn't get out and fly.",
        "source": "T14n0556_001:0908b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今瓶已破，雀飛而去。』",
        "translation": "Now that the vial has been broken, the sparrow flies away.'",
        "source": "T14n0556_001:0908b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第三女言：『乘車而行，中道捨車去，車不能自前。",
        "translation": "\"The third woman said, 'I was riding in a chariot and left it in the middle of the road, but it couldn't go on its own.",
        "source": "T14n0556_001:0908c01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主使車行者，今為所在？』",
        "translation": "Where is the person who made the chariot go now?'",
        "source": "T14n0556_001:0908c02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第四女言：『譬如人乘船而行，眾人共載而渡水，得岸便繫船。",
        "translation": "\"The fourth woman said, 'It's like a person traveling in a boat that's being carried across the water by a group of people, and then they tie up the boat when they reach the shore.",
        "source": "T14n0556_001:0908c02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棄身體去，如棄船去。』",
        "translation": "They abandon their bodies and go away, just as they abandoned the boat.'",
        "source": "T14n0556_001:0908c04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第五女言：『有城完堅，中多人民，皆生長城中。",
        "translation": "\"The fifth woman said, 'There was a city that was perfectly strong and full of people, and they all grew up in it.",
        "source": "T14n0556_001:0908c04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今城更空，不見人民，為在何所？』",
        "translation": "Now, the city is even emptier, and the people are nowhere to be seen; where are they?'",
        "source": "T14n0556_001:0908c05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第六女言：『人死臥地，衣被常好，從頭至足無有缺減。",
        "translation": "\"The sixth woman says, 'When a person dies and lies on the ground, their clothing is always in good condition, and there's nothing missing from head to toe.",
        "source": "T14n0556_001:0908c06_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今不能行，亦不能動搖。",
        "translation": "Now, he can't walk, and he can't be disturbed.",
        "source": "T14n0556_001:0908c07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人當今為在何所？』",
        "translation": "Where would that person be now?'",
        "source": "T14n0556_001:0908c08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第七女言：『一身獨居，人出去其舍，舍中空無有守者，今舍日壞敗。』",
        "translation": "\"The seventh woman said, 'One person lives alone, and their dwelling is empty and unguarded; now it's going to deteriorate.'",
        "source": "T14n0556_001:0908c08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時第二忉利天王釋提桓因坐即為動搖，聞七女說經，如伸臂頃，即從天上來下，讚七女言：『所說大善！",
        "translation": "\"It was then that the second goddess, Śakrodevānām-Indra, whose seat was immediately shaken, heard the seven women speaking the sūtras, and, as if extending her arm, she descended from heaven and praised the seven women, saying, 'What they've taught is very good!'",
        "source": "T14n0556_001:0908c10_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲願得何等？",
        "translation": "What do you wish to attain?",
        "source": "T14n0556_001:0908c12_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所願者，我能為汝得之。』",
        "translation": "I can get you whatever you wish.'",
        "source": "T14n0556_001:0908c12_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「七女俱言：『卿是釋天乎？",
        "translation": "\"All seven women said, 'Are you the Śakra Devānām-Indra?'",
        "source": "T14n0556_001:0908c13_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天耶？",
        "translation": "Is it Brahmā?",
        "source": "T14n0556_001:0908c13_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見卿來時，自然在我前，使我知之。』",
        "translation": "When you don't come, you'll naturally come before me so that I'll know about it.'",
        "source": "T14n0556_001:0908c14_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「即報言：『諸女！",
        "translation": "\"Then he replied, 'Women!",
        "source": "T14n0556_001:0908c14_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是釋提桓因。",
        "translation": "'I'm Śakrodevānām-Indra.",
        "source": "T14n0556_001:0908c15_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞說善言、好語，故來聽之。』",
        "translation": "I've heard good words and good speech, so I've come to listen to them.'",
        "source": "T14n0556_001:0908c15_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「七女言：『卿屬者欲與我曹願。",
        "translation": "\"The seven women said, 'You're a subordinate who wants to grant me that vow.",
        "source": "T14n0556_001:0908c16_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿是第二忉利天上最尊，當為我等得之。",
        "translation": "You're the most honored in the second heaven of the Thirty-three Celestials, and you will obtain it for us.",
        "source": "T14n0556_001:0908c16_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我姊弟請說所願。』",
        "translation": "My sisters and brothers will tell us what we wish for.'",
        "source": "T14n0556_001:0908c17_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第一女言：『我願欲得無根、無枝、無葉之樹，於其中生。",
        "translation": "\"The first woman said, 'I wish to attain a tree with no roots, no branches, and no leaves that will grow in it.",
        "source": "T14n0556_001:0908c18_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我所願也。』",
        "translation": "This is what I wish.'",
        "source": "T14n0556_001:0908c19_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第二女言：『我欲得地上無形之處、無陰陽之端，願欲於其中生。』",
        "translation": "\"The second woman said, 'I wish to attain a place on earth that has no form and no ends of yin and yang, and I wish for it to grow up in that place.'",
        "source": "T14n0556_001:0908c19_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第三女言：『人於深山中大呼，音響四聞耳，不知所在。",
        "translation": "\"The third woman said, 'A person shouts out loud in a deep mountain, and the sound of the four ears hears him, not knowing where he is.",
        "source": "T14n0556_001:0908c21_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我願於其中生。』",
        "translation": "I wish to be born there.'",
        "source": "T14n0556_001:0908c22_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「釋提桓因報言：『且止！",
        "translation": "\"Śakrodevānī replied, 'Stop!",
        "source": "T14n0556_001:0908c22_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不能得是願。",
        "translation": "\"I couldn't possibly attain this vow.",
        "source": "T14n0556_001:0908c23_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸女欲得作釋梵、四天王、日月中尊，是則可得。",
        "translation": "Women who want to be Śakra and Brahmā, the four heavenly kings, or the honored ones in the sun and moon, then they can attain it.",
        "source": "T14n0556_001:0908c23_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今女所願，實我所不知。』",
        "translation": "What you wish for now is really beyond my knowledge.'",
        "source": "T14n0556_001:0908c24_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「七女答言：『卿是天上獨尊，有威神，何以不能得此願？",
        "translation": "\"The seven women replied, 'You're the only one in heaven with authority, so why can't you attain this vow?'",
        "source": "T14n0556_001:0908c25_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿譬如老牛，不能挽車，亦復不能耕犁，無益於主。』",
        "translation": "You're like an old ox that can't pull a chariot and can't plow a field; it's not helpful to the lord.'",
        "source": "T14n0556_001:0908c26_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「釋提桓因報言：『我聞說經，故來聽之。",
        "translation": "\"Śakra Devānām-Indra replied, 'I heard the sūtras being taught, so I came to listen to them.",
        "source": "T14n0556_001:0908c27_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非我所知，即便辭謝。』",
        "translation": "I don't know anything about it, so I apologized.'",
        "source": "T14n0556_001:0908c28_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七女默然無報。",
        "translation": "The seven women remained silent and didn't respond.",
        "source": "T14n0556_001:0908c28_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時空中有天言：『今迦葉佛近在惟于陵聚中，何不往問迦葉佛？』",
        "translation": "\"It was then that a god in the sky said, 'Now that the Buddha Kāśyapa is near here in the village of Bṛhatphala, why don't you go and ask him about it?'",
        "source": "T14n0556_001:0908c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七女聞之大歡喜，即與五百婇女、隨來觀者，塚間喪亡、悲哀、啼哭者復有五百人，俱發意往。",
        "translation": "When the seven women heard that, they were overjoyed, so they went with five hundred of their daughters and the attendants, and there were another five hundred people who had died, were sad, and were weeping in the tomb, and they all had the intention to go.",
        "source": "T14n0556_001:0909a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時迦葉佛為無數千人說法，悉各前為迦葉佛作禮，却坐一面。",
        "translation": "\"Kāśyapa Buddha then preached to countless thousands of people, each of whom paid homage to Kāśyapa Buddha and withdrew to sit to one side.",
        "source": "T14n0556_001:0909a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「釋提桓因白佛言：『我向者聞國王七女說經，故來聽之。",
        "translation": "\"Śakrodevānām said to the Buddha, 'I've heard the king's seven daughters preach the sūtras, so I've come to listen to them.",
        "source": "T14n0556_001:0909a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七女便從我索是願言：「我欲得無根、無枝、無葉之樹、無形之處、無陰陽之端，深山大呼，音響四聞，不知所在。」",
        "translation": "The seven women then asked me to grant them this vow, saying, 'I want to find a tree without roots, without branches, without leaves, without a place of form, without a tip of yin or yang, deep in the mountains with a great cry, with sounds heard everywhere, and I don't know where it is.'",
        "source": "T14n0556_001:0909a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我時不能報答，願佛為七女解說其意。』",
        "translation": "I was unable to respond at the time, so I hope the Buddha will explain its meaning to the seven women.'",
        "source": "T14n0556_001:0909a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉佛言：『善哉發問，多所過度。",
        "translation": "\"Kāśyapa Buddha said, 'It's good to ask questions, for they're often excessive.",
        "source": "T14n0556_001:0909a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事羅漢、辟支佛尚不能知此事，何況於汝？』",
        "translation": "This is something that arhats and pratyekabuddhas still can't know, so why wouldn't you?'",
        "source": "T14n0556_001:0909a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時迦葉佛便笑，五色光從口出，照滿佛剎，還繞身，從頂上入。",
        "translation": "\"Then Kāśyapa Buddha smiled, and a five-colored light emanated from his mouth, shining all over the Buddha's buddha, circled back around his body, and entered from the top.",
        "source": "T14n0556_001:0909a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者前長跪，問迦葉佛言：『佛不妄笑，願聞其意。』",
        "translation": "The attendant knelt down long enough to ask Kāśyapa Buddha, 'The Buddha doesn't laugh falsely; may I hear his thoughts?'",
        "source": "T14n0556_001:0909a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉佛告薩波羅：『汝見是女不？』",
        "translation": "\"Kāśyapa Buddha addressed Sābhāra, 'Do you see this woman?'",
        "source": "T14n0556_001:0909a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『唯然已見。』",
        "translation": "\"'Only so, I've seen it.'",
        "source": "T14n0556_001:0909a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『此國王七女共發阿耨多羅三藐三菩提心已來，供養五百佛已，當復萬佛，却後十劫悉當作佛，皆同一字，號名復多羅賁，剎土名首陀波。",
        "translation": "\"'Since the seven women of this kingdom collectively aroused the mind of unsurpassed, correct, and complete enlightenment, they've made offerings to 500 buddhas, and then they'll become buddhas in 10 eons, all with the same name, called Potala Ben, and their buddha land is called Śuddhodana.",
        "source": "T14n0556_001:0909a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛壽三萬歲。",
        "translation": "That Buddha's life span is 30,000 years.",
        "source": "T14n0556_001:0909a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時人民被服、飲食，譬如第二忉利天上所有。",
        "translation": "At the time, the people's clothing and food were like those found in the second heaven of the Thirty-three Celestials.",
        "source": "T14n0556_001:0909a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛般泥洹後，經道留止八千歲乃盡。",
        "translation": "After his nirvāṇa, the Buddha's path remained 8,000 years before it ended.",
        "source": "T14n0556_001:0909a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是佛時說法，當度七十五億萬人令得菩薩及羅漢道。』",
        "translation": "When the Buddha teaches, he will save 750,000,000 people and cause them to attain the path of bodhisattvas and arhats.'",
        "source": "T14n0556_001:0909a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉佛授七女別時，即踊躍歡喜，便住虛空中，離地二十丈，從上來下悉化成男子，即得阿惟越致。",
        "translation": "\"When the Buddha Kāśyapa gave the seven women their special gifts, they rejoiced and rejoiced, and then they stood up in the sky, 20 feet above the ground, and were transformed into men from above and below, who then attained abhidharma.",
        "source": "T14n0556_001:0909a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百婇女及千五百天與人，見七女化成男，踊躍歡喜，皆發阿耨多羅三藐三菩提心。",
        "translation": "Five hundred women, 1,500 gods, and humans who saw the seven women transform into men rejoiced and became happy, and they all aroused the mind of unsurpassed, corrected, and complete enlightenment.",
        "source": "T14n0556_001:0909a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一千人遠離塵垢，皆得法眼。」",
        "translation": "One thousand people were freed from the dust and defilement and attained the Dharma eye.\"",
        "source": "T14n0556_001:0909a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「此國王七女富樂、端正、豪貴，尚不恃身作綺好。",
        "translation": "The Buddha told the Brāhmaṇa, \"The seven women of this kingdom are rich, beautiful, and wealthy, but they don't yet rely on their bodies for their comely appearance.",
        "source": "T14n0556_001:0909a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0556_001:0909a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用念非常，是身不可久得故。",
        "translation": "Because using mindfulness is so extraordinary, this body can't be obtained for a long time.",
        "source": "T14n0556_001:0909a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世間人但坐愚癡故，墮十二因緣，便有生死。",
        "translation": "All worldly people simply sit in foolishness and fall into twelve causes and conditions, and then there's birth and death.",
        "source": "T14n0556_001:0909a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人生若皆由恩愛，從生致老，從老致病，從病致死，從死致啼哭，得苦痛。",
        "translation": "If all human beings are born from craving, birth will lead to old age, old age will lead to illness, illness will lead to death, and death will lead to lamentation and pain.",
        "source": "T14n0556_001:0909b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人生若皆從恩愛，當自觀身，亦當觀他人身。",
        "translation": "If all of life is based on kindness and love, you should examine your own body, and you should also examine the bodies of others.",
        "source": "T14n0556_001:0909b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "坐起當念身中惡露、涕唾、寒熱、臭處、不淨。",
        "translation": "When you sit up, you should be mindful of the body's foul discharges, snot, spit, cold, heat, smelly places, and impurity.",
        "source": "T14n0556_001:0909b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是何等類，身一壞時，還化作蟲，自食其肉，骨節支解，消為灰土。",
        "translation": "Such a person, once his body breaks down, turns back into a bug, eats his own flesh, disintegrates his bones, and disintegrates into ashes.",
        "source": "T14n0556_001:0909b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還自念：『我身死亦當如是。』",
        "translation": "They then think to themselves, 'This will be the way my body dies.'",
        "source": "T14n0556_001:0909b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不當恃身作綺好，當念非常。",
        "translation": "Don't rely on your body to create ornate beauty; be mindful that it's extraordinary.",
        "source": "T14n0556_001:0909b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人施行善，不自貢高、綺語者，死後皆生天上；若施行惡者，當入泥犁中。",
        "translation": "If a person does good deeds and doesn't flatter themselves or speak elegantly, they'll all be born in heaven after death; if they do evil deeds, they'll fall into the mire.",
        "source": "T14n0556_001:0909b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人所以墮泥犁中多者何？",
        "translation": "Why do so many women fall into the mire?",
        "source": "T14n0556_001:0909b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但坐嫉妬，姿態多故。」",
        "translation": "She's just sitting there being jealous, which is why her posture is so numerous.\"",
        "source": "T14n0556_001:0909b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是時，婆羅門女即踊躍歡喜，解身上珠寶用散佛上。",
        "translation": "When the Buddha said this, the Brāhmaṇa woman rejoiced and uncoiled her body jewelry and scattered it on top of the Buddha.",
        "source": "T14n0556_001:0909b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛威神令所散住虛空中化作寶蓋，中有聲言：「善哉！",
        "translation": "The Buddha's authoritative power caused the scattered jewels to transform into a jeweled canopy in the sky, and there was a voice that said, \"Good!",
        "source": "T14n0556_001:0909b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所言無有異。」",
        "translation": "As the Buddha said, there's nothing different.\"",
        "source": "T14n0556_001:0909b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛爾時便感動，放威神，於座上以足指按地，三千大千剎土皆為大動；光明照十方，百歲枯樹皆生華菓，諸空溝澗皆自然有水，箜篌樂器不鼓自鳴，婦女珠環皆自作聲，盲者得視，聾者得聽，瘂者得語，傴者得伸，拘躃者得愈，手足病者得愈，狂者得正，被毒者毒不為行，拘閉者悉得解脫，百鳥狸獸皆相和悲鳴。",
        "translation": "It was then that the Buddha was moved and emitted his majestic presence, and when he pressed his finger to the ground while sitting on his throne, the 3,000,000 buddhas and lands were all greatly agitated; his light shone in ten directions, withered trees aged a hundred years produced flowers and fruits, empty ditches and rivers naturally produced water, harps and instruments sounded without drumming, women's jewelry and rings made their own sounds, the blind saw, the deaf heard, the dumb spoke, those who were stretched, those who were stranded were healed, those who were sick in the hands and feet were healed, the crazy were made right, those who were poisoned didn't act like poison, those who were confined were all liberated, and a hundred birds and beasts all sang together in sympathy.",
        "source": "T14n0556_001:0909b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時拘留國中人民無男、無女皆大歡喜，和心相向若得禪。",
        "translation": "At the time, the people of the country of Detention, whether male or female, were overjoyed, and they harmonized their minds and headed toward each other as if they had attained meditation.",
        "source": "T14n0556_001:0909b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛作是變化時，拘留國王捐珠，踊躍歡喜，及百大臣、婆羅門女，與其眷屬，及五百婆羅門，皆發阿耨多羅三藐三菩提心。",
        "translation": "When the Buddha made this change, the king of Detention donated his pearl, rejoiced, and 100 ministers, brāhmaṇas, their retinues, and 500 brāhmaṇas all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T14n0556_001:0909b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五百比丘得羅漢道。",
        "translation": "Five hundred more monks attained the path of the arhat.",
        "source": "T14n0556_001:0909b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國中五百人悉須陀洹道。",
        "translation": "Five hundred people in that country all took the path of stream entry.",
        "source": "T14n0556_001:0909b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是經已，菩薩、比丘僧、優婆塞、優婆夷、國王、大臣、長者、人民、諸天、鬼神、龍，皆大歡喜，前持頭面著地，為佛作禮而去。",
        "translation": "After the Buddha spoke this sūtra, the bodhisattvas, monks, laymen, laywomen, kings, ministers, elders, people, gods, spirits, and dragons all rejoiced greatly, bowed their heads to the ground, paid homage to the Buddha, and departed.",
        "source": "T14n0556_001:0909b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說七女經",
        "translation": "Sutra on the Seven Maidens",
        "source": "T14n0556_001:0909b29_0",
        "is_bad_quality": false
    }
]