[
    {
        "source_sentence": "佛說除蓋障菩薩所問經卷第十",
        "translation": "Foshuo chugai hindrances pusa suowen jing roll 10",
        "source": "T14n0489_018:0746b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八",
        "translation": "eight",
        "source": "T14n0489_018:0746b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚",
        "translation": "Xitian Translation Sutra Tripiṭaka, Chaoshan Dafu, and Xixing Lang",
        "source": "T14n0489_018:0746b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿傳梵大師賜紫沙門臣法護等",
        "translation": "Minister Hōshō and others, bestowed with the purple salutation by the great minister Bhadrapāla",
        "source": "T14n0489_018:0746b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translation of the imperial edict",
        "source": "T14n0489_018:0746b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T14n0489_018:0746b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，即得淨命。",
        "translation": "If a bodhisattva cultivates ten kinds of dharmas, he'll attain pure life.",
        "source": "T14n0489_018:0746b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0746b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、遠離諂求利養；二者、遠離為利養故矯現其相；三者、遠離為利養故虛言激誘；四者、遠離惡求利養；五者、遠離非法利養；六者、遠離不淨利養；七者、不耽著利養；八者、不染愛利養；九者、不為利養故心生熱惱；十者、得如法利養而生喜足。",
        "translation": "1. seclusion from flattery and seeking gain; 2. seclusion from manipulating appearances for gain; 3. seclusion from false speech and seduction for gain; 4. seclusion from evil-seeking gain; 5. seclusion from unlawful gain; 6. seclusion from impure gain; 7. not being attached to gain; 8. not being defiled by craving for gain; 9. not having mental anguish for gain; 10. being satisfied with gain according to the teaching.",
        "source": "T14n0489_018:0746b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T14n0489_018:0746b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是菩薩善能遠離諂求利養？",
        "translation": "How is a bodhisattva well able to distance himself from flattery and the pursuit of profit?",
        "source": "T14n0489_018:0746b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩不以利養因緣故，而身語心行於諂曲。",
        "translation": "\"Suppose a bodhisattva doesn't act flatteringly in body and speech and mind for the sake of making a profit.",
        "source": "T14n0489_018:0746b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身不行諂者，菩薩若見施主及助施者，而不故意策發威儀，徐緩安詳舉足進步端審前視。",
        "translation": "When the body isn't flattering, suppose a bodhisattva sees a donor or an assistant donor and doesn't deliberately try to inspire respectful conduct, slowly and calmly lifting his feet to advance and scrutinize them in front of him.",
        "source": "T14n0489_018:0746b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復起於厭惡而視，或作寂住無發悟視，此即名為身不行諂。",
        "translation": "Whether he looks at them with disgust or makes them stand still without arousal, this is called not flattering the body.",
        "source": "T14n0489_018:0746b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語不行諂者，菩薩不以利養因緣故發徐緩語，及柔軟語，愛樂之語，或隨順語，此即名為語不行諂。",
        "translation": "Not flattering with words, a bodhisattva doesn't speak slowly and softly, speak lovingly, or speak compliantly for profit, which is called not flattering with words.",
        "source": "T14n0489_018:0746b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心不行諂者，菩薩若見施主及助施者，以其利養召命之時，而不語現少欲，心起貪愛內懷熱惱，此即名為心不行諂。",
        "translation": "Not flattering the mind: If a bodhisattva sees a donor or an assistant donor and summons them to life for their benefit but doesn't express few desires and become desirous of them, this is called not flattering the mind.",
        "source": "T14n0489_018:0746b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等名為菩薩善能遠離諂求利養。",
        "translation": "Such is called a bodhisattva who well parts with flattery and seeks to improve his livelihood.",
        "source": "T14n0489_018:0746c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是善能遠離為利養故矯現其相？",
        "translation": "\"How is it a skillful detachment from pretending to be for the sake of gain?",
        "source": "T14n0489_018:0746c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩雖為衣服應器病緣醫藥，及餘資具之所逼迫，以虛矯故，終不發言求彼施主及助施者，是為菩薩善能遠離為利養故矯現其相。",
        "translation": "If a bodhisattva is falsely persuaded by clothing, necessities, illnesses, medicines, and other necessities and never speaks to a donor or an assistant donor because he's being pressured, this is a bodhisattva who's well able to avoid falsely expressing himself for the sake of gain.",
        "source": "T14n0489_018:0746c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是善能遠離為利養故虛言激誘？",
        "translation": "\"How is it that they're well able to avoid provoking others with false speech for the sake of gain?",
        "source": "T14n0489_018:0746c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩或見施主及助施者，不發是言：『某甲施主持如是物惠施於我，而彼以我持戒多聞少欲知足，是故以種種物而特見施我，亦為其起悲愍心作饒益事，攝受於彼而乃受之。』",
        "translation": "Suppose a bodhisattva sees a donor or an assistant donor and doesn't say, 'Some donor gives me such a gift, and because I'm well-versed in morality and have few desires and satisfactions, he gives me various things in particular, and he does acts of kindness for them with compassion, takes them in, and accepts them.'",
        "source": "T14n0489_018:0746c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩善能遠離為利養，故虛言激誘。",
        "translation": "This is because a bodhisattva is well able to distance himself from making benefits, so he uses empty words to provoke and entice.",
        "source": "T14n0489_018:0746c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是善能遠離惡求利養？",
        "translation": "\"How is it that they're well able to distance themselves from pursuing evil for profit?",
        "source": "T14n0489_018:0746c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩不為求利養故身心行惡——身行惡者所謂往來馳走奔競，歷諸艱苦破毀淨戒。",
        "translation": "If a bodhisattva doesn't act badly in body and mind for the sake of seeking profit - acting badly in body is called running and competing, going through hardships, and violating the pure precepts.",
        "source": "T14n0489_018:0746c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心行惡者，為利養故見餘同梵行者得利養已，而於彼所生損害心——是為菩薩善能遠離惡求利養。",
        "translation": "A person who behaves badly in mind and sees other people who are engaged in the same religious practice and obtain benefits for the sake of making a profit, and then becomes harmful to those people - this is a bodhisattva who well secludes himself from pursuing bad benefits.",
        "source": "T14n0489_018:0746c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是善能遠離非法利養？",
        "translation": "\"How is this skillful in secluding oneself from unlawful gain?",
        "source": "T14n0489_018:0746c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩不以斗秤而行欺誑，他所委信亦不侵取，復無奸惡積蓄財利，是為菩薩善能遠離非法利養。",
        "translation": "If a bodhisattva doesn't deceive with a scale, doesn't usurp the faith entrusted to him by others, and doesn't accumulate wealth and profit through duplicity, this is a bodhisattva who is well able to part with unlawful gain.",
        "source": "T14n0489_018:0746c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是善能遠離不淨利養？",
        "translation": "\"How is this skillful in secluding oneself from impure gain?",
        "source": "T14n0489_018:0746c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩於利養中，若窣覩波物，若法若僧所有諸物，不與不許，菩薩知已悉不受之，是為菩薩善能遠離不淨利養。",
        "translation": "If a bodhisattva doesn't give or allow anything that the stūpa owns or that the Dharma or saṃgha owns for profit, and the bodhisattva knows it and doesn't accept it, this is a bodhisattva who well parts with impure profit.",
        "source": "T14n0489_018:0746c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是不耽著利養？",
        "translation": "\"How is this not being attached to making profits?",
        "source": "T14n0489_018:0746c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩雖得利養，不為自己之所攝屬，亦不自謂我所富足，復無積聚。",
        "translation": "\"Suppose a bodhisattva attains profit but doesn't subsume it for himself, doesn't claim to be rich, and doesn't accumulate it.",
        "source": "T14n0489_018:0746c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時能普施諸餘沙門婆羅門等，及父母親屬朋友知識，或復以時己所受用，是為菩薩不耽著利養。",
        "translation": "Being able to give generously to other ascetics, priests, parents, relatives, friends, and acquaintances, or to use what's available to him at the time, is a bodhisattva who isn't addicted to making a profit.",
        "source": "T14n0489_018:0746c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是不染愛利養？",
        "translation": "\"How is this not a tainted attachment to gain?",
        "source": "T14n0489_018:0746c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩雖所受用，不生種種染愛之心，是為菩薩不染愛利養。",
        "translation": "If a bodhisattva doesn't give rise to various defiled desires despite what he receives, this is a bodhisattva who doesn't have a defiled desire for gain.",
        "source": "T14n0489_018:0746c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是不為利養故心生熱惱？",
        "translation": "\"How does this kind of mind not become feverish for the sake of making a profit?",
        "source": "T14n0489_018:0746c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩或於不得利養之時，心不生苦亦無熱惱，而復於彼施主及助施者，不起嫌惡棄捨之心，是為菩薩不為利養故心生熱惱。",
        "translation": "Suppose a bodhisattva's mind doesn't become pained or distressed when he doesn't receive support, and he doesn't harbor resentment toward the donor or the donor's helpers and discards them, this is a bodhisattva whose mind becomes distressed because he doesn't seek to support himself.",
        "source": "T14n0489_018:0747a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是得如法利養而生喜足？",
        "translation": "\"How is it that one attains the joy and satisfaction of making benefits according to the teaching?",
        "source": "T14n0489_018:0747a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩或隨僧次得其如法利養之時，如來許可，諸菩薩眾復不呵責，聖賢稱讚，同梵行者亦不譏毀，如是受已生喜足心，是為菩薩得如法利養而生喜足。",
        "translation": "When a bodhisattva or a follower of the saṃgha attains the benefits of the teaching, the Tathāgata permits it, the crowd of bodhisattvas doesn't rebuke it, the noble ones praise it, and those who practice the same celibacy don't disparage it; this is when a bodhisattva attains the benefits of the teaching and becomes satisfied with it.",
        "source": "T14n0489_018:0747a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，即得淨命。",
        "translation": "If a bodhisattva cultivates these ten things, he'll attain pure life.",
        "source": "T14n0489_018:0747a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，心無懈倦。",
        "translation": "\"If a bodhisattva cultivates ten kinds of principles, his mind won't be lazy.",
        "source": "T14n0489_018:0747a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、為利諸有情故久處生死而無懈倦；二者、為利諸有情故受生死苦而無懈倦；三者、為諸有情作利益故而無懈倦；四者、施作有情諸善事業而無懈倦；五者、為於有情諸所作事而無懈倦；六者、為求聲聞乘人說彼道法而無懈倦；七者、不於聲聞人前言不信彼法；八者、成辦菩提分法而無懈倦；九者、圓滿菩提資糧而無懈倦；十者、不取證涅槃不起趣向涅槃意樂。",
        "translation": "1. staying in birth-and-death for the benefit of sentient beings for a long time without laziness; 2. suffering the pain of birth-and-death for the benefit of sentient beings without laziness; 3. working for the benefit of sentient beings without laziness; 4. bestowing good actions on sentient beings without laziness; 5. doing deeds for sentient beings without laziness; 6. teaching the path to those who seek the vehicle of the śrāvakas without laziness; 7. not speaking to śrāvakas in disbelief of their teaching; 8. accomplishing the factors of enlightenment without laziness; 9. perfecting the accumulation of enlightenment without laziness; and 10. not realizing nirvāṇa without the intention of aspiring to nirvāṇa.",
        "source": "T14n0489_018:0747a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以是緣故，即能趣向菩提，漸近菩提取證菩提。",
        "translation": "Because of these conditions, a bodhisattva can then proceed to enlightenment, gradually approach enlightenment, and realize enlightenment.",
        "source": "T14n0489_018:0747a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，心無懈倦。",
        "translation": "If a bodhisattva cultivates these ten things, his mind won't become lazy.",
        "source": "T14n0489_018:0747a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，能行一切如來教勅。",
        "translation": "If a bodhisattva cultivates ten kinds of principles, he'll be able to carry out all the commands of the Tathāgata's teachings.",
        "source": "T14n0489_018:0747a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、勤修不放逸行，離諸放逸故；二者、具善律儀，身不行惡故；三者、具善律儀，語不行惡故；四者、具善律儀，意不行惡故；五者、恐畏他世，盡斷諸惡故；六者、說如理語，離非理語故；七者、宣正法語，離非法語故；八者、離不善業，修善業故；九者、常於如來教中不說過惡，離諸煩惱穢惡毒故；十者、隨順守護如來正法，防禦一切不善法故。",
        "translation": "1. they diligently cultivate carefree behavior and are free of carelessness; 2. they possess good discipline and don't tolerate evil in body; 3. they possess good discipline and don't tolerate evil in speech; 4. they possess good discipline and don't tolerate evil in mind; 5. they fear other worlds and completely eliminate evil; 6. they speak correctly and part with words that aren't reasonable; 7. they proclaim the right words of the Dharma and part with words that aren't the Dharma; 8. they part with unskillful actions and cultivate good actions; 9. they always refrain from speaking wrongly in the Tathāgata's teaching and part with the poison of the defilements of affliction; 10. they obediently guard the Tathāgata's right teaching and defend against all unskillful things.",
        "source": "T14n0489_018:0747a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，能行一切如來教勅。",
        "translation": "If a bodhisattva cultivates these ten kinds of things, he'll be able to carry out all the Tathāgata's instructions.",
        "source": "T14n0489_018:0747b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，得面相熙怡離諸顰蹙。",
        "translation": "If a bodhisattva cultivates ten kinds of dharmas, he'll attain a pleasant countenance free of knitting the brows.",
        "source": "T14n0489_018:0747b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、諸根勝妙；二者、諸根清淨；三者、諸根無缺；四者、諸根無垢；五者、諸根潔白；六者、遠離瞋恚；七者、遠離隨眠；八者、遠離纏縛；九者、遠離結恨；十者、遠離忿怒。",
        "translation": "1. the faculties are excellent; 2. the faculties are pure; 3. the faculties are without defect; 4. the faculties are unsullied; 5. the faculties are pure; 6. they are free of anger; 7. they are free of latencies; 8. they are free of bondage; 9. they are free of enmity; 10. they are free of wrath.",
        "source": "T14n0489_018:0747b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，得面相熙怡離諸顰蹙。」",
        "translation": "If a bodhisattva cultivates these ten kinds of qualities, he'll attain a pleasant countenance free of knitting the brows.\"",
        "source": "T14n0489_018:0747b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，除蓋障菩薩白佛言：「世尊！",
        "translation": "At that point, the Bodhisattva Removing Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T14n0489_018:0747b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我解佛所說之義，由諸根清淨故，菩薩即得面相熙怡，由斷諸煩惱故，得離顰蹙。」",
        "translation": "As I understand the Buddha's teaching, it's because the faculties are purified that a bodhisattva attains a pleasant countenance, and because the afflictions are stopped, he attains freedom from knitting the brows.\"",
        "source": "T14n0489_018:0747b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是，如是。",
        "translation": "The Buddha said, \"So it is, so it is.",
        "source": "T14n0489_018:0747b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由諸根清淨故，菩薩即得面相熙怡，由斷諸煩惱故得離顰蹙。",
        "translation": "Because the faculties are purified, the bodhisattva then attains a pleasant countenance, and because he has cut off the afflictions, he can become free of knitting his brows.",
        "source": "T14n0489_018:0747b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，即得多聞。",
        "translation": "If a bodhisattva cultivates ten kinds of dharmas, he'll become well-versed.",
        "source": "T14n0489_018:0747b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、如實了知於生死中貪火熾然；二者、如實了知瞋火增盛；三者、如實了知癡火昏亂；四者、如實了知有為之法皆悉無常；五者、如實了知諸行是苦；六者、如實了知世間悉空；七者、如實了知諸法無我；八者、能離世間戲論；九者、如實了知彼一切法皆從緣生；十者、如實了知涅槃寂靜。",
        "translation": "1. truly knows that the fire of greed burns brightly in birth-and-death; 2. truly knows that the fire of anger grows in intensity; 3. truly knows that the fire of delusion is confused; 4. truly knows that all existent things are impermanent; 5. truly knows that all conditioned things are painful; 6. truly knows that the world is entirely empty; 7. truly knows that all things are without self; 8. is able to part with worldly conceptualization; 9. truly knows that all these things arise from conditions; and 10. truly knows that nirvāṇa is tranquil.",
        "source": "T14n0489_018:0747b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等諸法要以聞思修所成慧方能證悟，不可但以音聲言說而能解入。",
        "translation": "These things can be realized only by the wisdom gained from hearing, contemplating, and cultivating them, and they can't be understood and entered simply by talking about them in sounds and words.",
        "source": "T14n0489_018:0747b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是知已，即起堅固悲愍之心發勤精進，為諸有情作利益事。",
        "translation": "After thus knowing this, the bodhisattva arouses a resolute, compassionate mind and diligently undertakes to work for the benefit of sentient beings.",
        "source": "T14n0489_018:0747b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，即得多聞。",
        "translation": "If a bodhisattva cultivates these ten things, he'll attain extensive learning.",
        "source": "T14n0489_018:0747b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，即能攝受正法。",
        "translation": "If a bodhisattva cultivates ten kinds of dharmas, he'll be able to collect the right dharma.",
        "source": "T14n0489_018:0747b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、於後時後分後五百歲正法減沒時分轉易，諸有情等於佛教中安立邪道智燈隱滅。",
        "translation": "1. in the latter part of time and in the following 500 years, when the right teaching declines and the time period changes, sentient beings and others establish in Buddhism the wisdom lamp of a wrong path and become invisible.",
        "source": "T14n0489_018:0747b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當如是時，有能宣演如來所說廣大經典，作大利益具大威德，如諸法母能受持讀誦恭敬承事者，即能攝受正法；二者、為他宣說，令彼聽受開曉其義；三者、於彼修行正法人所，愛樂信重歡喜適悅，為彼攝受；四者、為他宣說正法，無所希望；五者、於說法師所起師尊想；六者、於其正法如甘露想；七者、如聖藥想；八者、如良藥想；九者、為求正法不惜身命；十者、求得法已修行圓滿。",
        "translation": "當如是時，有能宣演如來所說廣大經典，作大利益具大威德，如諸法母能受持讀誦恭敬承事者，即能攝受正法；二者、為他宣說，令彼聽受開曉其義；三者、於彼修行正法人所，愛樂信重歡喜適悅，為彼攝受；四者、為他宣說正法，無所希望；五者、於說法師所起師尊想；六者、於其正法如甘露想；七者、如聖藥想；八者、如良藥想；九者、為求正法不惜身命；十者、求得法已修行圓滿。",
        "source": "T14n0489_018:0747b28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747c08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，即能攝受正法。",
        "translation": "If bodhisattvas cultivate these ten kinds of qualities, they'll be able to collect the right teaching.",
        "source": "T14n0489_018:0747c08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747c09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，為法王子。",
        "translation": "If a bodhisattva cultivates ten kinds of principles, he'll be the prince of the Dharma.",
        "source": "T14n0489_018:0747c09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747c10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、具足諸相莊嚴；二者、身得諸隨形好；三者、眾相具足諸根圓滿；四者、於佛如來所親近處隨順親近；五者、於佛如來所行正道隨順而行；六者、於佛如來所覺悟法隨覺悟之；七者、救度世間一切苦惱；八者、善能修學一切聖行；九者、善能修習成諸梵行；十者、善住如來所住一切智城。",
        "translation": "1. they are fully endowed with the adornment of characteristics; 2. their bodies are endowed with various minor physical attributes; 3. their faculties are perfectly proportioned; 4. they follow the Tathāgata where he's near; 5. they follow the right path practiced by the Tathāgata; 6. they follow the Tathāgata's awakening process and awaken to it; 7. they save the world from all suffering and distress; 8. they well cultivate all noble actions; 9. they well cultivate the religious practices; and 10. they well abide in the city of omniscience where the Tathāgata resides.",
        "source": "T14n0489_018:0747c10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，為法王子。",
        "translation": "If a bodhisattva cultivates these ten kinds of qualities, he'll be the prince of the Dharma.",
        "source": "T14n0489_018:0747c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，即能超勝帝釋、梵王、護世天等。",
        "translation": "If a bodhisattva cultivates ten kinds of dharmas, he'll be able to surpass Indra, Brahmā, the world-protecting gods, and so forth.",
        "source": "T14n0489_018:0747c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、於佛菩提得不退轉；二者、不為諸魔所動；三者、不離一切佛法；四者、隨能解入諸法正理；五者、通達諸法平等；六者、不起他信；七者、於佛法中得善覺智；八者、不共一切聲聞緣覺同等；九者、出過一切世間；十者、證得無生法忍。",
        "translation": "1. attains irreversibility in the Buddha's enlightenment; 2. isn't moved by Māra; 3. doesn't part from all the Buddha's teachings; 4. enters into the correct principles of all teachings as he sees fit; 5. comprehends the equality of all teachings; 6. doesn't give rise to faith in others; 7. attains the wisdom of good awakening in the Buddha's teachings; 8. isn't equal to all śrāvakas and pratyekbuddhas; 9. transcends all the world; and 10. realizes the forbearance of the unborn Dharma.",
        "source": "T14n0489_018:0747c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0747c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，即能超勝帝釋、梵王、護世天等。",
        "translation": "If a bodhisattva cultivates these ten things, he'll be able to surpass Indra, Brahmā, the world-protecting gods, and so forth.",
        "source": "T14n0489_018:0747c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0747c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，能知有情意樂隨眠。",
        "translation": "\"If a bodhisattva cultivates ten kinds of dharmas, he'll be able to know the intentions and latencies of sentient beings.",
        "source": "T14n0489_018:0747c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0747c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、如實了知一切有情貪欲意樂；二者、了知瞋恚意樂；三者、了知愚癡意樂；四者、了知上品意樂；五者、了知中品意樂；六者、了知下品意樂；七者、了知諸善意樂；八者、了知堅固意樂；九者、了知常起隨眠；十者、了知暴惡隨眠。",
        "translation": "1. true knowledge of the desires and wishes of all sentient beings; 2. knowledge of the wishes of anger; 3. knowledge of the wishes of foolishness; 4. knowledge of the wishes of the higher qualities; 5. knowledge of the wishes of the middle qualities; 6. knowledge of the wishes of the lower qualities; 7. knowledge of the wishes of the good; 8. knowledge of the wishes of the resolute; 9. knowledge of the latent tendencies that always arise; and 10. knowledge of the latent tendencies that are violent.",
        "source": "T14n0489_018:0747c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等法，於一有情如實知已，乃至盡於諸有情界所知亦然。",
        "translation": "After truly knowing these things about a single sentient being, it's likewise true that they know them in their entirety in the realm of sentient beings.",
        "source": "T14n0489_018:0748a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0748a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，能知有情意樂隨眠。",
        "translation": "If a bodhisattva cultivates these ten kinds of principles, he'll be able to know the intentions and latencies of sentient beings.",
        "source": "T14n0489_018:0748a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0748a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，善知成熟有情之法。",
        "translation": "\"If a bodhisattva cultivates ten kinds of dharmas, he well knows the way to ripen sentient beings.",
        "source": "T14n0489_018:0748a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0748a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、應以諸佛色相而調伏者，即現佛相；二者、應以菩薩色相而調伏者，即現菩薩之相；三者、應以緣覺色相而調伏者，即現緣覺之相；四者、應以聲聞色相而調伏者，即現聲聞之相；五者、應以帝釋色相而調伏者，即現帝釋之相；六者、應以魔王色相而調伏者，即現魔王之相；七者、應以梵王色相而調伏者，即現梵王之相；八者、應以婆羅門色相而調伏者，即現婆羅門之相；九者、應以剎帝利色相而調伏者，即現剎帝利之相；十者、應以長者色相而調伏者，即現長者之相。",
        "translation": "一者、應以諸佛色相而調伏者，即現佛相；二者、應以菩薩色相而調伏者，即現菩薩之相；三者、應以緣覺色相而調伏者，即現緣覺之相；四者、應以聲聞色相而調伏者，即現聲聞之相；五者、應以帝釋色相而調伏者，即現帝釋之相；六者、應以魔王色相而調伏者，即現魔王之相；七者、應以梵王色相而調伏者，即現梵王之相；八者、應以婆羅門色相而調伏者，即現婆羅門之相；九者、應以剎帝利色相而調伏者，即現剎帝利之相；十者、應以長者色相而調伏者，即現長者之相。",
        "source": "T14n0489_018:0748a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0748a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有情等應以如是種種色相而調伏者，菩薩即能隨所應現別異之相。",
        "translation": "\"When sentient beings and others should be disciplined by such a variety of forms, the bodhisattva can show different forms as appropriate.",
        "source": "T14n0489_018:0748a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0748a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，善知成熟有情之法。",
        "translation": "If a bodhisattva cultivates these ten kinds of things, he well knows the way to ripen sentient beings.",
        "source": "T14n0489_018:0748a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0748a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，得勝樂住。",
        "translation": "If a bodhisattva cultivates ten kinds of things, he'll attain an abode of superior joy.",
        "source": "T14n0489_018:0748a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0748a22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、正直；二者、柔軟；三者、無諂曲心；四者、無瞋恚心；五者、無染污心；六者、具清淨心；七者、無麁獷語；八者、斷穢惡語；九者、常行忍辱；十者、具善愛樂。",
        "translation": "1. upright; 2. gentle; 3. without flattery; 4. without anger; 5. without a defiled mind; 6. with a pure mind; 7. without harsh words; 8. cutting off harsh speech; 9. always practicing forbearance; and 10. endowed with good intentions.",
        "source": "T14n0489_018:0748a22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0748a26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，得勝樂住。",
        "translation": "If a bodhisattva cultivates these ten things, he'll attain an excellent and happy abode.",
        "source": "T14n0489_018:0748a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_018:0748a27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，得安樂住。",
        "translation": "If a bodhisattva cultivates ten kinds of things, he'll attain a comfortable abode.",
        "source": "T14n0489_018:0748a27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_018:0748a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、正見具足；二者、具見清淨戒行圓滿；三者、儀範清淨；四者、隨順所行境界；五者、不雜諸煩惱住；六者、得無過失；七者、具修梵行；八者、得其同類；九者、住一乘道；十者、不事餘師。",
        "translation": "1. their right view is complete; 2. they have a clear view and a complete moral practice; 3. their manner is pure; 4. they follow the sphere of practice; 5. they abide unadulterated by afflictions; 6. they attain freedom from error; 7. they are fully cultivating the religious practice; 8. they attain the same; 9. they abide on the One Vehicle path; 10. they don't serve other teachers.",
        "source": "T14n0489_018:0748a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_018:0748b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，得安樂住。",
        "translation": "If a bodhisattva cultivates these ten kinds of things, he'll attain a peaceful abode.",
        "source": "T14n0489_018:0748b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說除蓋障菩薩所問經卷第十八",
        "translation": "Foshuo chugai hindrances pusa suowen jing roll no. 18",
        "source": "T14n0489_018:0748b05_0",
        "is_bad_quality": false
    }
]