[
    {
        "source_sentence": "阿難問事佛吉凶經",
        "translation": "Sutra on Anan's Inquiry into the Buddha's Fortunes and Fatalities",
        "source": "T14n0492b_001:0754c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後漢沙門安世高譯",
        "translation": "Latter Han śramaṇa An Shigao Translation",
        "source": "T14n0492b_001:0754c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言：「有人事佛得富貴諧偶者，有衰耗不諧偶者，云何不等同耶？",
        "translation": "Ānanda said to the Buddha, \"Suppose there's someone who serves the Buddha and becomes wealthy and prosperous, and there's someone who's wasted and not in harmony with him, why aren't they the same?",
        "source": "T14n0492b_001:0754c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願天中天普為說之。」",
        "translation": "May the gods of gods explain it to you universally.\"",
        "source": "T14n0492b_001:0754c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「有人奉佛，從明師受戒，專信不犯，精進奉行，不失所受。",
        "translation": "The Buddha told Ānanda, \"Suppose there's a person who follows the Buddha, receives the precepts from a wise teacher, has devoted faith, doesn't violate them, and diligently practices them without losing what they've received.",
        "source": "T14n0492b_001:0754c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形像鮮明，朝暮禮拜，恭敬然燈。",
        "translation": "Their appearance is vivid, they venerate them morning and evening, and they respect the lamp.",
        "source": "T14n0492b_001:0754c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨施所安，不違道禁，齋戒不厭，心中欣欣；常為諸天、善神擁護，所向諧偶，百事增倍；為天龍、鬼神、眾人所敬，後必得道。",
        "translation": "They are always protected by gods and good spirits, are in harmony with what they seek, and multiply their abilities; they are honored by gods, dragons, ghosts, and people, and will surely attain the way later.",
        "source": "T14n0492b_001:0754c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，真佛弟子也。",
        "translation": "These good sons and good women are truly disciples of the Buddha.",
        "source": "T14n0492b_001:0754c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有人事佛，不值善師，不見經教，受戒而已。",
        "translation": "\"Some people serve the Buddha, don't meet a good teacher, don't see the sūtras and teachings, and simply accept the precepts.",
        "source": "T14n0492b_001:0754c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示有戒名，憒塞不信，違犯戒律，乍信乍不信，心意猶豫。",
        "translation": "They are shown the names of the precepts, but they don't believe in them as an outsider, violate the precepts, are first convinced and then don't believe them, and are hesitant.",
        "source": "T14n0492b_001:0754c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦無經像恭恪之心，既不燒香、然燈、禮拜，恒懷狐疑。",
        "translation": "They don't respect the image of the sūtras, don't burn incense or lanterns, and don't pay homage, and they're always suspicious.",
        "source": "T14n0492b_001:0754c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋恚罵詈，惡口嫉賢，又不六齋，殺生趣手。",
        "translation": "He ridicules people with anger, hates good people with harsh words, doesn't observe the six precepts, and kills people to get his hands on them.",
        "source": "T14n0492b_001:0754c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不敬佛經，持著弊篋、衣服不淨之中；或著妻子床上不淨之處；或持掛壁，無有座席恭敬之心，與世間凡書無異。",
        "translation": "They don't respect the Buddha's sūtras, carry their filthy bags and clothes in unclean places, put them on their wives' beds in unclean places, or hang them on the wall, lacking a seat and respectful attitude, no different from ordinary people in the world.",
        "source": "T14n0492b_001:0754c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若疾病者，狐疑不信，便呼巫師，卜問解奏，祠祀邪神，天神離遠，不得善護，妖魅日進，惡鬼屯門，令之衰耗，所向不諧。",
        "translation": "When a person is sick and doubts and doesn't believe it, they call a witch, ask questions, explain, and perform rituals to evil spirits; the gods are distant and can't protect them well; demons and ghosts advance day by day; evil spirits in Tuen Mun decimate them; and they are destined to become discordant.",
        "source": "T14n0492b_001:0754c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或從宿行惡道中來，現世罪人也，非佛弟子，死當入泥犁中被拷掠治。",
        "translation": "Perhaps they came from a bad path in a prior lifetime, are sinners in the present life, aren't disciples of the Buddha, and will be tortured and punished in a mudhole when they die.",
        "source": "T14n0492b_001:0754c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由其罪故，現自衰耗，後復受殃，死趣惡道，展轉受痛，酷不可言，皆由積惡其行不善。",
        "translation": "As a result of their sins, they'll be weakened in the present, suffer subsequent misfortune, and go to a bad destiny at death, where they'll experience pain in turn that defies explanation, all because of the accumulation of evil and their unskillful actions.",
        "source": "T14n0492b_001:0754c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「愚人盲盲，不思宿行因緣所之，精神報應，根本從來，謂言事佛致是衰耗。",
        "translation": "\"A foolish man is blind and doesn't consider the causes and conditions of past lives and the spiritual rewards that come from their roots, saying that serving the Buddha causes this to be a debilitating experience.",
        "source": "T14n0492b_001:0754c27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不止前世宿祚無功，怨憎天地，責聖咎天，世人迷惑，不達乃爾。",
        "translation": "It's not just that their past lives were meritless, that they resent heaven and earth, that they blame sages and gods, and that people are confused and don't attain them.",
        "source": "T14n0492b_001:0754c29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不達之人，心懷不定，而不堅固，進退失理，違負佛恩而無返覆，遂為三塗所見綴縛，自作禍福。",
        "translation": "Those who don't attain it have uncertain and unsteady minds, lose their reasoning for advancing and retreating, and violate the Buddha's kindness without returning, which then binds them to the views of the three destinies and creates its own misfortune.",
        "source": "T14n0492b_001:0755a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪識之緣，種之得本，不可不慎，十惡怨家，十善厚友，安神得道，皆從善生。",
        "translation": "The ten evil enemies and ten good and generous friends, who attain the path of tranquility, all arise from goodness.",
        "source": "T14n0492b_001:0755a04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善為大鎧，不畏刀兵；善為大船，可以度水。",
        "translation": "Goodness is a great armor that doesn't fear swords, and goodness is a great ship that can cross the water.",
        "source": "T14n0492b_001:0755a06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有能守信，室內和安，福報自然，從善至善，非神授與也。",
        "translation": "If someone can keep their faith, their home will be peaceful, and the rewards of goodness will come naturally, from goodness to goodness, not from a divine mandate.",
        "source": "T14n0492b_001:0755a07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今復不信者，從後轉復劇矣！」",
        "translation": "Those who don't believe now will have a hard time in the future!\"",
        "source": "T14n0492b_001:0755a08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T14n0492b_001:0755a09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡追人，如影逐形，不可得離。",
        "translation": "Good and evil pursue people like shadow following form, and it's impossible to escape.",
        "source": "T14n0492b_001:0755a09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪福之事，亦皆如是，勿作狐疑，自墮惡道！",
        "translation": "All things that are sinful and beneficial are likewise, so don't falsely doubt them and fall into a bad path yourself!",
        "source": "T14n0492b_001:0755a10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪福分明，諦信不迷，所在常安；佛語至誠，終不欺人。」",
        "translation": "Their sins and merits are clearly delineated, their true belief is not misconstrued, and their location is always secure; the Buddha's words are perfectly sincere, and he never deceives anyone.\"",
        "source": "T14n0492b_001:0755a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告阿難：「佛無二言，佛世難值，經法難聞，汝宿有福，今得侍佛。",
        "translation": "Again, the Buddha told Ānanda, \"The Buddha doesn't have two words, and it's difficult to meet buddhas in this world and difficult to hear the sūtras and teachings; you've been blessed in the past and now have the privilege of serving the Buddha.",
        "source": "T14n0492b_001:0755a12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當念報恩，頒宣法教，示現人民，為作福田，信者得植，後生無憂。」",
        "translation": "Be mindful of repaying kindness, bestowing the teaching of the Dharma, and showing it to the people as a field of merit where those who believe in it can be planted and have no worries in later life.\"",
        "source": "T14n0492b_001:0755a14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難受教，奉行普聞。",
        "translation": "Ānanda accepted the teaching, approved of its practice, and heard it universally.",
        "source": "T14n0492b_001:0755a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「人不自手殺者，不自手殺為無罪耶？」",
        "translation": "Ānanda then said to the Buddha, \"Suppose a person doesn't kill with their own hands, does it mean they're without fault if they don't kill with their own hands?\"",
        "source": "T14n0492b_001:0755a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T14n0492b_001:0755a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教人殺生，重於自殺也。",
        "translation": "Teaching someone to kill is more important than killing oneself.",
        "source": "T14n0492b_001:0755a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0492b_001:0755a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或是奴婢愚小下人，不知罪福；或為縣官所見促逼，不自出意，雖獲其罪，事意不同，輕重有差。",
        "translation": "Perhaps a slave or servant is a foolish little subordinate who doesn't know the good from the evil, or they're forced by a magistrate who sees them and doesn't tell them what to do, even though their crimes are different in intent and there are differences in severity.",
        "source": "T14n0492b_001:0755a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教人殺者，知而故犯，陰懷愚惡，趣手害生，無有慈心；欺罔三尊，負於自然神，傷生杌命，其罪莫大！",
        "translation": "Someone who teaches someone to kill, knowingly and deliberately violates the law, harbors folly and evil in their mind, and goes out to harm life without compassion; they deceive the three honored ones, fail the nature spirits, and harm life and death, which is a terrible sin!",
        "source": "T14n0492b_001:0755a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "怨對相報，世世受殃，無有斷絕。",
        "translation": "As enemies are confronted, they are subject to worldly retribution without ever being stopped.",
        "source": "T14n0492b_001:0755a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現世不安，數逢災凶；死入地獄，出離人形，當墮畜中，為人屠截，三塗八難，巨億萬劫，以肉供人，未有竟時，令身困苦，噉草飲泉。",
        "translation": "They'll be unsettled in the present life, encounter numerous disasters and calamities, die in hell, escape from human form, and fall into the animal kingdom, where they'll be slaughtered by humans, subjected to three destinies and eight difficulties for hundreds of millions of eons, offered meat to humans, and, before their time is up, make themselves miserable and eat grass and drink from springs.",
        "source": "T14n0492b_001:0755a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世現有是輩畜獸，皆由前世得為人時，暴逆無道，陰害傷生，不信致此。",
        "translation": "This group of animals existing in this world all began when they became humans in a previous life, became violent and immoral, and harmed rebirth in the negative, which led to this disbelief.",
        "source": "T14n0492b_001:0755a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世世為怨，還相報償，神同形異，罪深如是。」",
        "translation": "They were enemies from generation to generation and returned to each other in retribution, and their spirits were the same in form and different in kind, making their crimes so profound.\"",
        "source": "T14n0492b_001:0755a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「世間人及弟子，惡意向師及道德之人，其罪云何？」",
        "translation": "Ānanda then said to the Buddha, \"What are the sins of the world, its disciples, teachers of evil intent, and people of virtue?\"",
        "source": "T14n0492b_001:0755b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「夫為人者，當愛樂人善，不可嫉之。",
        "translation": "The Buddha said to Ānanda, \"A human being should delight in the goodness of others and not be jealous of them.",
        "source": "T14n0492b_001:0755b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有惡意，向道德之人、善師者，是惡意向佛無異也。",
        "translation": "When people have ill intent and turn to a moral person or a good teacher, that's no different than harsh intent toward the Buddha.",
        "source": "T14n0492b_001:0755b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧持萬石弩自射身，不可惡意向之。」",
        "translation": "You'd better shoot yourself with a crossbow made of ten thousand stones than harshly intent on him.\"",
        "source": "T14n0492b_001:0755b05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T14n0492b_001:0755b06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自射身為痛不？」",
        "translation": "Does it hurt to shoot oneself in the body?\"",
        "source": "T14n0492b_001:0755b06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「甚痛，甚痛！",
        "translation": "Ānanda said, \"That hurts, that hurts!",
        "source": "T14n0492b_001:0755b07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T14n0492b_001:0755b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人持惡意，向道德人、其善師者，痛劇弩射身也。",
        "translation": "The Buddha said, \"A person holding ill will toward a moral person or his good teacher will be shot with a painful crossbow.",
        "source": "T14n0492b_001:0755b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為人弟子，不可輕慢其師、惡意向道德人，當視之如佛，不可輕嫉，見善代其歡喜。",
        "translation": "As a disciple, you mustn't despise your teacher or badly intend a moral person; you must treat them like a Buddha, not despise them, and rejoice when you see a good person.",
        "source": "T14n0492b_001:0755b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有戒德者，感動諸天，天龍、鬼神莫不敬尊。",
        "translation": "A person with virtue for morality touches the gods, and gods, dragons, and ghosts venerate him.",
        "source": "T14n0492b_001:0755b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧投身火中，利劍割肉，慎莫嫉妬人之善。",
        "translation": "Rather than plunge into the fire and cut your flesh with a sharp sword, be careful not to envy the goodness of others.",
        "source": "T14n0492b_001:0755b12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其罪不小，慎之！",
        "translation": "This is not a trivial offense; be careful!",
        "source": "T14n0492b_001:0755b13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慎之！」",
        "translation": "Be careful!\"",
        "source": "T14n0492b_001:0755b13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「為人師者，為可得呵遏弟子，不從道理，以有小過，遂之成大，可無罪不？」",
        "translation": "Ānanda again said to the Buddha, \"Would it be possible for a teacher to scold a disciple, not follow reason, and make a minor mistake and have it become a major one, so that he's not guilty?\"",
        "source": "T14n0492b_001:0755b13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不可！",
        "translation": "The Buddha said, \"No!",
        "source": "T14n0492b_001:0755b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可！",
        "translation": "Unacceptable!",
        "source": "T14n0492b_001:0755b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師、弟子義，義感自然，當相訊厚，視彼如己；黜之以理，教之以道，己所不行，勿施於人，弘崇禮律，不使怨訟；弟子亦爾。",
        "translation": "\"A teacher and a disciple are natural in their sense; they should exchange pleasantries and generosity, treating one another as themselves; they should depose them in principle, teach them the way; they should not do unto others what they don't approve of; they should promote propriety and discipline; and they should not bring enmity; so should the disciple.",
        "source": "T14n0492b_001:0755b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二義真誠，師當如師，弟子當如弟子，勿相誹謗，含毒致怨，以小成大，還自燒身。",
        "translation": "When the two meanings are genuine, the teacher should act like a teacher, and the disciple should act like a disciple; don't denigrate each other, contain poison, and cause enmity; make the lesser into the greater, and burn yourself to the ground.",
        "source": "T14n0492b_001:0755b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為人弟子，當孝順於善師，慎莫舉惡意向師。",
        "translation": "As a disciple, he should be dutiful and obedient to a good teacher, and he should be careful not to raise a teacher with bad intentions.",
        "source": "T14n0492b_001:0755b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡意向師，是惡意向佛、向法、向比丘僧、向父母無異，天所不覆，地所不載。",
        "translation": "A teacher with evil intentions is no different than a teacher with evil intentions toward the Buddha, Dharma, monks, and parents, and is not covered by heaven or carried by earth.",
        "source": "T14n0492b_001:0755b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀末世人諸惡人輩，不忠、不孝，無有仁義，不順人道。",
        "translation": "They are unfaithful, unfilial, lacking in kindness and righteousness, and disobedient to humanity.",
        "source": "T14n0492b_001:0755b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔世比丘四數之中，但念他惡，不自止惡，嫉賢妬善，更相沮壞；不念行善，強梁嫉賢，既不能為，復毀敗人，斷絕道意，令不得行。",
        "translation": "Among the four categories of monks in the evil world, those who are mindful of the evil of others and don't stop evil themselves are jealous of goodness and further discourage it; those who aren't mindful of practicing goodness and are forceful and jealous of goodness can't do it, but they also slander others and cut off the will of the path, making it impossible to practice.",
        "source": "T14n0492b_001:0755b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪欲務俗，多求利業，積財自喪，厚財賤道，死墮惡趣大泥犁中、餓鬼、畜生。",
        "translation": "They crave worldly pursuits and seek lots of profitable activities, accumulate wealth to bring about their own ruin, and become rich and lowly in the path, falling into the misfortune of dying in a great mire, a hungry ghost, or an animal life.",
        "source": "T14n0492b_001:0755b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未當有此，於世何求念報佛恩？",
        "translation": "If this doesn't happen, how can they seek to repay the Buddha's kindness in the world?",
        "source": "T14n0492b_001:0755c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當持經戒，相率以道；道不可不學，經不可不讀，善不可不行。",
        "translation": "\"You must observe the precepts of the sūtras and lead each other on the path; the path must not be left unlearned, the sūtras must not be left unread, and goodness must not be left undone.",
        "source": "T14n0492b_001:0755c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行善布德，濟神離苦，超出生死，見賢勿慢，見善勿謗，不以小過證入大罪。",
        "translation": "Doing good deeds and disseminating virtue will help the gods escape suffering and transcend birth and death; don't be arrogant when you see good people, don't denigrate when you see good people, and don't realize a great transgression by a minor one.",
        "source": "T14n0492b_001:0755c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "違法失理，其罪莫大，罪福有證，可不慎耶！」",
        "translation": "An infraction that violates the law and misses the principle is a greater offense, and there's realization of guilt and merit; you can't be careful!\"",
        "source": "T14n0492b_001:0755c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「末世弟子，因緣相生，理家之事，身口之累，當云何？",
        "translation": "Ānanda again said to the Buddha, \"Disciples of the latter age, what will be the causes and conditions that give rise to the affairs of the principle family and the burdens of body and speech?",
        "source": "T14n0492b_001:0755c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天中天！」",
        "translation": "Deva-China!\"",
        "source": "T14n0492b_001:0755c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T14n0492b_001:0755c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有受佛禁戒，誠信奉行，順孝畏慎，敬歸三尊，養親盡忠，內外謹善，心口相應，可得為世間事，不可得為世間意。」",
        "translation": "Those who accept the Buddha's forbidden precepts, sincerely believe and practice them, are obedient, filial, fearful, and prudent, revere the three honored ones, nurture their relatives, are loyal, are careful inside and out, and are cooperative in mind and speech can attain worldly affairs and can't attain worldly aspirations.\"",
        "source": "T14n0492b_001:0755c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「世間事，世間意，云何耶？",
        "translation": "Ānanda said, \"Mundane affairs and mundane intentions, what are they?",
        "source": "T14n0492b_001:0755c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天中天！」",
        "translation": "Deva-China!\"",
        "source": "T14n0492b_001:0755c11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「為佛弟子，可得商販營生利業，平斗直尺，不可罔於人，施行以理，不違神明自然之理。",
        "translation": "The Buddha said, \"As a disciple of the Buddha, you can engage in lucrative business as a trader, level the bucket and straighten the ruler, don't be reckless with people, and carry out tasks according to principle that don't contradict the natural principles of the gods.",
        "source": "T14n0492b_001:0755c12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "葬送之事，移徙、姻娶，是為世間事也。",
        "translation": "Mourning and funeral arrangements, migration, and marriage are worldly affairs.",
        "source": "T14n0492b_001:0755c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世間意者，為佛弟子，不得卜問、請祟、符呪、厭怪、祠祀、解奏，亦不得擇良日、良時。",
        "translation": "\"A worldly person who's a disciple of the Buddha mustn't divine, solicit spirits, request charms, perform spells, hate strange things, conduct shrines, or interpret music, and they mustn't choose good days or times.",
        "source": "T14n0492b_001:0755c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受佛五戒，福德人也，有所施作，當啟三尊；佛之玄通，無細不知。",
        "translation": "Those who accept the Buddha's five precepts are men of virtue who will reveal to the three honored ones what they've done; there's nothing subtle or profound about the Buddha that they don't know.",
        "source": "T14n0492b_001:0755c17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒德之人，道護為強，役使諸天、天龍、鬼神，無不敬伏。",
        "translation": "A virtuous person who observes the precepts has a strong protector of the Way, and he commands the respect of gods, celestials, dragons, and demons.",
        "source": "T14n0492b_001:0755c18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒貴則尊，無往不吉，豈有忌諱不善者耶！",
        "translation": "When precepts are honored, they're revered, and there's nothing that isn't fortunate, so why wouldn't there be those who fear what's unwholesome?",
        "source": "T14n0492b_001:0755c20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「道之含覆，包弘天地，不達之人，自作罣礙。",
        "translation": "\"The encompassing nature of the path encompasses both heaven and earth, and those who don't attain it create their own obstacles.",
        "source": "T14n0492b_001:0755c21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡之事，由人心作，禍福由人，如影追形，響之應聲。",
        "translation": "Good and evil deeds are created by the mind, and woe and fortune are caused by people, just as shadow follows form and echoes sound.",
        "source": "T14n0492b_001:0755c22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒行之德，應之自然，諸天所護，願不意違，感動十方，與天參德；功勳巍巍，眾聖嗟歎，難可稱量！",
        "translation": "The virtues of moral conduct are naturally associated with them, are protected by the gods, are not disagreed with by wishing for them, move the ten directions, and participate in the virtues of the gods; their merit is so great that the sages admire it, and it's difficult to measure it!",
        "source": "T14n0492b_001:0755c23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智士達命，沒身不邪，善如佛教，可得度世之道。」",
        "translation": "A wise man attains life, doesn't abandon himself to evil, and is well-versed in Buddhism, so he can attain salvation on the worldly path.\"",
        "source": "T14n0492b_001:0755c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難聞佛說，更整袈裟，頭腦著地：「唯然，世尊！",
        "translation": "Hearing what the Buddha said, Ānanda adjusted his robe and put his head on the ground, \"Yes, Bhagavān!",
        "source": "T14n0492b_001:0755c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等有福，得值如來，普恩慈大，愍念一切，為作福田，令得脫苦。",
        "translation": "We are fortunate to have found the Tathāgata, who is universally kind and compassionate, pities all people, and makes them a field of merit, so that they can escape suffering.",
        "source": "T14n0492b_001:0755c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言至真，而信者少，是世多惡，眾生相詛，甚可痛哉！",
        "translation": "The Buddha's words are most true, but few people believe them; this world is full of evil, and sentient beings are cursed by each other.",
        "source": "T14n0492b_001:0755c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有信者，若一若兩，奈何世惡，乃弊如此！",
        "translation": "If there is faith, whether it's one or two, why is the world so evil?",
        "source": "T14n0492b_001:0756a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛滅度後，經法雖存而無信者，漸衰滅矣！",
        "translation": "After the Buddha's death, even though the scriptures and teachings exist, those who lack faith in them are gradually dying out!",
        "source": "T14n0492b_001:0756a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嗚呼！",
        "translation": "Whoo-hoo!",
        "source": "T14n0492b_001:0756a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛哉！",
        "translation": "What a pain!",
        "source": "T14n0492b_001:0756a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將何恃怙？",
        "translation": "What will be the basis?",
        "source": "T14n0492b_001:0756a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願世尊，為眾黎故，未可取泥洹。」",
        "translation": "May the Bhagavān wish that, for the sake of all the people, nirvāṇa might not yet be attained.\"",
        "source": "T14n0492b_001:0756a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難因而諫頌曰：「佛為三界護，　　恩廣普慈大，　願為一切故，　　未可取泥洹。",
        "translation": "Ānanda then remonstrated with this verse, \"The Buddha protects the three realms, his kindness is vast and universally compassionate, and he wishes that for the sake of all people, nirvāṇa could not yet be attained.",
        "source": "T14n0492b_001:0756a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　值法者亦少，　　盲盲不別真，　痛矣不識者，　　罪深乃如是！",
        "translation": "Those who meet the teaching are also few, blind and don't discern the truth, and those who are painfully unaware of it have committed a deep sin like this!",
        "source": "T14n0492b_001:0756a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宿福值法者，　　若一若有兩，　經法稍稍替，　　當復何恃怙！",
        "translation": "\"If there's one or two who have attained the Dharma from prior merits, and the scriptures and the Dharma are slightly replaced, what else will they rely on?",
        "source": "T14n0492b_001:0756a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛恩非不大，　　罪由眾生故，　法鼓震三千，　　如何不得聞？",
        "translation": "The Buddha's kindness is not insignificant; it's because of sentient beings that sins are committed; the Dharma drum shakes three thousand; how can it not be heard?",
        "source": "T14n0492b_001:0756a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世濁多惡人，　　還自墮顛倒，　諛諂諀訾聖，　　邪媚毀正真。",
        "translation": "Many of the world's turbid people are still deluded, flattering and criticizing the noble, and flattering and disparaging the true.",
        "source": "T14n0492b_001:0756a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不信世有佛，　　言佛非大道，　是人是非人，　　自作眾罪本。",
        "translation": "They don't believe there's a worldly Buddha, saying that the Buddha is not the Great Way, that this is a person or a non-person, and that they themselves are the cause of many sins.",
        "source": "T14n0492b_001:0756a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　命盡往無擇，　　刀劍解身形，　食鬼好伐殺，　　鑊湯涌其中。",
        "translation": "Their lives are ended, they go without judgment, their bodies are disintegrated by the sword, and they are slaughtered by hungry ghosts who like to eat, and woons and baths well up in them.",
        "source": "T14n0492b_001:0756a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　婬泆抱銅柱，　　大火相燒然，　誹謗清高士，　　鐵鉗拔其舌。",
        "translation": "They lustfully embrace a copper pillar, burn it up with a great fire, denigrate a noble man, and pull out his tongue with iron forceps.",
        "source": "T14n0492b_001:0756a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亂酒無禮節，　　迷惑失人道，　死入地獄中，　　洋銅沃其口。",
        "translation": "They get drunk without restraint, lose their humanity through delusion, and go to hell where they die, with foreign copper to wet their mouths.",
        "source": "T14n0492b_001:0756a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遭逢眾厄難，　　毒痛不可言，　若生還為人，　　下賤貧窮中。",
        "translation": "He'll meet with many misfortunes and suffer pain unspeakable, or he'll be reborn as a human being, humble and poor.",
        "source": "T14n0492b_001:0756a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不殺得長壽，　　無病常康強；　不盜後大富，　　錢財恒自滿；　不婬香清淨，　　身體鮮苾芬，　光影常奕奕，　　上則為大王；　至誠不欺詐，　　為眾所奉承；　不醉後明了，　　德慧所尊敬。",
        "translation": "Not killing obtains a long life, and he's always healthy and strong without illness; he becomes wealthy after not stealing, and his money is always fulfilled; his body is fresh and fragrant after not committing sexual misconduct; his appearance is always brilliant, and he's a great king up there; he's sincere and not deceptive, and he's well-appreciated by everyone; he's clear and insightful after not getting drunk, and he's respected by virtue and wisdom.",
        "source": "T14n0492b_001:0756a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五福超法出，　　天人同儔類，　所生億萬倍，　　真諦甚分明。",
        "translation": "The five merits transcend the Dharma and arise from the same class of gods and humans, producing billions of times over, and their true truth is well understood.",
        "source": "T14n0492b_001:0756b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　末世諸惡人，　　不信多狐疑，　愚癡不別道，　　罪深更逮冥！",
        "translation": "Evil people of the latter age are unbelieving, doubtful, foolish, and undiscriminating, and their crimes are deeper and darker than ever!",
        "source": "T14n0492b_001:0756b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　蔽聖毀正覺，　　死入大鐵城，　識神處其中，　　頭上戴鐵輪。",
        "translation": "Obscuring the noble and disrupting the right awakening, they die and enter the great iron city, where consciousnesses and spirits are placed, wearing iron wheels on their heads.",
        "source": "T14n0492b_001:0756b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　求死不得死，　　須臾已變形，　矛戟相毒刺，　　軀體恒殘截。",
        "translation": "Seeking death but not dying, they are transformed in a moment, and their bodies are permanently mutilated by the poisonous thrusts of spears and pikes.",
        "source": "T14n0492b_001:0756b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　奈何世如是，　　背正信鬼神，　解奏好卜問，　　祭祀傷不仁，　死墮十八處，　　經歷黑繩獄，　八難為界首，　　得復人身難。",
        "translation": "Such is the world, which deviates from correct belief in ghosts and spirits, plays charades, performs rituals to harm unkindness, falls into 18 places of death, experiences a black-rope hell, heads a class of eight difficulties, and has difficulty regaining possession of a human body.",
        "source": "T14n0492b_001:0756b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若時得為人，　　蠻狄無義理，　癡騃無孔竅，　　跛躄瘂不語，　朦朧不達事，　　惡惡相牽拘，　展轉眾徒聚，　　禽獸六畜形；　為人所屠割，　　剝皮視其喉，　歸償宿怨對，　　以肉給還人。",
        "translation": "If they then become human beings, they'll be barbarians without sense or reason, deluded without orifices, lame and dumb without speech, obscure and unable to comprehend tasks, bound by evil, carried about by a multitude of disciples, shaped like animals or six animals, slaughtered by humans, stripped of their skin and examined for their throats, given back to repay a long-standing grudge, and given back to others with their flesh.",
        "source": "T14n0492b_001:0756b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無道墮惡道，　　求脫甚為難，　人身既難得，　　佛經難得聞。",
        "translation": "Without a path, they fall into a bad destiny; seeking liberation is extremely difficult; since the human body is difficult to obtain, it's difficult to hear the Buddha's sūtras.",
        "source": "T14n0492b_001:0756b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊為眾祐，　　三界皆蒙恩，　敷動甘露法，　　令人普奉行。",
        "translation": "The Bhagavān gives blessings to all people, honors all three realms, and spreads the sweet dharma, causing people to universally approve of it.",
        "source": "T14n0492b_001:0756b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　哀哉已得慧，　　愍念群萌故，　開通示道徑，　　黠者即度苦。",
        "translation": "It's sad that he has attained wisdom, and because he's sympathetic to the sentient, he opens the path and shows it to the intelligent, so they can escape suffering.",
        "source": "T14n0492b_001:0756b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　福人在向向，　　見諦學不生，　自歸大護田，　　植種不死地。",
        "translation": "The fortunate are those who go toward, see the truth and train, return to the field of great protection, and plant the ground of immortality.",
        "source": "T14n0492b_001:0756b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恩大莫過佛，　　世祐轉法輪，　願使一切人，　　得服甘露漿。",
        "translation": "Greater in merit than the Buddha, World Honored One turns the wheel of the Dharma, may all people be made to drink nectar.",
        "source": "T14n0492b_001:0756c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慧船到彼岸，　　法磬引大千，　彼我無有二，　　發願無上真。」",
        "translation": "The ship of wisdom reaches the other shore, the Dharma chime leads to a great chiliocosm, there's no duality between them and me, and the vow is unsurpassed and true.\"",
        "source": "T14n0492b_001:0756c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難頌如是已，諸會大眾，一時信解，皆發無上正真之道，僧那大鎧甘露之意，香熏三千，從是得度，開示道地，為作橋梁。",
        "translation": "After Ānanda spoke thus, the assembled people were instantly convinced and all aroused to the unsurpassed true path, and the nectar of the great armor of Śāna perfumed 3,000 people, who were thus liberated, was shown the path and made a bridge.",
        "source": "T14n0492b_001:0756c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王、臣民、天龍、鬼神，聞經歡喜，阿難所說，且悲、且恐。",
        "translation": "Kings, subjects, gods, dragons, and spirits rejoiced when they heard the sūtras, and Ananda's teaching was both pitiable and frightening.",
        "source": "T14n0492b_001:0756c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稽首佛足，及禮阿難，受教而去。",
        "translation": "They bowed their heads at the Buddha's feet, paid homage to Ānanda, accepted the teaching, and departed.",
        "source": "T14n0492b_001:0756c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難問事佛吉凶經",
        "translation": "Sutra on Ānanda's Questions to the Buddha About Good and Evil",
        "source": "T14n0492b_001:0756c11_0",
        "is_bad_quality": false
    }
]