[
    {
        "source_sentence": "佛說稱揚諸佛功德經卷下",
        "translation": "Foshuo xiaoyang zhoufo gongde jing rolled up and down",
        "source": "T14n0434_003:0099a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏天竺三藏吉迦夜譯",
        "translation": "Yuan Wei Tianzhu Tripiṭaka Jikāyānīya Translation",
        "source": "T14n0434_003:0099a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_003:0099a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西方去此度十萬億佛剎，有世界名曰安樂，其國有佛號阿彌陀如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the west, there's a world named Anāthapiṇḍada, which has buddhas named Amitâbha Tathāgata, Zhijin, Zhengjue, Mingxing Cheng, Shanjian, Shijian Jie, Wushangshi, Daofayu, and Tianren zhushi, who are called Blessed Ones and who save measureless people.",
        "source": "T14n0434_003:0099a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有得聞無量壽如來名者，一心信樂，持諷誦念，當起廣遠無量歡喜安立其意，令使真諦十萬億信心念斯如來，其人當得無量之福，永當遠離三塗之厄，命終之後皆當往生彼佛剎土。",
        "translation": "If someone hears the name of the Tathāgata of Immeasurable Life and whole-heartedly believes in it, recites it, recites it, arouses widespread and immeasurable joy, establishes his intention, and causes him to truly believe in the Tathāgata for a hundred thousand million times, that person will attain immeasurable merit, will forever be freed from the troubles of the three destinies, and will be reborn in that Buddha's buddha land when his life ends.",
        "source": "T14n0434_003:0099a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命欲終時一心信樂，念不忘捨阿彌陀佛，將諸眾僧住其人前，魔終不能毀壞斯等正覺之心。",
        "translation": "When his life is about to end, he'll be unified in faith and happiness, never forgetting to abandon Amitâbha, and will have all the saṃgha abide in front of him, so that Māra will never be able to destroy his mind of perfect awakening.",
        "source": "T14n0434_003:0099a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0434_003:0099a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛、世尊興立大悲，誓度一切無量眾生，亦復護持十方世界一切眾生。",
        "translation": "That Buddha or Bhagavān arouses great compassion, vowing to save all sentient beings without measure and also to protect all sentient beings in the world in the ten directions.",
        "source": "T14n0434_003:0099a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得生安樂世界，當於其中具滿如來正覺之慧。",
        "translation": "Those who are born in the world of well-being will have the full possession of the Tathāgata's correctly enlightened wisdom there.",
        "source": "T14n0434_003:0099a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T14n0434_003:0099a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛、世尊本求誓願，其有求於第一之乘，於其世界具滿如來諸佛之法，具正覺分；求聲聞乘，於彼佛剎得阿羅漢。",
        "translation": "\"The buddhas and world-honored ones originally sought the vow that if someone sought the first vehicle, their world would be replete with the teachings of the tathāgatas and full of the factors of right awakening, and that if someone sought the vehicle of the direct disciples, they'd attain arhatship at that buddha-stage.",
        "source": "T14n0434_003:0099a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有往生彼佛剎者，從其所願大、小之乘，於彼畢滿。",
        "translation": "Those who go to be reborn at that buddha-base will follow their vows for the greater and lesser vehicles, and they'll attain their completion there.",
        "source": "T14n0434_003:0099a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有最後聞阿彌陀如來名號，讚說之者，信不狐疑，當起敬心至意念之，如念父母。",
        "translation": "Those of you who last heard the name of Amitâbha as the Tathāgata and praised it, believe it, don't doubt it, and give it your respectful attention as if it were your father and mother.",
        "source": "T14n0434_003:0099a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是意：『斯等普當於彼佛國具滿眾願。』",
        "translation": "They will think, 'Such people will fulfill all their vows in that Buddha land.'",
        "source": "T14n0434_003:0099a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有不信讚歎、稱揚阿彌陀佛名號、功德而謗毀者，五劫之中當墮地獄，具受眾苦。",
        "translation": "Those who disbelieve, praise, and praise Amitâbha's name and merits and denigrate them will fall into hell for five eons and experience a multitude of sufferings.",
        "source": "T14n0434_003:0099a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_003:0099b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西方去此十萬佛剎，有世界名破一切魔，其國有佛，號曰殊勝如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the west, 100,000 Buddha-temples away from here, there's a world called 'Sarvalokabhayacchambhitatvavidhva', where there are buddhas named the Bhagavān Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_003:0099b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞殊勝如來名號者，歡喜信樂，持諷誦念，此等皆能降伏眾魔，裂壞羅網，却六十劫生死之罪。",
        "translation": "Those who hear the name of the excellent Tathāgata, rejoice, believe in it, recite it, and recite it, will be able to subdue Māra, break open the net, and save them from the sins of 60 eons of birth-and-death.",
        "source": "T14n0434_003:0099b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_003:0099b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西方去此十萬佛剎，有世界名曰伏一切魔，其國有佛，號曰集音如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the west, 100,000 buddha-temples away from here, there's a world called Suyāma, and in that world there are buddhas named the Tathāgata Jīvaka, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_003:0099b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞集音如來名號者，歡喜信樂，持諷誦念，其人當得一切如來諸佛音聲，於大眾中廣說法處，於中特尊，退却眾魔，降之以德，却八十劫生死之罪。」",
        "translation": "If someone hears the Tathāgata's name and joyfully believes in it, recites it, and recites it, they will attain the sound of all the tathāgatas and buddhas, explain the Dharma in detail among the masses, and therein, the special honored one will turn back the demons and subdue them with virtue, saving them from the sins of eighty eons of birth-and-death.\"",
        "source": "T14n0434_003:0099b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是阿逸菩薩長跪叉手，前白佛言：「寧有一事，菩薩摩訶薩於此事中具大乘願，住不退轉，疾成無上正真道不？」",
        "translation": "Ayi then knelt down and saluted the Buddha with his palms together, saying, \"Is there one thing, then, that the bodhisattva Mahāsattva has fulfilled the great vehicle vow in this matter, abides in irreversibility, and quickly achieves the unsurpassed true path?\"",
        "source": "T14n0434_003:0099b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有！",
        "translation": "The Buddha said, \"Yes!",
        "source": "T14n0434_003:0099b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸！",
        "translation": "Ayi!",
        "source": "T14n0434_003:0099b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方有世界名曰豐嚴，其國有佛，號德內豐嚴王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the north, there's a world named Feng Yan, and in that country there's a Buddha named Tathāgata, the King of Feng Yan of the Virtues, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones and has helped measureless people.",
        "source": "T14n0434_003:0099b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞斯佛名者，歡喜信樂，持諷誦念而為作禮，其人皆當得不退轉，疾成無上正真之道，却一億劫生死之罪。",
        "translation": "Those who hear the Buddha's name, rejoice, believe in it, recite it, recite it, and pay homage to it will attain irreversibility, quickly achieve the unsurpassed true path, and be spared the sins of 100 million eons of birth-and-death.",
        "source": "T14n0434_003:0099b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有供養五千佛者，此輩，阿逸！",
        "translation": "Those of you who make offerings to 5,000 buddhas, you, Ayi!",
        "source": "T14n0434_003:0099b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾乃得聞德內豐嚴王如來名號。",
        "translation": "It was then that he heard the name of the Tathāgata King of Innermost Splendor.",
        "source": "T14n0434_003:0099b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其聞名者，從是以後所生之處，常得天眼，未曾不得天眼之時；常能徹聽，未曾不得天耳之時；常能飛行，無有不得神足之時；乃至泥曰，常得端政，未曾受於醜惡之形；乃至泥曰；常當尊貴，未曾生於下劣之處；乃至泥曰，悉能除壞眾欲之縛，其人六情眼、耳、鼻、口及於身、意終無有疾；乃至泥曰，初未曾生無佛之處，聽大尊法，未曾有礙不得聽時；未曾有礙不見僧時；亦復不生八難之處。",
        "translation": "其聞名者，從是以後所生之處，常得天眼，未曾不得天眼之時；常能徹聽，未曾不得天耳之時；常能飛行，無有不得神足之時；乃至泥曰，常得端政，未曾受於醜惡之形；乃至泥曰；常當尊貴，未曾生於下劣之處；乃至泥曰，悉能除壞眾欲之縛，其人六情眼、耳、鼻、口及於身、意終無有疾；乃至泥曰，初未曾生無佛之處，聽大尊法，未曾有礙不得聽時；未曾有礙不見僧時；亦復不生八難之處。",
        "source": "T14n0434_003:0099b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒常具足，無有缺時；識心清淨，無有忿亂時。",
        "translation": "When the precepts are always complete, there's no time of deficiency, and when consciousness and mind are purified, there's no time of anger.",
        "source": "T14n0434_003:0099c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，阿逸！",
        "translation": "You should know, Āyatollah!",
        "source": "T14n0434_003:0099c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞此佛名者，淨心信樂於最正覺，如渴欲飲，發信敬心向如來者，此等，阿逸！",
        "translation": "If someone hears the Buddha's name, has a pure heart, is faithful and happy to see the most truly enlightened, is like a thirst for water, and arouses faith and respect for the Tathāgata, then, Ayatollah!",
        "source": "T14n0434_003:0099c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉能捉持諸佛世界最特之利，其人皆當獲於殊妙奇特功德。",
        "translation": "They'll all be able to grasp the most extraordinary benefits of the buddha-world, and they'll all attain marvelous, wondrous virtue.",
        "source": "T14n0434_003:0099c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，阿逸！",
        "translation": "Therefore, Āyatollah!",
        "source": "T14n0434_003:0099c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "並當專精持此佛名。",
        "translation": "\"You must also concentrate on upholding the names of these buddhas.",
        "source": "T14n0434_003:0099c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子、族姓女欲得殊特妙淨剎者，當急聽此諸尊佛名，稱其名號，當為作禮，自作是言：『我今禮於德內豐嚴王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量！』」",
        "translation": "If clansmen and clanswomen want to attain a marvelously pure abode, they must urgently listen to the names of these buddhas, call them by their titles, make obeisance, and say to themselves, 'Now I worship the Tathāgata, the King of Inner Abundance, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well Gone, the Understander of the World, the Unsurpassed One, the Dharma Controller of the Way, and the Teacher of Gods and People, who is called the Blessed One and has saved measureless lives!'",
        "source": "T14n0434_003:0099c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸白佛言：「惟，天中天！",
        "translation": "Āyatollah said to the Buddha, \"But, god of gods!",
        "source": "T14n0434_003:0099c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛剎土為在何所？",
        "translation": "Where are the buddha's buddha-lands?",
        "source": "T14n0434_003:0099c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去此遠近？",
        "translation": "Is it far or near to go here?",
        "source": "T14n0434_003:0099c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成佛以來為幾時也？」",
        "translation": "How long has it been since becoming a buddha?\"",
        "source": "T14n0434_003:0099c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿逸：「設使縱廣百由延中一大埠沙，取一沙著一佛剎，如是悉著諸佛剎中悉令沙盡，如是沙數諸佛剎土悉滿中沙。",
        "translation": "The Buddha told Āyatollah, \"Suppose you were to take a large pile of sand a hundred leagues wide and put it on a buddha's temple, and you were to put it on all of the buddha's temples in such a way that the sand would be exhausted, and the number of sands in such buddha's temples would be completely filled with medium sand.",
        "source": "T14n0434_003:0099c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復取諸佛剎土中沙，復以一沙著一佛剎，如是諸國剎中沙悉使令盡，取此沙數，諸佛剎土悉破為塵。",
        "translation": "Again, he takes the sand in the buddha's bases and puts another sand in a buddha's brake, and thus he causes the sand in the bases of various countries to be exhausted, and when he takes this amount of sand, the buddha's bases are all broken down into dust.",
        "source": "T14n0434_003:0099c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復取一塵著一佛剎悉令塵盡，是諸佛國塵數剎土猶尚未至。",
        "translation": "After taking another particle and placing it on a buddha's brake, they all make the dust disappear, but the number of dust bases in those buddha lands still hasn't reached them yet.",
        "source": "T14n0434_003:0099c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘未到者，過此百倍，其佛剎土去此極遠，不可稱量。",
        "translation": "The others that have yet to reach them are a hundred times greater than that, and the buddha-blocks there are so far away that they can't be measured.",
        "source": "T14n0434_003:0099c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛、世尊在彼豐嚴剎土之中，而今現，在與無央數諸開士等、不可稱計諸比丘眾，前後圍遶而為說法。",
        "translation": "The Buddha or the Bhagavān is present in that rich and ornate land, surrounded by an incalculable number of ascetics and an incalculable number of monks, teaching the Dharma.",
        "source": "T14n0434_003:0099c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於此坐，遙用肉眼，見其如來於大眾中廣說經法。",
        "translation": "From where I'm sitting, I've seen the Tathāgata explain the sūtras and teachings to the crowd with my physical eyes from a distance.",
        "source": "T14n0434_003:0099c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛、世尊於彼剎土在高座上，亦用肉眼觀此世界，亦復見我在於座上於大眾中而說經法。",
        "translation": "That Buddha or Bhagavān was on a high seat in that particular land, and he also observed this world with his physical eyes, and he also saw me on that seat, speaking the sūtras and teachings in the midst of the crowd.",
        "source": "T14n0434_003:0099c28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸當知！",
        "translation": "Ayi, you should know!",
        "source": "T14n0434_003:0100a01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生信諸如來肉眼所見，而歡喜者，此必成就正覺之道。",
        "translation": "\"If sentient beings believe in what the Tathāgatas see with their physical eyes and rejoice, they will surely achieve the path of right awakening.",
        "source": "T14n0434_003:0100a02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯等皆諸佛、如來之所護持，令使信樂而不狐疑，斯等皆當捉持如來深妙之慧，得不退轉於最正覺。",
        "translation": "These are all maintained by the buddhas and tathāgatas, which cause them to believe and rejoice without doubting, and they will all grasp the profound and subtle wisdom of the tathāgatas and attain irreversibility in the path to supreme awakening.",
        "source": "T14n0434_003:0100a03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，阿逸！",
        "translation": "Therefore, Āyatollah!",
        "source": "T14n0434_003:0100a05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有欲求此大福者，若使三千大千世界滿其中火，故當入中聽斯佛名智慧之法。」",
        "translation": "Those who want to pursue this great merit, if they were to fill 3,000 great thousand worlds with their fires, they would enter them and listen to the teaching of this Buddha's name and wisdom.\"",
        "source": "T14n0434_003:0100a06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸菩薩復白佛言：「寧有一法得不退轉，疾成無上正真道不？」",
        "translation": "Again, Ayisena said to the Buddha, \"Is there one thing that will make you irreversible and quickly achieve the unsurpassed true path?\"",
        "source": "T14n0434_003:0100a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有！",
        "translation": "The Buddha said, \"Yes!",
        "source": "T14n0434_003:0100a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸！",
        "translation": "Ayi!",
        "source": "T14n0434_003:0100a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方去此不可計數諸佛剎土，有世界名曰金剛堅固，其國有佛，號金剛堅強消伏壞散如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "To the north, there are incalculable buddha-lands, and there's a world called Vajragiri, where there are buddhas named Vajragiri Destructor Tathāgata, Zhizhen, Equanimous Perfect Enlightenment, Mingxing Cheng, Shanjian, Shijian Jie, Unsurpassed Person, Wayfarer, and Teacher of Gods and People, who are called Blessed Ones and have saved measureless people.",
        "source": "T14n0434_003:0100a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞金剛堅強消伏壞散如來名者，歡喜信樂，持諷誦念，盡心供養，斯等皆當住不退轉，疾成無上正真之道，却於十萬億那術劫生死之罪，超然在後，其佛、如來功德無量弘誓乃爾！",
        "translation": "Those of you who hear the name of the Tathāgata Vajra Resilient, Resolute, and Disintegrating [Tathāgata], rejoice, believe in it, recite it, recite it, and make offerings with all your heart, you will abide in irreversibility, quickly achieve the unsurpassed true path, and escape the sins of birth and death in a hundred thousand million nārāyaṇas, transcending them later, for the Buddha's and the Tathāgata's merits are immeasurable and vast!",
        "source": "T14n0434_003:0100a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我自過去無數劫前，錠光如來興出於世，於彼佛所而得聞此金剛堅強消伏壞散如來名號，得超十萬億那術劫生死之罪。",
        "translation": "An incalculably long time ago, the Dīpaṃkara Tathāgata appeared in the world, and I was able to hear the name of this Vajra-strong, Resilient, Disintegrating Tathāgata at that Buddha's place, which surpassed the ten thousand million nārāya eons of birth-and-death transgressions.",
        "source": "T14n0434_003:0100a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸當知！",
        "translation": "Ayi, you should know!",
        "source": "T14n0434_003:0100a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我不從錠光聞斯佛名者，我今故未得成正覺。",
        "translation": "If I hadn't heard this Buddha's name from Dīpaṃkara, I wouldn't have attained perfect enlightenment.",
        "source": "T14n0434_003:0100a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛何故名曰金剛堅強消伏壞散？",
        "translation": "Why is that Buddha called Vajra, strong, subdued, and dispersed?",
        "source": "T14n0434_003:0100a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如金剛所在墮處，若山、若崖、瓦石、土壘、牆壁、樹木，若遙擬向所墮之處，莫不消滅破碎、壞散。",
        "translation": "\"It's like a mountain, a cliff, a tile, a rock, a fortress, a wall, or a tree, and wherever it's supposed to fall, the vajra simply disappears and breaks apart.",
        "source": "T14n0434_003:0100a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，阿逸！",
        "translation": "Thus, Āyatollah!",
        "source": "T14n0434_003:0100a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞此佛名者，持諷誦念，一切諸欲皆疾消散，一切聲聞、辟支佛心褊狹之意皆悉消滅，疾得成就正覺之道，是故號曰金剛堅強消伏壞散如來。",
        "translation": "If someone hears the name of this Buddha and recites it, all desires will quickly dissipate, and all narrow-mindedness in the minds of śrāvakas and pratyekbuddhas will cease, and they'll quickly achieve the path of right awakening; therefore, they're called the Vajra-bodhisattva Tathāgata who is resolute, calm, and disintegrating.",
        "source": "T14n0434_003:0100a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛、世尊，一切眾願具滿如是！",
        "translation": "Thus, the Buddha, Bhagavān, fulfills all of his numerous vows!",
        "source": "T14n0434_003:0100a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，阿逸！",
        "translation": "\"Again, Ayat!",
        "source": "T14n0434_003:0100b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方去此度十萬億諸佛剎土，有世界名摩尼光，其國有佛，號曰寶火如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the north, there's a world named Manihāra where there are buddhas named the Baolabhadra, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_003:0100b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞寶火如來名號者，歡喜信樂，持諷誦念，其有未入泥洹界者，斯等一切皆當得立不退轉地，疾成無上正真之道。",
        "translation": "Those of you who hear the name of the Baofu Tathāgata, rejoice, believe in it, recite it, and recite it, and those of you who haven't yet entered the nirvāṇa realm will all be able to establish the ground of nonretrogression and quickly achieve the unsurpassed true path.",
        "source": "T14n0434_003:0100b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛剎土一切人民，供養寶火如來者，悉一大乘而得度脫，無有聲聞、緣覺之名。」",
        "translation": "All the people of those buddha bases who make offerings to the Jewel-Fire Tathāgata will all be liberated by the One Great Vehicle, and there will be no names of śrāvakas or pratyekbuddhas.\"",
        "source": "T14n0434_003:0100b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告長老大迦葉：「當知諸佛、如來之德不可思議！",
        "translation": "The Buddha told the eldest Kāśyapa, \"You should know that the virtues of the buddhas and tathāgatas are unfathomable!",
        "source": "T14n0434_003:0100b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方去此五十萬佛剎，有世界名阿竭流香，其國有佛，號寶月光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up north, there are 500,000 buddha temples away from here, and there's a world called Āgāliuka, where there's a Buddha named Jewel Moonlight Tathāgata, Supreme Truth, Completely Awakened One, Mingxing Cheng, Well Gone, Worldly Understanding, Unsurpassed One, Wayfarer, Teacher of Gods and People, who's called All Blessed Ones and has saved measureless lives.",
        "source": "T14n0434_003:0100b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T14n0434_003:0100b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子、族姓女，其有得聞寶月光明如來名者，歡喜信樂，持諷誦念，此等後世所生之處，得不中止三昧正定；若三昧時，自見諸佛轉尊法輪，悉能總持諸佛之法；在所生處，常為眾生闡揚大法；辯才清妙，於眾特尊；諸所欲求，從願悉得。",
        "translation": "If clansmen and clanswomen hear the name of the Tathāgata Brightness of the Jewel Moon, rejoice, believe in it, recite it, and recite it, then where they're born in the afterlife, they'll attain a concentration that's not suspended; when they're in concentration, they'll see for themselves the buddhas turning the honored Dharma wheel, and they'll be able to summarize the buddhas' teachings; where they're born, they'll always explain the great teaching to sentient beings; their eloquence is so subtle that they're especially honored among them; and whatever they desire, they'll get it from their vows.",
        "source": "T14n0434_003:0100b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0434_003:0100b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛、世尊本求道時，興此誓願：『吾成正覺聞我名者，令使得此三昧定意，從初發意至于成道，於其中間常得此定，未曾中失！』」",
        "translation": "When the Buddha or the Bhagavān originally sought the path, he made this vow: 'When I become a fully awakened person and hear my name, I will cause this concentration of samādhi to be permanently attained from the first arousal of the intention until the accomplishment of the path, without ever losing it!'",
        "source": "T14n0434_003:0100b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「度五十萬諸佛剎，　　有世界名阿竭流，　其國有佛號寶月，　　光明晃昱甚巍巍。",
        "translation": "The Bhagavān then spoke in praise, \"There are 500,000 buddha bases that have been crossed, and there's a world called Āgālī, and in that country there's a Buddha named Jewel Moon whose radiance shines brightly and majestically.",
        "source": "T14n0434_003:0100b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有得聞此尊名，　　便為已得所依仰，　後生之處則得禪，　　精進智慧無中止。",
        "translation": "If someone hears the name of this honored one, they will be revered by those who have attained it, and in their subsequent rebirth they'll attain meditation, and their effort and wisdom won't be halted.",
        "source": "T14n0434_003:0100b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　名聲普達光圍繞，　　其人見佛在剎土，　為諸眾生廣興演，　　諸佛導師所說法。",
        "translation": "Surrounded by the radiance of his name and voice, that person sees the Buddha in the buddha land, giving a detailed speech for sentient beings and teaching by the Buddha's guide.",
        "source": "T14n0434_003:0100b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸事無堅固，　　觀諸法中無所起，　普當慈哀於一切，　　於諸禪中得自在。",
        "translation": "He's not resolute in any matter, observes that nothing arises in any dharma, is compassionate toward all, and attains mastery in all meditations.",
        "source": "T14n0434_003:0100c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已能發行如是意，　　都了三塗無恚忿，　審諦解了無吾我，　　無所有者非無有。",
        "translation": "Having been able to convey this kind of intention, he completely ends the three destinies without anger, carefully understands that there's no self, and that what's ownerless is not nonexistent.",
        "source": "T14n0434_003:0100c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諦了諸事無所得，　　於此中間所興法，　如是法者無所住，　　求了表識無表識，　此二俱空亦無性，　　興顯如是無我法。",
        "translation": "He understands that things are unobtainable, that the dharmas that arise in between are thus without abode, that he has sought to understand manifest consciousness and unmanifest consciousness, that they are both empty and devoid of nature, and that they give rise to such selfless dharmas.",
        "source": "T14n0434_003:0100c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無表識者是空義，　　當審諦說此妙法，　表識可了不可了，　　此二俱轉於癡慧。",
        "translation": "The unmanifest consciousness is the meaning of emptiness, and this wonderful teaching should be explained in detail, explaining that the manifest consciousness can be comprehended and not comprehended, and that these two are both transformed by deluded wisdom.",
        "source": "T14n0434_003:0100c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諦觀此二俱清淨，　　亦不復見諸法垢，　所說法者無所猗，　　都了無依波羅蜜。",
        "translation": "Truly observing that these two are both pure, they no longer see the stain of dharmas, and the taught dharma is uninterrupted, fully comprehending the perfection of nonsupport.",
        "source": "T14n0434_003:0100c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如月行於空中，　　其所說法無所猗，　如此妙法興是間，　　於三界中無所著。",
        "translation": "Like the moon walking in the sky, the teaching it gives is unobstructed, and such a wonderful teaching flourishes here and there, with no attachment in the three realms.",
        "source": "T14n0434_003:0100c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩法中無所依，　　解如是者一切智，　解了此法為人說，　　若能解達無猗法。",
        "translation": "There's nothing in the bodhisattva's teaching that's supported, and he understands it all, comprehending it and explaining it for others, if he can comprehend the teaching that's unobstructed.",
        "source": "T14n0434_003:0100c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　審諦分別如是者，　　其人則為近大智，　慧者得聞無依句，　　終無復有狐疑計。",
        "translation": "Someone who carefully discerns thus will approach great cognition, and that wise person will hear the phrase without support and never again have misgivings about it.",
        "source": "T14n0434_003:0100c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人解了如是者，　　於世獨達無所諮，　暢達如是大智慧，　　號曰特尊無上士。",
        "translation": "That person understands such a thing, attains it alone in the world without consulting anyone, and comprehends such great wisdom that they're called a specially honored and unsurpassed person.",
        "source": "T14n0434_003:0100c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0100c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方去此六萬佛剎，有世界名長歡樂，其國有佛，號曰賢最如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "To the north, there are 60,000 buddha temples away from here, and there's a world called Long and Happy, where there are buddhas named Bhadrapāla, Zhizhen, Zhengjue, Mingxingcheng, Shanjian, Shijian jie, Wushangshi, Daofayuan, and Tianren zhushi, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_003:0100c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞賢最如來名號之者，歡喜信樂，持諷誦念，所生之處，當為一切之所敬愛，哀見信用；其所言教，莫不承奉，其人皆當獲斯功德，得無礙辯；所說經法，眾生聞者，歡喜信解，莫不履行。」",
        "translation": "Those who hear the name of the Bhagavān, the Most Excellent Tathāgata, rejoice, believe, recite, and recite it, will be beloved by all who come into existence, respected, and respected by those who sympathize with their words and teachings, and they will attain this merit and attain unhindered discernment; when they hear the sūtras and teachings, sentient beings will rejoice, believe, and understand them, and none of them will fail to fulfill them.\"",
        "source": "T14n0434_003:0100c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「度於六萬諸佛剎，　　有界名曰長歡樂，　慈哀度法賢最尊，　　其大導師在世界。",
        "translation": "The Bhagavān then praised them, saying, \"Having crossed 60,000 buddha bases, there's a world called Ever Happy, where kindness and compassion save the Dharma, and the most venerable of them all is a great guide in the world.",
        "source": "T14n0434_003:0100c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最尊無比無與等，　　世世濟度諸眾生，　其聞名者作法師，　　言奉信用莫不歡。",
        "translation": "Most honored, unequalled, and unsurpassed, he guides sentient beings from generation to generation, serving as a teacher of the Dharma for those who hear his name, and no one is unhappy when he speaks and confirms his faith.",
        "source": "T14n0434_003:0101a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此一切智大法王，　　無量黎庶斯依仰，　若有女人聞其名，　　疾得捨離女人形。",
        "translation": "This great dharma-king of omniscience has the support of measureless people, and if a woman hears his name, she'll quickly abandon her feminine form.",
        "source": "T14n0434_003:0101a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　穢惡甚深無崖際，　　非離世者不能入，　其無所有所可入，　　是為審諦諦不諦。",
        "translation": "The depths of filth and evil are limitless, and they can't be entered except by someone who's removed from the world; there's nothing to enter, and this is the truth of scrutiny, truth, and non-truth.",
        "source": "T14n0434_003:0101a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　了此二事俱無性，　　其已寂滅無有性，　其有盡者以為滅，　　甫當興者亦無性。",
        "translation": "He understands that both of these things are without nature, that they have ceased and lack nature, that their existence has ended in order to cease, and that those that will soon arise are also without nature.",
        "source": "T14n0434_003:0101a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0101a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方去此八千佛剎，有世界名曰現入，其國有佛，號寶蓮華步如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up north, there are 8,000 buddha bases away from here, and there's a world called Now Entering, where there's a Buddha named Jewel-Lotus Padfoot Tathāgata, Supreme Truth, Perfectly Awakened One, Mingxing Cheng, Well Gone, Worldly Understanding, Unsurpassed One, Wayfarer, Teacher of Gods and People, and he's called All Blessed One, who has saved measureless people.",
        "source": "T14n0434_003:0101a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子、族姓女，其有得聞寶蓮花步如來名者，歡喜信樂，持諷誦念，後生之處，顏貌端政，殊妙無比，眾共敬愛；自識宿命無數劫中事，皆悉了知，生所從來，所作善惡悉皆識知；其所生處，所說言教一切信奉，莫不承用。",
        "translation": "If clansmen and clanswomen hear the name of the Jeweled Lotus Padfoot Tathāgata, they rejoice, believe in it, recite it, and recite it, and where they're later born, their appearance is dignified, marvelous, and unmatched, and they are adored by everyone; they fully understand the events of their past lives for countless eons, know everything from which they were born and the good and bad deeds they've done, and they believe in and accept all the words and teachings that are spoken where they were born.",
        "source": "T14n0434_003:0101a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T14n0434_003:0101a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子、族姓女得聞斯等諸如來尊、正覺名號、功德之行，若有愛樂女人身者，如是女人在於女中未得解脫。",
        "translation": "If clansmen and clanswomen hear the names and meritorious actions of these Tathāgatas and Righteous Ones, and if they delight in the woman's body, such a woman has yet to attain liberation while among women.",
        "source": "T14n0434_003:0101a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若厭女人身、不貪樂者，持諷誦念諸佛名者，盡可得斯等德。」",
        "translation": "If someone is disillusioned with the woman's body and doesn't crave it, they can attain all these virtues if they recite and chant the names of the buddhas.\"",
        "source": "T14n0434_003:0101a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛：「當復云何得此功德？」",
        "translation": "Kāśyapa said to the Buddha, \"How will this merit again be attained?\"",
        "source": "T14n0434_003:0101a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「絕諸名色，盡諸欲垢，斯等疾逮無量功德，當疾遠離女人之身，當得具受男子之形。",
        "translation": "The Buddha said, \"By cutting off name-and-form and ending the defilement of desire, these quickly acquire measureless merits, and they'll quickly part with the body of a woman and will attain the full possession of the form of a man.",
        "source": "T14n0434_003:0101a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求為女者，所生之處，續受女人之身，都悉污穢一切世界。",
        "translation": "Where someone who wants to be a woman is born, the body of a woman that's continuously accepted will defile the whole world.",
        "source": "T14n0434_003:0101a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當棄女人之身，當得無比諸善知識，功德日生，亦自受福，復利他人多所饒益，一切男女於眾苦中疾得拔濟。",
        "translation": "Therefore, they must abandon the body of a woman and attain unsurpassed good friends, whose merits will grow day by day and will be for their own benefit, and they'll also benefit others and give many advantages, so that all men and women can be quickly rescued from their many sufferings.",
        "source": "T14n0434_003:0101a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬若毒樹所在之處，蔓莚生長多所傷害，若能斷截諸毒樹者，爾使一切普得快樂。",
        "translation": "It's like a poison tree that grows and harms, but if someone were able to cut off that poison tree, it would make everyone happy.",
        "source": "T14n0434_003:0101a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人之身譬若毒樹，增長諸欲，毒害精神，廣諸惡行，受無量苦，皆由女人。",
        "translation": "A woman's body is like a poison tree that grows desires, poisons the spirit, proliferates bad actions, and causes measureless suffering, all because of women.",
        "source": "T14n0434_003:0101b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能斷棄女人身者，則為斷絕眾生無量諸苦，壞眾惡行，閉絕三塗，開泥洹門，普使一切而得快樂，斯等疾入諸佛徑路。」",
        "translation": "If someone can abandon the woman's body, then they will end the measureless suffering of sentient beings, destroy all bad actions, shut off the three destinies, open the gate of nirvāṇa, and make everyone happy, so they can quickly enter the path of the buddhas.\"",
        "source": "T14n0434_003:0101b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛：「云何得除女人之身？」",
        "translation": "Kāśyapa said to the Buddha, \"How can I get rid of a woman's body?\"",
        "source": "T14n0434_003:0101b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「當自觀身、觀他人身，解此二事俱不可得，不可得中無有徑路。",
        "translation": "The Buddha said, \"You must examine your own body and examine the bodies of others, understanding that these two things are both unobtainable, and that there's no path through the unobtainable.",
        "source": "T14n0434_003:0101b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於男子及女人中觀其處所，男女相貌亦不可得；若了二事亦不可得，無處所者，當於其中願得清淨。",
        "translation": "If you were to examine the places of men and women, the appearance of men and women would be unobtainable, and if you realized that these two things are also unobtainable and there are no places, you would wish to attain purity in them.",
        "source": "T14n0434_003:0101b08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以清淨則無取捨，以無取捨便無識心，諦推覓之，亦不可得無有處所，意自思惟：『無處所中，為求男子成女人乎？』",
        "translation": "If it's purified, then there's no taking and no equanimity, and because there's no taking and no equanimity, then there's no consciousness and mind, and when you truly search for it, you can't attain a lack of a place, thinking to yourself, 'In the absence of a place, is it for seeking a man to become a woman?'",
        "source": "T14n0434_003:0101b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦求索之，意不可得。",
        "translation": "When they truly search for it, their thoughts can't be grasped.",
        "source": "T14n0434_003:0101b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若解意性，了無男女不可見者，爾乃得近如來之道。",
        "translation": "If they understand the mind's nature and realize that there's no male and female that can't be seen, then they'll be able to approach the Tathāgata's path.",
        "source": "T14n0434_003:0101b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其欲發心疾欲除去女人之身，諦觀男子、女人之身，了無異同、增減之二，當受女人作女人形，如其所說以理推之，六性分中亦不可得有男有女，其如是者，則為求索如來之道。",
        "translation": "Those who want to arouse the aspiration to remove the body of a woman, who truly perceive the bodies of men and women as being neither the same nor different, greater or lesser, and who will accept a woman as a woman, and who reason from this, it's impossible to have a man or a woman in the six factors of nature, then they'll seek the path of the Tathāgata.",
        "source": "T14n0434_003:0101b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其欲求解如此事者，復有諦了知此法者，是二輩人過去佛時，曾得聞此諸佛名號。",
        "translation": "Those who want to understand such things and also have the understanding of this teaching are two groups of people who, when they were buddhas in the past, were able to hear the names of these buddhas.",
        "source": "T14n0434_003:0101b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知其人過去世時，於諸佛所造大功德，今乃聞此諸佛名號。",
        "translation": "You should know that person's past lives were marked by the great merits of the buddhas, and now they've heard the names of these buddhas.",
        "source": "T14n0434_003:0101b21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世所依仰為自在者，其奉持此諸尊號者獲無量福。",
        "translation": "Those whom the world looks up to as sovereign will attain measureless merit when they adhere to the names of these honored ones.",
        "source": "T14n0434_003:0101b22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有聞者、若有學者，我普見之。",
        "translation": "If there are any hearers or scholars, I'll show them to them all.",
        "source": "T14n0434_003:0101b23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有欲急求，得此經者，斯等已為見我無異。",
        "translation": "Those who want to urgently seek and obtain this sūtra will have seen me no differently.",
        "source": "T14n0434_003:0101b24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有輕慢其人，說言此非佛語。",
        "translation": "If someone despises them, they'll say, 'That's not the words of the Buddha.'",
        "source": "T14n0434_003:0101b25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是言者，此等便為謗佛、毀經。",
        "translation": "Such a person would denigrate the Buddha and disparage the sūtras.",
        "source": "T14n0434_003:0101b26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謗斯經已為造大惡，緣此惡行當入地獄，受眾苦報無央數劫；地獄罪畢所生之處，常當聾瘂不能言語，諸情閉塞常不完具，常當愚癡而有癲狂；其有嬈固諸菩薩者，薄德醜陋，言無威勢，常生下賤，常生惡道；所生之處常不聞法，如來正覺所說經法，終不能解說深妙義；愚癡之人與經共諍廣受罪報，增益其意毀斯經法，此眾生輩生常愚癡。",
        "translation": "After denigrating this sūtra, they'll commit a great misdeed, and as a result of that misdeed they'll go to hell and suffer the consequences of many miseries for measureless eons.",
        "source": "T14n0434_003:0101b26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛正覺常為世間而作大明，我重慇懃誡囑汝等諸比丘及比丘尼、清信士、清信女，其有謗毀罵經法者實受重罪！",
        "translation": "The buddhas and righteous enlightenment always make a great clarification for the world, and I earnestly admonish you monks, bhikṣuṇīs, pure believers, and pure believing women, that anyone who denigrates the teachings of these sūtras will really suffer a grave sin!",
        "source": "T14n0434_003:0101c05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛、世尊現在十方，無量世界為作法師，所說經法實難得聞。",
        "translation": "The buddhas and the Bhagavān are present in ten directions, in measureless worlds, as Dharma teachers, and the teachings they present are really difficult to hear.",
        "source": "T14n0434_003:0101c08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來慈愍重誡汝等，若有信樂諸佛名號功德法者，於諸善法自然合偶；其有學持諷誦念者，其人疾得見諸如來，智慧轉增，得無礙慧；其有勸人讀諸佛名，所生之處，遊四方域，獨言隻步而無所畏；其有好樂盡心敬奉此諸佛名，當知其人去正覺道終不復遠；其有好憙諸佛功德，加益勸人學斯佛名，其人所在於諸如來所遊行處，於諸欲中無所畏難。",
        "translation": "The Tathāgata kindly and respectfully admonishes you, \"If you believe in the merit of the names of the buddhas, you'll naturally match up with the good qualities; if you train in reciting and chanting them, you'll quickly see the tathāgatas, increase your wisdom, and attain unhindered insight; if you encourage others to read the names of the buddhas, they'll travel to the four directions, speak alone, and step without fear; if you delight in wholeheartedly venerating the names of the buddhas, you'll know that you'll never be far from the path of right awakening; if you like the merit of the buddhas and help encourage others to study their names, you'll be able to find yourself in a place where the tathāgatas travel, and you'll have no difficulty in meeting desires.",
        "source": "T14n0434_003:0101c09_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，迦葉！",
        "translation": "You should know, Kāśyapa!",
        "source": "T14n0434_003:0101c17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘具四事法，乃能信此諸佛尊名。",
        "translation": "\"If a monk possesses four things, then he'll be able to believe in the names of these honored buddhas.",
        "source": "T14n0434_003:0101c18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T14n0434_003:0101c19_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去世時於諸佛所得聞深法，憙樂靜寞清淨之處，世世值遇諸善知識，不於法中作危難行。",
        "translation": "In times past, they heard the profound Dharma from the buddhas, enjoyed quiet, lonely, and pure places, and met good teachers from generation to generation who didn't engage in difficult behavior within the Dharma.",
        "source": "T14n0434_003:0101c19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，迦葉！",
        "translation": "You should know, Kāśyapa!",
        "source": "T14n0434_003:0101c21_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四事。",
        "translation": "These are the four things.",
        "source": "T14n0434_003:0101c21_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘以能具此，於諸如來正覺法中而無疑難，其人得聞如來功德，爾乃一心能信樂之。」",
        "translation": "If a monk can do this and has no doubts about the Tathāgata's correctly enlightened teachings, then he'll hear about the Tathāgata's merits and be able to believe in them with one mind.\"",
        "source": "T14n0434_003:0101c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「過去供養諸佛尊，　　緣此功德其聞名，　最後惡世其聞者，　　普用是號增眾德。",
        "translation": "Thereupon, the Bhagavān praised them, \"They used to make offerings to the buddha-honored ones, and because of this merit they heard of their reputation, and in the last bad age they heard of them, they universally used this name to enhance their virtues.",
        "source": "T14n0434_003:0101c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有過去見諸佛，　　得聞如來深妙義，　往世淨德不諍法，　　斯輩乃能信奉行。",
        "translation": "If there were people who saw the buddhas in the past and were able to hear the profound and subtle teachings of the Tathāgata and the pure virtues and non-debatable qualities of past lives, then these people would be able to believe and practice them.",
        "source": "T14n0434_003:0101c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若使得聞深妙法，　　說諸若干微妙義，　斯輩終不起狐疑，　　佛之深法無能毀。",
        "translation": "If they hear the profound and subtle Dharma and are taught its various subtle meanings, then they'll never have misgivings, and the Buddha's profound teachings won't be able to be disparaged.",
        "source": "T14n0434_003:0101c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安住所說諸法義，　　以思集意信普智，　堅固其意聽我說，　　念莫忘失此尊法，　終不復更與法諍，　　聞諸佛名能奉行。",
        "translation": "They abide in peace while explaining the meaning of the Dharma, gather their thoughts and minds with faith and universal knowledge, firmly establish their minds and listen to my teaching, remembering not to forget this noble teaching, never again disputing the Dharma, and then they hear the Buddha's name and are able to approve of it.",
        "source": "T14n0434_003:0102a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有念無念不相豫，　　於其法中無差特，　不可思議極廣大，　　終無猶豫於大智。",
        "translation": "Not hesitating between mindfulness and non-mindfulness, there's nothing special about this teaching, which is unfathomably vast, and there's never any hesitation in that great knowledge.",
        "source": "T14n0434_003:0102a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其求此法深慧者，　　解達深義無諮啟，　無疑勤求諸深法，　　此等不喜下劣業，　當知此人無所求，　　極大勇猛於法中，　佛所說法莫不信，　　其有眾生於先世，　合偶眾善受福報，　　無所違諍乃得聞，　顯諸如來大智德，　　皆為讚歎十方佛。",
        "translation": "Those who seek the profound wisdom of this teaching, understand its profound meaning without consulting it, diligently pursue the profound teaching without doubt, dislike inferior actions, know that this person wants for nothing, has great courage in the teaching, is unbelievable in what the Buddha teaches, and there are sentient beings from prior lifetimes who merged with many good qualities and received the results of merit without any conflict and then were able to hear it, revealing the great wisdom and virtue of the Tathāgatas and praising the buddhas of the ten directions.",
        "source": "T14n0434_003:0102a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有諷持諸名者，　　諸佛遙讚其人德，　於大眾中歎其名，　　常當得聞諸佛聲，　疾能解了大智法，　　極大清淨無生業。",
        "translation": "Those who recite the names, whose virtues are praised by the buddhas from afar and whose names are praised among the masses, will always hear the buddhas' voices, quickly comprehend the teaching of great wisdom, and perform extremely pure and unborn actions.",
        "source": "T14n0434_003:0102a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　放大光明超日月，　　廣為眾生演妙法，　後會當成最正覺，　　普悉照耀諸佛剎。",
        "translation": "He radiates a brightness that transcends the sun and moon, widely expounds the wondrous Dharma for sentient beings, will become the most perfectly enlightened at a later date, and will completely illuminate the buddha bases.",
        "source": "T14n0434_003:0102a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有世界名曰寶月，其國有佛，號金寶光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a world named Jewel Moon, and in that country there's a Buddha named Golden Jewel Radiant Tathāgata, Supreme Truth, Perfectly Enlightened, Becoming Clear, Well Gone, Worldly Understanding, Unsurpassed Person, Dharma Ruler of the Way, Teacher of Gods and People, called Blessed Ones, who has saved measureless lives and is now teaching.",
        "source": "T14n0434_003:0102a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有世界名象步樓，其國有佛，號無量尊豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a world named Xiangbuluo, and in that country there's a Buddha called the immeasurable honored Tathāgata, the supreme true one, the perfectly enlightened one, the accomplished one, the well-exhausted one, the knower of the world, the unsurpassed one, the royalty of the way, the teacher of gods and humans, who's called the Blessed Ones, has saved measureless lives, and is now presently teaching.",
        "source": "T14n0434_003:0102a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名天玉女，其國有佛，號無量尊離垢王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing banner named Celestial Jade Lady, and in that country there's a Buddha named the immeasurable honored Tathāgata, the Immeasurable One, the King of Immeasurable Contamination, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well Gone, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones, has saved measureless lives, and now he's preaching.",
        "source": "T14n0434_003:0102a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名須彌幡，其國有佛，號曰德手如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing banner named Sumeru, and in that country there's a Buddha named Takṣa Tathāgata, Supreme Truth, Perfectly Enlightened, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Ruler of the Way and Teaching, Teacher of Gods and People, and he's called Blessed One, who has saved measureless lives and is now teaching.",
        "source": "T14n0434_003:0102b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名尊聚尠意，其國有佛，號無數精進興豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing banner named Venerable Cluster of Meanings, and in that country there's a Buddha named Incalculable Essence Prosperity Tathāgata, Supreme Truth, Perfect Enlightenment, Mingxing Cheng, Well Gone, Worldly Understanding, Unsurpassed Person, Dharma Controller of the Way, Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and now he's preaching.",
        "source": "T14n0434_003:0102b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰無受，其國有佛，號無言勝如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up above, there's a blazing blaze named Muktā, which is called the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and it's called the Blessed Ones, which has saved measureless lives and is now teaching.",
        "source": "T14n0434_003:0102b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名淨觀莊嚴，其國有佛，號無愚豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing banner named Jingguan Zhuangyan, and in that country there's a Buddha named Wulufeng Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shishijian, unsurpassed person, Daofayu, and teacher of gods and humans, who's called Zhongyou and has saved measureless lives and is now teaching.",
        "source": "T14n0434_003:0102b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰日光，其國有佛，號月英豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing blaze named Nikko, and in that country there's a Buddha named Yue Yingfeng Tathāgata, Zhizhen, Zhengzhengjue, Mingxing Cheng, Shangaizhao, Shishijian, unsurpassed person, Daofayu, and teacher of gods and humans, who's called Zhongyou, has saved measureless lives, and now he's preaching.",
        "source": "T14n0434_003:0102b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰說法，其國有佛，號無量光豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing banner named Dharma Teaching, and in that country there's a Buddha named Immeasurable Light Abundant Tathāgata, Supreme Truth, Perfectly Enlightened, Becoming Clear, Well Gone, Worldly Understanding, Unsurpassed Person, Dharma Controller of the Way, Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and is now teaching.",
        "source": "T14n0434_003:0102b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名寶豐首盡，其國有佛，號逆空光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing blaze named Baofeng Shoujie, and there's a Buddha in that country who's called the Tathāgata of Light Against Emptiness, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well Gone, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones, has saved measureless lives, and is now presently teaching.",
        "source": "T14n0434_003:0102b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰好集，其國有佛，號最清淨無量幡如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing blaze named Hōjō, and in that country there's a Buddha named Most Pure, Immeasurable Tathāgata, Supreme Truth, Perfectly Awakened, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Ruler of the Way and Teaching, Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and now he's preaching.",
        "source": "T14n0434_003:0102b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰殊勝，其國有佛，號好諦住唯王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing blaze named Jusheng, and in that country there's a Buddha who's called the Well-Adorned One, the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well-Gone, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, the Teacher of Gods and People, who's called the Blessed Ones, who has saved measureless lives, and who's now presently teaching.",
        "source": "T14n0434_003:0102c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名生精進，其國有佛，號成就一切諸利豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there, there's a blazing blaze named Growing Intensity, and in that country there's a Buddha named Accomplishing All Benefits Tathāgata, Supreme Truth, Perfectly Awakened, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Ruler of the Way and Teaching, Teacher of Gods and People, who's called Blessed One, has saved measureless lives, and now he's preaching.",
        "source": "T14n0434_003:0102c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰願力，其國有佛，號淨慧德豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing blaze named Vow Power, and in that country there's a Buddha named Purity, Wisdom, Virtuousness, the Tathāgata, the Supreme Truth, Perfect Enlightenment, Mingxing Cheng, Shangah, Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and is now presently teaching.",
        "source": "T14n0434_003:0102c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名娛樂入，其國有佛，號淨輪幡如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing banner named Entertainment Entry, and in that country there's a Buddha named Jñānacandra, the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones, has saved measureless lives, and is now presently teaching.",
        "source": "T14n0434_003:0102c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名栴檀香，其國有佛，號琉璃光最豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a stūpa named Sandalwood, and in that country there's a Buddha named Lapis Lazuli Radiance Most Abundant Tathāgata, Most True, Completely Enlightened, Becoming Clearly Practiced, Well Gone, Understander of the World, Unsurpassed Person, Ruler of the Way, and Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and is now teaching.",
        "source": "T14n0434_003:0102c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰星宿，其國有佛，號寶德步如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a stūpa named Astralis, and in that country there's a Buddha named Baodeubu Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shishijian, unsurpassed person, Daofayu, and teacher of gods and humans, who's called Vairocana and has saved measureless lives and is now presently teaching.",
        "source": "T14n0434_003:0102c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0102c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名無量德豐，其國有佛，號最清淨德寶住如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up there is a blazing blaze named Immeasurable Abundance, and in that country there's a Buddha named Most Pure, Virtuous, Jewel-Adorned Tathāgata, Most True, Completely Awakened, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Ruler of the Way, Teacher of Gods and People, called All Blessed Ones, who has saved measureless lives and is now presently teaching.",
        "source": "T14n0434_003:0102c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0103a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎，名曰聲所不至，其國有佛，號度寶光明塔如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "Up above there's a blazing blaze named Sound Untouchable, and in that country there's a Buddha named Tathāgata, Radiant Tower of Jewels of Perfect Truth, Completely Awakened, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Ruler of the Way, Teacher of Gods and People, called All Blessed Ones, who has saved measureless lives and is now presently teaching.",
        "source": "T14n0434_003:0103a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0103a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名無際眼，其國有佛，號無量慚愧金最豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。」",
        "translation": "Up there is a blazing blaze named the Eye of Immeasurable Life, and in that country there's a Buddha who's called the Infinite Shameless Golden Abundant Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well Gone, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones, has saved measureless lives, and now he's preaching.\"",
        "source": "T14n0434_003:0103a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「德如月滿其如來，　　諸天最上為尊雄，　此諸大尊德中王，　　能為眾生除諸殃。",
        "translation": "The Bhagavān then praised him, \"The Tathāgata's virtues are like the full moon, the highest of the gods is the most venerable, and he's the king of the great honored ones in terms of virtue, capable of ridding sentient beings of all calamities.",
        "source": "T14n0434_003:0103a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持諸佛名功德成，　　能淨諸剎為肅清，　其難得值此尊經，　　少有眾生聞其名。",
        "translation": "He possesses the merits of the buddhas' names, purifies the buddhas and makes them solemn, and it's difficult to attain the scriptures of this honored one, for few sentient beings hear of his name.",
        "source": "T14n0434_003:0103a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有信行而供養，　　得大智慧勇力強，　解了諸法無有量，　　當成一切正覺王。",
        "translation": "If someone makes offerings with faith and practice, they'll attain great wisdom and great courage, understand the teachings without limit, and become the king of all right awakenings.",
        "source": "T14n0434_003:0103a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正覺之法甚深微，　　不當於中起狐疑，　當善信奉諸導師，　　歡喜敬禮慎莫疑。",
        "translation": "The teaching of right awakening is so profound that you mustn't have misgivings about it; you must well believe in and trust your teachers, rejoice and venerate them, and be cautious not to doubt them.",
        "source": "T14n0434_003:0103a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0103a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名寶蓮花莊嚴，其國有佛，號蓮花尊豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up above, there's a blazing blaze named Jeweled Lotus Adornment, and in that country there's a Buddha named Lotus Exalted Tathāgata, Supreme Truth, Perfectly Awakened One, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed One, Royalty of the Way, and Teacher of Gods and People, who's called Blessed One and has saved measureless lives.",
        "source": "T14n0434_003:0103a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞蓮花尊豐如來名者，三惡之道為已閉塞，為已得成如來之花，於諸正覺一切法中，便為得成無上道花，却生死罪三十六劫。」",
        "translation": "If someone hears the name of the Lotus Flower Honored Tathāgata, the three bad destinies will have been closed, and the flower of the Tathāgata will have been formed, and among all the teachings of right awakening, they'll have formed the flower of the unsurpassed way, which will prevent the sins of birth-and-death for thirty-six eons.\"",
        "source": "T14n0434_003:0103a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「上方有剎寶莊嚴，　　眾花茂盛普大千，　光色晃昱甚可觀，　　譬如天上難檀桓。",
        "translation": "The Bhagavān then praised them, saying, \"Up above, there's a blazing buddha adorned with treasures, a multitude of flowers that flourish throughout a great chiliocosm, and whose radiance is so resplendent that it's like a heavenly nandanavana.",
        "source": "T14n0434_003:0103a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　蓮花尊佛在其剎，　　說法無比慧通達，　光普照耀大千界，　　眾相端嚴聖中最。",
        "translation": "The lotus-flowered Buddha at that blaze teaches the Dharma with unsurpassed wisdom and comprehension, shines brightly and universally across a great chiliocosm, and has the most dignified multitude of features of any sage.",
        "source": "T14n0434_003:0103a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有女人聞其名，　　斷絕惡道遭諸聖，　却三十劫生死罪，　　必成正覺不退轉。",
        "translation": "If a woman hears his name, she'll end bad destinies and encounter sages, undo 30 eons of birth-and-death sins, and surely become a perfectly enlightened, irreversible being.",
        "source": "T14n0434_003:0103b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不見身哃道清淨，　　世世智慧功德成，　緣念諸佛得善友，　　怨家消滅除罪苦。",
        "translation": "Without seeing the purification of her body and path, she'll attain the merit of worldly wisdom, mindful of the buddhas and attain a good friend, and her enemies will be extinguished and her sins and suffering removed.",
        "source": "T14n0434_003:0103b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當普禮此是諸佛，　　今悉現在於異剎，　其人快當受供養，　　用禮諸佛大法王。",
        "translation": "These buddhas will be worshipped universally, and now that they're all here in another temple, that person will quickly accept offerings and pay homage to the buddhas as great dharma-king.",
        "source": "T14n0434_003:0103b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此等不當疑我言，　　必當成佛德無邊，　常當共諸妙法會，　　後成正覺慧獨達。",
        "translation": "These people won't doubt my words, and they will surely become buddhas of limitless virtue, always joining together in marvelous dharma assemblies, and then becoming individually enlightened in wisdom.",
        "source": "T14n0434_003:0103b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0103b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰寶鐙，其國有佛，號淨寶興豐如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up there is a stūpa named Ratnaketu, and in that country there's a Buddha named Prabhūtaratna, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones and who has saved measureless lives.",
        "source": "T14n0434_003:0103b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞淨寶興豐如來名者，歡喜信樂，持諷誦念，其人得七覺意寶，却三十劫生死之罪。」",
        "translation": "If someone hears the name of the Pure Jewel Prosperity Tathāgata, rejoices, believes in it, recites it, and recites it, they'll attain seven awakening and mindfulness treasures that will save them from the sins of 30 eons of birth-and-death.\"",
        "source": "T14n0434_003:0103b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「上方有界號寶明，　　淨寶最尊在其剎，　其有得聞名號者，　　斯等當得七覺禪。",
        "translation": "The Bhagavān then praised them, saying, \"Up there is a world called Prabhūtaratna, and the most revered of the pure treasures is found in its bhūmi, so if someone hears its name, they will attain seven awakenings in meditation.",
        "source": "T14n0434_003:0103b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三十大劫生死苦，　　超越過去無因緣，　得無比力住不動，　　常當遭值諸天尊。",
        "translation": "They will transcend the suffering of birth-and-death in the thirty great eons, transcend the past without cause or condition, attain incomparable strength, abide motionless, and always meet the gods' honored ones.",
        "source": "T14n0434_003:0103b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0103b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰電光，其國有佛，號電鐙幡王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up above, there's a blazing banner named Dengguang, and in that country there's a Buddha named Dengtengbanner King Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangao, Shishijian, unsurpassed person, Daofayu, and teacher of gods and humans, who's called All Blessed Ones and has saved measureless people.",
        "source": "T14n0434_003:0103b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞電鐙幡王如來名者，歡喜信樂，持諷誦念，斯其人等悉當遠離八難之處，終不復生下劣之家。」",
        "translation": "If those who hear the name of the Tathāgata King of the Electric Banner rejoice, believe in it, recite it, and recite it, then all of them will be freed from the eight difficult places and will never again be born in a poor home.\"",
        "source": "T14n0434_003:0103b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「上方有界名電光，　　大尊號曰電鐙王，　其有聞此快士名，　　八難永斷不復生。",
        "translation": "The Bhagavān then praised them, saying, \"Up there is a world named Telegraph, and the great honored one is called the King of the Telegraphs, so if someone hears the name of this accomplished person, the eight difficulties will be permanently eliminated and they won't be born again.",
        "source": "T14n0434_003:0103b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智慧解了生死根，　　種種功德隨次成，　興隆道化度眾生，　　智慧獨達無比聖。",
        "translation": "Wisely understanding the root of birth-and-death, he accomplishes various virtues in turn, prospering the way, transforming sentient beings, and attaining unique wisdom that's beyond compare with that of sages.",
        "source": "T14n0434_003:0103b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0103b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名虛空緻，其國有佛，號法空鐙如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up there is a stūpa named Ākāśagiri, and there's a Buddha in that country who's called the Dharmâkara-Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones and has saved measureless lives.",
        "source": "T14n0434_003:0103b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞法空鐙如來名者，歡喜信樂，持諷誦念，却六十劫生死之罪，得不退轉於最正覺，常得與諸佛共會，現世得見其佛、世尊，亦於夢中見此如來。",
        "translation": "Those who hear the name of the Dharmakṣema Tathāgata, rejoice, believe in it, recite it, recite it, and save themselves from the sins of 60 eons of birth and death, become irreversible and most correctly enlightened, always meet with the buddhas, see their buddhas and world-honored ones in the present life, and see the Tathāgata in their dreams.",
        "source": "T14n0434_003:0103c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，迦葉！",
        "translation": "You should know, Kāśyapa!",
        "source": "T14n0434_003:0103c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人今世五體投地，一心恭敬向於如來，其人則種無量功德，諸善根栽悉得具滿，常當得值諸善知識，常與諸人共相敬愛。",
        "translation": "That person's five bodies fall to the ground in this world, and they whole-heartedly and respectfully turn to the Tathāgata, which then produces measureless merits and plants all the good roots, and they'll always attain the appointment of good teachers and always be loved by all people.",
        "source": "T14n0434_003:0103c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，迦葉！",
        "translation": "Thus, Kāśyapa!",
        "source": "T14n0434_003:0103c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為現世獲諸善報，其佛、如來一切功德普集如是。」",
        "translation": "This is the good reward obtained in the present life, when all the merits of that Buddha or Tathāgata are fully gathered like this.\"",
        "source": "T14n0434_003:0103c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「有虛空緻大世界，　　其佛號曰法空鐙，　名稱普達其世尊，　　光明極大踰虛空。",
        "translation": "The Bhagavān then praised them, saying, \"There's a great world that fills the sky, a Buddha named Dharmakṣema, whose name is the world-honored one and whose radiance is so great it transcends space.",
        "source": "T14n0434_003:0103c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有得聞此尊名，　　超六十劫生死罪，　必當遭值見諸佛，　　於如來前講妙法。",
        "translation": "If someone hears the name of this honored one, they'll transcend 60 eons of birth-and-death sins and will surely meet the buddhas and speak the wondrous Dharma before the Tathāgata.",
        "source": "T14n0434_003:0103c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　精進現世見諸佛，　　當五體禮其如來，　夢中得見其世尊，　　其佛導師光圍遶。",
        "translation": "Those who diligently see the buddhas in the present will pay homage to the Tathāgata in five parts, and in a dream they'll see that world-honored one surrounded by the radiance of his guiding teacher.",
        "source": "T14n0434_003:0103c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　念其如來致斯德，　　常當得見諸大哀，　生常得值諸法王，　　其人現世見諸佛。",
        "translation": "Mindful of the Tathāgata's attributes, he'll always see great compassion, be born in a permanent state, and meet the Dharma kings, and he'll see the buddhas in the present life.",
        "source": "T14n0434_003:0103c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其佛導師德無量，　　智慧普達為法王，　其有勤求眾德者，　　盡心敬意禮其佛。",
        "translation": "Their buddha guides teachers of measureless virtue, and their wisdom is universally attained as the king of the Dharma. Those who diligently seek their virtues should venerate that Buddha with all their hearts and minds.",
        "source": "T14n0434_003:0103c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0103c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名審諦分，其國有佛，號一切眾德成如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up there is a blazon named the section of scrutiny of truths, and in that country there's a Buddha who's called the Tathāgata of all virtues, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well Gone, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed One and has saved measureless people.",
        "source": "T14n0434_003:0103c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故此界名審諦分？",
        "translation": "Why is this realm called the section of the scrutiny of the truth?",
        "source": "T14n0434_003:0103c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，迦葉！",
        "translation": "You should know, Kāśyapa!",
        "source": "T14n0434_003:0103c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其彼世界皆為八分：眾花分、栴檀樹分、金多羅樹寶緻分。",
        "translation": "That world is divided into eight parts: the part with the flowers, the part with the sandalwood tree, and the part with the golden tārā tree's precious fragrance.",
        "source": "T14n0434_003:0103c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛剎土出眾名香，遍其世界；於彼剎土在虛空中，成為香蓋普覆佛剎。",
        "translation": "Their buddha's land produces a multitude of famous fragrances that pervade the world, and those buddha's land becomes a fragrant canopy in the sky that covers the buddha's land.",
        "source": "T14n0434_003:0103c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛、如來趣於法座莊嚴大會，其有得聞一切眾德成如來名者，六情端政常得清淨，解了諸佛妙法之分，却八十劫生死之罪。」",
        "translation": "Those buddhas and tathāgatas who go to the adorned assembly at the Dharma seat and who hear the names of all the virtues of the accomplished tathāgatas will always attain purity in the rectification of their six emotions, understand the parts of the Buddha's wonderful teaching, and be spared the sins of eighty eons of birth-and-death.\"",
        "source": "T14n0434_003:0103c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「審諦世界有八種，　　多羅寶樹香莊嚴，　出妙名香遍其剎，　　普覆虛空香雲蓋，　大智正覺在其剎，　　名聲普達號眾德，　色像端嚴妙甚姝，　　法王獨步無畏懼。",
        "translation": "The Bhagavān then praised them, saying, \"There are eight kinds of the samādhi world, adorned by the fragrance of the Tārāgata's precious tree, whose bases are covered with the fragrant clouds of space, in whose bases the great wisdom and right awakening resides, whose fame universally apprehends all virtues, whose appearance is so dignified and marvelous that the Dharma king steps alone without fear.",
        "source": "T14n0434_003:0104a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有得聞此尊名，　　端正奇妙功德成，　節解圓滿而方正，　　視之無厭莫不敬。",
        "translation": "If someone were to hear the name of this honored one, his or her correct and marvelous qualities would be accomplished, his or her understanding would be complete and square, and there would be no one who didn't tire of seeing it and not respect it.",
        "source": "T14n0434_003:0104a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　功德極尊無與等，　　歡喜踊躍遊諸剎，　精進勇猛甚超越，　　却八十劫生死罪。",
        "translation": "Unequalled in merit, he rushes about the buddhas in joy, surpasses them in vigor and effort, and overcomes the sins of eighty eons of birth-and-death.",
        "source": "T14n0434_003:0104a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於正覺道終不轉，　　廣能演說佛尊法，　逮得一切諸快樂，　　後生之處常尊貴。",
        "translation": "Never changing on the path of right awakening, he's able to explain the Buddha's teaching in detail, securing all kinds of happiness and lasting respect in his afterlife.",
        "source": "T14n0434_003:0104a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　逮得清淨無差特，　　思念如來眾功德，　思惟智慧諸法義，　　增進功德成諸智。",
        "translation": "Attaining purity without distinction, they contemplate the Tathāgata's many attributes, contemplate the meaning of the teachings in wisdom, and develop their merits into wisdom.",
        "source": "T14n0434_003:0104a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0104a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名日月英，其國有佛，號賢幡幢王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up there is a blazing banner named Sun Moon Eng, and in that country there's a Buddha named Goodness, the Banner King Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones and who has saved measureless lives.",
        "source": "T14n0434_003:0104a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞賢幡幢王如來名者，歡喜信樂，持諷誦念，其人當得立不退轉，成最正覺，却五十劫生死之罪。」",
        "translation": "If someone hears the name of the Tathāgata King of Good Banners and Banners, rejoices, believes in it, recites it, and recites it, they will become irreversible, achieve supreme perfect enlightenment, and be saved from the sins of fifty eons of birth-and-death.\"",
        "source": "T14n0434_003:0104a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「上方界名日月英，　　其佛號曰賢幢王，　法王大仙在其剎，　　相好盛明如滿月。",
        "translation": "The Bhagavān then praised them, saying, \"The upper realm is called the Sun and Moon Ying, and its Buddha is called the Bhagavān Banner King, and the Dharma king Daisy is present in its blaze, with features as brilliant as the full moon.",
        "source": "T14n0434_003:0104a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有得聞此尊名，　　遊生死路諸根明，　於諸法中常增長，　　審諦得住如來種，　至心念佛而敬禮，　　却五十劫生死罪。",
        "translation": "If someone hears this honored name, they travel the path of birth-and-death with their faculties illuminated, always increase in the midst of all dharmas, abide in the Tathāgata lineage with discernment, wholeheartedly remember the Buddha and venerate him, and they are saved from the sins of fifty eons of birth-and-death.",
        "source": "T14n0434_003:0104a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，迦葉！",
        "translation": "\"Furthermore, Kāśyapa!",
        "source": "T14n0434_003:0104a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上方有剎名曰寶種，其國有佛，號一切寶緻色持如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "Up there is a blaze named Jewel Seed, and in that country there's a Buddha who's called the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well Gone, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed One and has saved measureless lives.",
        "source": "T14n0434_003:0104a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其剎何故名曰寶種？",
        "translation": "Why is that blaze called Jewel Seed?",
        "source": "T14n0434_003:0104b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，迦葉！",
        "translation": "You should know, Kāśyapa!",
        "source": "T14n0434_003:0104b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛世界一切眾生悉求無上正真之道，其國菩薩神足勇猛，無數菩薩俱共同時如彈指頃，以神足力飛到十方，供養無量恒沙諸佛悉皆周遍，悉能成就一切眾生。",
        "translation": "When the buddhas of that Buddha's world are all sentient beings seeking the unsurpassed true path, the bodhisattvas of that country are so powerful and strong that countless bodhisattvas fly to the ten directions with miraculous powers when they're all together like snapping their fingers, making offerings to measureless buddhas that are completely pervasive and capable of accomplishing the goal for all sentient beings.",
        "source": "T14n0434_003:0104b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是諸佛功德處時，若有聞者，則為到此諸佛國已。",
        "translation": "If anyone who hears this explanation of the buddhas' merits, they've arrived in one of their countries.",
        "source": "T14n0434_003:0104b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能發起大精進行？",
        "translation": "Who can give rise to this great effort?",
        "source": "T14n0434_003:0104b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有菩薩摩訶薩其有捉持此名號者，其名曰師子戲菩薩、師子奮迅菩薩、師子幡菩薩、師子作菩薩、堅勇精進菩薩、擊金剛慧菩薩。",
        "translation": "\"Suppose there's a bodhisattva Mahāsattva who grasps this name and calls it Shizi Play Bodhisattva, Shizi Speedy Bodhisattva, Shizi Banner Bodhisattva, Shizi Maker Bodhisattva, Bodhisattva of Courageous Effort, and Bodhisattva of Adamantine Wisdom.",
        "source": "T14n0434_003:0104b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞一切寶緻色持如來名號及諸菩薩大士名者，皆悉當得如來十力、十八不共特異之法，常能轉於不退法輪，却六百劫生死之罪。」",
        "translation": "Anyone who hears the names of the Tathāgata and the names of the great bodhisattvas in all their finely hued forms will attain the Tathāgata's ten powers and eighteen distinctive characteristics, will always be able to turn the irreversible Dharma wheel, and will be able to avoid the six hundred eons of birth-and-death transgressions.\"",
        "source": "T14n0434_003:0104b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊而歎頌曰：「我今已說諸法王，　　今悉現在康常者，　無師自覺大導師，　　得泥洹樂為最尊。",
        "translation": "The Bhagavān then praised them, saying, \"Now, I've spoken of all the Dharma kings, all of whom are now well-established, the great guide who's self-realized without a teacher, and the most honored one who has attained the joy of nirvāṇa.",
        "source": "T14n0434_003:0104b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來名號性清淨，　　諸法威儀行清淨，　其有最後聞諸名，　　興大歡喜懷恭敬。",
        "translation": "The nature of the Tathāgata's name is pure, and the manner and conduct of all dharmas are pure, so the last person to hear those names will rejoice greatly and hold them in respect.",
        "source": "T14n0434_003:0104b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不當狐疑於如來，　　至誠奉信莫言無，　汝當知是舍利弗，　　斯等先世已供我。",
        "translation": "Don't doubt the Tathāgata, sincerely believe him, and don't say 'no.' You should know that this is Śāriputra, who in prior lifetimes has made offerings to me.",
        "source": "T14n0434_003:0104b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有供養於諸佛，　　其人最後恐怖世，　得聞此等諸尊經，　　一心信樂無疑生。",
        "translation": "If someone makes offerings to the buddhas, then in the final, terrible age they'll hear these honored ones' sūtras and become unified in their faith and happiness, giving rise to no doubt.",
        "source": "T14n0434_003:0104b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛大智所遊路，　　無此最上慧通達，　於是法中多所成，　　云何於中疑此經？",
        "translation": "There's no path traveled by the great wisdom of the buddhas that's not comprehended by the greatest wisdom, and there's so much accomplished in this teaching, how could there be doubt about this sūtra?",
        "source": "T14n0434_003:0104b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若值妙珠無疑寶，　　愚者不識嫌不好，　貧者猶豫意未了，　　既無重價致此寶。",
        "translation": "\"Suppose he were to value a marvelous jewel without doubt, but a foolish man doesn't realize it's not good, and a poor man hesitates, not understanding it, because there's no price too high to pay for this treasure.",
        "source": "T14n0434_003:0104b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是法出生等正覺，　　此皆大士之所聞，　智慧淺者無慧眼，　　斯等何從而能信？",
        "translation": "This is the Dharma that gives rise to virtual enlightenment, which is heard by great men, but how can such people believe it when their wisdom is shallow and they don't have the eye of wisdom?",
        "source": "T14n0434_003:0104b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有富者積眾寶，　　聞如意珠大歡喜，　歎譽甚多益眾寶，　　我當買取自莊嚴。",
        "translation": "\"There's a wealthy man who has accumulated many treasures, who greatly rejoices when he hears the wish-granting pearl, who praises it as being of great benefit to many treasures, and who will buy it for his own adornment.",
        "source": "T14n0434_003:0104b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有福慧合聚者，　　聞諸佛名大歡喜，　鄭重讚歎欲得聞，　　得正覺珠自莊嚴。",
        "translation": "That person of combined merit and wisdom greatly rejoices when they hear the names of the buddhas, solemnly praises them and desires to hear them, and attains the jewel of self adornment that is the jewel of right awakening.",
        "source": "T14n0434_003:0104c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行惡之法求惡者，　　其有諛諂及反戾，　福德智慧薄少者，　　終不堪任聞此法。",
        "translation": "Those who practice bad qualities and seek badness, those who are flattering and perverse, and those whose virtue and wisdom are weak, will never be able to hear this teaching.",
        "source": "T14n0434_003:0104c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　短促倒覆及愚癡，　　慳悋甚多成穢意，　貪婬瞋恚惑亂者，　　此輩不任聞此法。",
        "translation": "They're too short-tempered, deluded, and stingy to be stingy, too stingy to become defiled, and they're too greedy, lustful, and angrily confused to listen to this teaching.",
        "source": "T14n0434_003:0104c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　學尠懈慢憍自輕，　　弊惡親友意未成，　真卷自舉外如清，　　斯眾不任聞此經。",
        "translation": "Their studies are lazy, conceited, and arrogant, their bad friends and relatives' intentions haven't yet been formed, and their true rolls are held up as clear on the outside, so these people aren't allowed to hear this sūtra.",
        "source": "T14n0434_003:0104c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無數天人時唱言，　　巍巍正覺無上尊，　快哉妙法甚難聞，　　當聽無比道之珍。",
        "translation": "Countless gods and humans sometimes call out, \"The majestic, perfectly enlightened, and unsurpassed honored one, how pleasant and difficult it is to hear the wonderful Dharma, and how rare it is to hear the peerless path.",
        "source": "T14n0434_003:0104c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞諸如來名號中，　　所得盈利叵數陳，　諸天在上虛空中，　　而散花香鼓樂音。",
        "translation": "Among the names of the Tathāgatas heard, there's an incalculable amount of profit obtained, and the gods are up in the sky, scattering flowers and perfuming music.",
        "source": "T14n0434_003:0104c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天妙香而遍熏，　　大千世界結香雲，　光明普照諸十方，　　一切剎土六反震。」",
        "translation": "The gods' wonderful fragrance permeates the air, creating clouds of incense across a great chiliocosm, shining brightly in all the ten directions, and shaking all the buddhas and lands six times.\"",
        "source": "T14n0434_003:0104c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說諸如來名號之時，諸在會者悉於座上，遙見此等諸佛、世尊各在其國大眾之中而說經法，悉從坐起，禮諸世尊，莫不歡喜，踊躍無量。",
        "translation": "At the time the Bhagavān spoke the names of the tathāgatas, all those present in the assembly rose from their seats and saw these buddhas and world-honored ones speaking the sūtras and teaching the Dharma in the midst of the great multitude of their countries, and they all rose from their seats to pay homage to the Bhagavān, rejoicing and jumping for joy.",
        "source": "T14n0434_003:0104c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時會中無數千人已，有得道、未得道者，悉發無上正真道意。",
        "translation": "After countingless thousands of them, those who had attained the path and those who hadn't yet attained the path all aroused the intention for the unsurpassed true path.",
        "source": "T14n0434_003:0104c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方世界諸菩薩等各如恒沙，皆來詣此禮釋迦文。",
        "translation": "All the bodhisattvas of the world in the ten directions, each as vast as an infinite number of sands, came to pay homage to Śākyamuni.",
        "source": "T14n0434_003:0104c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其會中一億比丘得阿羅漢，比丘比、丘尼復有十萬人得法眼淨。",
        "translation": "At that meeting, 100 million monks attained arhatship, and another 100,000 monks, nuns, and nuns attained purification of the Dharma eye.",
        "source": "T14n0434_003:0104c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十萬人悉得法忍，五百優婆塞、四百優婆夷同時從坐起整衣服供養如來，盡發無上正真道意。",
        "translation": "Another 100,000 people had all attained the tolerance of the Dharma, and 500 laymen and 400 laywomen rose from their seats and adjusted their robes to make offerings to the Tathāgata, fully ascribing their minds to the unsurpassed true path.",
        "source": "T14n0434_003:0104c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是舍利弗長跪叉手，前白佛言：「此名何經？",
        "translation": "Śāriputra then knelt down and saluted the Buddha with his palms together, saying, \"What's the title of this sūtra?",
        "source": "T14n0434_003:0104c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you uphold it?\"",
        "source": "T14n0434_003:0104c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此經名曰『稱揚諸佛功德法品』，亦復名曰『集諸佛花』。",
        "translation": "The Buddha said, \"This sūtra is called 'Chapter on Praising the Merits of the Buddhas,' and it's also called 'Collection of the Flowers of the Buddhas.'",
        "source": "T14n0434_003:0104c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當奉行之！」",
        "translation": "You must carry it out!\"",
        "source": "T14n0434_003:0104c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說此經竟，舍利弗及諸比丘、諸天、人民、龍、阿須倫一切大會，皆大歡喜，前為佛作禮而去。",
        "translation": "When the Bhagavān finished speaking this sūtra, Śāriputra and the whole assembly of monks, gods, people, dragons, and asuras rejoiced greatly, paid homage to the Buddha, and departed.",
        "source": "T14n0434_003:0104c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說稱揚諸佛功德經卷下",
        "translation": "Foshuo xiaoyang zhoufo gongde jing roll second",
        "source": "T14n0434_003:0105a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　巍巍十方佛，　　國土甚清明，　七寶為莊嚴，　　妙香栴檀馨，　悉純諸菩薩，　　無有二乘名，　惟說不退轉，　　般若道之英。",
        "translation": "\"The buddhas of the ten directions are so lofty, their lands are so clear and bright, adorned with seven treasures, perfumed with the wonderful scent of sandalwood, and filled with pure bodhisattvas, there are no names of the two vehicles, only irreversibility in their teachings, and the glory of the prajñā path.",
        "source": "T14n0434_003:0105a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　巍巍十方佛，　　三世道之珍，　其聞信樂者，　　疾成無上真，　遊於菩薩道，　　堅住不退還，　所生常見佛，　　遭值諸天尊。",
        "translation": "The buddhas of the ten directions are so lofty, the treasures of the three-world path, those who hear and believe in them quickly become unsurpassed realities, wander on the bodhisattva path, remain steadfast and never retrogress, are born to common buddhas, and meet the gods.",
        "source": "T14n0434_003:0105a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　巍巍十方佛，　　三界之導師，　至心懷恭敬，　　信樂無狐疑，　所生常端正，　　顏容甚花暉，　辯才慧獨達，　　願禮天人師。",
        "translation": "Venerable among the buddhas of the ten directions, the guide of the three realms, his whole heart is respectful, his faith and happiness are without doubt, his birth is always correct, his features are resplendent, his eloquence and wisdom are uniquely developed, and he venerates the teachers of gods and humans.",
        "source": "T14n0434_003:0105a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麟嘉六年六月二十日，於龜茲國金華祠演出此經，譯梵音為晉言。",
        "translation": "On the twentieth day of the sixth month in the year of Linjia, this sūtra was performed at the Jinhua Temple in Kuzhi, translated from the Sanskrit into Jinyan.",
        "source": "T14n0434_003:0105a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曇摩跋檀者，通阿毘曇，暢諸經義，又加究盡摩訶衍事，辯說深法，於龜茲國博解第一。",
        "translation": "Dharmabhadra was a man who knew the abhidharma and was fluent in the doctrine of the scriptures, who also investigated all the facts of Mahāyāna and explained the profound Dharma with eloquence, and who was the most knowledgeable in Guzi.",
        "source": "T14n0434_003:0105a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "林即請命出此經，檀手自執梵本，衍為龜茲語經。",
        "translation": "Lin then asked him to produce this sūtra, and the donor took the Sanskrit text himself and translated it into the Kuchaśekhara sūtra.",
        "source": "T14n0434_003:0105a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當如是時，道俗歡喜歎未曾有，競共諷誦美其功德。",
        "translation": "When that happened, the people of the Way rejoiced and praised its virtue in recitation like never before.",
        "source": "T14n0434_003:0105a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門慧海者，通龜茲語，善解晉音。",
        "translation": "That monk, Huihai, knew the language of Kucha and well understood the Jin dialect.",
        "source": "T14n0434_003:0105a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "林復命使譯龜茲語為晉音，林自筆受，章句鄙拙，為辭不雅，貴存本而已。",
        "translation": "Lin then ordered his messenger to translate the language of Qize into Jin sounds, but Lin himself wrote and accepted the translation, which was clumsy in chapter and verse and inelegant in expression; it was better to preserve the source.",
        "source": "T14n0434_003:0105a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其聞此經，歡喜信樂，一心恭敬，受持諷誦諸佛名字、興顯讚揚如來功德，廣加宜傳，得不退轉，疾成無上正真之道，無數天魔不能毀壞無上道心。",
        "translation": "When they hear this sūtra, they rejoice, believe in it, are unified in their respect, accept it, recite the names of the buddhas, praise the Tathāgata's merits, and transmit it widely and appropriately, so that they may not turn back and quickly achieve the unsurpassed true path, and countless gods and Māra cannot destroy the unsurpassed mind of enlightenment.",
        "source": "T14n0434_003:0105a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所生之處，嚴淨佛剎，常得值遇諸佛世尊。",
        "translation": "Where they are born, they will find adorned and purified buddha bases and will always meet the world-honored buddhas.",
        "source": "T14n0434_003:0105a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "端正殊妙，顏容光澤，常能解了無量智慧。",
        "translation": "Their features are exquisite, and their appearance is radiant, enabling them to always comprehend measureless wisdom.",
        "source": "T14n0434_003:0105a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得無礙辯，常為眾生闡揚大法，於大眾中最為上首。",
        "translation": "Attaining unhindered eloquence, he always expounds the great teaching for sentient beings, and he's the foremost among the masses.",
        "source": "T14n0434_003:0105a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後成佛時。",
        "translation": "When he later became a buddha.",
        "source": "T14n0434_003:0105b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎土清淨。",
        "translation": "His buddha land was pure.",
        "source": "T14n0434_003:0105b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸佛國。",
        "translation": "They were the most venerable and highest of all the buddha lands.",
        "source": "T14n0434_003:0105b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最尊第一。",
        "translation": "They'll be the most venerable and the best.",
        "source": "T14n0434_003:0105b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願使十方無量眾生普令諷持，解了如來無礙之慧功德巍巍，亦當如此諸佛世尊。",
        "translation": "May he cause measureless sentient beings in the ten directions to universally recite and uphold the Tathāgata's unhindered wisdom and lofty virtues, and will do the same for the world honored buddhas.",
        "source": "T14n0434_003:0105b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱揚諸佛功德經卷下",
        "translation": "Second Fascicle of the Sutra on the Merit of Praising the Buddhas",
        "source": "T14n0434_003:0105b05_0",
        "is_bad_quality": false
    }
]