[
    {
        "source_sentence": "佛說除蓋障菩薩所問經卷第十",
        "translation": "Foshuo chugai hindrances pusa suowen jing roll 10",
        "source": "T14n0489_013:0736b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三",
        "translation": "three",
        "source": "T14n0489_013:0736b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚",
        "translation": "Xitian Translation Sutra Tripiṭaka, Chaoshan Dafu, and Xixing Lang",
        "source": "T14n0489_013:0736b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿傳梵大師賜紫沙門臣法護等",
        "translation": "Minister Hōshō and others, bestowed with the purple salutation by the great minister Bhadrapāla",
        "source": "T14n0489_013:0736b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translation of the imperial edict",
        "source": "T14n0489_013:0736b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T14n0489_013:0736b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，即得常住妙等引心。",
        "translation": "If a bodhisattva cultivates ten kinds of things, he'll attain an eternally abiding marvelous mind that's equally guided.",
        "source": "T14n0489_013:0736b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_013:0736b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、善行身念處；二者、善行受念處；三者、善行心念處；四者、善行法念處；五者、善行境界念處；六者、善行阿蘭若念處；七者、善行王都國城聚落念處；八者、善行名聞利養等事念處；九者、善行如來施設學門念處；十者、善斷煩惱及隨煩惱雜染念處。",
        "translation": "1. a mindful abode of skillful practice of the body; 2. a mindful abode of skillful practice of sensation; 3. a mindful abode of skillful practice of the mind; 4. a mindful abode of skillful practice of the teaching of the Dharma; 5. a mindful abode of skillful practice of the objective realm; 6. a mindful abode of skillful practice of araṇya; 7. a mindful abode of skillful practice of the mindfulness of a king's capital, a city, or a town; 8. a mindful abode of skillful practice of such things as fame and profit; 9. a mindful abode of skillful practice of the training offered by the Tathāgata; and 10. a mindful abode of skillful cutting off affliction and the defilement that follows affliction.",
        "source": "T14n0489_013:0736b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T14n0489_013:0736c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是菩薩善行身念處？",
        "translation": "\"What is the mindful abode of the body of a bodhisattva who conducts himself well?",
        "source": "T14n0489_013:0736c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩所有身中從我所起罪不善法，以其勝慧審細思擇，皆悉遠離。",
        "translation": "\"Suppose a bodhisattva carefully examines with superior wisdom all the sins and unwholesome qualities in his body that arise from self, and he completely parts with them.",
        "source": "T14n0489_013:0736c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復觀察身諸過失，下從足心上至頂門，筋脈纏縛，遍觀其身，而悉無我，不得暫停敗壞之法，是身不淨，諸不成熟臭穢可惡，眾惡色相共所積集。",
        "translation": "Furthermore, he observes the faults in his body, starting from his feet up to the top of his head, bound by sinews and veins, and observes his body in its entirety as devoid of self, unable to suspend the things that corrupt it, which are impure, immature, smelly, and repulsive, and which are accumulated by the appearance of many bad forms together.",
        "source": "T14n0489_013:0736c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是觀時，若身中身貪愛諸欲，身計我想身所執著，是等諸法悉不可得。",
        "translation": "When a bodhisattva observes this, if the body within the body craves desires, conceives of the body as self, and clings to it, these things are all unobtainable.",
        "source": "T14n0489_013:0736c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，與身俱者諸不善法不得自在，餘與身俱一切善法而得自在。",
        "translation": "For this reason, the unwholesome qualities that go along with the body can't be freely present, while the other things that go along with the body are wholesome and can be freely present.",
        "source": "T14n0489_013:0736c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為善行身念處。",
        "translation": "This is called the mindful abode of the body that's well practiced.",
        "source": "T14n0489_013:0736c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行受念處？",
        "translation": "\"What is the mindful abode of the bodhisattva's skillful conduct in feeling?",
        "source": "T14n0489_013:0736c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩作是思惟：『所有諸受皆悉是苦。",
        "translation": "Suppose a bodhisattva thinks, 'All sensations are painful.",
        "source": "T14n0489_013:0736c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何愚人，於中顛倒計以為樂？",
        "translation": "How is it that a foolish person mistakenly imagines it to be pleasant?'",
        "source": "T14n0489_013:0736c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸愚癡者不識苦樂，唯諸聖人悉知是苦，菩薩自能勤行斷苦受已，復教他人亦悉同己如是修學。』",
        "translation": "Foolish people don't know suffering and pleasure, but only sages know it's suffering. After diligently practicing on their own to end painful feelings, bodhisattvas then teach others to likewise train in this way.'",
        "source": "T14n0489_013:0736c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是觀時，又於彼受不生染愛，不起瞋恚，自勤行已，復令他人亦如是學，如是名為善行受念處。",
        "translation": "When a bodhisattva observes this, he doesn't become defiled by those feelings, doesn't become angry, and diligently practices them himself and causes others to train in the same way; this is called the mindfulness of feeling that's well practiced.",
        "source": "T14n0489_013:0736c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行心念處？",
        "translation": "\"What is the mindful abode of a bodhisattva's mind that conducts itself well?",
        "source": "T14n0489_013:0736c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩作是思惟：『心實無常計執為常，以苦為樂，無我謂我，不淨謂淨，是心動搖不得暫停，如風輕轉，而為煩惱最初根本，亦復為諸隨煩惱緣，開惡趣門破壞善趣。",
        "translation": "Suppose a bodhisattva thinks, 'The mind is really impermanent and discriminates permanence as permanent, takes suffering as pleasure, considers selflessness to be self, and considers impurity to be pure; this is a mind that's shaken and unstable, like a gentle breeze turning, and it's the root of the beginnings of affliction and also the cause of various derivative afflictions that open the door to bad destinies and destroy good destinies.",
        "source": "T14n0489_013:0736c23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復為緣生貪瞋癡，與一切法為勝主宰，一切法中心為先導，若心有知，即一切法亦有所知。",
        "translation": "It's also the cause that gives rise to greed, anger, and delusion, which are superior to all things, and the center of all things is the guide.",
        "source": "T14n0489_013:0736c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心如畫師畫諸物像，心不見心，心能積集善不善業，是心循環如旋火輪，是心迅轉其猶奔馬，心如野火熾焰燒然，心如大水滋長眾物。』",
        "translation": "The mind is like a painter who paints images of things without seeing the mind, and the mind can accumulate good and unskillful actions; it circulates like a whirling wheel of fire; it rapidly turns like a galloping horse; it's like a wildfire blazing and burning; and it's like great water that nourishes all living things.'",
        "source": "T14n0489_013:0736c28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是觀時，而實其心不得自在，諸菩薩者自能調伏，心若調伏，即一切法悉得調伏，如是名為善行心念處。",
        "translation": "When a bodhisattva observes this, his mind really isn't at ease, but bodhisattvas can regulate it on their own, and if their mind is regulated, then all things can be regulated, and this is called the mindful abode of skillful conduct.",
        "source": "T14n0489_013:0737a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行法念處？",
        "translation": "\"What is the mindful abode of a bodhisattva's well-acted mindfulness of qualities?",
        "source": "T14n0489_013:0737a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩於不善法如實了知，所謂貪瞋癡等及所依止，貪之對治餘不善法，瞋癡對治諸不善法。",
        "translation": "\"Suppose a bodhisattva truly knows the unskillful qualities, which are called greed, anger, delusion, and so forth, and their supports, greed counteracts the other unskillful qualities, and anger and delusion counteract the unskillful qualities.",
        "source": "T14n0489_013:0737a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於是不善法中，勤斷除已，即能了知一切善法。",
        "translation": "After diligently eliminating these unwholesome qualities, the bodhisattva can then know all the wholesome qualities.",
        "source": "T14n0489_013:0737a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善法中，起心愛樂住正念處，而於彼法求所成辦，自能行已，復教他人如是修學，如是名為善行法念處。",
        "translation": "Among the good qualities, he arouses a mind that loves to abide in the right mindfulness, seeks to accomplish those qualities, and after he's able to do so himself, he teaches others to train in this way; this is called the mindful abode of the qualities that are well practiced.",
        "source": "T14n0489_013:0737a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行境界念處？",
        "translation": "\"What is the mindful abode of the bodhisattva's well-acted objective realm?",
        "source": "T14n0489_013:0737a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩於諸可意及不可意色聲香味觸諸境界中，不生貪著、不起恚心。",
        "translation": "\"Suppose a bodhisattva doesn't become attached to or become non-anxious about the perceptible and non-perceptible objects of form, sound, smells, tastes, and tactile objects.",
        "source": "T14n0489_013:0737a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是思惟：『我今不應於此無體相法中而生貪著，若生貪者即是愚人，具愚癡性是不明了性，是不善性。",
        "translation": "The bodhisattva thinks, 'Now, I shouldn't become attached to these things that have no essence or characteristics; if I become attached, then I'm a foolish person with a deluded nature that's not understanding and is not good.'",
        "source": "T14n0489_013:0737a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說，若生貪者，即起染著愚癡計執，不能分別善不善法，以是緣故墮惡趣中。』",
        "translation": "As the Buddha explains, if someone gives rise to greed, they will become defiled, foolish, and attached, unable to discern good and unskillful qualities, and as a result, they'll fall into a bad destiny.'",
        "source": "T14n0489_013:0737a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩又作是念：『我今不應於此空法之中而起恚心，起恚心者，即不能忍發生瞋恚，為諸聖人之所譏毀，同梵行者而共厭棄。』",
        "translation": "The bodhisattva then had another thought, 'Now, I shouldn't become angry in the midst of this empty dharma; when I become angry, I won't be able to tolerate anger, and I'll be ridiculed by sages and rejected by those who practice the same celibacy.'",
        "source": "T14n0489_013:0737a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是觀時，不為境壞不著所得，菩薩自能行已，復教他人亦如是學，如是名為善行境界念處。",
        "translation": "When a bodhisattva observes this, he doesn't let the object destroy him and doesn't cling to what he's gained, and once he's able to do it himself, he teaches others to train in the same way; this is called the mindful abode of skillfully practicing the objective realm.",
        "source": "T14n0489_013:0737a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行阿蘭若念處？",
        "translation": "\"What is the mindful abode of a bodhisattva's well-exercised araṇya?",
        "source": "T14n0489_013:0737a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩作是思惟：『修無諍行及寂靜行，是即名為住阿蘭若處。",
        "translation": "Suppose a bodhisattva thinks, 'This is called abiding in the abode of araṇya when one cultivates the practice of non-controversy and the practice of quiescence.",
        "source": "T14n0489_013:0737a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸天、龍、夜叉、乾闥婆等他心通者，能知我心及心所法。",
        "translation": "There are gods, dragons, yakṣas, gandharvas, and others who have supernormal knowledge of other minds and can understand my mind and what goes on in it.",
        "source": "T14n0489_013:0737a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我今應當遠離不如理作意及異思惟，於一切處亦復常離不如理作意，於如理法中，起心愛樂增廣修習。』",
        "translation": "Now, therefore, I should avoid incorrect contemplation and divergent thinking, and I should always avoid incorrect contemplation in all places and arouse mental pleasure in the true teaching and cultivate it.'",
        "source": "T14n0489_013:0737a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為善行阿蘭若念處。",
        "translation": "Such is called the mindful abode of well-acting araṇya.",
        "source": "T14n0489_013:0737a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行王都國城聚落念處？",
        "translation": "\"What is the mindful abode of a bodhisattva's well-exercised mindfulness of the king's capital, his city, and his town?",
        "source": "T14n0489_013:0737b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩入於王都國城聚落之時，當起菩薩所行之行，於諸非處皆悉捨離，非出家人所應行處，亦悉捨離。",
        "translation": "\"When a bodhisattva enters a town in a king's capital, he initiates the bodhisattva's practice and avoids all the wrong places, and he avoids all the places that aren't appropriate for a renunciant to practice.",
        "source": "T14n0489_013:0737b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是非出家人所應行處？",
        "translation": "What are the places that are not appropriate for renunciant practitioners to practice?",
        "source": "T14n0489_013:0737b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂王官之舍、博弈之會、酒肆歡宴、歌舞倡伎所住之處，及餘一切非出家人所應行處，當遠離之而悉不往。",
        "translation": "\"Where the king's officials' quarters, gambling rallies, pubs, banquets, songs, dances, and plays are kept, and all other places where renunciant monks shouldn't practice, you must avoid them and not go there.",
        "source": "T14n0489_013:0737b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為善行王都國城聚落念處。",
        "translation": "This is called the mindful abode of the king's capital city, a town, and a village that's well-acted.",
        "source": "T14n0489_013:0737b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行名聞利養等事念處？",
        "translation": "\"What is a bodhisattva's mindful abode of skillfully performing such things as fame and profit?",
        "source": "T14n0489_013:0737b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩於諸名聞利養等事，但為施主作福田故，隨所起心而乃受之。",
        "translation": "\"Suppose a bodhisattva accepts things like fame and profit simply because they make a field of merit for the donor, according to the mind that arises from it.",
        "source": "T14n0489_013:0737b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其所受，不起貪愛，不生取著，復不計執，不作己有之想，不起我所之相，隨其所得即與一切有情共之，諸苦惱者濟其資養。",
        "translation": "Still, when they receive them, they don't crave them, don't become attached to them, don't impute and cling to them, don't think of themselves as possessing them, don't give the appearance of self and possessions, and share them with all sentient beings as they attain them, thereby providing sustenance for those who are suffering and afflicted.",
        "source": "T14n0489_013:0737b11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，乃於名聞利養等事，不生高舉，不起我慢，不恣驕逸。",
        "translation": "Because of this, they don't become arrogant about things like fame and profit, don't become conceited about themselves, and don't behave unrestrainedly.",
        "source": "T14n0489_013:0737b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是思惟：『諸有名聞利養等事，若自若他，暫時所起而不久停，以暫起故，於一切時及一切處悉無所得。",
        "translation": "The bodhisattva thinks, 'Whether it's something that's known, heard, profitable, or acquired by self or others, it's something that arises temporarily and doesn't stop soon, and because it arises temporarily, it's completely unobtainable at all times and in all places.'",
        "source": "T14n0489_013:0737b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰諸智者，於此無常不久不堅不安隱法中，生染愛心及生高舉我慢驕逸。』",
        "translation": "Who among the wise gives rise to defiled love and arrogance and pride in this impermanent, uncertain, and insecure state?'",
        "source": "T14n0489_013:0737b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為善行名聞利養等事念處。",
        "translation": "Such is called the mindfulness of things like the good conduct of fame and profit.",
        "source": "T14n0489_013:0737b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善行如來施設學門念處？",
        "translation": "\"What is the mindfulness of the bodhisattva's skillful practice of the Tathāgata's defining approach of training?",
        "source": "T14n0489_013:0737b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩作是思惟：『所有過去一切如來皆如是學，如是學故，已成正覺入大涅槃；未來世中一切如來皆如是學，如是學故，當成正覺入大涅槃；及現在世一切如來亦如是學，如是學故，現成正覺入大涅槃。",
        "translation": "Suppose a bodhisattva thinks, 'All Tathāgatas of the past have thus trained, and as a result of their training, they became fully awakened and entered great nirvāṇa; all Tathāgatas of the future will thus train, and as a result of their training, they will become fully awakened and enter great nirvāṇa; and all Tathāgatas of the present will also thus train, and as a result of their training, they will now become fully awakened and enter great nirvāṇa.",
        "source": "T14n0489_013:0737b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，於此學門起清淨心，而生尊敬勤勇修習。』",
        "translation": "For this reason, they arouse a pure mind in this aspect of training and produce respect and diligence in its cultivation.'",
        "source": "T14n0489_013:0737b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為善行如來施設學門念處。",
        "translation": "Such is called the mindful abode of training as defined by the well-executed tathāgata.",
        "source": "T14n0489_013:0737b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何是菩薩善斷煩惱及隨煩惱雜染念處？",
        "translation": "\"What is the bodhisattva's mindful abode of skillfully eliminating afflictions and defilements that follow afflictions?",
        "source": "T14n0489_013:0737b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩以正念故，善能了知一切煩惱及隨煩惱、雜染等法。",
        "translation": "\"Suppose a bodhisattva, because of right mindfulness, is well able to understand all the afflictions and the things that go along with afflictions and defilements.",
        "source": "T14n0489_013:0737b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因所起，何緣所生？",
        "translation": "What causes give rise to them, and what conditions give rise to them?",
        "source": "T14n0489_013:0737c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩悉知如是因起、如是緣生，以了知故而悉遠離，如是名為善斷煩惱及隨煩惱雜染念處。",
        "translation": "A bodhisattva who fully knows that such causes arise and such conditions give rise to them and who, because of that knowledge, fully abandons them is thus called someone who well ends affliction and the mindful abode of defilement that follows affliction.",
        "source": "T14n0489_013:0737c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_013:0737c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，常住妙等引心。",
        "translation": "If a bodhisattva cultivates these ten things, he'll always abide in a mind that's marvelously and equally guided.",
        "source": "T14n0489_013:0737c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_013:0737c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，常著糞掃衣。",
        "translation": "\"If a bodhisattva cultivates ten kinds of dharmas, he'll always wear robes made of rubbish.",
        "source": "T14n0489_013:0737c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_013:0737c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、堅固誓願；二者、謙下其心；三者、不生疲倦；四者、離諸有著；五者、不觀過失；六者、唯觀功德；七者、不自讚譽；八者、不毀謗他；九者、戒行具足；十者、聖賢親近。",
        "translation": "1. they are resolute in their vow; 2. they are humble in their mind; 3. they don't become weary; 4. they are free of attachments; 5. they don't look at faults; 6. they only look at merits; 7. they don't praise themselves; 8. they don't disparage others; 9. they are complete in their moral conduct; and 10. they are close to the noble ones.",
        "source": "T14n0489_013:0737c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T14n0489_013:0737c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是菩薩誓願堅固，乃至聖賢親近？",
        "translation": "How is the bodhisattva's vow strong, even as the noble ones draw near?",
        "source": "T14n0489_013:0737c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩自有淨信志意具足，為諸如來之所信許，設或遇於護命因緣，亦不破毀所發誓願，能於誓願無所改轉。",
        "translation": "\"Suppose a bodhisattva possesses pure faith and has the intention to be fully trusted by the tathāgatas, and if there are any reasons to protect his life, he doesn't break the vow he's made and is able to make no changes in that vow.",
        "source": "T14n0489_013:0737c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由能堅固彼誓願故，即能謙下其心不生我慢。",
        "translation": "Because they can firmly uphold that vow, they can humble their mind and not become proud of themselves.",
        "source": "T14n0489_013:0737c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心謙下故，能以一切人所嫌棄糞掃之物而悉取之。",
        "translation": "Because of that humility of mind, they can take whatever people dislike as dirt and sweepings.",
        "source": "T14n0489_013:0737c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取已洗滌治染縫綴，不生厭惡而不疲倦。",
        "translation": "After taking it, they wash it, cleanse it, and adorn it with dyed stitches, not becoming disgusted with it or weary of it.",
        "source": "T14n0489_013:0737c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不疲倦故，隨所作已離諸有著，乃至勝業修進得成，而能於此糞掃之衣不觀過失。",
        "translation": "Because they aren't weary, they're free of all attachments and can cultivate the accomplishment of excellent actions after doing so, but they're able to look at this soiled garment without observing faults.",
        "source": "T14n0489_013:0737c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖云此衣壞爛故弊復多蚤虱，若被於身而生垢污，菩薩終不觀其過失。",
        "translation": "Even though this robe is tattered and rotten, and it's full of fleas and lice, if it were to become soiled on his body, the bodhisattva would never observe its faults.",
        "source": "T14n0489_013:0737c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故此衣唯觀功德？",
        "translation": "Why is this garment only an observance of merit?",
        "source": "T14n0489_013:0737c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此糞掃衣者仙人所服，離欲聖者亦悉隨順，順聖種故，佛讚吉祥，佛所稱歎。",
        "translation": "This is called the soiled robe worn by sages, which is also followed by noble people who are free of desire, and it's because it's obedient to the noble lineage that it's praised by the Buddha as being auspicious and commended by him.",
        "source": "T14n0489_013:0737c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，不自讚譽不毀謗他，由離自讚不謗他故，即得戒行具足。",
        "translation": "For this reason, he doesn't praise himself and doesn't disparage others, and because he parts with self-praise and doesn't disparage others, he attains the fulfillment of the precepts.",
        "source": "T14n0489_013:0737c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨戒具足故，一切聖賢之所親近，諸佛稱讚，及諸菩薩之所守護，人、非人等而共佑助，諸婆羅門及剎帝利，一切人民咸來禮敬，同梵行者而悉咨嗟。",
        "translation": "Because the pure precepts are complete, all the noble and virtuous are close to them, the buddhas praise them, the bodhisattvas guard them, humans and non-humans alike assist them, brāhmaṇas and bhadrika, and all the people come to venerate them, and those who practice the same celibacy sigh with admiration.",
        "source": "T14n0489_013:0737c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_013:0737c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，常著糞掃衣。」",
        "translation": "If a bodhisattva cultivates these ten kinds of things, he'll always wear robes made of rubbish.\"",
        "source": "T14n0489_013:0737c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，除蓋障菩薩前白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Removing Hindrances came forward and said to the Buddha, \"Bhagavān!",
        "source": "T14n0489_013:0737c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩者具廣大心，何故行斯麁劣行耶？」",
        "translation": "Why do bodhisattvas who have a vast mind engage in such crude practices?\"",
        "source": "T14n0489_013:0737c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T14n0489_013:0738a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩為護世間隨順轉故，乃行斯行。",
        "translation": "Bodhisattvas carry out this practice in order to protect the world and carry on with it.",
        "source": "T14n0489_013:0738a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_013:0738a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩有具大勢力者、有不具者，為彼不具大勢力者，令起對治未生煩惱，故行斯行。",
        "translation": "There are bodhisattvas who possess great power and those who don't, and they perform this act for the sake of those who don't possess great power, so that it causes them to counteract afflictions that have yet to arise.",
        "source": "T14n0489_013:0738a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_013:0738a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T14n0489_013:0738a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝謂如來行解為廣大邪？",
        "translation": "Do you think the Tathāgata's understanding of practice is vast?",
        "source": "T14n0489_013:0738a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為淺劣邪？」",
        "translation": "Is it shallow and mean?\"",
        "source": "T14n0489_013:0738a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除蓋障菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Removing the Hindrances of the Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T14n0489_013:0738a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我無此辯不堪酬對。",
        "translation": "'I'm unable to respond without this kind of eloquence.'",
        "source": "T14n0489_013:0738a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0489_013:0738a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無能測度如來行解之者，以如來無法可證、無法可見，是故如來無有少法可為行解。」",
        "translation": "There's no one who can fathom the Tathāgata's practice and understanding because the Tathāgata is impossible to realize and impossible to see; therefore, there are few things that the Tathāgata can practice and understand.\"",
        "source": "T14n0489_013:0738a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T14n0489_013:0738a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T14n0489_013:0738a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝謂如來以何緣故，於四大洲中諸人非人，及餘劣信解者，天、龍、夜叉、乾闥婆等眾中，現斯麁劣之行，及於彼前稱讚頭陀功德？」",
        "translation": "Do you suppose it's for this reason that the Tathāgata shows such crude behavior among humans and nonhumans on the four continents and others of poor faith, such as gods, dragons, yakṣas, and gandharvas, and praises the merits of the ascetic before them?\"",
        "source": "T14n0489_013:0738a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除蓋障菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Removing the Hindrances of the Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T14n0489_013:0738a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來為欲化度諸有情故，及為初住大乘菩薩令起對治未生諸煩惱故，乃行斯行。」",
        "translation": "The Tathāgata does this for the sake of liberating sentient beings and for the sake of the first-abiding great vehicle bodhisattvas who want to induce antidotes to the afflictions that have yet to arise.\"",
        "source": "T14n0489_013:0738a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T14n0489_013:0738a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，如是。",
        "translation": "\"So it is.",
        "source": "T14n0489_013:0738a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有大力菩薩為欲成就化度有情，故著糞掃衣，斯亦非為下劣麁行。",
        "translation": "Vigorous bodhisattvas who want to accomplish the transformation of sentient beings wear robes made of dung and sweat, but this isn't a debilitating crude practice.",
        "source": "T14n0489_013:0738a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，菩薩常著糞掃之衣。",
        "translation": "It's for this reason that bodhisattvas always wear robes made of soiled rags.",
        "source": "T14n0489_013:0738a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_013:0738a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，但受三衣。",
        "translation": "If a bodhisattva cultivates ten kinds of dharmas, he'll only accept three garments.",
        "source": "T14n0489_013:0738a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_013:0738a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、喜足；二者、少欲；三者、遠離希求；四者、離所積聚；五者、離積聚故無所壞失；六者、無壞失故離諸苦惱；七者、離不悅意；八者、遠離愁歎；九者、無所受；十者、勤修習故而得漏盡。",
        "translation": "1. satisfied with, 2. having few desires, 3. free from wishing for, 4. free from accumulation, 5. free from accumulation so there's no loss, 6. free from suffering and distress because there's no loss, 7. free from displeasure, 8. free from sorrow and lamentation, 9. free from sensation, and 10. able to end the contaminants because of diligent cultivation.",
        "source": "T14n0489_013:0738a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T14n0489_013:0738a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是菩薩喜足，乃至勤修習故而得漏盡？",
        "translation": "\"How is a bodhisattva's joy sufficient, even when he diligently cultivates it so that the contaminants can be ended?",
        "source": "T14n0489_013:0738a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩隨所得衣便生喜足，由喜足故而能少欲，以少欲故無所希求離諸積聚，無積聚故而無壞失；無壞失故，即離壞失所生苦惱；離苦惱故無不悅意，離不悅意故乃無愁歎；無愁歎故而無所受，無所受故勤行修習，乃得漏盡。",
        "translation": "Suppose a bodhisattva becomes contented with the clothing he obtains, and because he's contented, he's able to have few desires; because he has few desires, he has no desire to part with accumulation; because there's no accumulation, there's no loss; because there's no loss, he's free of destruction and displacement and gives rise to suffering and distress; because he's free of suffering and distress, he has no displeasure; because he's free of displeasure, he has no grief and lamentation; because there's no grief and lamentation, he has nothing to experience; because there's nothing to experience, he diligently cultivates it, and then he can end the contaminants.",
        "source": "T14n0489_013:0738a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_013:0738a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，但受三衣。",
        "translation": "If a bodhisattva cultivates these ten kinds of principles, he'll simply accept the three garments.",
        "source": "T14n0489_013:0738b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_013:0738b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，不隨他行。",
        "translation": "\"If a bodhisattva cultivates ten kinds of principles, he won't follow the actions of others.",
        "source": "T14n0489_013:0738b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_013:0738b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、不隨貪行；二者、不隨瞋行；三者、不隨癡行；四者、不隨恚害行；五者、不隨慳嫉行；六者不隨我慢行；七者、不隨求他知識名稱事行；八者、不隨希取利養事行；九者、不隨恭敬天魔而行；十者、不隨高舉染愛而行；如是名為不隨他行。",
        "translation": "1. not acting based on craving; 2. not acting based on anger; 3. not acting based on delusion; 4. not acting based on anger and harmfulness; 5. not acting based on stinginess and jealousy; 6. not acting based on conceit and pride; 7. not acting based on seeking the names of other people; 8. not acting based on desiring things for profit; 9. not acting based on respecting the gods and Māra; 10. not acting based on holding up defiled love; such is called not acting based on other people.",
        "source": "T14n0489_013:0738b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_013:0738b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，即不隨他行。",
        "translation": "If a bodhisattva cultivates these ten kinds of principles, he won't follow the actions of others.",
        "source": "T14n0489_013:0738b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "\"Again, good sons!",
        "source": "T14n0489_013:0738b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修十種法者，常行乞食。",
        "translation": "\"If a bodhisattva cultivates ten kinds of dharmas, he'll always practice begging for food.",
        "source": "T14n0489_013:0738b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T14n0489_013:0738b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、為欲攝受有情故行乞食；二者、次第而行乞食；三者、不生疲倦而行乞食；四者、喜足而行乞食；五者、為欲分布而行乞食；六者、不耽著故而行乞食；七者、善知量故而行乞食；八者、為令善品得現前故而行乞食；九者、令得圓滿諸善根故而行乞食；十者、離身想故而行乞食。",
        "translation": "1. they beg for food in order to gather sentient beings, 2. they beg in order, 3. they beg without becoming weary, 4. they beg with joy and satisfaction, 5. they beg in order to distribute food, 6. they beg without attachment, 7. they beg with good knowledge, 8. they beg in order to cause the manifestation of good qualities, 9. they beg in order to perfect good roots, and 10. they beg because they're free of thoughts of the body.",
        "source": "T14n0489_013:0738b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T14n0489_013:0738b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是菩薩攝受有情，乃至離身想故而行乞食？",
        "translation": "How does a bodhisattva take in sentient beings, even to the point of begging for food because he's free of the idea of a body?",
        "source": "T14n0489_013:0738b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂若菩薩見諸有情受苦惱者善根微少，為欲攝受令其具足諸善根故，而行乞食。",
        "translation": "\"Suppose a bodhisattva sees that the good roots of sentient beings who are afflicted by suffering are slight and wishes to gather them in order to make them fully possess good roots, and then he goes begging for food.",
        "source": "T14n0489_013:0738b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若入城邑聚落行乞食時，當住正念端直其身，進止可觀威儀有則，諸根寂靜如理瞻視繫念善法。",
        "translation": "When a bodhisattva enters a town or village to solicit alms, he should maintain correct mindfulness, straighten his body, conduct himself in a manner that's observable and disciplined, and quiet his faculties as he correctly observes and fixes his attention on the good qualities.",
        "source": "T14n0489_013:0738b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所行乞食依其次第，終不棄捨貧窶之舍而從富乞，謂於婆羅門、剎帝利、長者、居士、諸大族舍，從一至一次第行乞，所獲飲食知量止足，唯除異處而悉不往。",
        "translation": "\"When they go begging for food in order, they never abandon a poor house and go begging from the rich, which is to say that they go begging from one place to the next at the houses of brāhmaṇas, bhadris, elders, householders, and other great clans, knowing that the food they obtain is limited in amount and sufficient, except for foreign places, where they all don't go.",
        "source": "T14n0489_013:0738b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂異處者，惡犬、畜家及有新生犢子之舍，破壞淨戒墮畜生中能起嬈亂之者，若男、若女、童男、童女共所嫌棄，如是等處皆悉遠離。",
        "translation": "That is, an alternative place is a house for a dangerous dog, an animal family, or a newborn calf, a person who breaks the precepts and falls into the category of animals that cause disorder, or a man, woman, boy, or girl who are disliked by both, and such places are all avoided.",
        "source": "T14n0489_013:0738b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「由其次第行乞食故，不生疲倦亦無譏毀，於彼有情不生染愛不起瞋恚，亦不厭棄。",
        "translation": "\"As a result of their secondary practice of begging for food, they don't become weary and don't criticize it, and they don't become defiled by craving for those sentient beings, don't become angry, and don't discard it.",
        "source": "T14n0489_013:0738b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得之食，隨應而受便生喜足，受已還復所居僧坊，收其衣鉢盥手濯足，於如來像前或如來塔前，尊重恭敬作供養已，入自舍中以所乞食而為四分：一分授彼同梵行者、一分施於貧苦有情、一分當施墮惡趣者、一分自食。",
        "translation": "Accepting the food as it comes, he then becomes satisfied with it, returns to the monastery where he lives after accepting it, puts away his robe and bowl, washes his hands and feet, honors and respects the Tathāgata's image or the Tathāgata's stūpa, makes offerings, and then goes into his abode and divides the food he's begged into four parts: one part for those who practice the same celibacy, one part for poor and suffering sentient beings, one part to be given to those who've fallen into a bad destiny, and one part for himself.",
        "source": "T14n0489_013:0738c01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩雖受其食不生染愛，不起驕逸亦不取著，其所受食但為資養身故，亦不令其身極羸瘦亦不沈重。",
        "translation": "Although a bodhisattva accepts that food without defiled love, he doesn't become proud or attached to it, and he accepts it only to nourish his body, not to make it extremely thin or heavy.",
        "source": "T14n0489_013:0738c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0489_013:0738c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若極羸瘦妨修善法，若極沈重增長睡眠。",
        "translation": "If extreme emaciation prevents the cultivation of good qualities, and if extreme heaviness increases drowsiness, then the bodhisattva will gradually cultivate the factors of enlightenment and rid himself of laziness.",
        "source": "T14n0489_013:0738c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩為令善品得現前故，隨受食已發起精進離諸懈怠，漸當修進菩提分法令得圓滿，以其修進菩提分法得圓滿故不起我執，無我執故，乃至能以身肉施諸有情。",
        "translation": "After receiving food, the bodhisattva arouses effort and parts with laziness, gradually cultivates the factors of enlightenment and brings them to completion, and because he cultivates the factors of enlightenment and brings them to completion, he doesn't cling to self and doesn't cling to self, so he's able to give sentient beings his own flesh.",
        "source": "T14n0489_013:0738c10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T14n0489_013:0738c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若修如是十種法者，即常行乞食。",
        "translation": "If a bodhisattva cultivates these ten kinds of principles, he will always practice begging for food.",
        "source": "T14n0489_013:0738c14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說除蓋障菩薩所問經卷第十三",
        "translation": "Foshuo chugai hindrances pusa suowen jing roll thirteen",
        "source": "T14n0489_013:0738c16_0",
        "is_bad_quality": false
    }
]