[
    {
        "source_sentence": "有德女所問大乘經",
        "translation": "Mahāyāna Sutra of the Questions of the Virtuous Woman",
        "source": "T14n0568_001:0940c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐南天竺國三藏菩提流志奉詔譯",
        "translation": "Translated by imperial order from the Tripiṭaka of the Southern India of the Tang Dynasty by Bodhiruci",
        "source": "T14n0568_001:0940c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時，佛在波羅奈國仙人住處施鹿林中，與大比丘眾五百人，及無量諸菩薩摩訶薩眾俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at the residence of the sages of the country of Polonai in the Deer Preserve with a large assembly of 500 monks and an innumerable number of bodhisattvas and mahāsattvas.",
        "source": "T14n0568_001:0940c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊食時著衣持鉢，共阿逸多菩薩摩訶薩，入波羅奈大城乞食，於其城中次第行乞，至有德婆羅門女家。",
        "translation": "At the time, the Bhagavān, while wearing his robe and carrying his bowl at mealtime, and the Ajita Bodhisattva Mahāsattva entered the great city of Polonai to solicit alms, and while they were going begging in order in that city, they went to the house of a virtuous brāhmaṇa.",
        "source": "T14n0568_001:0940c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有德女，遙見如來色相端嚴諸根寂靜，其心恬曠最上無比，威儀顧視審諦閑詳，譬如龍王有大威德，如真金柱嶷然安固，如清淨池皎無穢濁，欣慼不動如第四禪，身放光明內外融徹。",
        "translation": "That virtuous woman then saw from afar the Tathāgata's features and appearance, his faculties were calm, his mind was serene and unsurpassed, and his manner and control were calm and refined, like that of a dragon king with great authority, like a pillar of genuine gold that's weighty and secure, like a pure pond that's bright and unsullied, his mind is unmoving like the fourth dhyāna, and his body radiates light that penetrates both inside and out.",
        "source": "T14n0568_001:0941a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有德女，見如是相，心生淨信，來詣佛所，頂禮如來，及阿逸多菩薩摩訶薩足，曲躬恭敬，合掌向佛，而作是言：「善來！",
        "translation": "When a woman of virtue saw such a figure, her heart became pure with faith, and she went to the Buddha, bowed her head at the feet of the Tathāgata and Ajita Bodhisattva Mahāsattva, bent her head in respect, put her palms together to face the Buddha, and said, \"Good coming!",
        "source": "T14n0568_001:0941a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0568_001:0941a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來！",
        "translation": "Come well!",
        "source": "T14n0568_001:0941a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well gone!",
        "source": "T14n0568_001:0941a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者欲問所疑，惟願垂哀暫時住此。」",
        "translation": "Now, I would like to ask about a doubt, so please have mercy and stay here for a while.\"",
        "source": "T14n0568_001:0941a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊，默然受請，敷座而坐，阿逸多菩薩摩訶薩，亦隨佛坐。",
        "translation": "The Bhagavān then quietly accepted the invitation, spread out his seat, and the Ajita Bodhisattva Mahāsattva also followed the Buddha's lead.",
        "source": "T14n0568_001:0941a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有德婆羅門女心生歡喜，益加恭敬，即白佛言：「世尊！",
        "translation": "At that point, the virtuous brāhmaṇa rejoiced, became more respectful, and said to the Buddha, \"Bhagavān!",
        "source": "T14n0568_001:0941a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞如來於波羅奈仙人住處施鹿林中，轉妙法輪，未知世尊所轉法輪說於何法？」",
        "translation": "I heard that the Tathāgata turned the wonderful Dharma wheel in the Deer Preserve of Vārāṇasī, but I wonder what teaching the Bhagavān explained about the Dharma wheel he turned?\"",
        "source": "T14n0568_001:0941a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告之言：「有德女！",
        "translation": "The Buddha told them, \"Woman of virtue!",
        "source": "T14n0568_001:0941a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我轉法輪，說無明緣行，行緣識，識緣名色，名色緣六處，六處緣觸，觸緣受，受緣愛，愛緣取，取緣有，有緣生，生緣老死憂悲苦惱；無明滅則行滅，行滅則識滅，識滅則名色滅，名色滅則六處滅，六處滅則觸滅，觸滅則受滅，受滅則愛滅，愛滅則取滅，取滅則有滅，有滅則生滅，生滅則老死憂悲苦惱滅。",
        "translation": "I turn the wheel of the Dharma and say that nescience depends on form, form depends on consciousness, consciousness depends on name-and-form, name-and-form depends on the six sense-fields, the six sense-fields depends on contact, touch depends on feeling, feeling depends on craving, craving depends on grasping, grasping depends on existence, existence depends on birth, birth depends on grief, sorrow, pain, and vexation of old age and death; nescience ceases, form ceases, form ceases, name-and-form ceases, the six sense-fields cease, touch ceases, feeling ceases, craving ceases, grasping ceases, existence ceases, birth ceases, and grief, sorrow, pain, and vexation of old age and death ceases.",
        "source": "T14n0568_001:0941a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有德女！",
        "translation": "Woman of virtue!",
        "source": "T14n0568_001:0941a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是如來於波羅奈仙人住處施鹿林中所轉法輪，一切世間，若沙門、若婆羅門、若天魔梵，悉無有能如法轉者。」",
        "translation": "This is the Dharma wheel that the Tathāgata turns in the Deer Preserve at Vārāṇasī, and there's no ascetic, brāhmaṇa, or celestial Māra or Brahmā who can turn it like the Dharma.\"",
        "source": "T14n0568_001:0941a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有德婆羅門女白佛言：「世尊！",
        "translation": "It was then that some virtuous brāhmaṇa said to the Buddha, \"Bhagavān!",
        "source": "T14n0568_001:0941a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言無明為內有耶？",
        "translation": "Is the nescience in question internal existence?",
        "source": "T14n0568_001:0941a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為外有乎？」",
        "translation": "Does it exist outside of that?\"",
        "source": "T14n0568_001:0941a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不也。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T14n0568_001:0941a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有德女言：「世尊！",
        "translation": "A woman of virtue said, \"Bhagavān!",
        "source": "T14n0568_001:0941a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於內外無有無明，云何得有無明緣行？",
        "translation": "If there is no internal or external ignorance, how can there be the conditioned activity of ignorance?",
        "source": "T14n0568_001:0941a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T14n0568_001:0941b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有他世法，而來至於今世以不？」",
        "translation": "Are there other-worldly dharmas that have come to pass in this life?\"",
        "source": "T14n0568_001:0941b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不也。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T14n0568_001:0941b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有德女復白佛言：「世尊！",
        "translation": "The woman of virtue then said to the Buddha, \"Bhagavān!",
        "source": "T14n0568_001:0941b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明行相是實有耶？」",
        "translation": "Do the defining activities of nescience really exist?\"",
        "source": "T14n0568_001:0941b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不也。",
        "translation": "The Buddha said, \"No.",
        "source": "T14n0568_001:0941b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明自性從於虛妄分別而生，非真實生，從顛倒生，非如理生。」",
        "translation": "The own-nature of nescience arises from false discrimination, not from the truth, from confusion, and not from the true principle.\"",
        "source": "T14n0568_001:0941b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有德女復白佛言：「世尊！",
        "translation": "Again, the woman of virtue said to the Buddha, \"Bhagavān!",
        "source": "T14n0568_001:0941b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是者則無無明，云何得有諸行生起，於生死中受諸苦報？",
        "translation": "If this is the case, then there's no ignorance, so how can there be the arising of various actions and the suffering that results from birth-and-death?",
        "source": "T14n0568_001:0941b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0568_001:0941b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如樹無根則無枝葉華果等物，如是無明無自性故，行等生起定不可得？」",
        "translation": "Like a tree without roots that has no branches, leaves, flowers, fruits, and other things, so it follows that nescience has no own-nature, so the production of actions and so forth must not be possible?\"",
        "source": "T14n0568_001:0941b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有德女！",
        "translation": "The Buddha said, \"Woman of virtue!",
        "source": "T14n0568_001:0941b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法皆畢竟空，凡愚迷倒不聞空義，設得聞之無智不了，由此具造種種諸業，既有眾業諸有則生，於諸有中備受眾苦；第一義諦無有諸業，亦無諸有而從業生及以種種眾苦惱事。",
        "translation": "\"All things are ultimately empty, but ordinary foolish people are deluded and don't hear the meaning of emptiness, and if they do hear it, they don't understand it and as a result create various actions, and while there are actions and existences, they are subject to numerous sufferings in those existences; in the first truth, there are no actions, and there are no existences that are born from actions and various kinds of numerous sufferings and distress.",
        "source": "T14n0568_001:0941b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有德女！",
        "translation": "\"Woman of virtue!",
        "source": "T14n0568_001:0941b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正等覺，隨順世間，廣為眾生演說諸法，欲令悟解第一義故。",
        "translation": "The Tathāgata, Arhat, and Fully Awakened One follows the world and explains the teachings in detail for sentient beings in order to make them understand the ultimate truth.",
        "source": "T14n0568_001:0941b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有德女！",
        "translation": "Woman of virtue!",
        "source": "T14n0568_001:0941b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一義者，亦隨世間而立名字。",
        "translation": "\"The ultimate truth is that names are also given to follow the world.",
        "source": "T14n0568_001:0941b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0568_001:0941b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實義之中，能覺所覺一切皆悉不可得故。",
        "translation": "In their true sense, what's perceived and what's perceived are all unobtainable.",
        "source": "T14n0568_001:0941b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有德女！",
        "translation": "\"Woman of virtue!",
        "source": "T14n0568_001:0941b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如諸佛化作於人，此所化人復更化作種種諸物，其所化人虛誑不實，所化之物亦無實事。",
        "translation": "It's like a Buddha who creates a person, and that person creates another person who creates various things, but the person he creates is false and unreal, and the things he creates are insubstantial.",
        "source": "T14n0568_001:0941b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此亦如是，所造諸業虛誑不實，從業有生亦無實事。」",
        "translation": "So it is with this, that the actions created are vain and unreal, and there's nothing real that comes from their undertakings.\"",
        "source": "T14n0568_001:0941b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有德女復白佛言：「世尊！",
        "translation": "At that point, the woman of virtue again said to the Buddha, \"Bhagavān!",
        "source": "T14n0568_001:0941b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我解佛所說之義，今者如來所轉法輪，是虛空法輪，性空法輪，出離法輪，通達法輪，不思議法輪，無能轉者法輪，無等法輪，如實法輪，無生法輪，無自性法輪，無相法輪。",
        "translation": "As I understand the Buddha's explanation, the Dharma wheel that the Tathāgata turns today is the Dharma wheel of space, the Dharma wheel of emptiness in nature, the Dharma wheel of emancipation, the Dharma wheel of penetration, the Dharma wheel of inconceivability, the Dharma wheel of no one who can turn, the Dharma wheel of inequality, the Dharma wheel of truth, the Dharma wheel of no birth, the Dharma wheel of no essence, and the Dharma wheel of no characteristics.",
        "source": "T14n0568_001:0941b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0568_001:0941b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此法輪如來已轉。」",
        "translation": "Thus has the Tathāgata turned the wheel of the Dharma.\"",
        "source": "T14n0568_001:0941b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，即以兩手捧栴檀香末，散佛足上，而作是言：「世尊！",
        "translation": "After he said this, he took the powdered sandalwood incense in both hands, scattered it on the Buddha's feet, and said, \"Bhagavān!",
        "source": "T14n0568_001:0941b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願我以此善根之力，於當來世，能轉如是種種法輪。」",
        "translation": "May I, with the power of these good roots, be able to turn this kind of Dharma wheel in a future life.\"",
        "source": "T14n0568_001:0941b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊怡然微笑，從於口中放種種光，其光朗曜具含眾色，遍至十方無量世界，一一世界靡不充滿，還來佛所，右遶三匝，從佛頂入。",
        "translation": "At the time, the Bhagavān smiled pleasantly and let out a variety of lights from his mouth, which shone brightly and contained a multitude of colors, reaching measureless worlds in ten directions, each of which was filled with nothing, returned to the Buddha, circled him three times to his right, and entered through his crown.",
        "source": "T14n0568_001:0941b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿逸多菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Ajita Bodhisattva Mahāsattva said to the Buddha, \"Bhagavān!",
        "source": "T14n0568_001:0941c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來今者有何因緣忽然微笑？",
        "translation": "What is the reason the Tathāgata suddenly smiles now?",
        "source": "T14n0568_001:0941c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我意解，非無因緣。」",
        "translation": "As I understand it, it's not for lack of a cause.\"",
        "source": "T14n0568_001:0941c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告之言：「阿逸多！",
        "translation": "The Buddha told him, \"Āyatol!",
        "source": "T14n0568_001:0941c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見此婆羅門女，以手捧持栴檀香末散我足不？」",
        "translation": "Do you see this Brāhmaṇa woman holding sandalwood scent in her hand and scattering it on my feet?\"",
        "source": "T14n0568_001:0941c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「已見。」",
        "translation": "He replied, \"I've seen it.\"",
        "source": "T14n0568_001:0941c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此女因今所種善根，當於八萬四千億劫不墮惡道，於六萬四千諸佛所，以尊重心承事供養，聽聞正法守護受持。",
        "translation": "The Buddha said, \"Because of the good roots she's planted now, this woman will not fall into a bad destiny for 8,400,000,000,000 eons, serve and support 6,400,000 buddhas with respect, listen to and hear the right teaching, guard and uphold it.",
        "source": "T14n0568_001:0941c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛在世及涅槃後，如是時間相續不絕，復令無量阿僧祇眾生迴向菩提，然後於此三千大千世界，光曜劫中而得成佛，號法光曜如來、應、正等覺，其佛住壽滿足一劫，教化無量阿僧祇眾生令得涅槃。」",
        "translation": "During his lifetime and after his nirvāṇa, this kind of continuity of time will continue uninterrupted, causing measureless incalculable sentient beings to turn toward bodhi, and then in this world of 3,000,000 great one-thousand eons, he will become a buddha called a Dharmaprabhāsa Tathāgata, Worthy, and Completely Enlightened One, whose lifespan will exceed one eon, teaching measureless incalculable sentient beings to attain nirvāṇa.\"",
        "source": "T14n0568_001:0941c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿逸多菩薩摩訶薩復白佛言：「世尊！",
        "translation": "It was then that the Ayatollah Bodhisattva Mahāsattva again said to the Buddha, \"Bhagavān!",
        "source": "T14n0568_001:0941c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有德婆羅門女，曾於往世種何善根？」",
        "translation": "What good roots has this virtuous Brāhmaṇa planted in past lives?\"",
        "source": "T14n0568_001:0941c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿逸多！",
        "translation": "The Buddha said, \"Āyatol!",
        "source": "T14n0568_001:0941c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當知，此有德女於過去世毘婆尸佛出現之時，已作女身，為求阿耨多羅三藐三菩提，解其身上所著瓔珞，奉上彼佛而為供養。",
        "translation": "Now, you should know that this virtuous woman who took on the body of a woman when Vipaśyin Buddha appeared in a past life sought unsurpassed, perfect enlightenment, untied the jewelry she wore, presented it to that Buddha, and made offerings.",
        "source": "T14n0568_001:0941c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「尸棄如來出現之時，於其佛所問甚深義，以妙衣服而為供養，在彼法中出家學道，修持梵行滿足千年。",
        "translation": "\"When the Śikhin Tathāgata appeared, he asked about the Buddha's profound teaching, made offerings with his marvelous clothing, left home to train in that tradition, and cultivated the religious practice for a thousand years.",
        "source": "T14n0568_001:0941c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘葉浮佛出現之時，營辦種種上好飲食，於半月中供養彼佛及聲聞眾，隨意所須皆無乏少。",
        "translation": "\"When Vipaśyin Buddha appeared, he prepared a variety of excellent foods and drinks and offered them to the Buddha and the śrāvakas for half a month, taking care of whatever they needed.",
        "source": "T14n0568_001:0941c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「俱留孫佛出現之時，以阿提目多迦華，散彼佛上以為供養，得受五戒護持無缺。",
        "translation": "\"When Kauśāmbī appeared, he offered the Buddha an offering of flowers scattered on top of him, and he received the five precepts and upheld them without fail.",
        "source": "T14n0568_001:0941c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「拘那含牟尼佛出現之時，願以種種飲食，衣服臥具湯藥，及餘供身所須之物，盡佛壽來恒為供養，于時彼佛於兩月中受其飲食及革屣等供身之具。",
        "translation": "\"When Kanakamuni appeared, he vowed to offer up a variety of foods, clothing, bedding, bathing and medicine, and other things necessary for making offerings to his body for the rest of his life, and the Buddha accepted his food and drink, leather sandals, and other necessities for making offerings to his body for two months.",
        "source": "T14n0568_001:0941c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉如來出現之時，復以金花散佛供養，如是所作，皆為求於阿耨多羅三藐三菩提。",
        "translation": "\"When the Tathāgata Kāśyapa appeared, he also scattered gold flowers as offerings to the Buddha, and he did so all for the purpose of seeking unsurpassed, perfect enlightenment.",
        "source": "T14n0568_001:0941c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又作是言：『願我以此供養善根，速得授阿耨多羅三藐三菩提記，若未得記，終不願捨女人之身。』",
        "translation": "He also said, 'May I hope that this good root of offerings will quickly lead to the assurance of unsurpassed, correct enlightenment, and if I don't obtain that assurance, I'll never wish to part with a woman's body.'",
        "source": "T14n0568_001:0942a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸多！",
        "translation": "Āyatollah!",
        "source": "T14n0568_001:0942a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有德婆羅門女，過去世中所種善根其事如是，此則是其最後所受女人之報。」",
        "translation": "This virtuous brāhmaṇa planted good roots in the past and did likewise, and this is the final reward of womanhood that she receives.\"",
        "source": "T14n0568_001:0942a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，阿逸多菩薩摩訶薩，及有德婆羅門女，一切世間天、人、阿修羅等，皆大歡喜，信受奉行。",
        "translation": "After the Buddha spoke this sūtra, the Ajita Bodhisattva Mahāsattva and the virtuous brāhmaṇa, all the gods, humans, asuras, and others of the world rejoiced greatly, believed, and approved.",
        "source": "T14n0568_001:0942a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有德女所問大乘經",
        "translation": "The Virtuous Woman's Inquiry into the Great Vehicle Sutra",
        "source": "T14n0568_001:0942a10_0",
        "is_bad_quality": false
    }
]