[
    {
        "source_sentence": "佛說阿難問事佛吉凶經",
        "translation": "Foshuo anan wensi foshuo jixiang jing",
        "source": "T14n0492a_001:0753a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後漢安息國三藏安世高譯",
        "translation": "An Shigao Translation of the Tripiṭaka of the Later Han Kingdom of Anzhi",
        "source": "T14n0492a_001:0753a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難說：「聞如是。」",
        "translation": "Ānanda said, \"So I've heard.\"",
        "source": "T14n0492a_001:0753a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言：「有人事佛得富貴諧偶者，有衰耗不得諧偶者，云何不等耶？",
        "translation": "Ānanda said to the Buddha, \"Is there someone who serves the Buddha and attains a wealthy and prosperous couple and someone who's decrepit and doesn't attain a harmonious couple, so it's not the same?",
        "source": "T14n0492a_001:0753a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛天中天，普為說之。」",
        "translation": "May the Buddha, god of gods, explain it to you universally.\"",
        "source": "T14n0492a_001:0753a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「有人奉佛，從明師受戒，不失精進奉行所受，朝暮禮拜，恭敬燃燈，齋戒不厭，心常歡欣，善神擁護，所向諧偶，百事增倍，為天龍、鬼神、眾人所敬，後必得道；是善男子、善女人，真佛弟子也。",
        "translation": "The Buddha told Ānanda, \"Suppose someone serves the Buddha, receives the precepts from a wise teacher, doesn't lose their diligence in following through on what they've received, venerates him morning and evening, respectfully lights a lamp, doesn't tire of observing the precepts, is always happy in their mind, is supported by good spirits, is in harmony with what they're about, multiplies their abilities, is respected by gods, dragons, ghosts, and people, and will surely attain the path later on; this is a good man or woman who is truly a disciple of the Buddha.",
        "source": "T14n0492a_001:0753a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有人事佛，不值善師，不見經教，信意不堅，亦有戒名違犯正律；既無形像，亦不燒香然明作禮，恒懷瞋恚，惡口罵詈，六齋不持，殺生趣手；不敬佛經，持著雜物弊篋之中，或著妻子床上不淨之處，或持掛壁無有床坐棚閣，與世書無異。",
        "translation": "\"Suppose someone serves the Buddha but doesn't meet a good teacher, doesn't see the sūtras and teachings, doesn't have a strong sense of faith, and has precepts whose names violate the correct precepts; doesn't have an image, doesn't burn incense or make obeisance, always harbors anger, badmouths and ridicules, doesn't observe the six purifications, kills people and goes after their hands; doesn't revere the Buddha's sūtras, keeps miscellaneous things in a bad case, puts them on his wife's bed in an impure place, or keeps them hanging on a wall with no bed or seat in a stall, no different from secular writers.",
        "source": "T14n0492a_001:0753a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有疾病了不念佛，便呼巫師卜問祠祀，請乞邪神，天神離遠不得善護，妖魅日進，惡鬼屯門，令之衰耗所向不諧。",
        "translation": "If someone becomes ill and doesn't recite the Buddha's name, they then call a witch doctor to perform divination and rituals, invite evil spirits, and have the gods leave and not protect them well, while demons and ghosts advance day by day and evil spirits return to Tuen Mun, causing them to weaken and become discordant.",
        "source": "T14n0492a_001:0753a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現世罪人非佛弟子，死入泥犁百毒掠治，魂神痛酷不可得言。",
        "translation": "Sinners in this world who aren't disciples of the Buddha die and enter the mire with a hundred poisons to treat, and their souls and spirits are pained beyond words.",
        "source": "T14n0492a_001:0753a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚人[夢-夕+登]瞢不能自思，先行無功還怨天地，責聖咎天迷謬乃爾，甚為愚癡，遂為三塗所見綴縛。",
        "translation": "Foolish [dream - evening + dawn] people who are blind and unable to think for themselves, blame heaven and earth for their lack of success in the past, and blame sages and gods for their misconceptions, are so foolish that they're bound by the views of the three destinies.",
        "source": "T14n0492a_001:0753a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「夫人得道皆從善生，經戒自御心身口，善為大鎧不畏刀兵，善為大船得渡河淵，有能守信室內和安。",
        "translation": "\"All women who attain the Way are born from goodness, and the sūtras and precepts govern their minds, bodies, and mouths; they are well armoured by great armor and aren't afraid of swords and weapons; they are well built into a large boat that can cross an abyss; and they are able to keep the faith and have peace inside their homes.",
        "source": "T14n0492a_001:0753a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現世有慶福追自然，行之得報非神授與。",
        "translation": "In the present life, there's happiness and merit that follow nature, and their practice is rewarded without divine authorization.",
        "source": "T14n0492a_001:0753a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人不信不持經戒，後生轉劇，善惡逐人如影追形，勿作狐疑，自墮惡道，求脫良難。",
        "translation": "If someone doesn't believe and uphold the sūtras and precepts, they'll be subject to trouble in later life, and good and evil will chase after them like shadows and forms.",
        "source": "T14n0492a_001:0753a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦信不犯，所在常安；佛語至誠終不欺人。",
        "translation": "If you truly believe and don't violate them, your place will always be peaceful; the Buddha's words are perfectly sincere, and he never deceives people.",
        "source": "T14n0492a_001:0753a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛世難值人身難獲，汝今侍佛宿福之大，當念報恩班宣法教，廣為福田行之得度，所適無憂。」",
        "translation": "The Buddha's world is hard to come by, and his person is hard to obtain. Now, as you serve the Buddha with great fortune in the past, you should be mindful of repaying kindnesses by proclaiming the Dharma teaching in classes, making it a field of merit, and then attaining salvation where appropriate.\"",
        "source": "T14n0492a_001:0753b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「人不自手殺，教人殺者，其罪云何？",
        "translation": "Again, Ānanda said to the Buddha, \"What's the crime of a person who doesn't kill with their own hands but teaches others to kill?",
        "source": "T14n0492a_001:0753b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為無罪耶？」",
        "translation": "Is it without fault?\"",
        "source": "T14n0492a_001:0753b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T14n0492a_001:0753b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教人殺者，重於自殺。",
        "translation": "Teaching someone to kill is more important than killing oneself.",
        "source": "T14n0492a_001:0753b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T14n0492a_001:0753b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或是奴婢下賤之人，作無殺意；或為王者縣官所見逼促，不自意出為之所使。",
        "translation": "Perhaps it's a slave or a lowly person who acts without intent to kill, or it's a king or magistrate who sees them and forces them to do so without their own intention.",
        "source": "T14n0492a_001:0753b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教人殺者，而知故犯，陰謀殘害復罪他人，欺罔三尊還負自然，其罪莫大；怨對相報，世世受殃，未有斷絕。",
        "translation": "Teaching someone to kill and knowingly violating the law, plotting to harm and reoffend others, deceiving the three honored ones, and negating nature is a terrible sin; it's mutual retribution of enmity that brings misfortune throughout the ages and is never stopped.",
        "source": "T14n0492a_001:0753b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現世不安，死入地獄，受毒痛裂，從地獄出為畜生，屠割皮骨以肉償人，皆由前世殘殺暴逆，剋賊眾生陰謀懷害，無有慈心。",
        "translation": "Their present world is unsettled, and they die and go to hell, suffering pain and lacerations, emerging from hell to become an animal, slaughtering skin and bones to pay people with flesh, all because of cruelty, killing, violence, and rebellion in previous lives, and the conspiracy to harm sentient beings who wronged them and had no compassion.",
        "source": "T14n0492a_001:0753b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見人殺者代其歡喜，以用快意過於自殺，罪深如是。」",
        "translation": "Seeing someone kill on their behalf and rejoicing in their pleasure is more than killing themselves, which is a deep sin.\"",
        "source": "T14n0492a_001:0753b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「世間人及佛弟子，輕易其師、惡意向師并道德人者，其罪云何？」",
        "translation": "Again, Ānanda said to the Buddha, \"What's the crime of worldly people and disciples of the Buddha who take lightly their teachers, mistakenly intend to be their teachers, and moral people?\"",
        "source": "T14n0492a_001:0753b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T14n0492a_001:0753b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫為人者，當愛樂人德、欣樂人善，不可嫉之。",
        "translation": "\"A person should delight in the virtue of others and rejoice in their goodness; they shouldn't be jealous of them.",
        "source": "T14n0492a_001:0753b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡意向師、道德人者，是惡意向佛無異也。",
        "translation": "A person who has bad intentions toward teachers and people of virtue is no different from a person who has bad intentions toward the Buddha.",
        "source": "T14n0492a_001:0753b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧持萬石弩還自射身，為痛不？」",
        "translation": "Would it hurt to carry a crossbow with 10,000 stones and shoot oneself back?\"",
        "source": "T14n0492a_001:0753b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「甚痛，甚痛！",
        "translation": "Ānanda said, \"That hurts, that hurts!",
        "source": "T14n0492a_001:0753b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T14n0492a_001:0753b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人持惡意向道德人與其師者，痛劇弩射身也。",
        "translation": "The Buddha said, \"A person who harbors bad intentions toward a moral person and his teacher will be shot with a powerful crossbow.",
        "source": "T14n0492a_001:0753b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為人弟子，不可輕慢其師、惡意向道德之人；道德之人當視之如佛，不可嫉謗。",
        "translation": "As a disciple, you mustn't despise your teacher or a person with bad intentions toward morality; a moral person should be treated like a Buddha and not be maligned.",
        "source": "T14n0492a_001:0753b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有戒德者，感動諸天龍、鬼神，莫不敬尊。",
        "translation": "A person with the virtue of morality inspires gods, dragons, and spirits, and none of them venerate him.",
        "source": "T14n0492a_001:0753b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧身投火中、利刀割肉，慎勿得嫉謗是善之人，其罪不小。",
        "translation": "It's better to throw yourself into the fire or cut your flesh with a sharp knife than to revere a good person, for that would be no small misdeed.",
        "source": "T14n0492a_001:0753b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慎之！",
        "translation": "Take care!",
        "source": "T14n0492a_001:0753b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慎之！」",
        "translation": "Be careful!\"",
        "source": "T14n0492a_001:0753b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「師者，為可得呵喝弟子，以小罪成大，得無罪耶？」",
        "translation": "Ānanda again said to the Buddha, \"Teacher, is it possible to ridicule a disciple and make a minor offense into a major one, so that he can be blameless?\"",
        "source": "T14n0492a_001:0753b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不可！",
        "translation": "The Buddha said, \"No!",
        "source": "T14n0492a_001:0753b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可！",
        "translation": "Unacceptable!",
        "source": "T14n0492a_001:0753b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師、弟之義，義感自然，當相信厚，視彼若己；己所不行，勿施於人，弘崇禮律訓之以道，和順忠節不相怨訟。",
        "translation": "\"The meaning of teacher and disciple is to be naturally inspired by right, to believe in the generosity of others as oneself, to do unto others what one doesn't do, to honor propriety and discipline by teaching them the way, and to harmonize loyalty and moderation without quarreling with each other.",
        "source": "T14n0492a_001:0753b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子與師二義真誠，師當如師，弟子當如弟子，勿相誹謗慎莫含毒，小怨成大還自燒身。",
        "translation": "Both the disciple and the teacher are true, and the teacher should act like a teacher, and the disciple should act like a disciple; don't denigrate each other, and be careful not to imply poison, for a small grudge will become a great one, and you'll burn yourself up.",
        "source": "T14n0492a_001:0753b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀世惡人魔比丘輩，師不如師、弟子非如弟子，但共為惡不念行道。",
        "translation": "Looking at the evil people of the world, the Māra monk class, their teacher isn't as good as a teacher, and the disciple isn't as good as a disciple; they only work together to do evil and don't remember the path.",
        "source": "T14n0492a_001:0753c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沮壞善者貪慕俗業，不計無常積財自喪，死墮惡趣餓鬼畜生，未甞有是相視若牛，於世何求念報佛恩？",
        "translation": "Those who sabotage goodness and crave worldly karma, accumulate wealth without regard for impermanence, and die, falling into a bad destiny, hungry ghosts, and animals, have never looked at each other like cattle, so why would they seek to be mindful of repaying the Buddha's kindness in the world?",
        "source": "T14n0492a_001:0753c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當持經戒相率以道。",
        "translation": "\"You must observe the precepts of the scriptures and lead each other on the path.",
        "source": "T14n0492a_001:0753c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道不可不學，經不可不讀，善不可不行，行善布德濟神離苦，超出生死，見賢勿慢見善勿謗，不以小過證人大罪，違法失理其罪莫大，罪福有證。",
        "translation": "You mustn't stop studying the way, you mustn't stop reading the scriptures, you mustn't stop practicing goodness, spreading virtue to help the gods escape suffering and transcend birth and death, not being arrogant when you see good people and not denigrating those who see goodness, not realizing a great transgression by a minor one, and not realizing a greater transgression by violating the law or losing the principle.",
        "source": "T14n0492a_001:0753c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可畏！",
        "translation": "Formidable!",
        "source": "T14n0492a_001:0753c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可畏！」",
        "translation": "Fearful!\"",
        "source": "T14n0492a_001:0753c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復白佛言：「末世弟子生是魔界，多有因緣，有居家之求、身口之累，云何行之？」",
        "translation": "Ānanda again said to the Buddha, \"Disciples of the latter age are born in the demonic realm, have many causes and conditions, and have the desire to live at home and the burden of body and speech, so how do they do it?\"",
        "source": "T14n0492a_001:0753c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「為佛弟子，雖有因緣持戒勿犯，誠信畏慎敬歸三尊，孝事二親內外謹善，不念誑佞心口相應，善權方便進退知時，可得作世間事，不得為世間意。」",
        "translation": "The Buddha said, \"As a disciple of the Buddha, although there are reasons to observe the precepts, don't violate them; sincerely believe, fear, and respect the three honored ones; dutifully serve two relatives; be good inside and out; don't be mindful of deceit and sycophants; associate your mind with your words; and know when you're advancing and retreating with skillful means, you can perform worldly tasks and not have worldly intentions.\"",
        "source": "T14n0492a_001:0753c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛：「何謂世間事？",
        "translation": "Ānanda said to the Buddha, \"What's meant by worldly affairs?",
        "source": "T14n0492a_001:0753c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂世間意？」",
        "translation": "What is meant by a worldly consciousness?\"",
        "source": "T14n0492a_001:0753c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「為佛弟子，可得估販利業，平斗秤尺施行以理，不得阿枉巧欺以侵於人，葬送、移徙、婚姻、嫁娶是為世間事也。",
        "translation": "The Buddha said, \"As a disciple of the Buddha, he may estimate the profits of hawking, administer the principle of a level scale, and not deceive others by falsehood or deceit; funerals, migrations, marriages, and weddings are worldly affairs.",
        "source": "T14n0492a_001:0753c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間意者，為佛弟子不得卜問、請符呪魘怪、祠祀、解奏、畏忌不吉。",
        "translation": "For those of worldly significance, a disciple of the Buddha mustn't divine, request charms, spells, nightmares, shrines, solicitations, or fears of bad fortune.",
        "source": "T14n0492a_001:0753c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受佛五戒者，是福德之人，無所畏避，有所施行當啟三尊，無往不吉。",
        "translation": "Those who accept the Buddha's five precepts are virtuous people who have nothing to fear and nothing to perform that will reveal the three honored ones, and there's nothing that's not auspicious.",
        "source": "T14n0492a_001:0753c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒德之人，道護為強，諸天龍鬼神無不敬伏；戒貴則尊，所往常安。",
        "translation": "A virtuous person who observes the precepts has a strong protector of the Way, which makes gods, dragons, and ghosts subdue them; when the precepts are honored, they're honored, and their going is always peaceful.",
        "source": "T14n0492a_001:0753c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不達之者，自作鄣礙。",
        "translation": "Those who don't attain them will create their own hindrances.",
        "source": "T14n0492a_001:0753c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡由心禍福由人，如影追形如響隨聲，天無不覆地無不載；戒行之德福應自然，天神擁護感動十方，與天參德功勳巍巍，眾聖嗟歎難可稱量，智士達命沒身不邪，善知佛教可得度世之道。」",
        "translation": "Good and evil come from the mind, and fortune and blessing come from people, like shadows following forms and bells following sounds, which are never covered by the gods and never carried by the earth; the virtue of moral conduct and merit come naturally, and the gods embrace and move the gods in ten directions; the merit of participating with the gods is so great that the praise of sages is difficult to fathom; wise men attain life, and their loss of body is not mistaken; a good understanding of Buddhism can lead to the path to salvation.\"",
        "source": "T14n0492a_001:0753c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難聞佛所說，便整袈裟頭腦著地：「唯然，世尊！",
        "translation": "Hearing what the Buddha taught, Ānanda then adjusted his robe and put his head to the ground, \"Yes, Bhagavān!",
        "source": "T14n0492a_001:0753c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等有福，得近如來耳飡法味，普恩慈大，愍念一切，為興福田，令得脫苦。",
        "translation": "We are fortunate enough to be able to get close to the taste of the Dharma that comes from hearing and hearing the Tathāgata, who is universally kind and compassionate toward all people, in order to cultivate a field of merit and free them from suffering.",
        "source": "T14n0492a_001:0753c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語至誠而信者少，是世多惡，眾生相詛，多信鬼神背正向邪，天堂皆空地獄塞滿，甚可痛哉！",
        "translation": "Few people believe the Buddha's words with utmost sincerity, the world is full of evil, sentient beings are cursed, many believe in ghosts and spirits, and deviate from what's right and turn to what's wrong; heaven is empty and hell is full.",
        "source": "T14n0492a_001:0754a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有信者，或一若兩，奈何世凋，乃當如此。",
        "translation": "If there were believers, maybe one or two, but the world is dying, and that's how it should be.",
        "source": "T14n0492a_001:0754a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛滅度後，經法獨存，少有行者；人民轉偽，漸銷淪替將衰滅矣。",
        "translation": "After the Buddha's death, the sūtras and teachings alone remain, and there are few practitioners; the people have become hypocritical, and they're gradually declining and becoming obsolete.",
        "source": "T14n0492a_001:0754a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嗚呼！",
        "translation": "Aah!",
        "source": "T14n0492a_001:0754a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛哉！",
        "translation": "What a pain!",
        "source": "T14n0492a_001:0754a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復何恃怙？",
        "translation": "What else is there to rely on?",
        "source": "T14n0492a_001:0754a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，為諸晚學留神顯化，未可般泥洹。」",
        "translation": "Please let the Bhagavān preserve the spirit of late learners and show them how to live in a state of nirvāṇa that's not yet possible.\"",
        "source": "T14n0492a_001:0754a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難因進頌曰：「佛為三界護，　　恩廣普慈大，　願為晚學類，　　未可取泥洹。",
        "translation": "Ānanda then offered this verse, \"The Buddha protects the three realms, his kindness is vast and his compassion is great, and I wish for those who are late trainees that they might not yet attain nirvāṇa.",
        "source": "T14n0492a_001:0754a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　痛矣未達者，　　瞢瞢不別真，　法鼓震三千，　　云何不得聞？",
        "translation": "It's painful for those who haven't yet attained it to be so blind and unable to distinguish the truth; the Dharma drum shakes 3,000 people, but why can't they hear it?",
        "source": "T14n0492a_001:0754a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世濁諸惡人，　　自還墮顛倒，　不信世有佛，　　自作眾罪本。",
        "translation": "\"The world is full of impure people who fall into delusion, don't believe in the existence of a worldly Buddha, and create the basis of their own crimes.",
        "source": "T14n0492a_001:0754a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　命盡往地獄，　　刀劍解其身，　祠祀好殺生，　　鑊湯涌其中；　婬泆抱銅柱，　　大火相燒然，　誹謗清高士，　　鐵鉤拔其舌；　亂酒無禮節，　　洋銅沃其口，　若生還作人，　　癡騃無義方。",
        "translation": "They go to hell when their life is up, where their bodies are cut off by the sword; they are good killers at shrines, where woks and baths well up; they embrace a copper pillar in their lust, where a great fire burns them; they denigrate noble people, where their tongues are pulled out by iron hooks; they drink wine without restraint, where foreign copper fills their mouths; they are born again as humans, stupid and without a sense of purpose.",
        "source": "T14n0492a_001:0754a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不殺得長壽，　　無病常康強；　不盜後大富，　　錢財恒自饒；　不婬香淨潔，　　身體鮮苾芬；　至誠不欺詐，　　為人所信承；　不醉得聰明，　　眾人所尊敬。",
        "translation": "Not killing obtains long life, and he's always healthy and strong without illness; not stealing brings great wealth, and his money is always productive; not engaging in sexual misconduct, he's pure and clean, and his body is fresh and fragrant; being sincere and not deceptive, he's trusted by others; not getting drunk, he attains intelligence and is respected by everyone.",
        "source": "T14n0492a_001:0754a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五福超法出，　　天人同儔類，　所生億萬倍，　　真諦甚分明。",
        "translation": "The five merits transcend the Dharma and transcend beyond, and gods and humans are the same in kind, producing billions of times more, with the true truth well discerned.",
        "source": "T14n0492a_001:0754a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　癡愚不別道，　　蔽聖毀正覺，　死入無擇獄，　　頭上戴鐵輪。",
        "translation": "Foolish and undiscriminating, they obscure the noble and disparage right awakening, enter the prison of no choice when they die, and wear an iron wheel on their heads.",
        "source": "T14n0492a_001:0754a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　求死不得死，　　須臾已變形，　矛戟相貫刺，　　軀體相殘截。",
        "translation": "Seeking death but not dying, they are transformed in a moment, pierced by spear and pike, and their bodies are mutilated.",
        "source": "T14n0492a_001:0754b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　曚曚不達事，　　惡惡相牽拘，　展轉眾徒趣，　　禽獸六畜形，　為人所屠割，　　以肉償宿怨，　無道墮惡道，　　求脫甚為難。",
        "translation": "Not comprehending anything in ignorance, they are held captive by evil, lead many rebirths, take the form of animals and six animals, are slaughtered by humans, use their flesh to settle old grudges, fall into a bad path without a path, and find it very difficult to escape.",
        "source": "T14n0492a_001:0754b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人身既難得，　　佛法難得聞，　世尊為眾祐，　　安住之特尊。",
        "translation": "Since the human body is difficult to obtain, the Buddha's teaching is difficult to hear, but the Bhagavān is the protector of all, the special honored one who lives in peace.",
        "source": "T14n0492a_001:0754b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　敷遺甘露法，　　晚學普奉行，　哀我現深慧，　　愍念群生故。",
        "translation": "He bestows the nectar of the Dharma, which is universally practiced by late-students, pities my profound wisdom, and takes pity on sentient beings.",
        "source": "T14n0492a_001:0754b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　開悟示道地，　　行者得度脫，　福人在向向，　　見諦樂不生。",
        "translation": "Enlightening them and showing them the path's stages, practitioners attain liberation, the fortunate are directed toward them, and their pleasure in seeing the truth doesn't arise.",
        "source": "T14n0492a_001:0754b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自歸安仁聖，　　殖種不死路，　恩慈無過佛，　　神妙現威光。",
        "translation": "They take refuge in the noble ones, planting seeds on the path to immortality, bestowing kindnesses unsurpassed by the Buddha, and displaying marvelous splendor.",
        "source": "T14n0492a_001:0754b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願使一切人，　　得服甘露漿，　慧船到彼岸，　　法磬倡三千。",
        "translation": "May all people be made to drink nectar, the ship of wisdom reaches the other shore, and the Dharma chime promotes the 3,000.",
        "source": "T14n0492a_001:0754b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼我無我想，　　眾祐轉法輪，　我等蒙嘉慶，　　得捨十二緣，　歡喜稽首拜，　　自歸最無上。」",
        "translation": "He has no conception of self, and all of his blessings turn the wheel of the Dharma; we are blessed, attain freedom from the twelve conditions, rejoice, bow our heads, and take refuge in the most unsurpassed.\"",
        "source": "T14n0492a_001:0754b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難稽首頌已，諸會大眾得不迴還，心意開解，僧那大鎧志無上道，甘露之音，香熏十方。",
        "translation": "After Ānanda bowed his head in praise, the assembled people did not turn back, their minds were liberated, and Senna's great armor aspired to the unsurpassed path, and the sound of ambrosia perfumed the ten directions.",
        "source": "T14n0492a_001:0754b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現道地為作橋梁，國王、臣民、天龍、鬼神，聞佛所說，阿難所頌，且悲、且感、且歎、且喜，稽首佛足，及禮阿難，受教而去。",
        "translation": "The king, his subjects, gods, dragons, and demons who heard what the Buddha taught and what Ānanda praised were compassionate, emotional, admiring, and joyous as they bowed their heads at the Buddha's feet, paid homage to Ānanda, and accepted the teaching.",
        "source": "T14n0492a_001:0754b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說阿難問事佛吉凶經",
        "translation": "Sutra on Ānanda's Questions to the Buddha Concerning His Auspiciousness",
        "source": "T14n0492a_001:0754b25_0",
        "is_bad_quality": false
    }
]