[
    {
        "source_sentence": "金色童子因緣經卷第四",
        "translation": "Sutra on the Causes and Conditions of the Golden Boy, Volume 4",
        "source": "T14n0550_004:0871a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試",
        "translation": "Examination of the Tripiṭaka of the Western Paradise Translation Sutra, Chaoshandaifu",
        "source": "T14n0550_004:0871a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鴻臚卿傳梵大師賜紫沙門",
        "translation": "The Great Master Brahmā bestowed the purple brāhmaṇa, as transmitted by the Minister of Education",
        "source": "T14n0550_004:0871a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣法護等奉　詔譯",
        "translation": "Translated by imperial decree by ministers Fahou and others",
        "source": "T14n0550_004:0871a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，日照商主涉渡大海，獲利成辦，不日還復王舍大城。",
        "translation": "It was then that the merchant owner Rizhao waded across the ocean, reaped his reward, and returned to the great city of Rājagṛha in a few days.",
        "source": "T14n0550_004:0871a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當入城時，商主忽見不吉祥相，即時商主心生驚怖，身極顫掉，兩目眴動；其相所謂群飛聚前厲聲鳴噪。",
        "translation": "As he entered the city, the merchant suddenly saw an inauspicious sign, and immediately the merchant's mind became frightened, his body trembled, and his eyes dazzled; the sign said that a swarm of fliers had gathered in front of him, making a loud noise.",
        "source": "T14n0550_004:0871a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主素解其占，即作是念：「如我今者所見之相，極不祥善，決定我子金色童子有嬈亂事，今應在近，如相法說必有別離。」",
        "translation": "The merchant, who had long understood his fortune, then thought, \"Such a sign as the one I'm seeing now is extremely inauspicious and good; I'm sure my son, the golden boy, is in distress and should be near now, just as the signs say there must be a separation.\"",
        "source": "T14n0550_004:0871a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于是商主說伽陀曰：「如我兩目俱眴動，　　群飛厲聲而鳴噪，　決定我子於今時，　　別離之苦應在近。",
        "translation": "The merchant then spoke to Gadha, \"Suppose I have dazzling eyes and a lot of flying and loud noises, and it's certain that my son is near now, and the pain of separation should be near.",
        "source": "T14n0550_004:0871b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又若身支發顫掉，　　其心熱惱驚怖生，　決定親子今別離，　　惡相同前應在近。」",
        "translation": "Also, if his body limbs tremble and his mind becomes agitated and frightened, he's certain that his relative's son will be separated now, and he'll be near before bad forms arise.\"",
        "source": "T14n0550_004:0871b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主說是伽陀已，當其身心顫怖之際，思百千種無義利事，遲疑盤旋不知所止。",
        "translation": "After the merchant said this, Gadha, while he was shaking in body and mind, he thought about a thousand useless things, hesitating and wandering about without knowing where to stop.",
        "source": "T14n0550_004:0871b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復惟忖：「我今何故來復此城？」",
        "translation": "He also pondered, \"Why have I come back to this city?\"",
        "source": "T14n0550_004:0871b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至後時，聞多人眾舉聲[口*睪]叫，商主聞是[口*睪]叫聲時，又復思念。",
        "translation": "When he heard this [mouth*testicle] cry, the merchant again reflected on it.",
        "source": "T14n0550_004:0871b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃適四衢，復見多人如被羅剎怖畏侵惱，各各皆有別離苦逼。",
        "translation": "He then went out into the four quarters and saw many people who were terrorized and afflicted by Rāṣṭrapāla, each with their own distinctive afflictions.",
        "source": "T14n0550_004:0871b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居商主前，乃見一人，即發問言：「仁者！",
        "translation": "He was in front of the merchant when he saw one person, and he asked, \"Sir!",
        "source": "T14n0550_004:0871b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此何故事相如是？」",
        "translation": "What is this story that looks like this?\"",
        "source": "T14n0550_004:0871b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人答言：「日照商主有子其名金色童子，色相端嚴眾德圓具，而彼童子於自園中殺害迦尸孫那利女，王官不能審察是事，付執法人，將欲棄置四衢巷陌，眾所共聞，童子非久往棄屍林命垂殞謝。」",
        "translation": "They replied, \"The merchant owner Sunshine has a son named Golden Boy, whose appearance is beautiful and full of virtues, and that boy killed the Kāśyapīya woman in his garden. The king's officials were unable to examine the matter, so they sent their officials to dispose of the boy in the four lanes and streets, and everyone heard that the boy hadn't gone long enough to abandon his corpse in the forest and that his life was about to end.\"",
        "source": "T14n0550_004:0871b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，日照商主聞是語已，以子別離苦惱逼故，即時悶絕而躃于地，以水灑面，良久乃蘇。",
        "translation": "After hearing these words, the merchant owner Rizhao was overcome by the pain and suffering of his son's separation and immediately fell to the ground in a state of despair.",
        "source": "T14n0550_004:0871b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "扶持漸起，極大號哭，流淚如雨，四顧觀察，作如是言：「苦哉！",
        "translation": "He gradually got up with support, wept profusely, shed tears like rain, looked around, and observed him, saying, \"What a pain!",
        "source": "T14n0550_004:0871b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我子金色童子今在何處？」",
        "translation": "Where is my son, the golden boy, now?\"",
        "source": "T14n0550_004:0871b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于是商主速疾周行巷陌尋求，乃見己妻荒迷散髮，拊膝悲號，逼迫哀聲，周行馳走，以子別離極大苦故。",
        "translation": "The merchant then quickly searched the streets and lanes, and saw his wife, who was desolate and lost her hair, patting her knees and lamenting, forcing her to lament and sprint around, because her son's separation was so painful.",
        "source": "T14n0550_004:0871b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主見已，極生悲惱，哽咽流淚漸近其前。",
        "translation": "When the merchant owner saw this, he was extremely distressed and drew near to him, choking back tears.",
        "source": "T14n0550_004:0871b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妻見夫已，倍復悲號，憂箭射心流淚如雨，速詣夫前舉體投地。",
        "translation": "When his wife saw her husband, she again lamented, and with tears raining down from her heart, she quickly went to her husband and threw herself to the ground.",
        "source": "T14n0550_004:0871b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于是，日照商主前執其手高聲號哭，妻乃趨前虔伸拜奉，即作是言：「仁者夫主！",
        "translation": "Rizhao then took the merchant's hand and wept aloud, and his wife approached him, stretched out her arms in reverence, and bowed to him, saying, \"Sir, you're a good man!",
        "source": "T14n0550_004:0871b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "救我！",
        "translation": "Help me!",
        "source": "T14n0550_004:0871b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "救我！",
        "translation": "Help me!",
        "source": "T14n0550_004:0871b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今從夫乞彼愛子，願夫哀察。」",
        "translation": "Now, I've asked my husband for his beloved son, and I hope he'll take pity on me.\"",
        "source": "T14n0550_004:0871b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽陀曰：「願今夫主安慰我，　　我無福分無歡喜，　我今與子別離時，　　極大苦惱徒悲泣。",
        "translation": "Sugata said, \"May the husband now comfort me, for I have no portion of happiness and no joy, and when I part with my son now, I'll be saddened and weep with great distress.",
        "source": "T14n0550_004:0871b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　夫主共知子生時，　　若獲最上大喜者，　何故愛子復于今，　　執持受死而非久？",
        "translation": "If my husband knew together that when his child was born he would have attained the greatest joy, why did he love his child and still hold on to him until his death, but not for long?",
        "source": "T14n0550_004:0871c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我子調善復少勇，　　多種教典悉明解，　色相端嚴無比倫，　　大智之子將命殞，　斷我大族中種姓，　　破我大族中根源，　族中明炬大吉祥，　　息滅如是諸光照。",
        "translation": "\"My son is well-adjusted and even less courageous, he fully understands many scriptures, his appearance is dignified beyond compare, and the son of great wisdom will die, cutting off the seeds of my great clan, destroying the roots of my great clan, and holding a bright torch of great good fortune within my clan that will extinguish such illumination.",
        "source": "T14n0550_004:0871c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我子是為心中寶，　　是為相續中深愛，　我子眾中甘露眼，　　為執法者將刑戮。",
        "translation": "My son is a treasure in his heart, a deep favorite in his continuity, a mannish eye among my sons, and he'll be tortured and killed for those who hold to the Dharma.",
        "source": "T14n0550_004:0871c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切皆為子所作，　　失子猶如眼喪滅，　集聚心寶子亦然，　　何故今時將破壞？",
        "translation": "Everything is made for the son, and losing him is like losing your eyes; so is the son who has amassed a treasure of mind; why would he be destroyed now?",
        "source": "T14n0550_004:0871c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　夫當速疾發勤勇，　　為子廣施善方便，　若人能救我子時，　　一切珍寶我今與。",
        "translation": "You must quickly muster the courage and diligence to give your son a generous helping hand. If you could save my son, I would now give you all the treasures.",
        "source": "T14n0550_004:0871c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我見汝子於今時，　　未臨刑戮餘命在，　隨汝意樂及思惟，　　宜今速作救護事。」",
        "translation": "When I see your son now, his life is still there before he's killed, so according to your wishes and thoughts, it's time to quickly do something to save him.\"",
        "source": "T14n0550_004:0871c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，日照商主雖復以子離別憂苦逼迫哀切，然且奮警身心扶持，前詣諸人眾所，合掌告言：「汝諸仁者！",
        "translation": "At the time, although he was still saddened by the grief and suffering of his son's separation, the merchant owner Rizhao roused his body and mind to support him, went to the people, put his palms together, and told them, \"You good people!",
        "source": "T14n0550_004:0871c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸聽我語，我於今時險惡艱難斯現所發，汝等何不少施方便放捨救護？",
        "translation": "\"Listen to me, all of you, as I presently present myself with this dangerous and difficult situation, why don't you give generosity, charity, and relief?",
        "source": "T14n0550_004:0871c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若曠野中事難明察，今在王城汝豈不見？",
        "translation": "If it were difficult to discern what goes on in the wilderness, wouldn't you have seen it now in the king's city?",
        "source": "T14n0550_004:0871c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況復我子有德顯明，何故付執法人持將刑戮？",
        "translation": "Furthermore, since my son's virtue is clear, why would he entrust the law-enforcers with the task of punishing and killing him?",
        "source": "T14n0550_004:0871c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等何不少發悲心勤力救護？",
        "translation": "Why don't you lessen your compassionate efforts and diligently guard them?",
        "source": "T14n0550_004:0871c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何王者多種法律不審思惟？",
        "translation": "How do many kinds of laws of a king not come under scrutiny?",
        "source": "T14n0550_004:0871c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何不勇銳其心放捨我子？」",
        "translation": "Why don't you be bold and resolute in your resolve to release my son?\"",
        "source": "T14n0550_004:0871c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人眾中一答言：「商主！",
        "translation": "One of the multitude of people replied, \"Master merchant!",
        "source": "T14n0550_004:0871c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝此童子圓具眾德我等悉知，且於今時非汝一人獨受艱苦，我等內外一切人眾悲苦亦同，然亦我等未見方便，能令童子而獲放捨，是故我等心各愁憂，咸生熱惱。」",
        "translation": "We all know the many virtues of this boy of yours, and we don't know that you alone are suffering, but all of us inside and outside are suffering the same sorrow and pain.",
        "source": "T14n0550_004:0871c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主復言：「汝諸仁者！",
        "translation": "The merchant again said, \"You kind people!",
        "source": "T14n0550_004:0871c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復應知，今此童子畢竟純善，悲心增劇有大威德，法欲具足愛念眾生，豈於如是無義利事而能發心？",
        "translation": "Furthermore, you should know that this boy is ultimately good, has intensified compassion and great authority, and has a thorough desire for the Dharma and loves sentient beings, so how could he be motivated by such useless tasks?",
        "source": "T14n0550_004:0871c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況復行邪？",
        "translation": "How could it be wrong to do so?",
        "source": "T14n0550_004:0872a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願諸仁者速於今時特為審察，如是事相。",
        "translation": "\"May all you good people quickly and specifically examine these things for themselves now.",
        "source": "T14n0550_004:0872a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若或詳審，而此童子事有實者，此之危難願令放捨，汝等人眾若於是事詳證可成，一切人眾同汝教令，是故無少過失可得。",
        "translation": "If you examine it closely and this child's situation is real, I would like to ask you to let go of this danger, and if you people fully realize that it's possible, all of you will agree with your teaching, so there's no little mistake that can be made.",
        "source": "T14n0550_004:0872a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此外別無悲愍之心而為發現，若其然者，汝等能善愛敬有德悲心顯明，汝等若發悲愍心已，應詣王所，求王教令勅前臣輔，如汝所言宣示其事，無復別異而可信聽。",
        "translation": "If that's the case, then you people who are capable of loving and respecting virtuous people and whose compassion is clear should go to the king after you've aroused a compassionate mind and ask him to instruct and order his former ministers to assist you in explaining the matter as you've said, so that there's no difference between them and they're trustworthy and listenable.",
        "source": "T14n0550_004:0872a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁者當知，我今為子將其別離畢竟艱苦，能救護者我今悉與一切珍寶，惟願汝等廣施恩惠，為此童子如理詳察。」",
        "translation": "You should know, sir, that now I will separate my son from his ultimate suffering, and I will give all the treasures I have to those who can rescue him.",
        "source": "T14n0550_004:0872a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人眾聞商主言，具明其意，互相謂曰：「今此童子，眾德咸具，深可愛敬。」",
        "translation": "When the crowd heard what the merchant said, they understood exactly what he meant and said to each other, \"Now, this boy has many virtues, and he's deeply desirable.\"",
        "source": "T14n0550_004:0872a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時眾中召其二三有智之人、明正理者，遣詣王所具奏於王：「若王今時為金色童子勅彼臣輔，令其審細重復詳察事之虛實，我等民眾以十萬金奉上於王。」",
        "translation": "They then summoned two or three wise men from the crowd who understood right principles and sent them to the king to present to him, \"If the king were to order the golden boy to assist his ministers and make them carefully and repeatedly examine the facts, we would all present the king with 100,000 pieces of gold.\"",
        "source": "T14n0550_004:0872a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王從所奏。",
        "translation": "The king complied with his request.",
        "source": "T14n0550_004:0872a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有智人詣掌法司，先勅詳辯勇戾大臣之所。",
        "translation": "Then, a wise man went to the Dharma director and ordered him to carefully examine the bold and perverse minister's office.",
        "source": "T14n0550_004:0872a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，勇戾大臣遠見二三人來，即發問言：「汝等無其事緣，何故來此？」",
        "translation": "When the perverse minister saw two or three people coming from afar, he asked, \"Why are you here if you don't have any reason to be here?\"",
        "source": "T14n0550_004:0872a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人答言：「我等王舍大城所居，人眾哀告：『仁者！",
        "translation": "The people replied, \"We, the king, are staying in the great city, and the people are complaining, 'Sir!",
        "source": "T14n0550_004:0872a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此金色童子色相端嚴，眾德備具多人愛念，彼將別離，王舍城中一切人民極大逼惱，況復此人常樂正法、諸法律等，德行具足，此人無有少分過失，眾所共信。』",
        "translation": "Now, this golden boy has an elegant appearance and is replete with qualities that are beloved by many people. When he leaves, the people of Rājagṛha will be greatly distressed, but this person's constant delight in the right teaching, laws, and so forth, and his virtues are complete.",
        "source": "T14n0550_004:0872a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王勅仁者，今為金色童子重復審細詳辯前事，我等以十萬金奉上於王，日照商主亦自排備眾多珍寶而以奉之，令王廣藏有所增益。」",
        "translation": "The king commanded you, sir, to carefully reconsider and explain the previous events for the golden boy, and we presented the king with 100,000 pieces of gold, and the merchant owner Rizhao arranged to present it with many treasures of his own, so that the king's vast store would be enriched.\"",
        "source": "T14n0550_004:0872a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勇戾大臣聞是語已，忿恚答言：「事定已久，汝等何故復令詳辯？",
        "translation": "After hearing those words, the brave and violent minister became angry and replied, \"It's been a long time since this matter was settled, so why are you again making it a detailed explanation?",
        "source": "T14n0550_004:0872b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復何言與十萬金令增王藏，豈我今時非理取財增王府庫？",
        "translation": "What else did he say about giving 100,000 pieces of gold to increase the king's treasury, since I'm now taking money for the king's treasury without reason?",
        "source": "T14n0550_004:0872b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等誠謂不知王意，汝諸人眾於一切處巧設計智，欲令王者作無義利，此非方便，乃是汝等出譏謗言謗於王者，若或餘事欲令王者同斯詳辯，即見多人悉皆破壞。」",
        "translation": "You really say that you don't know the king's thoughts, and that you people are cleverly devising wisdom in various places to cause the king to do useless favors. This is not a method; it's just that you speak slanderously and defamely of the king, and if there's anything else you want to get the king to share this detailed explanation, you'll see how many people are destroyed.\"",
        "source": "T14n0550_004:0872b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勇戾大臣呵責彼等二三人已，即時呼召四類惡人：所謂造作極惡業者、不忍辱者、無慈愍者、無悲心者。",
        "translation": "After the brave minister rebuked two or three of those people, he then summoned four kinds of bad people, namely, those who create extremely bad karma, those who aren't tolerant, those who lack kindness, and those who lack compassion.",
        "source": "T14n0550_004:0872b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "召已，謂言：「汝等今速監逐彼諸膾宰之人出於城外，依我所言，如王法令殺彼童子。",
        "translation": "After summoning them, he said, \"Now, you must quickly chase those thieves out of the city and kill the boy according to my instructions, just as the king has decreed.",
        "source": "T14n0550_004:0872b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等勿得輒令放捨，自餘臣佐或有所言亦不可放。",
        "translation": "Don't let them go so easily, and don't let the rest of your ministers go even if they say so.",
        "source": "T14n0550_004:0872b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等若或依我教令斯即甚善；若不從命起異見者，我與汝等大生怨縛。」",
        "translation": "If you follow my instructions, that would be very good; if you don't obey my order and come to a different view, I'll become very hostile with you.\"",
        "source": "T14n0550_004:0872b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等答言：「我今從命。」",
        "translation": "They replied, \"Now, I'll obey.\"",
        "source": "T14n0550_004:0872b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，四監逐官受旨命已，各執利劍監逐前行。",
        "translation": "After they received the order, the four officers of the guard each carried a sharp sword and marched forward.",
        "source": "T14n0550_004:0872b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸膾宰審慮百端運謀方計，徐緩進步執持童子，迂轉四衢周行巷陌，欲令一切普使聞知，乃作是言：「苦哉！",
        "translation": "The chief constable then, considering the myriad options and scheming, slowly advanced and carried the boy as he meandered through the four streets and lanes, wanting to make sure that all the universal messengers heard him, and then said, \"What a pain!",
        "source": "T14n0550_004:0872b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今作何方計，今此童子脫免斯難？",
        "translation": "What kind of plan have I made to free this boy from this difficulty?",
        "source": "T14n0550_004:0872b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今時，豈能作此無義利事？」",
        "translation": "How could we, at this point, do such a useless thing?\"",
        "source": "T14n0550_004:0872b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，四監逐官各執利劍，詣諸膾宰之前，告語彼言：「汝等宜應如，彼大臣所授旨命速營其事，汝等若不速出城外，如彼法令殺其童子，我即今時斷汝等命。」",
        "translation": "Then, the four officers of the guard each carried a sharp sword and went before the chief ministers and told them, \"You should quickly conduct your business as that minister has ordered; if you don't quickly leave the city and kill the children according to their order, I will cut off your lives right now.\"",
        "source": "T14n0550_004:0872b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼四類極惡監逐之官，各執利劍其狀可畏，怒目觀視彼諸膾宰。",
        "translation": "The four kinds of extremely vicious officials who were chasing them each carried a sharp sword and had a fearsome appearance, and they looked angrily at those captains of war.",
        "source": "T14n0550_004:0872b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等慮其斷命，咸生驚怖，皆言：「苦哉！",
        "translation": "They were all terrified at the thought of their lives being cut off, and they all said, \"Oh, this is painful!",
        "source": "T14n0550_004:0872b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今時無復方計救此童子，須宜從命而將致殺。」",
        "translation": "There's nothing we can do now to save this boy; we should obey orders that will cause him to be killed.\"",
        "source": "T14n0550_004:0872b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言已，悲傷滿目垂淚。",
        "translation": "After he said that, his eyes were filled with tears as he grieved.",
        "source": "T14n0550_004:0872c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，四監逐官疾速催驅金色童子出於城外。",
        "translation": "At the time, the four officers of the comptroller quickly rushed the golden boy out of the city.",
        "source": "T14n0550_004:0872c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當其童子出城之時，有無數百千人眾奔馳瞻覩，傷痛流淚，異口同音，咸作是言：「苦哉！",
        "translation": "When the boy left the city, hundreds of thousands of people rushed to see him, weeping with sorrow and pain, speaking with one voice, and all saying, \"Oh, this is painful!",
        "source": "T14n0550_004:0872c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "What suffering!",
        "source": "T14n0550_004:0872c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日照商主大寶散失，又此日照商主根源上族而悉斷壞，日照商主族中明炬而將息滅，日照商主族中最上髻珠墜落，日照商主清淨眼滅，日照商主妙好莊嚴今悉離散，日照商主心極痛傷其猶開剖，日照商主體中命殞。",
        "translation": "The merchant Sunshine owner's great treasures have been scattered, the merchant Sunshine owner's family with superior roots has all been destroyed, the torch of light in the merchant Sunshine owner's family is about to go out, the pearl in the topknot of the merchant Sunshine owner's family has fallen down, the merchant Sunshine owner's pure eye has disappeared, the merchant Sunshine owner's marvelous adornments have all been scattered, the merchant Sunshine owner's heart is deeply saddened, and he's still being cut open, and the merchant Sunshine owner's life has died in his body.",
        "source": "T14n0550_004:0872c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T14n0550_004:0872c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "What suffering!",
        "source": "T14n0550_004:0872c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故令此童子出於城外曠野孤逈寂寥之所？",
        "translation": "Why did you send this boy out into the wilderness to a lonely, isolated place outside the city?",
        "source": "T14n0550_004:0872c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盤旋宛轉無救無依？",
        "translation": "circling, twisting, turning, without help or support?",
        "source": "T14n0550_004:0872c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此童子於其最勝王舍城中，如清淨月為彼羅睺之所吞食，又此王舍大城如空中日白晝銷殞；王舍大城所居人眾，喪甘露眼迷失方處；王舍大城所居人眾，相續深愛而悉離散；王舍大城所居人眾妙好莊嚴今已廢棄；王舍大城所居人眾髻珠墜落；王舍大城所居人眾心所愛寶今悉破壞；王舍大城所居人眾目既喪，明將何瞻覩？",
        "translation": "Now, in this most excellent city of Rājagṛha, this boy is like the pure moon that Rāhu devours, and this great city of Rājagṛha is like the sun in the sky dying in daylight; the people living in the great city of Rājagṛha have lost their nectar eyes and gone astray; the people living in the great city of Rājagṛha have lost their continuing deep love and are all scattered; the beautiful adornments of the people living in the great city of Rājagṛha have now been abandoned; the topknot pearl of the people living in the great city of Rājagṛha has fallen down; the treasures beloved by the hearts of the people living in the great city of Rājagṛha have all been destroyed; and the eyes of the people living in the great city of Rājagṛha have been lost, so what will they see in the light?",
        "source": "T14n0550_004:0872c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今時見是事已，云何能生悅樂？",
        "translation": "After we see this, how can we become happy?",
        "source": "T14n0550_004:0872c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心意誠謂我等無所依止。」",
        "translation": "Their minds and thoughts are sincere, saying, 'We have nothing to rely on.'\"",
        "source": "T14n0550_004:0872c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，童子既出城已，彼監逐官遣人來白勇戾大臣：「金色童子已出王舍大城。」",
        "translation": "After the boy had left the city, the chancellor sent someone to tell Minister Yong of the Opposition, \"The golden boy has left the great city of Rājagṛha.\"",
        "source": "T14n0550_004:0872c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勇戾大臣聞已歡喜。",
        "translation": "When he heard that, the violent minister rejoiced.",
        "source": "T14n0550_004:0872c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時先所來者，其二三人聞是事已，愁憂不樂，寂然無依還訪城中。",
        "translation": "After hearing this, two or three of those who had come before them became sad and unhappy, and they returned to the city in peace and without support.",
        "source": "T14n0550_004:0872c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先同議者，彼彼人眾具陳上事，彼諸人眾聞已，愁憂寂無依托，互相議言：「汝等應知，我之國主阿闍世王，是惡王者不遵正理，昔害父命今作非法，以其有德色相端嚴眾所愛念勝智之人，而令殺害。",
        "translation": "After they heard the above, they were sad and lonely, with no support, and they said to each other, \"You should know that this bad king, Lord Ajātaśatru, doesn't follow right principles, didn't harm his father's life in the past, and now he's acting unlawfully, killing people of superior intelligence because of their virtuous appearance and the dignity of their people's thoughts.",
        "source": "T14n0550_004:0872c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T14n0550_004:0873a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王者極無悲愍。",
        "translation": "\"The king is extremely unsympathetic.",
        "source": "T14n0550_004:0873a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T14n0550_004:0873a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王者不知有德，王及臣輔無勝知見，何故不令依正法律審細詳辯？",
        "translation": "If the king doesn't know that he has virtue, and the king and his ministers have no superior knowledge or views, why aren't they made to examine and explain the matter in detail according to the correct law?",
        "source": "T14n0550_004:0873a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以勝善人輕為棄捨？",
        "translation": "Is it because a good person despises abandonment?",
        "source": "T14n0550_004:0873a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又或時數使其然哉，正法隱陷增長非法，於濁時中信惡人語，故令有德極善之人生別離苦。",
        "translation": "Perhaps these things happen because the right teaching becomes invisible, increases unlawfulness, and teaches unwholesome people to speak when it's impure, so that virtuous and extremely good people are separated from suffering.",
        "source": "T14n0550_004:0873a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T14n0550_004:0873a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "What suffering!",
        "source": "T14n0550_004:0873a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深無義利。」",
        "translation": "Profoundly pointless.\"",
        "source": "T14n0550_004:0873a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金色童子因緣經卷第四",
        "translation": "Sutra on the Causes and Conditions of the Golden Boy, Volume 4",
        "source": "T14n0550_004:0873a07_0",
        "is_bad_quality": false
    }
]