[
    {
        "source_sentence": "佛說彌勒下生經",
        "translation": "Sutra on the Descent of Maitreya, Expounded by the Buddha",
        "source": "T14n0453_001:0421a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏三藏竺法護譯",
        "translation": "Translation of the Tripiṭaka of the Yuezhi Family of the Western Jin Dynasty by Zhu Fahou",
        "source": "T14n0453_001:0421a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在舍衛國祇樹給孤獨園，與大比丘眾五百人俱。",
        "translation": "Thus I have heard: One time, the Buddha was present in Anāthapiṇḍada Park in Jeta Grove in Śrāvastī with a large assembly of five hundred monks.",
        "source": "T14n0453_001:0421a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿難偏露右肩，右膝著地，白佛言：「如來玄鑒，無事不察，當來、過去、現在三世，皆悉明了；過去諸佛姓字、名號，弟子、菩薩、翼從多少，皆悉知之；一劫、百劫、若無數劫，皆悉觀察，亦復如是；國王、大臣、人民姓字則能分別；如今現在國界若干亦復明了。",
        "translation": "Ānanda then bared his right shoulder, knelt on his right knee, and said to the Buddha, \"The Tathāgata's mysterious mirror, which doesn't fail to examine everything, fully understands the three periods in the future, past, and present; it fully knows the names and surnames of the buddhas of the past and the number of disciples, bodhisattvas, and followers; it fully observes and does so for an eon, a hundred eons, or an incalculable number of eons; it can discern the names and surnames of kings, ministers, and people; and it also clearly understands the number of countries in the present.",
        "source": "T14n0453_001:0421a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將來久遠彌勒出現，至真、等正覺，欲聞其變，弟子、翼從，佛境豐樂，為經幾時？」",
        "translation": "How long will it be before Maitreya appears, attains true and perfect enlightenment, wants to hear about his transformation, and his disciples and followers are rich and happy in the Buddha's realm?\"",
        "source": "T14n0453_001:0421a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「汝還就坐，聽我所說彌勒出現國土豐樂、弟子多少。",
        "translation": "The Buddha told Ānanda, \"Go back to your seat and listen to what I've told you about the abundance and happiness of Maitreya's land of appearance and the number of his disciples.",
        "source": "T14n0453_001:0421a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之，執在心懷。」",
        "translation": "Consider it well and keep it in your mind.\"",
        "source": "T14n0453_001:0421a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，阿難從佛受教，即還就坐。",
        "translation": "Ānanda then accepted the Buddha's teaching and returned to his seat.",
        "source": "T14n0453_001:0421a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告阿難曰：「將來久遠於此國界當有城郭名曰翅頭，東西十二由旬，南北七由旬，土地豐熟，人民熾盛，街巷成行。",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"A long time in the future, there will be a city called Wisdom, 12 leagues east and west and seven leagues north and south, with its land abundant, its people flourishing, and its streets lined with rows of streets.",
        "source": "T14n0453_001:0421a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，城中有龍王名曰水光，夜雨香澤，晝則清和。",
        "translation": "At the time, there was a dragon king in the city named Suigwang, which rained fragrant water at night and made things quite peaceful by day.",
        "source": "T14n0453_001:0421a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，翅頭城中有羅剎鬼名曰葉華，所行順法不違正教，每向人民寢寐之後，除去穢惡諸不淨者；常以香汁而灑其地，極為香淨。",
        "translation": "At the time, there was a Rāṣṭrapāla demon named Yehwa in the city of Wisdom who followed the Dharma and didn't disobey the right teaching, removing filth and impurities after the people slept and always sprinkled the ground with scented juice, making it extremely fragrant and pure.",
        "source": "T14n0453_001:0421a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿難當知，爾時閻浮地東西南北千萬由旬，諸山河石壁皆自消滅，四大海水各減一萬。",
        "translation": "\"Ānanda, you should know that at the time, the Jambudvīpa region was ten million leagues wide from east to west and from north to south, and the mountains, rivers, and rock walls all ceased by themselves, and the four great waters of the ocean were each reduced by ten thousand.",
        "source": "T14n0453_001:0421a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時閻浮地極為平整，如鏡清明。",
        "translation": "The ground of Jambudvīpa was then perfectly flat, like a clear mirror.",
        "source": "T14n0453_001:0421a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉閻浮地內穀食豐賤，人民熾盛，多諸珍寶。",
        "translation": "Food was abundant and cheap in the land of Jambudvīpa, and the people were prosperous and full of treasures.",
        "source": "T14n0453_001:0421a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸村落相近，鷄鳴相接。",
        "translation": "Villages were close together, and chickens were crowing.",
        "source": "T14n0453_001:0421a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，弊華果樹枯竭，穢惡亦自消滅；其餘甘美果樹、香氣殊好者皆生于地。",
        "translation": "When the rotten fruit-brush trees wither, the filth also disappears, and the other sweet fruit-brush trees with their excellent fragrances are born on the ground.",
        "source": "T14n0453_001:0421a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，時氣和適四時順節，人身之中無有百八之患：貪欲、瞋恚、愚癡、不大慇懃。",
        "translation": "\"At the time, the weather was appropriate for the four seasons, and there were no 108 afflictions among humans: craving, anger, foolishness, and lack of diligence.",
        "source": "T14n0453_001:0421b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人心均平，皆同一意，相見歡悅，善言相向。",
        "translation": "All human minds are even, all share the same intention, rejoice when they see each other, and speak well of each other.",
        "source": "T14n0453_001:0421b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言辭一類無有差別，如彼優單越人而無有異。",
        "translation": "There's no difference in the way they speak, just as there's no difference between the Uttaraks.",
        "source": "T14n0453_001:0421b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，閻浮地內人民大小皆同一向，無若干之差別也。",
        "translation": "At the time, the people of the Jambudvīpa region were all unified in size and orientation, with no distinctions of any kind.",
        "source": "T14n0453_001:0421b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時，男女之類意欲大小便時地自然開，事訖之後地便還合。",
        "translation": "At the time, the ground naturally opens when a man or woman desires to urinate or defecate, and it rejoins after the deed is done.",
        "source": "T14n0453_001:0421b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，閻浮地內自然生粳米，亦無皮裹，極為香美，食無患苦。",
        "translation": "\"At that time, millet naturally grows in the Jambudvīpa without a skin covering, and it's extremely fragrant and delicious, so eating it causes no pain.",
        "source": "T14n0453_001:0421b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂金、銀、珍寶、車璩、馬瑙、真珠、虎珀，各散在地，無人省錄。",
        "translation": "What's called gold, silver, precious metals, chariot rings, cornelian, genuine pearls, and tiger pearls are each scattered on the ground, and no one consults them.",
        "source": "T14n0453_001:0421b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，人民手執此寶，自相謂言：『昔者之人由此寶故更相傷害，繫閉在獄受無數苦惱；如今此寶與瓦石同流，無人守護。』",
        "translation": "The people then held this treasure in their hands and said to each other, 'People in the past were harmed by this treasure and were confined to prison and subjected to countless sufferings; now this treasure is flowing with the rubble, and no one guards it.'",
        "source": "T14n0453_001:0421b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，法王出現，名曰蠰佉。",
        "translation": "\"At the time, the Dharma king appeared, and his name was Cerebro.",
        "source": "T14n0453_001:0421b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法治化，七寶成就。",
        "translation": "He correctly disciplined people and accomplished the task with seven treasures.",
        "source": "T14n0453_001:0421b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂七寶者，輪寶、象寶、馬寶、珠寶、玉女寶、典兵寶、守藏之寶，是謂七寶。",
        "translation": "These are called the seven treasures, which are the wheel treasure, elephant treasure, horse treasure, jewelry, jeweled women's treasure, the treasures of military officers, and the treasure that guards the treasure house.",
        "source": "T14n0453_001:0421b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鎮此閻浮地內，不以刀杖自然靡伏。",
        "translation": "When they're placed here in the Jambudvīpa region, they can be naturally subdued without a sword or stick.",
        "source": "T14n0453_001:0421b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如今，阿難！",
        "translation": "Now, Ānanda!",
        "source": "T14n0453_001:0421b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四珍之藏：乾陀越國伊羅鉢寶藏，多諸珍琦異物不可稱計；第二彌梯羅國綢羅大藏，亦多珍寶；第三須賴吒大國有大寶藏，亦多珍寶；第四婆羅[木*奈]蠰佉有大寶藏，多諸珍寶不可稱計。",
        "translation": "There are four precious treasures: the great treasure house of Airāvaṇa in Gandhāra, which has an incalculable amount of rare and exotic things; the great treasure house of Śālavana in the second country of Maitreya, which also has an abundance of treasures; the great treasure house of the third country of Sūraṭṭha, which also has an abundance of treasures; and the great treasure house of the fourth country of Bālā[mu*nā]īkha, which has an incalculable amount of treasures.",
        "source": "T14n0453_001:0421b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四大藏自然應現，諸守藏人各來白王：『唯願大王以此寶藏之物惠施貧窮。』",
        "translation": "When these four great treasures naturally appeared, the treasure keepers each came to the king and said, 'Please, Your Majesty, give this precious treasure to the poor.'",
        "source": "T14n0453_001:0421b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，蠰佉大王得此寶已，亦復不省錄之，意無財寶之想。",
        "translation": "After he had obtained this treasure, the great king Cerebro also didn't think about it or record it, and he had no thoughts of wealth or treasure.",
        "source": "T14n0453_001:0421b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時閻浮地內，自然樹上生衣，極細柔軟，人取著之，如今優單越人自然樹上生衣，而無有異。",
        "translation": "At the time, there were robes that grew on a natural tree in the land of Jambudvīpa that were extremely fine and flexible, and people took them and put them on, and there was no difference between the robes that grow on the natural tree of the people of Uttarakuru today.",
        "source": "T14n0453_001:0421b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼王有大臣名曰修梵摩，是王少小同好，王甚愛敬；又且顏貌端正，不長、不短，不肥、不瘦，不白、不黑，不老、不少。",
        "translation": "\"At the time, the king had a minister named Xiufanman, a young fellow friend of the king's who was greatly admired by the king and whose features were correct, not long or short, not fat or thin, not white or black, and not old or not old at all.",
        "source": "T14n0453_001:0421b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，修梵摩有妻名梵摩越，王女中最極為殊妙，如天帝妃——口作優鉢蓮華香，身作栴檀香；諸婦人八十四態永無復有，亦無疾病亂想之念。",
        "translation": "At the time, Cūḷapanthaka had a wife named Brahmā, the most excellent of the king's women, who was like a goddess with the scent of the utpala lotus on her lips and the scent of sandalwood on her body; those women had 84 forms that never again existed, and they had no distracting thoughts of illness.",
        "source": "T14n0453_001:0421c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒菩薩於兜率天，觀察父母不老不少，便降神下應從右脇生，如我今日右脇生無異，彌勒菩薩亦復如是。",
        "translation": "\"At the time, Maitreya Bodhisattva was in Tuṣita Heaven, observing that his parents didn't age much, and then he sent down his spirit to give birth from his right hypochondrium, just as I am today, so did Maitreya Bodhisattva.",
        "source": "T14n0453_001:0421c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兜率諸天各各唱令：『彌勒菩薩已降神生。』",
        "translation": "Each of the Tuṣita gods replied, 'Maitreya has descended into spiritual birth.'",
        "source": "T14n0453_001:0421c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時，修梵摩即與子立字，名曰彌勒。",
        "translation": "\"At that point, Cūḷapanthaka created a name for his son, Maitreya.",
        "source": "T14n0453_001:0421c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒菩薩有三十二相、八十種好莊嚴其身，身黃金色。",
        "translation": "Bodhisattva Maitreya has thirty-two marks and eighty attributes adorning his body, which is yellow-gold in color.",
        "source": "T14n0453_001:0421c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，人壽極長，無有諸患，皆壽八萬四千歲。",
        "translation": "At the time, his life was extremely long and free from trouble, and they all lived 84,000 years.",
        "source": "T14n0453_001:0421c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人年五百歲然後出嫡。",
        "translation": "A woman is 500 years old before she leaves her mother's womb.",
        "source": "T14n0453_001:0421c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒在家未經幾時，便當出家學道。",
        "translation": "\"At the time, Maitreya hadn't been at home for very long before he left home to train on the path.",
        "source": "T14n0453_001:0421c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，去翅頭城不遠有道樹名曰龍花，高一由旬，廣五百步。",
        "translation": "At the time, there was a road tree named Nāgârjuna that was a yojana high and 500 paces wide not far from the city of Indra.",
        "source": "T14n0453_001:0421c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彌勒菩薩坐彼樹下成無上道果。",
        "translation": "Sitting under that tree, Maitreya then became the fruit of the unsurpassed path.",
        "source": "T14n0453_001:0421c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「當其夜半彌勒出家，即於其夜成無上道。",
        "translation": "\"At the middle of the night, Maitreya left home and accomplished the unsurpassed path that very night.",
        "source": "T14n0453_001:0421c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時三千大千剎土六返震動，地神各各相告曰：『今時彌勒已成佛。』",
        "translation": "Three thousand great thousand buddhas and lands then shook six times, and the earth spirits each told them, 'Now, Maitreya has become a buddha.'",
        "source": "T14n0453_001:0421c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉至聞四天王宮：『彌勒已成佛道。』",
        "translation": "He went on to hear from the palaces of the four heavenly kings, 'Maitreya has accomplished the Buddha Way.'",
        "source": "T14n0453_001:0421c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉轉聞徹三十三天、豔天、兜率天、化自在天、他化自在天，聲聞展轉至梵天：『彌勒已成佛道。』",
        "translation": "They went on to hear that they had penetrated the Trāyastriṃśa Heaven, Vaiśravaṇa Heaven, Tuṣita Heaven, Paranirmitavaśavartin Heaven, and śrāvakas spreading out to the Brahma Heaven, 'Maitreya has accomplished the Buddha Way.'",
        "source": "T14n0453_001:0421c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，魔王名大將，以法治化。",
        "translation": "\"At the time, the Māra King was called a great general who disciplined and transformed people with the teachings.",
        "source": "T14n0453_001:0421c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如來名音響之聲，歡喜踊躍不能自勝，七日七夜不眠不寐。",
        "translation": "When he heard the sound of the Tathāgata's name and voice, he rejoiced and jumped up and down, unable to control himself, and he stayed awake for seven days and nights.",
        "source": "T14n0453_001:0421c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，魔王將欲界無數天人至彌勒佛所恭敬禮拜。",
        "translation": "The Māra King then sent countless gods and humans from the desire realm to the Maitreya Buddha to venerate and worship him.",
        "source": "T14n0453_001:0421c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彌勒聖尊與諸天人漸漸說法微妙之論，所謂論者，施論、戒論、生天之論，欲不淨想、出要為妙。",
        "translation": "\"Gradually, the noble Maitreya and the gods taught him subtle treatises, which are called treatises on generosity, precepts, birth in heaven, desires, impure concepts, and the subtlety of renunciation.",
        "source": "T14n0453_001:0422a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒見諸人民已發心歡喜，諸佛世尊常所說法，苦、習、盡、道，盡與諸天人廣分別其義。",
        "translation": "At the time, Maitreya saw that the people had become encouraged, and the Bhagavān always explained the meaning of suffering, accumulation, cessation, and the path in detail to the gods.",
        "source": "T14n0453_001:0422a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，座上八萬四千天子，諸塵垢盡，得法眼淨。",
        "translation": "At the time, 84,000 celestials on their seats had their dust and dirt removed, and they attained purification of the Dharma eye.",
        "source": "T14n0453_001:0422a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，大將魔王告彼界人民之類曰：『汝等速出家。",
        "translation": "\"At the time, the commander Māra King addressed a group of people from that world, saying, \"All of you, leave home quickly!",
        "source": "T14n0453_001:0422a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T14n0453_001:0422a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒今日已度彼岸，亦當度汝等使至彼岸。』",
        "translation": "Today, Maitreya has crossed to the other shore, and he will cross to the other shore for you, too.'",
        "source": "T14n0453_001:0422a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，翅頭城中有長者名曰善財，聞魔王教令，又聞佛音響，將八萬四千眾至彌勒佛所，頭面禮足，在一面坐。",
        "translation": "\"It was then that an elder named Shanzai from the city of Wisdom heard the King of Māra's instructions and heard the Buddha's voice, so he sent 84,000 people to Maitreya Buddha, bowed his head and feet, and sat down at one side.",
        "source": "T14n0453_001:0422a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒漸與說法微妙之論，所謂論者，施論、戒論、生天之論，欲不淨想、出要為妙。",
        "translation": "\"It was then that Maitreya gradually explained the subtle theory of Dharma, which is called the theory of generosity, the theory of morality, the theory of birth in heaven, the desire for impurity, and the subtlety of renunciation.",
        "source": "T14n0453_001:0422a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒見諸人民心開意解，如諸佛世尊常所說法，苦、習、盡、道，與諸人民廣分別義。",
        "translation": "At the time, Maitreya saw the people's minds open and their thoughts understand as the Bhagavān always taught them about suffering, accumulation, ending, and the path, and he gave the people a broad discernment of their meaning.",
        "source": "T14n0453_001:0422a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，座上八萬四千人諸塵垢盡，得法眼淨。",
        "translation": "At the time, the 84,000 people on the throne had their defilements ended and attained purification of the Dharma eye.",
        "source": "T14n0453_001:0422a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，善財與八萬四千人等即前白佛，求索出家，善修梵行，盡成阿羅漢道。",
        "translation": "Shanzai and the 84,000 people then went before the Buddha and asked him to leave home, skillfully cultivate the religious practice, and ultimately achieve the arhat path.",
        "source": "T14n0453_001:0422a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒初會，八萬四千人得阿羅漢。",
        "translation": "\"At the time, 84,000 people attained arhatship during Maitreya's first assembly.",
        "source": "T14n0453_001:0422a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時，蠰佉王聞彌勒已成佛道，便往至佛所欲得聞法。",
        "translation": "\"When the king of Cerebro heard that Maitreya had accomplished the Buddha's path, he went to the Buddha to hear the Dharma as he desired.",
        "source": "T14n0453_001:0422a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彌勒佛與王說法，初善、中善、竟善，義理深邃。",
        "translation": "Maitreya then taught the king Dharma that was good in the beginning, good in the middle, and good in the end, and that was profound in its meaning.",
        "source": "T14n0453_001:0422a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大王復於異時立太子為王，賜剃頭師珍寶，復以雜寶與諸梵志，將八萬四千眾往至佛所求作沙門，盡成道果得阿羅漢。",
        "translation": "At another time, the king crowned a prince, bestowed a shaven-head priest with treasures, gave him mixed treasures and priests, and sent 84,000 people to the Buddha to seek to become ascetics who would attain the fruit of the path and become arhats.",
        "source": "T14n0453_001:0422a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時，修梵摩大長者聞彌勒已成佛道，將八萬四千梵志之眾往至佛所求作沙門，得阿羅漢——唯修梵摩一人斷三結使必盡苦際。",
        "translation": "\"Then, when the great elder Cūḷapanthaka heard that Maitreya had accomplished the Buddha's path, he sent 84,000 crowds of priests to the Buddha to seek appointment as ascetics and attain arhatship - only Cūḷapanthaka alone had cut the three bonds and would surely end suffering.",
        "source": "T14n0453_001:0422a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時，佛母梵摩越復將八萬四千婇女之眾往至佛所求作沙門。",
        "translation": "\"At the time, Brahmā, the Buddha's mother, also sent 84,000 Ṛṣipatana women to the Buddha to become ascetics.",
        "source": "T14n0453_001:0422a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸女人盡得阿羅漢——唯有梵摩越一人斷三結使成須陀洹。",
        "translation": "At the time, all of those women had become arhats - only one, Brahmā, had cut the three bonds and become a stream entrant.",
        "source": "T14n0453_001:0422b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，諸剎利婦聞彌勒如來出現世間成等正覺，數千萬眾往至佛所，頭面禮足，在一面坐，各各生心求作沙門，出家學道，或有越次取證、或有不取證者。",
        "translation": "\"When the Śāriputra women heard that the Tathāgata Maitreya had appeared in the world and become perfectly enlightened, tens of millions of them went to the Buddha, bowed their heads at his feet, sat down at one side, and each had the intention to become a monk, leave home, and train on the path, with some going beyond the next step to attain realization and some not attaining it.",
        "source": "T14n0453_001:0422b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，阿難！",
        "translation": "\"At that point, Ānanda!",
        "source": "T14n0453_001:0422b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其不越次取證者盡是奉法之人，患厭一切世間，修不可樂想。",
        "translation": "Those who don't transcend their level of attainment are all people who follow the teaching, become disillusioned with all the world, and cultivate unpleasant perceptions.",
        "source": "T14n0453_001:0422b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒當說三乘之教，如我今日。",
        "translation": "\"At that point, Maitreya will teach the teachings of the three vehicles, just as I do today.",
        "source": "T14n0453_001:0422b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子之中大迦葉者行十二頭陀、過去諸佛所善修梵行，此人當佐彌勒勸化人民。」",
        "translation": "Among his disciples, that man Mahākāśyapa practiced the religious practices of the 12 buddhas and well-cultivated past buddhas, and he will assist Maitreya in encouraging and teaching the people.\"",
        "source": "T14n0453_001:0422b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，迦葉去如來不遠結加趺坐，正身正意繫念在前。",
        "translation": "At the time, Kāśyapa was sitting cross-legged not far from the Tathāgata, correctly positioned and mindful in front of him.",
        "source": "T14n0453_001:0422b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告迦葉曰：「吾今年已衰耗向八十餘。",
        "translation": "The Bhagavān then addressed Kāśyapa, \"I've been wasting away for more than 80 years.",
        "source": "T14n0453_001:0422b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然今如來有四大聲聞堪任遊化，智慧無盡，眾德具足。",
        "translation": "Still, the Tathāgata has four śrāvakas who are capable of traveling and teaching, whose wisdom is inexhaustible and whose virtues are complete.",
        "source": "T14n0453_001:0422b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T14n0453_001:0422b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂大迦葉比丘、屠鉢歎比丘、賓頭盧比丘、羅云比丘。",
        "translation": "There's the monk Mahākāśyapa, the monk Tuṣita, the monk Piṇḍola, and the monk Lāwun.",
        "source": "T14n0453_001:0422b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等四大聲聞要不般涅槃，須吾法沒盡，然後乃當般涅槃。",
        "translation": "If you four śrāvakas want to avoid parinirvāṇa, you must let our teachings die out before you'll attain parinirvāṇa.",
        "source": "T14n0453_001:0422b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大迦葉亦不應般涅槃，要須彌勒出現世間。",
        "translation": "Mahākāśyapa also wouldn't [enter] parinirvāṇa if Maitreya were to appear in the world.",
        "source": "T14n0453_001:0422b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，彌勒所化弟子盡是釋迦文弟子，由我遺化得盡有漏。",
        "translation": "That's why Maitreya's disciples are all disciples of Śākyamuni, and they've been converted by me to end the contaminants.",
        "source": "T14n0453_001:0422b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「摩竭國界毘提村中，大迦葉於彼山中住。",
        "translation": "\"In the village of Videha at the border of Magadha, Mahākāśyapa was staying there on that mountain.",
        "source": "T14n0453_001:0422b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彌勒如來將無數千人眾，前後圍遶往至此山中，遂蒙佛恩，諸鬼神當與開門，使得見迦葉禪窟。",
        "translation": "The Tathāgata Maitreya sent a multitude of thousands of people around him, front and back, to this mountain, and then he received a favor from the Buddha, so the demons opened the gate and allowed him to see Kāśyapa's meditation cave.",
        "source": "T14n0453_001:0422b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彌勒申右手指示迦葉，告諸人民：『過去久遠釋迦文佛弟子名曰迦葉，今日現在，頭陀苦行最為第一。』",
        "translation": "Maitreya then showed Kāśyapa with his right hand and told the people, 'Long ago, the disciple of Śākyamuni Buddha was named Kāśyapa, and now, today, the ascetic practice of the ascetic is the greatest.'",
        "source": "T14n0453_001:0422b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，諸人見是事已歎未曾有，無數百千眾生諸塵垢盡，得法眼淨。",
        "translation": "Seeing this, the people praised him like never before, as hundreds of thousands of sentient beings ended the defilement and attained purification of the Dharma eye.",
        "source": "T14n0453_001:0422b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復有眾生見迦葉身已——此名為最初之會——九十六億人皆得阿羅漢，斯等之人皆是我弟子。",
        "translation": "Perhaps there are sentient beings who see Kāśyapa's body - this is called the first assembly - and 9.6 billion of them attain arhatship, and these people are my disciples.",
        "source": "T14n0453_001:0422b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T14n0453_001:0422c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悉由受我訓之所致也，亦由四事因緣：惠施、仁愛、利人、等利。",
        "translation": "It's all the result of receiving my instructions, and it's also the result of four causes and conditions: generosity, kindness, the improvement of others, and equal improvement.",
        "source": "T14n0453_001:0422c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，阿難！",
        "translation": "\"At that point, Ānanda!",
        "source": "T14n0453_001:0422c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒如來當取迦葉僧伽梨著之。",
        "translation": "The Tathāgata Maitreya then took Kāśyapa's monk's patchwork and put it on him.",
        "source": "T14n0453_001:0422c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，迦葉身體奄然星散。",
        "translation": "At the time, Kāśyapa's body was scattered like stars.",
        "source": "T14n0453_001:0422c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彌勒復取種種華香供養迦葉。",
        "translation": "Maitreya then also took various kinds of flowery incense and offered it to Kāśyapa.",
        "source": "T14n0453_001:0422c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T14n0453_001:0422c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊有敬心於正法故。",
        "translation": "\"It's because the world-honored buddhas have reverence for the right teaching.",
        "source": "T14n0453_001:0422c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒亦由我所受正法化，得成無上正真之道。",
        "translation": "Maitreya was also transformed by the right teaching that I received, and he attained the unsurpassed true path.",
        "source": "T14n0453_001:0422c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿難當知，彌勒佛第二會時，有九十四億人，皆是阿羅漢，亦復是我遺教弟子，行四事供養之所致也。",
        "translation": "\"Ānanda, you should know that at the second meeting of Maitreya Buddha, 9.4 billion people were arhats, and they were also the result of my legacy disciples who performed four acts of worship.",
        "source": "T14n0453_001:0422c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彌勒第三之會，九十二億人皆是阿羅漢，亦復是我遺教弟子。",
        "translation": "\"At the third assembly of Maitreya, 9.2 billion people were arhats, and they were also my legacy disciples.",
        "source": "T14n0453_001:0422c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，比丘姓號皆名慈氏弟子，如我今日諸聲聞皆稱釋迦弟子。",
        "translation": "\"At the time, the monks' names were all called the disciples of Maitreya, just as the śrāvakas today call themselves the disciples of Śākyamuni.",
        "source": "T14n0453_001:0422c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒與諸弟子說法：『汝等比丘！",
        "translation": "\"It was then that Maitreya told his disciples, 'You monks!",
        "source": "T14n0453_001:0422c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當思惟無常之想、樂有苦想、計我無我想、實有空想、色變之想、青瘀之想、膖脹之想、食不消想、膿血想、一切世間不可樂想。",
        "translation": "They should contemplate the perception of impermanence, the perception of pleasure as painful, the perception of imputed selflessness, the perception of true emptiness, the perception of color change, the perception of bruises, the perception of bloating, the perception of unappetizing food, the perception of pus and blood, and the perception of the unpleasantness of the whole world.",
        "source": "T14n0453_001:0422c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T14n0453_001:0422c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當知，此十想者皆是過去釋迦文佛與汝等說，令得盡有漏、心得解脫。",
        "translation": "Monks, you should know that these ten concepts were all explained to you by Śākyamuni Buddha in the past, so that you could end the contaminants and attain liberation.",
        "source": "T14n0453_001:0422c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若此眾中釋迦文佛弟子，過去時修於梵行，來至我所；或復於釋迦文佛所供養三寶，來至我所；或於釋迦文佛所彈指之頃修於善本，來至此間；或於釋迦文佛所行四等心，來至此者；或於釋迦文佛所受持五戒、三自歸法，來至我所；或於釋迦文佛所起神寺廟，來至我所；或於釋迦文佛所補治故寺，來至我所；或於釋迦文佛所受八關齋法，來至我所；或於釋迦文佛所香華供養，來至此者；或復於彼聞法悲泣墮淚，來至我所；或復於釋迦文佛所專意聽受法，來至我所；或復盡形壽善修梵行，來至我所；或復有書寫讀誦，來至我所；或復承事供養，來至我所者。』",
        "translation": "若此眾中釋迦文佛弟子，過去時修於梵行，來至我所；或復於釋迦文佛所供養三寶，來至我所；或於釋迦文佛所彈指之頃修於善本，來至此間；或於釋迦文佛所行四等心，來至此者；或於釋迦文佛所受持五戒、三自歸法，來至我所；或於釋迦文佛所起神寺廟，來至我所；或於釋迦文佛所補治故寺，來至我所；或於釋迦文佛所受八關齋法，來至我所；或於釋迦文佛所香華供養，來至此者；或復於彼聞法悲泣墮淚，來至我所；或復於釋迦文佛所專意聽受法，來至我所；或復盡形壽善修梵行，來至我所；或復有書寫讀誦，來至我所；或復承事供養，來至我所者。』",
        "source": "T14n0453_001:0422c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時，彌勒便說此偈：「『增益戒聞德，　　禪及思惟業，　　善修於梵行，　　而來至我所。",
        "translation": "\"Maitreya then spoke this verse, \"Accumulating the virtues of discipline and learning, meditation and contemplation, they well cultivate the religious practice and come to me.",
        "source": "T14n0453_001:0423a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　勸施發歡心，　　修行心原本，　　意無若干想，　　皆來至我所。",
        "translation": "They encourage generosity, arouse joyful thoughts, cultivate original intentions, and have no numerous conceptions, and they all come to me.",
        "source": "T14n0453_001:0423a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　或發平等心，　　承事於諸佛，　　飯飴於聖眾，　　皆來至我所。",
        "translation": "Perhaps they arouse the mind of equality, acknowledge the service of the buddhas, and offer food and drink to the noble people, and they all come to me.",
        "source": "T14n0453_001:0423a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　或誦戒契經，　　善習與人說，　　熾然於法本，　　今來至我所。",
        "translation": "They may recite the sutras on morality, train them well, teach them to others, and blaze the Dharma root, and now they've come to me.",
        "source": "T14n0453_001:0423a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　釋種善能化，　　供養諸舍利，　　承事法供養，　　今來至我所。",
        "translation": "The Śākyas are well-versed in teaching, making offerings to relics, and accepting offerings of the Dharma, and they've come to me.",
        "source": "T14n0453_001:0423a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有書寫經，　　班宣於素上，　　其有供養經，　　皆來至我所。",
        "translation": "If there are sūtras written and presented on a plain, and if there are sūtras to which they make offerings, they all come to me.",
        "source": "T14n0453_001:0423a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　繒綵及諸物，　　供養於神寺，　　自稱南無佛，　　皆來至我所。",
        "translation": "They make offerings of silken fabric and other things to sacred temples, and they call themselves the Namo Buddha, and they all come to me.",
        "source": "T14n0453_001:0423a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　供養於現在、　　諸佛過去者，　　禪定正平等，　　亦無有增減。",
        "translation": "Those who make offerings to the present and to the buddhas of the past are correctly equal in their meditation, and there's no increase or decrease.",
        "source": "T14n0453_001:0423a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是故於佛法，　　承事於聖眾，　　專心事三寶，　　必至無為處。』",
        "translation": "Therefore, when the Buddha's teaching is presented, he serves the noble people and focuses his mind on the Three Treasures, which will surely lead him to the point of no-contrivance.'",
        "source": "T14n0453_001:0423a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿難當知，彌勒如來在彼眾中當說此偈。",
        "translation": "\"Ānanda, you should know that the Tathāgata Maitreya will say this verse while he's among those people.",
        "source": "T14n0453_001:0423a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼眾中諸天人民思惟此十想，十一姟人諸塵垢盡，得法眼淨。",
        "translation": "At the time, the gods and people in that congregation considered these ten contemplations, and the 11 VIPs' defilements were ended, and they attained purification of the Dharma eye.",
        "source": "T14n0453_001:0423a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒如來千歲之中，眾僧無有瑕穢。",
        "translation": "During the thousand years of the Tathāgata Maitreya's life, the saṃgha had no blemishes.",
        "source": "T14n0453_001:0423a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，恒以一偈以為禁戒：「『口、意不行惡，　　身亦無所犯，　　當除此三行，　　速脫生死關。』",
        "translation": "At the time, he always used a verse to set forth the precepts, \"'Don't do evil with your mouth or mind; don't do anything wrong with your body; remove these three practices, and you'll quickly escape the barrier of birth-and-death.'",
        "source": "T14n0453_001:0423a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「過千歲後，當有犯戒之人，遂復立戒。",
        "translation": "\"After a thousand years, there will be someone who violates the precepts, and then the precepts will be established again.",
        "source": "T14n0453_001:0423b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彌勒如來當壽八萬四千歲。",
        "translation": "\"The Tathāgata Maitreya will live 84,000 years.",
        "source": "T14n0453_001:0423b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後，遺法當在八萬四千歲。",
        "translation": "After parinirvāṇa, his legacy will be 84,000 years old.",
        "source": "T14n0453_001:0423b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，爾時眾生皆是利根。",
        "translation": "That's because at the time sentient beings were all of sharp faculties.",
        "source": "T14n0453_001:0423b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其有善男子、善女人欲得見彌勒佛及三會聲聞眾及翅頭城及見蠰佉王并四大藏珍寶者、欲食自然粳米者、并著自然衣裳、身壞命終生天上者，彼善男子、善女人當勤加精進，無生懈怠；亦當供養承事諸法師，名花[打-丁+鳥]香種種供養，無令有失。",
        "translation": "\"If there are good men and good women who want to see Maitreya Buddha, the three assemblies of śrāvakas, the city of Wisdom, King Cerebro, the four great treasures, who want to eat natural millet, who want to wear natural clothing, and who want to be born in the heavens when their bodies break up and their lives end, those good men and good women will diligently apply themselves without laziness, and they will make offerings to and serve the teachers of the Dharma and make various offerings of flowers, names, [ding-ding, and bird] scents, so that nothing is lost.",
        "source": "T14n0453_001:0423b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，阿難！",
        "translation": "Thus, Ānanda!",
        "source": "T14n0453_001:0423b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T14n0453_001:0423b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿難及諸大會，聞佛所說，歡喜奉行。",
        "translation": "It was then that Ānanda and the assembly heard what the Buddha taught, rejoiced, and approved.",
        "source": "T14n0453_001:0423b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說彌勒下生經",
        "translation": "The Buddha taught the Sutra on the Descent of Maitreya",
        "source": "T14n0453_001:0423b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "按《開元錄》有譯無本中有法護譯《彌勒成佛經》，一名「彌勒當來下生經」者。",
        "translation": "According to the Kaiyuan lu (Kaiyuan lu), there is a translation of the Sutra of Maitreya's Becoming of the Buddha by Hōgō, which is called the \"Sutra of Maitreya's Future Descent.",
        "source": "T14n0453_001:0423b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乍觀此經即彼失本而還得之，其實非也。",
        "translation": "At first glance, this sūtra might seem to be a return of a lost copy, but it's actually not.",
        "source": "T14n0453_001:0423b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何則？",
        "translation": "Why is that?",
        "source": "T14n0453_001:0423b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅什譯《彌勒成佛經》目下注云：「與《下生經》異本，與法護譯《彌勒成佛經》同本。」",
        "translation": "The Rāsh translation of the Maitreya-chengfo jing has a note under its title that reads, \"It's a different edition from the Haśōshō jing and the same edition as the Fahuo translation of the Maitreya-chengfo jing.\"",
        "source": "T14n0453_001:0423b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩譯一闕，則彼失本經，非此《下生經》六譯三失之一者明矣。",
        "translation": "If one of the two translations is missing, then it is clear that the other has lost the original sūtra and is not one of the six translations or three losses of the Xiasheng jing.",
        "source": "T14n0453_001:0423b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又按孤山智圓重校金剛般若後序云：「古德分經皆用紙數者，一紙有二十五行，一行十七字。",
        "translation": "Also, according to the preface after Gushan Zhiyuan's reconsideration of the Diamond Prajñāpāramitā, \"An ancient virtuous man used a number of pages to divide a sūtra, and a page had twenty-five lines and seventeen words in a line.",
        "source": "T14n0453_001:0423b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今撿失本彌勒經目下注云：『一十七紙』，則計有七千二百二十二字，此經只有三千一百七十六字，則尚未其半，豈是彼經歟？」",
        "translation": "Now, the commentary under the heading of the lost version of the Maitreya Sutra says, 'One hundred and seventeen lines of paper,' which means there are 7,222 words in it.",
        "source": "T14n0453_001:0423b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則丹藏無此經為得。",
        "translation": "Then the Danzang can be considered a scripture without this text.",
        "source": "T14n0453_001:0423b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此經文頗似漢晉經注，又有漢云之言，還恐此是三失本中第一本。",
        "translation": "However, the text of this sūtra is quite similar to the commentaries on the Han and Jin scriptures, and there are also the words of Han Yun, so I'm afraid that this is the first of the three lost texts.",
        "source": "T14n0453_001:0423b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "錄云今附西晉者耳，宋藏還得而編入之為得之矣。",
        "translation": "It was recorded as a scripture that was now attached to the Western Jin Dynasty, and it was obtained by incorporating it into the Song Canon.",
        "source": "T14n0453_001:0423b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而二錄並無《下生經》是法護譯者，今云法護譯者何耶？",
        "translation": "However, the two records don't say that the Xiasheng jing was a translation by Hōgō, so why is it now called a translation by Hōgō?",
        "source": "T14n0453_001:0423b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伏俟賢哲。",
        "translation": "Fuyi Xianzhe.",
        "source": "T14n0453_001:0423c01_11",
        "is_bad_quality": false
    }
]