[
    {
        "source_sentence": "佛說稱揚諸佛功德經卷上",
        "translation": "Foshuo xiangyang zhubo gongde jing shoushang",
        "source": "T14n0434_001:0087a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏天竺三藏吉迦夜譯",
        "translation": "Yuan Wei Tianzhu Tripiṭaka Jikāyānīya Translation",
        "source": "T14n0434_001:0087a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在羅閱祇靈鷲山中，與大比丘眾千二百五十人俱。",
        "translation": "Thus I heard: One time, the Buddha was present on Mount Rājagṛha with a large assembly of twelve hundred and fifty monks.",
        "source": "T14n0434_001:0087a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時耆年舍利弗便從座起，偏袒右肩，更整法服，在佛右面，右膝著地，長跪叉手，前白佛言：「唯，天中天！",
        "translation": "Śāriputra, a very aged man, then rose from his seat, bared his right shoulder, adjusted his robes, knelt on his right side, knelt on his right knee, saluted with his palms together, and said to the Buddha, \"Yes, god of gods!",
        "source": "T14n0434_001:0087a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日現在諸佛、世尊進止康常，今說法者，其數幾何？」",
        "translation": "Today, how many buddhas and world-honored ones are active, calm, and constant, and how many of them are teaching the Dharma today?\"",
        "source": "T14n0434_001:0087a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗發是問已，爾時世尊告舍利弗：「所問甚快！",
        "translation": "After Śāriputra asked this question, the Bhagavān addressed Śāriputra, \"That was a very quick question!",
        "source": "T14n0434_001:0087a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多所饒益普利一切。",
        "translation": "\"They are of great benefit to all.",
        "source": "T14n0434_001:0087a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen closely, listen closely!",
        "source": "T14n0434_001:0087a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善著心中！",
        "translation": "Well-attaching mind!",
        "source": "T14n0434_001:0087a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝具分別說。」",
        "translation": "I will explain it fully for you.\"",
        "source": "T14n0434_001:0087a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是舍利弗聞佛許可，歡喜踊躍，叉手白言：「諾！",
        "translation": "Hearing that the Buddha had given his approval, Śāriputra rejoiced and leaped for joy, saluted with his palms together, and said, \"Yes!",
        "source": "T14n0434_001:0087a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善聽，願樂欲聞！」",
        "translation": "Listen well, and may you wish to hear!\"",
        "source": "T14n0434_001:0087a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗：「東方去此千萬億諸佛剎土，有世界名曰天神，其國有佛，名曰寶海如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "The Buddha told Śāriputra, \"In the east, there's a world called Tianshin that's a thousand trillion buddha-lands away from here, and in that world there's a Buddha named Baosai Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shishijian Jie, an unsurpassed person, a trainer of the way, and a teacher of gods and humans, who's called Zhongyou and has saved measureless people.",
        "source": "T14n0434_001:0087a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子、族姓女其有得聞寶海如來名號者，執持諷誦，歡喜信樂，其人當得七覺意寶，皆當得立不退轉地，疾成無上正真之道，却六十劫生死之罪。",
        "translation": "If any clansman or clanswoman hears the name of the Jewel Sea Tathāgata, retains it, recites it, rejoices in it, and believes in it, that person will attain seven awakened mental treasures that will establish them in the stage of nonretrogression, quickly achieve the unsurpassed true path, and undo the sins of 60 eons of birth-and-death.",
        "source": "T14n0434_001:0087a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0087b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方有世界名曰寶集，其國有佛，號曰寶英如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "\"In the east, there's a world called Jewel Gathering, and in that country there's a Buddha named Jewel Ying Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shishijian, unsurpassed person, Daofayu, and teacher of gods and humans, and he's called the Blessed One, who has saved measureless people.",
        "source": "T14n0434_001:0087b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞寶英如來名號者，執持諷誦，歡喜信樂，五體投地而為作禮，若使三千大千佛剎滿中七寶，持用布施滿百歲中，所得功德寧多不乎？」",
        "translation": "If someone who hears the name of the Jeweled Tathāgata adheres to it, recites it, rejoices and believes in it, throws their five bodies to the ground, and pays homage to it, wouldn't it be a lot of merit if they were to cause a thousand great thousand buddha bases to be filled with seven treasures and maintain them for a hundred years as alms?\"",
        "source": "T14n0434_001:0087b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「甚多，甚多，天中天！」",
        "translation": "Śāriputra said, \"Very much, very much, a god of gods!\"",
        "source": "T14n0434_001:0087b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如有人得聞寶英如來名號，持諷誦者作禮之德，十萬億倍過出布施功德者上。",
        "translation": "The Buddha said, \"How about someone who hears the name of the Jeweled Tathāgata and recites it, and pays homage to that person, which is ten thousand million times greater than the merit of making a gift?",
        "source": "T14n0434_001:0087b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0087b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此寶集世界，度八百佛剎，有世界名曰寶最，其國有佛，號曰寶成如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, going to this jeweled collection of worlds and passing through 800 buddha bases, there's a world named Jewel Supreme, and in that country there are buddhas named Jewel Tathāgata, Supreme Truth, Perfectly Awakened One, Mingxing Cheng, Shangah, Worldly Understanding, Unsurpassed One, Wayfarer, and Teacher of Gods and People, and they're called Blessed Ones, which save measureless people.",
        "source": "T14n0434_001:0087b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞寶成如來名號者，執持諷誦，以清淨心歡喜信樂，却五百劫生死之罪。",
        "translation": "Those of you who hear the name of the Ratnaketu Tathāgata, hold it, recite it, and rejoice and believe in it with a pure heart, will be saved from the sins of birth-and-death for 500 eons.",
        "source": "T14n0434_001:0087b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0087b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此寶最世界，度千佛剎，有世界名曰光明，其國有佛，號寶光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world named Bright that goes beyond this most precious world to a thousand buddha bases, and there's a Buddha there named Jewel Light Tathāgata, Supreme Truth, Perfectly Awakened One, Mingxing Cheng, Well Gone, Worldly Understanding, Unsurpassed One, Wayfarer, Teacher of Gods and People, and he's called a multitude of blessings that save measureless people.",
        "source": "T14n0434_001:0087b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞寶光明如來名號，執持諷誦，歡喜信樂，於三塗中悉得解脫。",
        "translation": "Those who hear the name of the Tathāgata of Jewel Light, hold it, recite it, rejoice, and believe in it will be liberated from the three destinies.",
        "source": "T14n0434_001:0087b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0087b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此光明世界，度千五百佛剎，有世界名曰幢幡，其國有佛，號曰寶幢幡如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of light that goes beyond this one thousand five hundred buddha bases, and there's a world named Banner Banner Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shishijian, unsurpassed person, Wayfarer, and teacher of gods and humans, and it's called All Blessed Ones, which has helped measureless people.",
        "source": "T14n0434_001:0087b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞寶幢幡如來名號者，持諷誦念，歡喜信樂，其人則為成法珍寶。",
        "translation": "If someone hears the name of the Tathāgata with the banners and banners, recites it, rejoices and believes in it, they will become a treasured possession of the Dharma.",
        "source": "T14n0434_001:0087b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0087b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此幢幡世界，度二千佛剎，有世界名曰一切眾德光明，其國有佛，號寶光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "To the east, there's a world 2,000 buddha bases away from this one, and there's a world named All Souls' Virtues Bright, and in that country there's a Buddha named Jewel Light Tathāgata, Supreme Truth, Completely Awakened One, Mingxing Cheng, Shangahang, Worldly Understanding, Unsurpassed One, Wayfarer, and Teacher of Gods and People, who's called All Blessed One and has saved measureless people.",
        "source": "T14n0434_001:0087b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞寶光明如來名者，持諷誦讀，歡喜信樂，五體投地而為作禮，却二十萬劫生死之罪。",
        "translation": "Those who hear the name of the Tathāgata of Jewel Light, recite it, rejoice and believe in it, throw themselves to the ground with five bodies, and pay homage to him, saving them from the sins of 200,000 eons of birth-and-death.",
        "source": "T14n0434_001:0087c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0087c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此眾德世界，度千佛剎，有世界名曰妙樂，其國有佛，號曰阿閦如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of many virtues that goes beyond a thousand buddha bases, and there's a world called Marvelous Bliss, and there's a Buddha there named Akṣobhya Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangao, Shishijian Jie, the unsurpassed man, the Way, the Dharma royalty, and the teacher of gods and humans, and he's called Zhongyou, who has saved measureless people.",
        "source": "T14n0434_001:0087c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞阿閦如來名號者，捉持諷誦，歎說其德，復勸他人令學諷誦。」",
        "translation": "Those who hear the name of Akṣobhya Tathāgata will recite it, praise its virtues, and encourage others to recite it.\"",
        "source": "T14n0434_001:0087c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波旬將四種兵來詣佛所，而作是語：「寧使捉持餘千佛名，亦勸他人令使學之，不使捉持阿閦佛名。",
        "translation": "It was then that Pāpīyān sent four kinds of soldiers to the Buddha and said, \"I'd rather grasp the names of a thousand other buddhas and encourage others to learn them than grasp the name of Akṣobhya.",
        "source": "T14n0434_001:0087c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有捉持阿閦如來名號者，我終不能毀壞其人無上道心，我亦當能毀壞斯等無上道心。」",
        "translation": "If someone were to grasp the name of Akṣobhya, I would never be able to destroy their unsurpassed mind of enlightenment, and I would be able to destroy their unsurpassed mind of enlightenment.\"",
        "source": "T14n0434_001:0087c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告魔言：「汝能毀壞誰之道心？」",
        "translation": "The Buddha told Māra, \"Whose mind of enlightenment can you destroy?\"",
        "source": "T14n0434_001:0087c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔言：「其求大乘、捉持阿閦如來名者，我心則生愁憂、熱惱。",
        "translation": "Māra said, \"When someone seeks the great vehicle and grasps the name of Akṣobhya Tathāgata, my mind becomes sad and distressed.",
        "source": "T14n0434_001:0087c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今日復得熱惱，用聞阿閦如來名故！」",
        "translation": "Today, I'm again distressed because I heard the name Akṣobhya Tathāgata!\"",
        "source": "T14n0434_001:0087c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔言：「亦復有眾生，其數甚多，捉持餘佛名號者，我或當能毀壞其人正覺道心。」",
        "translation": "The Māra said, \"There are also many sentient beings who hold onto the names of other buddhas, and I might be able to destroy their minds of the path of right awakening.\"",
        "source": "T14n0434_001:0087c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告魔言：「汝莫愁憂、懷於惱結，汝終不能毀壞此等無上道心！」",
        "translation": "The Buddha told Māra, \"Don't be sad and harbor the bond of affliction; you will never be able to destroy these unsurpassed minds of enlightenment!\"",
        "source": "T14n0434_001:0087c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔波旬言：「有何因緣？」",
        "translation": "Māra Pāpīyān said, \"What are the causes and conditions?\"",
        "source": "T14n0434_001:0087c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告魔言：「汝為隱蔽歸命諸佛功德之行。",
        "translation": "The Buddha told Māra, \"You've hidden your life from the meritorious actions of the Buddhas.",
        "source": "T14n0434_001:0087c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0434_001:0087c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿閦如來自當觀視擁護其人。」",
        "translation": "Akṣobhya Tathāgata will certainly observe and support that person.\"",
        "source": "T14n0434_001:0087c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗即白佛言：「波旬今日於如來前，云何欲作師子之吼，欲破眾生正覺道心？",
        "translation": "Śāriputra then said to the Buddha, \"Why did Pāpīyān want to make a lion's roar today in front of the Tathāgata in order to disrupt the minds of sentient beings who are correctly awakened to the path?",
        "source": "T14n0434_001:0087c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有眾生捉持阿閦如來名者，及餘一切諸佛名號，魔審當能毀壞其人正覺心乎！」",
        "translation": "If there are sentient beings who grasp the name Akṣobhya Tathāgata and all the other names of the buddhas, Māra will be able to destroy their minds of right awakening!\"",
        "source": "T14n0434_001:0087c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗：「我今觀覩諸眾生，其有捉持諸佛名者，若有呵罵誹謗之者，斯人則為造大惡行，致無量罪，入阿鼻獄具受眾苦。」",
        "translation": "The Buddha told Śāriputra, \"Now, I've observed sentient beings who grasp the names of the buddhas, and if they ridicule and denigrate them, that person will commit a great misdeed, incur measureless crimes, and be sent to Abhidharma with all its sufferings.\"",
        "source": "T14n0434_001:0087c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「有誹謗經者，其數幾許？」",
        "translation": "Śāriputra said, \"How many people do you have who denigrate the sūtras?\"",
        "source": "T14n0434_001:0088a03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「十方諸佛為諸眾生廣說法時，皆先讚歎阿閦如來名號功德，眾生聽聞其功德者，終無厭足。",
        "translation": "The Buddha said, \"When the buddhas of the ten directions explain the teaching in detail for sentient beings, they always begin by praising the merits of Akṣobhya's name, and sentient beings who hear about his merits will never tire of hearing about them.",
        "source": "T14n0434_001:0088a03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生得見如來，聞其功德，未曾有能謗此經者，諸佛、如來不於五濁弊惡之時興出於世，如我今者於此忍界下劣叢殘諸眾生中而作佛也。",
        "translation": "If sentient beings were to see the Tathāgata and hear about his merits, and there were never anyone who could denigrate this sūtra, the buddhas and tathāgatas wouldn't arise in the world at a time when the five corruptions are so bad that, like me, I would become a buddha among the poor and barren sentient beings of the forbearance realm.",
        "source": "T14n0434_001:0088a06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿閦佛國嚴淨最好，終不爾也！",
        "translation": "Akṣobhya's kingdom is the most glorious and pure, but it's never like that!",
        "source": "T14n0434_001:0088a09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，舍利弗！",
        "translation": "You should know, Śāriputra!",
        "source": "T14n0434_001:0088a10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯尊法輪隨次分布丘聚國邑，若族姓子、若族姓女一心信行，當廣宣傳此諸經法。",
        "translation": "\"Suppose this honored Dharma wheel is distributed in turn to a village of mahouts, and suppose clansmen and clanswomen were to wholeheartedly believe and practice it, they would widely disseminate the teachings of these sūtras.",
        "source": "T14n0434_001:0088a10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，舍利弗！",
        "translation": "You should know, Śāriputra!",
        "source": "T14n0434_001:0088a12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞此經者，誹謗輕毀所受之報，汝今諦聽！」",
        "translation": "Hear this sūtra and listen closely to the consequences of slander and disparagement!\"",
        "source": "T14n0434_001:0088a12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「諾！",
        "translation": "Śāriputra said, \"No!",
        "source": "T14n0434_001:0088a13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善聽。」",
        "translation": "You must listen well.\"",
        "source": "T14n0434_001:0088a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「犍陀梨國謗此經者滿百千人，造斯惡行，當墮阿鼻大泥犁中；次復北方國名罽賓，其國經法興盛久住，而此國中五百千人謗此經法，此眾生輩死墮阿鼻大泥犁中。",
        "translation": "The Buddha said, \"A hundred thousand people in Gandhārī who denigrate this sūtra will commit such bad acts that they'll fall into the great mire of Abhijit; and then there's the northern country called Kāśmīra, where the sūtra teaching has flourished and long-lived, but five hundred thousand people in that country denigrate the teaching of this sūtra, and this group of sentient beings will die and fall into the great mire of Abhijit.",
        "source": "T14n0434_001:0088a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T14n0434_001:0088a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於眾聚中當有共謗此經者，有八萬人墮阿鼻大泥犁中。",
        "translation": "Among the various congregations, there will be those who jointly denigrate this sūtra, and 80,000 people will fall into the great mire of abhidharma.",
        "source": "T14n0434_001:0088a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方少有信斯經者，多造阿鼻泥犁行，有百千人死入阿鼻大泥犁中；南方二百千人當謗此經，死入阿鼻大泥犁中；西方有百萬人當謗斯經，死墮阿鼻大泥犁中。",
        "translation": "In the east, there are a few believers in this sūtra who often engage in abhidharma practices, and a hundred thousand people will die and enter the abhidharma great mire; in the south, two hundred thousand people will denigrate this sūtra and die and enter the abhidharma great mire; and in the west, a million people will denigrate this sūtra and die and fall into the abhidharma great mire.",
        "source": "T14n0434_001:0088a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，舍利弗！",
        "translation": "You should know, Śāriputra!",
        "source": "T14n0434_001:0088a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣覺智慧不能度量如來之智，況諸聲聞及諸眾生未成道果、為生死水所漂流者，欲度如來智慧功德，未之有也！",
        "translation": "The wisdom of the pratyekabuddhas cannot measure the Tathāgata's wisdom, so it's unlikely that śrāvakas and other sentient beings who have yet to attain the fruit of the path and who are adrift in the waters of birth-and-death would ever want to measure the merits of the Tathāgata's wisdom!",
        "source": "T14n0434_001:0088a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫黠慧者當自思惟：『諸佛功德不可限量，諸佛智慧不可思議，諸佛已成一切種智三達無閡，而我癡冥無有是智，諸佛已成一切智者，自當知之我所不了。",
        "translation": "A wise person should think to himself, 'The merits of the buddhas are unlimited, their wisdom is unfathomable, and they have attained all kinds of cognition and have no barrier, but I'm deluded and have no such cognition; someone who has attained all cognition of the buddhas should know for themselves that I don't know them.",
        "source": "T14n0434_001:0088a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我不了，不當謗毀四句一偈，何況謗毀斯大尊經，造斯大罪，眾惡行聚無央數劫，當在阿鼻大泥犁中於彼止宿。』",
        "translation": "If I didn't know that, I wouldn't have denigrated the four phrases and one verse, let alone denigrating this great sūtra and committing this great sin, which would result in a multitude of bad actions over an incalculably long period of time and would land me in the great niraya of Abhijit where I'd stay.'",
        "source": "T14n0434_001:0088a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T14n0434_001:0088b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子、族姓女當作是意：『我今乃聞此大尊經而不誹謗，乃却阿鼻一劫之罪，我等今當自慶歡喜，興大踊躍。』",
        "translation": "If clansmen and clanswomen were to think, 'Now that I've heard this great pre-eminent sūtra and haven't denigrated it, I've been spared an eon's worth of sins by Abhijit, and now we'll rejoice and rise up in great joy.'",
        "source": "T14n0434_001:0088b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣此之故，無央數劫常當與此大法共俱。",
        "translation": "For this reason, we'll always be with this great teaching for incalculably long eons.",
        "source": "T14n0434_001:0088b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0088b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此妙樂世界，度萬佛剎，有世界名曰無量，其國有佛，號大光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of wondrous bliss that's 10,000 buddha bases away, and there's a world called immeasurable, and there's a Buddha there who's called the Tathāgata of Great Light, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed Ones, who has saved measureless people.",
        "source": "T14n0434_001:0088b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞大光明如來名者，執持諷誦，歡喜信樂，其人所生未曾不值諸佛、世尊，住不退轉，必得成就最上正覺。",
        "translation": "If someone hears the name of the Tathāgata of Great Light, retains it, recites it, rejoices and believes in it, they've never been born without meeting other buddhas or world-honored ones, have never turned back, and will surely achieve supreme perfect enlightenment.",
        "source": "T14n0434_001:0088b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0088b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此無量世界，度六萬佛剎，有世界名曰眾華，其國有佛，號無量音如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world without measure that passes through 60,000 buddha bases, and there's a world named Crowd of Flowers, and in that country there's a Buddha named Tathāgata of Immeasurable Sound, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shishijian Jie, the unsurpassed man, the Way, the Dharma Ruler, and the Teacher of Gods and People, and he's called Crowd of Blessings, which has helped measureless people.",
        "source": "T14n0434_001:0088b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞無量音如來名者，淨心信樂，三反稱言：『我今一心禮無量音如來！』",
        "translation": "Those who hear the name of the Tathāgata of Immeasurable Sound are pure in heart and joy, and they say three times in return, 'Now I wholeheartedly worship the Tathāgata of Immeasurable Sound!'",
        "source": "T14n0434_001:0088b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人當得無量音聲，及得如來淨光之音。",
        "translation": "That person will attain measureless sounds and the sound of the Tathāgata's pure radiance.",
        "source": "T14n0434_001:0088b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0088b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此眾華世界，度萬四千佛剎，有世界名無塵垢，其國有佛，號無量音如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world named Immeasurable Sound Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shishijian, Wushangshi, Daofayu, and Tianren zhushi, which is called Zhongyou and has helped measureless people.",
        "source": "T14n0434_001:0088b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞無量音如來名者，歡喜信樂，持諷誦念，却十二劫生死之罪。",
        "translation": "Those who hear the name of the Tathāgata of Immeasurable Sound and rejoice, believe in it joyfully, recite it with recitation, and are saved from the sins of twelve eons of birth-and-death.",
        "source": "T14n0434_001:0088b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0088b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此無塵垢世界，度二萬佛剎，有世界名莫能勝，其國有佛，號大名稱如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world without defilement that's 20,000 buddha bases away, and there's a world whose name is unsurpassed, and there's a Buddha in that country who's called the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed One, who has saved measureless people.",
        "source": "T14n0434_001:0088b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞大名稱如來名者，淨心信樂，諷誦不忘，長跪叉手而作是言：『我今禮大名稱如來！』",
        "translation": "Those who hear the name of the Tathāgata known as the Great Name are pure in heart and faith, recite it without forgetting it, kneel down long with their palms together, and say, 'Now I worship the Tathāgata known as the Great Name!'",
        "source": "T14n0434_001:0088c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作七寶阜如須彌山，持用布施滿百歲中，所得功德寧為多不？」",
        "translation": "Wouldn't it be more meritorious to create a mound of seven treasures like Mount Sumeru and to preserve and use it for a hundred years as an offering?\"",
        "source": "T14n0434_001:0088c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「甚多，甚多，天中天！」",
        "translation": "Śāriputra said, \"Very much, very much, a god of gods!\"",
        "source": "T14n0434_001:0088c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如有人持大名稱如來名號作禮之者，得其功德巨億萬倍，過出布施功德者上，不得為比！",
        "translation": "The Buddha said, \"How about someone who venerates the Tathāgata by reciting his name in the great name? That person's merit is a hundred million times greater than that of someone who gives alms, and it cannot be compared to his merit!",
        "source": "T14n0434_001:0088c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0088c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此莫能勝世界，度三千佛剎，有世界名光明，其國有佛，號寶光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world unmatched by this one, and there are 3,000 buddha bases across it, and there's a world named Brightness, and there's a Buddha in that country who's called the Jewel Light Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed Ones and who has saved measureless people.",
        "source": "T14n0434_001:0088c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞寶光明如來名者，盡心信樂、持諷誦者，當却十劫生死之罪，住不退轉，必成無上正真之道。",
        "translation": "Those who hear the name of the Tathāgata of Jewel Light and wholeheartedly believe in it, recite it, and recite it will be saved from the sins of ten eons of birth and death, abide in nonretrogression, and surely achieve the unsurpassed true path.",
        "source": "T14n0434_001:0088c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有誹謗、其不信者，當在阿鼻大泥犁中壽命一劫。",
        "translation": "Anyone who denigrates it or doesn't believe it will spend an eon in the great nirvāṇa of Abhijit.",
        "source": "T14n0434_001:0088c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0088c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此光明世界，度萬五千佛剎，有世界名曰多光，其國有佛，號得大安隱如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of light that's 35,000 buddha bases away from here, and there's a world called Dōshō, and there's a Buddha there who's called the Tathāgata who has attained great peace, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed One, who has saved measureless people.",
        "source": "T14n0434_001:0088c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞大安隱如來名者，歡喜信樂，諷誦不忘，當作是念：『持此功德，普使一切無量眾生而得安隱。』",
        "translation": "Those who hear the name of the Tathāgata of Great Peace rejoice and believe in it joyfully, recite it without forgetting, and think, 'This merit will cause measureless sentient beings everywhere to attain peace.'",
        "source": "T14n0434_001:0088c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人則受無量功德，便能安隱一切眾生。",
        "translation": "That person then receives measureless merits that make it possible to stabilize all sentient beings.",
        "source": "T14n0434_001:0088c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0088c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此多光世界，度七千佛剎，有世界名摩尼光，其國有佛，號大光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of many lights that's 7,000 buddha-halts away from here, and there's a world named Manihāra where there's a Buddha named Tathāgata of Great Light, Supreme Truth, Completely Awakened One, Mingxing Cheng, Shanga, Worldly Understanding, Unsurpassed One, Wayfarer, and Teacher of Gods and People, who's called All Blessed One and has saved measureless people.",
        "source": "T14n0434_001:0088c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞大光明如來名號者，歡喜信樂，持諷誦讀，其人當得如來十力。",
        "translation": "If someone hears the name of the Tathāgata of Great Light and rejoices, recites it with joy and faith, and recites it, they will attain the Tathāgata's ten powers.",
        "source": "T14n0434_001:0088c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此珠光世界，度八千佛剎，有世界名曰正直，其國有佛，號正音聲如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world 8,000 buddha-temples away from this jeweled world, and there's a world called Zhengzheng Shengsheng Tathāgata, Zhizhen, Zhengjue, Mingxingcheng, Shanga, Shishijian, unsurpassed person, Daofayu, and teacher of gods and humans, which is called Zhongyou, and which has helped measureless people.",
        "source": "T14n0434_001:0089a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞正音聲如來名號者，淨心信樂，持諷誦讀，其人當得如來四諦平等之法。",
        "translation": "If someone hears the name of the Tathāgata in correct voice and sound, has a pure heart, is faithful, and recites it with recitation, they will attain the Tathāgata's teaching of the equality of the four truths.",
        "source": "T14n0434_001:0089a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此正直世界，度二萬佛剎，有世界名光明尊，其國有佛，號無限淨如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world that goes straight up here and crosses 20,000 buddha bases, and there's a world named Bright Honored One, and there's a Buddha in that country who's called the Infinite Pure Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed One, who has saved measureless people.",
        "source": "T14n0434_001:0089a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞無限淨如來名者，歡喜信樂、持諷誦者，大千世界滿中七寶持用布施，所得功德寧多不乎？」",
        "translation": "If someone hears the name of the infinitely pure Tathāgata, rejoices, believes in it, recites it, and gives alms with the seven treasures in a great chiliocosm, how much merit would they not attain?\"",
        "source": "T14n0434_001:0089a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「甚多，甚多，天中天！」",
        "translation": "Śāriputra said, \"Very much, very much, a god of gods!\"",
        "source": "T14n0434_001:0089a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如捉持無限淨如來名者，所得功德百千萬倍，過出布施功德者上，無以為比。",
        "translation": "The Buddha said, \"It's not as good as grasping and holding the name of the infinitely pure Tathāgata, which obtains merit one hundred million times greater than that of someone who gives alms, and there's nothing to compare it to.",
        "source": "T14n0434_001:0089a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少功德人不得聞此如來名號，於千佛所造立德本，爾乃得聞此尊佛名，却生死罪四十八劫。",
        "translation": "A person of little merit wouldn't be able to hear the Tathāgata's name and create a base of merit in a thousand buddha-places before hearing the name of this honored Buddha, which would save him from the sins of birth-and-death for 48 eons.",
        "source": "T14n0434_001:0089a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此光明尊世界，度九千佛剎，有世界名曰音響，其國有佛，號月音如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, 9,000 buddha bases are crossed over from this venerable world of light, and there's a world called Sound, where there's a Buddha named Moon-voice Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shijian jie, unsurpassed person, Daofayu, and teacher of gods and humans, and he's called Zhongyou, who has helped measureless people.",
        "source": "T14n0434_001:0089a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞月音如來名號者，盡心信樂，持諷誦念，其人所得清淨功德，成具畢滿如月盛明，立不退轉，當成無上正真之道。",
        "translation": "If someone hears the name of the Moon-voice Tathāgata, wholeheartedly believes in it, recites it, and recites it, they'll attain a complete store of pure virtue like the full brightness of the moon, establish their nonretrogression, and achieve the unsurpassed true path.",
        "source": "T14n0434_001:0089a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此音響世界，度萬二千佛剎，有世界名曰安隱，其國有佛，號無限名稱如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of sound that's 12,000 buddha bases away from here, and there's a world called Aniruddha, and in that country there are buddhas with infinite names that are called the Tathāgata, the Supreme Truth, the Completely Enlightened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_001:0089a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞無限名稱如來名者，一心信樂而諷誦者，長跪叉手自作是言：『今我禮無限名稱如來、至真、等正覺！』",
        "translation": "If someone hears the name of the Tathāgata of infinite fame and recites it with wholehearted faith, they kneel down long with their palms together and say, 'Now, I worship the Tathāgata of infinite fame, the Supreme Truth, and the Completely Enlightened One!'",
        "source": "T14n0434_001:0089b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "計於其人所得功德，若積七寶如須彌山，持用布施滿百歲中，所得功德寧為多不？」",
        "translation": "Considering the merit gained by that person, if he were to accumulate seven treasures like Mount Sumeru and maintain them as alms for a hundred years, how much more merit would he gain?\"",
        "source": "T14n0434_001:0089b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「甚多，甚多，天中天！」",
        "translation": "Śāriputra said, \"Very much, very much, a god of gods!\"",
        "source": "T14n0434_001:0089b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如得聞無限名稱如來名者，持其名號歡喜作禮，其福甚多，比於布施過出百倍，無以為比。",
        "translation": "The Buddha said, \"How could someone not hear the Tathāgata's name called by an infinite number of names and rejoice and worship while holding his name? The merit is so great that it's a hundred times greater than generosity, and there's nothing to compare it to.",
        "source": "T14n0434_001:0089b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此安隱世界，度千五百佛剎，有世界名曰為日，其國有佛，號日月光如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, far from this peaceful world, there are 1,500 buddha bases, and there's a world called Weili, and there's a buddha in that country who's called the Tathāgata Sun and Moon Light, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Royalty of the Way, and the Teacher of Gods and People, and who's called the Blessed Ones, who has saved measureless people.",
        "source": "T14n0434_001:0089b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞日月光如來名號者，歡喜敬心，兩膝著地，長跪叉手，自作是言：『我今禮日月光如來、至真、等正覺！』",
        "translation": "Those who hear the name of the Tathāgata Sun and Moon Light rejoice and venerate it, kneel down with both knees on the ground, kneel down with their palms together, and say to themselves, 'Now I worship the Tathāgata Sun and Moon Light, the Supreme Truth, and the Completely Awakened One!'",
        "source": "T14n0434_001:0089b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人疾得成就無上正真之道。",
        "translation": "That person will quickly achieve the unsurpassed true path.",
        "source": "T14n0434_001:0089b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此日世界，度三十佛剎，有世界名曰清淨，其國有佛，號無垢光如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, 30 buddha-halts away from this sunlit world exist, and there's a world called Jingjing, which has a Buddha named Tathāgata of Immaculate Light, Zhizhen, Zhengzhengjue, Mingxingcheng, Shanjian, Shishijian, Wuzi, Wushangshi, Daofayuan, and Tianren zhushi, who's called Zhongyou and has saved measureless people.",
        "source": "T14n0434_001:0089b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞無垢光如來名者，若天、若人、龍及閱叉、若諸非人，歡喜信樂，一心敬禮，斯等皆得立不退轉，成無上最正覺道，終不畏墮三塗之中。",
        "translation": "If those who hear the name of the Tathāgata of Immaculate Light rejoice, believe in gods, humans, dragons, parikṣas, and non-humans, and venerate them with joy and unity of mind, they'll be able to establish irreversibility, achieve the unsurpassed path of supreme perfect enlightenment, and never fear falling into the three destinies.",
        "source": "T14n0434_001:0089b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此清淨世界，度半大千佛剎，有世界名曰琉璃光，其國有佛，號曰淨光如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "\"In the east, half a thousand buddha-halts away from this pure world, there's a world named Lapis Lazuli, and in that country there's a Buddha named Jingguang Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shishijian Jie, an unsurpassed person, a trainer of the way, a teacher of gods and humans, and he's called the Blessed One, who has saved measureless people.",
        "source": "T14n0434_001:0089b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞淨光如來名號者，誦其名號，歡喜作禮，若天、若龍、閱叉及與非人，此等壽終當生天上及與人中，未曾失於天人之路，常當得值法之盈利，貪心、瞋恚、愚癡之意疾得清淨。",
        "translation": "If someone hears the name of the Tathāgata of Pure Light, recites its name, rejoices, and pays homage, then whether it's a god, a dragon, a prince, or a nonhuman, they'll be born up in heaven or among humans at the end of their lives, never missing the path of gods and humans, always reaping the benefits of the Dharma, and their greed, anger, and foolish thoughts will be quickly purified.",
        "source": "T14n0434_001:0089c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有謗毀而不信者，六萬歲中在於盧獵泥犁受罪。",
        "translation": "If someone denigrates them and doesn't believe it, they'll spend 60,000 years in the mire of Loch Nile suffering punishment.",
        "source": "T14n0434_001:0089c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此琉璃光世界，度三百佛剎，有世界名得大豐，其國有佛，號日光如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "To the east, there's a world named Sunlight Tathāgata, Zhizhen, Zhengzhengjue, Mingxingcheng, Shanjian, Shishijian, unsurpassed person, Wayfarer, and teacher of gods and humans, and it's called All Blessed Ones, which has helped measureless people.",
        "source": "T14n0434_001:0089c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞斯佛名者，歡喜信樂，念其如來。",
        "translation": "Those who hear the name of this Buddha rejoice and believe in it, remembering the Tathāgata.",
        "source": "T14n0434_001:0089c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯等之類，譬若日輪，皆悉具滿白淨之法，降伏眾魔及諸外道，却四十劫生死之罪。",
        "translation": "Such people are like the sun-wheel, fully endowed with pure dharmas, which subdue Māra and other non-Buddhists and prevent the sins of forty eons of birth-and-death.",
        "source": "T14n0434_001:0089c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此大豐世界，度萬佛剎，有世界名曰得立正覺侍從，其國有佛，號無量寶如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world that goes to this great abundance of thousands of buddha bases, and there's a world named Attainer of Correct Enlightenment Attendant, and in that country there are buddhas named the Tathāgata of Immeasurable Treasures, the Supreme Truth, the Completely Enlightened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_001:0089c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞無量寶如來名號，歡心信樂，持諷誦者，斯輩皆當得七覺寶，能立眾生於最寶中，眾德之聚日日增長。",
        "translation": "Those of you who hear the name of the Tathāgata of Immeasurable Treasures, rejoice, believe, and recite it, you will attain the seven jewels of awakening that will establish sentient beings among the most precious, and the stock of virtues will grow day by day.",
        "source": "T14n0434_001:0089c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此立正覺世界，度五千佛剎，有世界名蓮花光，其國有佛，號蓮花最尊如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of 5,000 buddha-temples removed from this one that's called the lotus-flower light, and there's a Buddha there who's called the Padmasaṃbhava Tathāgata, the supreme true, perfectly enlightened, accomplished in knowledge and conduct, well gone, worldly saver, unsurpassed man, ritual trainer on the path, and teacher of gods and humans, and who's called the Blessed Ones and has helped measureless people.",
        "source": "T14n0434_001:0089c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞蓮花最尊如來名號，歡喜信樂、持諷誦者，猶若妙花在尊法室，功德智慧日日增長，譬如蓮花從水湧出，却五十劫生死之罪。",
        "translation": "Those who hear the name of the most venerable Lotus Tathāgata, rejoice, believe in it, recite it, and recite it are like marvelous flowers in the venerable Dharma room, and their merits and wisdom grow day by day, like lotus flowers springing up from the water and saving them from the sins of fifty eons of birth-and-death.",
        "source": "T14n0434_001:0089c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0089c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此蓮花光世界，度十萬億佛剎，有世界名普度眾難，其國有佛，號曰身尊如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of lotus flowers and light that's 10,000,000,000 buddha bases away from here, and there's a world named Universally Difficult, and there's a Buddha there who's called the Physiognomic Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Well Gone, the Worldly Understander, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed One and has saved measureless people.",
        "source": "T14n0434_001:0089c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞身尊如來名號者，盡心信樂、持諷誦者，其人疾度生死之海，能除眾生諸欲飢渴，當作快士，為於世間而作福田，能受三界一切供養。",
        "translation": "If someone hears the name of the bodhisattva Tathāgata, wholeheartedly believes in it, recites it, and recites it, they'll quickly cross the ocean of birth and death, remove the desires and hunger of sentient beings, become a fastidious man, create a field of merit for the world, and accept all offerings in the three realms.",
        "source": "T14n0434_001:0090a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有目見此如來者，歡喜信樂，當為世間作大法師，得金剛力，立不退轉，當成無上正真之道。",
        "translation": "Those whose eyes see this Tathāgata rejoice and believe in him, and he'll become a great Dharma teacher for the world, attain adamantine strength, become irreversible, and achieve the unsurpassed true path.",
        "source": "T14n0434_001:0090a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有女人聞此身尊如來名者，盡心淨意、歡喜信樂、無諛諂者，厭污女身，從是以後更止不受女人之身，却六十劫生死之罪。",
        "translation": "If a woman hears the name of this Tathāgata who honors her body, she will fulfill her heart and mind, rejoice and believe in him, have no flattery, and abstain from defiling the body of a woman; from then on, she'll stop accepting the body of a woman and be spared the sins of 60 eons of birth and death.",
        "source": "T14n0434_001:0090a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，舍利弗！",
        "translation": "\"So it is, Śāriputra!",
        "source": "T14n0434_001:0090a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞身尊如來名號者，斯等為獲無極之德，是故當求正覺之道，普救一切令離眾苦。",
        "translation": "Those who hear the name of the bodhisattva Tathāgata will attain an infinite amount of virtue, so they will seek the path of right awakening, saving all people and freeing them from suffering.",
        "source": "T14n0434_001:0090a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0090a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此度眾難世界，度二十佛剎，有世界名曰堅固，其國有佛，號曰金光如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "\"In the east, there's a world named Śākyamuni that's 20 buddha bases away from this world of overcoming many difficulties, and there's a world named Śākyamuni that has buddhas named the Golden Light Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_001:0090a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞金光如來名號者，歡喜信樂，持諷誦念，斯等皆當為佛光明之所護持。",
        "translation": "Those of you who hear the Golden Light Tathāgata's name, rejoice, believe in it, recite it, and recite it, you'll be protected by the Buddha's radiance.",
        "source": "T14n0434_001:0090a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成佛之時，於諸如來光明廣遠而得自在，悉得如來一切眾德。",
        "translation": "When they become buddhas, they'll attain complete freedom in the far-reaching light of the tathāgatas and fully attain all of the tathāgatas' numerous virtues.",
        "source": "T14n0434_001:0090a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故至心普當信樂諸佛尊號，悉得無礙辯才之慧，終不諮受下劣之法，諸願之行當疾成滿。",
        "translation": "Therefore, with utmost sincerity, they'll universally believe in and delight in the names of the buddhas, attain the wisdom of unhindered eloquence, never consult inferior teachers, and quickly fulfill all their vows.",
        "source": "T14n0434_001:0090a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有聞此諸如來名，當自勸發起於尊意，發金剛志，求無上道，此等皆當却十二劫生死之罪。",
        "translation": "Those who hear the names of these tathāgatas will encourage themselves to arouse their noble intentions, summon the adamantine resolve, and pursue the unsurpassed path, and these will all be saved from the sins of 12 eons of birth-and-death.",
        "source": "T14n0434_001:0090a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0090a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此堅固世界，度十佛剎，有世界名曰無際，其國有佛，號梵自在王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, far from this solid world and past the ten buddha-halts, there's a world named Immeasurable, and there's a Buddha in that country who's called the Tathāgata Brahmā Saipūrṇa, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed Ones, who has saved measureless people.",
        "source": "T14n0434_001:0090a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞梵自在王如來名者，歡喜信樂，持諷誦念，叉手作禮，其人必當得見其佛，作轉輪王，立不退轉，當成無上正真之道。",
        "translation": "If someone hears the name of the Tathāgata Brahmā Saṃbhavāja, rejoices, believes in it, recites it with joy, recites it with recitation, and salutes it with folded hands, they surely will see the Buddha, become a wheel-turning king, establish themselves as irreversible, and achieve the unsurpassed true path.",
        "source": "T14n0434_001:0090b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0090b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此無際世界，度二千佛剎，有世界名曰為月，其國有佛，號金光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world that goes without limit and passes 2,000 buddha bases, and there's a world named Weigetsu, and there's a buddha in that country named Golden Light Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shishijian Jie, the unsurpassed man, the Way's Dharma royalty, and the teacher of gods and humans, who's called Zhongyou and has saved measureless people.",
        "source": "T14n0434_001:0090b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞金光明如來名者，歡喜信樂，持諷誦念。",
        "translation": "Those who hear the name Golden Light Tathāgata rejoice and believe in it, recite it, and recite it.",
        "source": "T14n0434_001:0090b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等後生，常為眾生廣說經法，雖為分別一切如夢、如水中月、幻化之法，用寤眾生，從是以往終不復墮惡道之中。",
        "translation": "Such latter beings will always explain the sūtras and teachings in detail to sentient beings, even though they discern all illusory things that are like dreams or the moon in water, in order to awaken sentient beings so that they never fall into a bad destiny again.",
        "source": "T14n0434_001:0090b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當與大德眾聚共會，而常歡喜，能使眾生而得快樂。",
        "translation": "He'll always rejoice when he meets with a large assembly of virtuous people, and that will make sentient beings happy.",
        "source": "T14n0434_001:0090b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後作佛時，以大乘法興顯於世，無有二道。",
        "translation": "When he becomes a buddha later, he'll use the great vehicle teaching to rise in the world, and there won't be any two paths.",
        "source": "T14n0434_001:0090b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0090b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此月世界，度千佛剎，有世界名曰火光，其國有佛，號曰金海如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, far from this moon-world, there's a world named Firelight, and in that country there's a Buddha named Golden Ocean Tathāgata, Zhizhen, Zhengzhengjue, Mingxingcheng, Shanjian, Shijian jie, unsurpassed person, Wayfarer, and teacher of gods and humans, and he's called the Blessed Ones, who has helped measureless people.",
        "source": "T14n0434_001:0090b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞金海如來名號者，盡心信樂、持諷誦者，得不退轉，必成正覺。",
        "translation": "Those who hear the Golden Ocean Tathāgata's name and wholeheartedly believe in it, recite it, and recite it will attain irreversibility and surely become perfectly enlightened.",
        "source": "T14n0434_001:0090b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0434_001:0090b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛、如來本行菩薩道時，作是誓願：『若使有人生我國者，及在他方諸佛國土，聞我名號，斯等當住不退轉地，成最正覺，我當盡為滿具如來無上之願！』",
        "translation": "When that Buddha or Tathāgata first practiced the bodhisattva path, he made this vow: 'If there are people in my country or in other buddha lands who hear my name, they will abide in the stage of nonretrogression and become most perfectly enlightened, and I will fulfill the Tathāgata's unsurpassed vow in full!'",
        "source": "T14n0434_001:0090b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0090b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此火光世界，度十八佛剎，有世界名曰正覺，其國有佛，號龍自在王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "To the east, there's a world of firelight that passes through 18 buddha bases, a world named Zhengjue, and there's a buddha in that country named Tathāgata Dragon Freed King, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shishijian Jie, an unsurpassed person, a ritual guide of the way, and a teacher of gods and humans, who's called the Blessed Ones and has saved measureless people.",
        "source": "T14n0434_001:0090b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞龍自在王如來名者，盡心信樂、持諷誦者，若使郡縣、村落之中雨、雹、霜時，以右膝著地，叉手作禮，而作是言：『龍自在王如來本行菩薩道時，無數諸龍於厄難中悉度脫之，由此功德自致成佛。",
        "translation": "If someone hears the name of Tathāgata Dragon Freed King and wholeheartedly believes in, recites, and recites it, then when it rains, hails, or frosts in a county or village, they put their right knee on the ground, salute with folded hands, and say, 'When Tathāgata Dragon Freed King practices the bodhisattva path, countless dragons are freed from all their troubles and difficulties, and this merit will naturally lead them to become buddhas.'",
        "source": "T14n0434_001:0090b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是誓言：「若我剎中及諸佛土，若我在世般泥洹後，若有諸龍雷、電、雹、霜恐怖眾生，以龍自在王如來威神功德智力，至誠誓願，口作是言，頭面作禮，疾得度脫。」』",
        "translation": "He made this vow, 'If there were dragons in my buddha-stage or in any of the buddha-lands, or if I were to thunder, lightning, hail, or frost that terrify sentient beings after I've passed through the nirvāṇa in the world, then by virtue of the authoritative power and strength of Tathāgata, the Dragon Sovereign King vowed with all sincerity that he would say this or that he would salute them with his head and face, and they would quickly be freed.'",
        "source": "T14n0434_001:0090c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，舍利弗！",
        "translation": "You should know, Śāriputra!",
        "source": "T14n0434_001:0090c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是厄難疾得解脫，唯除宿罪不能得免。",
        "translation": "Thus, they are quickly freed from such difficulties, except for past sins that can't be avoided.",
        "source": "T14n0434_001:0090c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸龍若在厄難聞此佛名，於眾厄中疾得解脫。",
        "translation": "If all the dragons in distress hear this Buddha's name, they'll quickly be liberated from all their troubles.",
        "source": "T14n0434_001:0090c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有執持斯佛名者，復勸他人令使誦持增益功德，必當得往生此佛國，求最正覺，立不退轉，疾成不久。",
        "translation": "Those who hold to this Buddha's name and encourage others to recite it and enhance its virtue will surely be reborn in this Buddha-land, seek supreme perfect enlightenment, become irreversible, and quickly attain it.",
        "source": "T14n0434_001:0090c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0090c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此正覺世界，度十億佛剎，有世界名曰喻月，其國有佛，號一切花香自在王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world a billion buddha bases away from this perfectly enlightened world, and there's a world called Metaphor Moon, and there's a Buddha there who's called the Tathāgata, the Self-permeating King of All Flowers, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed Ones and has saved measureless people.",
        "source": "T14n0434_001:0090c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞一切花香自在王如來名者，淨心信樂、持諷誦者，斯其人等所生之處，當得恒沙戒香具足，一切妙香香氣遍熏，諸佛剎土眾戒具滿，常能奉持未曾缺犯。」",
        "translation": "If someone hears the name of the Tathāgata Sovereign King of All Flowers, has a pure heart, is faithful, and recites it, then the place where they're born will be replete with the scent of constant sand precepts, pervaded by the fragrance of all wonderful odors, and replete with the full set of precepts in all the buddha-lands, which they can always uphold without ever failing to violate.\"",
        "source": "T14n0434_001:0090c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「本何因緣乃能如是？」",
        "translation": "Śāriputra said, \"What were the causes and conditions that made this possible?\"",
        "source": "T14n0434_001:0090c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其佛本行菩薩道時，作是誓願：『我若在世般泥洹後，若有眾生持我名字一心信樂，皆悉當得如是戒香！』",
        "translation": "The Buddha said, \"When he first practiced the bodhisattva path, that Buddha made this vow, 'If I were to go through nirvāṇa in this world, if sentient beings bear my name and are wholeheartedly faithful, they will all attain the fragrance of such precepts!'",
        "source": "T14n0434_001:0090c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T14n0434_001:0090c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常當興立大敬信心於諸如來，如是諸佛擁護其人，使得功德不可計量。",
        "translation": "\"Always establish great reverence and faith in the tathāgatas, and such buddhas will support those people, making their merit incalculable.",
        "source": "T14n0434_001:0090c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有持此諸佛名者，從其所願得之，皆悉當得諸佛智慧而令備滿，得不退轉。",
        "translation": "If someone adheres to the names of these buddhas and obtains them according to their wishes, they will all attain the full accomplishment of the buddhas' wisdom and become irreversible.",
        "source": "T14n0434_001:0090c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長跪叉手，自作是言：『我今禮此一切花香自在王如來！』",
        "translation": "Prostrating with folded hands, he says to himself, 'Now, I worship this Tathāgata, the Free-Realizing King of All Flowers!'",
        "source": "T14n0434_001:0090c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常念不忘，却十四劫生死之罪。",
        "translation": "Being constantly mindful, they won't forget the sins of 14 eons of birth-and-death.",
        "source": "T14n0434_001:0091a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0091a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此喻月世界，度二千一億佛剎，有世界名曰星王，其國有佛，號曰樹王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, far from this metaphorical moon world, there's a world named Star King, and in that country there's a Buddha named Tathāgata Tree King, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shiaoshi, Shiaoshi, the unsurpassed man, the Way, the Dharma Ruler, and the teacher of gods and humans, and he's called the Blessed One, who has saved measureless people.",
        "source": "T14n0434_001:0091a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞樹王如來名號者，歡喜信樂、持諷誦者，斯輩皆當得諸法樂，壞諸魔兵，裂破羅網。",
        "translation": "Those who hear the name of the Tathāgata Tree King and rejoice, believe in it, recite it, and memorize it will attain happiness in regard to the Dharma, destroy the armies of Māra, and split open the net of nails.",
        "source": "T14n0434_001:0091a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞此經，輕慢誹謗，用相調戲，滿六萬歲於僧迦泥犁受其罪報。",
        "translation": "If someone hears this sūtra and becomes dismissive and slanders it, they'll receive the results of their crimes at Saṃghârāmaṇi for 60,000 years.",
        "source": "T14n0434_001:0091a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有言：『我不信此經！』",
        "translation": "If someone says, 'I don't believe this sūtra!'",
        "source": "T14n0434_001:0091a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於七萬歲常在餓鬼，不聞飲食、水、穀之名。",
        "translation": "For 70,000 years, he'll always be a hungry ghost who doesn't hear the names of food, drink, water, or grain.",
        "source": "T14n0434_001:0091a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0091a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此星王世界，度五十五佛剎有世界，其國有佛，號曰勇猛執持牢杖棄捨鬪戰如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "\"To the east of this star king world, there's a world of fifty-five buddha bases whose buddhas are called the Tathāgata Brave, Firm, and Abandoned Fighting Tathāgata, the Supreme Truth, the Completely Awakened One, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Trainer in the Way and Teaching, and Teacher of Gods and People, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_001:0091a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞勇猛執持牢杖棄捨鬪戰如來名者，歡喜信樂、持諷誦者，乃至夢中，此等眾生，譬如金剛伏眾魔兵，以諸智慧消伏諸欲。",
        "translation": "Those who hear the name of the Tathāgata who courageously holds the staff and abandons fights, rejoices, believes in it, recites it, and even in their dreams are like adamantine forces that subdue the armies of Māra and quell desires with their wisdom.",
        "source": "T14n0434_001:0091a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞此佛名號一心信者，審諦自知：『我等前世以為曾見此佛、世尊遊於菩薩徑路之時，而不疑也！",
        "translation": "Those who hear the name of this Buddha and wholeheartedly believe it will examine themselves and know, 'In a previous life, we thought we'd seen this Buddha, the Bhagavān, travel the bodhisattva path, and we didn't doubt it!'",
        "source": "T14n0434_001:0091a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等當發弘誓之願，莫從大乘而得退轉，但當自慶，歡喜踊踊，進大法路，得聞如來種姓名號。",
        "translation": "We will make a great vow not to turn back from the great vehicle but to rejoice and rouse ourselves to enter the great Dharma path and hear the Tathāgata's various names.",
        "source": "T14n0434_001:0091a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛普利益於一切，不捨一人而取滅度；諸佛大慈，普愍眾生，雨於法雨。』",
        "translation": "The buddhas universally benefit all people, not abandoning one person to bring about their extinction; the buddhas are so compassionate that they universally pity sentient beings and rain down the Dharma rain.'",
        "source": "T14n0434_001:0091a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得持此如來名者，歡喜信樂，所得功德，我當為汝取少譬喻。",
        "translation": "If someone adheres to the Tathāgata's name, rejoices and believes in it, and the merits they'll attain, I'll give you a few parables.",
        "source": "T14n0434_001:0091a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如恒邊沙諸佛國土，滿中七寶持用布施，所得功德寧多不乎？」",
        "translation": "Wouldn't it be like the ever-lasting sands of the buddha lands, filled with seven treasures that are bestowed, to obtain much merit?\"",
        "source": "T14n0434_001:0091a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「甚多，甚多，不可思議！」",
        "translation": "Śāriputra said, \"How much, how much, unfathomable!\"",
        "source": "T14n0434_001:0091a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「分大海水一渧為一分，布施功德猶若一渧，持佛名者所得功德，如大海水，不可為喻，少功德人不能堪任聽斯經典。",
        "translation": "The Buddha said, \"A single drop of ocean water is divided into one part, and the merit of generosity is like a single drop. The merit gained by holding to the Buddha's name is like that of ocean water, which is beyond compare, and a person with little merit isn't capable of listening to this sūtra.",
        "source": "T14n0434_001:0091a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使有人久殖德本，得聞斯法，信而不疑，若使地獄、畜生、餓鬼及長壽天聞此經者尚得大福，況復有人已種德本，聞斯經法所得功德寧可喻乎！",
        "translation": "If someone who has long cultivated the roots of virtue hears this teaching, believes it and doesn't doubt it, and if someone in hell, animals, hungry ghosts, or long-lived gods hears this sūtra, they'll still attain great fortune, so how could someone who has cultivated the roots of virtue hear this sūtra's teaching and attain merit that can't be compared to what it's worth?",
        "source": "T14n0434_001:0091b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0091b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此佛土，度二十佛剎，有世界名曰豐饒，其國有佛，號內豐珠光如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world named Abundantly Endowed, which is a buddha land 20 buddha-halts away from here, and there's a buddha there who's called the Inner Abundance Jewel Light Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, and who's called the Blessed One, who has helped measureless people.",
        "source": "T14n0434_001:0091b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞內豐珠光如來名者，一心信樂，持諷誦念，斯等皆當獲大功德，終不畏墮三塗之難，所發弘誓如意、得滿大乘之願。",
        "translation": "Those of you who hear the name Nefarious Jewel Light Tathāgata, whole-heartedly believe in it, recite it, and recite it, you will attain great merit, never fear the difficulty of falling into the three destinies, and fulfill the vows of the great vehicle that you've made so vowed to do.",
        "source": "T14n0434_001:0091b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若今現在般泥洹後，其有得聞內豐珠光如來名者，信樂誦念，斯等皆當得大乘法樂而以自娛，及受天上、人中快樂，常當得生清淨佛土，於諸佛國具滿眾願。",
        "translation": "If there are people who hear the name of the Tathāgata Nebula-jeweled Radiance now after parinirvāṇa and believe in and recite it, they will attain the happiness of the great vehicle teaching for their own enjoyment, receive the happiness of gods and humans, and always be born in a pure Buddha land that fulfills all their vows in all the Buddha lands.",
        "source": "T14n0434_001:0091b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從意所欲，於三乘法而得滅度，於其中間從此佛所，獲功德聚甚大弘廣，恒沙劫中所作眾罪，悉當棄捨不受，唯除逆罪、起瞋恚意向諸快士。",
        "translation": "Doing as they wish, they'll attain extinction in the three vehicles, and in the interim, from this Buddha's place, they'll attain a stock of merit that's so great and broad that they'll abandon all the sins they've committed in eons and never accept them, except for those who commit heinous sins and become angry with the people they want to please.",
        "source": "T14n0434_001:0091b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等之類於久長世，地獄之中受斯罪畢，因得聞此佛名功德所致，其後如願於三乘中而取滅度。",
        "translation": "After suffering these sins in hell for a long time, these people, because of the merits of hearing this Buddha's name, will then attain liberation among the three vehicles, as they had hoped.",
        "source": "T14n0434_001:0091b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，舍利弗！",
        "translation": "You should know, Śāriputra!",
        "source": "T14n0434_001:0091b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾惡之行慎莫造作，如我於此經中上章所說，不可起恚向於焦柱，何況懷惡向於眾生；已立信心向成道者，況起瞋恚、懷於誹謗向諸如來無量慧等。",
        "translation": "\"Don't engage in many bad deeds, as I said in the previous chapter of this sūtra, and don't get angry at a burning pillar, let alone harbor evil toward sentient beings; how could someone who has established faith and is headed toward accomplishing the path get angry and harbor slander toward the Tathāgatas' immeasurable wisdom?",
        "source": "T14n0434_001:0091b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此之人於無數劫在地獄中，具受無量苦惱之罪，爾乃得出。",
        "translation": "Such a person would spend countless eons in hell, suffering measureless painful and painful crimes, and then they'd escape.",
        "source": "T14n0434_001:0091b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為斯等求於大乘信解者故，而說斯法。",
        "translation": "It's for these people who seek to believe in the great vehicle that I explain this teaching.",
        "source": "T14n0434_001:0091b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有毀壞大乘法者，實當具受無量大苦，信樂之者，自果當立不退轉地，必成正覺。",
        "translation": "Anyone who disparages the great vehicle teaching will indeed experience measureless great suffering, and those who believe and are happy with it will establish themselves in the stage of irreversibility and surely become fully awakened.",
        "source": "T14n0434_001:0091b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0091c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此豐饒世界，度八十佛剎，有世界名最香熏，其國有佛，號無量香光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world that goes to this abundant world and passes through 80 buddha bases, and there's a world named Most Fragrant, where there's a Buddha named Tathāgata of Immeasurable Fragrance and Light, Supreme Truth, Completely Awakened, Becoming, Well Gone, Worldly Understanding, Unsurpassed Person, Way, Dharma Ruler, and Teacher of Gods and People, who's called All Blessed One and has saved measureless people.",
        "source": "T14n0434_001:0091c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞無量香光明如來名者，持諷誦念，一心信樂，最後念之，斯等皆當得不退轉地，成最正覺。",
        "translation": "Those of you who hear the name of the Tathāgata of Immeasurable Fragrance and Light, recite it, recite it with recitation, whole-heartedly believe in it, and finally recite it, you will attain the stage of nonretrogression and become the most perfectly enlightened.",
        "source": "T14n0434_001:0091c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成正覺已，諸毛孔中出眾妙香，遍至十方猶若雲起，非是下劣少智之士、學淺法者，而解斯經。",
        "translation": "After they become perfectly enlightened, multitudes of wonderful fragrances will emanate from their pores, reaching the ten directions like clouds rising, so it won't be inferior, little-educated people or those who have studied shallow dharmas who understand this sūtra.",
        "source": "T14n0434_001:0091c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾亦道眼觀覩斯等諸眾生類，其有信樂斯經法者，過去世間無數劫中，於諸佛所集諸慧法造眾德本，今乃得聞此尊妙法。",
        "translation": "I, too, have seen with the eye of the Way these sentient beings who believe in and are delighted by the teaching of this sūtra and have created the roots of many virtues from the wisdom teachings gathered by the buddhas during countless eons in the distant past, and now I've been able to hear this honored one's wonderful teaching.",
        "source": "T14n0434_001:0091c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最後末世聞斯典教，信而奉持，未曾生意而懷誹謗，初未曾有不解法時，却四十劫生死之罪。",
        "translation": "In the final age, when he hears this sūtra's teaching, he believes and adheres to it, never acts freely but harbors slander, and at first there was never a time when he didn't understand the teaching that saved him from the sins of forty eons of birth-and-death.",
        "source": "T14n0434_001:0091c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人功德如月欲滿，為於世間而作快士，應當得受一切恭敬，而為眾生作良福田。",
        "translation": "That person's virtue is like the moon about to fill, and they'll become a fastidious man for the world, deserving of all respect and making a good field of merit for sentient beings.",
        "source": "T14n0434_001:0091c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0091c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此香熏世界，度五十佛剎，有世界名龍珠觀，其國有佛，號師子響如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world beyond this fragrant one that contains fifty buddha-temples called Longzhu Guan, and there's a buddha in that country named Shizi Zing Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shishijian Jie, the unsurpassed man, the Way, the Dharma royalty, and the teacher of gods and humans, who's called Zhongyou and has saved measureless people.",
        "source": "T14n0434_001:0091c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞師子響如來名者，持諷誦讀，一心信樂，念於戒行，斯等皆當立不退轉，成最正覺，作眾德輪，入白淨法，於中旋轉過出於世，却二十劫生死之罪。",
        "translation": "Those of you who hear the lion resonating in the Tathāgata's name, recite it, recite it with recitation, have unified faith, and are mindful of the precepts and practices will establish irreversibility, become most truly enlightened, create a wheel of many virtues, enter the white pure Dharma, and spin around in it past the world, saving you from the sins of 20 eons of birth-and-death.",
        "source": "T14n0434_001:0091c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子、族姓女、若人、非人，其諸厄難疾得解脫，現在於世有得聞斯佛名者，於諸世間猶若尊塔。",
        "translation": "If clansmen sons and clanswomen, humans and non-humans, are quickly freed from their troubles and difficulties, and if they now hear the Buddha's name in the world, they'll be like venerable stūpas in other worlds.",
        "source": "T14n0434_001:0091c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0091c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此龍珠觀世界，度三十佛剎，有世界名曰修行，其國有佛，號大強精進勇力如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world named Cultivation that goes beyond this one, the Dragon Pearl Contemplation World, and there's a world named Cultivation in which there's a Buddha named Tathāgata of Great Power, Supreme Truth, Completely Awakened One, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed One, Ruler of the Way and Dharma, and Teacher of Gods and People, who's called Blessed One and has saved measureless lives.",
        "source": "T14n0434_001:0091c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞大強精進勇力如來名者，盡心信樂，持諷誦念，右膝著地，叉手作禮，自作是言：『我今禮大強精進勇力如來、至真、等正覺！』",
        "translation": "Those who hear the name of the Tathāgata of Great Effort and Courage, believe in it with all their hearts, recite it with recitation, kneel on their right knee, salute with folded hands, and say to themselves, 'Now I salute the Tathāgata of Great Effort and Courage, the Supreme Truth, and Perfect Enlightenment!'",
        "source": "T14n0434_001:0092a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯其人等，遊生死中多所饒益，得大戰力，退却眾魔，伏諸外道，却二十五劫生死之罪。",
        "translation": "Such people travel through birth and death with much benefit, attain great combat power, turn back Māra, subdue non-Buddhists, and avoid the sins of twenty-five eons of birth and death.",
        "source": "T14n0434_001:0092a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此修行世界，度四十佛剎，有世界名曰堅住，其國有佛，號過出堅住如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of cultivation that's 40 buddha-temples away from here, and there's a world called Śubhakarasiṃha, which has buddhas named Śubhakarasi Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shiaoshi, Shiaoshi, the unsurpassed man, the Way, the Dharma royalty, and the teacher of gods and humans, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_001:0092a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞過出堅住如來名者，淨心信樂，持諷誦念，此等皆當堅住大乘，於諸尊法得堅固財，加得大福，晝夜日日增益功德。",
        "translation": "Those of you who hear the name of the surpassingly resolute Tathāgata, purify your mind, believe in it, recite it, and memorize it will resolutely abide in the great vehicle, attain a solid fortune in the teachings of the venerables, and obtain great merit that will increase day and night.",
        "source": "T14n0434_001:0092a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此堅住世界，度三十六佛剎，有世界名曰光明，其國有佛，號鼓音王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, far away from this firmly abiding world and past thirty-six buddha bases, there's a world named Jōtō Kōkaku, and there's a buddha in that country who's called the Tathāgata King of the Sound of the Drum, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Royalty of the Way, and the Teacher of Gods and People, who's called the Blessed Ones and who has saved measureless people.",
        "source": "T14n0434_001:0092a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞鼓音王如來名者，盡心信樂，持諷誦念，長跪叉手，自作是言：『我今禮鼓音王如來、至真、等正覺！』",
        "translation": "Those who hear the name of the Tathāgata King of Sound of the Drum become completely devoted, recite it with recitation, kneel down with their palms together, and say to themselves, 'Now I worship the Tathāgata King of Sound of the Drum, the Supreme Truth, and the Completely Awakened One!'",
        "source": "T14n0434_001:0092a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所得功德，三千大千一切世界滿中珍寶持用布施，得其功德寧為多不？」",
        "translation": "Would the merit obtained be greater than the donation of the treasures of a world 3,000 great one-thousand full of them?\"",
        "source": "T14n0434_001:0092a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「甚多，甚多，天中天！」",
        "translation": "Śāriputra said, \"Very much, very much, a god of gods!\"",
        "source": "T14n0434_001:0092a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如有人持此佛名功德甚多，過出施上百千萬倍。",
        "translation": "The Buddha said, \"Perhaps someone holding to this Buddha's name would be so meritorious that it's a hundred million times greater than the offerings.",
        "source": "T14n0434_001:0092a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此光明世界，度百五十佛剎，有世界名眾德室，其國有佛，號曰月英如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, there's a world of light that goes up to 150 buddha bases, and there's a world called the Room of Many Virtues, and in that country there's a Buddha named Yueying Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shangaizhao, Shishijian Jie, the unsurpassed man, the Way, the Dharma royalty, and the teacher of gods and humans, and he's called Zhongyou, who has saved measureless people.",
        "source": "T14n0434_001:0092a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞月英如來名者，盡心信樂，若天、若人、龍及非人，聞此佛名，持諷誦念，斯等皆當得入清淨，猶若蓮花不著塵水，於眾惡中悉無所犯。",
        "translation": "If someone hears the name of the Moon-yeong Tathāgata and wholeheartedly believes in it, then if gods, humans, dragons, or non-humans hear the Buddha's name, recite it, and recite it, they'll all attain purity like a lotus flower not clinging to dust and water, and there'll be no offense among the many evils.",
        "source": "T14n0434_001:0092a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有女人得聞月英如來名者，淨心信樂無有諛諂，從是以後更止不受女人之身。",
        "translation": "If a woman hears the name of the moon-eyed Tathāgata, she'll be pure in heart and delight in it without flattery, and from then on she'll stop accepting the body of a woman.",
        "source": "T14n0434_001:0092b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有不信輕慢謗毀，當二十劫在於阿鼻大泥犁中具受眾苦。",
        "translation": "If someone doesn't believe it and despises it, they'll spend 20 eons in the great nirvāṇa of Abhijit and suffer many hardships.",
        "source": "T14n0434_001:0092b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使有人盡心信樂，懷大恭敬，却二十一劫生死之罪。",
        "translation": "If someone wholeheartedly believes in and is delighted with great respect, that will prevent the sins of birth-and-death for 21 eons.",
        "source": "T14n0434_001:0092b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此眾德世界，度十萬億佛剎，有世界名住栴檀地，其國有佛，號超出眾花如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。」",
        "translation": "In the east, there's a world of many virtues that's 10,000,000,000 buddha bases away from here, and there's a world called Sandalwood Land, and there's a Buddha there who's called Beyond All Flowers Tathāgata, Supreme Truth, Perfectly Enlightened, Accomplished in Knowledge and Conduct, Well Gone, Soldier of the World, Unsurpassed Person, Ruler of the Way, and Teacher of Gods and People, and he's called All Blessed One, who has saved measureless people.\"",
        "source": "T14n0434_001:0092b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗：「其佛本行菩薩道時，自作是言：『我成正覺興出世時，其剎土中無有八難！』",
        "translation": "The Buddha told Śāriputra, \"When that Buddha first practiced the bodhisattva path, he said to himself, 'When I become perfectly enlightened and rise into the world, there won't be eight difficulties in my buddha's land!'",
        "source": "T14n0434_001:0092b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用是誓願自淨佛國。",
        "translation": "\"With this vow, he purifies the Buddha's kingdom.",
        "source": "T14n0434_001:0092b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有得聞超出眾花如來名者，盡心信樂，持諷誦念，斯等大士於諸世間，多所利益，如大藥王。",
        "translation": "If someone hears the name of the Tathāgata who transcends all flowers and wholeheartedly believes in it, recites it, and recites it, such a great person will be of great benefit to the world, like a great medicine king.",
        "source": "T14n0434_001:0092b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此栴檀世界，度二十億佛剎，有世界名曰善住，其國有佛，號世燈明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, far from this sandalwood world, there are two billion buddha-zestas, and there's a world called Shanzhu, which has a Buddha named Shidamitsu Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shiaoshi, Shiaoshi, the unsurpassed man, the Way, the Dharma royalty, and the teacher of gods and humans, who's called the Blessed Ones and has saved measureless people.",
        "source": "T14n0434_001:0092b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞世燈明如來名者，盡心信樂，持諷誦念，斯等皆當脫三塗厄，唯除逆罪、起瞋恚向諸快士。",
        "translation": "Those of you who hear the name of the Tathāgata who is the lamp of the world, believe in it with all your heart, recite it, and recite it, you'll be freed from the three destinies and only remove the heinous sins and anger that arise and head for the pleasant people.",
        "source": "T14n0434_001:0092b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有持此如來名者，為得此尊妙法之寶，却二十劫生死之罪。",
        "translation": "Those who bear the Tathāgata's name will attain the treasure of this honored one's wonderful teaching and be spared the sins of 20 eons of birth-and-death.",
        "source": "T14n0434_001:0092b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此善住世界，度八十億佛剎，有世界名曰光明，其國有佛，號休多易寧如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, far from this well-abiding world, there are eight billion buddha bases, and there's a world called Brightness, and in that country there's a Buddha named Huetuo Yining Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanga, Shiaoshi, Shiaoshi, the unsurpassed man, the Way, the Dharma Ruler, and the Teacher of Gods and People, and he's called Blessed One and has saved measureless people.",
        "source": "T14n0434_001:0092b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以世界名光明者，其國佛土地平如掌，以眾蓮花布滿世界；其土如來光明晃晃，猶若大火晝夜常照；其佛國土光明巍巍最尊第一，常於大眾轉尊法輪。",
        "translation": "That world is called 'luminosity' because the Buddha's land is as flat as a palm and covered with lotus flowers; the Tathāgata's light shines brightly like a great fire that shines day and night; the Buddha's land is so radiant and majestic that it's the most venerable and highest, and it always turns the venerable Dharma wheel in the masses.",
        "source": "T14n0434_001:0092c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使有人三千世界以金布地，復以妙衣莊飾其地，悉令彌滿三千世界持用布施，得其功德寧為多不？」",
        "translation": "If someone were to spread gold on the ground in 3,000 worlds and adorn the ground with fine clothing, would it all fill up 3,000 worlds with almsgiving and would it obtain much merit?\"",
        "source": "T14n0434_001:0092c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「甚多，甚多，天中天！」",
        "translation": "Śāriputra said, \"Very much, very much, a god of gods!\"",
        "source": "T14n0434_001:0092c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如有人聞休多易寧如來名者，盡心信樂，持諷誦念，其人得福過出布施功德者上數百千倍。",
        "translation": "The Buddha said, \"Suppose someone hears the name of the Tathāgata Śuddhodana and wholeheartedly believes in it, recites it, and recites it, that person will attain merit that's hundreds of thousands of times greater than the merit of generosity.",
        "source": "T14n0434_001:0092c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯等眾生自恣發願，如意得之，却六十劫生死之罪。",
        "translation": "Such sentient beings will freely make the vow to obtain it as they wish, saving them from the sins of 60 eons of birth and death.",
        "source": "T14n0434_001:0092c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後成無上正真道時，其佛國土嚴淨快樂、尊貴無比。",
        "translation": "When they later achieve the unsurpassed true path, their Buddha-lands will be beautiful, pure, and honored beyond compare.",
        "source": "T14n0434_001:0092c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此光明世界，復有剎土名圍遶月，其國有佛，號曰寶輪如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，今現在說法。",
        "translation": "In the east, far from this shining world, there's another land called Around the Moon, and in that land there's a Buddha named the Wheel-Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, the Teacher of Gods and People, and he's called the Blessed One, who has saved measureless lives and is now presently teaching.",
        "source": "T14n0434_001:0092c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此圍遶世界，有剎土名曰度覺，其國有佛，號常滅度如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，而今現在轉不退轉無上法輪。",
        "translation": "In the east, far from this encircling world, there's a land called Togakus, and in that land there's a Buddha named Everlasting Tathāgata, Supreme Truth, Perfectly Awakened, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Ruler of the Way, and Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and is now turning the irreversible, unsurpassed wheel of the Dharma.",
        "source": "T14n0434_001:0092c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此度覺世界，有剎土名須彌脇，其國有佛，號曰淨覺如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，而今現在廣說經法。",
        "translation": "In the east, far from this world of perfect enlightenment, there's a land called Sumeru, and in that land there are buddhas named Jingjue Tathāgata, Zhizhen, Zhengjue, Mingxingcheng, Shanjian, Shijian jie, unsurpassed person, Daofayuan, and teacher of gods and humans, who are called Zhongyou and have saved measureless people, and who now explain the sūtras and teachings in detail.",
        "source": "T14n0434_001:0092c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0092c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此過須彌脇世界，有剎土名曰名稱，其國有佛，號無量寶花光明如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，而今現在廣說妙法。",
        "translation": "In the east, beyond Sumeru, there's a land called Name, and in that land there's a Buddha named Tathāgata of Immeasurable Flower Light, Supreme Truth, Completely Awakened One, Maitreya, Well Gone, Worldly Understander, Unsurpassed One, Wayfarer, Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and now explains the wonderful Dharma in detail.",
        "source": "T14n0434_001:0092c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0093a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方過此名稱世界有剎土，名曰妙軟，其國有佛，號須彌步如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，而今現在於大眾中廣說經法。",
        "translation": "In the east, beyond this well-known world there's a land called Miaosoft, and in that land there's a Buddha named Sumeru Tathāgata, Zhizhen, Zhengjue, Mingxing Cheng, Shanjian, Shijian Jie, the unsurpassed man, the Way, the Dharma royalty, the teacher of gods and humans, who's called Zhongyou and has saved measureless people, and who now explains the sūtras and teachings to the masses.",
        "source": "T14n0434_001:0093a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0093a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方過此妙軟世界，有剎土名曰豐養，其國有佛，號寶蓮花如來至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，現在大眾廣說經法。",
        "translation": "In the east, beyond this wonderfully soft world, there's a land called Fonyang, and in that land there's a Buddha named Jewel-Lotus Tathāgata who's supremely true, perfectly enlightened, accomplished in knowledge and conduct, well gone, worldly saver, unsurpassed man, trainer in the principles of the path, teacher of gods and humans, called All Blessed Ones, who has saved measureless lives and is now explaining the sūtras and teachings to the masses.",
        "source": "T14n0434_001:0093a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0093a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方過此豐養世界，有剎土名蓮花踊出，其國有佛，號一切眾寶普集如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，現在說法。",
        "translation": "In the east, past this abundant world, there's a land called Padmasaṃbhava, and in that land there's a Buddha who's called the universal gathering of all treasures, the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming of Clear Practices, the Good Passage, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones, who has saved measureless lives, and who now preaches.",
        "source": "T14n0434_001:0093a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0093a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方去此蓮花踊出世界，有剎土名曰金光，其國有佛，號樹王豐長如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，現在說法。",
        "translation": "In the east, far away from this world where lotus flowers spring up, there's a land called Golden Light, and in that land there's a Buddha named Tree King Pūrṇa Tathāgata, Supreme Truth, Perfectly Enlightened, Maitreya, Well Gone, Worldly Understanding, Unsurpassed Person, Wayfarer, Teacher of Gods and People, who's called All Blessed Ones, has saved measureless lives, and now preaches.",
        "source": "T14n0434_001:0093a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0093a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方過此金光世界，有剎土名曰清淨，其國有佛，號轉不退轉法輪眾寶普集豐盈如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量，與諸菩薩無央數眾前後圍遶，轉不退轉無上法輪。",
        "translation": "In the east, beyond this world of golden light, there's a land called Jingjing, and in that land there's a Buddha who's called the Turning, Irreversible, and Turning Wheel of the Dharma, and there are all these treasures abundantly abundant, such as the Tathāgata, the Supreme Truth, the Completely Awakened One, the Becoming, the Good Passing, the Worldly Understanding, the Unsurpassed One, the Way, the Dharma Ruler, and the Teacher of Gods and People, who's called the Blessed Ones and who has saved measureless lives, surrounded by an incalculable multitude of bodhisattvas, turning the irreversible and unsurpassed wheel of the Dharma.",
        "source": "T14n0434_001:0093a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T14n0434_001:0093a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方過此清淨世界，有世界名曰淨住，其國有佛，號圍遶特尊得淨如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號曰眾祐，度人無量。",
        "translation": "In the east, beyond this pure world, there's a world named Jingjian, and in that country there are buddhas called the circumambulate Tathāgata, the supreme one, the perfectly true one, the perfectly enlightened one, the accomplished one, the well gone one, the worldly knower, the unsurpassed one, the royal one, the teacher of gods and humans, and they're called the Blessed Ones, who save measureless people.",
        "source": "T14n0434_001:0093a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯諸如來、至真、等正覺現在東方，其有宣揚諸如來名，廣分別說，令人受持，復有餘者不可計數，今悉現在說無上法。",
        "translation": "These Tathāgatas, Supreme Truths, and Fully Awakened Ones are here in the East, and some of them proclaim the names of the Tathāgatas, explain them in detail, and have them accepted, and there are others that are incalculable, but now they're all explaining the unsurpassed Dharma.",
        "source": "T14n0434_001:0093a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有得聞斯諸佛名，盡心信樂，以膝著地，長跪叉手，普為東方諸佛作禮，持諸佛名，三作是言：『我今普禮東方一切諸佛、世尊！』",
        "translation": "Those who hear the names of these buddhas and are completely devoted, kneel down with their knees on the ground, kneel down with their palms together, salute all the buddhas of the East, hold their names, and say three times, 'Now, I salute all the buddhas and world-honored ones of the East!'",
        "source": "T14n0434_001:0093b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人得福不可限量。",
        "translation": "That person will attain unlimited merit.",
        "source": "T14n0434_001:0093b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說稱揚諸佛功德經卷上",
        "translation": "Foshuo xiangyang zhoufo gongde jing shoushang",
        "source": "T14n0434_001:0093b07_0",
        "is_bad_quality": false
    }
]