[
    {
        "source_sentence": "佛說月燈三昧經一卷(一名文殊師利菩薩十事行經)宋沙門先公譯聞如是：一時，佛在舍衛國，遊於祇樹給孤獨園，與大比丘眾五百人、六萬菩薩俱，及持央數諸天人。",
        "translation": "Foshuo yue deng sanmei jing i fang (a Wenshushilipusa shishixing jing) Song shamen xiangong translated and heard this: One time, the Buddha was in the country of Śrāvastī and traveled to Anāthapiṇḍada Park in Jeta Grove with a large assembly of 500 monks, 60,000 bodhisattvas, and a great number of gods and humans.",
        "source": "T15n0640_001:0620a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，文殊師利菩薩在其眾會中坐。",
        "translation": "At the time, Mañjuśrī was sitting in the midst of that congregation.",
        "source": "T15n0640_001:0620a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，佛告文殊師利言：「童子！",
        "translation": "The Buddha then addressed Mañjuśrī, saying, \"Boy!",
        "source": "T15n0640_001:0620a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩行布施有十事。",
        "translation": "There are ten things that bodhisattvas do when they practice generosity.",
        "source": "T15n0640_001:0620a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0620a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者諦除嫉妬意；二者常清淨意布施；三者無數百千人不能奪其財；四者無上妙而終亡；五者生大豪貴家；六者所生處好布施；七者為四部眾所愛念；八者無所畏，入眾會亦無礙，十方皆聞其名聲；九者年少手足柔軟；十者常樂善知識，乃至坐佛樹下。",
        "translation": "One, he is truly free of jealousy; two, he always gives with a pure heart; three, there are hundreds of thousands of people who can't take his wealth; four, he's unsurpassed and marvelous and never dies; five, he's born into a great and noble family; six, he's a good donor wherever he's born; seven, he's beloved by the four groups of people; eight, he has no fear and is unhindered in entering congregations, and his reputation is heard in ten directions; nine, he's young and has gentle hands and feet; and 10, he's always delighted with good teachers, even up to sitting under a buddha tree.",
        "source": "T15n0640_001:0620a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0620a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩行布施十事。」",
        "translation": "These are the ten things that bodhisattvas do when they practice generosity.\"",
        "source": "T15n0640_001:0620a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「已遠除於嫉妬，　　意常好布施者；　持上妙而終亡，　　生即於豪富家。",
        "translation": "The Buddha then spoke this verse, \"He's removed from jealousy, and his mind is always well disposed toward generosity; he maintains the highest qualities and eventually dies, so he's born into a wealthy family.",
        "source": "T15n0640_001:0620a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所生處意常樂，　　而好喜於布施；　為眾生所愛念，　　居家者及出學。",
        "translation": "Where he's born, his mind is always happy, and he takes delight in generosity; he's beloved by sentient beings, living at home and going out to study.",
        "source": "T15n0640_001:0620a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於眾會無所畏，　　所至處無疑難；　其名聲遠而聞，　　於郡國及縣邑。",
        "translation": "He has no fear in congregations and no doubts where he goes; his reputation is heard far and wide, in his county and town.",
        "source": "T15n0640_001:0620a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其手足常柔軟，　　所欲得不復難；　即為得善知識，　　諸佛及其弟子。",
        "translation": "Their hands and feet are always tender, and it's no longer difficult to obtain what they desire; that is, to attain a good teacher, the buddhas, and their disciples.",
        "source": "T15n0640_001:0620a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　終不復生嫉妬意，　　意常好樂欲布施；　以持上妙而終亡，　　於是行事無嫉妬。",
        "translation": "Never again will he become jealous, but his mind always takes delight in wanting to give; he maintains his superior qualities and eventually dies, so he acts without jealousy.",
        "source": "T15n0640_001:0620a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即生於大豪富家，　　意常喜樂而布施；　為若干億人所愛，　　好布施者有是行。",
        "translation": "They're born into a great, wealthy family, and their mind is always delighted with generosity; they're loved by hundreds of millions of people, and those who are good at generosity have such behavior.",
        "source": "T15n0640_001:0620b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得善知識不復難，　　常見諸佛及弟子；　見已即樂供養之，　　其布施者有是行。」",
        "translation": "It's not difficult to attain a good teacher, for they often meet buddhas and disciples, and after seeing them, they happily make offerings to them, and that person's generosity has this kind of behavior.\"",
        "source": "T15n0640_001:0620b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩持戒清淨有十事。",
        "translation": "The Buddha said to the boy, \"There are ten things that a bodhisattva does to observe the precepts with purity.",
        "source": "T15n0640_001:0620b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0620b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者具足其願，二者學佛道，三者常尊樂於黠慧，四者死不妄語，五者見世不轉意，六者棄生死，七者求泥洹，八者寂寞行，九者得三昧，十者無貧窮行。",
        "translation": "One fulfills his vow, two trains in the Buddha Way, three is always honored by wisdom, four doesn't speak falsely in death, five doesn't change his mind when he sees the world, six abandons birth and death, seven seeks nirvāṇa, eight practices in solitude, nine attains samādhi, and ten practices without poverty.",
        "source": "T15n0640_001:0620b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0620b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩十事清淨持戒。」",
        "translation": "These are the ten things a bodhisattva does to observe the precepts with purity.\"",
        "source": "T15n0640_001:0620b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「即具足其所願，　　學諸佛之道行；　常樂於尊智慧，　　亦無有恐懼時。",
        "translation": "The Buddha then spoke this verse, \"They fulfill their vows and train in the ways and practices of the buddhas; they always delight in honored wisdom and have no time for fear.",
        "source": "T15n0640_001:0620b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不復轉其所願，　　亦不轉慎諸行；　常棄遠於生死，　　則求索泥洹道。",
        "translation": "He doesn't again change his vows or become prudent in his actions; always abandoning birth and death, he seeks the path to nirvāṇa.",
        "source": "T15n0640_001:0620b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常在寂寞處行，　　即便得於三昧；　而無有貧窮時，　　即立於持戒品。",
        "translation": "Always walking in a lonely place, he attains samādhi even when he's not poor, and then he establishes himself in the category of observer of the precepts.",
        "source": "T15n0640_001:0620b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人即具所可願，　　是菩薩學諸佛道；　慧者於人不自稱，　　其人如是戒清淨。",
        "translation": "That person then has what's permissible to wish for, a bodhisattva who trains in the ways of the buddhas; a wise person doesn't claim to be someone who thus has purified the precepts.",
        "source": "T15n0640_001:0620b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持願甚堅不復難，　　終不復動所采建；　以見生死無數惡，　　便棄捐求泥洹道。",
        "translation": "Holding to the vow is resolute and not difficult, and he never again builds anything; seeing the countless evils of birth and death, he abandons it and seeks the path of nirvāṇa.",
        "source": "T15n0640_001:0620b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其意不復著所念，　　其人如是立戒彊；　得正剎土無不可，　　清淨戒者有是行。」",
        "translation": "His mind no longer attaches to what he thinks, and he thus establishes the bases of morality; there's nothing impossible about attaining the right bases, and these are the practices of someone who has pure morality.\"",
        "source": "T15n0640_001:0620b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩立忍辱有十事。",
        "translation": "The Buddha told the boy, \"There are ten things that a bodhisattva does to establish patience.",
        "source": "T15n0640_001:0620b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0620b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者火不能燒，二者刀不能害，三者毒不能行，四者水不能沒，五者非人護之，六者得莊嚴其身相，七者閉塞諸惡道，八者得生梵天不難，九者晝夜得安隱，十者安樂不移。",
        "translation": "One cannot be burned by fire, two cannot be harmed by a sword, three cannot be acted upon by poison, four cannot be sunken by water, five cannot be protected by anyone other than myself, six can adorn their physical appearance, seven are shut out from bad destinies, eight are born in the Brahma Heaven without difficulty, nine are attained peace by day and night, and ten are at peace and not removed.",
        "source": "T15n0640_001:0620b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0620b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩十事住忍辱。」",
        "translation": "These are the ten things a bodhisattva abides in to endure.\"",
        "source": "T15n0640_001:0620b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「火不能燒其人，　　刀亦不能傷害；　其毒不能得行，　　水亦不能漂沒。",
        "translation": "The Buddha then spoke this verse, saying, \"That person can't be burned by fire, can't be harmed by a sword, can't be overcome by poison, and can't be sunk by water.",
        "source": "T15n0640_001:0620b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸非人悉護之，　　即得三十二相；　便閉塞諸惡道，　　忍辱者德如是。",
        "translation": "They are all protected by those who are not human beings, and they attain the thirty-two marks; they then shut off the bad paths, and so is the virtue of someone who tolerates it.",
        "source": "T15n0640_001:0620c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　求索諸梵及釋，　　彼亦不而難致；　常得安隱之行，　　悉覺於非常事。",
        "translation": "Seeking out Brahmā and Śākyamuni, they don't make it difficult to attain them; they always attain a peaceful practice, and they fully realize extraordinary things.",
        "source": "T15n0640_001:0620c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　刀及火亦不能傷，　　行於毒中不能害；　諸天及人鬼神護，　　其忍辱者有是行。",
        "translation": "They can't be harmed by sword or fire, and they can't be harmed by walking through poison. Gods and humans, ghosts, and spirits protect them, and this is the kind of practice they have that's tolerant.",
        "source": "T15n0640_001:0620c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即身得三十二相，　　其人不復畏惡道；　於是死即生梵天，　　行慈心者有是道。",
        "translation": "He then attains the thirty-two marks on his body, so he's no longer afraid of the evil path; immediately after death, he's born in the Brahma Heaven, and this is the path of someone who conducts himself with kindness.",
        "source": "T15n0640_001:0620c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　晝夜即得安隱行，　　常好喜身得安定；　於一切有清淨意，　　終無有瞋恚志行。」",
        "translation": "He'll attain a peaceful practice by day and night, always rejoicing in the body and attaining stability, and he'll have pure intentions about everything and never act with anger.\"",
        "source": "T15n0640_001:0620c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告童子：「菩薩精進有十事。",
        "translation": "The Buddha told the boy, \"There are ten things that a bodhisattva does with effort.",
        "source": "T15n0640_001:0620c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0620c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者有威神，二者為諸佛所護，三者非人悉亦護之，四者聞法終不轉忘，五者所未聞法而得聞，六者得高明智慧，七者得種種三昧，八者終無病時，九者飯食得安隱，十者得柔軟如優鉢不剛。",
        "translation": "One has authority, two is protected by the buddhas, three is protected by non-people, four hears the teaching and never forgets it, five he hears a teaching he hasn't heard before, six he attains superior wisdom, seven he attains various kinds of concentration, eight he never experiences illness, nine he gets a peaceful meal, and 10 he becomes as flexible as Upapuṇḍarīka.",
        "source": "T15n0640_001:0620c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0620c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為精進行菩薩十事。」",
        "translation": "These are the ten things that bodhisattvas do when they're diligent.\"",
        "source": "T15n0640_001:0620c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈曰：「常為得有威神，　　終不轉犯諸惡；　諸非人悉護之，　　即疾得成佛道。",
        "translation": "The Buddha then spoke this verse, \"Always attaining authority, they never turn to transgress evil; these non-persons all protect them, and they quickly achieve the Buddha Way.",
        "source": "T15n0640_001:0620c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞經法亦不忘，　　未聞者求得了；　其人即得高明，　　精進者有是德。",
        "translation": "Even when they hear the sūtras and teachings, they don't forget them, and those who haven't heard them yet seek to understand them; they then attain great insight, and this is the virtue of those who make effort.",
        "source": "T15n0640_001:0620c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得同諸三昧行，　　終無有疾病時；　精進者智慧俱，　　其人得佛道行。",
        "translation": "Attaining the same samādhi practices, there's never a time of illness; the diligent one's wisdom is shared, and he attains the practice of the Buddha Way.",
        "source": "T15n0640_001:0620c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所飯食得安隱，　　即得為精進行；　譬如優鉢在水，　　稍稍長而大成。",
        "translation": "Attaining peace with what he eats, he then attains diligence, like a superior bowl in water that grows a little and becomes large.",
        "source": "T15n0640_001:0620c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　清白法亦如是，　　令菩薩稍稍成；　終無有能當者，　　得在天安樂處。",
        "translation": "So it is with the pure Dharma, which causes a bodhisattva to achieve it momentarily; eventually, there's no one who can handle it, and he'll be able to live in the heavens in a peaceful place.",
        "source": "T15n0640_001:0620c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多陀竭精進行，　　以進越無數劫；　諸菩薩勤力行，　　所修奉悉說之。",
        "translation": "Tathāgata exerts himself to advance beyond measureless eons, and the bodhisattvas diligently practice and teach what they've cultivated.",
        "source": "T15n0640_001:0621a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其精進者有威神，　　常為諸佛所擁護；　而皆奉受是道行，　　其人得佛道不久。",
        "translation": "Those who exert themselves have a dignified presence that's always guarded by the buddhas, and they all accept this practice as the path, and it won't be long before they attain the Buddha Way.",
        "source": "T15n0640_001:0621a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所聞者終不復忘，　　及復得餘眾法行；　其人智慧稍增益，　　精進行者有是事。",
        "translation": "He never forgets what he's heard, and he attains the practice of many other things; his wisdom slightly increases, and this is what happens to those who diligently practice.",
        "source": "T15n0640_001:0621a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種三昧常自增，　　彼終無有疾病時；　諸所可飯食之者，　　一切得則為安隱。",
        "translation": "Their various samādhis always increase on their own, and when they end up there's no illness; they attain peace with whatever food they can eat.",
        "source": "T15n0640_001:0621a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　晝夜成就清白行，　　精進之者無有休；　其人不久疾得佛，　　行精進者尊如是。」",
        "translation": "They accomplish pure practices day and night, and there's no rest for those who exert themselves; soon they'll attain Buddhahood, honored as such by those who practice exertion.\"",
        "source": "T15n0640_001:0621a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「坐禪菩薩有十事行。",
        "translation": "The Buddha told the boy, \"There are ten things that a sitting meditation bodhisattva does.",
        "source": "T15n0640_001:0621a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0621a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者專行住，二者行道事，三者無有恐難，四者諦正諸根，五者為人所愛，六者遠離欲，七者不轉一心，八者脫於魔界，九者住佛界，十者得解脫。",
        "translation": "One abides exclusively in practice, two does the work of the path, three has no fears or difficulties, four is true to the faculties, five is loved by others, six is free of desire, seven doesn't change from one mind, eight escapes the realm of Māra, nine abides in the realm of the Buddha, and 10 attains liberation.",
        "source": "T15n0640_001:0621a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0621a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為坐禪菩薩十事行。」",
        "translation": "These are the ten things a sitting meditation bodhisattva does.\"",
        "source": "T15n0640_001:0621a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「其人不轉所行，　　即為住諦之行；　專行諸道之事，　　其人捨不正行。",
        "translation": "The Buddha then spoke this verse, \"That person doesn't change what they do, which is to abide in the practice of the truth; they focus on the practices of the path, and they abandon incorrect practices.",
        "source": "T15n0640_001:0621a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所修無所復著，　　諸根已為寂定；　即為得安隱喜，　　坐思惟道行事。",
        "translation": "With no further attachment to what's cultivated, his faculties are calm and concentrated, and he sits and reflects on the conduct of the path in order to attain peaceful joy.",
        "source": "T15n0640_001:0621a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人已離愛欲，　　安隱坐於一心；　以遠離魔境界，　　即住於佛境界。",
        "translation": "That person is free of craving and sits calmly in a unified mind, which is free of the demonic realm and abides in the Buddha realm.",
        "source": "T15n0640_001:0621a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　專行者有是持，　　其獨樂樹間者；　即便解脫之行，　　便成得十事句。",
        "translation": "This is the way a dedicated practitioner maintains that person's solitude among trees, even as he practices liberation, and then he attains the ten-part syllogism.",
        "source": "T15n0640_001:0621a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其菩薩住轉不行，　　皆棄捐於不當行；　棄不正行樂正行，　　念三昧者有是事。",
        "translation": "That bodhisattva abides in turning and not turning, abandoning improper actions and delighting in right actions, and this is what happens to those who are mindful of samādhi.",
        "source": "T15n0640_001:0621a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人終無貪著時，　　行安隱者賢不貪；　身意善覺而持戒，　　行三昧者有是事。",
        "translation": "When a person is ultimately free of craving, he practices tranquility, and he's good and not craving; his body and mind are well-aware and he observes precepts, and this is what he does when he practices samādhi.",
        "source": "T15n0640_001:0621a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行空樹間無所畏，　　其人終無著貪時；　諸非人皆愛念之，　　如是遠離欲獨行。",
        "translation": "When he walks among the trees in the sky and has no fear, he never becomes attached to craving; all those who are not human beings long for him, thus secluded from desire, he walks alone.",
        "source": "T15n0640_001:0621a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　終不著欲亦不貪，　　如是即脫魔境界；　便住於如來境界，　　其人解脫邪事竟。」",
        "translation": "Never clinging to desires or craving, he's freed from the demonic realm; he then abides in the Tathāgata's realm, and he's liberated from wrongdoing.\"",
        "source": "T15n0640_001:0621b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩行般若波羅蜜有十事。",
        "translation": "The Buddha said to the boy, \"There are ten things that a bodhisattva does when practicing prajñā-pāramit.",
        "source": "T15n0640_001:0621b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0621b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者一切所有悉布施，無所希望；二者不復犯戒，不以戒自綺；三者住忍辱力無人想住；四者行精進不貪身命；五者行禪不住禪；六者降伏弊魔；七者九十六種外道不能動之；八者自得知生死；九者於眾生有悲意；十者不求弟子、緣一覺地。",
        "translation": "One gives alms to all that he has, hoping for nothing; two, he never again violates the precepts and doesn't take them upon himself; three, he abides in the power of forbearance without conception of others; four, he practices zeal and doesn't crave body and life; five, he practices meditation and doesn't abide in meditation; six, he subdues harmful demons; seven, he can't be touched by the 96 kinds of non-Buddhists; eight, he knows birth and death for himself; nine, he has compassion for sentient beings; and ten, he doesn't seek disciples or take the ground of the single enlightenment as refuge.",
        "source": "T15n0640_001:0621b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0621b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩行般若波羅蜜十事。」",
        "translation": "These are the ten things a bodhisattva does when practicing prajñā-pāramitā.\"",
        "source": "T15n0640_001:0621b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「其人所施皆等，　　亦不念望其報；　護經戒不敢犯，　　亦不有想著求。",
        "translation": "The Buddha then spoke this verse, \"That person's gifts are equal, and they don't think about their rewards; they guard the sūtras and precepts, don't dare to violate them, and don't have any thoughts or attachments about them.",
        "source": "T15n0640_001:0621b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行忍辱及智慧，　　終無有人之想；　見人即有精進，　　身志意無所著。",
        "translation": "Practicing forbearance and wisdom, he never has thoughts about people; he makes effort when he sees people, and he has no attachment to body, mind, or thought.",
        "source": "T15n0640_001:0621b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行一心及智慧，　　無所住無有想；　以降伏於眾魔，　　智慧者有是德。",
        "translation": "He practices single-mindedness and wisdom, abiding in nothing and conceptualizing nothing, in order to subdue Māra, which is a virtue possessed by wisdom.",
        "source": "T15n0640_001:0621b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　九十六種之道，　　皆無能動搖者；　得知了生死事，　　智慧者有是事。",
        "translation": "There are 96 paths, none of which can be shaken, and he has the knowledge to understand the matter of birth and death, which is the case with the wise one.",
        "source": "T15n0640_001:0621b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於一切眾生所，　　有大悲哀之行；　於弟子緣一覺，　　皆不念所求行。",
        "translation": "He has deeds of great compassion for all sentient beings, and he's a disciple who takes the single awakening as object and doesn't think about the deeds he seeks.",
        "source": "T15n0640_001:0621b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有皆施無希望，　　為不犯戒不念惡；　行忍辱者無人想，　　奉智慧者有是事。",
        "translation": "He gives everything without hope, so that he doesn't violate the precepts and doesn't think of evil; he practices forbearance without conceptions of others, and this is what happens to those who are committed to wisdom.",
        "source": "T15n0640_001:0621b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　精進為在空閑處，　　禪無有想亦無住；　其人智慧降伏魔，　　行智慧者有是事。",
        "translation": "Their effort is to stay in a lonely place, their meditation has no thoughts and no abiding, and their wisdom subdues Māra, and this is what happens to those who practice wisdom.",
        "source": "T15n0640_001:0621b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸外道者不能動，　　其人即為知生死；　於眾人民有哀傷，　　行智慧者有是事。",
        "translation": "Those who are outside the Way can't be moved, but that person knows birth and death; they have sorrow for the people, and this is what happens to those who practice wisdom.",
        "source": "T15n0640_001:0621b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸弟子及緣一覺，　　於彼終無念求索；　其人住佛道如是，　　行智慧者有是事。」",
        "translation": "Those disciples and those who take the single awakening as condition, who never think or seek after it, abide in the Buddha Way like this, and those who practice wisdom have these things.\"",
        "source": "T15n0640_001:0621b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「多智菩薩有十事行。",
        "translation": "The Buddha said to the boy, \"There are ten things that the Bodhisattva of Wisdom has done.",
        "source": "T15n0640_001:0621c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0621c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者知惡道，二者知善道，三者解疑事，四者為現直道，五者棄捐惡道，六者住正道，七者在甘露門，八者得坐佛樹下，九者為人民現明道，十者不畏惡道。",
        "translation": "One knows the evil path, two knows the good path, three understands matters of doubt, four makes manifest the straight path, five abandons the evil path, six abides in the right path, seven is at the gate of ambrosia, eight gets to sit under the Buddha tree, nine makes manifest the path of insight for the people, and ten isn't afraid of the evil path.",
        "source": "T15n0640_001:0621c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0621c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為多智菩薩十事行。」",
        "translation": "These are the ten things that a bodhisattva of abundant wisdom does.\"",
        "source": "T15n0640_001:0621c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「為知了諸塵勞，　　悉曉了是兩事；　其人便棄塵勞，　　即隨佛道之行。",
        "translation": "The Buddha then spoke this verse, \"In order to know and understand the toil of the dust, he fully understands these two things; that person then discards the dust and toil and follows the course of the Buddha's path.",
        "source": "T15n0640_001:0621c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慧而解諸狐疑，　　便為現直見事；　則棄捐惡道行，　　即得在於正道。",
        "translation": "Wisely, he understands the misgivings and doubts, and then he directly sees what's going on; abandoning the practice of bad paths, he'll be on the right path.",
        "source": "T15n0640_001:0621c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見在於甘露門，　　則得坐佛樹下；　為人民解現正，　　令不畏諸惡道。",
        "translation": "Seeing it through the ambrosial gate, they'll be able to sit under the Buddha's tree, explain what's right for the people, and cause them not to fear the bad paths.",
        "source": "T15n0640_001:0621c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　曉了無數塵勞法，　　知解兩事為如是；　其人便棄捐塵勞，　　便於彼學上善法。",
        "translation": "He understands the countless ways of worldly suffering and knows and understands that these two things are like this; then he abandons worldly suffering and trains in the higher path.",
        "source": "T15n0640_001:0621c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為一切人解其疑，　　便為得見善正直；　即棄捐去惡道事，　　其多智常在道住。",
        "translation": "He resolves their doubts for all people, and then he attains a vision of what's good and right; that's when he abandons the task of leaving the bad path, and his abundant knowledge always abides in the path.",
        "source": "T15n0640_001:0621c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常為住在甘露門，　　得坐在無量佛樹；　為無量億人現明，　　其人終不畏惡道。」",
        "translation": "Always abiding at the gate of ambrosia, he'll be able to sit on measureless buddha trees and show insight to measureless millions of people, so that they'll never fear the evil path.\"",
        "source": "T15n0640_001:0621c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩尊法施持法與他人者有十事。",
        "translation": "The Buddha told the boy, \"There are ten things that a bodhisattva does when he honors the Dharma and bestows it on others.",
        "source": "T15n0640_001:0621c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0621c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者棄捐惡，二者奉行善，三者修正士，四者淨其佛剎，五者坐佛樹下，六者布施眾用，七者降伏諸塵勞，八者與一切人智，九者行慈心，十者現在得安隱意。",
        "translation": "One discards evil, two practices goodness, three cultivates goodness, four purifies his buddha-stage, five sits under a buddha-tree, six gives alms for many uses, seven subdues worldly sufferings, eight provides wisdom to all people, nine acts with kindness, and ten attains a peaceful state of mind now.",
        "source": "T15n0640_001:0621c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0621c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩持尊法施十事以法施與他人者。」",
        "translation": "This is a bodhisattva who upholds the ten rules for giving respectfully to the Dharma and gives the Dharma to others.\"",
        "source": "T15n0640_001:0621c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「諸不善皆捐之，　　諸善事悉奉行；　得在住法智慧，　　意常好喜布施。",
        "translation": "The Buddha then spoke this verse, saying, \"Donate all unskillful things and perform all good deeds; attain abiding wisdom in the Dharma, and your mind always delights in generosity.",
        "source": "T15n0640_001:0621c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便淨其佛國土，　　即得無上之國；　便則坐佛樹下，　　興法施譬如寶。",
        "translation": "They then purify their buddha land and attain a peerless country; they then sit under a buddha tree and produce such treasures as the Dharma gift.",
        "source": "T15n0640_001:0621c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　布施一切所有，　　便學於諸法王；　則遠除諸塵勞，　　其人得佛不難。",
        "translation": "When he gives generously to all that he has, he trains with the king of the Dharma, and he is free of the dust and trouble that makes it easy for him to attain Buddhahood.",
        "source": "T15n0640_001:0622a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　布施於一切人，　　常有慈心之行；　其無有嫉妬行，　　為安隱諸非人。",
        "translation": "He gives generously to all people, always behaves with kindness, has no jealousy, and secures his actions from those who are wrong.",
        "source": "T15n0640_001:0622a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多智便棄諸不善，　　其人常為在善住；　於尊法堅不可動，　　其多智者常與法。",
        "translation": "Being full of wisdom, he discards unwholesome qualities, always abiding in goodness; his honored principles are resolute and unshakeable, and he's always knowledgeable about the principles.",
        "source": "T15n0640_001:0622a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即常得清淨之國，　　常奉行佛道之事；　為常得在佛樹下，　　興法施者有是事。",
        "translation": "That is, he always attains a pure land, always practices the works of the Buddha's path, and always gets under the Buddha's tree in order to produce such things as gifts of the Dharma.",
        "source": "T15n0640_001:0622a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無有塵勞布施眾，　　便即知了己身事；　皆解脫諸世之事，　　其人終無所罣礙。",
        "translation": "Without the dust of toil, he gives to many people, knowing his own personal affairs; they are all liberated from worldly affairs, and he is ultimately unimpeded.",
        "source": "T15n0640_001:0622a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人自知而發意，　　為一切人如是施；　有慈心者無嫉妬，　　見諸法安無有我。」",
        "translation": "Knowing this, he generates the intention to give thus to all people; being compassionate, he's not jealous, and he sees that all dharmas are secure and lack self.\"",
        "source": "T15n0640_001:0622a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩行空有十事。",
        "translation": "The Buddha told the boy, \"There are ten things that bodhisattvas do when they practice emptiness.",
        "source": "T15n0640_001:0622a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0622a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者行佛道，二者無所著行，三者不願所生，四者不犯戒法，五者不誹謗賢者，六者不為諍行，七者無所得，八者獨行道，九者不諍佛，十者受法行。",
        "translation": "One practices the Buddha's way, two practices without attachment, three doesn't wish to be born, four doesn't violate the precepts, five doesn't denigrate good men, six doesn't engage in disputing behavior, seven has nothing to gain, eight practices alone, nine doesn't dispute the Buddha, and 10 engages in the practice of the Dharma.",
        "source": "T15n0640_001:0622a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0622a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩行十空事。」",
        "translation": "These are the ten things of emptiness practiced by bodhisattvas.\"",
        "source": "T15n0640_001:0622a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「其諸上人所行，　　得上尊之世界；　勇猛者於彼行，　　諸所不可得命。",
        "translation": "The Buddha then spoke this verse, saying, \"They are the activities of the most noble person who has attained the most honored world; a brave person does those things, and their life is unobtainable.",
        "source": "T15n0640_001:0622a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆不著諸世界，　　於禪思安隱坐；　亦不願諸所生，　　便曉知諸空法。",
        "translation": "They don't cling to any worlds, sit quietly in meditation, and don't wish for anything to arise, so they can understand the teachings of emptiness.",
        "source": "T15n0640_001:0622a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　終不復犯戒法，　　持於戒無有呵；　其盡壽不說惡，　　不誹謗餘賢者。",
        "translation": "They never again violate the precepts, maintain the precepts without criticism, don't speak ill of others for the rest of their lives, and don't denigrate other good men.",
        "source": "T15n0640_001:0622a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其行道無所諍，　　終無有諸諍訟；　其便知諸所事，　　彼如法而習行。",
        "translation": "Their practice has no quarrels, and they never have quarrels; they then know the tasks that are to be performed, and they practice them according to the teaching.",
        "source": "T15n0640_001:0622a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至亡失其命，　　終不謗於世尊；　積累於一切法，　　自保意無所畏。",
        "translation": "Even when he loses his life, he never denigrates the Bhagavān; he accumulates all the teachings, and he protects his own mind without fear.",
        "source": "T15n0640_001:0622a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於一切諸世界，　　佛道不可思議；　即奉持諸佛法，　　不復疑於空法。",
        "translation": "In all the worlds, the Buddha's path is unfathomable, so he consecrates the Buddha's teaching and doesn't again doubt the empty teaching.",
        "source": "T15n0640_001:0622a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人之行而上妙，　　住不在於諸外道；　行禪安隱無所著，　　諸所無命亦無人。",
        "translation": "That person's practice is so sublime that they don't reside above those of non-Buddhists, their practice of meditation is peaceful and unattached, and there's no life in any place, nor is there anyone else.",
        "source": "T15n0640_001:0622b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人終無有貪著，　　行一心者無所想；　以知無人無我法，　　終復無有於所願。",
        "translation": "He'll never have craving for anything, and he'll practice single-mindedness with no conceptions; knowing that there's no person or self, he'll never have anything he wishes for.",
        "source": "T15n0640_001:0622b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉曉諸空之法事，　　於眾所用終不著；　其人終無貪著念，　　於佛常有淨信意。",
        "translation": "He fully understands the principles of emptiness and never attaches to the uses of others; he's never attached to craving, and he always has pure faith in the Buddha.",
        "source": "T15n0640_001:0622b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人終無諍訟事，　　獨處行者空眾用；　其人為住於佛道，　　便持如來諸所法。」",
        "translation": "He'll never have a dispute, and he'll practice alone in the emptiness of many functions; in order to abide in the Buddha Way, he'll maintain the Tathāgata's teachings.\"",
        "source": "T15n0640_001:0622b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩在獨處行有十事。",
        "translation": "The Buddha told the boy, \"There are ten things that a bodhisattva does when he's practicing alone.",
        "source": "T15n0640_001:0622b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0622b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者有清淨意，二者無有欲，三者念諸佛，四者信行，五者不疑慧，六者有反復於諸佛，七者不誹謗法，八者寂寞行，九者得調住，十者智四解事。",
        "translation": "One has a pure mind, two has no desire, three is mindful of the buddhas, four is faithful in practice, five doesn't doubt wisdom, six has reversion to the buddhas, seven doesn't denigrate the Dharma, eight practices in solitude, nine attains a peaceful abode, and ten has knowledge of the four liberating factors.",
        "source": "T15n0640_001:0622b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0622b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩獨處行十事。」",
        "translation": "These are the ten things a bodhisattva does when he's alone.\"",
        "source": "T15n0640_001:0622b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「終無有愛欲行，　　常有清淨之意；　便奉無所欲事，　　於獨處一心行。",
        "translation": "The Buddha then spoke this verse, \"Never acting with craving, always with a pure mind, they devote themselves to no desires and conduct themselves with a single mind in solitude.",
        "source": "T15n0640_001:0622b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　思念普世間明，　　其人轉而成信；　於智慧一無疑，　　佛慧不可思議。",
        "translation": "Thinking of the universal clarity of the world, that person is transformed into a believer; in their wisdom there's no doubt, and the Buddha's wisdom is unfathomable.",
        "source": "T15n0640_001:0622b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於諸佛有反復，　　佛終不棄捐法；　即而作寂定行，　　便為住於寂法。",
        "translation": "After some reactions to the buddhas, the Buddha never abandons the donation of the Dharma; he then performs the practice of quiescent concentration, and this is how he abides in the quiescent Dharma.",
        "source": "T15n0640_001:0622b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人即得解事，　　獨自樂於樹間；　便棄捐於財利，　　在一處而行道。",
        "translation": "That person then attains understanding of concrete matters, takes pleasure in being alone among the trees, discards possessions and profits, and practices the path in one place.",
        "source": "T15n0640_001:0622b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人即為有清意，　　常皆棄捐諸惡事；　其人行寂無有上，　　終不復疑諸佛慧。",
        "translation": "That person then has a clear consciousness, always discarding bad things; their practice is quiescent and unsurpassed, and they never again doubt the Buddha's wisdom.",
        "source": "T15n0640_001:0622b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其人思念佛無上，　　信於諸天中天行；　亦不復疑諸佛慧，　　寂寞行者有是事。",
        "translation": "That person contemplates the Buddha's unsurpassedness, believes in the practice of gods among gods, and doesn't again doubt the Buddha's wisdom, which is the case with lonely practitioners.",
        "source": "T15n0640_001:0622b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於諸上人有反復，　　終不復棄諸法行；　獨處行者而寂寞，　　閑處行者有是事。",
        "translation": "He'll never again abandon the practice of the Dharma; he'll be lonely when he's practicing alone, and he'll have this effect when he's practicing in a lonely place.",
        "source": "T15n0640_001:0622b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便得善諦寂寞地，　　即疾解了諸證事；　常解說無央數經，　　其人無有罣礙時。」",
        "translation": "He then attains the lonely stage of good truths and quickly understands the things he's realized; he always explains incalculable sūtras, and when he does, he has no obstructions.\"",
        "source": "T15n0640_001:0622c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩在閑處行有十事。",
        "translation": "The Buddha said to the boy, \"There are ten things that bodhisattvas do when they walk in a lonely place.",
        "source": "T15n0640_001:0622c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0622c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者寂行，二者遠離眾人，三者無諍訟，四者無瞋恚，五者不入諸行，六者不入人罪，七者念解脫事，八者安隱一心行，九者疾作證解脫，十者以無所著故得三昧。",
        "translation": "One is practicing tranquility, two is secluded from multitudes, three is without strife, four is without anger, five doesn't enter into practices, six doesn't enter into human transgressions, seven is mindful of the things that liberate him, eight is peaceful and single-minded in his actions, nine is quick to realize liberation, and ten attains samādhi because he's not attached to anything.",
        "source": "T15n0640_001:0622c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0622c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩閑處尊行十事。」",
        "translation": "These are the ten things a bodhisattva does when he's at ease and honored.\"",
        "source": "T15n0640_001:0622c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「常有寂寞之事，　　便遠離眾會人；　終無有諍訟時，　　而獨自作於行。",
        "translation": "The Buddha then spoke this verse, \"Always lonely in these things, they seclude themselves from people in congregations; they never engage in disputes and conduct themselves alone.",
        "source": "T15n0640_001:0622c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常無有瞋恚意，　　終不轉著諸界；　亦不復作諍訟，　　在閑處是有德。",
        "translation": "He's always free of anger, never becomes attached to the elements, never engages in another argument, and has virtue in a lonely place.",
        "source": "T15n0640_001:0622c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便為寂寞之行，　　常在於獨處行；　即有解脫之事，　　便疾得過度去。",
        "translation": "He then takes up a lonely practice, always walking in solitude, which brings about liberation, and he quickly passes away.",
        "source": "T15n0640_001:0622c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　獨自在上閑處坐，　　常棄捐惡眾會人；　其人終不入人罪，　　樹間坐者有是事。",
        "translation": "Sitting alone in a lonely place, he always abandons the evil assembly of people; he never enters into human error, and this is what happens to those who sit among trees.",
        "source": "T15n0640_001:0622c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便厭於一切生死，　　其人無有貪眾用；　亦不有眾畏之事，　　在樹下坐有是事。",
        "translation": "He's disillusioned with all birth and death, doesn't crave many things, and doesn't have many fears, but he has these things while sitting under a tree.",
        "source": "T15n0640_001:0622c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　終不與人共諍訟，　　常獨行者樂寂寞；　常護守於身口意，　　其在閑處德無數。",
        "translation": "He'll never fight with others, and he'll always walk alone, enjoying solitude. He'll always guard his body, speech, and mind, and his virtues in a peaceful place will be countless.",
        "source": "T15n0640_001:0622c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便得上妙解脫事，　　即好坐在寂三昧；　其於樹間習寂行，　　在閑處者有是德。」",
        "translation": "He then attains the most marvelous thing of liberation, which is to sit well in the concentration of quiescence; he cultivates the practice of quiescence among trees, and these are the virtues of those who live in a quiet place.\"",
        "source": "T15n0640_001:0622c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語童子：「菩薩行分衛有十事。",
        "translation": "The Buddha told the boy, \"There are ten things that a bodhisattva does as part of his practice and guard.",
        "source": "T15n0640_001:0622c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0640_001:0622c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者不欲令知其行；二者不令人知其功德；三者不欲有財利；四者不有自稱亦無諛諂；五者在賢聖道住；六者不自說功德；七者不從他人取足；八者至他家舍亦不喜亦不憂；九者離衣食施，持法施與人；十者住令德無諛諂，皆取於其法施。",
        "translation": "One doesn't want his conduct to be known; two, he doesn't want people to know about his virtue; three, he doesn't want wealth or profit; four, he doesn't claim to have it and doesn't flatter; five, he abides on the noble path; six, he doesn't reveal his own virtue; seven, he doesn't take enough from others; eight, he doesn't rejoice or grieve when he goes to another's house; nine, he gives away food and clothing and maintains the Dharma as an offering to others; and ten, he abides so that virtue and flattery don't prevail, and he takes refuge in the Dharma as his offering.",
        "source": "T15n0640_001:0622c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0640_001:0622c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩行分衛住十事，令德無諛諂。」",
        "translation": "These are the ten things that a bodhisattva does to guard his practice and keep virtue from flattery.\"",
        "source": "T15n0640_001:0622c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於是說偈言：「彼不欲令知行，　　亦不著所為事；　利無利而等意，　　其人住於教令。",
        "translation": "The Buddha then spoke this verse, \"Not wanting to make their actions known, they don't cling to the things they do; with the same intention of benefiting or not benefiting, they abide in teaching and instructing.",
        "source": "T15n0640_001:0623a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦不犯賢聖事，　　不有稱諛諂行；　亦不自說其善，　　復不說他人惡。",
        "translation": "He doesn't transgress noble things or engage in flattery; he doesn't praise his own goodness and doesn't praise the badness of others.",
        "source": "T15n0640_001:0623a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦不愁不歡喜，　　說法離於衣食；　所說皆令歡喜，　　分衛者有是德。",
        "translation": "Not grieving or displeased, he explains the teaching apart from clothing and food; whatever he says makes him rejoice, and he shares this virtue with the guardian.",
        "source": "T15n0640_001:0623a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不欲令稱不求名，　　常住在四賢聖行；　亦無諛諂求財利，　　受教令者有是事。",
        "translation": "He doesn't want to be praised or seek fame, but he abides in the four noble practices, and he doesn't flatter or seek gain, so that those who are taught and instructed have these things.",
        "source": "T15n0640_001:0623a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不自稱譽不說惡，　　初不說惡惡舌者；　聞人功德常歡喜，　　其分衛者知止足。",
        "translation": "He doesn't praise himself or speak ill of himself, and he doesn't speak ill of those who speak harshly of the tongue in the first place; always rejoicing in the merits of others, he knows the limits of his partisanship.",
        "source": "T15n0640_001:0623a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離衣食善與法施，　　亦不求索於財利；　所說善人皆歡喜，　　受尊教者有是事。」",
        "translation": "He parts with good gifts of food and clothing and the Dharma, and he doesn't seek wealth or profit; those who speak well are delighted, and those who accept the teaching are thus.\"",
        "source": "T15n0640_001:0623a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是經時，七萬二千人發無上正真道，萬菩薩得無所從生法忍。",
        "translation": "When the Buddha spoke this sūtra, 72,000 people aroused the unsurpassed true path, and 10,000 bodhisattvas attained the forbearance of the Dharma that arises from nothing.",
        "source": "T15n0640_001:0623a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是，文殊師利童子，及一切眾會天龍世間人皆歡喜，前為佛作禮而去。",
        "translation": "When the Buddha said this, Mañjuśrī the boy and all the congregation of gods, dragons, and worldlings rejoiced, paid homage to the Buddha, and departed.",
        "source": "T15n0640_001:0623a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說月燈三昧經一卷",
        "translation": "Foshuo yue deng sanmei jing yiqie",
        "source": "T15n0640_001:0623a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是丹藏《月燈三昧經》先公譯者，而與彼鄉宋二藏之經，文義逈異，未知孰是？",
        "translation": "This is the translation of the Yuehdeng sanmei jing of the Tanzang by the late Duguang, but its text and meaning differ radically from those of the two collections of the Xiang and Song, so I wonder which one is the correct one?",
        "source": "T15n0640_001:0623a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "按《開元錄》，此經有二別譯：一於有譯無本中，有後漢安世高譯一卷；二於有譯有本中，有宋沙門先公譯一卷。",
        "translation": "According to the Kaiyuan lu, there are two separate translations of this sūtra: one in which there is a translation without a text by An Shigao of the later Han Dynasty, and the other in which there is a translation with a text by Xian Gong, a Song ascetic.",
        "source": "T15n0640_001:0623a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆云：「出《大月燈經》第七卷」。",
        "translation": "They both say, \"From the seventh volume of the Sutra of the Candragupta Lamp.\"",
        "source": "T15n0640_001:0623a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其先公譯目下，注云：「一名文殊師利菩薩十事行經」；又指多小，云：「一十紙」。",
        "translation": "Under the heading of the first of these translations, the commentary reads, 'A scripture on the ten practices of Mañjuśrī Bodhisattva'; it also refers to a number of smaller ones and reads, 'One ten-page scripture'.",
        "source": "T15n0640_001:0623a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今撿此丹本經，始從六度乃至分衛，凡歷十二法，皆以十事說之；又其多小，是古之十紙有十二行，則知真是先公所譯《月燈經》矣！",
        "translation": "Now, when we examine this Danben jing, from the six perfections up to Fenwei, where twelve things are experienced, they are all explained in terms of ten affairs; and since it's so numerous and small, it's an ancient ten-page scripture with twelve lines, so we know that it's really the Yue Deng jing translated by Mr. Shang!",
        "source": "T15n0640_001:0623a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但錄云：「出大經第七卷」，而今撿之，出自第六卷之前半，斯為未叶。",
        "translation": "But the record says, \"From the seventh roll of the Mahāyāna sūtras,\" and now we find that it's from the first half of the sixth roll, which is before leaves.",
        "source": "T15n0640_001:0623a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疑古今分卷有異？",
        "translation": "I wonder if there's a difference between the ancient and modern versions of the sutra.",
        "source": "T15n0640_001:0623b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或書寫錯六為七耳！",
        "translation": "Perhaps six is written down incorrectly as seven!",
        "source": "T15n0640_001:0623b02_0",
        "is_bad_quality": false
    }
]