[
    {
        "source_sentence": "月燈三昧經卷第七",
        "translation": "Moon Lamp Samādhi Sutra, Vol. 7",
        "source": "T15n0639_007:0591a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高齊天竺三藏那連提耶舍譯",
        "translation": "A Translation of the Sanskrit Tripiṭaka of Nālandī Yeshiva by Gaoqi Tianzang",
        "source": "T15n0639_007:0591a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_007:0591a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩應常樂修神通本業。",
        "translation": "\"Suppose a bodhisattva-mahāsattva should always delight in cultivating the original act of supernormal powers.",
        "source": "T15n0639_007:0591a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩大神通本業？",
        "translation": "What is the bodhisattva-mahāsattva's great innate activity of supernormal powers?",
        "source": "T15n0639_007:0591a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂攝一切善法，不取戒聚、不著定聚，於智慧聚亦不戲論、於解脫解脫知見之聚亦不取著。",
        "translation": "That is, he collects all good qualities, doesn't cling to the precepts as a group, doesn't attach to the concentration as a group, doesn't engage in debate about the wisdom as a group, and doesn't cling to the knowledge and vision of liberation and liberation as a group.",
        "source": "T15n0639_007:0591a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_007:0591a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩大神通本業。",
        "translation": "\"This is the bodhisattva Mahāsattva's original act of great supernormal powers.",
        "source": "T15n0639_007:0591a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就神通本業得大神通者，菩薩摩訶薩於一切變現自在，便能為一切眾生說法。",
        "translation": "If he accomplishes this activity of supernormal powers and attains great supernormal powers, the bodhisattva Mahāsattva is at ease in all manifestations and can then teach all sentient beings.",
        "source": "T15n0639_007:0591a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝大乘故，是菩薩於此大神通本業應常修學。」",
        "translation": "For the sake of collecting the great vehicle, this is the kind of great principal activity of supernormal powers that bodhisattvas should always cultivate.\"",
        "source": "T15n0639_007:0591a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「神通本勝業，　　顯示無果報；　悕果修諸行，　　取我想不除。",
        "translation": "It was then that the Bhagavān spoke this verse, \"The originally excellent karma of supernormal powers shows that there's no fruitful result; they cultivate practices that seek fruitfulness, and their conception of attachment to self isn't removed.",
        "source": "T15n0639_007:0591a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所言神通者，　　佛智不思議；　若住取著者，　　彼人無智慧。",
        "translation": "This so-called superknowledge is inconceivable in terms of the Buddha's wisdom; if someone abides in attachment, they lack wisdom.",
        "source": "T15n0639_007:0591a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不思議諸法，　　音聲而顯示，　若執於音聲，　　不達方便說。",
        "translation": "He doesn't contemplate qualities that are revealed by sound, and if he clings to sound, he doesn't understand the teaching of the teaching.",
        "source": "T15n0639_007:0591a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不曉方便教，　　靡知方便說，　非法說為法，　　於法寧覺了？",
        "translation": "　不曉方便教，　　靡知方便說，　非法說為法，　　於法寧覺了？",
        "source": "T15n0639_007:0591b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三千世界中，　　我時說諸經，　義一種種味，　　彼悉不可說。",
        "translation": "\"Among the 3,000 worlds, I've taught sūtras that have a variety of meanings and flavors that are inexplicable.",
        "source": "T15n0639_007:0591b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有十方佛，　　顯說無量法，　諦思一句義，　　便則一切解。",
        "translation": "All the buddhas of the ten directions reveal an infinite number of teachings, and when you truly consider the meaning of a single sentence, you understand them all.",
        "source": "T15n0639_007:0591b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切法無我，　　若人學此義，　彼時習一句，　　悟佛法不難。",
        "translation": "All dharmas are without self, so if someone studies this meaning and then cultivates one phrase, it's not difficult to realize the Buddha's teaching.",
        "source": "T15n0639_007:0591b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法是佛法，　　若人學此法，　如法而解了，　　便順於空法。",
        "translation": "All dharmas are Buddha dharmas, and if a person learns them and understands them according to the teaching, they then conform to the teaching of emptiness.",
        "source": "T15n0639_007:0591b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸語是佛語，　　一切聲事無，　遍於十方求，　　佛語不可得。",
        "translation": "The words are the words of the Buddha, and they're all sounds and things that are without, so they're unobtainable when sought in the ten directions.",
        "source": "T15n0639_007:0591b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛語最第一、　　佛語無過上，　微細事悉無，　　是為語最上。",
        "translation": "The Buddha's words are the most excellent, the Buddha's words are unsurpassed, and the smallest things are all absent; this is the most excellent of all words.",
        "source": "T15n0639_007:0591b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼法最無上，　　顯現不斷絕，　無得微塵許，　　諸佛之所說。",
        "translation": "That teaching is the most unsurpassed, its manifestation is unceasing and uninterrupted, and there's not a single particle of it that's permitted, which is explained by the buddhas.",
        "source": "T15n0639_007:0591b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法不可得、　　無有法可證，　如是知於法，　　能解佛菩提。",
        "translation": "All dharmas are unobtainable, and there's no dharma to realize; knowing the dharma this way, they can understand the buddhas' enlightenment.",
        "source": "T15n0639_007:0591b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼若悟此法，　　便轉於法輪；　轉於法輪時，　　則暢勝甘露。",
        "translation": "If he understands this teaching, he'll turn the Dharma wheel, and when he turns the Dharma wheel, he'll be able to drink the excellent nectar.",
        "source": "T15n0639_007:0591b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩能解了，　　無上佛菩提，　得為無等尊，　　令他悟佛智。",
        "translation": "A bodhisattva who understands the unsurpassed buddha's enlightenment becomes an unequalled honored one, causing others to realize the Buddha's wisdom.",
        "source": "T15n0639_007:0591b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無修及無願、　　無相謂與空，　如斯四種門，　　佛說為解脫。",
        "translation": "These four approaches of no cultivation, no desire, and the absence of marks and emptiness are described by the Buddha as liberation.",
        "source": "T15n0639_007:0591b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眼、耳及鼻、舌、　　身、意諸根等，　此皆體性空，　　憍陳最初見。",
        "translation": "The eyes, ears, nose, tongue, body, and mental faculties are all empty in essence, as Kauṇḍinya first saw.",
        "source": "T15n0639_007:0591b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能於此法，　　如實知體性，　諍論彼便無，　　了達法相故。",
        "translation": "If someone can truly know the essence of these things, then arguments about them will cease, and they'll comprehend the characteristics of the Dharma.",
        "source": "T15n0639_007:0591b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂勇猛境界，　　菩薩救護者，　悉無有疑惑，　　了法體空故。",
        "translation": "It's called the realm of courage, and the bodhisattva's protector is free of doubt and confusion because he understands the essential emptiness of dharmas.",
        "source": "T15n0639_007:0591c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能達諸法性，　　故得名為佛，　以難量法界，　　覺悟應度者。",
        "translation": "Being able to comprehend the nature of all dharmas, they're called buddhas because they've realized the immeasurable Dharma realm and realized those who should be saved.",
        "source": "T15n0639_007:0591c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得諸佛之業，　　皆由戒身造，　佛言及戒聲，　　皆同平等相。",
        "translation": "The actions that lead to Buddhahood are all created from the body of precepts, and the words of the Buddha and the sounds of the precepts are all the same in their equality.",
        "source": "T15n0639_007:0591c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已說諸音聲，　　謂下、中、上音，　平等悉一相，　　佛能示法教。",
        "translation": "The sounds that have been described, which are lower, middle, and higher sounds, are all equal in their characteristics, and the Buddha is able to show the teaching of the Dharma.",
        "source": "T15n0639_007:0591c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛法無所住，　　亦不在諸方，　不生亦不滅，　　是故名無漏。",
        "translation": "The Buddha's teaching has no abode, doesn't lie in any direction, and isn't produced or ceased; therefore, it's called uncontaminated.",
        "source": "T15n0639_007:0591c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非新亦非故，　　非散亦非合，　非青亦非黃，　　非白亦非黑。",
        "translation": "It's neither new nor old, neither scattered nor combined, neither green nor yellow, and neither white nor black.",
        "source": "T15n0639_007:0591c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　難說不可取，　　藉言乃昭暢，　此非音聲地，　　諸佛巧智通。",
        "translation": "It's difficult to explain and impossible to make clear by using words, and it's not the level of sound or voice that the buddhas understand with their skillful cognition.",
        "source": "T15n0639_007:0591c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼是無漏法，　　是說無所依，　不在十方所，　　是法佛所說。",
        "translation": "It's an uncontaminated dharma that has no basis in what's said, isn't found in ten directions, and is taught by the Buddha.",
        "source": "T15n0639_007:0591c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於佛滅度後，　　思念佛身相，　即便覩佛身，　　以佛神力故。",
        "translation": "After the Buddha's death, when he considers the Buddha's physical appearance, he'll see the Buddha's body even then, because of the Buddha's spiritual power.",
        "source": "T15n0639_007:0591c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　竟無有眾生，　　證於寂滅者，　說於此法時，　　無量眾滅度。",
        "translation": "When he teaches this teaching, measureless multitudes are extinguished.",
        "source": "T15n0639_007:0591c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如彼日、月，　　影現於百川，　皆覩其像貌，　　諸法相如是。",
        "translation": "It's like the sun and moon, whose images appear in a hundred rivers, and everyone sees their appearance, and the characteristics of all dharmas are thus.",
        "source": "T15n0639_007:0591c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若知諸法性，　　猶若諸影像，　終不以色身，　　得覩於真佛。",
        "translation": "If they know the nature of all dharmas, they're like images, and they never see the true Buddha with their physical body.",
        "source": "T15n0639_007:0591c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法無形相，　　求狀不可得，　如是無形法，　　即是佛法身。",
        "translation": "All things lack form and characteristics, and their appearance is unobtainable when you look for it. Such formless things are the Buddha's Dharma body.",
        "source": "T15n0639_007:0591c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人見法身，　　是名見導師；　法身即正覺，　　如是名見佛。",
        "translation": "If someone sees the Dharma body, this is called seeing the teacher; the Dharma body is the right awakening, and this is called seeing the Buddha.",
        "source": "T15n0639_007:0591c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不得而示得、　　不得而說得，　若欲求沙門，　　應當知此道。",
        "translation": "If one wants to become a monk and wants to show and tell him what's not available, he should know this path.",
        "source": "T15n0639_007:0591c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我已說真行，　　知眾生樂欲，　若入祕密教，　　彼便無執著。",
        "translation": "I've explained the true practice and known the desires of sentient beings, so if they enter the esoteric teaching, they won't cling to it.",
        "source": "T15n0639_007:0592a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若謂所證得，　　彼便無所克，　此不得道果，　　故名非沙門。",
        "translation": "If someone says they've attained it, then they'll have nothing to grasp, and they won't attain the fruit of the path, which is why they're called not an ascetic.",
        "source": "T15n0639_007:0592a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斯法甚深奧，　　未達作此說，　彼教甚淵玄，　　難可以宣示。",
        "translation": "This teaching is so profound that it's difficult to explain it without fully understanding it, and it's so profound that it's difficult to explain.",
        "source": "T15n0639_007:0592a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五眾事皆無，　　悉從虛妄起，　無有能起者，　　及與五眾法。",
        "translation": "The five aggregates are all nonexistent, all arise from falsity, and there's nothing that can arise, along with the five aggregates of dharmas.",
        "source": "T15n0639_007:0592a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五眾之性相，　　即一切法相，　佛說如是相，　　其相不可得。",
        "translation": "The nature and characteristics of the five aggregates are the characteristics of all dharmas, and the Buddha teaches that such characteristics are unobtainable.",
        "source": "T15n0639_007:0592a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如虛空無物，　　諸法亦如是，　前、後及現在，　　三際如實觀。",
        "translation": "Just as space is without substance, so are all dharmas, and the three realms are accurately observed in the past, future, and present.",
        "source": "T15n0639_007:0592a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　言說如虛空，　　空中無取故，　如是法體性，　　無取如虛空。",
        "translation": "They are spoken like space, and because there's no grasping in space, the essence of such things is grasped like space.",
        "source": "T15n0639_007:0592a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　演說如是法，　　曾無有所說，　於法無所見，　　是乃不思議。",
        "translation": "Such a teaching has never been explained, and it's inconceivable that there's nothing to see in the teaching.",
        "source": "T15n0639_007:0592a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此法無自性，　　法體不可得，　會佛菩提者，　　定滅之境界；　若能如是知，　　於法便無著；　若能不著法，　　彼人了法想。",
        "translation": "This dharma has no self-nature, its essence is unobtainable, and those who meet the buddha's enlightenment are those who have the state of certainty and cessation; if they can thus know this, they'll be unattached to the dharma; if they can be unattached to the dharma, they'll comprehend the conception of the dharma.",
        "source": "T15n0639_007:0592a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩一切時，　　棄捨一切想；　若人棄想者，　　佛法則無著。",
        "translation": "A bodhisattva abandons all conceptions at all times, and if a person abandons conceptions, the Buddha's teaching is unattached.",
        "source": "T15n0639_007:0592a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其際無可取，　　是名為實際，　於際了達者，　　億劫能不著。",
        "translation": "The absence of desirability at this point is called practical, and those who comprehend it at that point are capable of not clinging for a billion eons.",
        "source": "T15n0639_007:0592a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　本際妄分別，　　愚癡輪生死，　十方遍推求，　　本際不可得。",
        "translation": "Falsely discriminating the past, foolishly chasing birth and death in circles, and searching everywhere in the ten directions, the past is unobtainable.",
        "source": "T15n0639_007:0592a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切法空故，　　菩薩無所著，　興行為菩提，　　其行不可得。",
        "translation": "Because all things are empty, the bodhisattva attaches to nothing, initiates practice for enlightenment, and his practice is unobtainable.",
        "source": "T15n0639_007:0592a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如鳥飛虛空，　　足跡不可得；　正覺性如是，　　菩薩能解了。",
        "translation": "Like a bird flying through space, its footprints are unobtainable; the nature of right awakening is thus, which the bodhisattva can comprehend.",
        "source": "T15n0639_007:0592b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人善學幻，　　幻作種種物，　示現諸色像，　　而實不可得。",
        "translation": "Like a person who well trains in illusions, they conjure up various things and display various forms and images that are really unobtainable.",
        "source": "T15n0639_007:0592b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若取於得、失，　　彼便無所得，　其智猶如幻，　　非即同其幻。",
        "translation": "If someone grasps gain and loss, they'll attain nothing, and their cognition will be like an illusion, not just the same as an illusion.",
        "source": "T15n0639_007:0592b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於是空法處，　　愚者妄分別，　行於分別中，　　彼人趣惡道。",
        "translation": "In this realm of emptiness, a foolish man falsely discerns and acts in discrimination, and he's led to a bad path.",
        "source": "T15n0639_007:0592b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生生、老遷，　　流轉無窮已，　沈沒生、死中，　　苦惱無有量。",
        "translation": "When sentient beings are born and age and move, their transmigration is endless, and they are submerged in birth and death, with their suffering and distress incalculable.",
        "source": "T15n0639_007:0592b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間生苦惱，　　由愚妄分別，　未斷彼分別，　　漂流久生死。",
        "translation": "Mundane suffering and distress arise from foolish discrimination, and before that discrimination is stopped, they're adrift in birth-and-death for a long time.",
        "source": "T15n0639_007:0592b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初樂及相應，　　習著欲果報，　執取未能捨，　　住業煩惱故。",
        "translation": "Their first pleasures and concomitants, their habitual attachment to the results of desire, and their failure to abandon attachment, result in the accumulation of the afflictions of karma.",
        "source": "T15n0639_007:0592b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生業不盡，　　瀑流欲所漂，　數數而受生、　　數數還死滅。",
        "translation": "Without exhausting their karma, sentient beings are adrift in the current of desire, taking birth repeatedly and dying back repeatedly.",
        "source": "T15n0639_007:0592b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無智為魔嬈，　　造作諸惡業，　處處而受生，　　便感諸死報。",
        "translation": "Without wisdom, they're hoodwinked by Māra, creating bad actions, taking birth everywhere, and then being subject to the results of death.",
        "source": "T15n0639_007:0592b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡夫愚闇冥，　　而獲於生死，　貧窮加楚切，　　復向不善趣。",
        "translation": "Being ignorant and deluded, ordinary people attain birth-and-death, become poor and pained, and head back to an unwholesome destiny.",
        "source": "T15n0639_007:0592b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以刀、鞭、杖等，　　遞互相加害，　造作此惡事，　　增長諸苦惱。",
        "translation": "They inflict harm on each other with swords, whips, sticks, and so forth, creating these bad deeds that increase suffering and distress.",
        "source": "T15n0639_007:0592b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我子及我財，　　凡夫妄分別；　如是妄分別，　　復增諸有漏。",
        "translation": "We sons and our possessions are falsely discriminated by ordinary people, and such false discrimination increases the contaminants of existence.",
        "source": "T15n0639_007:0592b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼增諸生死，　　是則為凡夫；　流轉諸異趣，　　故名為凡夫。",
        "translation": "They increase birth and death, which makes them mortal, and they are born in the transmigration to different destinies, which is why they're called mortal.",
        "source": "T15n0639_007:0592b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼棄於佛法，　　增長諸惡法，　則不得解脫，　　繫屬魔網故。",
        "translation": "They abandon the Buddha's teaching and proliferate bad qualities, so they aren't liberated and are bound to the web of Māra.",
        "source": "T15n0639_007:0592b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚因愛欲故，　　隨事穢女色，　還趣於穢處，　　墮於諸惡道。",
        "translation": "Because of their desire, foolish people follow the sexual misconduct of defiled women, going back to defiled places and falling into bad destinies.",
        "source": "T15n0639_007:0592b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲染佛不歎，　　及近於女色，　此怖畏諸羂，　　女羂最可畏，　菩薩恒遠離，　　猶如惡毒蛇，　常不親女色，　　知非是佛道。",
        "translation": "The Buddha doesn't praise defilement by desire, and he approaches the female form, which is the most feared of all fears, and which the bodhisattva always avoids, like a vicious snake, always abstains from the female form, knowing that it's not the Buddha's path.",
        "source": "T15n0639_007:0592c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修學菩提道，　　如佛本所習；　修學佛道已，　　速成無上道。",
        "translation": "He cultivates the path of enlightenment just as the Buddha has trained it, and after cultivating the Buddha's path, he quickly achieves the unsurpassed way.",
        "source": "T15n0639_007:0592c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼得最無上，　　為世諸廟塔，　智慧無過者，　　成於天中天，　令他住八戒，　　戒身無垢染。",
        "translation": "Peter is most unsurpassed, serving as a stūpa for the temples of the world, having unsurpassed wisdom, becoming a god among gods, causing others to abide in the eight precepts, and his moral body is unsullied.",
        "source": "T15n0639_007:0592c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量諸億眾，　　勸教修菩提，　與眾作利益，　　一切悉起悲。",
        "translation": "Countless millions of people are encouraged to cultivate bodhi, and they all arouse compassion when they work for the benefit of others.",
        "source": "T15n0639_007:0592c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼健智慧者，　　而擊於法鼓，　震動魔王宮，　　及與魔眷屬，　無量諸億魔，　　勸令修菩提；　降伏諸異論，　　勝出諸外道，　震動於大地、　　大海及眾山。",
        "translation": "That man of sound wisdom beats the Dharma drum, shaking the demon king's palace and his retinue, urging measureless millions of demons to cultivate enlightenment, subduing dissenting philosophers and surpassing non-Buddhists, shaking the earth, sea, and mountains.",
        "source": "T15n0639_007:0592c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　變現為多身，　　種種諸雜類，　大智能顯示，　　百千諸神變。",
        "translation": "He transforms into many bodies, various kinds, and species, demonstrating great intelligence and a hundred thousand miraculous powers.",
        "source": "T15n0639_007:0592c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　震動無量剎，　　猶如恒河沙，　降伏彼魔輩，　　便悟無上道。",
        "translation": "Shaking measureless bases like the sands of the Ganges River, he subdues those demons and then realizes the unsurpassed way.",
        "source": "T15n0639_007:0592c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復化作妙樹，　　種種寶嚴飾，　花、果奇茂盛，　　芬芬甚可愛；　或化為臺榭、　　樓觀及宮閤，　勇健為變化，　　花池甚精明，　滿八功德水，　　清冷無穢濁，　若有眾生飲，　　滅除三種渴。",
        "translation": "It's also transformed into a marvelous tree, adorned with various treasures, with flowers and fruits that are exquisitely luxuriant and fragrant, or it's transformed into a dais, a tower, a mansion, and a palace, with heroic changes, a flower pond that's brilliant, full of eight excellent waters that are cool and unsullied, and if any sentient being drinks them, it will quell the three kinds of thirst.",
        "source": "T15n0639_007:0592c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有飲此水，　　悉得於不退，　能得無上智，　　堪為世導師。",
        "translation": "If anyone drinks this water, they'll all attain irreversibility, attain unsurpassed knowledge, and become a worldly teacher.",
        "source": "T15n0639_007:0592c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無上寂滅道，　　行者應當知，　不達此道者，　　所謂是外道。",
        "translation": "Practitioners of the unsurpassed path to cessation should know that those who don't attain this path are considered non-Buddhists.",
        "source": "T15n0639_007:0593a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人親近彼，　　受行於言教，　墜於大惡處，　　阿鼻難救拔，　受大極苦惱，　　不可具論說。",
        "translation": "If someone approaches them and accepts the teaching in words, they'll fall into a great evil place, be difficult to rescue from avīci, and experience great suffering and distress that can't be explained in detail.",
        "source": "T15n0639_007:0593a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯我能知足，　　及大勝菩薩，　甚深難可覩，　　非愚凡夫地，　謂住取著者，　　於此法生疑。",
        "translation": "Only I can know their fulfillment, and I'm a great victorious bodhisattva whose depth is difficult to see, not a foolish worldling who abides in attachment and becomes doubtful about this teaching.",
        "source": "T15n0639_007:0593a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　變作勝莊嚴，　　無量種可愛，　一切悉得往，　　無上諸佛剎。",
        "translation": "They are transformed into a great adornment, measureless and desirable, and all can go to the unsurpassed buddha bases.",
        "source": "T15n0639_007:0593a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸佛土，　　皆現諸異色，　菩薩大神力，　　一切悉能現。",
        "translation": "All the buddha-lands appear in different colors, and the bodhisattva's great spiritual powers are able to show them all.",
        "source": "T15n0639_007:0593a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大力、大勇猛，　　被於堅勝鎧，　執大金剛杵，　　摧滅於空法。",
        "translation": "With great power and courage, he's clad in a sturdy armor, wields a large vajra, and destroys empty phenomena.",
        "source": "T15n0639_007:0593a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自身所放出，　　無數大光明，　其數如恒沙，　　滅彼世間闇。",
        "translation": "They emit incalculably great lights, as numerous as the sands of the Ganges, that extinguish the darkness of the world.",
        "source": "T15n0639_007:0593a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼不染女色，　　亦不隨順彼，　當離於此想，　　女想甚可[言*亞](烏故反)。",
        "translation": "They don't defile the form of women, nor do they conform to it, so they must part with the conception of women, which is quite [verbal*yaya] (Ursa Major).",
        "source": "T15n0639_007:0593a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛土常不空，　　勇猛之所住，　惡魔波旬等，　　不能為嬈亂。",
        "translation": "The Buddha land is never empty, and it's a place of courageous abiding that Māra Pāpīyān and others can't disturb.",
        "source": "T15n0639_007:0593a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　住於惡見者，　　不得遇諸佛，　忿怒之所制，　　安住於慳貪。",
        "translation": "Those who abide in wrong views can't meet the buddhas, and they're restrained by anger and abide in stinginess and greediness.",
        "source": "T15n0639_007:0593a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼為魔波旬，　　生天及解脫，　與其作障礙，　　是故墮惡道。",
        "translation": "They are Māra Pāpīyān, who are an obstacle to birth, heaven, and liberation, and therefore fall into a bad path.",
        "source": "T15n0639_007:0593a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀察一切想，　　而住遠離想，　彼人能得知，　　諸佛無上智。",
        "translation": "He observes all perceptions and abides in the perception of freedom from them, and he can know the unsurpassed knowledge of the buddhas.",
        "source": "T15n0639_007:0593a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能見前、後際，　　及與於現在，　演說如是義，　　於中無所說。",
        "translation": "He can see what came before, what's after, and what's now, and explain its meaning like this, which has nothing to say.",
        "source": "T15n0639_007:0593a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假名和合言，　　菩薩知如是，　利益於含識，　　無量難思議。",
        "translation": "It's called a combination of words, and the bodhisattva knows it's thus, which benefits the embodied consciousness in ways that are immeasurable and difficult to fathom.",
        "source": "T15n0639_007:0593a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　想者測知義，　　顯示能取故，　其相無可取，　　便示寂滅義。",
        "translation": "Concepts are the object of discernment, which shows that they can be grasped, that their characteristics are ungraspable, and that they reveal the meaning of extinction.",
        "source": "T15n0639_007:0593b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不寂者是想、　　寂滅者是智，　若知想自性，　　便離於諸想。",
        "translation": "What's not quiescent is conception, and what's quiescent is cognition. If one knows the essential nature of conceptions, then they're free of conceptions.",
        "source": "T15n0639_007:0593b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有想可遣，　　是則還有想，　彼行想戲論，　　是人不離想。",
        "translation": "If there are conceptions to be dispelled, then there are conceptions, and they engage in conceptual conceptual elaborations, and this person isn't free of conceptions.",
        "source": "T15n0639_007:0593b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人作是心：　　『是想誰所造？",
        "translation": "If a person thinks, 'Who created this conception?'",
        "source": "T15n0639_007:0593b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是想誰能證？",
        "translation": "Who do you think can witness this?",
        "source": "T15n0639_007:0593b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　誰能滅是想？』",
        "translation": "Who can extinguish this thought?'",
        "source": "T15n0639_007:0593b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　起想之法者，　　諸佛莫能得，　即於此處有，　　無我離取著。",
        "translation": "\"The thing that gives rise to conceptions is something that no buddha can attain, which is to say that it exists here, without self and free of attachment.",
        "source": "T15n0639_007:0593b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若其心不生，　　何由得起想？",
        "translation": "If his mind doesn't give rise to it, how can he give rise to conceptions?",
        "source": "T15n0639_007:0593b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若心得解脫，　　彼則無由起。",
        "translation": "\"If the mind is liberated, then there's no cause for its arising.",
        "source": "T15n0639_007:0593b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若證於解脫，　　心則不思議；　心不思議故，　　成就不思議。",
        "translation": "If someone realizes liberation, then the mind doesn't deliberate, and because the mind doesn't deliberate, it accomplishes inconceivability.",
        "source": "T15n0639_007:0593b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我本作是念：　　『安住心地已，　棄捨一切心，　　願成不思議。』",
        "translation": "I used to think, 'Having settled in the mind ground and discarded all thoughts, I want to achieve inconceivability.'",
        "source": "T15n0639_007:0593b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　白淨法果報，　　覩見於無為，　一念能了知，　　一切眾生念。",
        "translation": "Seeing the pure fruit of the Dharma as the result of noncontemplation, I was able to comprehend with a single thought the thoughts of all sentient beings.",
        "source": "T15n0639_007:0593b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生即是心、　　心即是如來，　諸佛不思議，　　顯了於此心。",
        "translation": "'All sentient beings are mind, and mind is the Tathāgata, and the buddhas don't deliberate and reveal it in this mind.'",
        "source": "T15n0639_007:0593b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人作是念：　　『云何得捨心？』",
        "translation": "Suppose someone thinks, 'How can I abandon my mind?'",
        "source": "T15n0639_007:0593b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　思惟於無心，　　能離一切心。",
        "translation": "\"When contemplated in the absence of mind, it's possible to be free of all minds.",
        "source": "T15n0639_007:0593b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於死滅時，　　心隨於想轉，　是人起思心，　　令心不解脫。",
        "translation": "If the mind is transformed by conceptions when death ceases, this person generates thoughts that cause the mind not to be liberated.",
        "source": "T15n0639_007:0593b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚存於女想，　　則便起愛欲；　若能滅除想，　　便能無愛欲。",
        "translation": "A foolish man retains the conception of a woman, which gives rise to desire, but if he can cease conception, then he can have no desire.",
        "source": "T15n0639_007:0593b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若思無上法，　　是思最大思，　以思諸法故，　　獲得真實心。",
        "translation": "If someone contemplates the unsurpassed Dharma, this is the greatest contemplation, and it's because of contemplating these things that they attain true mind.",
        "source": "T15n0639_007:0593b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憶念無窮已，　　長夜恒攀緣，　諸邪異憶想，　　思心不可極。",
        "translation": "After endlessly recollecting, he'll continue to cling to it throughout the night, and his thoughts won't reach their limits when he recollects various things that are wrong.",
        "source": "T15n0639_007:0593c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　名心盡法者，　　盡中本無智，　智慧非盡地，　　以法無盡故。",
        "translation": "They're called the mind that exhausts dharmas, because in exhausting them there's originally no wisdom, and wisdom isn't an exhaustive ground because dharmas are inexhaustible.",
        "source": "T15n0639_007:0593c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假名語言道，　　亡言而演說，　此法無差異，　　智慧無有盡。",
        "translation": "He calls it the path of language, speaking without words, which has no difference in dharmas and whose wisdom has no end.",
        "source": "T15n0639_007:0593c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不生亦不滅，　　無相、無狀貌，　常於億劫中，　　顯現無相法。",
        "translation": "Neither arising nor ceasing, without marks or shape, it always shows up as a markless dharma throughout billions of eons.",
        "source": "T15n0639_007:0593c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀察一切有，　　安住非有中，　未曾見有異，　　亦不見無異。",
        "translation": "Observing all existence, he abides in what's not existence, never seeing anything different, nor does he see nothing different.",
        "source": "T15n0639_007:0593c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假名有言說，　　顯示非有、無，　然彼一切佛，　　有、無無所見。",
        "translation": "Supposedly there's language that shows what's not existent and what's not, yet all the buddhas see what is and what isn't.",
        "source": "T15n0639_007:0593c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切有為法，　　顯示於非有，　若能知此法，　　便能見非有。",
        "translation": "All the existent things that exist are shown not to exist, and if someone can know this, they can see what's not existent.",
        "source": "T15n0639_007:0593c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常無有所證，　　畢竟無有故，　若有可證者，　　便名為世間。",
        "translation": "There's always nothing to realize, and it's ultimately nonexistent, so if there were something to realize, it would be called worldly.",
        "source": "T15n0639_007:0593c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若作如是心：　　『我於世成佛。』",
        "translation": "If someone thinks this way, 'I'll become a buddha in the world.'",
        "source": "T15n0639_007:0593c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作此存有想，　　終不悟菩提。",
        "translation": "If you imagine such a state of existence, you'll never attain enlightenment.",
        "source": "T15n0639_007:0593c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩無畏者，　　於法無所求，　自然無煩惱，　　是名為菩提。",
        "translation": "A fearless bodhisattva who seeks nothing from the Dharma and has no natural afflictions is called a bodhi.",
        "source": "T15n0639_007:0593c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾人作是言：　　『我趣於菩提。』",
        "translation": "People say this, 'I'm headed for enlightenment.'",
        "source": "T15n0639_007:0593c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以不知此道，　　彼遠佛菩提。",
        "translation": "Because they don't know this path, they distance themselves from the buddhas' enlightenment.",
        "source": "T15n0639_007:0593c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以音聲說法：　　『一切諸行空，　音聲體自性，　　精微不可見。』",
        "translation": "They say with sound, 'All things that are conditioned are empty, and the essence of sound is its own nature, which is too subtle to see.'",
        "source": "T15n0639_007:0593c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　示大神通者，　　說此修多羅，　利益諸菩薩，　　諸佛之所明。",
        "translation": "He shows great supernormal powers, explains this sūtra, benefits the bodhisattvas, and is explained by the buddhas.",
        "source": "T15n0639_007:0593c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斷彼諸對治，　　謂諸煩惱等，　彼住大神通，　　善修四神足。",
        "translation": "He stops their antidotes, which are the afflictions and so forth, and he abides in great supernormal powers, skillfully cultivating the four miraculous abilities.",
        "source": "T15n0639_007:0593c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　獲得於尸羅，　　於空則究竟，　安住於神通，　　神足不思議；　安住無願智，　　修智善清潔，　求智無厭足，　　無量不思議。",
        "translation": "Attaining śīla, he then fully abides in emptiness, abides in supernormal powers, and his spiritual abilities are inconceivable; he abides in wishless cognition, cultivates wisdom that's well cleansed, seeks wisdom that's unsatisfactory, and has measureless inconceivables.",
        "source": "T15n0639_007:0593c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　神通三昧中，　　任運無功用，　是報恒空無，　　一切常寂滅；　是報神足力，　　往遊億世界，　見佛世燈明，　　猶如恒河沙。",
        "translation": "In the samādhi of supernormal powers, he moves freely without effort, his reward is always empty and nonexistent, and all things are always tranquil; this is the reward of his spiritual powers, which allow him to travel to billions of worlds and see the Buddha's worldly lamp shining like the sands of the Ganges River.",
        "source": "T15n0639_007:0594a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼人於生、滅，　　隨心而自在；　以心自在已，　　其身得清淨。",
        "translation": "That person's mind is at ease with birth and cessation, and after his mind is at ease, his body is purified.",
        "source": "T15n0639_007:0594a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛諸弟子中，　　若修神通力，　於此報通者，　　十六不及一，　一切諸天眾，　　不能見彼身，　惟除佛、世尊，　　及其同得者。",
        "translation": "Among the Buddha's disciples, if they cultivate supernormal powers and attain this power of reward, sixteen are not as great as one, and all the gods can't see their bodies except for the Buddha, the Bhagavān, and those who attain them together.",
        "source": "T15n0639_007:0594a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼身無諸疾，　　亦無髮白皺，　及與羸虛老，　　臨終無苦切；　彼無有疑滯，　　及與諸迷惑，　晝夜恒演說，　　百億修多羅。",
        "translation": "He has no illnesses, his hair doesn't gray and wrinkle, he's weak and old, and he's not suffering at the end of his life; he has no doubts or delusions, and he's a constant source of explanation day and night for 10 billion sūtras.",
        "source": "T15n0639_007:0594a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸煩惱，　　悉斷於習氣；　一切眾生所，　　常起平等心。",
        "translation": "All afflictions are stopped in their habituated tendencies, and all sentient beings are always given equal mind.",
        "source": "T15n0639_007:0594a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於百千三昧，　　無垢得自在，　修習大智慧，　　為他而演說。",
        "translation": "In a hundred thousand samādhis, he attains unimpededness without stain, cultivates great wisdom, and explains it for others.",
        "source": "T15n0639_007:0594a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　男、女二根等，　　一切遠離想，　安住非有想，　　能說真決定。",
        "translation": "He's free of all perceptions of the male and female sense faculties, abides in perceptions that aren't present, and is able to explain true determination.",
        "source": "T15n0639_007:0594a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以清淨智慧，　　演說如實法，　稱於隨順法，　　定慧之境界。",
        "translation": "With pure wisdom, he explains the true teaching, which is called the conforming dharma and the sphere of concentration and wisdom.",
        "source": "T15n0639_007:0594a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼修諸定者，　　不為有所滯，　常以真實言，　　說法無不益；　彼善得人身，　　遠離一切難，　能報諸佛恩；　　常樂此經故，　彼於無量劫，　　棄捨於世間。",
        "translation": "Those who cultivate concentration aren't obstructed by anything, and they always speak the truth, teaching the Dharma without fail; they've well attained the status of person, are far removed from all difficulties, and can repay the kindness of the buddhas; because they always enjoy this sūtra, they've abandoned the world for measureless eons.",
        "source": "T15n0639_007:0594a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於此妙典，　　乃至持一偈，　已曾見諸佛，　　數數致供養。",
        "translation": "If someone were to hold even a single verse from this wonderful sūtra, they'd have seen the buddhas before and offered their support repeatedly.",
        "source": "T15n0639_007:0594b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以愛此經故，　　速悟佛菩提，　彼即見諸佛，　　恒在耆闍山，　悉授彼人記：　　『當見彌勒佛。』",
        "translation": "Because they love this sūtra, they quickly realize the Buddha's enlightenment, and they then see the buddhas, who are always on Mount Gṛdhrakūṭa, and they all give their people the prediction, 'I will see Maitreya Buddha.'",
        "source": "T15n0639_007:0594b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼見彌勒佛，　　若於末代時，　持於此經者，　　得上愛樂心。",
        "translation": "If they see Maitreya Buddha and maintain this sūtra during the final age, they'll attain a superior mental state of joy and happiness.",
        "source": "T15n0639_007:0594b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安住實際中，　　成就不思議，　於不思議際，　　無有諸疑惑。",
        "translation": "They abide in reality, accomplishing inconceivability, and at the point of inconceivability, they have no doubts.",
        "source": "T15n0639_007:0594b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼人無有疑，　　亦無微少惑，　於佛語決定，　　菩提不難得。",
        "translation": "That person has no doubt, and no slightest confusion, so he's certain in the Buddha's words, and enlightenment isn't difficult to attain.",
        "source": "T15n0639_007:0594b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　末代怖畏時，　　難可得修行，　若得聞此經，　　便得無盡辯。",
        "translation": "In the fearful age of the latter, it's difficult to attain cultivation, but if one hears this sūtra, they'll attain inexhaustible eloquence.",
        "source": "T15n0639_007:0594b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愛樂此經者，　　無上佛法藏，　佛及諸聲聞，　　彼便已供養。",
        "translation": "Those who delight in this sūtra are the unsurpassed store of the Buddha's teaching, and the buddhas and śrāvakas then make offerings to them.",
        "source": "T15n0639_007:0594b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　轉讀此經人，　　即是持法藏，　一切供養中，　　法供最為上。",
        "translation": "Someone who turns to read this sūtra is holding the Dharma treasure, and among all the offerings, the Dharma offering is the highest.",
        "source": "T15n0639_007:0594b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能持此經，　　難思佛菩提，　謂：『佛無上智，　　彼智得不難。』",
        "translation": "If someone can maintain this sūtra, it's difficult to conceive of the Buddha's enlightenment, which is, 'The Buddha's unsurpassed wisdom; it's not difficult to attain that wisdom.'",
        "source": "T15n0639_007:0594b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於先佛世，　　曾持此經典，　乃後末代時，　　身還遇此經，　詣於諸佛剎，　　彼便能震吼，　作大師子吼，　　佛吼不思議。",
        "translation": "If someone had once held this sūtra in a prior Buddha's lifetime and had come across it again in a later generation and visited one of the buddha bases, they would be able to shout, producing a great teacher's roar and a Buddha's inconceivable roar.",
        "source": "T15n0639_007:0594b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼億佛所，　　釋師子所作，　能以無量辯，　　演說無所畏。",
        "translation": "In the presence of those billions of buddhas, he explained what the lion did, and with measureless eloquence, he explained it without fear.",
        "source": "T15n0639_007:0594b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　甘蔗功德種，　　而授彼人記，　及於後末代，　　能護佛菩提。",
        "translation": "He bestows the merit seeds of sugarcane on others, and in later generations, he'll be able to protect the buddhas' enlightenment.",
        "source": "T15n0639_007:0594b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　妙色皆具足，　　相好自莊嚴，　神力速能往，　　悉見無量佛。",
        "translation": "They're all endowed with marvelous form, their appearance is individually adorned, and their spiritual powers quickly enable them to go and see measureless buddhas.",
        "source": "T15n0639_007:0594b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　神力化作花，　　端妙甚芬馥，　常以銀、水精，　　及諸琉璃等，　一切諸寶貨，　　彼悉掌中出。",
        "translation": "Their miraculous powers create flowers that are exquisitely fragrant, always filled with silver, water essences, beryl, and other things that are precious in their palms.",
        "source": "T15n0639_007:0594c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為求菩提故，　　供養一切佛，　無量諸供養，　　音樂及歌讚，　自身毛孔出，　　猶如恒河沙。",
        "translation": "For the sake of seeking enlightenment, they make offerings to all the buddhas, and measureless offerings, music, and song praise emanate from their own pores like the sands of the Ganges River.",
        "source": "T15n0639_007:0594c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　億類眾生等，　　若得聞是音，　便得不退轉，　　無上佛智慧。",
        "translation": "If hundreds of millions of sentient beings and so forth could hear that sound, they'd attain irreversibility and unsurpassed Buddha wisdom.",
        "source": "T15n0639_007:0594c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為佛所讚歎，　　普聞其名號，　諸方傳其名，　　自亦得聞見。",
        "translation": "They're praised by the Buddha, and their name is universally heard, and their name is transmitted from place to place, so they themselves can hear and see it.",
        "source": "T15n0639_007:0594c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若聞其名者，　　得滅一切想，　既滅其想已，　　得見無量佛。",
        "translation": "If someone hears his name, they'll be able to cease all perceptions, and once they've ceased their perceptions, they'll be able to see measureless buddhas.",
        "source": "T15n0639_007:0594c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是之智慧，　　行於菩提行，　為利諸眾生，　　故求菩提德。",
        "translation": "Such wisdom conducts enlightening actions and seeks the virtue of bodhi for the benefit of sentient beings.",
        "source": "T15n0639_007:0594c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼行智慧者，　　得於如是利，　復得餘利益，　　能持此經故。",
        "translation": "That practitioner of wisdom attains such benefit and furthermore obtains other benefits because he can maintain this sūtra.",
        "source": "T15n0639_007:0594c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有諸婦女，　　聞持此經故，　即轉於女身，　　能說甘露法，　彼更不復受，　　如是女人身，　具足諸妙色，　　成就相莊嚴。",
        "translation": "If there are women who hear and retain this sūtra, they'll be transformed into a woman's body that teaches the nectar-like dharma, and they'll no longer accept such a woman's body, which is fully endowed with marvelous forms and accomplishes adorned characteristics.",
        "source": "T15n0639_007:0594c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於此勝經，　　顯示其功德，　悉獲是妙果，　　速證於菩提，　常於一切生，　　成就無所畏。",
        "translation": "If someone shows the merits of this remarkable sūtra, they'll all attain this wonderful result, quickly realize enlightenment, and always attain fearlessness in all births.",
        "source": "T15n0639_007:0594c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人於此經，　　菩薩之境界，　無盡勝三昧，　　一切菩薩母，　速證菩提者，　　應當持此經。",
        "translation": "If someone follows this sūtra, which describes the bodhisattva's state, inexhaustibly surpasses samādhi, is the mother of all bodhisattvas, and quickly realizes enlightenment, they should hold onto this sūtra.",
        "source": "T15n0639_007:0594c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼得親近佛，　　亦近佛菩提，　不久於此經，　　獲勝妙寂滅。",
        "translation": "Peter will become intimate with the Buddha and also with his enlightenment, and soon he'll attain excellent and marvelous cessation based on this sūtra.",
        "source": "T15n0639_007:0594c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此地勇健者，　　菩薩所安住，　見世燈明照，　　猶如恒河沙。",
        "translation": "The courageous man of this stage, where bodhisattvas abide, sees the world's lamp shining brightly like the sands of the Ganges River.",
        "source": "T15n0639_007:0595a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能作大力轉輪王，　　見佛十力寂定心，　無量百偈而讚歎，　　得離垢地勝三昧。",
        "translation": "He's a powerful wheel-turning king who sees the Buddha's ten powers and quiescent concentration, praises him in measureless hundreds of verses, and attains the excellent concentration of the ground of freedom from pollution.",
        "source": "T15n0639_007:0595a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼設無等供養佛，　　有大名號人中上，　棄捨王位如涕唾，　　而修最上勝梵行，　於勝佛法而出家，　　得此寂滅離垢定。",
        "translation": "He makes unequalled offerings to the Buddha, has a great name that's among the highest of people, abandons his position like tears and spittle, cultivates the most excellent religious practice, leaves home in the midst of the excellent Buddha teaching, and attains the concentration of tranquility and freedom from defilement.",
        "source": "T15n0639_007:0595a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得於勝善美妙語，　　演說不斷多億經，　空無相願微細法，　　寂勝離垢無諸漏，　自性空寂語言斷，　　出定能為多人說，　甚深智慧常無量，　　廣大智慧無邊義。",
        "translation": "Attaining this excellent, beautiful speech, he delivers an unceasing stream of sūtras, teaching the subtle Dharma of emptiness, signlessness, and vows, tranquility, freedom from defilement, absence of contaminants, and the cutting off of speech, he emerges from that concentration able to speak for many people, his profound wisdom is always immeasurable, and his vast wisdom has limitless meaning.",
        "source": "T15n0639_007:0595a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得此甚深三昧已，　　能為世間作照明，　常修梵行恒皎潔，　　無諸腥臊及鄙穢，　無量眾生令安住，　　使得寂定離諸垢。",
        "translation": "After attaining this profound concentration, he's able to illuminate the world, always cultivating the religious practice, always clean, free of foul and defiled smells, and enabling measureless sentient beings to abide in peace, so that he attains quiescent concentration free of all defilements.",
        "source": "T15n0639_007:0595a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常得聰利捷速辯，　　多聞如海無量慧，　語言善妙達諸法，　　持此寂定勝經故；　了知諸業及工巧，　　曉於因論及醫方，　到彼一切勇健岸，　　持此離垢寂定故；　於諸偈論及戲笑，　　善於歌舞皆究竟，　常為世間作師法，　　持此離垢寂定故；　常有上妙諸眷屬，　　恒得一切上供養，　能修勝妙菩提行，　　持此離垢寂定故；　憂惱毒箭逼切心，　　彼智慧者無此患，　恒無病疾常安隱，　　持此離垢寂定故；　世間所有諸病患，　　一切身患及心患，　彼人常無如此患，　　持此離垢寂定故；　所有身痛及心痛，　　若有牙痛及頭痛，　智者常無是痛惱，　　持此離垢寂定故；　心有無量餘痛惱，　　從其意起燒其身，　彼無一切起煩惱，　　持此離垢寂定故；　猶如虛空無所染，　　自性無垢常清淨，　彼人心淨亦如是，　　持此離垢寂定故；　亦如日、月之光明，　　其光頗執常清淨，　彼心清虛亦如是，　　持此離垢寂定故；　如人執持諸彩色，　　欲畫虛空不可得，　彼人心淨亦如空，　　持此離垢寂定故；　譬如風行於十方，　　遍遊諸方無所著，　其心流注猶如風，　　不染世間得解脫，　風行速疾不可見、　　不可羂網而繫縛，　彼人志意深難知，　　持此離垢寂定故。",
        "translation": "He always has a sharp, quick tongue, is well-versed like the ocean of measureless wisdom, speaks the Dharma well, and has an excellent command of tranquility and concentration.",
        "source": "T15n0639_007:0595a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　壁上光影不可取、　　指水中像難可執，　得於三昧在身時，　　無有能知彼人心；　十方世界諸眾生，　　所有語言猶可算，　得此三昧在身時，　　無能得知彼人心；　得於如是寂滅定，　　其心無垢、無染著，　三界眾生無與等，　　惟除諸佛三界尊。",
        "translation": "The images on the wall are unattractive, the images in the water with their fingers are difficult to grasp, and when they attain samādhi in their bodies, there's no one who can know their minds; all the sentient beings in the world in the ten directions whose speech can still be counted can't know their minds when they attain this samādhi in their bodies; when they attain this concentration of cessation, their minds are undefiled and undefiled by attachment, and there are no sentient beings in the three realms who are equal to them, except the buddhas, the honored ones in the three realms.",
        "source": "T15n0639_007:0595b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離貪愛欲不染色，　　不以愚心著女人，　得於如是勝定時，　　獲勝寂滅無所染；　於彼男女無戀情，　　不染妻妾及眷屬，　得於寂滅勝定時，　　善寂之行無所染。",
        "translation": "When he's free of craving and desire and doesn't stain, and he doesn't attach to women with a foolish mind, he attains a tranquil and undefiled existence when he attains such a tranquil and excellent concentration.",
        "source": "T15n0639_007:0595b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於其貨賄無所寶，　　不希天果、不著財，　其心清淨無妄想，　　由得此定獲勝益；　不為生天修梵行，　　智者行檀不求報，　為菩提因修梵行，　　得於離垢寂定故；　不求王位修戒行，　　多人為此修梵行，　為利眾生求菩提，　　專欲成就此定故。",
        "translation": "They possess no treasures, desire neither heavenly rewards nor attachment to possessions, and their minds are pure of deluded thought, which gives them surpassing benefits as a result of attaining this concentration. They don't cultivate the religious practice for birth in heaven, practice the sandalwood of wisdom without seeking rewards, cultivate the religious practice as a cause for enlightenment, and attain the tranquil concentration free of stains.",
        "source": "T15n0639_007:0595b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸欲已棄身不惱，　　永不悕求婬欲事，　斷除婬欲及慢高，　　由得如是寂定故；　彼常不為瞋恚惱，　　瞋惱穢心永不生，　常以慈心除瞋怒，　　由獲如是勝寂定；　彼常不為愚蔽心，　　斯由智慧斷無明，　獲得無量無閡智，　　由得斯定獲此利。",
        "translation": "They always abstain from anger, never pursue sexual desires, eliminate lustful desires and conceit, and attain this tranquil concentration; they never become angered by anger, and the mind is never defiled by anger; they always remove anger with kindness, and attain this excellent tranquil concentration; they always aren't deluded by ignorance, and this wisdom ends ignorance and attains immeasurable, unobstructed knowledge, which is the benefit of attaining this concentration.",
        "source": "T15n0639_007:0595b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以不淨觀除愛欲、　　慈心除瞋無有餘、　智慧除斷無明網，　　獲此妙定照世間。",
        "translation": "With impure contemplation that removes craving, kindness that removes anger without remainder, and wisdom that removes the web of ignorance, they attain this marvelous concentration that illuminates the world.",
        "source": "T15n0639_007:0595c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無有睡眠及懈怠，　　離起煩惱及與地，　永得解脫無雜穢，　　得斯三昧獲此利。",
        "translation": "Without drowsiness or laziness, free of the afflictions that arise and the ground, he attains permanent liberation without defilement, and he obtains this benefit from attaining this concentration.",
        "source": "T15n0639_007:0595c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不為慳貪之所逼，　　心常樂於惠施人，　一切皆捨悉與樂，　　彼人能持三昧故。",
        "translation": "Not being constrained by stinginess or greed, his mind always takes delight in bestowing gifts on others, and all are abandoned and fully enjoyed because that person can maintain samādhi.",
        "source": "T15n0639_007:0595c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具足威勢無與等，　　一切常有大身力，　一切世間無倫匹，　　菩薩由持勝定故。",
        "translation": "Possessing an authority unsurpassed, they always have great physical strength that's unequaled in the world, which is caused by a bodhisattva's maintenance of superior concentration.",
        "source": "T15n0639_007:0595c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦復能為轉輪王，　　具足七寶乘空行，　彼時一切悉歸奉，　　是智慧者獲此報。",
        "translation": "Also, he can be the wheel-turning king, fully endowed with the seven treasures that travel through the practice of emptiness, to which all of them then give refuge, and this is the reward for someone who's wise.",
        "source": "T15n0639_007:0595c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最勝賢善豪貴家，　　資生、眷屬悉豐備，　象、馬、車乘及輦輿，　　豐饒金銀具眾寶，　恒生貴族豪富家，　　如是展轉生勝處，　於佛、法、僧深信樂，　　生於彼處眾人敬。",
        "translation": "The most excellent, virtuous, and wealthy family is supplied with all their necessities and retinues, with elephants, horses, chariots, and mounts, with an abundance of gold and silver and many treasures, always born into a noble and wealthy family, thus spreading out into a superior place, deeply delighting in the Buddha, Dharma, and Saṃgha, and born there to be respected by many people.",
        "source": "T15n0639_007:0595c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　閻浮提內不信家，　　悉皆能令生正信，　能令建立菩提心，　　亦復令彼得道果。",
        "translation": "All of the unbelievers in Jambudvīpa can be made to have right faith, which builds their minds for enlightenment and also makes them perfect the fruit of the path.",
        "source": "T15n0639_007:0595c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼得無上菩提已，　　轉於無上妙法輪，　若人知彼所說法，　　悉皆獲得無生忍。",
        "translation": "After they achieve unsurpassed bodhi, they turn the unsurpassed wheel of the fine dharma, and if people know what they're taught, they all attain the patience of nonproduction.",
        "source": "T15n0639_007:0595c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩常樂慈愛育，　　悉能長養於眾生，　恒為無量勝利益，　　開眾生眼除闇冥。",
        "translation": "Always delighting in nurturing compassion, these bodhisattvas are all able to nurture sentient beings, constantly providing measureless and excellent benefits and opening their eyes to remove darkness.",
        "source": "T15n0639_007:0595c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若佛教導一菩薩，　　無量百千億眾生，　彼悉於中殖善本，　　聞已即發菩提心。",
        "translation": "If a buddha teaches one bodhisattva, measureless hundreds of millions of sentient beings will cultivate good roots in them, and after hearing that, they'll then arouse the mind of enlightenment.",
        "source": "T15n0639_007:0595c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼時剎土不空虛，　　智者奉持佛法故，　佛子！",
        "translation": "Their buddha-lands are not empty, so the wise man consecrates the Buddha's teaching, son of the Buddha!",
        "source": "T15n0639_007:0595c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩隨所住，　　廣利無量諸眾生。",
        "translation": "\"As bodhisattvas abide, they extensively benefit measureless sentient beings.",
        "source": "T15n0639_007:0595c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　護戒無等持梵行，　　於無量劫淨三昧，　於禪解脫常決定，　　如是菩薩名佛子。",
        "translation": "Protecting precepts without equal, maintaining the religious practice, purifying samādhi for measureless eons, and always being certain of liberation from meditation, such a bodhisattva is called a son of the Buddha.",
        "source": "T15n0639_007:0595c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼常修習勝神足，　　能往無量諸佛剎，　於如來所聞正法，　　隨所聞已悉憶念。",
        "translation": "He always cultivates excellent spiritual abilities, travels to measureless buddha bases, and recollects the right teaching heard by the Tathāgata as he hears it.",
        "source": "T15n0639_007:0596a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若住總持菩薩者，　　能說無量修多羅，　又知過去諸眾生，　　未來、現在亦復爾。",
        "translation": "If he abides as a Dhāraṇī, he's a bodhisattva who can teach measureless sūtra and knows all sentient beings in the past, and likewise in the future and present.",
        "source": "T15n0639_007:0596a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　曉悟含識諸生死，　　亦復了達於未來，　無有從此向彼者，　　推其少分不可得。",
        "translation": "He also understands that the consciousnesses that contain birth and death are also comprehended in the future, and there's no one who goes from here to there, so he deduces that their slightest part is unobtainable.",
        "source": "T15n0639_007:0596a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　業既不至彼，　　求之亦難得，　菩薩大名稱，　　乃能解了之。",
        "translation": "Even though karma doesn't reach them, it's difficult to attain it, and the bodhisattva's great name makes it possible to understand it.",
        "source": "T15n0639_007:0596a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最勝淨心者，　　安住於空寂，　以無上大乘，　　運載於群品。",
        "translation": "The most excellent pure mind abides in emptiness and quiescence, and it's carried in a multitude of categories by the unsurpassed great vehicle.",
        "source": "T15n0639_007:0596a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼不思惟念，　　存有眾生想；　彼大名譽者，　　能悟無生法。",
        "translation": "He doesn't contemplate, harboring thoughts of sentient beings, but he has a great reputation as someone who can understand the principle of nonproduction.",
        "source": "T15n0639_007:0596a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼雖有所說，　　不取眾生想，　悟彼境界空，　　住於堅固智。",
        "translation": "Although he explains something, he doesn't grasp the conceptions of sentient beings, realizes the emptiness of their objective realm, and abides in resolute knowledge.",
        "source": "T15n0639_007:0596a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　顯說此三昧，　　佛法之所住，　不起於思想，　　謂諸男、女等。",
        "translation": "He explains this samādhi as the abode of the Buddha's teaching, not giving rise to thoughts, which are those of men and women.",
        "source": "T15n0639_007:0596a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀察於諸女，　　而坐於道場；　坐於道場已，　　摧壞諸魔軍。",
        "translation": "He observes the women, sits in the meeting place, and after sitting in the meeting place, he destroys the armies of Māra.",
        "source": "T15n0639_007:0596a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於魔無所見，　　降伏諸魔眾，　不見魔女來，　　而至於我所。",
        "translation": "He sees nothing of the Māras, subdues the Māras, doesn't see the Māra women coming, and comes to me.",
        "source": "T15n0639_007:0596a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　坐於道場時，　　遣除一切想，　以斷諸想故，　　一切大地動；　須彌及大海，　　十方亦復然。",
        "translation": "While sitting in the site of enlightenment, he rids himself of all perceptions, and because he stops perceptions, the whole earth moves; so do Sumeru and the ocean in the ten directions.",
        "source": "T15n0639_007:0596a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼十方界，　　悉知彼眾生，　菩薩神通力，　　震動於大地，　六種震動時，　　以證菩提道。",
        "translation": "In those ten directions, he knows about their sentient beings, and when the bodhisattva's supernormal powers shake the earth, the six kinds of shaking cause him to realize the path to enlightenment.",
        "source": "T15n0639_007:0596a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切有為法，　　及以無為法，　是法悉了達。",
        "translation": "He fully comprehends all the existent dharmas and all the nonexistent dharmas.",
        "source": "T15n0639_007:0596a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　但有說法音，　無有能知者，　　此是諸法道；　若知此道者，　　名為世間解。",
        "translation": "Only the sounds of the teaching do they make, and no one can know them; this is the path of the teachings; if someone knows this path, they're called worldly understanding.",
        "source": "T15n0639_007:0596a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　因緣故法生、　　因緣故法滅，　因緣之體性，　　如實悉了達。",
        "translation": "It's because of causes and conditions that dharmas arise and because of causes and conditions that dharmas cease, and the essence of causes and conditions is fully comprehended as it is.",
        "source": "T15n0639_007:0596b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若學一切法，　　空法能究竟，　便知諸法道，　　窮盡一切法。",
        "translation": "If he trains in all things and fully understands the principle of emptiness, then he'll know the path of qualities and exhaust all qualities.",
        "source": "T15n0639_007:0596b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼所行法道，　　菩薩求不得；　其有知此道，　　正覺不思議。",
        "translation": "They practice a path of qualities that bodhisattvas can't attain, and if they know that path, they're correctly awakened and don't deliberate.",
        "source": "T15n0639_007:0596b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若知一切道，　　便能獲究竟，　遠離於惡道，　　能知諸法相。",
        "translation": "If they know all paths, they can then attain their ultimate, stay far from bad paths, and know the characteristics of all dharmas.",
        "source": "T15n0639_007:0596b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　坐於道場已，　　作大師子吼，　無邊億世界，　　言音悉充滿。",
        "translation": "After sitting in the site of enlightenment, he produces a great teacher's roar, filling measureless millions of worlds with his words and sounds.",
        "source": "T15n0639_007:0596b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復能動彼剎，　　世雄大名稱，　善度眾生者，　　謂聖調御士。",
        "translation": "He can also move those buddhas, and the great world hero is called the noble tamer who skillfully liberates sentient beings.",
        "source": "T15n0639_007:0596b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已證上菩提，　　起於菩提樹，　無量諸億眾，　　應度者已度，　然後能變化，　　化作無邊佛，　往遊諸世界，　　利益於眾生。",
        "translation": "He has realized supreme enlightenment, arisen from the bodhi tree, and has saved measureless millions of people who should be saved, then can change, transform, and become an infinite Buddha, travel to all the worlds, and benefit sentient beings.",
        "source": "T15n0639_007:0596b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛能安立，　　無量諸億眾，　應化諸如來，　　為說最勝法。",
        "translation": "The buddhas are able to establish measureless millions of people, and the tathāgatas who should be transformed teach the most excellent Dharma.",
        "source": "T15n0639_007:0596b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此為真大乘，　　名為如來智，　能起眾生信，　　而作得佛因；　此是真大乘，　　如來最妙乘，　恭敬於如來，　　加敬於菩薩。",
        "translation": "This is the true great vehicle called the tathāgata's wisdom, which generates faith in sentient beings and serves as a cause for attaining Buddhahood; this is the true great vehicle, the most marvelous vehicle of the Tathāgata, which commands respect from the Tathāgata and reverence from the bodhisattvas.",
        "source": "T15n0639_007:0596b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於佛深加敬，　　法、僧亦復然，　欲證勝菩提，　　其心不下劣。",
        "translation": "Deeply venerating the Buddha, and likewise the Dharma and Saṃgha, they want to realize supreme enlightenment, so their minds aren't inferior.",
        "source": "T15n0639_007:0596b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　敬奉於菩薩，　　尊重勇猛者，　速皆登正覺，　　不久成如來。",
        "translation": "Those who venerate the bodhisattvas and respect their boldness will quickly attain right awakening and soon become tathāgatas.",
        "source": "T15n0639_007:0596b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於千世界中，　　菩薩悉往詣，　見於牟尼尊，　　菩薩無所畏。",
        "translation": "In a thousand worlds, the bodhisattvas all go there, and when they see the venerable Muni, the bodhisattvas have no fear.",
        "source": "T15n0639_007:0596b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以諸勝寶末，　　遍散於大雄，　糅以蔓陀羅，　　樂求菩提故。",
        "translation": "They scatter the finest jewels all over Mahāsthāmaprāpta, blending them with madhuras, in order to aspire to enlightenment.",
        "source": "T15n0639_007:0596c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　莊嚴於此界，　　為求佛功德，　寶網以羅覆，　　遍至於十方，　懸諸勝妙幡，　　建億寶幢蓋，　無量種莊嚴，　　光飾於世界。",
        "translation": "Adorned in this realm, for the sake of seeking the Buddha's merit, he covered it with a net of treasures that reached the ten directions, hung some wonderful banners, built a hundred million jeweled banners, and adorned the world with measureless adornments.",
        "source": "T15n0639_007:0596c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　變作勝臺閣，　　及以妙宮殿，　廊廡盡端麗，　　眾寶相間錯，　樓窓及宮室，　　皆作半月形，　并雜香瓶等，　　皆用妙寶飾。",
        "translation": "He transforms them into a splendid tower and a marvelous palace, complete with beautiful verandahs and palaces, interspersed with multitudes of treasures, with half-moon shaped buildings and rooms, and with a variety of incense sticks and vases decorated with marvelous treasures.",
        "source": "T15n0639_007:0596c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種諸馨物，　　悉出妙雲臺，　於千世界中，　　香熏甚可樂。",
        "translation": "All sorts of fragrant things emerge from the tower of marvelous clouds, and their fragrance is delightful in a thousand worlds.",
        "source": "T15n0639_007:0596c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼普香雲，　　雨以香花雨，　若有嗅之者，　　成佛大道師，　便去於愛刺，　　亦復除瞋惱，　碎壞於癡網，　　遠離諸闇冥，　獲得勝神通，　　及於根、力、覺、　諸禪與解脫，　　應受於信施。",
        "translation": "From that cloud of universal fragrance, it rains down a shower of fragrant flowers, and if anyone smells them, they'll become a great teacher of the Buddha, readily remove the thorns of craving, also remove anger, shatter the web of delusion, become free of darkness, attain superior supernormal powers, and attain the faculties, powers, perceptions, meditations, and liberation that should be accepted as faithful gifts.",
        "source": "T15n0639_007:0596c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　敷置億床座，　　布以眾妙衣，　寶網羅覆上，　　花鬘而莊嚴。",
        "translation": "They spread out a hundred million seats, spread out many wonderful garments, cover them with a jeweled net, and adorn them with flowers.",
        "source": "T15n0639_007:0596c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無畏諸菩薩，　　勇猛大士坐，　具相莊嚴身，　　備諸隨形好。",
        "translation": "Fearless bodhisattvas and brave bodhisattvas sit with adorned bodies that are endowed with various sculptural features.",
        "source": "T15n0639_007:0596c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以諸妙寶林，　　莊嚴於此界，　變作諸花池，　　滿八功德水，　若飲彼水者，　　遠離一切患，　速能離渴愛，　　得為世支提。",
        "translation": "Adorned by groves of marvelous treasures, they transform into pools of flowers filled with water of eight attributes, which, if drunk, will keep them far from all ills, quickly rid them of thirst, and enable them to attain worldly fruitfulness.",
        "source": "T15n0639_007:0596c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有餘世界，　　大士悉來集，　讚歎佛功德：　　『導師、釋師子。』",
        "translation": "There are other worlds where great men gather to praise the merits of the Buddha, saying, 'Instructor, lion of the Śākyas!'",
        "source": "T15n0639_007:0596c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有得聞音，　　能成世道師。",
        "translation": "If anyone hears their voice, they'll become a teacher of the worldly path.'",
        "source": "T15n0639_007:0597a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼得不思議，　　此經能顯示：　妙色金蓮花，　　億葉而稠密，　最尊妙覺寶，　　處此蓮花臺。",
        "translation": "Peter doesn't think about it, but this sūtra reveals this lotus-flower dense with a hundred million petals, the most honored jewel of marvelous awakening, sitting here on the lotus-flower dais.",
        "source": "T15n0639_007:0597a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　琉璃為莖葉、　　真金為花鬚，　德藏摩尼間，　　變作眾億花。",
        "translation": "With beryl as its stem and leaves and genuine gold as its beard, it's a mani-pedi of virtue that transforms into a multitude of billions of flowers.",
        "source": "T15n0639_007:0597a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所出諸妙香，　　聞者皆欣樂，　滅除一切病，　　六根悉充悅。",
        "translation": "The wonderful fragrance that emanates from it makes those who hear it happy, cures all ills, and fully pleases the six faculties.",
        "source": "T15n0639_007:0597a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪愛、及瞋、癡，　　悉皆一時盡，　除諸煩惱已，　　決定得成佛。",
        "translation": "Their craving, love, anger, and delusion are all ended at once, and after removing the afflictions, they're certain to become buddhas.",
        "source": "T15n0639_007:0597a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此花出妙音，　　讚歎佛功德，　法、僧亦復然，　　聲滿十方界。",
        "translation": "This flower produces a marvelous sound that praises the merits of the Buddha, and so do the Dharma and Saṃgha, filling the worlds in ten directions with sound.",
        "source": "T15n0639_007:0597a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　空門與無相，　　及以無願法，　那由眾聞已，　　皆得於不退。",
        "translation": "After hearing it, all the people of that land attain irreversibility through the teachings of emptiness, signlessness, and wishlessness.",
        "source": "T15n0639_007:0597a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所出諸音聲，　　往遍億世界，　無量眾聞已，　　發於菩提心。",
        "translation": "The sounds that emanate from them travel to hundreds of millions of worlds, and measureless multitudes hear them and give rise to the mind of enlightenment.",
        "source": "T15n0639_007:0597a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鴻鵠及孔雀、　　鸚鵡、鴛鴦等，　所出諸妙音，　　佛音最為上。",
        "translation": "Among the wonderful sounds that emanate from a great swan, a peacock, a parrot, and a mandarin duck, the Buddha's voice is the highest.",
        "source": "T15n0639_007:0597a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以勝妙寶樹，　　變現於此土，　端嚴最第一，　　珠鬘以垂布，　所有莊嚴具，　　一切諸佛剎，　於中最為勝，　　而現於此剎。",
        "translation": "A superbly beautiful jeweled tree transforms this land into the most beautiful, adorned with jewelry and draped with adornments, and all the buddha bases are the most beautiful of them all, and it appears here.",
        "source": "T15n0639_007:0597a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　妙衣瓔珞具，　　樹懸諸樂音，　妙花怡悅心，　　一切恒垂布，　是諸妙莊嚴，　　眾生得安樂，　釋迦所住持，　　由聖神力故。",
        "translation": "Their fine robes are adorned with diadem, their trees are draped with musical sounds, their hearts are delighted with fine flowers, and they are always draped with these fine adornments, which bring comfort to sentient beings and are maintained by the Śākyamuni because of the power of the noble spirits.",
        "source": "T15n0639_007:0597a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是要略說，　　釋師子功德，　菩薩大名稱，　　於此智無疑。",
        "translation": "Thus, we'll explain in brief the merits of the lion of the Śākyas, the great name of the bodhisattva, and his knowledge of this without doubt.",
        "source": "T15n0639_007:0597a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能於此信，　　其行不思議，　增長於智慧，　　如川赴於海。",
        "translation": "If they can have faith in this, their actions are inconceivable, and their wisdom grows like a river flowing into the ocean.",
        "source": "T15n0639_007:0597a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲量大海，　　無有能知數，　我說菩薩法，　　是皆不思議。",
        "translation": "If you want to measure the ocean, there's no way to know how many times I've explained the bodhisattva's teaching, which is inconceivable.",
        "source": "T15n0639_007:0597b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　難思諸菩薩，　　安住如此際，　演說美妙語，　　猶如恒河沙。",
        "translation": "It's hard to imagine bodhisattvas who stand at this level and speak beautiful words like the sands of the Ganges River.",
        "source": "T15n0639_007:0597b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量諸劫中，　　菩薩常無取，　若斷於取相，　　得近於菩提。",
        "translation": "Throughout countless eons, bodhisattvas have always been free of grasping, and if they stop grasping, they'll attain near-bodhi.",
        "source": "T15n0639_007:0597b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使法滅盡，　　終不毀淨戒，　於行無殘缺，　　菩薩眾之首。",
        "translation": "Even if the Dharma were to cease, he would never disparage the pure precepts, and he would lead a multitude of bodhisattvas without any defect in his practice.",
        "source": "T15n0639_007:0597b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　良由愛欲故，　　令戒有漏缺，　斷除於欲相，　　得於不逸定。",
        "translation": "It's because of craving that the precepts are tainted with deficiencies. After eliminating the aspect of craving, they attain a state of nonescapism.",
        "source": "T15n0639_007:0597b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常行寂滅定，　　不著於定味，　無著、無放逸，　　不為世所染。",
        "translation": "He always practices the concentration of cessation, doesn't get attached to the taste of concentration, doesn't get attached and doesn't become careless, and isn't stained by the world.",
        "source": "T15n0639_007:0597b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　出過於世間，　　能往諸佛國，　所謂安樂土，　　得見彌陀佛。",
        "translation": "Exceeding the world, he travels to the buddha lands, which are called the lands of paradise, and attains a vision of Amitâbha Buddha.",
        "source": "T15n0639_007:0597b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復見諸菩薩，　　具足相莊嚴，　到彼神通岸，　　究竟總持門。",
        "translation": "They also see bodhisattvas with perfectly proportioned adornment, reach the shore of their supernormal powers, and fully ascertain the profound approach.",
        "source": "T15n0639_007:0597b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　往遊億世界，　　頭面禮佛足，　復能作照明，　　無量諸佛剎。",
        "translation": "They travel to billions of worlds, bow their heads to the Buddha's feet, and create illumination for measureless buddha bases.",
        "source": "T15n0639_007:0597b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遣除一切患，　　及壞諸煩惱，　斷除諸結縛，　　一生補佛處。",
        "translation": "He removes all ills and destroys all afflictions, breaks all fetters, and takes refuge in the Buddha's place for one lifetime.",
        "source": "T15n0639_007:0597b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安樂諸眾生，　　永不墮惡趣，　彼國諸眾生，　　斷除諸惡道。",
        "translation": "They bring comfort to sentient beings, never falling into bad destinies, and sentient beings in that country are freed from bad destinies.",
        "source": "T15n0639_007:0597b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彌陀救護者，　　修治佛世界，　本習不放逸，　　不可思議劫。",
        "translation": "Amitâbha's protector cultivates the Buddha's world, cultivating no carelessness in his past habits for an unfathomable eon.",
        "source": "T15n0639_007:0597b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等勿懷疑，　　彼佛自在力，　能生增上信，　　速得生彼剎。",
        "translation": "Don't doubt his Buddha's sovereign power, which produces superior faith and speedy birth in that buddha's bases.",
        "source": "T15n0639_007:0597b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　女人聞歎國，　　能生增上信，　得為男子身，　　能往億佛剎。",
        "translation": "When a woman hears about the country of praise, she'll be able to develop superior faith, attain a man's body, and travel to a billion buddha bases.",
        "source": "T15n0639_007:0597b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　那由他億剎，　　所有諸供具，　悉供一切佛，　　不及慈一分，　常修於戒、定、　　無量禪解脫，　修三解脫門，　　速成人中上。",
        "translation": "At those billion buddha bases, they make offerings to all the buddhas, not even the least bit compassionate, always cultivate morality, concentration, and the liberation of immeasurable meditation, cultivate the three gates of liberation, and quickly become the best of people.",
        "source": "T15n0639_007:0597c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　末法惡世中，　　菩薩若持戒，　供佛常悲身，　　此供為最勝。",
        "translation": "In the bad world of the latter age, if a bodhisattva observes precepts and makes offerings to the Buddha's body of constant compassion, this offering is the most superior.",
        "source": "T15n0639_007:0597c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人供諸佛，　　過去及現在、　未來最勝尊。",
        "translation": "This person makes offerings to the buddhas, the most honored ones in the past, present, and future.",
        "source": "T15n0639_007:0597c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　惡世持戒者，　十方佛悉見。",
        "translation": "Those who observe precepts in a bad age are all seen by the buddhas of the ten directions.",
        "source": "T15n0639_007:0597c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩薩末法中，　護持佛禁戒，　　善子能護法。",
        "translation": "In the bodhisattva's final period, he upholds the Buddha's precepts, and he's a good son who protects the Dharma.",
        "source": "T15n0639_007:0597c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　女人聞讚彼寶國，　　若生增上信樂意，　便獲男子聰慧身，　　能往遊於億佛剎。",
        "translation": "If a woman hears and praises that precious land and gives rise to superior faith and gladness, she'll attain the body of a man with intelligence and be able to travel to billions of buddha bases.",
        "source": "T15n0639_007:0597c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　那由他億佛剎中，　　所有種種供佛具，　悉以供養於諸佛，　　不及慈心一少分，　修持禁戒及三昧，　　并習諸禪、四無量，　亦修三種解脫門，　　速得成於世無上。",
        "translation": "Those hundreds of millions of buddha bases contain all kinds of offerings to the buddhas, all of which are offered to them, not even a fraction of the compassionate mind, maintain precepts and samādhi, practice meditation and the four immeasurables, and cultivate the three gates of liberation, so they can quickly become unsurpassed in the world.",
        "source": "T15n0639_007:0597c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　供養諸佛常悲身，　　如此供佛世無比。",
        "translation": "They make offerings to the buddhas' bodies of constant compassion, and there's nothing like such offerings to the buddhas in the world.",
        "source": "T15n0639_007:0597c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有菩薩不捨戒，　　於彼末代惡世時，　是人能供一切佛，　　過去諸佛及現在，　及以未來最勝尊。",
        "translation": "If there's a bodhisattva who doesn't renounce the precepts, in that last bad age, that person can make offerings to all the buddhas, past buddhas, present buddhas, and future most honored ones.",
        "source": "T15n0639_007:0597c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有惡世持禁戒，　十方諸佛見是人。",
        "translation": "If there's a bad age in which he observes the precepts, this is the person seen by the buddhas of the ten directions.",
        "source": "T15n0639_007:0597c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩薩若於後惡世，　持於清禁佛所歎，　　是為我子能護法。」",
        "translation": "If a bodhisattva maintains the pure precepts in a later bad age, as praised by the Buddha, this is my son who can protect the Dharma.\"",
        "source": "T15n0639_007:0597c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告月光童子：「乃往過去無量無數不可思議曠大阿僧祇劫，于時有佛號曰聲德如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "It was then that the Buddha addressed Boy Moonlight, \"There was a time in the past, measureless and unfathomably vast and incalculably long, when there were buddhas named Śrīgupta Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Tamer of Beings, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T15n0639_007:0597c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_007:0597c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼聲德如來安置無量不可思議數眾生於阿耨多羅三藐三菩提，令諸人天而修佛業已，然後入於無餘涅槃。",
        "translation": "After placing an unfathomable number of sentient beings in the path to unsurpassed, perfect enlightenment and causing humans and gods to cultivate their buddha-activities, that śrāvaka then enters nirvāṇa without remainder.",
        "source": "T15n0639_007:0597c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_007:0597c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時有王名曰德音。",
        "translation": "Then there was a king named Dvāthavira.",
        "source": "T15n0639_007:0597c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王於佛、如來、應、正遍知涅槃之後，為供養聲德如來故，起八十四千萬億塔，一一塔前然百千萬那由他燈明，以一切伎樂、香花、寶鬘、塗香、末香，復以一切衣服、寶蓋、幢幡——皆為供養諸佛、如來——置於塔所。",
        "translation": "After the Buddha, Tathāgata, Arhat, and Perfectly Awakened One had passed away, that king built eighty-four thousand million million stūpas in order to make offerings to the Sound Tathāgata, and in front of each stūpa he installed one million thousand million nayutas of lamps, decorated them with all kinds of music, flowers, jewelry, perfumes, and incense, and placed them at the stūpas with all kinds of clothing, jeweled canopies, and banners and streamers-all for the benefit of the Buddhas and Tathāgatas.",
        "source": "T15n0639_007:0597c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時德音王於如來舍利塔所獻供養已，會滿八十百千萬億那由他大菩薩眾集已，供給一切樂具——是諸菩薩皆為大法師，善能說法得無量辯才、善能顯示無量諸法真實功德。",
        "translation": "\"After he had made offerings at the Tathāgata's relics pagoda, King Tein gathered a congregation of eighty trillion nayutas of great bodhisattvas and offered them all the musical implements - bodhisattvas who are all great Dharma teachers, skilled in teaching the Dharma with measureless eloquence, and skilled in displaying the true merits of measureless dharmas.",
        "source": "T15n0639_007:0598a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_007:0598a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾中有比丘，名安隱德，在彼會坐，年在弱冠，顏艶髮黑，住於童真賢妙之行，曾不受於色欲之樂，始受具戒初夏之時。",
        "translation": "At the time, there was a monk named Aniruddha sitting there in the assembly, young and weak, with a bright face and black hair, abiding in the wondrous ways of a youthful and virtuous man who had never enjoyed the pleasures of form and desire and who had just received the full set of precepts in the early summer.",
        "source": "T15n0639_007:0598a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_007:0598a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時德音王請大菩薩眾，為欲滿足六波羅蜜菩薩藏、大陀羅尼善巧方便自在無礙，是故於其夜中請大菩薩眾在於佛前而為法會。",
        "translation": "It was then that King Tejñā invited a large assembly of bodhisattvas to perform a Dharma assembly before the Buddha in the middle of the night because he wanted to fulfill the six perfections of the bodhisattva canon and the great dhāraṇī of skillful means without impediment.",
        "source": "T15n0639_007:0598a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時百千萬那由他燈皆悉熾明，掃灑堂宇、散種種花、敷種種妙衣。",
        "translation": "One hundred million nayutas of lamps were then all blazing brightly, sweeping the halls, scattering various flowers, and laying out various kinds of marvelous clothing.",
        "source": "T15n0639_007:0598a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時德音王與其後宮妃后、婇女、及於輔相城邑人民與諸眷屬以眾伎樂、執持塗香、末香、花鬘、衣服、寶蓋、幢幡，悉皆出已供養佛塔；供養已訖，共八萬宮人——為聽法故——皆昇高殿。",
        "translation": "\"At the time, King Tejñān, his inner palace, his queen, his maids, the people of the auxiliary city, and their retinues all produced a multitude of musical performances and carried scented incense, powdered incense, flower garlands, clothing, precious canopies, and banners, all of which were offered to the Buddha's stūpa; after they had finished making their offerings, 80,000 people from the palace -- for the sake of listening to the teaching -- ascended to the high hall.",
        "source": "T15n0639_007:0598a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，無量天人為聞法故悉來集會。",
        "translation": "At the time, measureless gods and humans had gathered here because they had heard the teaching.",
        "source": "T15n0639_007:0598a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，安隱德比丘見百千億那由他燈熾然遍照，觀大眾會即作是念：『我亦行於大乘，樂求一切諸法體性平等無戲論三昧。",
        "translation": "\"At the time, the monk Aniruddha saw a hundred hundred billion nayutas shining brightly and pervasively, and he observed the large assembly and thought, \"I, too, have practiced the great vehicle and have longed for the samādhi in which the essences of all things are equal in nature and free from conceptual elaboration.",
        "source": "T15n0639_007:0598a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我今欲獲是三昧者，應當供養此佛廟塔。",
        "translation": "If I want to attain this concentration now, I should make offerings to this Buddha's stūpa.",
        "source": "T15n0639_007:0598a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當作如斯供養，令諸天、人、阿修羅等生奇特想，歡喜踊躍得法光明，令我供具映蔽彼王所有供具、令德音王及宮人眷屬見我供養皆悉歡喜。』",
        "translation": "I will make such an offering now, so that gods, humans, asuras, and others will have strange notions and rejoice and dance to obtain the Dharma light, so that my offerings will reflect the king's offerings, and so that King Tein and his retinue will all rejoice when they see my offerings.'",
        "source": "T15n0639_007:0598a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，安隱德菩薩見於大眾在於塔前為聽法故，即於其夜在佛塔前衣纏右臂以油塗之，為供養佛故而熾然之。",
        "translation": "\"Seeing the crowd in front of the stūpa and listening to the teaching, the Aniruddha Bodhisattva wrapped his right arm in oil and rubbed it with his robe in front of the stūpa that night, blazing it with oil as an offering to the Buddha.",
        "source": "T15n0639_007:0598a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時安隱德菩薩住增上信、求阿耨多羅三藐三菩提，然右臂已，其心無異、顏色不變。",
        "translation": "After he had wrapped his right arm in oil, his mind didn't differ and his color didn't change.",
        "source": "T15n0639_007:0598b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_007:0598b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時安隱德比丘然臂之時大地震動，其明映蔽無量百千行燈悉無光照，以此臂光遍照十方。",
        "translation": "At the time, a great earthquake shook the Aniruddha monk's arm, and its light reflected off measureless hundreds of thousands of portable lamps that had no light at all, and the light from that arm shone everywhere in the ten directions.",
        "source": "T15n0639_007:0598b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，安隱德菩薩歡喜充滿，於一切諸法體性平等無戲論三昧，以和雅美妙辯正言音辭句而作歌頌，令諸大眾悉皆普聞。",
        "translation": "At the time, the Aniruddha Bodhisattva was filled with joy, and in the samādhi of equality in essence of all things and absence of conceptual elaborations, he sang and spoke with elegant, beautiful, eloquent words and phrases, causing the whole assembly to hear them universally.",
        "source": "T15n0639_007:0598b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾中萬二千忉利天子心生歡喜設種種供養，皆為法故而來會此。",
        "translation": "At the time, 12,000 of the many Dharmadeva gods rejoiced and made various offerings, all coming here for the sake of the Dharma.",
        "source": "T15n0639_007:0598b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，德音王在高樓上，并後宮眷屬妃后、婇女，見安隱德比丘然其右臂，烔然紅焰遍照諸方。",
        "translation": "\"At the time, King Tein was on a high building, and his retinue, ladies, and women saw the peaceful monk Virtue standing on his right arm, with a red flame that shone hotly in all directions.",
        "source": "T15n0639_007:0598b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已，心作是念：『此比丘必獲神足，乃作如斯希有變現，於其身命無有悋惜。』",
        "translation": "After he saw that, he thought, 'Surely this monk has attained miraculous abilities and has produced such a rare manifestation, and he doesn't cherish his body and life.'",
        "source": "T15n0639_007:0598b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，德音王見安隱德比丘希有神變心生愛樂，以淨信心及自善根力之所熏資，與諸后妃、八萬婇女從千肘高殿放身投下——為欲見此菩薩比丘——恭敬善根之力得現果報，即為天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、摩睺羅伽之所護持不令墮落。",
        "translation": "\"At the time, King Tein saw the rare and miraculous transformation of that peaceful monk and became delighted. With pure faith and the strength of his own good roots, he, his consorts, and 80,000 concubines lowered themselves from a thousand elbows high into the palace to see this bodhisattva monk, and the power of their good roots of respect and reverence brought about the present reward of being protected from falling by gods, dragons, yakṣas, gandharvas, asuras, garuḍas, and mahoragas.",
        "source": "T15n0639_007:0598b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、摩睺羅伽護持力故，是德音王及后妃、婇女，雖墮高殿而於身心無所傷損，不疲、不怖。",
        "translation": "Because of the protective power of gods, dragons, yakṣas, gods of the land, asuras, garuḍas, and mahoragas, King Teruyuko, his consort, and his daughter didn't suffer any physical or mental harm even though they fell into the high palace, and they didn't become weary or frightened.",
        "source": "T15n0639_007:0598b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，德音王兩手抱臂而大號泣，一切大眾皆亦如是，以見安隱德比丘然其臂髆如瞻波花鬘，臂復纖長如象王鼻；一切眾人見者奇歎，莫不呼嗟、悲泣雨淚。",
        "translation": "\"At the time, King Tejombo wrapped his arms around them and wept profusely, and so did the whole crowd when they saw that Aniruddha Bhikṣu had shoulder blades like a campa flower garland and long, slender arms like the trunk of an elephant king.",
        "source": "T15n0639_007:0598b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，安隱德比丘見此大王及諸人眾皆悉悲泣懊惱，而問王言：『大王！",
        "translation": "\"Seeing the great king and the crowd weeping and distressed, the monk Aniruddha then asked the king, 'Great king!",
        "source": "T15n0639_007:0598b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故悲號墮淚及諸大眾悲啼乃爾？』",
        "translation": "Why is it that you wail and shed tears and that the people lament?'",
        "source": "T15n0639_007:0598b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時德音王以偈答曰：「『大智安隱德！",
        "translation": "\"King Deva-nyeon then replied in verse, 'Great wisdom and hidden merit!'",
        "source": "T15n0639_007:0598c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　聰慧勝法師！",
        "translation": "Wise and Excellent Master!",
        "source": "T15n0639_007:0598c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　見汝然身分，　　以是故哀泣。",
        "translation": "Seeing you in such a state causes me to weep.",
        "source": "T15n0639_007:0598c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝顏甚端妙，　　猶如熾火聚，　　見汝毀身分，　　故增我憂惱。",
        "translation": "Your face is so beautiful that it's like a blazing fire, and seeing you disfigured has caused me to become sad and distressed.",
        "source": "T15n0639_007:0598c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝然右臂時，　　光耀十方界，　　映蔽於諸燈，　　星月復不現。",
        "translation": "When you bare your right arm, your light shines brightly in the worlds of the ten directions, blinding the lamps and making the stars and moon invisible.",
        "source": "T15n0639_007:0598c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大地悉震動，　　汝心無傾搖，　　我心起於敬，　　知汝非凡夫。",
        "translation": "The earth shakes, but your mind isn't shaken, and I feel respect for you, knowing you're not an ordinary man.",
        "source": "T15n0639_007:0598c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於其千肘殿，　　共八萬宮人，　　我身自投下，　　身竟無諸患。",
        "translation": "In that thousand-elbow palace with 80,000 people in it, I threw myself down, and my body was completely free of trouble.",
        "source": "T15n0639_007:0598c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　善哉！",
        "translation": "Good!",
        "source": "T15n0639_007:0598c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝淨智！",
        "translation": "Your pure cognition!",
        "source": "T15n0639_007:0598c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　善哉！",
        "translation": "Bravo!",
        "source": "T15n0639_007:0598c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意無上！",
        "translation": "unsurpassed in intention!",
        "source": "T15n0639_007:0598c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　善哉！",
        "translation": "Bravo!",
        "source": "T15n0639_007:0598c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精進士！",
        "translation": "Seishin!",
        "source": "T15n0639_007:0598c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　善哉！",
        "translation": "Bravo!",
        "source": "T15n0639_007:0598c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成大信！",
        "translation": "to become a great believer!",
        "source": "T15n0639_007:0598c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝然身臂時，　　其心無動異，　　發於歡喜心，　　兼復說妙法。",
        "translation": "\"When you were standing there with your body and arms, your mind was unmoving, and you gave rise to a joyous heart and also explained the wonderful Dharma.",
        "source": "T15n0639_007:0598c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　猶若圓滿月，　　復如淨空日，　　如須彌山王，　　端妙亦如是。",
        "translation": "Just like the full moon, and like the pure sky sun, like the king of Mt. Sumeru, you're also quite marvelous.",
        "source": "T15n0639_007:0598c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我作如是願，　　滿足大精進，　　故捐所愛身，　　利益於眾生。",
        "translation": "I made this vow to fulfill great zeal, so I gave up the body I loved to benefit sentient beings.",
        "source": "T15n0639_007:0598c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　愛法故悲啼，　　喜樂廣無垢，　　汝已毀身分，　　故我極憂惱。』",
        "translation": "Because I love the Dharma, I lament, and my joy and happiness are vast and undefiled; you've disgraced your identity, so I'm deeply distressed.'",
        "source": "T15n0639_007:0598c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天人所供者，　　無邊勝辯才，　　安隱德報王，　　便說是偈言：　『不以無身、手，　　故名闕身分；　　若不持戒者，　　是名身分缺。",
        "translation": "The gods and humans who make offerings to him, the infinitely eloquent, peaceful king of rewards of virtue, then spoke this verse, saying, 'It's not because I don't have a body or hands that I'm called lacking identity; if someone doesn't observe the precepts, this is called lacking identity.",
        "source": "T15n0639_007:0598c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以此臭穢身，　　我已供如來，　　難思議福田，　　一切世間塔。",
        "translation": "Because of this smelly body, I've offered it to the Tathāgata, a field of inconceivable merit, and all the world's stūpas.",
        "source": "T15n0639_007:0598c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人三千界，　　滿中七寶沙，　　於佛、世尊所，　　為菩提故施，　　雖有施此供，　　餘供復勝此，　　若能知法空，　　便能捨身命。",
        "translation": "If a person's 3,000 realms are filled with seven jewels and sands, and they give to the Buddha or the Bhagavān for the sake of bodhi, even though they make this offering, other offerings are superior, then they'll be able to abandon their lives if they can know the emptiness of things.",
        "source": "T15n0639_007:0598c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我今說實語，　　大王！",
        "translation": "Now, I'll tell it like it is, Great King!",
        "source": "T15n0639_007:0599a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願諦聽，　　并及此眾會，　　一切聽我言。",
        "translation": "'May I ask you to listen closely, and all of you in this congregation, to listen to my words.",
        "source": "T15n0639_007:0599a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若我審決定，　　得成無上者，　　如此實不虛，　　令地六種動。』",
        "translation": "'If I were to examine and decide, I would attain the unsurpassed one, for this would really be no mistake, causing the earth to move in six ways.'",
        "source": "T15n0639_007:0599a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　說於此語時，　　大地便震動，　　見於希有事，　　諸天大歡喜。",
        "translation": "When he spoke these words, the earth shook, and the gods rejoiced when they saw something rare.",
        "source": "T15n0639_007:0599a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　人天歡喜已，　　發於菩提心，　　無量難思眾，　　皆趣無上智。",
        "translation": "After rejoicing, humans and gods give rise to the mind of enlightenment, and measureless, unfathomable multitudes all arrive at unsurpassed knowledge.",
        "source": "T15n0639_007:0599a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　安隱德比丘，　　利益一切眾，　　安處億眾生，　　置於無上智。",
        "translation": "That peaceful monk benefits all sentient beings, settles down with hundreds of millions of sentient beings, and sets his sights on unsurpassed knowledge.",
        "source": "T15n0639_007:0599a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　『以此實法言：　　推體皆無實，　　此語審不虛，　　令臂還如故。",
        "translation": "'This true teaching says, 'The inference is insubstantial, but this statement is examined as not false and causes the arm to return as it was.'",
        "source": "T15n0639_007:0599a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若此法審實，　　安隱名亦無，　　十方悉推求，　　空故不可得。",
        "translation": "If this teaching is examined as real, then its name of peace and security is also nonexistent, and it's fully investigated in ten directions, but it's therefore unobtainable because it's empty.",
        "source": "T15n0639_007:0599a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸法猶如響，　　聲出於其中，　　求聲不可得，　　如是知諸法。",
        "translation": "All dharmas are like sounds, from which sound emerges, and seeking sound is unobtainable; thus are the dharmas known.",
        "source": "T15n0639_007:0599a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　畢竟了達者，　　於空無所畏，　　彼人語真實，　　相火不能燒。",
        "translation": "Those who completely comprehend it have no fear of emptiness, and their words are so true that they can't be burned by fire.",
        "source": "T15n0639_007:0599a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所有世眾生，　　天、人、夜叉、龍，　　一切智威力，　　悉令悟寂定。",
        "translation": "All the world's sentient beings, gods, humans, yakṣas, and dragons, are enlightened by the power of all knowledge, and they are all made to realize tranquility and concentration.",
        "source": "T15n0639_007:0599a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人及與天，　　所有世苦難，　　不退轉威德，　　一切速能壞。』",
        "translation": "If people and gods were to suffer all the world's hardships, the mighty power of nonretrogression would quickly destroy them all.'",
        "source": "T15n0639_007:0599a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　說於此語時，　　身臂還如本，　　安隱德比丘，　　身相具莊嚴。",
        "translation": "When he spoke these words, his body and arms returned to their origin, and the peaceful and virtuous monk's body was adorned with features.",
        "source": "T15n0639_007:0599a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸天千億數，　　住淨虛空中，　　信心以曼陀，　　散彼比丘身，　　此皆過人花，　　遍滿閻浮界。",
        "translation": "A hundred billion gods abide in pure space, confidently scattering that monk's body with a maṇḍala, which is more than a human flower, all over the Jambudvīpa realm.",
        "source": "T15n0639_007:0599a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天女億那由，　　伎樂諸歌詠，　　安隱德比丘，　　作大師子吼。",
        "translation": "A hundred million nayutas of goddesses sing and dance, and that peaceful, virtuous monk makes the roar of the great disciple.",
        "source": "T15n0639_007:0599b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　牟尼如來尊，　　令餘億佛土，　　各各於己剎，　　彼清淨大士，　　安隱德比丘，　　傳說其名號。",
        "translation": "The venerable Muni-tathāgata causes each of the billions of other buddha lands to remain in their own bases, where pure bodhisattvas and peaceful virtuous monks transmit their names.",
        "source": "T15n0639_007:0599b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　比丘、比丘尼、　　清信士男、女、　　天、龍及夜叉、　　乾闥、緊羅等，　　彼聞決定業，　　安隱得離垢，　　信心求道者，　　其數如恒沙。",
        "translation": "The number of monks, nuns, pure faithful men and women, gods, dragons, yakṣas, gandharvas, and kiṃnara who hear about determined behavior, become tranquil, and part with the stain, and faithfully pursue the path is like an infinite number.",
        "source": "T15n0639_007:0599b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　安隱德比丘，　　聰慧得自在，　　為於佛智故，　　然臂不為憂。",
        "translation": "That peaceful monk of virtue is so clever and intelligent that he attains mastery, for the sake of the Buddha's wisdom, yet his arm isn't worried.",
        "source": "T15n0639_007:0599b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼人於千剎，　　變身如恒沙，　　臂光遍照曜，　　猶如劫盡火。",
        "translation": "That person at a thousand buddhas transforms into a body like an infinite number of sands, and the light from his arms shines everywhere like the fire that ends an eon.",
        "source": "T15n0639_007:0599b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雨以眾香末，　　遍滿一切土，　　下至於大地，　　上天悉來集。",
        "translation": "He rains down powdered incense that fills all the lands, reaches down to the earth, and is gathered by the gods.",
        "source": "T15n0639_007:0599b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切供養具，　　莊嚴於此剎，　　其地滿真珠，　　供養安隱德；　　一切眾寶花，　　莊嚴於此剎，　　龍雨妙真珠，　　供養安隱德；　　復以一切寶，　　嚴飾於此剎，　　龍雨寶莊嚴，　　為供安隱德。",
        "translation": "All the things that are offered adorn this buddha, and the ground is filled with genuine pearls to support their peaceful virtue; all the many precious flowers adorn this buddha, and dragons rain down marvelous genuine pearls to support their peaceful virtue; and all the treasures adorn this buddha, and dragons rain down jewels to adorn it for their peaceful virtue.",
        "source": "T15n0639_007:0599b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　最勝釋師子，　　住於耆闍山，　　於諸比丘前，　　而作師子吼。",
        "translation": "The most excellent lion of the Śākyas lives on Mount Gṛdhrakūṭa, and he makes a lion's roar in front of the monks.",
        "source": "T15n0639_007:0599b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　安隱德我是，　　德音是彌勒，　　於彼千億劫，　　共修菩提行。",
        "translation": "\"I am An Yinde, and the voice of that virtuous one is Maitreya, who has cultivated the practice of enlightenment together for a thousand billion eons.",
        "source": "T15n0639_007:0599b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　時見持戒者，　　安隱德智慧，　　無量諸女人，　　悉變為男子。",
        "translation": "When they see someone who observes the precepts, they're so peaceful and virtuous and wise that measureless women are transformed into men.",
        "source": "T15n0639_007:0599b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸佛悉授記，　　終無有疑惑，　　彼速得成就，　　證世自然智。",
        "translation": "Fully ordained by the buddhas, he'll never have any doubts, and he'll quickly attain the realization of natural worldly wisdom.",
        "source": "T15n0639_007:0599b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　聞於此經已，　　說決定功德，　　於己不生著，　　應學如是法。",
        "translation": "After hearing this sūtra that explains its definite merits, they don't become attached to themselves and should train in this way.",
        "source": "T15n0639_007:0599c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月燈三昧經卷第七",
        "translation": "Yue Deng sanmei jing, vol. 7",
        "source": "T15n0639_007:0599c04_0",
        "is_bad_quality": false
    }
]