[
    {
        "source_sentence": "佛說入無分別法門經",
        "translation": "Sutra on Entering the Dharma Gate of Non-differentiation",
        "source": "T15n0654_001:0805b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Minister of Light for the Tripiṭaka Translation of the Sutra of the Western Paradise, the Grand Master of the Chaofeng",
        "source": "T15n0654_001:0805b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳法大師賜紫臣施護奉　詔譯",
        "translation": "Master Chuanfa Zhichen Shihuofeng Translation of the Imperial Edict",
        "source": "T15n0654_001:0805b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時，佛與無數百千大眾俱。",
        "translation": "Thus I have heard: One time, the Buddha was accompanied by measureless hundreds of thousands of great multitudes.",
        "source": "T15n0654_001:0805b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸大眾恭敬圍繞聽佛說法，其所演說，謂以大乘無分別法而為發起。",
        "translation": "Those large crowds respectfully surrounded the Buddha and listened as he taught, which was to say that he had given rise to the great vehicle teaching without discriminated dharmas.",
        "source": "T15n0654_001:0805b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊普觀大會諸菩薩眾。",
        "translation": "At the time, the Bhagavān was observing the entire assembly of bodhisattvas.",
        "source": "T15n0654_001:0805b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時會中有一菩薩名無分別光，從座而起，偏袒右肩，右膝著地，合掌向佛而白佛言：「唯願世尊，演說入無分別法門，令諸菩薩聞是法已，如理修學。」",
        "translation": "At that time, a bodhisattva named Indiscriminate Light rose from his seat, bared his right shoulder, knelt on his right knee, put his palms together, and said to the Buddha, \"Please, Bhagavān, explain the teaching of entering the Dharma of nondiscrimination so that after hearing this teaching, the bodhisattvas will cultivate it according to reality.\"",
        "source": "T15n0654_001:0805b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子，汝等諦聽，我當宣說入無分別法門。」",
        "translation": "The Buddha said, \"Good sons, listen closely, for I will explain the entry into the Dharma-gate of nondiscrimination.\"",
        "source": "T15n0654_001:0805b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時無分別光菩薩復白佛言：「善哉，世尊！",
        "translation": "The Bodhisattva of Undiscriminated Luminosity then again said to the Buddha, \"Good, Bhagavān!",
        "source": "T15n0654_001:0805b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T15n0654_001:0805b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸菩薩受教而聽。",
        "translation": "The bodhisattvas then accepted the teaching and listened.",
        "source": "T15n0654_001:0805b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T15n0654_001:0805b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩得聞增上無分別法，住無分別心，即一切分別相離。",
        "translation": "\"If bodhisattvas hear about the superior nondiscriminating dharma and abide in the nondiscriminating mind, that's when all discriminating marks are removed.",
        "source": "T15n0654_001:0805b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此言無分別者，應先了知，從初自性有分別相。",
        "translation": "When someone says nondiscriminated, they should first understand that, from the beginning, there are discriminated aspects of self-nature.",
        "source": "T15n0654_001:0805b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別相者，謂取捨二法，即此取捨是自性分別相。",
        "translation": "The discriminated characteristic refers to the two things of appropriating and rejecting, which are the discriminated characteristics of the self-nature of appropriating and rejecting.",
        "source": "T15n0654_001:0805c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此即起有漏事相；以有漏相故，即有五取蘊。",
        "translation": "As a result, contaminated phenomena and characteristics arise, and because of these contaminated characteristics, there are the five appropriated aggregates.",
        "source": "T15n0654_001:0805c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五取蘊者，謂色取蘊、受取蘊、想取蘊、行取蘊、識取蘊。",
        "translation": "The five appropriated aggregates are the appropriated aggregate of form, the appropriated aggregate of feeling, the appropriated aggregate of perception, the appropriated aggregate of volition, and the appropriated aggregate of consciousness.",
        "source": "T15n0654_001:0805c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T15n0654_001:0805c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何得離自性分別相？",
        "translation": "How can we be free of the discriminated aspects of self-nature?",
        "source": "T15n0654_001:0805c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂不現前別異作意，如是即離自性分別相。",
        "translation": "It's the mental attitude of not manifesting a specific difference, which is to be free of the discriminated characteristic of self-nature.",
        "source": "T15n0654_001:0805c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若異自性取相是有所行，此不能得無礙相應。",
        "translation": "If grasping to marks other than their own nature were something to do, this wouldn't be an unobstructed association.",
        "source": "T15n0654_001:0805c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故應知，布施無色、無分別相，持戒、忍辱、精進、禪定、智慧無色無分別相。",
        "translation": "Therefore, you should know that generosity has no form and no discriminating marks, and observing precepts, patience, effort, meditation, and wisdom have no form and no discriminating marks.",
        "source": "T15n0654_001:0805c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0654_001:0805c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂自性無色、功用無色、真實無色。",
        "translation": "It means that their nature is formless, their function is formless, and their true formlessness is formless.",
        "source": "T15n0654_001:0805c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若起別異作意，欲離分別相者，即後有無色、無分別相可離；如是即有所行，而不能得無礙相應。",
        "translation": "If someone gives rise to discriminating thoughts and wants to part with discriminating marks, then there's subsequently formlessness and nondiscriminating marks to part with; thus, there are practices that can't be associated with nonobstruction.",
        "source": "T15n0654_001:0805c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故應知空、無色、無分別相。",
        "translation": "Therefore, you should know that emptiness, form, and the characteristic of nondiscrimination are present.",
        "source": "T15n0654_001:0805c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「真如實際勝義諦法界無色、無分別相。",
        "translation": "\"The Dharma realm of the true and actual truth of the ultimate truth has no form and no discriminating marks.",
        "source": "T15n0654_001:0805c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0654_001:0805c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂自性無色、功用無色、真實無色，是故應於無色、無分別相，不異性觀、不作意離。",
        "translation": "It means that self-nature is formless, function is formless, and reality is formless; therefore, you should observe formlessness and nondiscriminating marks without dissimilarity and without contemplating separation.",
        "source": "T15n0654_001:0805c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若別異作意離者，即於無色、無分別相後有所得。",
        "translation": "If someone discriminates and intents to avoid them, then they will attain something after formlessness and nondiscriminated marks.",
        "source": "T15n0654_001:0805c16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃為有所行，即不能得現前無礙相應。",
        "translation": "Such being the case, there's something to practice, which means it's not possible to attain unobstructed association with the present.",
        "source": "T15n0654_001:0805c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0654_001:0805c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂初地所得法，無色、無分別相；乃至十地所得法，亦無色、無分別相；得無生法忍，亦無色、無分別相；得授記別，亦無色、無分別相；得嚴淨佛土成熟有情，亦無色無分別相；乃至得一切相智，亦無色、無分別相。",
        "translation": "It means that the teaching attained in the first ground is without form and without discriminated marks, and the teaching attained in the tenth ground is also without form and without discriminated marks; attaining the patient acceptance of the nonarising of qualities, it's also without form and without discriminated marks; attaining the assurance of assurance of specificity, it's also without form and without discriminated marks; attaining the maturation of sentient beings in the Buddha Land of Adornment and Purity, it's also without form and without discriminated marks; and even attaining the wisdom of all characteristics, it's also without form and without discriminated marks.",
        "source": "T15n0654_001:0805c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說，謂以自性無色、功用無色、真實無色。",
        "translation": "Thus, it's explained that it's because the essential nature is formless, the function is formless, and the real thing is formless.",
        "source": "T15n0654_001:0805c23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩於是諸所得法，起異所得、分別相別、異作意者，即於一切無分別相，悉起別異作意，如是即與無分別理而不相應，彼不能入無分別界。",
        "translation": "\"If a bodhisattva produces oppositely-acquired, discriminated characteristics, and different contemplations regarding these acquired things, that is, he produces different contemplations regarding all nondiscriminated characteristics, which are not associated with the principle of nondiscrimination, and he can't enter the nondiscriminated realm.",
        "source": "T15n0654_001:0805c24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住三摩地，心入無分別界，而於所入起無所得想，彼正相應，是正所行，是正所修、正所作事，是正作意，住無作行而無發悟，是名真入無分別界所行清淨。",
        "translation": "If a bodhisattva abides in samādhi, enters the nondiscriminated realm with his mind, and gives rise to unobtained notions about what he's entering, this is correctly associated with what's correctly practiced, what's correctly cultivated, what's correctly done, and what's correctly intended, abiding in unconstructed practice without awakening, this is called the purification of what's practiced when truly entering the nondiscriminated realm.",
        "source": "T15n0654_001:0805c28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子，所言無分別界者，以何義故，名無分別界？",
        "translation": "\"Good sons, what is the meaning of the expression 'nondiscriminated realm'?",
        "source": "T15n0654_001:0806a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於一切色過諸分別，於一切根過諸分別，過一切分別境界，過一切表了，一切煩惱、隨煩惱障無所攝藏，是故說名無分別界。",
        "translation": "It means that there's more discrimination of all forms, more discrimination of all faculties, more discriminated objects, more manifest objects, and no place to store all afflictions and the accompanying afflictive hindrances; therefore, it's called the nondiscriminated realm.",
        "source": "T15n0654_001:0806a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是無分別界中，無色、無見、無住、無礙、無表了、無種種相，若菩薩如是了知，已如是安住無分別界，是即入無分別智，與虛空等，於一切法無所觀而觀，得大樂行，增長大心，得大智慧，大說無礙。",
        "translation": "In this nondiscriminated realm, there's no form, no view, no abiding, no obstruction, no expression, and no variety of characteristics, and if a bodhisattva thus understands and has thus abided in the nondiscriminated realm, he then enters nondiscriminated cognition, which is the same as space, observes everything without contemplating anything, attains great joyful conduct, develops great mind, attains great wisdom, and greatly explains without obstruction.",
        "source": "T15n0654_001:0806a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切時、一切相，普為一切眾生作大利益，得勇力增長，於無發悟佛事得大輕安。",
        "translation": "At all times and in all forms, they universally work for the great benefit of all sentient beings, attain increased courage, and attain great peace of mind in the absence of enlightening Buddha-works.",
        "source": "T15n0654_001:0806a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子，譬如一處有一大石山，於其山下，有大寶藏眾寶充滿，所謂銀寶、金寶及種種異寶，復有大摩尼寶出大光明。",
        "translation": "\"Good sons, suppose there's a place where there's a large rocky mountain, and underneath it there's a great treasure house filled with many treasures, such as silver treasure, gold treasure, and various other kinds of treasure, and there's also a great maṇi treasure that emits great radiance.",
        "source": "T15n0654_001:0806a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，有求寶人，來詣此山，欲求珍寶。",
        "translation": "At the time, there were treasure seekers who came to this mountain, wanting to find treasures.",
        "source": "T15n0654_001:0806a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有一人，先知其寶所藏伏處，見來求者即謂彼言：『汝求寶人，當知此處，大石山下，有大寶藏眾寶充滿，復有大摩尼寶出現光明。』",
        "translation": "One of them, foreseeing where his treasure was hidden, saw the seeker and told him, 'You treasure seekers, you should know that here, underneath this large rocky mountain, there's a great treasure house filled with many treasures, and there's a great maṇi treasure that shines brightly.'",
        "source": "T15n0654_001:0806a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時求寶人聞其言已，即時勤力堅固作意，開鑿彼山，取大摩尼寶。",
        "translation": "After hearing his words, the treasure seeker immediately worked hard and resolutely with the intention of opening up that mountain and retrieving the great precious maṇi jewel.",
        "source": "T15n0654_001:0806a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開已，乃見銀寶現光、石無光現。",
        "translation": "After opening it, he then saw the silver treasure shining brightly and the stone lacking light.",
        "source": "T15n0654_001:0806a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人見已，不作大珍寶想。",
        "translation": "After he saw that, he didn't conceive of great treasures.",
        "source": "T15n0654_001:0806a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時先知寶人亦如前人，開鑿彼山而取其寶，開已，乃見金寶現光、石無光現，是人亦復不作大珍寶想。",
        "translation": "Like the person before him, the seer of the treasure also opened up that mountain and took its treasure. After opening it up, he saw gold treasure shining and rocks lacking light, and that person also didn't think of great treasures.",
        "source": "T15n0654_001:0806a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時知寶人，乃作是言：『汝求寶人，不應勤力堅固作意而求大寶。",
        "translation": "The man who knew the treasure then said, 'You seekers of treasure shouldn't diligently and resolutely contemplate seeking great treasure.",
        "source": "T15n0654_001:0806a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不作意者，應得見彼廣大珍寶；以作意故，寶不能得。",
        "translation": "If you don't contemplate it, you'll see that great treasure, but because you contemplate it, the treasure won't be attained.",
        "source": "T15n0654_001:0806a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有得彼大珍寶者，即得大富，如意自在，自他俱利，普遍施作，悉得圓滿。』」",
        "translation": "If someone attains that great treasure, they'll become very wealthy, freely attain their own will, benefit both themselves and others, and universally work to their fullest.'\"",
        "source": "T15n0654_001:0806a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子，如是等事以喻說故，若有菩薩知是義者，即見是義如先所言。",
        "translation": "The Buddha said, \"Good sons, since these things are explained metaphorically, if a bodhisattva knows their meaning, he'll see their meaning as explained earlier.",
        "source": "T15n0654_001:0806a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一大石山者，即煩惱一法，二處作行增語。",
        "translation": "A large rocky mountain is one thing of affliction, and two places of activity add to that statement.",
        "source": "T15n0654_001:0806a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山下有寶藏，即無無分別界增語。",
        "translation": "It's reinforced by the statement that there's a treasure house underneath the mountain, which means there's no nondiscriminated element.",
        "source": "T15n0654_001:0806b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼求寶人者，即是菩薩增語。",
        "translation": "That person who seeks the treasure is a bodhisattva who speaks intensively.",
        "source": "T15n0654_001:0806b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼知寶人者，即是如來增語。",
        "translation": "\"He who knows the precious person is the Tathāgata's augmentation.",
        "source": "T15n0654_001:0806b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "石自性者，即是有分別自性增語。",
        "translation": "\"That's the intrinsic nature of the stone, which is the discriminated intrinsic nature augmenting the statement.",
        "source": "T15n0654_001:0806b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開鑿取寶者，即不作意增語。",
        "translation": "\"Someone who opens a stone and takes away its treasure is a non-intentional augmentation.",
        "source": "T15n0654_001:0806b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "石下有銀光者，是自性分別增語。",
        "translation": "Someone who has a silvery light under a stone is an augmentation of their own nature with discrimination.",
        "source": "T15n0654_001:0806b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "石下有金光者，是空等分別相增語。",
        "translation": "Someone who has a golden light under a stone is making a statement about emptiness and other discriminating characteristics.",
        "source": "T15n0654_001:0806b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "石下有種種寶光者，是有所得分別相增語。",
        "translation": "Someone who has various kinds of jewelry shining from beneath a stone is making a statement about the discriminating aspects of existence.",
        "source": "T15n0654_001:0806b07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念求大寶者，即是樂入無分別界。",
        "translation": "Someone who's mindful of seeking great treasure is delighting in the nondiscriminated element.",
        "source": "T15n0654_001:0806b08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子，是義云何？",
        "translation": "\"Good sons, what does this mean?",
        "source": "T15n0654_001:0806b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩如所說能如實觀者，即入無分別界。",
        "translation": "If a bodhisattva thus explains that he can truly observe, he'll enter the nondiscriminating realm.",
        "source": "T15n0654_001:0806b09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又善男子！",
        "translation": "And good sons!",
        "source": "T15n0654_001:0806b10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩當於無分別界，如虛空界住。",
        "translation": "\"Bodhisattvas should abide in a realm without discriminated elements, like the element of space.",
        "source": "T15n0654_001:0806b10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0654_001:0806b11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色自性，若分別自性，如是觀時相不現前。",
        "translation": "\"If there's an inherent nature of form and an inherent nature of discrimination, the marks don't appear when they're thus observed.",
        "source": "T15n0654_001:0806b11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行我有色，是行分別相；若行他有色，是行分別相；若行色有生有滅有染有淨，是行分別相；若於色自性、若因若果、若業若行，取有、取無者，自為行色行；若如是行，是行分別相；若於色中見所表者，是行分別相。",
        "translation": "If conditioned forms have self-nature and form, this is the discriminated characteristic of conditioned forms; if conditioned forms have arisen, ceased, defiled, and purified, this is the discriminated characteristic of conditioned forms; if conditioned forms have self-nature, cause and effect, action and practice, they are conditioned forms and practices; if they are thus conditioned, this is the discriminated characteristic of practice; and if they are seen to be represented in form, this is the discriminated characteristic of practice.",
        "source": "T15n0654_001:0806b12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知，色法於一切處，若對礙、若有表、若無表，畢竟無少法可得；即此色法，一切無表、無性可觀；異此色法，一切無表、無性可觀。",
        "translation": "Therefore, you should know that in all places where form is an obstruction, whether it's represented or not, there's ultimately no little thing to be gained; that is, all such form is without representation and without nature to be observed, and all such form is without representation or without nature to be observed.",
        "source": "T15n0654_001:0806b17_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼色對礙表了悉無性可觀，於有表中，非一性可觀、非異性可觀，即彼表了而亦無性。",
        "translation": "They understand that forms that are oppositely expressed are all without nature and can be contemplated, and in forms that exist, they are not unitary and not oppositely contemplated, meaning that they are understood and have no nature.",
        "source": "T15n0654_001:0806b20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此無性、非無性，若如是觀，即平等觀。",
        "translation": "If this absence and non-abnegation are thus observed, it's an observation of equality.",
        "source": "T15n0654_001:0806b22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀時，一切分別悉無分別，是為無分別界。",
        "translation": "When they thus observe them, all discriminations are without discrimination, which is the nondiscriminated element.",
        "source": "T15n0654_001:0806b23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸菩薩應如是觀、如是入，入是無分別界者，於有分別、於無分別，悉無分別。",
        "translation": "\"Bodhisattvas should thus observe and enter thus, and when they enter this nondiscriminated realm, there's no discrimination between what is and isn't discriminated.",
        "source": "T15n0654_001:0806b24_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是平等觀，是為真入無分別界，是名菩薩得安住無分別界。",
        "translation": "Such an observation of equality is true entry into the nondiscriminated realm, and this is called a bodhisattva attaining stability in the nondiscriminated realm.",
        "source": "T15n0654_001:0806b25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受、想、行、識，及布施、持戒、忍辱、精進、禪定、智慧諸波羅蜜多空，真如實際勝義諦法界，十地所證法，乃至一切相智出世間行，亦復如是。",
        "translation": "*Feelings, perceptions, volitions, consciousness, the prajñāpāramitās of generosity, observance of precepts, forbearance, effort, meditation, and wisdom are empty, and so is the Dharma realm of the true and actual ultimate truth, the dharmas realized in the tenth ground, and even the supramundane practice of the knowledge of all characteristics.",
        "source": "T15n0654_001:0806b27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於受想行識，乃至一切相智，若自性、若因、若果、若業、若行，取有、取無者，即於一切相智等，乃為對礙。",
        "translation": "Regarding feeling, perception, volition, and consciousness, even omniscience, if it's its own nature, if it's a cause, if it's a result, if it's an action, and if it's a practice, it's an obstruction to grasping something as existent or nonexistent, which is omniscience and so forth.",
        "source": "T15n0654_001:0806c01_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是行，是行分別相。",
        "translation": "If someone thus practices, this is the discriminated characteristic of practice.",
        "source": "T15n0654_001:0806c03_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼一切相智等無表了性，若有所表了，即行一切相智等，是行分別相。",
        "translation": "If they have omniscience and so forth that have no representational comprehension, then they're acting in omniscience and so forth, which is the discriminative aspect of acting.",
        "source": "T15n0654_001:0806c04_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一切相智等，若於表了中有相可行者，是行分別相。",
        "translation": "If there are marks in their omniscience and so forth that can be acted upon in their manifestation, this is the discriminated characteristic of acting.",
        "source": "T15n0654_001:0806c05_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若信無相可行者，亦行一切相智等，是行分別相，是故當知此表了法非一性可觀、非異性可觀。",
        "translation": "If someone believes that there are no marks to act upon, they also act with omniscience and so forth, which is acting in a discriminating way; therefore, you should know that this manifestation is not of the same nature that can be contemplated or different nature that can be contemplated.",
        "source": "T15n0654_001:0806c06_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此表了法無性，亦非無性。",
        "translation": "This shows that the knowable dharmas are without nature and not without nature.",
        "source": "T15n0654_001:0806c09_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是於一切相智等，若表、若無表悉無分別，即此無分別、不取相者，是無分別界。",
        "translation": "If such cognition of all characteristics and so forth, whether expressed or unexpressed, is completely without discrimination, that is, if it's without discrimination and doesn't grasp characteristics, it's a nondiscriminated realm.",
        "source": "T15n0654_001:0806c09_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩應如是觀、如是入，如是入者，是為真入無分別界，是名菩薩，得安住無分別界。」",
        "translation": "Bodhisattvas should thus observe and enter thus, and when they thus enter, this is called a bodhisattva truly entering the nondiscriminated realm, and this is called a bodhisattva who attains stability in the nondiscriminated realm.\"",
        "source": "T15n0654_001:0806c11_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復說伽陀曰：「無分別心若安住，　　彼從諸佛正法生，　一切分別悉遠離，　　所行即得無分別。",
        "translation": "It was then that the Bhagavān again spoke the kṣatriya, \"If the mind without discrimination is stably abiding, it arises from the correct principles of the buddhas, all discrimination is completely removed, and what's practiced then becomes nondiscriminated.",
        "source": "T15n0654_001:0806c13_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是法寂靜無垢勝，　　名稱功德而普集，　無分別法最上樂，　　菩薩得已成菩提。」",
        "translation": "This is the tranquil, unsullied excellence of the Dharma, which names merits and universally gathers, the supreme delight of the nondiscriminated Dharma, and the bodhisattva attains accomplished enlightenment.\"",
        "source": "T15n0654_001:0806c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說入無分別法門經",
        "translation": "Sutra on Entering the Dharma Gate of Nondiscrimination",
        "source": "T15n0654_001:0806c19_0",
        "is_bad_quality": false
    }
]