[
    {
        "source_sentence": "無極寶三昧經卷下",
        "translation": "Second Fascicle of the Wuktibao sanmei jing",
        "source": "T15n0636_002:0513a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏三藏竺法護譯",
        "translation": "Translation of the Tripiṭaka of the Yuezhi Family of the Western Jin Dynasty by Zhu Fahou",
        "source": "T15n0636_002:0513a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提白佛言：「若有念苦樂者，則不離於苦樂，是則為二法。",
        "translation": "Subhūti said to the Buddha, \"If someone is mindful of suffering and pleasure, then they aren't free from suffering and pleasure, and this is two things.",
        "source": "T15n0636_002:0513a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩者不中離、不上離、不脫離、不中無所離、於所作遠無作，是為作所起如幻，以幻脫幻，幻中無幻，幻中無名，如是亦不從法得度，亦不離法得度，於脫中復脫，是為無有主但有名耳。",
        "translation": "A bodhisattva who isn't separated from the middle, isn't separated from the top, isn't separated from the bottom, isn't separated from the middle, and doesn't do anything remote from what he does is like an illusion that arises from doing something, escapes from the illusion with the illusion, has no illusion in the illusion, and has no name in the illusion; thus, he doesn't attain salvation from the Dharma, doesn't escape from the Dharma, and is again liberated from the Dharma, which is to say that he has no subject but has a name.",
        "source": "T15n0636_002:0513a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於字無知名者，是為法輪斷。」",
        "translation": "Being without a well-known name in words is cutting off the wheel of the Dharma.\"",
        "source": "T15n0636_002:0513a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言：「法輪本清淨無所有，誰有斷輪者？」",
        "translation": "Śāriputra said, \"The Dharma wheel is originally pure and does not exist, so who is there who has cut off the wheel?\"",
        "source": "T15n0636_002:0513a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來曰：「不知輪有處者是即為斷。」",
        "translation": "The jeweled tathāgata said, \"Someone who doesn't know the wheel has a place is cut off.\"",
        "source": "T15n0636_002:0513a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「貪可法者是為生死根，滅法亦為無結之作也。",
        "translation": "The Buddha said, \"A permissible greed is the root of birth-and-death, and a ceasing dharma is the creation of no bonds.",
        "source": "T15n0636_002:0513a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無作之作是為不離作，離貪諸可即為無有斷者，無貪不起是即道，無可不可，無生不生，無識不識，無死不死，無斷不斷，無遠不遠，諸可不可所住無想，離於無想所念無念，所說無所說，泥洹無滅離於無滅泥洹，無形離於無形，泥曰滅盡無所盡，諸法寂然離於寂然，諸法無可不可不有所失，於慧離本非名無想，所明無所明，於明冥無相知者，癡慧無相入者，於道無有得道者，若苦若樂無相識者，所起無所想，於清淨無難易，所度無有主，所至無相離者，諸法非名離於非名，所度如流水，於名無轉者，如是者皆即道也。",
        "translation": "無作之作是為不離作，離貪諸可即為無有斷者，無貪不起是即道，無可不可，無生不生，無識不識，無死不死，無斷不斷，無遠不遠，諸可不可所住無想，離於無想所念無念，所說無所說，泥洹無滅離於無滅泥洹，無形離於無形，泥曰滅盡無所盡，諸法寂然離於寂然，諸法無可不可不有所失，於慧離本非名無想，所明無所明，於明冥無相知者，癡慧無相入者，於道無有得道者，若苦若樂無相識者，所起無所想，於清淨無難易，所度無有主，所至無相離者，諸法非名離於非名，所度如流水，於名無轉者，如是者皆即道也。",
        "source": "T15n0636_002:0513a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以三昧度如人意，以萬物自莊嚴，但莊嚴無形，莊嚴倒見，莊嚴諸可意王，莊嚴是想非想耳。」",
        "translation": "The Buddha uses samādhi to save as one wishes, adorning himself with all things, but adorning formlessness, adorning mistaken views, adorning agreeable kings, and adorning what is perceived and not perceived.\"",
        "source": "T15n0636_002:0513b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利菩薩白佛言：「此諸天人來在會者，有幾所人得是三昧？」",
        "translation": "Mañjuśrī said to the Buddha, \"Of all the gods and humans who have come to this meeting, how many have attained this samādhi?\"",
        "source": "T15n0636_002:0513b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語文殊：「今是會者諸天及人，一切普悉得是三昧逮是功德，悉當作佛，當受尊決斷於五道。」",
        "translation": "The Buddha said to Mañjuśrī, \"Now, all of the gods and humans who have gathered here have attained this samādhi and have acquired this merit, and they will all become buddhas and will be honored and determined to end the five destinies.\"",
        "source": "T15n0636_002:0513b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會者聞佛所語，八千億諸天及人，悉得無所從生法忍，即昇虛空去地三百丈，其身上各有萬億華香，却乃來下稽首佛足。",
        "translation": "Hearing what the Buddha said, 800 billion gods and humans all attained the patience of the Dharma that arises from nothing, and they rose 300 feet into the sky to the ground, each with a trillion flowers and fragrances on their bodies, and then they came down to bow at the Buddha's feet.",
        "source": "T15n0636_002:0513b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿樓菩薩、呵提菩薩，從坐起，白佛言：「是諸上人飛在空中，身上華香從何所出？」",
        "translation": "Aru Bodhisattva and Hati Bodhisattva got up from their seats and said to the Buddha, \"Where did the flowers and fragrance come from when those gods and humans were flying through the air?\"",
        "source": "T15n0636_002:0513b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「譬如淨帛本自淨潔，在所染之五色鮮好。",
        "translation": "The Buddha said, \"It's like pure silk that's inherently clean and has five colors that are bright and beautiful when they're dyed.",
        "source": "T15n0636_002:0513b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帛本自淨，色本亦淨，二物因緣故得明好。",
        "translation": "The silk is inherently pure, and the colors are inherently pure, and the cause and conditions for the two things to be bright and beautiful are the result.",
        "source": "T15n0636_002:0513b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色亦不入帛，帛亦不入色，以淨因緣而得發明。",
        "translation": "Form doesn't enter form, and silk doesn't enter form, but it's invented by pure causes and conditions.",
        "source": "T15n0636_002:0513b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩清淨故致華香，其所因緣亦復如是。",
        "translation": "The bodhisattva's purity produces a flowery fragrance, and so does his cause and condition.",
        "source": "T15n0636_002:0513b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩亦不在華香中，華香亦不著菩薩，諸天及人得斷念想，逮明慧法便有華見，用華淨故因緣興耳，法亦如是。",
        "translation": "The bodhisattva isn't among the flowers and fragrance, and the flowers and fragrance aren't attached to the bodhisattva. Gods and humans attain freedom from mindfulness and perception, and they acquire insight and wisdom, then they see flowers, and the causes and conditions for their purification are produced, so are the teachings.",
        "source": "T15n0636_002:0513b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無住者成諸功德，住想行者開生死門，羅漢辟支佛所以由遠五道者，但用十倒見故：一者見諸功德悉言說者悉為倒見；二者見五道勤苦欲取泥洹，是為倒見；三者見萬物無常欲疾離之，是為倒見；四者求安本自無本，是為倒見；五者知出無間入無處，世自無出求之不止，是為倒見；六者羅漢取泥洹時，身中自火出火亦無處，便起想出身中火自燒者，故知生死不斷，是為倒見；七者本末不可盡而自求盡，是為倒見；八者欲於泥洹滅盡諸惡，不知無主反欲滅之，是為倒見；九者所施與不發一切人意，但欲法不斷，是為倒見；十者於苦於樂不等淨行，言有二法，是為倒見。",
        "translation": "無住者成諸功德，住想行者開生死門，羅漢辟支佛所以由遠五道者，但用十倒見故：一者見諸功德悉言說者悉為倒見；二者見五道勤苦欲取泥洹，是為倒見；三者見萬物無常欲疾離之，是為倒見；四者求安本自無本，是為倒見；五者知出無間入無處，世自無出求之不止，是為倒見；六者羅漢取泥洹時，身中自火出火亦無處，便起想出身中火自燒者，故知生死不斷，是為倒見；七者本末不可盡而自求盡，是為倒見；八者欲於泥洹滅盡諸惡，不知無主反欲滅之，是為倒見；九者所施與不發一切人意，但欲法不斷，是為倒見；十者於苦於樂不等淨行，言有二法，是為倒見。",
        "source": "T15n0636_002:0513b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行菩薩道，當知是事而疾離之。」",
        "translation": "Practicing the bodhisattva path, you should know these things and quickly abandon them.\"",
        "source": "T15n0636_002:0513c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿樓菩薩、摩提菩薩等：「今是諸天及在會人，皆是往昔阿呵耨佛時人也，今於我前悉莂之者，宿命已於六萬佛所受是三昧，今故於此而莂之耳。",
        "translation": "The Buddha said to Aru Bodhisattva and Mati Bodhisattva, \"Now, the gods and people in the assembly were all here in the past when Ahākau Buddha was here, and they've all consigned themselves to me now because they had received this concentration from 60,000 buddhas in their previous lives, so now they've consigned themselves to them here.",
        "source": "T15n0636_002:0513c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "却後我法欲斷絕時，是等當有四十萬人，當持法住令不斷絕，然後久久有惡沙門、若壞戒人，當壞我法。」",
        "translation": "When my teaching is about to end, there will be 400,000 of them who will maintain the teaching and keep it from ending, and then a long time from now, if there are bad ascetics or people who break the precepts, they will destroy my teaching.\"",
        "source": "T15n0636_002:0513c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提白佛言：「何所菩薩護法令不斷絕？」",
        "translation": "Subhūti said to the Buddha, \"What bodhisattva protects the Dharma and keeps it from being cut off?\"",
        "source": "T15n0636_002:0513c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語須菩提：「是四十萬菩薩悉住第八已下，於法煩荷之想，是為護持法令不斷絕也。」",
        "translation": "The Buddha said to Subhūti, \"These 400,000 bodhisattvas all abide below the eighth level and have thoughts of trouble with the Dharma, which are intended to protect the Dharma and keep it from ceasing.\"",
        "source": "T15n0636_002:0513c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提白佛言：「何等為壞法者？",
        "translation": "Subhūti said to the Buddha, \"What's a destructive dharma?",
        "source": "T15n0636_002:0513c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛說之。」",
        "translation": "May the Buddha teach it.\"",
        "source": "T15n0636_002:0513c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須菩提：「若有得羅漢辟支佛，若沙門及天與人，起想煩荷於法求名，壞亂本慧妄增減法，枝掖解說，以偽錯真以辯亂道，不惟空慧而務嚴飾，聞佛可得志存超獲，不知漚和拘舍羅，而不勤殖德行，為是法賊，破我道者也。」",
        "translation": "The Buddha told Subhūti, \"If arhats, solitary buddhas, ascetics, gods, or humans give rise to the conceptual afflictions and seek fame in the Dharma, distort their original wisdom by falsely adding and subtracting from the Dharma, give derivative explanations, misconstrue the truth with falsehoods, and confuse the path with eloquence, then they don't only have the wisdom of emptiness but also strive for adornment, hear that the Buddha can be attained, aspire to transcend, and don't know the potentiality or the koṭīrā, but don't diligently cultivate virtuous behavior, which is a thief of the Dharma and destroys our path.\"",
        "source": "T15n0636_002:0513c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿須夷天、潘那提天、提樓尼天、拘屬提天、施那利天，俱白佛言：「願持形壽歸持法者，千億萬劫無休息時，常令我等得是三昧。」",
        "translation": "The Asoka, Pāṇḍara, Dhṛtarāṣṭra, Kauṣṭara, and Śanālika gods all said to the Buddha, \"May those who preserve form and longevity and return it to those who preserve the Dharma always enable us to attain this concentration for a thousand billion million eons without rest.\"",
        "source": "T15n0636_002:0513c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其有德人奉行三昧，如法不失，則得佛疾。",
        "translation": "The Buddha said, \"If a virtuous person consecrates this concentration and follows the Dharma without losing it, then they'll attain Buddhahood.",
        "source": "T15n0636_002:0514a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有發意行是三昧者，譬如泥洹天上有寶，諸寶中王，天上天下寶中最尊，有佛在世寶乃現耳，名曰精摩尼珠，有得是珠持著器中，若著手中視之四面空中，在欲得幾日雨珍寶，所向莫不如願，是尊寶珠不當貪惜，當雨三界普令獲寶，是三昧者德亦如是也。」",
        "translation": "Those who arouse the intention to practice this concentration are like the Nirvana Heaven, where there's a jewel, the king of jewels, the most honored of all the treasures in the heavens and under the heavens, and there's a Buddha in the world whose jewel then appears, called the fine maṇi pearl, and there's someone who obtains it, holds it in a container, puts it in their hand, looks at it in the air on all sides, desires to obtain a few days of rain of precious treasures, and nothing they go for is as they wish.",
        "source": "T15n0636_002:0514a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅閱祇王白佛言：「佛者尊祐，世之大導，常有大慈救濟十方，願以寶珠雨我國界，得令人民普得福利。」",
        "translation": "King Rājagṛha said to the Buddha, \"Venerable Buddha, the world's great guide, who always has great compassion to save the ten directions, may he rain down precious pearls on our realm so that the people may all attain welfare.\"",
        "source": "T15n0636_002:0514a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛則時笑，神光煒燁。",
        "translation": "The Buddha then smiled, and his radiance shone brilliantly.",
        "source": "T15n0636_002:0514a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難整服前白佛言：「佛不妄笑，願聞其意。」",
        "translation": "Ānanda went forward in full regalia and said to the Buddha, \"The Buddha doesn't laugh falsely; I wish to hear his intention.\"",
        "source": "T15n0636_002:0514a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「見是王不？",
        "translation": "The Buddha said to Ānanda, \"Have you seen this king?",
        "source": "T15n0636_002:0514a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲得泥洹天上寶珠，雨羅閱祇使普富饒，不知寶來三昧已得是寶也。」",
        "translation": "They want to obtain the precious jewel of the nirvāṇa heaven and rain down the Rājagṛha to make it abundant, not knowing that this is the jewel that has been obtained through the jewel-returning samādhi.\"",
        "source": "T15n0636_002:0514a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語王言：「寧見人民百日不食，普得安隱以法為味，又諸女人化為男子，是法之利不亦大乎？」",
        "translation": "The Buddha said to the king, \"Wouldn't it be great to see people go a hundred days without food, generally attain peace, and use the Dharma as their flavor, and have women transformed into men?\"",
        "source": "T15n0636_002:0514a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王心歡悅，即脫珠寶，以散佛上及菩薩上，化成華蓋列在空中，其間悉有百千音樂，王倍踊躍忘食之想。",
        "translation": "Rejoicing in his heart, the king then took off his pearls and jewelry and scattered them on top of the Buddha and on top of the bodhisattvas, where they were transformed into flower canopies arranged in the air, between which there was music by the hundreds of thousands of people, and the king was overcome with joy and the thought that he had forgotten about food.",
        "source": "T15n0636_002:0514a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王白佛言：「是花蓋者從何而出？」",
        "translation": "The king said to the Buddha, \"Where did this flower canopy come from?\"",
        "source": "T15n0636_002:0514a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從無處出。」",
        "translation": "The Buddha said, \"From nowhere does it come forth.\"",
        "source": "T15n0636_002:0514a20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無處從何出？」",
        "translation": "Again, he asked, \"Where does nowhere come from?\"",
        "source": "T15n0636_002:0514a21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從無所起來。」",
        "translation": "The Buddha said, \"From nowhere does it arise.\"",
        "source": "T15n0636_002:0514a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無所起從何所來？」",
        "translation": "Again, he asked, \"Where does nothing that arises come from?\"",
        "source": "T15n0636_002:0514a22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從無所生來。」",
        "translation": "The Buddha said, \"It comes from being born in the middle of nowhere.\"",
        "source": "T15n0636_002:0514a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無所生從何所來？」",
        "translation": "Again, he asked, \"Where did [the Buddha] come from that was produced by nothing?\"",
        "source": "T15n0636_002:0514a23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「從不動來。」",
        "translation": "He answered, \"From immovability.\"",
        "source": "T15n0636_002:0514a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「不動從何所來。」",
        "translation": "Again, he asked, \"Where does immovability come from?\"",
        "source": "T15n0636_002:0514a24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「從無造來。」",
        "translation": "The answer was, \"From unproduced.\"",
        "source": "T15n0636_002:0514a24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無造從何所來？」",
        "translation": "Again, he asked, \"Where did the unmoving come from?\"",
        "source": "T15n0636_002:0514a24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「從無名來。」",
        "translation": "He said, \"From namelessness.\"",
        "source": "T15n0636_002:0514a25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無名從何所來？」",
        "translation": "Again, he asked, \"Where did [Maitreya] come from?\"",
        "source": "T15n0636_002:0514a25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「從無生來。」",
        "translation": "He said, \"From nonarising.\"",
        "source": "T15n0636_002:0514a26_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無生從何所來？」",
        "translation": "Again, he asked, \"Where did [the nonarising] come from?\"",
        "source": "T15n0636_002:0514a26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「從無音來。」",
        "translation": "He said, \"From the absence of sound.\"",
        "source": "T15n0636_002:0514a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無音從何所來？」",
        "translation": "Again, he asked, \"Where did that absence of sound come from?\"",
        "source": "T15n0636_002:0514a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「從無二來。」",
        "translation": "He said, \"From where did nonduality come?\"",
        "source": "T15n0636_002:0514a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無二從何所來？」",
        "translation": "Again, he asked, \"Where did nonduality come from?\"",
        "source": "T15n0636_002:0514a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「從無形來。」",
        "translation": "He said, \"From immateriality.\"",
        "source": "T15n0636_002:0514a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無形從何所來？」",
        "translation": "Again, he asked, \"Where did formlessness come from?\"",
        "source": "T15n0636_002:0514a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「從自然來。」",
        "translation": "He said, \"It comes from nature.\"",
        "source": "T15n0636_002:0514a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「自然從何所來？」",
        "translation": "Again, he asked, \"Where does nature come from?\"",
        "source": "T15n0636_002:0514a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「從化來。」",
        "translation": "He said, \"From the teachings.\"",
        "source": "T15n0636_002:0514b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「化從何所來？」",
        "translation": "Again, he asked, \"Where did the transformation come from?\"",
        "source": "T15n0636_002:0514b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「離於化來。」",
        "translation": "He said, \"It comes from being free of transformation.\"",
        "source": "T15n0636_002:0514b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「離化從何所來？」",
        "translation": "Again, he asked, \"Where does it come from that's free from transformation?\"",
        "source": "T15n0636_002:0514b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「離於不化無相知處來。」",
        "translation": "He said, \"It comes from the place of knowledge of the markless apart from the unmanifest.\"",
        "source": "T15n0636_002:0514b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「無相知處從何所來？」",
        "translation": "Again, he asked, \"Where does the point of knowing signlessness come from?\"",
        "source": "T15n0636_002:0514b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「以是故為諸法也。」",
        "translation": "The Buddha said, \"Therefore, these are all dharmas.\"",
        "source": "T15n0636_002:0514b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞佛語倍大歡喜，白佛言：「此諸菩薩從遠方來，願悉請之明日到宮。」",
        "translation": "The king was greatly elated at what the Buddha said and said to him, \"These bodhisattvas have come from far away, and I'd like to invite them all to the palace tomorrow.\"",
        "source": "T15n0636_002:0514b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即許之皆受其請。",
        "translation": "The Buddha then granted his permission and accepted their invitations.",
        "source": "T15n0636_002:0514b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即還宮莊嚴供具，俠道施帳幢幡粲麗，宮中皆以珍寶作座，夫人采女齋戒盡敬。",
        "translation": "The king then returned to the palace, adorned it with offerings, decorated it with tents, decorated it with banners, decorated it with decorative banners, made seats in the palace made of precious treasures, and paid respect to the wives and women who had observed precepts.",
        "source": "T15n0636_002:0514b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日，文殊及寶來等，與諸菩薩俱詣王宮。",
        "translation": "On the morrow, Mañjuśrī and Baolai visited the king's palace with the other bodhisattvas.",
        "source": "T15n0636_002:0514b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來菩薩讓文殊曰：「今諸上人宜於前入。」",
        "translation": "The jeweled-rush bodhisattva told Mañjuśrī, \"Now, it's appropriate for the higher-ups to enter in front of you.\"",
        "source": "T15n0636_002:0514b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩言：「於慧無處、於意無形、於念無想、於法無所施，所施不離道，已斷於法輪，於法無念、想無多少，如是者故為尊、多入於權，於薩芸若無相知者，已被法鎧，於三昧無增減，是則為尊，故宜處前。」",
        "translation": "The bodhisattvas said, \"When there's no place for wisdom, no form in the mind, no thought in mindfulness, nothing to bestow, and nothing to bestow that's not separate from the path, they've ended the wheel of the Dharma, have no thought about the Dharma, and have no amount of thought, so they're honored, have often entered the expedient, know nothing about the marks of a sahāna, have been armored by the Dharma, and have no increase or decrease in concentration.",
        "source": "T15n0636_002:0514b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來菩薩答曰：「今諸上人年耆德高，以故為尊，宜在前入。」",
        "translation": "The jeweled tathāgata replied, \"Now, the venerable ones are old and virtuous, so they're honored and should enter before them.\"",
        "source": "T15n0636_002:0514b14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩言：「我等之年亦如枯樹，根本已死無有華葉，尠於蔭覆於世為薄，仁者雖幼入慧甚深，譬如寶樹益世弘多，以故為尊，故宜在前。」",
        "translation": "The bodhisattvas said, \"We're also like a withered tree whose roots have died and which has no flowers or leaves and whose shade is weak in the world.",
        "source": "T15n0636_002:0514b15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既皆入宮就座而坐，諸天在上以樂樂之。",
        "translation": "After they all entered the palace and took their seats, the gods were present and delighted in their presence.",
        "source": "T15n0636_002:0514b19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王使夫人及諸采女，燒眾名香進奉供具，飯食畢訖王問寶來：「我今欲得見十方佛，當行何法而得見之？」",
        "translation": "After they finished their meal, the king asked the jeweled lions, \"Now, I want to see the buddhas of the ten directions, what teaching should I perform to obtain that view?\"",
        "source": "T15n0636_002:0514b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來曰：「欲見諸佛，當行九法：一者視十方佛與是無異、二者當視道無有徑、三者視一切人無有脫者、四者當視飯食如化所見、五者當知五陰無有識想、六者當知六情觀之如幻、七者當知所觀但是倒見、八者於法中大施與、九者當知所施無所施，是為九也。",
        "translation": "The jeweled lama said, \"If you want to see the buddhas, you must practice nine things: 1) see the buddhas of the ten directions as being the same without difference; 2) see the path as having no path; 3) see all people as having no escape; 4) see food and drink as created; 5) know that the five aggregates lack consciousness and perception; 6) know that the six emotions are observed as illusory; 7) know that what's observed is only a mistaken view; 8) give generously in the midst of the teaching; and 9) know that what's given is not given.",
        "source": "T15n0636_002:0514b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空其意、等所視、無彼此，志寂然、得淨定、無所見，則普見佛。」",
        "translation": "When his mind is empty, he sees equally, has no mutuality, his intention is quiescent, he attains pure concentration, and sees nothing, then he'll see the Buddha universally.\"",
        "source": "T15n0636_002:0514b28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時讚寶來曰：「快哉快哉！",
        "translation": "The jeweled tathāgata then praised him, \"How pleasant! How pleasant!",
        "source": "T15n0636_002:0514b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "審如所說。」",
        "translation": "\"Examine it as it's been explained.\"",
        "source": "T15n0636_002:0514c01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說頌曰：「常當願是劫，　　所生常遇尊，　從受大智慧，　　常除愛欲根。",
        "translation": "The Buddha spoke a verse, \"Always wishing for this eon, you'll be born in a place where you'll always meet an honorable person, receive great wisdom, and always remove the root of desire.",
        "source": "T15n0636_002:0514c01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不貪亦不嫉，　　惡意不復生，　乃於無數佛，　　得聞是三昧。",
        "translation": "Not craving or jealousy, ill-will never again arises, and then I've heard this concentration from countless buddhas.",
        "source": "T15n0636_002:0514c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　入於三千剎，　　常行尊三昧，　不於一切人，　　所有諸珍寶。",
        "translation": "Entering 3,000 buddhas, he always conducts himself in the venerable concentration, not possessing any treasures from any person.",
        "source": "T15n0636_002:0514c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法不從五陰，　　亦不離其處，　從觀得脫名，　　一切皆如是。",
        "translation": "Not following the five aggregates or departing from their location, he attains liberation from words based on contemplation, and all things are thus.",
        "source": "T15n0636_002:0514c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從觀得歡喜，　　發意無所生，　其處已如是，　　故為天中天。",
        "translation": "From observing it, they become joyous, arouse their mind and produce nothing, and their place is thus developed, so they're a god of gods.",
        "source": "T15n0636_002:0514c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在三界中，　　不生亦不死，　泥洹及泥曰，　　一切無有是。",
        "translation": "If someone were in the three realms, they wouldn't be born or die, and there would be nothing like nirvāṇa or nirvāṇa.",
        "source": "T15n0636_002:0514c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　意不當邪念，　　所行作非法，　若在三界中，　　持心令不起。",
        "translation": "When the mind isn't wrong, what it does is unlawful, and if it were in the three realms, it would hold the mind so it wouldn't arise.",
        "source": "T15n0636_002:0514c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　音響有還答，　　內外悉相應，　不起悉寂然，　　諸法亦如是。",
        "translation": "Their sounds are answered, internal and external are all in accord, and they are all silent when they don't arise, just like all the other dharmas.",
        "source": "T15n0636_002:0514c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三千諸佛剎，　　名字悉如是，　無聞亦無見，　　非法所當議。",
        "translation": "The names of the 3,000 buddha bases are all thus, and there's nothing to hear or see that shouldn't be considered unlawful.",
        "source": "T15n0636_002:0514c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三昧不挍計，　　以數持作多，　慧者解是言，　　得佛無常處。",
        "translation": "Samādhi isn't measured, but it's held in number as many, and the wise understand this to be the attainment of the Buddha's impermanence.",
        "source": "T15n0636_002:0514c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法者悉清淨，　　曠大無有雙，　常作無邊水，　　所載蔽三千。",
        "translation": "The Dharma is perfectly pure, vast and without parallel, always producing limitless water that covers a trichiliocosm.",
        "source": "T15n0636_002:0514c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　意願陀隣尼，　　發意無有前，　法者已如是，　　一切當奉行。",
        "translation": "Wishing for the dhāraṇī, there's no one who has previously given rise to the intention, and so has the Dharmagiver, who will consecrate it all.",
        "source": "T15n0636_002:0514c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我念求法時，　　從來若干劫，　志意常棄家，　　於欲無所求。",
        "translation": "I've been mindful of the many eons since I sought the Dharma, and my intention has always been to abandon my home and pursue nothing in desire.",
        "source": "T15n0636_002:0514c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常依善知識，　　得立正法住，　是時於大會，　　得聞尊三昧。",
        "translation": "Always relying on a good teacher, I was able to establish my abode in the right Dharma, and at that time in the great assembly, I was able to hear the venerable samādhi.",
        "source": "T15n0636_002:0514c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉意大歡喜，　　即住虛空中，　去地百卌丈，　　叉手在佛邊。",
        "translation": "Fully rejoicing in his intention, he stood up in the sky, went a hundred and thirty feet to the ground, and saluted the Buddha with his palms together.",
        "source": "T15n0636_002:0515a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今坐諸菩薩，　　受莂亦如是，　其意增歡喜，　　得聞諸三昧。",
        "translation": "The bodhisattvas sitting here who have received the assurance of future enlightenment likewise have their intentions heightened and rejoiced, and they've been able to hear about the samādhis.",
        "source": "T15n0636_002:0515a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便從一佛剎，　　飛到諸佛前，　不動亦不搖，　　震動諸剎中。",
        "translation": "They then fly from one buddha's temple to the buddhas, not moving or shaking, and shake the temples.",
        "source": "T15n0636_002:0515a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　龍王大歡喜，　　即雨萬種香，　化為諸水池，　　上到三千中。",
        "translation": "The dragon king is so delighted that he rains down a myriad of fragrances, turning them into pools of water that rise up into 3,000 intermediates.",
        "source": "T15n0636_002:0515a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　華香自然來，　　亂風自然生，　百種諸音樂，　　悉住於空中。」",
        "translation": "The fragrance of flowers comes naturally, the turbulent wind arises naturally, and a hundred kinds of music all reside in the air.\"",
        "source": "T15n0636_002:0515a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是寶來菩薩問文殊師利言：「今此香花從他剎來，及諸音樂來在會中，為佛威神？",
        "translation": "The jeweled-raspberry bodhisattva then asked Mañjuśrī, \"Now, have these fragrant flowers come from another temple and these music come to the assembly, or are they the Buddha's authoritative power?",
        "source": "T15n0636_002:0515a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將菩薩力耶？」",
        "translation": "Will it be bodhisattva power?\"",
        "source": "T15n0636_002:0515a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊答曰：「佛及菩薩得力神變皆不可見，知是樂者無名之樂，有所在處。",
        "translation": "Mañjuśrī answered, \"It's invisible when buddhas and bodhisattvas attain miraculous powers, knowing that this is bliss without a name and has a place.",
        "source": "T15n0636_002:0515a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法音無名處，若樂是樂處，所有如化是樂，無二法是樂，於羅漢辟支佛悉欲度之是樂，所見異道悉欲令得佛是樂，所度無有主是樂，一切處無所無所起、於三昧無煩荷是樂，一切處無有名是樂，諸所有皆如化是樂，非音處無所生處是樂，法所施無所施是樂，大千剎中無常處是即樂，一切人令得信無所得是其樂，當來過去現在三處盡無所盡是樂，令還本無所見是樂，見法輪是為無所見是樂，三千剎中一切等是樂，十方三千樹法之藏是樂，十方剎但有名是樂，色欲合是樂，於名字無有主是樂，無邊幅一切寂是樂，一切明與冥合是樂，諸所行不失戒是樂，諸所念不離三昧是樂，虛空寶度無極是樂，諸慧覺無有處是樂，諸所可是樂，一切決無受者是樂，三界中無與等是樂，貪於法不惜命是樂，一切明令復明是樂，諸所有但倒見、見正者是樂，布施無所悕望是樂，意無極作大船師是樂，無邊園脫無極是樂，意寂靖是樂，無所定是樂，諸三昧門無倒者是樂，亦無聽亦無聞是樂，諸所念非政意是樂，一切人無脫者是樂，諸所度譬若幻是樂，初發意三昧俱是樂，諸菩薩所從來無有處是樂，諸菩薩在意生到十方是樂，非青黃白黑無道徑是樂。",
        "translation": "法音無名處，若樂是樂處，所有如化是樂，無二法是樂，於羅漢辟支佛悉欲度之是樂，所見異道悉欲令得佛是樂，所度無有主是樂，一切處無所無所起、於三昧無煩荷是樂，一切處無有名是樂，諸所有皆如化是樂，非音處無所生處是樂，法所施無所施是樂，大千剎中無常處是即樂，一切人令得信無所得是其樂，當來過去現在三處盡無所盡是樂，令還本無所見是樂，見法輪是為無所見是樂，三千剎中一切等是樂，十方三千樹法之藏是樂，十方剎但有名是樂，色欲合是樂，於名字無有主是樂，無邊幅一切寂是樂，一切明與冥合是樂，諸所行不失戒是樂，諸所念不離三昧是樂，虛空寶度無極是樂，諸慧覺無有處是樂，諸所可是樂，一切決無受者是樂，三界中無與等是樂，貪於法不惜命是樂，一切明令復明是樂，諸所有但倒見、見正者是樂，布施無所悕望是樂，意無極作大船師是樂，無邊園脫無極是樂，意寂靖是樂，無所定是樂，諸三昧門無倒者是樂，亦無聽亦無聞是樂，諸所念非政意是樂，一切人無脫者是樂，諸所度譬若幻是樂，初發意三昧俱是樂，諸菩薩所從來無有處是樂，諸菩薩在意生到十方是樂，非青黃白黑無道徑是樂。",
        "source": "T15n0636_002:0515a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是寶來！",
        "translation": "Thus, jeweled tathāgata!",
        "source": "T15n0636_002:0515b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲知佛及菩薩威神音樂所樂如是。」",
        "translation": "They want to know that the Buddha and the bodhisattvas' authoritative music and sounds are enjoyed like this.\"",
        "source": "T15n0636_002:0515b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來菩薩說頌曰：「文殊師利意，　　慧尊無有前，　所施弊三千，　　其智莫不尊。",
        "translation": "The jeweled tathāgata bodhisattva spoke a verse, \"Mañjuśrī's intention is unsurpassed by the wisdom venerable, and there's no one whose knowledge is not honored by the 3,000 consecrations that he bestows.",
        "source": "T15n0636_002:0515b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　威神所施行，　　悉除三千中，　諸樂無所欲，　　但為不脫施。",
        "translation": "What the authoritative spirit administers removes all of the 3,000, and there's no desire for those pleasures but for the gift that doesn't escape.",
        "source": "T15n0636_002:0515b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法樂為最大，　　於化無度者，　所施樂法與，　　若空無度者。",
        "translation": "The happiness of the Dharma is the greatest, and there's no limit to what's created, and the happiness of the Dharma that's given is given, even if it's empty and limitless.",
        "source": "T15n0636_002:0515b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法與樂俱行，　　無有過是寶，　所樂不有主，　　若空無處所。",
        "translation": "The Dharma and pleasure are practiced together, and there's nothing greater than this treasure, which has no owner, or if it were empty and had no place.",
        "source": "T15n0636_002:0515b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　深入諸微妙，　　曉了一切人，　使之得大法，　　斷滅勤苦根。",
        "translation": "He deeply penetrates the subtleties and understands all people, enabling them to attain the great Dharma and eliminate the root of suffering and striving.",
        "source": "T15n0636_002:0515b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切世間人，　　悉有意不解，　以法為覺意，　　以慧救一切。」",
        "translation": "All worldly people have intentions that they don't understand, so they take the teaching as their awakening intention and use their wisdom to save them all.\"",
        "source": "T15n0636_002:0515b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛爾時遙為寶來菩薩說頌曰：「離空非想，　　是想非空，　　於法不起，　即為是起。",
        "translation": "The Buddha then spoke a verse for the jeweled tathāgata, saying, \"Secluded from emptiness and not conception, this conception is not emptiness, and when a dharma doesn't arise, this is what arises.",
        "source": "T15n0636_002:0515b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　常當軟意，　　淨無所有，　色欲同合，　　無相入者。",
        "translation": "Always keep a soft mind, pure and devoid of existence, and form and desire are united, so there are no marks to enter.",
        "source": "T15n0636_002:0515b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所說無形，　不離有形，　　因法如夢，　　所可無底。",
        "translation": "What's described as formless doesn't part from form, and the cause is like a dream that has no bottom.",
        "source": "T15n0636_002:0515b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是寂離寂，　　無離不造，　　眾法無主，　所可如化。",
        "translation": "They are quiescent, free from quiescence, and nothing is free from uncreated, and all dharmas lack owners, so they can be transformed.",
        "source": "T15n0636_002:0515b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　都無所受，　　法無所捨，　所作到見，　　一切皆然。",
        "translation": "Nothing is received, dharmas are not abandoned, and everything that's created and seen is real.",
        "source": "T15n0636_002:0515c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　非色離色，　是色不離，　　其法如色，　　其處如是。",
        "translation": "It's not form that's free of form, but form that's not free, which is like form and whose location is like this.",
        "source": "T15n0636_002:0515c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非音是響，　　無聞不見，　　不聽不觀，　所有如是。",
        "translation": "It's not sound, but sound, not heard or seen, not heard or observed, and all are as they are.",
        "source": "T15n0636_002:0515c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於化無名，　　自言為是，　法無是計，　　所度如是。",
        "translation": "In transformation there's no name, it's self-referred to as such, the dharmas are not imagined, and the attainments are thus.",
        "source": "T15n0636_002:0515c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於幻無見，　所見離見，　　離貪諸欲，　　非法所儀。",
        "translation": "In illusion there's no view, what's seen is free of view, and he's free of desire for what's not the proper form of the Dharma.",
        "source": "T15n0636_002:0515c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於欲無垢，　　不著無離，　　如是諦見，　無有見者。",
        "translation": "Undefiled by desire, unattached and unseparated, he thus sees, and there's no one who sees.",
        "source": "T15n0636_002:0515c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於淨離淨，　　十方無造，　所可若實，　　如化無主。」",
        "translation": "In purity and freedom from purity, there's nothing created in the ten directions, and what's possible and real is like the transformation without a master.\"",
        "source": "T15n0636_002:0515c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來菩薩知佛所說，便於宮中說頌曰：「疑本不解，　　謂法皆然，　　本無常住，　疑慧如是。",
        "translation": "Knowing what the Buddha had said, the jeweled bodhisattva then spoke a verse in the palace, \"The basis of doubt is not understood, which is to say that all things are like this, that the basis is not eternally abiding, and that doubt and wisdom are thus.",
        "source": "T15n0636_002:0515c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於想無勞，　　識念無苦，　舉名住字，　　非求法者。",
        "translation": "Thoughts are not labored, consciousnesses are not painful, and words are given to indicate abiding, they aren't those who seek the Dharma.",
        "source": "T15n0636_002:0515c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於本不爾，　不還不是，　　所可無可，　　遠離無可。",
        "translation": "In the past, it wasn't so, wasn't returned, was possible or not possible, and was free from being impossible.",
        "source": "T15n0636_002:0515c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　脫生無滅，　　是即為滅，　　於滅無想，　是為非滅。",
        "translation": "Being freed from birth and not ceasing is cessation, and being free from perception of cessation is not cessation.",
        "source": "T15n0636_002:0515c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於法無生，　　亦不想成，　所以者何？",
        "translation": "In dharmas that are unarisen, there's also no intention of becoming, so why is that?",
        "source": "T15n0636_002:0515c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸法皆空。",
        "translation": "\"All things are empty.",
        "source": "T15n0636_002:0515c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　亦不求言，　我離泥洹，　　所以者何？",
        "translation": "Nor does he seek to say, \"I'm free of nirvāṇa,\" so why is that?",
        "source": "T15n0636_002:0515c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　本末淨故。",
        "translation": "\"The origin and derivative are purified.",
        "source": "T15n0636_002:0515c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不盡十方，　　舉之為證，　　有言是我，　是即為證。",
        "translation": "Not exhausting the ten directions and citing them as realization, if someone says this is the self, this is realization.",
        "source": "T15n0636_002:0515c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不當遠念，　　念於十方，　法無二法，　　即得無名。",
        "translation": "He shouldn't be distantly mindful, but he's mindful of the ten directions, that there are no two dharmas, and that's when he attains namelessness.",
        "source": "T15n0636_002:0515c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　法非思想，　可當逮者，　　起行如是，　　不見尊法。",
        "translation": "That dharma isn't thought, but it's something to be grasped, and when you act in this way, you don't see the honored Dharma.",
        "source": "T15n0636_002:0515c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　要當解慧，　　於妙不恐，　　深行不主，　可謂慧門。」",
        "translation": "You must understand wisdom, not be afraid of the subtle, and conduct profound practices that don't predominate, which can be called the approach of wisdom.\"",
        "source": "T15n0636_002:0515c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來菩薩問文殊師利：「今在會中新發意者，我欲使得無極法，當何以致之？」",
        "translation": "The jeweled tathāgata asked Mañjuśrī, \"Now, for those who have newly aroused the intention in the assembly, what would I want to make the supreme Dharma, and how would I get it?\"",
        "source": "T15n0636_002:0515c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊答曰：「於想無作即得無極法。」",
        "translation": "Mañjuśrī answered, \"When conceptions are unconstructed, the supreme Dharma is attained.\"",
        "source": "T15n0636_002:0515c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何謂無想作者？」",
        "translation": "He also asked, \"What's meant by the author of no ideation?\"",
        "source": "T15n0636_002:0515c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊言：「當逮九法寶：一者意無處所是即寶、二者觀法無主是即寶、三者不見有當來過去是即寶、四者於法無有造作者是即寶、五者所施但施經法是即寶、六者見五道勤苦於其中不轉是即寶、七者所覺不遠漚和拘舍羅是即寶、八者直見諸法不處法有二是即寶、九者到於泥洹亦如化是即寶，是為九法寶。」",
        "translation": "Mañjuśrī said, \"You will acquire nine qualities: first, the mind has no place, which is treasure; second, observing that a dharma has no owner, which is treasure; third, not seeing a future past, which is treasure; fourth, having no creator of dharmas, which is treasure; fifth, giving only sūtras and dharmas, which is treasure; sixth, seeing that the five paths of suffering and hardship are not transformed within them, which is treasure; seven, perceiving that the bubble and the koṭīla are not far apart, which is treasure; eighth, directly seeing that dharmas don't have two locations in dharmas, which is treasure; and ninth, arriving at nirvāṇa and being transformed like that, which is treasure.",
        "source": "T15n0636_002:0515c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是文殊師利說偈曰：「於可無所欲，　　所住無常名，　若空無有垢，　　佛笑無不可。",
        "translation": "Mañjuśrī then spoke in verse, \"When there's nothing to desire, what's abiding there is impermanent in name only, and if emptiness were without stain, the Buddha would laugh at it as not being impossible.",
        "source": "T15n0636_002:0516a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　笑空不離末，　　如本無笑者，　已住諸法名，　　一切皆如笑。",
        "translation": "Laughing at emptiness doesn't separate from the derivative, so as the original lacks laughter, the names of the dharmas that have been abiding are all like laughter.",
        "source": "T15n0636_002:0516a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　本末皆自然，　　無有往來者，　笑者有還報，　　不還亦不笑。",
        "translation": "The beginning and end are all natural, there's no past and future, and there's a return for laughing that isn't returned, and neither is there laughter.",
        "source": "T15n0636_002:0516a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法者皆是一，　　已笑便有二，　於二無名字，　　是故為是尊。",
        "translation": "All dharmas are one, but once they're laughed at, there are two, and in both there's no name; therefore, they're honored.",
        "source": "T15n0636_002:0516a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所笑無所著，　　但為眾法施，　所動無所動，　　是故無上尊。",
        "translation": "Nothing is laughed at that's attached to, but it's given for the sake of all dharmas, and nothing is moved that's moved; therefore, it's the supreme honored one.",
        "source": "T15n0636_002:0516a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　笑者無還報，　　一切無有主，　其笑不離本，　　是故天中天。",
        "translation": "That which is laughed at has no retribution, has no owner in all, and its laughter doesn't part from the origin; it's therefore the god of gods.",
        "source": "T15n0636_002:0516a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　笑者無所起，　　但為倒見耳，　於法悉寂然，　　寂者本無故。",
        "translation": "That laugher arises from nothing but a mistaken view, and all things are quiescent, because that quiescence is originally nonexistent.",
        "source": "T15n0636_002:0516a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　笑者不離化，　　以化大施與，　於化無舉名，　　是故乃為法。",
        "translation": "That laugher isn't free from transformation, but is a great gift because of transformation, and there's no name given to transformation; therefore, it's a dharma.",
        "source": "T15n0636_002:0516a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於法無有是，　　但為不脫施，　所脫不為脫，　　佛者亦如是。",
        "translation": "There's nothing like this in the Dharma, but it's a gift that's not liberated, and what's liberated isn't liberated, so is the Buddha.",
        "source": "T15n0636_002:0516a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　故於大會中，　　議度無度者，　於法作施與，　　無有與比者。」",
        "translation": "Therefore, in the assembly, they discussed liberating the unsurpassed and making gifts of the Dharma, and there's no one who compares with them.\"",
        "source": "T15n0636_002:0516a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗問寶來曰：「欲使十方一切學者，皆得總持諸陀隣尼。",
        "translation": "Śāriputra asked the jeweled tathāgata, \"I want all scholars in the ten directions to attain the mastery of the dhāraṇīs.",
        "source": "T15n0636_002:0516a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行何法當得致之？」",
        "translation": "What teaching should be cultivated that would lead to that?\"",
        "source": "T15n0636_002:0516a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來曰：「當行三十二法寶：一者欲使一切未發意者皆當度之如化無礙；二者未發無上正真道意者皆令住正法；三者視三千大千剎土等無異；四者若住限者令遠離眾欲在於慧門，無動無轉得至泥洹；五者人說有天無天志不動還；六者志道堅固意不怯弱；七者一切無來受生者，視當來過去無有二；八者觀諸三昧禪寂然無處所；九者諸所度無有主，一切從空致空；十者三千大千諸佛我悉從受法；十一者他方剎土敢有來聽經者悉令得決；十二者諸佛剎土所有華香，來者亦不喜、不來者亦不求；十三者諸發意者使得法住；十四者當來過去意無增減，所以者何？",
        "translation": "寶來曰：「當行三十二法寶：一者欲使一切未發意者皆當度之如化無礙；二者未發無上正真道意者皆令住正法；三者視三千大千剎土等無異；四者若住限者令遠離眾欲在於慧門，無動無轉得至泥洹；五者人說有天無天志不動還；六者志道堅固意不怯弱；七者一切無來受生者，視當來過去無有二；八者觀諸三昧禪寂然無處所；九者諸所度無有主，一切從空致空；十者三千大千諸佛我悉從受法；十一者他方剎土敢有來聽經者悉令得決；十二者諸佛剎土所有華香，來者亦不喜、不來者亦不求；十三者諸發意者使得法住；十四者當來過去意無增減，所以者何？",
        "source": "T15n0636_002:0516a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知本無二故；十五者悉欲令十方蜎飛蠕動奉持禁戒終無毀犯；十六者無有邪念在於十方，轉意還本則向慧門；十七者無所不忍常無邪恨；十八者從觀至觀無有度者；十九者如本無住無常住處；二十者所度無有主，如空無念想；二十一者於慧作施與無有舉名者，於欲無所著便從是得脫；二十二者所說不離對因作施與故；於大國眾中度無脫者；二十三者於無數剎飛到他剎，在諸佛前無所罣礙；二十四者視諸剎等無得脫者；二十五者淨癡同合本淨無異；二十六者住大千中主作橋梁，勸進未覺令冥見明；二十七者於大海中作大船師，渡諸群生無有厭極；二十八者作無邊蓋閉塞眾垢；二十九者作無極惠不離十方；三十者作大慈哀苞潤一切，諸未度者悉當度之，故號之曰天中之天；三十一者常行等心無有偏適救濟無雙，故號無上尊祐；三十二者菩薩所說不離經法，遍大千剎中莫不等聞，是故空中自然生華；是為菩薩三十二法寶。」",
        "translation": "知本無二故；十五者悉欲令十方蜎飛蠕動奉持禁戒終無毀犯；十六者無有邪念在於十方，轉意還本則向慧門；十七者無所不忍常無邪恨；十八者從觀至觀無有度者；十九者如本無住無常住處；二十者所度無有主，如空無念想；二十一者於慧作施與無有舉名者，於欲無所著便從是得脫；二十二者所說不離對因作施與故；於大國眾中度無脫者；二十三者於無數剎飛到他剎，在諸佛前無所罣礙；二十四者視諸剎等無得脫者；二十五者淨癡同合本淨無異；二十六者住大千中主作橋梁，勸進未覺令冥見明；二十七者於大海中作大船師，渡諸群生無有厭極；二十八者作無邊蓋閉塞眾垢；二十九者作無極惠不離十方；三十者作大慈哀苞潤一切，諸未度者悉當度之，故號之曰天中之天；三十一者常行等心無有偏適救濟無雙，故號無上尊祐；三十二者菩薩所說不離經法，遍大千剎中莫不等聞，是故空中自然生華；是為菩薩三十二法寶。」",
        "source": "T15n0636_002:0516b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是寶來菩薩說頌曰：「十方普如化，　　一切皆無常，　真法正諦寂，　　演說度眾生，　有想不離想，　　一切實本空，　若華未施葉，　　其色不可當，　一切所眾欲，　　立之可意王，　諸寶無上尊，　　號為天中天。",
        "translation": "Thereupon, the jeweled tathāgata bodhisattva spoke a verse, \"They are universally transformed in ten directions, all are impermanent, the true teaching is truly quiescent, they are taught to liberate sentient beings, there are conceptions and not free from conceptions, all are truly empty, if a flower is not yet a leaf, its form is improper, all that is desired is established as a wishable king, the unsurpassed honored among the treasures, and it's called the god of gods.",
        "source": "T15n0636_002:0516c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　故於大會中，　　議度未脫者，　其本無常住，　　故字十力尊。",
        "translation": "Therefore, in the great assembly, he discussed liberating those who are yet to be liberated, whose roots are impermanent, and therefore he's called the honored one of the ten powers.",
        "source": "T15n0636_002:0516c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切為倒見，　　世間謂之冥，　所可若如化，　　能脫十方中。",
        "translation": "All views are mistaken, which the world calls darkness, and what's possible is like transformation, which can liberate them in ten directions.",
        "source": "T15n0636_002:0516c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　虛空無常處，　　佛藏悉在中，　以脫無脫者，　　故教十方人。",
        "translation": "Space is an impermanent place, and the buddha-store is entirely within it; because he liberates those who aren't liberated, he teaches people in ten directions.",
        "source": "T15n0636_002:0516c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方諸佛剎，　　合之為一國，　自然眾大會，　　悉滿十方中。",
        "translation": "The buddha bases in the ten directions are combined into a single country, and naturally the multitude of assemblies fills the ten directions.",
        "source": "T15n0636_002:0516c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛者一切覺，　　笑不離其容，　不離黃金色，　　以示未脫人。",
        "translation": "The Buddha, who is all enlightened, doesn't part with his countenance in laughter, and he doesn't part with gold to show people who haven't yet escaped.",
        "source": "T15n0636_002:0516c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方為作導，　　意不離法王，　所施無所施，　　華布於十方。",
        "translation": "He acts as a guide in the ten directions, his mind doesn't part from the king of the Dharma, and the flowers that he gives and doesn't give are distributed in the ten directions.",
        "source": "T15n0636_002:0516c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金色大蓮華，　　遍滿諸空中，　起想而作行，　　不住諸天中。",
        "translation": "The great golden lotus fills the air, generating perceptions and actions that don't reside among the gods.",
        "source": "T15n0636_002:0516c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　文殊師利意，　　曠大無有雙，　使得道莂者，　　住在虛空中。",
        "translation": "Mañjuśrī's mind is so vast and unsurpassed that it causes those who have attained the enlightenment to abide in space.",
        "source": "T15n0636_002:0516c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　寶來慧意尊，　　光明遍宮中，　可意諸天人，　　悉得到法門。",
        "translation": "The jeweled tathāgata, the supreme one whose wisdom intent is to shine brightly throughout the palace, causes gods and humans to attain the Dharma teaching.",
        "source": "T15n0636_002:0516c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方諸菩薩，　　感動諸剎中。",
        "translation": "The bodhisattvas of the ten directions are moved among the buddhas.",
        "source": "T15n0636_002:0517a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今會諸天子，　　得聞是尊經，　徹見諸一切，　　乃到可意宮。",
        "translation": "Now, the assembled celestials hear this honored sūtra, thoroughly perceive them all, and arrive at the palace of Kageya.",
        "source": "T15n0636_002:0517a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　化為交露坐，　　萬種天華香，　聽受諸三昧，　　坐觀大眾中，　諸來宿功德，　　發意供養尊，　道者不直見，　　所有皆如是，　諸脫無有數，　　三界不可極。」",
        "translation": "They are transformed into sitting mates, scented with a myriad of celestial flowers, listening to and accepting the samādhis, sitting among the masses, observing the long-standing virtues of the tathāgatas, aspirating to make offerings to the venerable, and those on the path who don't directly see them, all are thus, their liberation is countless, and the three realms are inexhaustible.\"",
        "source": "T15n0636_002:0517a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利菩薩問寶來曰：「眾音如化，所作法無想，亦不可盡，故有自然。",
        "translation": "Mañjuśrī asked the jeweled tathāgata, \"The sounds of multitudes of people as they are transformed have no conception of what they do, and they are inexhaustible; therefore, they are natural.",
        "source": "T15n0636_002:0517a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以何脫之？」",
        "translation": "What will be the basis for their liberation?\"",
        "source": "T15n0636_002:0517a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來答曰：「有九法寶：一者自然無處亦如化；二者諸法無處亦如化；三者當來無處亦如化；四者諸所有世處亦如化；五者觀過去處亦如化；六者觀見諸法如幻耳，亦無有處亦如化；七者所見無處亦如化；八者得道無脫處亦如化；九者得於泥洹本無住處亦如化；是為九法可得脫慧。」",
        "translation": "The jewel replied, \"There are nine treasures of the Dharma: first, there's naturally no place that's also like transformation; second, there's no place for all dharmas that's also like transformation; third, there's no place in the future that's also like transformation; fourth, there are worldly places that are also like transformation; fifth, there's the place where one observes the past that's also like transformation; sixth, there's the place where one observes that all dharmas are illusory and have no existence that's also like transformation; seven, there's no place where one sees that's also like transformation; eighth, there's the place where one attains the path to liberation that's also like transformation; and ninth, there's the place where one attains nirvāṇa that has no abode in the past that's also like transformation; these are the nine things that lead to liberating wisdom.\"",
        "source": "T15n0636_002:0517a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊又問：「過於泥洹皆亦自然，誰為是化本者？",
        "translation": "Mañjuśrī also asked, \"Beyond nirvāṇa, which is also natural, and who is the origin of transformation?",
        "source": "T15n0636_002:0517a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰是化主者？",
        "translation": "Who is the master of transformation?",
        "source": "T15n0636_002:0517a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化為有本無？",
        "translation": "Is the basis of existence transformed into nonexistence?",
        "source": "T15n0636_002:0517a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化有所起處無？",
        "translation": "Is there a place where the teaching comes into being?",
        "source": "T15n0636_002:0517a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道為有處無？」",
        "translation": "Is there a place for the Way?\"",
        "source": "T15n0636_002:0517a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來答曰：「有九法知化無處：一者非道無處是則化、二者化非處無想是則化、三者化者無起化處無處是則化、四者非常名無有盡時是則化、五者化處無處是則化、六者於道無想是則化、七者化者於起無起是則化、八者化者於諸欲無有處是則化、九者化者於所度無所處是則化，是為九法知化本。」",
        "translation": "The jeweled lama answered, \"There are nine ways to know the nowhere of transformation: first, there's no place that's not the path that's transformed, second, there's no place that's transformed without conception, third, there's no place that's transformed without transformation, fourth, there's no place that's transformed when there's no end to non-names, fifth, there's no place that's transformed without the place of transformation, sixth, there's no conception that's the path that's transformed, seven, there's no place that's formed without arising that's transformed, eighth, there's no place that's desired that's transformed, and ninth, there's no place that's achieved by transformation that's transformed, and these are the nine ways to know the origin of transformation.\"",
        "source": "T15n0636_002:0517a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是文殊師利又說偈答曰：「十方無化者，　　化化無有形，　一切無常寶，　　是故為化主。",
        "translation": "Mañjuśrī then spoke another verse in reply, \"There's no transformation in the ten directions, and transformation has no form; all are impermanent treasures; therefore, they're the lords of transformation.",
        "source": "T15n0636_002:0517a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　道者不化得，　　亦不離其處，　所說無常形，　　自然在其處。",
        "translation": "The Way is not obtained by transformation, nor does it leave its place; the impermanent forms that are described are naturally present there.",
        "source": "T15n0636_002:0517b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸寶從化得，　　本離從無有，　其本同化生，　　是故人中尊。",
        "translation": "The treasures are obtained by transformation, their origin is free from nonexistence, and their origin is the same as that of transformation; therefore, they're honored among humans.",
        "source": "T15n0636_002:0517b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲者從化起，　　法本無有是，　化而住五道，　　無有見化主。",
        "translation": "Those who desire things arise from transformation, but the origin of dharmas is nothing, and they abide in the five destinies while being transformed, so there's no one who sees the master of transformation.",
        "source": "T15n0636_002:0517b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生死及五道，　　與化不相連，　以世貪不斷，　　故現正覺耳。",
        "translation": "Birth-and-death and the five destinies are not connected to transformation, and it's because worldly craving doesn't persist that they're now properly awakened ears.",
        "source": "T15n0636_002:0517b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來及化主，　　十方尊無極，　持化大其世，　　世間無知者。",
        "translation": "The Tathāgata and the master of transformation are honored in measureless ways in the ten directions, and they support the transformation of a great world that the world doesn't know about.",
        "source": "T15n0636_002:0517b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法輪無色轉，　　於化無轉者，　繫色有思想，　　深法無轉者。",
        "translation": "The wheel of the Dharma turns without form, the transformation doesn't turn, and there's thought bound to form, but the profound Dharma doesn't turn.",
        "source": "T15n0636_002:0517b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　想色化十方，　　莫不受法者，　所施大智慧，　　世間無說者。",
        "translation": "He conceives form and transforms ten directions, and there's no one who doesn't receive the teaching and who gives great wisdom that's not explained in the world.",
        "source": "T15n0636_002:0517b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸欲及羅漢，　　不逮覺是寶，　故於眾會中，　　廣說無二寶。",
        "translation": "Desire seekers and arhats don't grasp this treasure, so they explain it in detail in the assembly as the unsurpassed treasure.",
        "source": "T15n0636_002:0517b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智慧不可極，　　光明最無有，　十方作橋梁，　　所說無有二。",
        "translation": "That wisdom is inexhaustible, that light is most unsurpassed, that bridge is built in ten directions, and that teaching is not two.",
        "source": "T15n0636_002:0517b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方諸佛剎，　　悉令為平等，　亦不使其人，　　發意有異心。",
        "translation": "All the buddha bases in the ten directions are made equal, and no one is made to have a different intention.",
        "source": "T15n0636_002:0517b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方諸法園，　　一切法度垢，　亦不從世間，　　於法無脫者。",
        "translation": "In the Dharma parks of the ten directions, all dharmas are liberated from defilement, and they don't follow the world, so there's no one who's liberated from the Dharma.",
        "source": "T15n0636_002:0517b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於惠無有脫，　　不見往來者，　於寂復見寂，　　明中復見明。",
        "translation": "In wisdom there's no liberation, and he doesn't see those who have come and gone, yet he sees stillness again in stillness and insight again in insight.",
        "source": "T15n0636_002:0517b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法者非慧得，　　自然本無是，　慧冥俱同合，　　故無相識者。",
        "translation": "Dharmas aren't attained by wisdom; they naturally don't exist, and both wisdom and ignorance are combined, so there's no such thing as a mutual consciousness.",
        "source": "T15n0636_002:0517b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　癡慧不同合，　　其慧眾冥明，　所施但為法，　　如華在高山。",
        "translation": "Deluded wisdom doesn't combine, and the wisdom of many of them is obscure and clear, so what's given is only the Dharma, like a flower on a high mountain.",
        "source": "T15n0636_002:0517b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸惡不可極，　　色欲不可盡，　泥洹及生死，　　一切皆如是。",
        "translation": "The evils cannot be ended, the desires of form cannot be exhausted, and all things are thus, including nirvāṇa and birth-and-death.",
        "source": "T15n0636_002:0517b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十方諸佛慧，　　無知無覺者，　所以見淨法，　　故言世無有。」",
        "translation": "The wisdom of the buddhas in the ten directions is neither known nor perceived, which is why they see the pure Dharma and say it doesn't exist in the world.\"",
        "source": "T15n0636_002:0517c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曇摩菩薩復問寶來菩薩言：「於化無起離，誰為成主者？",
        "translation": "Dharma Bodhisattva again asked the Jewel-Arising Bodhisattva, \"Where there's no arising and separation from transformation, who is the one who becomes the master?",
        "source": "T15n0636_002:0517c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥洹不生滅、不遠五道，當來發意轉住法輪淨無諸垢，一切眾生誰為度者？」",
        "translation": "Who will be the one to deliver all sentient beings who don't arise and cease in nirvāṇa, who aren't far from the five paths, who will arouse the intention to turn and abide in the wheel of the Dharma in the future, and who will be pure and undefiled?\"",
        "source": "T15n0636_002:0517c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來答曰：「快哉所問！",
        "translation": "The jeweled tathāgata replied, \"What a pleasant question!",
        "source": "T15n0636_002:0517c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲決一切生死之根，乃如是乎？",
        "translation": "Is this the way to resolve all the roots of birth and death?",
        "source": "T15n0636_002:0517c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩有九法寶：一者於化化主無主；二者於泥洹與生死初無相知者；三者於生死於滅無滅；四者一切天上使不還生無生處；五者當起意未起意如處住；六者三千大千佛剎觀了無得度者；七者於念無起處；八者悉使三千佛剎皆取泥洹意亦不喜，不取泥洹意亦不瞋，所以者何？",
        "translation": "There are nine bodhisattva assets: first, the lord of transformation and transformation has no lord; second, there's no mutual knowledge of nirvāṇa and birth-and-death in the beginning; third, birth-and-death ceases and doesn't cease; fourth, all heavenly realms cause no rebirth and no place of birth; fifth, the mind that arises or does not arise abides as it is; sixth, 3,000 great thousand buddhas are fully observed and there's no one to be liberated; seven, there's no place for mindfulness to arise; and eighth, they all cause 3,000 buddhas to take nirvāṇa with the intention not to rejoice and not to take nirvāṇa with the intention not to anger.",
        "source": "T15n0636_002:0517c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法無處故；九者隨願取羅漢我悉令發意，若有發意求願者，不令復還不起諸生無有還願；是為九法。」",
        "translation": "Because there's no place for all dharmas, nine of them are obtained by taking arhats according to their vows, and I always cause them to arouse the intention, and if they arouse the intention and seek the vow, I don't cause them to return; sentient beings who don't arise have no desire to return; these are the nine dharmas.\"",
        "source": "T15n0636_002:0517c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又說偈言：「於可無不可，　　於欲無所欲，　所度無見者，　　法轉無常處。",
        "translation": "He also spoke a verse, saying, \"Whether it's possible or not, whether it's desired or not, what's crossed without seeing, or whether it's the result of the transformation of things into something impermanent.",
        "source": "T15n0636_002:0517c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慧者無所說，　　因度無往者，　故見大正法，　　世之最無有。",
        "translation": "Wisdom teaches nothing, causes deliverance for those who don't go there, and so they see the great right teaching, which is most unmatched in the world.",
        "source": "T15n0636_002:0517c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　道者無常名，　　故為十方寶，　以得無得者，　　生死無有道。",
        "translation": "The path has no constant name, so it's a treasure in ten directions, and because it's attained and unattained, there's no path through birth and death.",
        "source": "T15n0636_002:0517c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　四馬不可盡，　　可意無有足，　世間悉樂之，　　不捨不得道。",
        "translation": "The four horses are inexhaustible, there's nothing to wish for, and the world is full of them, so they don't abandon or fail to attain the path.",
        "source": "T15n0636_002:0517c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　畏生無有脫，　　不畏無脫者，　生死當舉名，　　立之為五道。",
        "translation": "Those who fear birth and have no liberation and those who don't fear no liberation will be named by birth and death and established as one of the five paths.",
        "source": "T15n0636_002:0517c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有報無答者，　　可謂為是法，　法者本無二，　　所有諦以覺。",
        "translation": "Those who have retribution and no answer can be called these dharmas, which are originally nondual and are perceived in their own right.",
        "source": "T15n0636_002:0517c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無邊亦無幅，　　無極不可計，　本際如影響，　　無有往來者。",
        "translation": "Without limit or breadth, without limit or calculation, its original state is like an effect, and there's no going or coming.",
        "source": "T15n0636_002:0517c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於起無所起，　　法無諸欲者，　生死本無處，　　生死化如是。",
        "translation": "In arising there's nothing that arises, dharmas have no desires, birth-and-death has no place in the first place, and birth-and-death transforms like this.",
        "source": "T15n0636_002:0518a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於淨無有淨，　　於垢無有垢，　悉為十方人，　　斷絕諸五道。",
        "translation": "In purity there's nothing pure, in defilement there's nothing defiled, and all are people in the ten directions who sever the five destinies.",
        "source": "T15n0636_002:0518a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨意若如水，　　一切無瑕垢，　青黃及白黑，　　悉得見其形。",
        "translation": "With a pure mind like water, all are without blemish, and their forms can be seen in green, yellow, white, and black.",
        "source": "T15n0636_002:0518a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法不可呵，　　即得無上寶，　吾我及與人，　　世間無得者。",
        "translation": "These things cannot be denied, and they attain the unsurpassed treasure that's not available to us or to anyone else in the world.",
        "source": "T15n0636_002:0518a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不住無住諦，　　所有諦如是，　所覺無所見，　　世間諦如是。",
        "translation": "They don't abide in an unabiding truth, they exist in such a way that what's perceived and what's seen are thus in the world.",
        "source": "T15n0636_002:0518a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不度無不度，　　世時誰不有，　十方立正覺，　　悉得無上寶。」",
        "translation": "Without passing or failing to pass, who in the world doesn't exist at one time or another, establishing right awakening in ten directions, they all attain the unsurpassed treasure.\"",
        "source": "T15n0636_002:0518a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曇摩菩薩問寶來菩薩言：「欲使十方諸天人民，自然皆令得如其處，當行何等法得致之乎？」",
        "translation": "Bodhisattva Dharma asked Bhūraṇī, \"What method would he practice to cause the gods and people of the ten directions to naturally attain their places?\"",
        "source": "T15n0636_002:0518a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶來答曰：「有六事得逮是法：一者聞知是會時是即為寶；二者得聞是經是即為寶；三者逮本功德是即為寶；四者得聞是經法者，悉得六萬三昧，是即為寶；五者已得六萬三昧，欲十方人發無上意，是即為寶；六者皆使十方悉得會於佛樹，是即為寶。」",
        "translation": "The jeweled lama answered, \"There are six things that make it possible to acquire this teaching: first, when you hear about this assembly, that's a treasure; second, when you hear about this sūtra, that's a treasure; third, when you acquire the original merit, that's a treasure; fourth, when you hear about the teaching of this sūtra, they all attain 60,000 samādhis, which is a treasure; fifth, once they have attained 60,000 samādhis, they want people in ten directions to give rise to the unsurpassed intention, which is a treasure; and sixth, they all cause everyone in ten directions to meet the Buddha tree, which is a treasure.\"",
        "source": "T15n0636_002:0518a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是經時，九十億菩薩，六十七億諸天人民，皆得無所從生法處；九億菩薩得是三昧。",
        "translation": "When this sūtra was spoken, 9 billion bodhisattvas and 6.7 billion gods and people attained the Dharma abode of no place of birth, and 900 million bodhisattvas attained this concentration.",
        "source": "T15n0636_002:0518a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千大千佛剎六反震動，諸天於空中大作伎樂，諸龍、阿須倫，皆得聞見是深三昧。",
        "translation": "Three thousand great thousand buddha bases shook six times, the gods made great music in the sky, and the dragons and asuras all got to hear and see this profound concentration.",
        "source": "T15n0636_002:0518a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難正衣服，長跪白佛言：「是名何經？",
        "translation": "Ānanda correctly dressed himself, knelt down long enough, and said to the Buddha, \"What's this sūtra called?",
        "source": "T15n0636_002:0518a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you uphold it?\"",
        "source": "T15n0636_002:0518a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「是名為『無極寶』，當奉持之。」",
        "translation": "The Buddha said to Ānanda, \"This is called the 'infinite jewel,' which you must consecrate.\"",
        "source": "T15n0636_002:0518a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經已，諸天、人、阿須倫、人非人皆歡喜，各前為佛作禮而去。",
        "translation": "After the Buddha spoke the sūtra, the gods, humans, asuras, humans, and nonhumans rejoiced, each paid homage to the Buddha, and departed.",
        "source": "T15n0636_002:0518a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說無極寶三昧經卷下",
        "translation": "Second Foshuo wujibao sanmei jing roll",
        "source": "T15n0636_002:0518a29_0",
        "is_bad_quality": false
    }
]