[
    {
        "source_sentence": "月燈三昧經卷第二",
        "translation": "Yuechuan sanmei jing, vol. 2",
        "source": "T15n0639_002:0553c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高齊天竺三藏那連提耶舍譯",
        "translation": "A Translation of the Sanskrit Tripiṭaka of Nālandī Yeshiva by Gaoqi Tianzang",
        "source": "T15n0639_002:0553c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告月光童子言：「過去久遠無量無邊不可思議過阿僧祇劫，爾時有佛號曰聲德如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊出現於世。",
        "translation": "It was then that the Bhagavān addressed the Boy Moonlight, \"Long ago, in an incalculably long and unfathomably long incalculable eon, there was a Buddha named Śakra Tathāgata, Worthy, Perfectly Omniscient, Perfectly Virtuous, Well Gone, Worldly Understanding, Unsurpassed Person, Tamer of Beings, Teacher of Gods and People, Buddha, and World Honored One who appeared in the world.",
        "source": "T15n0639_002:0553c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0553c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時聲德如來、應、正遍知於初會眾集有八億聲聞，皆阿羅漢，諸漏已盡，逮得己利，盡諸有結，依於正教，心善解脫，能到一切心自在岸；第二會集有七億眾、第三會集有六億眾，一切亦是大阿羅漢，諸漏已盡，逮得己利，盡諸有結，依於正教，心善解脫，能到一切心自在岸。",
        "translation": "At the time, there were 800 million śrāvakas assembled by the Sound Tathāgata, Worthy of Offerings, and Perfectly Omniscient in the first assembly, all of whom were arhats, had ended the contaminants, had acquired their own benefit, had ended the bonds of existence, relied on the right teaching, were well liberated in their minds, and could reach the shore of full mental mastery; 700 million people assembled in the second assembly and 600 million in the third assembly, all of whom were also great arhats, had ended the contaminants, had acquired their own benefit, had ended the bonds of existence, relied on the right teaching, were well liberated in their minds, and could reach the shore of full mental mastery.",
        "source": "T15n0639_002:0553c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0553c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼佛壽四萬歲，時閻浮提安隱豐樂，人民熾盛，普遍充滿。",
        "translation": "At the time, that Buddha lived for 40,000 years, and Jambudvīpa was peaceful and abundant, with its people flourishing and being thoroughly filled.",
        "source": "T15n0639_002:0553c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0553c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時閻浮提有二大王：一名、堅固力，二名、大力。",
        "translation": "At the time, there were two great kings of Jambudvīpa: one with sturdy power and two with great power.",
        "source": "T15n0639_002:0553c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二大王一一統領半閻浮提，二王境土安隱豐樂，人民熾盛，普遍充滿。",
        "translation": "Each of these two great kings ruled half of Yambudvīpa, and the lands of their realms were peaceful and abundant, and their people flourished and were thoroughly filled.",
        "source": "T15n0639_002:0553c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時聲德如來在大力王國出現於世。",
        "translation": "The Śakra Tathāgata then appeared in the world in the kingdom of Dṛṣadhiprabha.",
        "source": "T15n0639_002:0553c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0553c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時大力王請聲德如來及比丘僧滿足千年，以一切隨順清淨無過衣服、飲食、臥具、湯藥而為供養。",
        "translation": "King Mahākauṣṭhila then invited the Śakra Tathāgata and the monks and nuns to fulfill a thousand years of offerings with all the clothes, food, bedding, and medicine that were obediently pure and without fault.",
        "source": "T15n0639_002:0553c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0553c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼聲德如來及聲聞僧多饒利養、恭敬、讚歎。",
        "translation": "That śrāvaka tathāgata and śrāvaka saṃgha gave generous support, respect, and praise.",
        "source": "T15n0639_002:0553c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時有淨信長者、諸婆羅門，於聲德如來及聲聞僧所發勇猛意，學大力王而設供養——謂以世財為勝供養——彼人不知行供養也。",
        "translation": "\"If there are pure faithful elders and brāhmaṇas who arouse the courageous intention of the Tathāgata of Sound and the śrāvaka saṃgha to train in the offerings of King Maitreya, which are based on making offerings of worldly possessions, they don't know how to make offerings.",
        "source": "T15n0639_002:0553c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何行供養？",
        "translation": "How do they make offerings?",
        "source": "T15n0639_002:0554a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂受持五戒、八戒、出家詣佛、親覲請問見深法忍。",
        "translation": "It's called observing the five or eight precepts, leaving home to visit the Buddha, and personally visiting him to ask about the profound tolerance of the Dharma.",
        "source": "T15n0639_002:0554a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時聲德如來作如是念：『是諸眾生志意下劣，不能受持五戒、八戒、出家詣佛、親覲請問見深法忍、修於梵行寂靜遠離、受具足戒得比丘分、及以受行究竟善根，如是寂滅樂具無上妙樂悉皆遠離，但以世財而供養我。",
        "translation": "The Śakra Tathāgata then had this thought, 'Are these sentient beings so low in intention that they can't observe the five or eight precepts, leave home and visit the Buddha, ask intimate questions about the profound tolerance of the Dharma, cultivate the religious practice, quietly seclude themselves, receive the full set of precepts, attain the monk's portion, and train in the cultivation of the ultimate good roots, or are thus free from the unsurpassed marvelous pleasures of tranquility and bliss, but only make offerings to me with worldly possessions?'",
        "source": "T15n0639_002:0554a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生但希小樂，謂為至樂；是諸眾生但重現法及後世法，不能愛重究竟善根。",
        "translation": "These sentient beings only desire small pleasures, which are called the ultimate pleasures, and these sentient beings only value present things and later things, but they can't value the ultimate good roots.",
        "source": "T15n0639_002:0554a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名重現法？",
        "translation": "What's the term valuing present dharmas?",
        "source": "T15n0639_002:0554a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂樂五欲。",
        "translation": "\"It's about enjoying the five desires.",
        "source": "T15n0639_002:0554a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名重後世善根？",
        "translation": "What's called valuing the good roots of the later life?",
        "source": "T15n0639_002:0554a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂樂生天。",
        "translation": "It's called the desire to be born in heaven.",
        "source": "T15n0639_002:0554a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為究竟善根？",
        "translation": "What are these called the ultimate good roots?",
        "source": "T15n0639_002:0554a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂究竟清淨、究竟吉祥、究竟梵行、究竟窮盡、究竟最後、究竟涅槃。",
        "translation": "It's ultimately pure, ultimately auspicious, ultimately religious, ultimately exhaustive, ultimately final, and ultimately nirvāṇa.",
        "source": "T15n0639_002:0554a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今說如是法，令此眾生於其檀行不為究竟最勝供養，但以無上行而供養我。』",
        "translation": "Now, I explain this teaching so that these sentient beings won't make offerings to the ultimate and most excellent in their religious practice but will make offerings to me with their unsurpassed practice.\"",
        "source": "T15n0639_002:0554a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時聲德如來欲覺悟彼大力王及諸長者、婆羅門等而說偈言：「『若人行於財、食施，　　彼此不名相尊敬，　　如是所行不可歎，　　諸佛、智者已遠離；　　若說無我智慧者，　　如是勝人應奉事，　　彼於聖諦信不動，　　奉敬是者佛所歎。",
        "translation": "It was then that the Sound Tathāgata wanted to awaken that great king, the elders, and the priests, and he spoke in verse, saying, \"Suppose a person makes a gift of goods and food and doesn't honor one another, for such actions are not praiseworthy, and the buddhas and wise ones have already departed; if they say that wisdom is without self, such a superior person should serve them, whose faith in the noble truths isn't shaken, and who honors such a person is praised by the Buddha.",
        "source": "T15n0639_002:0554a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人財、食而奉施，　　但獲現近少利益；　　若能遠離如是施，　　是人成就出家行。",
        "translation": "If someone gives alms of food and possessions, they'll only get little benefit in the present; if they can part with such alms, they'll achieve renunciant practice.",
        "source": "T15n0639_002:0554a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有能起無財心，　　又能顯示無財法，　　亦能淨信無財者，　　是人速成無上道。",
        "translation": "If someone can give rise to a mind devoid of possessions, can display the Dharma devoid of possessions, and can have pure faith in the absence of possessions, this person will quickly achieve the unsurpassed path.",
        "source": "T15n0639_002:0554a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無有處於五欲中，　　於妻子等生愛著，　　凡愚恒在居家者，　　是人而能得漏盡；　　厭離五欲如火坑，　　能於妻子離愛染，　　怖畏居家求出離，　　獲勝菩提則不難。",
        "translation": "There's no one who lives in the five desires, becomes attached to wives and so forth, or is a fool who remains at home, but this person can attain the end of the contaminants; they're disillusioned with the five desires like a fire pit, can part with the defilement of craving for wives, fear going to their home, and seek escape, and then it's not difficult to attain superior enlightenment.",
        "source": "T15n0639_002:0554a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無有過去諸如來，　　及其現在、未來者，　　常在居家住欲地，　　而能獲得勝妙道。",
        "translation": "There are no tathāgatas past or present or future who remain at home in the realm of desire and attain the surpassing and marvelous path.",
        "source": "T15n0639_002:0554b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　棄捨王位如涕唾，　　住於遠離空閑處，　　斷除煩惱降諸魔，　　悟解離垢無為道。",
        "translation": "They abandon their position as kings like tears and spittle, abide in a lonely, empty place, eliminate afflictions and subdue demons, and awaken to the path of freedom from defilement and nonproductivity.",
        "source": "T15n0639_002:0554b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有恒沙世雄猛，　　千萬億歲而供養，　　有能厭患在家者，　　如是功德最為上。",
        "translation": "If there's a Kāśyapa hero who makes offerings for a thousand million years, and there's someone at home who's weary of suffering, this is the greatest merit.",
        "source": "T15n0639_002:0554b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　非是飲食及衣服、　　諸妙花香及塗香，　　如是等事供養佛，　　能如出家奉行法。",
        "translation": "Whether it's food, drink, clothing, or the scent of fine flowers and paints, such things as these are offered to the Buddha, and they're like the teachings practiced by renunciant monks.",
        "source": "T15n0639_002:0554b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有樂求菩提者，　　能利眾生厭世間，　　趣向空閑行七步，　　如是福報最為上。』",
        "translation": "If there's someone who happily seeks bodhi, who can benefit sentient beings and become disillusioned with the world, and who takes seven steps toward freedom, such is the greatest reward.'",
        "source": "T15n0639_002:0554b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大力王聞聲德如來、應、正遍知說如是等出家修行義利名已，復作是念：『如我解佛所說義者，如來非說檀波羅蜜以為究竟清淨、究竟吉祥、究竟梵行、究竟窮盡、究竟最後、究竟涅槃。』",
        "translation": "After hearing the śrāvaka Tathāgata, Worthy of Offerings, and Perfectly Omniscient explain the meaning of such renunciant practitioners, that powerful king again thought, 'If I understand the Buddha's explanation of its meaning, the Tathāgata isn't teaching that the perfection of giving precepts is ultimately pure, ultimately auspicious, ultimately religious, ultimately exhaustive, ultimately final, and ultimately nirvāṇa.'",
        "source": "T15n0639_002:0554b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大力王復作是念：『非在家住能得無上、修得無上修行義利，而我今者遠離是行。",
        "translation": "Again, that mighty king thought, 'It's not while living at home that I'm able to attain the unsurpassed, unsurpassed benefit of cultivation, but I'm now far removed from such practices.",
        "source": "T15n0639_002:0554b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今要當剃除鬚髮、被服袈裟，以家非家，出家為道。』",
        "translation": "Now, I will shave off my hair, put on the reddish-brown robes, and leave home as the path because it's not home.'",
        "source": "T15n0639_002:0554b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大力王與其眷屬八萬人俱，前後圍遶往聲德佛所頂禮佛足，右遶三匝，退坐一面。",
        "translation": "The powerful king and his retinue of 80,000 people then circled the front and back of the Śākyamuni Buddha, bowed their heads at his feet, circled him three times to his right, and withdrew to sit at one side.",
        "source": "T15n0639_002:0554b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，聲德如來知大力王及其眷屬心所欲樂，即為宣說一切諸法體性平等無戲論三昧，分別顯示。",
        "translation": "Knowing the desires and aspirations of King Mighty and his retinue, the Sound Tathāgata then explained the samādhi of the equality of the essential natures of all things without conceptual elaboration and discerned its display.",
        "source": "T15n0639_002:0554b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大力王聞是三昧，歡喜踊躍，深心愛樂，即於聲德佛所棄捨王位，正信出家，剃除鬚髮，服三法衣。",
        "translation": "When King Venerable heard about this concentration, he rejoiced and roused with joy, and was so deeply delighted that he renounced the position of king in the company of the Buddha of Sound, left home in right faith, shaved off his hair, and put on the three dharma robes.",
        "source": "T15n0639_002:0554b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既出家已，於此三昧廣能聽受、讀誦、憶持、分別其義、修行相應，以此善根於二億劫不墮惡道。",
        "translation": "After leaving home, he was able to listen to, recite, memorize, discern its meaning, and practice in accord with this samādhi, and this was a good root that kept him from falling into a bad destiny for 200 million eons.",
        "source": "T15n0639_002:0554b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第復值二億諸佛，彼佛法中常得出家，一一佛所於此三昧聽受、讀誦、分別其義、修行相應，以此善根次第滿百億劫得成佛道，號曰智勇如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，利益無量無邊眾生，然後乃當入般涅槃。",
        "translation": "In turn, he'll meet 200 million buddhas who are always at home in their Dharma, and in each of those buddhas he'll listen, recite, discern its meaning, and cultivate its concomitance with this samādhi, and with these good roots he'll attain the Buddha Way in succession for 10 billion eons, being called the Tathāgata of Wisdom and Courage, the Worthy, the Perfectly Omniscient, the Perfection of Clear Conduct, the Well Gone, the Understander of the World, the Unsurpassed One, the Trainer, the Teacher of Gods and People, the Buddha, and the World Honored One, for the benefit of measureless and limitless sentient beings, and then he'll enter parinirvāṇa.",
        "source": "T15n0639_002:0554b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0554c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當觀此三昧有是神力，能令菩薩招感佛智。",
        "translation": "You should observe that this samādhi has this miraculous power that enables a bodhisattva to invoke the Buddha's wisdom.",
        "source": "T15n0639_002:0554c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大力王所將眷屬八萬人等，聞是三昧歡喜踊躍，心甚愛樂，亦皆隨王正信出家，剃除鬚髮，被服法衣。",
        "translation": "The 80,000 people who were part of King Mighty's retinue rejoiced and were delighted when they heard about this samādhi, and they all left home with the king's correct faith, shaved off their hair, and put on the Dharma robe.",
        "source": "T15n0639_002:0554c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是出家輩聞此三昧，讀誦、受持、分別解說、修行相應，以此善根於二億劫不墮惡道，一一劫中值千萬佛，於彼佛所常得出家。",
        "translation": "When these renunciant monks heard this samādhi, they recited it, memorized it, explained it discriminatingly, and cultivated its concomitance with their good roots, so they didn't fall into a bad path for 200 million eons, met 10 million buddhas in each eon, and always left home at one of those buddhas.",
        "source": "T15n0639_002:0554c07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既出家已，聞此三昧，讀誦、受持、應修、行住，以此善根於後滿百千劫各異世界得成佛道，同號堅固勇健堪能如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，利益無量諸眾生已，然後乃入無餘涅槃。",
        "translation": "Once he leaves home, he hears this samādhi, recites it, retains it, cultivates it, and abides in its practice, and because of these good roots, he'll attain the Buddha Way in a hundred thousand eons or more in different worlds, sharing the same name of Tathāgata, Arhat, Perfectly Omniscient, Perfect in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Trainer, Teacher of Gods and People, Buddha, and World Honored One, and then he'll enter nirvāṇa without remainder after benefiting measureless sentient beings.",
        "source": "T15n0639_002:0554c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0554c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三昧有大威力，能令菩薩招致阿耨多羅三藐三菩提。」",
        "translation": "Such samādhi has great power and can cause a bodhisattva to achieve supreme perfect enlightenment.\"",
        "source": "T15n0639_002:0554c15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊欲重宣此義而說偈言：「我念過去久遠世，　　不思議劫有佛出，　能為眾生作利益，　　號曰聲德大仙尊。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke in verse, \"I remember a long, inconceivable time in the past when a Buddha appeared who could work for the benefit of sentient beings and was called the Śrīgupta great sage.",
        "source": "T15n0639_002:0554c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初會眾集滿八億，　　悉是聲聞諸弟子；　第二會集七億數、　　第三六億阿羅漢，　一切漏盡無煩惱，　　諸神通力到彼岸。",
        "translation": "The first assembly gathered 800 million people, all śrāvaka disciples, and the second assembly gathered 700 million and the third 600 million arhats, whose contaminants are ended and who have no afflictions and whose supernormal powers reach the other shore.",
        "source": "T15n0639_002:0554c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其佛壽命四萬歲，　　國土世界甚嚴淨。",
        "translation": "That Buddha's life span is 40,000 years, and his land and world are extremely pure.",
        "source": "T15n0639_002:0554c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時閻浮提有二王，　　號曰大力、堅固力，　是等二王所居土，　　一一各領半閻浮。",
        "translation": "At the time, there were two kings of Jambudvīpa named Vigorous and Firm, and these two kings lived in a land where each one led half of Jambudvīpa.",
        "source": "T15n0639_002:0554c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛出大力王國中，　　諸勝人天奉供養，　其王於佛得淨信，　　恭敬供養滿千年。",
        "translation": "When the Buddha emerged from the kingdom of Vigorous Power, the victorious humans and gods paid homage to him, and the king attained pure faith in the Buddha and venerated and supported him for a thousand years.",
        "source": "T15n0639_002:0554c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　國人無量學是王，　　種種供養於如來，　但以世財非法供，　　佛及聲聞悉豐足。",
        "translation": "Countless people in his country followed this king's example, making various offerings to the Tathāgata, but offering nothing but worldly possessions and unenlightened offerings to the Buddha and the śrāvakas.",
        "source": "T15n0639_002:0554c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時世尊作是念：　　『我說是法令捨欲，　必令彼王生厭離，　　於我法中而出家。』",
        "translation": "It was then that the Bhagavān had this thought, 'I taught this teaching to abandon desire, which will surely cause that king to become disillusioned and leave home within my teaching.'",
        "source": "T15n0639_002:0555a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼時人尊說偈言：　　『棄捨惡法是佛教，　在家多過具諸苦，　　如法修行真供佛。』",
        "translation": "The Bhagavān then spoke a verse, saying, 'Renouncing bad qualities is Buddhism, and it's a lot more painful to stay home than to truly offer the Buddha by cultivating the Dharma.'",
        "source": "T15n0639_002:0555a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時王聞說如是偈，　　獨趣空閑作是念：『我今不能處家纏，　　而為最勝法供養。』",
        "translation": "When the king heard this verse, he went to his solitary place and had this thought, 'Now, I couldn't live with the fetters of home, but I would make offerings to the most excellent Dharma.'",
        "source": "T15n0639_002:0555a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即捨王位如洟唾，　　并及八萬諸眷屬，　一時俱往到佛所，　　頭面作禮住尊前。",
        "translation": "He then abandoned his position as king like saliva, and 80,000 of his retinue went to the Buddha, bowed their heads, and stood in front of the venerable.",
        "source": "T15n0639_002:0555a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛知此等之樂欲，　　為說難見寂滅定，　彼聞愛敬而悅樂，　　一切歡喜即出家。",
        "translation": "Knowing these desires, the Buddha explained that it's difficult to see the concentration of cessation, and they were delighted and pleased to hear about it, rejoicing in everything and leaving home.",
        "source": "T15n0639_002:0555a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既出家已於此定，　　讀誦、受持、廣分別，　次第二億劫數中，　　未曾墜墮三惡道。",
        "translation": "Once he leaves home, he reads, memorizes, and discerns this concentration in detail, and during the next hundred million eons, he hasn't fallen into the three bad destinies.",
        "source": "T15n0639_002:0555a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人以此諸善業，　　得見百億諸如來，　於彼佛法恒出家，　　宣說如是勝三昧。",
        "translation": "Because of this good action, that person has seen 10 billion tathāgatas, remained a renunciant of their teachings, and taught this excellent concentration.",
        "source": "T15n0639_002:0555a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是等於後得成佛，　　同號堅固大精進，　利益無量億眾生，　　後入涅槃猶火滅。",
        "translation": "They then become buddhas, share the same name of resolute and great effort, benefit measureless millions of sentient beings, and subsequently enter nirvāṇa just as fire ceases.",
        "source": "T15n0639_002:0555a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時彼往昔大力王，　　久成佛道號智勇，　利益無量百億眾，　　置菩提已入涅槃。",
        "translation": "That great king of energy from the distant past, who had long since accomplished the Buddha Way and was called Wisdom and Courage, benefited measureless tens of billions of people and entered nirvāṇa after setting out for bodhi.",
        "source": "T15n0639_002:0555a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既聞如是勝利益，　　末世持經佛所讚，　若能奉持佛法藏，　　是等速成人中上。",
        "translation": "Since he'd heard of such surpassing benefits and had maintained the sūtras praised by the Buddha in his later life, if he could consecrate the Buddha's Dharma treasury, he'd quickly become the best of men.",
        "source": "T15n0639_002:0555a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0555a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，菩薩摩訶薩愛樂是定者應當修習最初所行。",
        "translation": "Therefore, bodhisattvas who delight in this concentration should cultivate what they first do.",
        "source": "T15n0639_002:0555a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0555a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩於此三昧最初所行？",
        "translation": "\"What is the bodhisattva's initial practice in this samādhi?",
        "source": "T15n0639_002:0555a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0555a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以大悲心為首，若佛在世、若佛滅後，常勤供養——所謂花鬘、末香、塗香、寶幢、幡蓋、音聲、歌舞、作倡伎樂、衣服、飲食、病瘦醫藥——以此善根悉以迴向如是三昧，更不志求其餘諸法而供養佛，不求妙色、不求資財、不為生天、不求眷屬，唯念是法。",
        "translation": "\"Suppose a bodhisattva Mahāsattva, with great compassion at the forefront of his mind, always makes offerings to the Buddha while he's alive and after he dies-such as flower garlands, powdered incense, smeared incense, a banner, banners, music, singing and dancing, music, clothing, food and drink, and medicines for illness and lethargy-and this good root is used to dedicate all of his offerings to this kind of concentration, not seeking other things, not seeking beautiful forms, not seeking possessions, not seeking birth in heaven, and not seeking retinues, but only mindful of this teaching.",
        "source": "T15n0639_002:0555a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩尚於法中不見有佛，況復法外而見佛也？",
        "translation": "How could a bodhisattva see a Buddha outside the Dharma when he still doesn't see a Buddha in the Dharma?",
        "source": "T15n0639_002:0555a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，童子！",
        "translation": "Therefore, boy!",
        "source": "T15n0639_002:0555b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為真供養佛，而亦不見有佛可得，不取我想、不求果報。",
        "translation": "This is truly making offerings to the Buddha, not seeing any Buddha to attain, and not grasping to the idea of self or seeking rewards.",
        "source": "T15n0639_002:0555b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩三輪清淨，以花鬘、末香、塗香、寶幢、幡蓋、音聲、歌舞、作倡伎樂、飲食、衣服、病瘦醫藥供養如來，迴向阿耨多羅三藐三菩提，以此善根得不思議功德、不思議果報，得是三昧速成阿耨多羅三藐三菩提。」",
        "translation": "These bodhisattvas purify the three wheels, make offerings to the Tathāgata with flower garlands, powdered incense, smeared incense, jeweled banners, banners and shrouds, sounds, songs and dances, creative music, food and drink, clothing, and medicines for illness and decay, and dedicate themselves to unsurpassed, correct merit and unsurpassed rewards, and quickly achieve unsurpassed, correct enlightenment through this samādhi.\"",
        "source": "T15n0639_002:0555b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「若人香奉無邊智，　　能得無量香果報，　於千萬劫離惡趣，　　永無一切諸臭穢。",
        "translation": "It was then that the Bhagavān spoke this verse, \"Suppose a person consecrates incense with limitless wisdom, attains the fruit of measureless incense, leaves the bad destinies for a thousand thousand eons, and is permanently free of all defilements.",
        "source": "T15n0639_002:0555b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　千萬劫中行勝行，　　供養百萬億如來，　成佛獲得勝戒香；　　若復了知無眾生，　施香、受香二俱無，　　若能起心如是施，　則得柔軟勝順忍；　　若人增上修此忍，　為他割身猶如錢，　　於千萬億恒沙劫，　其心堅固不退轉。",
        "translation": "If he then understands that there are no sentient beings and that neither the scent of giving nor the scent of receiving exists, and if he can arouse the mind to thus give, then he'll attain the supple and resilient patience; if he cultivates this patience intensely, he'll cut his body off for others just like money and remain resolute in his mind for a thousand million eons.",
        "source": "T15n0639_002:0555b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何而得名為忍？",
        "translation": "How can this be called forbearance?",
        "source": "T15n0639_002:0555b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何復名為隨順？",
        "translation": "How is it again called following?",
        "source": "T15n0639_002:0555b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何得名不退轉？",
        "translation": "How do we get the name nonretrogression?",
        "source": "T15n0639_002:0555b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何復名為菩薩？",
        "translation": "\"How is it again called a bodhisattva?",
        "source": "T15n0639_002:0555b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　欣樂自性無我法，　以無我想無煩惱，　　能知諸法悉盡滅，　是因緣故名為忍。",
        "translation": "\"They delight in the self-nature of selfless dharmas, and because the perception of selflessness is free of affliction, they can know that all dharmas are completely extinguished; this is the reason they're called tolerant.",
        "source": "T15n0639_002:0555b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸佛所學隨順學，　智者如法常修行，　　知諸佛法無疑惑，　是故得名為隨順。",
        "translation": "Those who follow the training of the buddhas are always cultivating the wisdom according to the teaching, knowing the buddhas' teachings without doubt; therefore, they're called following them.",
        "source": "T15n0639_002:0555b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若修行時有世魔，　現作佛身說是言：　　『佛道難得作聲聞。』",
        "translation": "If a demon of the world were to appear as a buddha and say, 'It's difficult to attain the Buddha Way and become a direct disciple,' then he wouldn't accept it and be called nonretrogressing.",
        "source": "T15n0639_002:0555b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不肯信受名不退。",
        "translation": "Being unwilling to accept it is called not retrogressing.",
        "source": "T15n0639_002:0555b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　覺悟惡見諸眾生，　非此能證甘露道，　　勸捨惡道住善趣，　是故得名為菩薩。",
        "translation": "He awakens sentient beings with bad views who aren't capable of realizing the nectarine path and encourages them to abandon bad paths and abide in good destinies; therefore, he's called a bodhisattva.",
        "source": "T15n0639_002:0555b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　忍者住於隨順道，　以無我法令開悟，　　乃至夢中不起念，　存有眾生壽命想。",
        "translation": "A ninja abides on the path of conformity, enlightened by the decree of selflessness, and doesn't even give rise to thoughts in dreams that harbor the notion of the life of sentient beings.",
        "source": "T15n0639_002:0555b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若魔無量如恒沙，　化作佛身到其所，　　咸說：『身內有神我。』",
        "translation": "If Māra, whose number is as great as an infinite number of sands, were to transform into the body of a Buddha and come to him, they would all say, 'There's a soul within my body.'",
        "source": "T15n0639_002:0555b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即語：『無我，汝非佛。』",
        "translation": "They then say, 'Without a self, you're not a buddha.'",
        "source": "T15n0639_002:0555c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以智了達諸法空，　知已不與煩惱俱，　　以戲論故言說有，　見已寂滅行世間。",
        "translation": "With knowledge, they understand the emptiness of things, know that they're not with the afflictions, speak of existence because of conceptual elaborations, and then practice the world with tranquility after seeing it.",
        "source": "T15n0639_002:0555c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　譬如世人所生子，　隨即為其立名字，　　諸方推名不可得，　當知此字無所來。",
        "translation": "It's like a son born to a worldly being who's immediately given a name, and the name is inferred from various sources to be unobtainable, so you should know that this word comes from nowhere.",
        "source": "T15n0639_002:0555c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為立菩薩如是名，　菩薩諸方不可求，　　乃至實際求不得，　如是知者名菩薩。",
        "translation": "Thus is the name given to a bodhisattva, a bodhisattva who can't be found in any direction or whose actual search is unobtainable, and who thus knows it's called a bodhisattva.",
        "source": "T15n0639_002:0555c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　假使海中熾火然，　菩薩終不起身見，　　菩薩得住初發心，　悉斷惡見、煩惱盡。",
        "translation": "Suppose a blazing fire rages in the ocean, a bodhisattva never gives rise to a view of the body, and a bodhisattva attains abiding in the first arousal of mind, completely ending bad views and afflictions.",
        "source": "T15n0639_002:0555c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不見有其生滅法，　所謂眾生及壽命，　　諸法體空猶如幻，　非彼外道所能知。",
        "translation": "They don't see the arising and ceasing of things, which are called sentient beings and life spans, and the essence of those things is empty like an illusion, which can't be known by non-Buddhists.",
        "source": "T15n0639_002:0555c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若於飲食生貪著、　於衣鉢中起愛悋、　　及其掉戲輕躁者，　是則不知佛菩提；　　多憙睡眠及懈怠、　姦偽、兇暴、不攝斂、　　於諸佛所無淨信，　是則不知佛菩提；　　毀破禁戒無慚愧、　於佛法中無歸信、　　不敬同修梵行者，　是則不知佛菩提。",
        "translation": "If they become addicted to food and drink, crave food and drink from their clothing and bowls, and become dissipated and impatient, they don't know the Buddha's enlightenment; if they are prone to drowsiness and laziness, adultery, violence, and lack of restraint, and lack pure faith in the buddhas, they don't know the Buddha's enlightenment; and if they violate the precepts without conscience, lack faith in the Buddha's teaching, and don't respect and cultivate the religious practice together, they don't know the Buddha's enlightenment.",
        "source": "T15n0639_002:0555c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不毀淨戒具慚愧、　於佛法中深愛樂、　　同梵行者能恭敬，　是則能知勝菩提；　　念處以為聖境界、　喜悅而作床臥具、　　以禪為食、定為漿，　是則能知佛菩提。",
        "translation": "Not disparaging the pure precepts with a sense of conscience, deeply delighting in the Buddha's teaching, and being able to respect those who are practicing the same celibacy, this is how one can know superior enlightenment; mindful of the state of mind as a noble realm, delighting in making bedding, and using meditation as food and concentration as drink, this is how one can know buddha enlightenment.",
        "source": "T15n0639_002:0555c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無我忍為經行處，　以空林中行正念，　　七覺香花甚可樂，　嗅已得成無上道。",
        "translation": "Forbearance of selflessness is the place of practice of the scriptures, and right mindfulness is practiced in an empty forest, where the fragrant flowers of the seven senses are so pleasant that after smelling them, they achieve the unsurpassed path.",
        "source": "T15n0639_002:0555c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩薩體道所修行，　非是餘人所行地，　　所謂聲聞及緣覺，　誰有智者不貪樂？",
        "translation": "What the bodhisattva cultivates as the essential path is not a place practiced by others, so-called śrāvakas and pratyekbuddhas, but who is there who's wise and doesn't delight in it?",
        "source": "T15n0639_002:0555c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　設我壽命極長遠，　如恒河沙無量劫，　　說佛一毛德不盡，　如來智慧無邊故。",
        "translation": "\"Suppose my life span is extremely long, like the sands of the Ganges for an incalculably long time, and I were to say that a single hair of the Buddha's virtue isn't inexhaustible because the Tathāgata's wisdom is limitless.",
        "source": "T15n0639_002:0555c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若聞如是大利益，　無畏世尊之所說，　　速自教人持是定，　無上菩提得不難。",
        "translation": "If you hear such a great benefit, fearless as the Bhagavān's teaching, you'll quickly teach others to maintain this concentration, and it won't be difficult to attain unsurpassed enlightenment.",
        "source": "T15n0639_002:0555c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0556a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，菩薩摩訶薩應善巧知入三法忍——謂知彼第一忍、第二忍、第三忍——於是忍中應善巧知，復於其智亦善巧知。",
        "translation": "Therefore, the bodhisattva Mahāsattva should skillfully know that he's entering the three tolerances, which are to say that he knows the first, second, and third tolerances, and that he skillfully knows them in terms of knowledge.",
        "source": "T15n0639_002:0556a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0639_002:0556a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩於忍智中善巧知者，彼菩薩摩訶薩速得阿耨多羅三藐三菩提。",
        "translation": "\"If a bodhisattva knows well in the knowledge of forbearance, that bodhisattva quickly attains unsurpassed, correct enlightenment.",
        "source": "T15n0639_002:0556a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，童子！",
        "translation": "Therefore, boy!",
        "source": "T15n0639_002:0556a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩若欲速求阿耨多羅三藐三菩提者，於此三忍法門應當受持；持已，為他廣分別說，利益安樂無量眾生、救濟世間、利益安樂諸天及人。」",
        "translation": "If a bodhisattva wishes to quickly pursue the unsurpassed, correct, and complete enlightenment, he or she should accept this teaching of the three tolerances; after upholding it, they should explain it in detail for others, for the benefit and welfare of measureless sentient beings, for the salvation of the world, and for the benefit and welfare of gods and humans.\"",
        "source": "T15n0639_002:0556a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為彼月光童子即以偈句頌此入三忍法門：「於諸眾生無違諍，　　口不宣說非益言，　常能安住饒益法，　　是則說名為初忍；　知一切法猶如幻，　　即於此相不取著，　能於智中增無減，　　是故名為初勝忍；　諸修多羅已修學，　　智與善說恒相應，　於佛無量智不疑，　　是則名為初勝忍；　若聞一切善說法，　　猶如佛說無有疑，　能信一切諸佛法，　　是則名為初勝忍。",
        "translation": "It was then that the Bhagavān spoke for that child Moonlight in a verse praising this approach to the three tolerances, \"Accepting sentient beings without disputing them and not speaking unwholesome words, always abiding in the Dharma of benefit, this is called first attainment of forbearance; knowing that all things are just like illusions, not attaching to their characteristics, and being able to increase or decrease in knowledge, which is called first superior forbearance; having cultivated cultivation, constantly associating wisdom with good teaching, not doubting the Buddha's immeasurable knowledge, this is called first superior forbearance; hearing all good teaching as the Buddha teaches without doubt, being able to believe all the Buddha's teachings, this is called first superior forbearance.",
        "source": "T15n0639_002:0556a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於了義經常宣暢，　　如佛所說而演說，　若說我人及眾生，　　即知方便為引接。",
        "translation": "He always makes clear the full meaning, expounds it just as the Buddha has taught it, and knows the way to lead us and sentient beings to it if he explains it to them.",
        "source": "T15n0639_002:0556a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種外道諸異見，　　菩薩於彼心無擾，　轉於彼人深悲愍，　　是名第二勝忍相；　諸陀羅尼來現前，　　於總持門無疑惑，　所說語言皆真實，　　是名第二勝忍相；　假使四大相轉變，　　所謂地、水、火、風等，　於佛菩提永不退，　　是名第二勝忍相。",
        "translation": "When various non-Buddhists hold different views, the bodhisattva's mind isn't disturbed by them, and he shows deep compassion for them, which is called the second mark of superior forbearance; when dhāraṇīs come into view, they have no doubts about the Dharma-gate, and the words they speak are true, which is called the second mark of superior forbearance; even if the four elements change, which are called earth, water, fire, wind, and so forth, they never retrogress from the Buddha's enlightenment, which is called the second mark of superior forbearance.",
        "source": "T15n0639_002:0556a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間所有諸工巧，　　菩薩悉能善修學，　不見更有勝己者，　　是名第三勝忍相；　奢摩他力得調伏，　　毘婆舍那山不動，　一切眾生莫能欺，　　是名第三勝忍相；　所有言說常在定，　　行、住、坐、臥恒三昧，　三摩堅固到彼岸，　　是名第三勝忍相；　住於正定獲神通，　　於多佛剎往說法，　智者神足勢無減，　　是名第三勝忍相；　若修如是寂定時，　　諸餘一切群生類，　不能知彼心分齊，　　是名第三勝忍相；　假使世界諸眾生，　　一時作佛演說法，　是人悉能具領受，　　是名第三勝忍相；　東、西、南、北及四維、　　上、下二方亦如是，　於諸方中悉見佛，　　是名第三勝忍相；　悉能變現無量身，　　一切皆作真金色，　於無量剎往說法，　　是名第三勝忍相；　此佛世界諸閻浮，　　一切皆覩菩薩形，　諸天及人咸識知，　　是名第三勝忍相；　於諸佛法佛行處，　　導師所有諸威儀，　智者悉能善修學，　　是名第三勝忍相。",
        "translation": "　世間所有諸工巧，　　菩薩悉能善修學，　不見更有勝己者，　　是名第三勝忍相；　奢摩他力得調伏，　　毘婆舍那山不動，　一切眾生莫能欺，　　是名第三勝忍相；　所有言說常在定，　　行、住、坐、臥恒三昧，　三摩堅固到彼岸，　　是名第三勝忍相；　住於正定獲神通，　　於多佛剎往說法，　智者神足勢無減，　　是名第三勝忍相；　若修如是寂定時，　　諸餘一切群生類，　不能知彼心分齊，　　是名第三勝忍相；　假使世界諸眾生，　　一時作佛演說法，　是人悉能具領受，　　是名第三勝忍相；　東、西、南、北及四維、　　上、下二方亦如是，　於諸方中悉見佛，　　是名第三勝忍相；　悉能變現無量身，　　一切皆作真金色，　於無量剎往說法，　　是名第三勝忍相；　此佛世界諸閻浮，　　一切皆覩菩薩形，　諸天及人咸識知，　　是名第三勝忍相；　於諸佛法佛行處，　　導師所有諸威儀，　智者悉能善修學，　　是名第三勝忍相。",
        "source": "T15n0639_002:0556a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世界所有諸眾生，　　悉來讚歎是菩薩，　菩薩於彼欣悅者，　　則於佛智未修學；　世界所有諸眾生，　　罵詈、毀謗是菩薩，　於此若起瞋恨心，　　當知佛智未修學；　若得利養心不喜、　　於違失時無憂慼，　其心安住猶如山，　　是名第三勝忍相。",
        "translation": "When all the world's sentient beings praise this bodhisattva and the bodhisattva is pleased with him, then he has not cultivated Buddha-wisdom; when all the world's sentient beings ridicule and denigrate this bodhisattva, if they become angry with him, they know that Buddha-wisdom has not been cultivated; if his mind is not elated when he gains benefits, and he's not sad when he loses, his mind is as stable as a mountain, which is called the third characteristic of excellent forbearance.",
        "source": "T15n0639_002:0556b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一名、隨順音聲忍，　　二名、思惟隨順忍，　三名、修習無生忍，　　學此三忍得菩提。",
        "translation": "One is the forbearance of following sounds, two are the forbearance of contemplating following, and three are the forbearance of cultivating nonarising, and training in these three kinds of forbearance leads to enlightenment.",
        "source": "T15n0639_002:0556b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於如是三勝忍，　　菩薩其有能得者，　善逝見彼菩薩時，　　即授無上菩提記。",
        "translation": "If there's a bodhisattva who can attain these three kinds of superior forbearance, then Sugata will grant that bodhisattva the assurance of unsurpassed enlightenment when he sees him.",
        "source": "T15n0639_002:0556b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有聞此授記莂，　　不思議數億眾生，　咸發無上菩提心：　　『我要當作人中尊。』",
        "translation": "If there are hundreds of millions of inconceivable sentient beings who hear this assurance of assurance of future enlightenment, they all will give rise to the unsurpassed mind of enlightenment, 'I will be made an honorable among men.'",
        "source": "T15n0639_002:0556b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞說如是授記音，　　即時大地六種動，　光明普照十方界，　　雨無量種勝妙花。",
        "translation": "When they hear the voice of such an assurance of assurance, the six elements of the earth immediately move, their light universally shines in the worlds of the ten directions, and an infinite variety of marvelous flowers rain down.",
        "source": "T15n0639_002:0556c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於如是三勝忍，　　其有菩薩能得者，　悉不復見有生、死，　　於彼起、滅亦復然；　若於如是三種忍，　　菩薩其有能得者，　已老、今老悉不見，　　安住法中得如是。",
        "translation": "If there are bodhisattvas who can attain these three kinds of forbearance, they'll no longer see birth and death, nor will they experience their arising and ceasing; if there are bodhisattvas who can attain these three kinds of forbearance, they won't see old age or present old age, and they'll attain them while abiding in the Dharma.",
        "source": "T15n0639_002:0556c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩了知種種法，　　體性空寂猶如幻，　是空亦復非生、滅，　　以諸法體空寂故。",
        "translation": "The bodhisattva understands that the nature of various things is empty and quiescent like an illusion, and that this is emptiness and also not arising or ceasing, because the essence of all things is empty and quiescent.",
        "source": "T15n0639_002:0556c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生來恭敬、　　禮拜、尊重、興供養，　菩薩於彼無偏愛，　　深達世間體性故；　若有眾生來打罵，　　菩薩於彼無嫌慢，　轉於其人起悲心，　　為欲令其解脫故；　若加刀杖及瓦石，　　其心於彼無忿怒，　安住無我忍法中，　　菩薩不畏起瞋覆。",
        "translation": "If sentient beings come to venerate, worship, respect, and make offerings, the bodhisattva has no preference for them, because he deeply understands the nature of the world; if sentient beings come to ridicule him, the bodhisattva has no animosity toward them and turns to them with compassion in order to liberate them; if swords, staves, or tiles and stones are applied, his mind is not angry with them; abiding in the dharma of selfless tolerance, the bodhisattva isn't afraid to get angry and cover them up.",
        "source": "T15n0639_002:0556c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩了知種種法，　　體性空寂猶如幻，　若能安住是法中，　　為諸人天所供養。",
        "translation": "The bodhisattva understands a variety of things that are empty and tranquil in nature like illusions, and if he can abide in this teaching, he'll be an offering to humans and gods.",
        "source": "T15n0639_002:0556c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有人手執利剛刀，　　割截一一身支節，　心能忍受無恚恨，　　悲憐增廣初不壞。",
        "translation": "When someone grasps a sharp, rigid sword in their hand and severs a limb, their mind tolerates it without anger or hatred, and their compassion increases and expands without breaking at first.",
        "source": "T15n0639_002:0556c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以刀屠膾支節時，　　菩薩即便生是念：『汝若未得菩提處，　　願我莫證於涅槃。』",
        "translation": "When he slices off that limb with his sword, the bodhisattva even gives rise to this thought: 'Where have you not yet attained enlightenment, may I not realize nirvāṇa?'",
        "source": "T15n0639_002:0556c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是忍力最無上，　　於無我忍安住故。",
        "translation": "Thus, the power of forbearance is most unsurpassed, because it's based on the stable abiding in the forbearance of selflessness.",
        "source": "T15n0639_002:0556c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是諸菩薩大名稱，　　無量那由劫修習，　復過是數如恒沙，　　猶未能得證菩提，　於爾所時修佛行，　　況復覺智何可說？",
        "translation": "These great names of bodhisattvas have cultivated them for measureless eons and beyond like an infinite number of sands, but they still haven't attained enlightenment, and at the time they cultivated the Buddha's practice, how could enlightened wisdom be described?'",
        "source": "T15n0639_002:0556c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不可思議億劫說，　　彼諸德號無窮盡，　於無我忍善安住，　　是大名稱諸菩薩。",
        "translation": "Unfathomable for a billion eons, their virtues are called inexhaustible, and they're well-established in the tolerance of selflessness, which is known as the great bodhisattvas.",
        "source": "T15n0639_002:0556c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲能知菩提者，　　要當住於妙智聚；　若修諸佛所說忍，　　得勝菩提則不難。」",
        "translation": "Those who want to know enlightenment should abide in the cluster of marvelous cognition; if they cultivate the forbearance taught by the buddhas, it won't be difficult to attain superior enlightenment.\"",
        "source": "T15n0639_002:0556c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告月光童子言：「於過去廣大久遠無量無數不可思議過阿僧祇劫，爾時有佛名無所有起如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊出現於世。",
        "translation": "It was then that the Buddha addressed the Candraprabha boy, \"In the distant past, during a vast and long period of unfathomably long incalculable and incalculably long eons, there was a Buddha named Tathāgata Arising from Nothing, Worthy, Perfectly Omniscient, Perfectly Virtuous, Well Gone, Understander of the World, Unsurpassed Person, Tamer of Beings, Teacher of Gods and People, Buddha, and World Honored One who appeared in the world.",
        "source": "T15n0639_002:0556c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為無所有起如來、應、正遍知？",
        "translation": "What is called the Tathāgata, Arhat, and Perfectly Omniscient One who arises from nonexistence?",
        "source": "T15n0639_002:0557a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0557a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是佛生時，上昇虛空高七多羅樹，行於七步而作是言：『一切諸法悉無所有，一切諸法悉無所有。』",
        "translation": "When this Buddha was born, he rose seven stories high in the sky, took seven steps, and said, 'All dharmas are nonexistent, and all dharmas are nonexistent.'",
        "source": "T15n0639_002:0557a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其音遍滿三千大千世界。",
        "translation": "His voice filled a world of 3,000 great one-thousand worlds.",
        "source": "T15n0639_002:0557a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時地神展轉相告至于梵世，而作是言：『是世界中有佛出世，號曰無所有起如來、應、正遍知，其初生時於虛空中行於七步而作是言：「一切諸法悉無所有。」』",
        "translation": "The earth spirit then took a circuitous route to the Brahma world and said, 'In this world, there's a Buddha who arises in the world and is called the Tathāgata, the Worthy One, and the Perfectly Omniscient One who, when he first arises, takes seven steps in the sky and says, 'All dharmas are without being possessed.'",
        "source": "T15n0639_002:0557a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0557a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，其佛號曰無所有起。",
        "translation": "Because of this, his Buddha's name is 'Arising from Non-existence.'",
        "source": "T15n0639_002:0557a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼佛成正覺時，所有樹木、叢林、藥草皆出聲言：『一切諸法悉無所有。』",
        "translation": "\"When that Buddha became perfectly enlightened, all the trees, bushes, and medicinal plants produced a sound that said, 'All dharmas are without existence.'",
        "source": "T15n0639_002:0557a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0557a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼世界所出諸聲皆亦說言：『一切諸法悉無所有。』",
        "translation": "The sounds that emanate from that world also say, 'All dharmas are completely nonexistent.'",
        "source": "T15n0639_002:0557a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0557a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時無所有起如來所說法時，有一王子名思惟大悲，形貌端正，人所愛樂，心行調柔。",
        "translation": "At the time when nothing arose according to the Tathāgata's teaching, there was a prince named Bhadrapāla who contemplated great compassion, had a correct appearance that was pleasing to people, and behaved gently.",
        "source": "T15n0639_002:0557a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0557a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王子詣無所有起如來所，頂禮佛足，右遶三匝，退坐一面。",
        "translation": "At the time, the prince went to the Tathāgata Arising from Nothing, bowed his head at the Buddha's feet, circled him three times to his right, and withdrew to sit at one side.",
        "source": "T15n0639_002:0557a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，無所有起如來知彼思惟大悲王子深心所樂，即為說是一切諸法體性平等無戲論三昧。",
        "translation": "\"Knowing what deeply interested the greatly compassionate prince in contemplating that, the Tathāgata Nothing Arises knew and taught him this samādhi, which is the essential equality of all things without conceptual elaboration.",
        "source": "T15n0639_002:0557a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子聞已得淨信心，以家非家，出家為道，剃除鬚髮，被服袈裟。",
        "translation": "After hearing this, the prince attained a pure faith, renounced home as home and left home as the way, shaved off his hair, and put on the reddish-brown robes.",
        "source": "T15n0639_002:0557a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既出家已，於此三昧讀誦、受持、廣為他人分別顯示，以此善根於二十劫不墮惡道，一一劫中值二億佛。",
        "translation": "After leaving home, he recited, memorized, and widely discerned this samādhi for others, and because of this good root, he wouldn't fall into a bad path for 20 eons and would attain 200 million buddhas in each eon.",
        "source": "T15n0639_002:0557a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過二十劫已得成佛道，號曰善思義如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，出現於世。",
        "translation": "After 20 eons, he attains the Buddhahood and is called a well-considered Tathāgata, Worthy, Perfectly Omniscient, Perfectly Virtuous, Well Gone, Understander of the World, Unsurpassed Person, Tamer of Husbands, Teacher of Gods and People, Buddha, or World Honored One who appears in the world.",
        "source": "T15n0639_002:0557a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0557a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當觀此三昧有是威力，能令菩薩招致阿耨多羅三藐三菩提。",
        "translation": "You should observe that this samādhi has such power that it can cause a bodhisattva to achieve supreme perfect enlightenment.",
        "source": "T15n0639_002:0557a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0557a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩當安住深忍法中。",
        "translation": "\"The bodhisattva Mahāsattva should abide in the Dharma of profound tolerance.",
        "source": "T15n0639_002:0557a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩能安住深忍？",
        "translation": "How can a bodhisattva-mahāsattva abide in profound forbearance?",
        "source": "T15n0639_002:0557b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0557b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩應當如實觀一切法猶如幻化、如夢、如野馬、如響、如光影、如水中月、如虛空性，應如是知。",
        "translation": "Bodhisattvas, you should truly observe all things as they are illusory, as dreams, as wild horses, as sounds, as light and shadow, as the moon in water, and as the nature of space, and you should thus know them.",
        "source": "T15n0639_002:0557b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0557b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩若如實觀一切法如幻化、如夢、如野馬、如響、如光影、如水中月、如虛空性者，是名菩薩摩訶薩安住深忍。",
        "translation": "If a bodhisattva truly observes all things as illusory, as a dream, as a wild horse, as a sound, as light and shadow, as the moon in water, and as the nature of space, this is called a bodhisattva who abides in profound forbearance.",
        "source": "T15n0639_002:0557b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就深忍，菩薩於染法不染、瞋法不瞋、癡法不癡。",
        "translation": "If they achieve profound forbearance, the bodhisattva isn't defiled by defiled things, isn't angry by angry things, and isn't deluded by deluded things.",
        "source": "T15n0639_002:0557b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0639_002:0557b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩不見於法，亦無所得——不見染者、不見染事、不見染業；不見瞋者、不見瞋事、不見瞋業；不見癡者、不見癡事、不見癡業。",
        "translation": "Such a bodhisattva doesn't see things and doesn't acquire them-not seeing the defiled, not seeing the defiled things, and not seeing defiled actions; not seeing the angry, not seeing the angry things, and not seeing the angry actions; and not seeing the deluded, not seeing the deluded things, and not seeing the deluded actions.",
        "source": "T15n0639_002:0557b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩摩訶薩於如是法悉無所見，亦無所得——謂若染、若瞋、若癡，是菩薩以無所見故，即無所染、無瞋、無癡。",
        "translation": "\"The bodhisattva Mahāsattva sees nothing and gets nothing from such things - whether they're defiled, angry, or deluded - and it's because the bodhisattva sees nothing that he has nothing defiled, nothing angry, and nothing deluded.",
        "source": "T15n0639_002:0557b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩如實無染、無瞋、無癡、無顛倒心故，得名為定、名無戲論、名到彼岸、名為陸地、名到安隱、名到無畏、名為清涼、名為持戒、名為智者、名為慧者、名為福德、名為神足、名為憶念、名為持者、名黠慧者、名為去者、名慚愧者、名信義者、名頭陀功德者、名不著女色者、名無染著者、名應供者、名漏盡者、名無煩惱自在者、名心解脫者、名慧解脫者、名調伏者、名曰大龍、名所作已辦、名更無所作、名捨重擔、名逮得己利、名盡諸有結、名依正教心善解脫、名到一切心自在岸、名為沙門、名婆羅門、名沐浴者、名已渡者、名明了者、名為聞者、名為佛子、名為釋子、名除棘刺者、名度坑塹者、名拔毒箭者、名無熱者、名無塵埃者、名為比丘無覆纏者、名為丈夫、名善丈夫、名勝丈夫、名大丈夫、名師子丈夫、名大龍丈夫、名牛王丈夫、名善調丈夫、名勇健丈夫、名荷負丈夫、名精進丈夫、名兇丈夫、名如花丈夫、名蓮花丈夫、名分陀利丈夫、名調御丈夫、名月丈夫、名日丈夫、名作業丈夫、名兩足中上、名盡智邊、名多聞中勝、名已修梵行、名所作究竟、名一切惡不染。」",
        "translation": "「是菩薩如實無染、無瞋、無癡、無顛倒心故，得名為定、名無戲論、名到彼岸、名為陸地、名到安隱、名到無畏、名為清涼、名為持戒、名為智者、名為慧者、名為福德、名為神足、名為憶念、名為持者、名黠慧者、名為去者、名慚愧者、名信義者、名頭陀功德者、名不著女色者、名無染著者、名應供者、名漏盡者、名無煩惱自在者、名心解脫者、名慧解脫者、名調伏者、名曰大龍、名所作已辦、名更無所作、名捨重擔、名逮得己利、名盡諸有結、名依正教心善解脫、名到一切心自在岸、名為沙門、名婆羅門、名沐浴者、名已渡者、名明了者、名為聞者、名為佛子、名為釋子、名除棘刺者、名度坑塹者、名拔毒箭者、名無熱者、名無塵埃者、名為比丘無覆纏者、名為丈夫、名善丈夫、名勝丈夫、名大丈夫、名師子丈夫、名大龍丈夫、名牛王丈夫、名善調丈夫、名勇健丈夫、名荷負丈夫、名精進丈夫、名兇丈夫、名如花丈夫、名蓮花丈夫、名分陀利丈夫、名調御丈夫、名月丈夫、名日丈夫、名作業丈夫、名兩足中上、名盡智邊、名多聞中勝、名已修梵行、名所作究竟、名一切惡不染。」",
        "source": "T15n0639_002:0557b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說偈頌曰：「劫盡災壞時，　　世界蘯然空，　如前、後亦爾，　　喻諸法亦然；　觀世間起作，　　悉住於水上，　如下、上亦爾，　　諸法亦復然；　如虛空無雲，　　忽然起陰曀，　知從何所出，　　諸法亦復然；　如來涅槃後，　　思想覩佛形，　如初、後亦爾，　　諸法亦復然；　猶如水聚沫，　　暴流之所漂，　觀之無堅實，　　諸法亦復然；　如天雨水上，　　各各有泡起，　隨生尋散滅，　　諸法亦復然；　譬如春日中，　　暉光所焚炙，　陽焰狀如水，　　諸法亦復然；　如濕芭蕉樹，　　人折求其堅，　內、外不得實，　　諸法亦復然；　如幻作多身，　　謂男、女、象、馬，　是相非真實，　　諸法亦復然；　譬如有童女，　　夜臥夢產子，　生欣、死憂慼，　　諸法亦復然；　如人夢行婬，　　寤已無所見，　愚愛終無得，　　諸法亦復然；　如淨虛空月，　　影現於清池，　非月形入水，　　諸法亦復然；　如人自好憙，　　執鏡照其面，　鏡像不可得，　　諸法亦復然；　見野馬如水，　　愚者欲趣飲，　無實可救渴，　　諸法亦復然；　如人在山谷，　　歌哭言笑響，　聞聲不可得，　　諸法亦復然；　如牓教諸國，　　善、惡由之行，　非言教至彼，　　諸法亦復然；　如人飲酒醉，　　見地悉迴轉，　其實未曾動，　　諸法亦復然。",
        "translation": "爾時，世尊說偈頌曰：「劫盡災壞時，　　世界蘯然空，　如前、後亦爾，　　喻諸法亦然；　觀世間起作，　　悉住於水上，　如下、上亦爾，　　諸法亦復然；　如虛空無雲，　　忽然起陰曀，　知從何所出，　　諸法亦復然；　如來涅槃後，　　思想覩佛形，　如初、後亦爾，　　諸法亦復然；　猶如水聚沫，　　暴流之所漂，　觀之無堅實，　　諸法亦復然；　如天雨水上，　　各各有泡起，　隨生尋散滅，　　諸法亦復然；　譬如春日中，　　暉光所焚炙，　陽焰狀如水，　　諸法亦復然；　如濕芭蕉樹，　　人折求其堅，　內、外不得實，　　諸法亦復然；　如幻作多身，　　謂男、女、象、馬，　是相非真實，　　諸法亦復然；　譬如有童女，　　夜臥夢產子，　生欣、死憂慼，　　諸法亦復然；　如人夢行婬，　　寤已無所見，　愚愛終無得，　　諸法亦復然；　如淨虛空月，　　影現於清池，　非月形入水，　　諸法亦復然；　如人自好憙，　　執鏡照其面，　鏡像不可得，　　諸法亦復然；　見野馬如水，　　愚者欲趣飲，　無實可救渴，　　諸法亦復然；　如人在山谷，　　歌哭言笑響，　聞聲不可得，　　諸法亦復然；　如牓教諸國，　　善、惡由之行，　非言教至彼，　　諸法亦復然；　如人飲酒醉，　　見地悉迴轉，　其實未曾動，　　諸法亦復然。",
        "source": "T15n0639_002:0557c06_14",
        "is_bad_quality": true
    },
    {
        "source_sentence": "　緣起法無有，　　無有更不有，　分別有、無者，　　是則苦不滅。",
        "translation": "Conditioned by the fact that arises, there's nothing, and nothing furthermore, discriminating between existence and nonexistence, it's the case that suffering doesn't cease.",
        "source": "T15n0639_002:0558a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於有、無分別，　　淨、不淨諍論，　遠離是二邊，　　智者住中道。",
        "translation": "In the debate over existence and non-discrimination, purity and impurity, he's free of these two extremes, and he abides in the middle way with wisdom.",
        "source": "T15n0639_002:0558a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀彼先際身，　　於身無身想，　若能如是知，　　即是無為性。",
        "translation": "He observes the prior body, imagining that there's no body in the body, and if he can thus know it, it's the nature of noncontrivance.",
        "source": "T15n0639_002:0558a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眼、耳、鼻無限，　　舌、身、意亦然，　於根分別者，　　聖道則無用。",
        "translation": "The eye, ear, and nose are limitless, and so is the tongue, body, and mind.",
        "source": "T15n0639_002:0558a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於諸根無限，　　體頑空無記，　欲希涅槃樂，　　應修聖道業。",
        "translation": "While the faculties are infinite, their essence is stubbornly empty and indeterminate, and if you want to hope for the happiness of nirvāṇa, you should cultivate the activity of the noble path.",
        "source": "T15n0639_002:0558a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　演說四念處，　　愚者身證慢，　身證則無慢，　　能離諸慢故；　演說於四禪，　　愚謂得禪行，　滅惑人無慢，　　慧觀斷慢故；　演說四真諦，　　愚者謂見諦，　見實則無慢，　　世尊如是說。",
        "translation": "He teaches the four abodes of mindfulness, which foolish people call the pride of personally realizing, but when they personally realize it, there's no pride, and it's because they're free of pride; he teaches the four meditation practices, which foolish people call the attainment of meditation; he has no pride when he ceases mental disturbances, and he stops pride when he observes wisdom; he teaches the four true truths, which foolish people call the truth of seeing, and he has no pride when he sees the truth, as the Bhagavān thus explains.",
        "source": "T15n0639_002:0558a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖廣讀眾經，　　恃多聞毀禁，　多聞非能救，　　破戒地獄苦；　自恃持戒慢，　　而不學多聞，　持戒報盡已，　　還復受諸苦；　多聞與持戒，　　二俱不自恃，　恃慢薄福人，　　由是起眾苦。",
        "translation": "Although he widely reads the scriptures, he relies on being well-versed to violate the prohibitions; being well-versed doesn't save him; he breaks the precepts and suffers in hell; he relies on himself to uphold the precepts and is arrogant, but doesn't train in well-versedness; after the rewards of upholding the precepts have ended, he'll suffer again; being well-versed and upholding the precepts are not both self-assured; relying on pride and low merit causes the many sufferings that result.",
        "source": "T15n0639_002:0558a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慢為眾苦本，　　諸導師所說，　有慢苦增長，　　離之則苦滅。",
        "translation": "Pride is the root of all suffering, and instructors teach that suffering increases with pride, but suffering ceases when it's abandoned.",
        "source": "T15n0639_002:0558b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖修世三昧，　　而不離我想，　其過還復起，　　猶如優垤迦。",
        "translation": "Even though he cultivates the samādhi of the world, he doesn't part with the idea of self, and his faults reappear, just like those of Ucchuṣka.",
        "source": "T15n0639_002:0558b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若修彼無我，　　於中生欣樂，　是涅槃樂因，　　非感世間法。",
        "translation": "If someone cultivates this selflessness and becomes happy in it, it's a cause of happiness in nirvāṇa, not a sense of worldly phenomena.",
        "source": "T15n0639_002:0558b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如被眾賊圍，　　為命欲逃避，　無足不能走，　　便為賊所殺；　如是癡毀禁，　　欲出離世間，　無戒不堪去，　　為老、病、死殺。",
        "translation": "Like someone surrounded by thieves who wants to escape for their life but doesn't have the legs to walk, they're killed by thieves; like someone who's deluded and disruptive and wants to leave the world, they can't go without precepts and are killed by old age, illness, and death.",
        "source": "T15n0639_002:0558b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如壯執刃賊，　　劫掠害諸方；　煩惱亦如是，　　害眾生善根。",
        "translation": "Like a strong bandit with a sword, he plunders and harms people in different directions; so do the afflictions that harm the good roots of sentient beings.",
        "source": "T15n0639_002:0558b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多人說陰空，　　不知陰無我，　若問陰有無，　　顰蹙瞋言對。",
        "translation": "Many people say the aggregates are empty, but they don't know that the aggregates are without self. If they ask whether the aggregates exist, they knit their brows and speak angrily in response.",
        "source": "T15n0639_002:0558b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若知陰無我，　　聞罵心不瞋，　有或繫屬魔，　　悟空無忿怒。",
        "translation": "If they know that the aggregates are without a self, they hear criticism and don't become angry; some might be tied to Māra, but they realize emptiness and lack anger.",
        "source": "T15n0639_002:0558b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人患身痛，　　多年苦逼惱，　是病經時久，　　求醫欲治療。",
        "translation": "Like a person suffering from physical pain that's been painful and debilitating for years, this illness has lasted a long time, and they seek medical treatment.",
        "source": "T15n0639_002:0558b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人數推訪，　　便遇得良師，　醫愍授好藥，　　汝服則令差。",
        "translation": "That person then investigates and meets a good teacher who gives them good medicine, which they take and are made to feel better.",
        "source": "T15n0639_002:0558b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人得妙藥，　　不服病不愈，　非是醫藥咎，　　當知病者過。",
        "translation": "This person obtains wonderful medicine, but if they don't take it, their illness won't heal. It's not the fault of the medicine; they should know the fault of the sick person.",
        "source": "T15n0639_002:0558b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於此法出家，　　讀誦道品教，　行修不相應，　　何能得解脫？",
        "translation": "If you leave home and read the instructions of the Way, how can you attain liberation if your practice and cultivation aren't aligned?",
        "source": "T15n0639_002:0558b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法體性空，　　佛子觀是事，　一切有悉空，　　外道空少分。",
        "translation": "\"The essence of all things is empty, and the Buddha's son observes this thing; all existence is empty, and non-Buddhists are empty of a small part.",
        "source": "T15n0639_002:0558b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智不與愚競，　　勇猛應捨離，　若罵不念報，　　愚法汝勿嫌；　智不愚往返，　　善知其性習，　雖復共相親，　　後必成怨嫉；　智不與愚密，　　知其志不堅，　體性自破壞，　　凡愚則無友。",
        "translation": "Wisdom doesn't compete with foolishness; courage should be abandoned; if you scold without minding the consequences, don't dislike foolish things; wisdom doesn't foolishly go back and forth; you well know their nature and habits; even though they may be close together, they'll become enemies later; wisdom doesn't closely associate with foolishness; they know their intentions aren't strong; their nature is self-destructive; ordinary foolish people have no friends.",
        "source": "T15n0639_002:0558c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若問如法語，　　毀戒者不欣，　無因起瞋覆，　　當知是愚人。",
        "translation": "If someone asks these questions, they won't rejoice when they violate the precepts, and they're covered by anger without a cause, so they should know they're a fool.",
        "source": "T15n0639_002:0558c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚者與愚合，　　如糞與糞和；　智智同一處，　　猶二醍醐合。",
        "translation": "A fool and a fool are united like dung and dung blending, while wisdom and knowledge are in the same place, like two ghee's merging.",
        "source": "T15n0639_002:0558c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不觀世間過、　　因果不信入、　於佛語無信，　　在世被離壞。",
        "translation": "Not observing worldly faults, not believing in the entry of cause and effect, and lacking faith in the Buddha's words, they're destroyed in the world.",
        "source": "T15n0639_002:0558c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貧窮無財物，　　不活求出家；　我法出家已，　　衣鉢極慳著。",
        "translation": "Being poor and lacking possessions, they don't live and seek to leave home; after leaving home with my teaching, they become extremely stingy with their clothing and bowls.",
        "source": "T15n0639_002:0558c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼近惡知識，　　毀破我禁戒，　不自觀己行，　　其心無安住。",
        "translation": "He approaches a bad friend who violates my precepts, doesn't examine his own conduct, and has no stable abode in his mind.",
        "source": "T15n0639_002:0558c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　晝夜住非宜，　　作惡無有厭，　身心恒放逸，　　口常說麁鄙，　恒伺他愆過，　　覓便向人說，　自覆己瑕玼，　　深是愚癡相。",
        "translation": "They abide day and night improperly, do evil without tire, are constantly careless in body and mind, speak harshly with their mouths, constantly look for faults in others, and then tell others about them, covering their own faults, which is profoundly foolish.",
        "source": "T15n0639_002:0558c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚者貪嗜食，　　不能知節量，　因佛得飲食，　　都無反報心。",
        "translation": "A foolish man who craves food and doesn't know moderation has no desire to retaliate for the food and drink he obtains from the Buddha.",
        "source": "T15n0639_002:0558c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得上妙甘饍，　　不應於其法，　反為食所害，　　如象食泥藕。",
        "translation": "They obtain a delicious meal that's superior, but they shouldn't follow that path; instead, they're harmed by the food, like an elephant eating mud and roots.",
        "source": "T15n0639_002:0558c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種上味饌，　　智者雖食之，　根寂靜無貪，　　如法簡擇飡。",
        "translation": "Even though a wise person eats a variety of delicacies with superior taste, their faculties are quiescent and lack craving, and they simply choose and eat according to the teaching.",
        "source": "T15n0639_002:0558c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖有聰智人，　　慰愚問從來，　於彼無親戀，　　但起悲愍心。",
        "translation": "Even though there are wise people who console the foolish and ask about their past, they have no affection for them but instead have compassionate feelings.",
        "source": "T15n0639_002:0558c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者恒利愚，　　愚反為衰損，　我見是過已，　　獨處空如鹿。",
        "translation": "\"Even though the wise always benefit the foolish, the foolish are weakened, and after I see this fault, I'm left alone in an empty house like a deer.",
        "source": "T15n0639_002:0559a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者見是過，　　不與愚共俱，　若與往來者，　　失天況菩提？",
        "translation": "Seeing this as a fault, the wise man doesn't share it with the foolish; if he did, how would he lose heaven, much less enlightenment?",
        "source": "T15n0639_002:0559a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者恒住悲、　　住慈與喜合，　常捨一切有，　　修定證菩提。",
        "translation": "\"The wise man always abides in compassion, abiding in the union of kindness and joy, always abandoning all existence, cultivates concentration, and realizes enlightenment.",
        "source": "T15n0639_002:0559a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悟道除憂怖，　　見人老、死逼，　於彼起悲愍，　　發言合真義。",
        "translation": "He rids himself of sorrow and fear when he awakens to the path, sees the oppression of old age and death, arouses compassion for them, and speaks the true meaning.",
        "source": "T15n0639_002:0559a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人知佛法，　　離言說聖諦，　若聞是法者，　　得離食聖愛。",
        "translation": "If someone knows the Buddha's teaching and speaks the noble truth apart from language, then they'll be able to part with the noble craving for food if they hear this teaching.",
        "source": "T15n0639_002:0559a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「童子！",
        "translation": "\"Boy!",
        "source": "T15n0639_002:0559a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，欲得成就堅固行菩薩應如是學。",
        "translation": "Because of this, bodhisattvas who want to achieve resolute practice should train in this way.",
        "source": "T15n0639_002:0559a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0639_002:0559a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0639_002:0559a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堅固行菩薩得阿耨多羅三藐三菩提則為不難，何況此三昧也？」",
        "translation": "It wouldn't be difficult for a resolutely practicing bodhisattva to attain supreme perfect enlightenment, so why wouldn't it be difficult for him to attain this concentration?\"",
        "source": "T15n0639_002:0559a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，月光童子白佛言：「希有，世尊！",
        "translation": "It was then that the Candraprabha boy said to the Buddha, \"Rarely, Bhagavān!",
        "source": "T15n0639_002:0559a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正遍知善能說此堅固之行，為入此三昧法善說、善建立一切菩薩所學，乃是一切如來行處，尚非聲聞、辟支佛地，何況外道？",
        "translation": "The Tathāgata, Worthy of Offerings, and Perfectly Omniscient One is well able to explain this resolute practice, and he well explains and establishes for the purpose of entering this samādhi what all bodhisattvas learn, which is the locus of all the Tathāgata's practices and is not yet the stage of the śrāvakas and pratyekabuddhas, so why wouldn't it be the case for non-Buddhists?",
        "source": "T15n0639_002:0559a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T15n0639_002:0559a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當住是堅固行。",
        "translation": "I will now abide in this resolute practice.",
        "source": "T15n0639_002:0559a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0639_002:0559a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲如佛所學我今欲學、我欲知彼阿耨多羅三藐三菩提故、我欲破壞於魔波旬及其眷屬、我欲脫一切眾生苦。",
        "translation": "I want to learn as the Buddha has taught me, and I want to learn now; I want to know the unsurpassed, correct, and complete enlightenment; I want to destroy Māra Pāpīyān and his retinue; and I want to escape the suffering of all sentient beings.",
        "source": "T15n0639_002:0559a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來及比丘僧并諸眷屬明受我請，為悲愍我故。」",
        "translation": "Please let the Tathāgata, the monks, and their retinues clearly accept my invitation, for the sake of pity for me.\"",
        "source": "T15n0639_002:0559a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來爾時及比丘僧默然許受月光童子明日請食，為護彼故。",
        "translation": "The Tathāgata and the monks and nuns then quietly accepted the Moonlight Boy's invitation for food for tomorrow, in order to protect him.",
        "source": "T15n0639_002:0559a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時月光童子既蒙如來許受供已，歡喜踊躍，深自慶幸，即從坐起，偏袒右臂，頂禮佛足，右遶三匝辭退而去。",
        "translation": "After the Tathāgata had accepted the offering, the Candraprabha rejoiced and was deeply blessed. He rose from his seat, bared his right arm, bowed his head at the Buddha's feet, circled him three times to his right, withdrew, and left.",
        "source": "T15n0639_002:0559a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，月光童子向王舍城還至家中，到已即於其夜嚴辦種種無量無數勝味飲食。",
        "translation": "At the time, the Candraprabha returned home to Rājagṛha, and when he arrived, he prepared a delicious meal of measureless and incalculable flavors during the night.",
        "source": "T15n0639_002:0559a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於王舍大城一切諸處悉懸繒綵、散種種花、竪幢幡蓋、燒眾名香、施諸帳幕，掃治街巷除却瓦礫，於四衢道灑令清淨，散栴檀末、雜寶遍布，復散種種花、種種寶花，間錯其地猶如彩畫。",
        "translation": "He hung silken ribbons over all the places in the great city of Rājagṛha, scattered various flowers, erected banners and flags, burned many famous incense sticks, and made curtains, swept the streets and alleys to remove debris, sprinkled the four thoroughfares to make them clean, scattered sandalwood dust and various treasures throughout, and scattered various flowers and precious flowers, interspersing them like colorful paintings on the ground.",
        "source": "T15n0639_002:0559a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以無量種種莊嚴彫飾城巷，其城一切周遍已——有優鉢羅花、拘物陀花、鉢頭摩花、分陀利花——於其家內純以牛頭栴檀用塗其宅，以種種莊嚴張諸寶帳，為佛、世尊設上味食。",
        "translation": "After decorating the city's streets with measureless ornaments and completely surrounding it with everything - the blue lotus flower, the kuśita flower, the padma flower, and the puṇḍarī flower - he painted his house with oxhead sandalwood and spread out its jeweled canopies with various ornaments to prepare a meal of excellent taste for the Buddha and the Bhagavān.",
        "source": "T15n0639_002:0559b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，童子作如是等莊嚴城郭、街巷、舍宅，辦諸供具，一夜之中悉備足已。",
        "translation": "The boy then decorated the city, its streets, and its mansions like this, making all the offerings in one night.",
        "source": "T15n0639_002:0559b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至明清旦，與八十那由他菩薩，阿逸多菩薩以為上首，其名曰：觀世音菩薩、大勢至菩薩、香象菩薩、寶幢菩薩、難勝菩薩、文殊師利童子菩薩、勇健軍菩薩、妙臂菩薩、寶花菩薩、不虛現菩薩，如是等菩薩摩訶薩於餘菩薩而為上首。",
        "translation": "On the bright sunrise, he gave 80 bodhisattvas named Avalokitêśvara Bodhisattva, Mahāsthāmaprāpta Bodhisattva, Xiangxiang Bodhisattva, Baoban Bodhisattva, Nansheng Bodhisattva, Mañjuśrī Boy Bodhisattva, Brave and Sturdy Army Bodhisattva, Wonderful Arm Bodhisattva, Jewel Flower Bodhisattva, and Unfalsely Appearing Bodhisattva the heads of such bodhisattvas and mahāsattvas over the others.",
        "source": "T15n0639_002:0559b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與如是等大菩薩眾前後圍遶，出王舍大城往如來所，更整衣服，頭面作禮，右遶三匝白佛言：「世尊！",
        "translation": "He and this great assembly of bodhisattvas surrounded themselves from front to back, left the great city of Rājagṛha, went to the Tathāgata, adjusted their robes, paid homage with their heads, circled to their right three times, and said to the Buddha, \"Bhagavān!",
        "source": "T15n0639_002:0559b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食時既至，所設已辦，願垂臨顧入王舍城，至我室內哀受我供。」",
        "translation": "Now that the time for eating has arrived and the preparations have been made, may I ask you to kindly enter Rājagṛha and come into my abode to accept my offerings with pity.\"",
        "source": "T15n0639_002:0559b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊於中前時著衣持鉢，與大比丘滿百千人，菩薩摩訶薩無量百千億那由他——天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽等無量百千而設供養，恭敬讚歎佛大威力、佛大神足、佛大變現、佛大威儀，放百千萬億那由他光、作百千種伎樂、雨種種天花——為受月光童子供故入王舍城。",
        "translation": "At the time, the Bhagavān, while wearing his robe and carrying his bowl in the foreground, was accompanied by a hundred thousand great monks, a hundred thousand million nayutas of bodhisattvas, mahāsattvas, gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, mahoragas, and others who made countless hundreds of thousands of offerings, venerated and praised the Buddha's great authority, his great spiritual powers, his great manifestation, and his great bearing, radiated a hundred thousand million nayutas of light, performed a hundred thousand kinds of music, and rained down various kinds of flowers - and entered Rājagṛha because he wanted to accept the offerings of the moon-lit children.",
        "source": "T15n0639_002:0559b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以久集無量善根，以右千輻輪足躡城門閫，時現種種神變未曾有事：「諸佛、如來若入城時，法皆如是現其神變。",
        "translation": "Because of the immeasurable good roots he had gathered over time, the Buddha stepped through the city gates with his right thousand-spoked wheel and showed various miraculous powers that had never occurred before, \"When the buddhas and tathāgatas enter the city, they all thus show their miraculous powers.",
        "source": "T15n0639_002:0559b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今善聽，當為汝說佛入城時所有神德。」",
        "translation": "Now, listen well, and I will explain for you the miraculous powers of the buddhas as they enter the city.\"",
        "source": "T15n0639_002:0559b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說偈頌曰：「大仙入王城，　　輪足躡門閫，　威力動大地，　　眾生咸歡喜。",
        "translation": "He spoke a verse, \"When the great sage enters the king's city, his wheeled feet step through the gates and approach, and his might moves the earth, sentient beings rejoice.",
        "source": "T15n0639_002:0559b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸乏飲食者，　　遠離飢渴患，　其身皆飽滿，　　由佛履閫故；　聾、盲、瘖瘂輩、　　貧窮、薄福等，　諸根悉全具，　　由佛履閫故；　閻羅界餓鬼，　　食膿、唾、屎、尿，　悉得天味食，　　由佛履閫故；　諸山及寶山，　　種種林、花、果，　曲躬悉迴向，　　由佛履閫故；　大海城邑聚，　　地皆六種動，　不逼惱眾生，　　由佛履閫故。",
        "translation": "Those who lack food are free from hunger and thirst, and their bodies are filled because the Buddha insights; the deaf, blind, and ugly, poor, and less fortunate are all fully endowed with their faculties because the Buddha insights; the hungry ghosts of the Yama realm who eat pus, saliva, dung, and urine are fed with the taste of heaven because the Buddha insights; the mountains and jeweled hills with their various groves, flowers, and fruits bend their heads to the direction of the Buddha because the Buddha insights; and the cities and towns of the ocean have six kinds of earthly movement that don't disturb sentient beings because the Buddha insights.",
        "source": "T15n0639_002:0559c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人、天、鳩槃等，　　歡喜住空中，　為佛持寶蓋，　　發大菩提心；　諸音樂不擊，　　自然出妙聲，　眾人皆歡喜，　　由佛履閫故。",
        "translation": "People, gods, and kumbhas rejoice as they stand in the air, carry the Buddha's jeweled canopy, and give rise to the great mind of enlightenment; music doesn't strike, but naturally produces a marvelous sound, and people rejoice because the Buddha guides his path.",
        "source": "T15n0639_002:0559c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　百千萬億樹，　　向佛具花果，　無量天住空，　　所設非人供；　百千諸牛王、　　獸王師子吼，　象、馬悉歸禮，　　由佛履閫故。",
        "translation": "A hundred thousand trillion trees bear flowers and fruit for the Buddha, measureless gods stand in the sky, and offerings are made to non-humans. A hundred thousand cattle kings, animal kings, lion kings, elephants, and horses all bow down to the Buddha because he wears his robes.",
        "source": "T15n0639_002:0559c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　國中諸大王，　　見十力世尊，　導師勝妙色，　　歡喜而頂禮。",
        "translation": "The great kings of the land see the Bhagavān of the Ten Powers, a guide of marvelous appearance who rejoices and venerates them.",
        "source": "T15n0639_002:0559c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　餘人心喜讚，　　或散諸妙花，　合十指爪掌，　　稱佛為大悲。",
        "translation": "The others rejoiced and praised, sometimes scattering marvelous flowers, joining their palms with their ten fingers and fingertips, and calling the Buddha greatly compassionate.",
        "source": "T15n0639_002:0559c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或散諸瓔珞、　　金鎖、璩臂印、　或散師子條，　　發大菩提心。",
        "translation": "Some scatter diadems, gold chains, armlets, and lion's strips, arousing the great mind of enlightenment.",
        "source": "T15n0639_002:0559c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　女人奉金鬘、　　又女散面花、　或解金瓔珞、　　乳面手嚴具、　或有散金花、　　及諸嚴身具，　雖捨無一心，　　悕求諸佛道。",
        "translation": "A woman serves a gold garland, another woman scatters flowers on her face, she unpacks gold jewelry, she scatters ornaments on her breast and face, she scatters gold flowers, and she scatters ornaments on her body, hoping for the path of the buddhas even though she's abandoned without a single thought.",
        "source": "T15n0639_002:0559c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　城人布妙衣、　　或復散頂珠、　及散眾寶網，　　佛至城門故。",
        "translation": "A citizen of the city spreads fine clothing, scatters pearls on his head, and spreads nets of treasures as the Buddha arrives at the city gates.",
        "source": "T15n0639_002:0560a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人病苦逼，　　種種憂箭射，　一切咸具樂，　　導師威德故。",
        "translation": "If someone's illness or pain is severe and they're shot by various sad arrows, they're all happy because of the guide's authority.",
        "source": "T15n0639_002:0560a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　拘翅羅、鸚鵡、　　孔雀、頻伽等，　諸鳥住空中，　　出和雅妙音。",
        "translation": "The kokila, parrot, peacock, and vibhāga birds that live in the sky emit a harmonious, beautiful sound.",
        "source": "T15n0639_002:0560a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾鳥心歡喜，　　出是妙音時，　能滅修行者，　　貪、瞋、癡煩惱。",
        "translation": "When these birds rejoice in their hearts and produce this wonderful sound, it can quell the cultivator's afflictions of greed, anger, and delusion.",
        "source": "T15n0639_002:0560a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量億眾生，　　聞聲得順忍，　為聖授彼記，　　未來咸作佛。",
        "translation": "Measureless millions of sentient beings hear the sound and attain compliant tolerance, and the sages grant them the prediction that they'll all become buddhas in the future.",
        "source": "T15n0639_002:0560a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見佛十力身，　　眾生樂佛智：『我云何得此，　　佛知欲授記？』",
        "translation": "Seeing the Buddha's ten powers in action, sentient beings delight in the Buddha's wisdom, 'How did I attain this, knowing that the Buddha wants to give me assurance of Buddhahood?'",
        "source": "T15n0639_002:0560a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛一一毛孔，　　放百千種光，　遍照諸佛剎，　　普眼入城故。",
        "translation": "From one pore of the Buddha's body, he radiates a hundred thousand kinds of light that completely illuminate the buddha bases, so that the universal eye enters the city.",
        "source": "T15n0639_002:0560a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　障蔽於日明、　　摩尼寶天火，　餘光悉不現，　　佛入城門故。",
        "translation": "Obscured by the sun's brightness and the fires of the maṇi-jeweled gods, the other lights don't appear, so the Buddha enters the city gates.",
        "source": "T15n0639_002:0560a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　百千蓮花敷，　　出地千葉淨，　十力尊蹈上，　　與眾遊城巷。",
        "translation": "A hundred thousand lotus flowers spread out, a thousand leaves purify the ground, and the honored possessor of ten powers rides up and walks with the crowd through the city streets.",
        "source": "T15n0639_002:0560a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　道路無穢污，　　純以香泥塗；　遍城燒妙香，　　馨流甚可樂；　巷陌甚嚴麗，　　除去諸瓦礫，　十力功德故，　　具種種花香。",
        "translation": "The roads are undefiled, coated only with scented clay, and the city is scented with a wonderful fragrance that flows deliciously, the streets are beautiful, the debris is removed, and the fragrance of various flowers is present because of the ten powers and merits.",
        "source": "T15n0639_002:0560a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　百千惡夜叉，　　見佛金色身，　起大悲愍意，　　淨心歸牟尼。",
        "translation": "A hundred thousand evil yakṣas see the golden body of the Buddha, arouse a feeling of great compassion, and return with a pure heart to Muni.",
        "source": "T15n0639_002:0560a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天宮悉空，　　皆共來觀佛，　在空雨眾花，　　佛入勝城時。",
        "translation": "The palaces of the gods are all empty, and they all come together to see the Buddha, raining flowers in the sky as he enters the Jeta City.",
        "source": "T15n0639_002:0560a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人以散花，　　於人天師所，　佛上成花蓋，　　莊嚴身端好。",
        "translation": "If someone were to scatter flowers and place them at a teacher among humans and gods, the Buddha would form a flower canopy over them, adorning his body with dignity.",
        "source": "T15n0639_002:0560a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人、天、修羅等，　　覩佛十力尊，　心歡喜踊躍，　　未曾有厭足。",
        "translation": "Seeing the Buddha honored with ten powers, humans, gods, and sūtras rejoice and jump for joy, never losing their legs.",
        "source": "T15n0639_002:0560b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　右有百千梵、　　左帝釋亦然，　無數天在空，　　恭敬三界尊。",
        "translation": "There are a hundred thousand Brahmās on the right, the same goes for Indra on the left, and countless gods in the sky, all paying homage to the honored one of the three realms.",
        "source": "T15n0639_002:0560b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時佛現變已，　　開示勝妙法，　百千眾聞者，　　發大菩提心。",
        "translation": "After his transformation, the Buddha revealed the most sublime Dharma, and the hundreds of thousands of people who heard it aroused a great desire for enlightenment.",
        "source": "T15n0639_002:0560b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　相好花為身，　　猶滿虛空星，　佛處王御路，　　如淨空圓月。",
        "translation": "The Buddha's body is made of flowers with beautiful features, just like the stars filling the sky, and he's positioned on the king's royal road like the full moon in pure space.",
        "source": "T15n0639_002:0560b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如淨摩尼寶，　　離垢無瑕穢，　十方放光明；　　佛照剎亦然。",
        "translation": "Like a pure maṇi jewel that's spotless and spotless, it radiates light in ten directions; so does the buddha illuminating the blaze.",
        "source": "T15n0639_002:0560b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天眾圍遶，　　人尊入王城，　足履地如畫，　　來入月光宅。",
        "translation": "Surrounded by gods, the human honored one enters the king's city, treads the ground like a picture, and comes to enter the moon-lit abode.",
        "source": "T15n0639_002:0560b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　城郭悉莊嚴，　　百千億幢幡，　栴檀塗其地，　　散花而莊嚴。",
        "translation": "The city is completely adorned, with a hundred billion banners and streamers, sandalwood painted on the ground, and flowers scattered about to adorn it.",
        "source": "T15n0639_002:0560b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛在道行時，　　發廣悲愍心，　口出無量光，　　吐香而說法。",
        "translation": "When the Buddha was on his path, he aroused a mind of vast compassion, emitted measureless lights from his mouth, and exhaled incense as he preached.",
        "source": "T15n0639_002:0560b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　覩佛身生樂，　　得喜不思議：『我等何時得，　　法王勝供養？』",
        "translation": "Seeing the Buddha's body gives rise to happiness, and they rejoice without conceiving, 'When will we attain supreme offerings from the Dharma king?'",
        "source": "T15n0639_002:0560b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量人發心：　　『我明亦請佛。",
        "translation": "Countless people arouse the intention, 'I'll also ask the Buddha to illuminate my mind.",
        "source": "T15n0639_002:0560b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憐愍救濟者，　　久遠難值遇。』",
        "translation": "Have compassion on those who rescue you, for they are difficult to meet in the distant past.'",
        "source": "T15n0639_002:0560b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或巷城却敵，　　勝妙自莊嚴，　辦具諸花瓔，　　散佛為菩提；　或勝瞻波鬘，　　婆師目多伽；　或復散繒綵，　　發勝純至心；　或在家心淨，　　勝衣自莊嚴，　以繒綵諸花，　　散大比丘眾，　優鉢羅花等、　　復散妙金花、　種種摩尼寶、　　或散栴檀末。",
        "translation": "Sometimes they go into a city, surpass their opponents, surpass their own subtle adornment, prepare an array of flowers and diadem, and scatter buddhas for enlightenment; sometimes they surpass campaka garlands and vasiṃmitra; sometimes they scatter silken ribbons and arouse a superior, pure mind; sometimes they stay at home with a pure heart and surpass the adornment of their robes, scattering large crowds of monks with silken flowers, utpala flowers and the like, scattering fine gold flowers, various kinds of maṇi treasures, or scattering powdered sandalwood.",
        "source": "T15n0639_002:0560b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現諸希有事，　　不可稱計數，　佛入城門時，　　多人發道心。",
        "translation": "There were rare and incalculable things in evidence, and when the Buddha entered the city gates, many people aroused the aspiration for enlightenment.",
        "source": "T15n0639_002:0560b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無煩熱見諦、　　善現、善見天、　阿迦尼離欲，　　一切來觀佛；　密身及廣果，　　百那由他眾，　如摩尼光曜，　　悉來瞻仰尊；　淨天子無數、　　及諸少淨天、　無量淨天子，　　悉來觀大仙；　其少光天子、　　及無量光天、　光音天子等，　　咸共來觀佛；　其梵輔天子、　　并及梵眾天、　定藏大梵等，　　皆來觀世尊；　他化天歡喜、　　化樂天善心、　兜率炎摩眾、　　三十三天王、　四方四天王、　　財主毘樓勒、　惡眼提賴吒，　　故來禮敬佛。",
        "translation": "　無煩熱見諦、　　善現、善見天、　阿迦尼離欲，　　一切來觀佛；　密身及廣果，　　百那由他眾，　如摩尼光曜，　　悉來瞻仰尊；　淨天子無數、　　及諸少淨天、　無量淨天子，　　悉來觀大仙；　其少光天子、　　及無量光天、　光音天子等，　　咸共來觀佛；　其梵輔天子、　　并及梵眾天、　定藏大梵等，　　皆來觀世尊；　他化天歡喜、　　化樂天善心、　兜率炎摩眾、　　三十三天王、　四方四天王、　　財主毘樓勒、　惡眼提賴吒，　　故來禮敬佛。",
        "source": "T15n0639_002:0560c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大力夜叉王、　　及眷屬淨心、　并親族在空，　　雨諸天妙花；　恒醉持鬘天，　　執種種花鬘，　并眷屬心喜，　　供養勝丈夫；　百器足夜叉、　　并妻及眷屬，　自擊美音樂，　　供養於如來；　喜悅耽美歌，　　謂緊那羅王，　居在香山頂，　　踊躍悉來集；　婆稚睒婆利、　　羅睺、毘摩質、　并餘大威德，　　而雨諸寶物；　過無量羅剎，　　多眾而圍遶，　各持諸妙花，　　恭敬而散佛；　阿耨大龍王，　　女善學音樂，　擊百種妙聲，　　誠心供養佛；　耨龍五百子，　　求廣菩提智，　與親屬圍遶，　　咸共無上尊；　阿波羅龍王，　　向佛而合掌，　持龍勝真珠，　　在空供養佛；　目真陀龍王，　　踊躍悉歡喜，　散諸妙寶果，　　淨心而供養。",
        "translation": "　大力夜叉王、　　及眷屬淨心、　并親族在空，　　雨諸天妙花；　恒醉持鬘天，　　執種種花鬘，　并眷屬心喜，　　供養勝丈夫；　百器足夜叉、　　并妻及眷屬，　自擊美音樂，　　供養於如來；　喜悅耽美歌，　　謂緊那羅王，　居在香山頂，　　踊躍悉來集；　婆稚睒婆利、　　羅睺、毘摩質、　并餘大威德，　　而雨諸寶物；　過無量羅剎，　　多眾而圍遶，　各持諸妙花，　　恭敬而散佛；　阿耨大龍王，　　女善學音樂，　擊百種妙聲，　　誠心供養佛；　耨龍五百子，　　求廣菩提智，　與親屬圍遶，　　咸共無上尊；　阿波羅龍王，　　向佛而合掌，　持龍勝真珠，　　在空供養佛；　目真陀龍王，　　踊躍悉歡喜，　散諸妙寶果，　　淨心而供養。",
        "source": "T15n0639_002:0560c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼起勝敬心，　　念佛種種德，　諸親屬圍遶，　　皆來讚歎佛。",
        "translation": "They arouse feelings of great respect, mindful of the Buddha's various virtues, and are surrounded by their relatives, who all come to praise the Buddha.",
        "source": "T15n0639_002:0561a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　難陀、跋難陀、　　德叉、黑瞿曇、　與眷屬詣佛，　　屈膝禮善逝。",
        "translation": "Nanda, Upananda, Takṣa, and Hegodān, along with their retinues, went to the Buddha and bowed their knees in homage to Sugata.",
        "source": "T15n0639_002:0561a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　伊羅鉢龍王，　　百眷屬號泣，　憶念迦葉佛，　　厭惡此受生：『我昔懷疑惑，　　壞小芛蘭葉，　是故生難處，　　不能知佛法。",
        "translation": "The Elāpattra dragon king and his hundred retinues wept, remembering Kāśyapa Buddha and disgusted with this birth: 'I used to harbor doubt and confusion, which destroyed the small head of Ranjan, and I was born in a difficult place where I couldn't know the Buddha's teaching.",
        "source": "T15n0639_002:0561a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　深厭此蛇身，　　願速捨龍趣，　能知清涼法，　　道場所得者。』",
        "translation": "I'm so disgusted with this serpent body that I want to quickly abandon the destiny of dragons and know the cool Dharma, which I'll attain at the site of enlightenment.'",
        "source": "T15n0639_002:0561a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　餘多千龍王、　　海龍摩那斯，　持上妙龍衣，　　來奉人中尊。",
        "translation": "A thousand other dragon kings and the sea dragon Manas, armed with the finest dragon robes, came to present them to the venerable among men.",
        "source": "T15n0639_002:0561a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　調達擲佛石，　　夜叉住空接，　其名金毘羅，　　恭敬在佛前。",
        "translation": "Tathāgata tossed a Buddha-stone, and a yakṣa standing in the air caught it, named Kimbila, and venerated it in front of the Buddha.",
        "source": "T15n0639_002:0561a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿吒夜叉城，　　空無大夜叉，　誡約悉令集，　　供養大仙尊。",
        "translation": "In the Yakṣa city of Āṭavika, there's no great yakṣa in space, so they all gather to make offerings to the great sage.",
        "source": "T15n0639_002:0561a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　灰毛針夜叉、　　阿吒婆可畏、　雪山、婆多山、　　驢夜叉歸佛。",
        "translation": "Gray-haired needle yakṣas, Āṭavika, snow-capped mountains, Vāta mountains, and donkey yakṣas take refuge in the Buddha.",
        "source": "T15n0639_002:0561a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種異類身，　　被服甚可畏；　多那由他鬼，　　持吉物奉佛；　食海金翅鳥、　　變形婆羅門，　寶冠自莊嚴，　　住空而禮佛。",
        "translation": "They are dressed in various unusual bodies that are quite formidable, and they're presented to the Buddha by a Tāna-yuta demon carrying an auspicious object. A gold-winged bird that eats the ocean, a Brahmin in transformation form, and a jeweled crown adorn themselves as they stand in the sky and worship the Buddha.",
        "source": "T15n0639_002:0561a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　閻浮所有城，　　一切大林天，　與城神俱來，　　供養世間解。",
        "translation": "In all the cities of Jambudvīpa, all the great forest gods come with the city spirits to make offerings to the world's understanding.",
        "source": "T15n0639_002:0561a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量林天至、　　并諸樹神等，　及一切河神，　　集詣法王所。",
        "translation": "Measureless forest gods, tree gods, and other gods, as well as all the river gods, gathered at the Dharma king's residence.",
        "source": "T15n0639_002:0561b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　山峯、巖嶺神、　　堆阜天亦至，　泉池、沼神等，　　共海神喜到。",
        "translation": "Mountain peak gods, hill gods, and mound gods also arrived, and spring and marsh gods and others shared the joy of the ocean gods.",
        "source": "T15n0639_002:0561b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天、人、修羅、鬼、　　迦樓、鳩槃等、　餓鬼、富單那，　　悉來供養佛。",
        "translation": "Gods, humans, sūras, ghosts, kalpas, kumbhâṇḍas, hungry ghosts, and pūtanas all came to make offerings to the Buddha.",
        "source": "T15n0639_002:0561b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天、修羅眾，　　離慢咸供養，　見佛入王城，　　觀之無厭足。",
        "translation": "The gods and Cūḍas, free of conceit, all make offerings, and they see the Buddha enter the king's city and observe him without tire.",
        "source": "T15n0639_002:0561b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過修菩薩行，　　供養曾世尊，　彼作是淨業，　　眾生觀無厭。",
        "translation": "They used to cultivate the bodhisattva practice and make offerings to the Bhagavān, and they perform such pure activities that sentient beings never tire of observing them.",
        "source": "T15n0639_002:0561b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　須彌、輪山等，　　及閻浮諸山，　不能為障蔽，　　諸佛照剎光。",
        "translation": "Sumeru, Wheel Mountain, and the other Jambudvīpa mountains can't be obstructed by the buddhas' illuminating bases.",
        "source": "T15n0639_002:0561b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此娑婆諸海、　　土地悉平正，　佛剎普皆遍，　　散眾花悉滿。",
        "translation": "The oceans of this sahāva are completely level, the buddha bases are completely pervasive, and the scattered flowers are completely filled.",
        "source": "T15n0639_002:0561b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　百千種光明，　　法王足下放，　地獄盡清涼，　　除苦獲安樂。",
        "translation": "A hundred thousand kinds of light are radiated beneath the Dharma king's feet, which makes hell completely cool and removes suffering to attain well-being.",
        "source": "T15n0639_002:0561b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十力為說法，　　天人得眼淨，　無量百千眾，　　於佛道決定。",
        "translation": "The ten powers speak for them, purifying the eyes of gods and humans, and measureless hundreds of thousands of people are determined to enter the Buddha's path.",
        "source": "T15n0639_002:0561b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無等等入城，　　現作是神變，　無量百千劫，　　佛說尚難盡。",
        "translation": "Without waiting to enter the city, he performs this miraculous transformation, which is difficult to exhaust even after measureless hundreds of thousands of eons of Buddha's teaching.",
        "source": "T15n0639_002:0561b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是勝德聚，　　牛王度彼岸，　一切德究竟，　　頂禮佛福田。」",
        "translation": "Thus is the cluster of surpassing qualities, the cow king reaches the other shore, and all virtues are fully attained as he pays homage to the Buddha's field of merit.\"",
        "source": "T15n0639_002:0561b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊與諸比丘前後圍遶往詣月光童子住處，坐所敷坐，諸比丘僧次第而坐。",
        "translation": "At the time, the Bhagavān and the monks circled around him and went to where the Boy Candraprabha was staying, spread out their seats, and the monks sat down in order.",
        "source": "T15n0639_002:0561b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，月光童子知佛、菩薩比丘坐已，自手齎持多種美食——所謂佉禪尼、蒲禪尼、梨呵那諸沙尼等——又持漿飲，以百味食充足如來及以大眾。",
        "translation": "After he knew the Buddha and the bodhisattva monks were sitting there, the Boy Moonlight brought with him a variety of delicious foods - the khaṭṭṭika, poṭika, and rihāna nuns - and a drink, which he used to fill the Tathāgata and the crowd with a hundred flavors of food.",
        "source": "T15n0639_002:0561b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既充足已，歡喜踊躍，深自慶遇。",
        "translation": "Once they had prepared enough, they rejoiced and jumped for joy, deeply celebrating their encounter.",
        "source": "T15n0639_002:0561b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛及大眾飯食訖已，却鉢澡手，以萬億價寶衣奉上如來；比丘眾隨上、中、下次第，各以上、中、下三衣次第施之。",
        "translation": "When the Buddha and the whole assembly had finished eating, they put away their bowls, washed their hands, and presented the Tathāgata with a trillion precious robes; the monks gave them to the Tathāgata in the order of superior, middle, and junior, following the superior, middle, and junior robes.",
        "source": "T15n0639_002:0561b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，月光童子於佛及僧施衣物已，偏袒右肩，右膝著地，合掌作禮，住於佛前默念說偈而問世尊：「菩薩智者行何行，　　常能解知諸法性？",
        "translation": "After the Buddha and the saṃgha had donated the garments, the Candraprabha boy bared his right shoulder, knelt on his right knee, put his palms together in prostration, stood in front of the Buddha, said a silent verse, and asked the Bhagavān, \"What practices do bodhisattvas and wise ones carry out that enable them to always understand the nature of all dharmas?",
        "source": "T15n0639_002:0561c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何能入所作業？",
        "translation": "How can we enter into the activity that we do?",
        "source": "T15n0639_002:0561c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　惟願導師為我說。",
        "translation": "\"May my guide explain this for me.",
        "source": "T15n0639_002:0561c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何能得於宿命？",
        "translation": "\"How can I attain past lives?",
        "source": "T15n0639_002:0561c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何不復處胞胎？",
        "translation": "How is it not possible to have twins again?",
        "source": "T15n0639_002:0561c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何能得不壞眾？",
        "translation": "How can we attain a multitude that is indestructible?",
        "source": "T15n0639_002:0561c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何故而得無量辯？",
        "translation": "How is it possible to have immeasurable eloquence?",
        "source": "T15n0639_002:0561c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無上定慧兩足尊，　　如我所問願記說，　知諸眾生心所行，　　於一切法無有疑。",
        "translation": "\"The two-legged honored one of unsurpassed concentration and wisdom, who answers my questions and vows to explain them, knows what sentient beings do in their minds, and has no doubts about any dharma.",
        "source": "T15n0639_002:0561c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛知一切法體性，　　離言語法以言說，　如師子吼摧野干，　　佛降異道亦如是。",
        "translation": "The Buddha knows the essence of all dharmas, using language apart from verbal dharmas, like a lion roaring and destroying a wilderness trunk, so too does the Buddha subdue heretics.",
        "source": "T15n0639_002:0561c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知諸眾生之所行，　　通達諸法到彼岸，　無礙智慧淨境界，　　惟願法王為我說。",
        "translation": "He knows what sentient beings do, fully comprehends all dharmas to reach the other shore, and vows that the king of the Dharma will explain it for me, given the pure state of unimpeded wisdom.",
        "source": "T15n0639_002:0561c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知於過去、未來世，　　及今現在亦悉了，　三世無礙智堪能，　　是故我問釋師子；　一切三世諸佛法，　　法王世尊悉能知，　於法體性善覺悟，　　是故我問大智海。",
        "translation": "He has full knowledge of past and future lives as well as the present, and his unimpeded knowledge of the three times is up to him; therefore, I've asked Shizi; the Bhagavān, the Dharma king, fully knows all the Buddha's teachings of the three times, and he well understands the essence of dharmas; therefore, I've asked the great ocean of wisdom.",
        "source": "T15n0639_002:0561c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能離一切諸法過，　　已能斷於心穢故，　剪除一切癡穢結，　　願佛為說菩提行。",
        "translation": "He's able to part with all the faults of the Dharma, has ended the defilement of mind, has cut all the bonds of delusion, and wishes the Buddha to teach the practice of enlightenment for him.",
        "source": "T15n0639_002:0561c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　而佛所得諸法相，　　如所得相為我說；　我聞如是法相已，　　依所聞相行菩提。",
        "translation": "The Buddha describes the characteristics of the things he has learned as they are learned for me, and after hearing such characteristics, I'll practice enlightenment based on what I've heard.",
        "source": "T15n0639_002:0561c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生行相多差別，　　我作何行能解入？",
        "translation": "There are many differences in the ways sentient beings behave, so what practice can I do to understand and enter them?",
        "source": "T15n0639_002:0561c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願為我說入行法，　　我得聞已則能知。",
        "translation": "\"May you explain the method of entry into practice for me, and then I'll be able to know it after hearing it.",
        "source": "T15n0639_002:0561c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸法各差別，　　其體空寂性遠離，　菩薩云何能現證？",
        "translation": "How can a bodhisattva realize the emptiness and quiescence of all the dharmas that are differentiated and far removed from their essence?",
        "source": "T15n0639_002:0561c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　願為我說是法母。",
        "translation": "'May you teach me this mother of the Dharma.",
        "source": "T15n0639_002:0561c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於一切法到彼岸，　　言說法句已修學，　己自無疑除他疑，　　為我顯示佛菩薩。」",
        "translation": "I've reached the other shore of all dharmas, spoken the phrases of the Dharma and cultivated them, avoided doubts in myself and removed doubts in others, and revealed the buddhas and bodhisattvas for me.\"",
        "source": "T15n0639_002:0561c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月燈三昧經卷第二",
        "translation": "Moonlight Lamp Samādhi Sūtra, Vol. 2",
        "source": "T15n0639_002:0562a02_0",
        "is_bad_quality": false
    }
]