[
    {
        "source_sentence": "佛說大乘智印經卷第一",
        "translation": "Foshuo dasheng zhiyan jing roll 1",
        "source": "T15n0634_001:0474c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天三藏寶法大師賜紫沙門",
        "translation": "Vaiśravaṇa, bestower of the Tripiṭaka treasure in the Western Heaven",
        "source": "T15n0634_001:0474c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智吉祥等奉　詔譯",
        "translation": "Zhijixiang et al. Translation of the imperial edict",
        "source": "T15n0634_001:0474c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時世尊入王舍大城，次第乞食，受施充足，還迦蘭陀林。",
        "translation": "Thus I have heard: One time, the Bhagavān went into the great city of Rājagṛha, begged for food in order, accepted enough alms, and returned to the Kalandaka Grove.",
        "source": "T15n0634_001:0474c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食時食已，結跏趺坐，與大比丘眾及諸菩薩百萬人俱，歡喜圍繞。",
        "translation": "After he finished his meal, he sat cross-legged there with a large assembly of monks and a million other bodhisattvas, joyfully surrounding him.",
        "source": "T15n0634_001:0474c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸大眾皆得陀羅尼平等無礙，心悟總持，得三摩地，安住空性、無相、無願、解脫法門，具足無量殊勝功德，言議、思惟皆不可及。",
        "translation": "Those members of the crowd all attained equality and nonobstruction in the dhāraṇī, comprehended the dhāraṇī, attained samādhi, and abided in the Dharma-gate of emptiness, signlessness, wishlessness, and liberation, which is endowed with measureless and excellent qualities beyond the reach of words or conception.",
        "source": "T15n0634_001:0474c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾所知、為眾所識，寂靜安住如是法門，於諸分別悉皆平等，不隨世間眾所好樂，了知眾生差別識性，於一切時所知善惡，離諸憎愛，一味平等。",
        "translation": "Known by many and known to many, he calmly and quietly abides in this teaching, is equal in all discriminations, doesn't follow the world's various likes and dislikes, understands the nature of sentient beings' distinct consciousnesses, knows good and evil at all times, is free of hatred, and is equal in taste.",
        "source": "T15n0634_001:0474c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊忽於眉間放大光明，是諸眾會咸皆悚慄，肅恭合掌，瞻仰如來，目不暫捨。",
        "translation": "It was then that the Bhagavān suddenly radiated a bright light from between his eyebrows, and the congregation was all terrified, solemnly folded their palms, and looked up at the Tathāgata, not taking their eyes off him for a moment.",
        "source": "T15n0634_001:0474c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告言：「汝等應當繫心思惟，安住如來所知境界，於我、我所，好惡、分別，悉皆遠離。",
        "translation": "The Bhagavān told them, \"You should fix your minds and contemplate that you're abiding in the Tathāgata's cognitive realm, and you should avoid self, what's mine, good and evil, and discrimination.",
        "source": "T15n0634_001:0474c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於自身毀譽等觀苦樂一切，審知眾生由染污緣受差別相，遊處好樂，晝夜不捨，以方便力悉使斷除。",
        "translation": "If you contemplate all the pain and pleasure in disparagement of self and so forth, and examine the ways in which sentient beings are conditioned by defilements and experience distinctions, travel around in pleasure and dislike, and don't abandon them day and night, you'll completely end them with the power of skillful means.",
        "source": "T15n0634_001:0474c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀諸眾生種種造作諸不善業，隨順他教，競共馳逐，與諸同分安處動作無義利業。",
        "translation": "He observes the various ways in which sentient beings create unwholesome actions, follow the teachings of others, compete and chase after each other, and act in ways that are aimlessly beneficial to their fellow beings.",
        "source": "T15n0634_001:0475a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯由有情識心愚昧，於真實境無所了知；失勝善心；逐惡朋友；不解、思惟深遠勝法；真實義諦起諸分別謂為真實；無揀擇慧；闕定信心；於佛言教及眾妙行不生好樂；設復修善，無應正理；著有、著空互為究竟。",
        "translation": "It's because sentient beings are ignorant of consciousness and mind, don't comprehend true reality, lose their superior good mind, pursue bad friends, don't understand or contemplate profoundly superior things, create distinctions in true truths and call them true, lack discriminating wisdom, lack concentration and confidence, don't delight in the Buddha's words and teachings or in the many wonderful practices, don't cultivate goodness when there's no right principle to do so, and become attached to existence and emptiness as being both final.",
        "source": "T15n0634_001:0475a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以如來智印三摩地力悉能了知。",
        "translation": "I'm able to fully understand this with the power of the tathāgata's wisdom-seal samādhi.",
        "source": "T15n0634_001:0475a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應當於是有情深心憐愍。」",
        "translation": "All of you should have deep compassion for these sentient beings.\"",
        "source": "T15n0634_001:0475a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸大眾聞如是說，讚歎如來勝定功力，悉能了知如是差別。",
        "translation": "The large crowd that heard this praised the Tathāgata's excellent concentration power and was able to fully understand such distinctions.",
        "source": "T15n0634_001:0475a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊作是語已，乃入如來智印三摩地。",
        "translation": "After making these remarks, the Bhagavān then entered the samādhi of the seal of the Tathāgata's wisdom.",
        "source": "T15n0634_001:0475a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸大眾覩佛如來入是勝定，於佛身相及種種相，一切眾會忽皆不見，不能了知；如來所著法衣及近身衣亦復不見，不能了知；如來所有四威儀相乃至一切動轉之相，皆不可見，不能了知；如來所有音聲差別不能聽聞，不能了知。",
        "translation": "Seeing the Buddha as he entered this excellent concentration, the whole assembly suddenly didn't see the Buddha's physical appearance and various forms, and they couldn't comprehend them; the Tathāgata's Dharma robe and near-body robe also didn't appear, and they couldn't comprehend them; the Tathāgata's four comportments and all the signs of movement were invisible and couldn't be comprehended; and the Tathāgata's distinctions in sound and voice couldn't be heard or comprehended.",
        "source": "T15n0634_001:0475a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0634_001:0475a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是安住如是智印三摩地勝功德力，心無動轉，不可測量故。",
        "translation": "Because of this resolute abiding in the overpowering power of the wisdom-seal samādhi, his mind is unshaken and immeasurable.",
        "source": "T15n0634_001:0475a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如來由勝定力，於諸外境種種莊嚴，一切眾會皆不可見，不能了知；於諸所住清淨國土，皆不得見，不能了知。",
        "translation": "Furthermore, because of the power of his excellent concentration, the Tathāgata can't see or comprehend all the various external objects that are adorned, and he can't see or comprehend any of the pure lands in which he lives.",
        "source": "T15n0634_001:0475a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0634_001:0475a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是安住如來智印三摩地勝功德力，心無動轉，不可測量故。",
        "translation": "Because of this resolute abiding in the Tathāgata's wisdom-seal samādhi of superior merit, his mind is unshaken and immeasurable.",
        "source": "T15n0634_001:0475a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾於佛形相既無所見，各各稱讚勝定功德。",
        "translation": "At the time, the whole crowd, having seen nothing of the Buddha's form, each praised the merits of that excellent concentration.",
        "source": "T15n0634_001:0475a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "承佛威力，深心所求離諸怖畏。",
        "translation": "Because of the Buddha's authority, they deeply desired to be free of fear.",
        "source": "T15n0634_001:0475a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時如來復於定中放大光明，遍照三千大千世界。",
        "translation": "At that point, the Tathāgata again magnified his light in that concentration, shining brightly throughout the 3,000 great thousand worlds.",
        "source": "T15n0634_001:0475a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其間所有日月、星辰、電火、藥珠種種光明悉皆掩蔽。",
        "translation": "All the sun, moon, stars, lightning, and medicinal pearls in that area are obscured by their various lights.",
        "source": "T15n0634_001:0475a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於定中發生異香。",
        "translation": "Also in that state of concentration, a strange fragrance arises.",
        "source": "T15n0634_001:0475a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其香微妙，不與世間栴檀、沈水諸香為比。",
        "translation": "Its fragrance is so subtle that it's not comparable to the fragrances of sandalwood and immersed water in the world.",
        "source": "T15n0634_001:0475a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時色、無色天、梵王帝釋，及諸天人、四眾、八部、大鐵圍山、小鐵圍山及須彌山眾山之王、水陸空界幽暗之處，一切有情咸覩光明，歎未曾有。",
        "translation": "At the time, all sentient beings in the form and formless heavens, Brahmā and Indra, the four groups of gods and humans, the eight groups, Mount Sumeru, the great and small iron mountains, the king of mountains, and the dark places of the water, land, and air realms saw a radiance that had never existed before.",
        "source": "T15n0634_001:0475b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各尋是光至迦蘭陀林。",
        "translation": "Each one looked for that light and went to the Kalandaka Groves.",
        "source": "T15n0634_001:0475b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各隨所有，香、華、衣服、寶冠、瓔珞以為供養。",
        "translation": "Each followed what he had, offering incense, flowers, clothing, a jeweled crown, and jewelry as offerings.",
        "source": "T15n0634_001:0475b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見是會中諸大菩薩及聲聞眾，如大池中蓮華開敷，異香芬馥集在眾會。",
        "translation": "They saw the great bodhisattvas and śrāvakas in the assembly like lotus flowers blooming in a large lake, and a rare fragrance gathered in the assembly.",
        "source": "T15n0634_001:0475b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人天聞是香已，各各皆得智慧明了。",
        "translation": "After hearing this fragrance, all the humans and gods attained wisdom and insight.",
        "source": "T15n0634_001:0475b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於空中有寶瓔珞、上妙衣服，處處垂下，嚴飾供養。",
        "translation": "There were also precious jewelry and fine clothing draped everywhere in the sky, adorned and offered in tribute.",
        "source": "T15n0634_001:0475b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸大眾咸皆歡喜，恭敬禮拜，退坐一面。",
        "translation": "The whole assembly then rejoiced, venerated, and retired to sit at one side.",
        "source": "T15n0634_001:0475b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時東方如一酤胝殑伽沙數，一一沙數為一酤胝，爾所國土一切如來皆是釋迦分身化利。",
        "translation": "At the time, the east was like a multitude of sands, and each multitude of sands was a multitude of sands, and all the tathāgatas in that land were the dividing bodies of Śākyamuni and the transformation benefits.",
        "source": "T15n0634_001:0475b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來各集眾會，菩薩摩訶薩阿僧祇數不可稱量。",
        "translation": "Thus, the Tathāgatas each assembled a multitude of assemblies of bodhisattvas, mahāsattvas, and incalculable numbers of bodhisattvas.",
        "source": "T15n0634_001:0475b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩悟證平等，當得阿耨多羅三藐三菩提，諸身色相微妙具足，人天眾會皆無與等。",
        "translation": "These bodhisattvas awaken and realize equality, and they will attain unsurpassed, perfected subtlety in body and form, which is unequalled by all the assemblies of humans and gods.",
        "source": "T15n0634_001:0475b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時一切分身如來各各告語諸菩薩言：「善男子！",
        "translation": "At that point, the tathāgatas who were all part of the body each addressed the bodhisattvas, saying, \"Good sons!",
        "source": "T15n0634_001:0475b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑婆世界有佛世尊，號釋迦牟尼，應、正等覺，出現於世，化諸有情離眾罪垢。",
        "translation": "In the sahā world, there's the Bhagavān, called Śākyamuni, deserving and perfectly enlightened, who appears in the world to convert sentient beings and rid them of the stain of many sins.",
        "source": "T15n0634_001:0475b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經無量時演說正法，示佛知見，甚深難解。",
        "translation": "He spends measureless hours expounding the right Dharma and demonstrating the Buddha's knowledge and vision, which is too profound to understand.",
        "source": "T15n0634_001:0475b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有陀羅尼門，名如來智印三摩地三摩鉢提，我今為汝略而讚說。",
        "translation": "There's a dhāraṇī teaching called the tathāgata's wisdom-seal samādhi-samāpatti, which I'll now explain for you in brief.",
        "source": "T15n0634_001:0475b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "Good sons!",
        "source": "T15n0634_001:0475b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "All of you, listen closely!",
        "source": "T15n0634_001:0475b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於百千劫具足修行六到彼岸，具大智慧，福德無量，悟證修習常無懈廢，永離罪垢，捨眾惡緣，住三摩地，得佛智慧，心無動轉，以無動心了悟諸法。",
        "translation": "For a hundred thousand eons, these bodhisattvas, mahāsattvas, have fully cultivated the six perfections, possess great wisdom, have measureless merit, are never lazy in their awakening and cultivation, are forever free of the stain of sin, abandon all bad causes, abide in samādhi, attain buddha wisdom, have an unshaken mind, and comprehend all dharmas with an unshaken mind.",
        "source": "T15n0634_001:0475b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情親近如來及大菩薩，熏修智慧，三業恭敬，以勝法財修諸供養經無量時，不如於此一剎那頃安住如是勝三摩地，所獲功德不可較量，常生勝處諸佛國土。」",
        "translation": "If sentient beings were to become intimate with the Tathāgata and great bodhisattvas, cultivate wisdom, pay respect to the three activities, and cultivate offerings with superior Dharma assets for measureless hours, they wouldn't be able to stand in such excellent samādhi for a single moment, and the merit they attain would be incalculable and would always be born in a superior place in the buddha lands.\"",
        "source": "T15n0634_001:0475b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸佛作是語已，安住禪定，以神通力攝諸菩薩，詣娑婆世界，示同一身入王舍城，次第乞食，受施充足，至迦蘭陀林，乃與眾會分食妙供。",
        "translation": "After the buddhas said this, they settled into meditative concentration, gathered the bodhisattvas with their supernormal powers, went to the Śrāvastī world, showed them all the same body, entered Rājagṛha, begged for food in order, and received enough alms to get to the Kalandaka Grove, where they shared a wonderful meal and offerings with the assembly.",
        "source": "T15n0634_001:0475b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾會無不霑足。",
        "translation": "None of the assembled people had enough.",
        "source": "T15n0634_001:0475c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飯食已，訖攝斂衣鉢，跏趺而坐。",
        "translation": "After they had finished eating, they gathered their robes and bowls, and sat cross-legged there.",
        "source": "T15n0634_001:0475c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切國土所來諸佛及諸菩薩亦復如是，無二無別。",
        "translation": "So it is with all the buddhas and bodhisattvas from all lands, without distinction or difference.",
        "source": "T15n0634_001:0475c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次南方如一酤胝殑伽沙數，一一沙數為一酤胝，爾所國土一切諸佛，攝諸菩薩從彼國來集會亦爾。",
        "translation": "Furthermore, as the south is like a single sands, each sands is a single sands, so are all the buddhas and bodhisattvas gathered from that land.",
        "source": "T15n0634_001:0475c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如東方、南方，西方、北方、四維、上下，一切諸佛諸大菩薩皆來集會亦復如是。",
        "translation": "It's likewise as the east, south, west, north, the four counterpoints, and up and down, where all the buddhas and great bodhisattvas come to assemble.",
        "source": "T15n0634_001:0475c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼應、正等覺，見所分身一切諸佛皆來集會，心相怡悅，唯佛與佛乃得相見。",
        "translation": "At the time, Śākyamuni, the worthy and perfectly enlightened one, saw all the buddhas in his physical body come together, and he was delighted at heart that only the Buddha and the buddhas could see each other.",
        "source": "T15n0634_001:0475c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸如來同入如是智印三摩地三摩鉢提，靜意廓如，動亂止息，以不動心明照諸法，無二無別，諸佛身相亦復不現。",
        "translation": "The tathāgatas then all entered together into the samādhi-samāpatti, a samāpatti of the seal of wisdom, with calm concentration and unimpededness, and with an unmoving mind they clearly illuminated all dharmas without difference or distinction, and the buddhas' physical appearances were no longer visible.",
        "source": "T15n0634_001:0475c12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時此會人天大眾見是十方無數諸佛皆來集會，以勝定力身相不現，咸皆驚喜，整衣，合掌，右繞三匝，以寶蓮華及眾妙華諸色具足，持以供養。",
        "translation": "When the great multitude of people and gods in this congregation saw that countless buddhas from ten directions had gathered here, and that their physical appearances didn't appear because of the power of their excellent concentration, they were all startled and delighted, adjusted their robes, put their palms together, circled to their right three times, and offered offerings of jeweled lotus flowers and a profusion of marvelous flowers in various colors.",
        "source": "T15n0634_001:0475c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時集會無量世界諸大菩薩，得清淨心，具正法眼，於一切時心相澄寂，各各當得阿耨多羅三藐三菩提者，見釋迦牟尼如來、應、正等覺與諸如來，安住如是智印三摩地三摩鉢提，由勝定力隱諸色相，志願希求，深心歡喜，以精意力不起於坐，覺智現前，入佛境界，得陀羅尼門。",
        "translation": "The assembled great bodhisattvas of measureless worlds who had attained a pure mind and possessed the true eye of the Dharma and whose minds were at all times serene and tranquil, each about to attain supreme perfect enlightenment, saw the Tathāgata Śākyamuni, the worthy, the perfectly enlightened, and the tathāgatas abiding in this samādhi-samāpatti of wisdom-seals, concealed from view by the power of excellent concentration, aspired, and rejoiced deeply, didn't get up from their seats with the power of their concentration, and their awakening and knowledge manifested themselves, entering the Buddha's realm and attaining the dhāraṇī gate.",
        "source": "T15n0634_001:0475c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸菩薩告此娑婆世界諸大眾言：「善男子！",
        "translation": "The bodhisattvas then addressed the great multitude of people in this Saha world, saying, \"Good sons!",
        "source": "T15n0634_001:0475c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應當於佛功德眷戀希求；於諸有情繫心憐愍；知諸菩薩摩訶薩於百千劫行六波羅蜜，具大智慧，福德無量；於一切法悉皆了知；離諸戲論，處深禪定；不忘，不愚，達諸性相；於是勝法應當願求。」",
        "translation": "You should long for and seek the Buddha's merits, bind your hearts in pity for sentient beings, and know that bodhisattvas, mahāsattvas, and pratyekabuddhas have practiced the six perfections for a hundred thousand eons, possess great wisdom and measureless merit, fully comprehend all things, part with conceptual elaborations, and abide in profound meditation, not forgetting or being foolish, and comprehending the nature and characteristics, and you should vow to seek this excellent teaching.\"",
        "source": "T15n0634_001:0475c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時三千大千世界聲聞、緣覺具大智慧，得大神通，捨生死岸，離煩惱縛，於自涅槃修證圓滿。",
        "translation": "At the time, the śrāvakas and pratyekbuddhas of the 3,000 great one-thousand worlds possessed great wisdom and attained great supernormal powers, abandoned the shore of birth-and-death, parted with the bonds of affliction, and cultivated the consummation of their own nirvāṇa.",
        "source": "T15n0634_001:0475c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大苾芻眾及諸宰官、婆羅門、鄔婆索迦、鄔婆斯迦，如是等眾咸來至此王舍大城迦蘭陀林釋迦如來、應、正等覺及分身佛會，繞百千匝，恭敬禮拜，各以上妙雜色蓮華，其華千葉，七寶間錯，過無量數以為供養。",
        "translation": "A great multitude of monks, rulers, brāhmaṇas, upāsaka, upāsaka, and so forth all came to this assembly of the Tathāgata, Arhat, and Fully Awakened One, and the part-body buddhas in the Kalandaka Grove of Rājagṛha's great city, circled it a hundred thousand times, venerated it, and offered offerings in excess of measure to each of them of a lotus of a wonderful variety of colors with a thousand petals and a mosaic of seven jewels.",
        "source": "T15n0634_001:0476a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八十酤胝那庾多數諸大菩薩摩訶薩眾，是諸菩薩皆是他方國土中諸佛如來之所遣使，有大勇猛不怖生死，有大慈悲不樂涅槃，各以神力入大禪定，現諸威儀。",
        "translation": "There's another congregation of 80 cornelian nayutas and a multitude of great bodhisattvas, mahāsattvas, who are all messengers of the Tathāgatas in lands elsewhere, have great courage, aren't afraid of birth and death, have great compassion, don't wish for nirvāṇa, each enters a great meditative concentration with supernormal powers, and display various postures.",
        "source": "T15n0634_001:0476a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從彼彼土如彈指頃到王舍城迦蘭陀林釋迦牟尼應、正等覺及分身佛會，三業恭敬，以清淨妙音尊重讚歎。",
        "translation": "From that land or place in a snap of a finger, they arrive at the assembly of Śākyamuni, the worthy, perfectly enlightened, and partial-body buddhas in Kalandaka Grove in Rājagṛha City, where they are honored by their three actions and praised with pure, marvelous sounds.",
        "source": "T15n0634_001:0476a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸佛身隱晦不現，渴仰世尊，圍繞眾會，頭面作禮，退處一面，各各皆於寶蓮華上結跏趺坐。",
        "translation": "Seeing that the buddhas' bodies were obscured and invisible, they longed for the Bhagavān, surrounded the assembly, paid homage with their heads and faces, withdrew to one side, and each sat cross-legged on a jeweled lotus.",
        "source": "T15n0634_001:0476a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三億諸比丘眾樂修己利、求解脫者，承於如來智印三摩地力而來集會。",
        "translation": "Three hundred million other monks who were interested in cultivating their own well-being and seeking liberation had come to the assembly because of the Tathāgata's wisdom-seal samādhi power.",
        "source": "T15n0634_001:0476a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時他方三千大千世界帝釋梵王、大自在天、淨居天子、日月星辰，及諸一切天、龍、樂叉、乾闥婆、阿蘇囉、緊那囉、摩虎囉伽，及比丘、比丘尼、優婆塞、優婆夷、人、非人等，各并眷屬，覩佛光明，皆來集會。",
        "translation": "At the time, the Indra and Brahma Kings, the Mahêśvara gods, the sons of the Pure Land gods, the sun, moon, stars, and all the gods, dragons, musicians, gandharvas, asuras, kiṃnaras, mahoragas, monks, nuns, laymen, upāsaka, upāsikā, humans, and nonhumans in 3,000 great one-thousand worlds in other directions, each with his or her retinue, looked upon the Buddha's radiance and gathered here.",
        "source": "T15n0634_001:0476a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等眾，譬如有人髮密修長，將一一髮剪如微塵，如一人髮至千萬人髮亦復如是，以一髮塵為一眾生，是赴會眾復過是數。",
        "translation": "Such a multitude is like a person with close-cropped, long hair who cuts each hair like a tiny speck of dust, and so it is with one person's hair up to 10 million people's hair.",
        "source": "T15n0634_001:0476a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者大目乾連、摩訶俱絺羅、摩訶迦栴延、摩訶迦葉波、摩訶富樓那彌多羅尼子、摩訶須菩提等，知諸大眾雖在會中，而不覩見如來身色及與住處。",
        "translation": "It was then that Venerable Damocandrian, Mahākauṣṭhila, Mahākātyāyana, Mahākāśyapa, Mahāpūrṇa Maitrāyaniputra, and Mahāsupodhi knew that even though they were in the assembly, they didn't see the Tathāgata's physical appearance or abode.",
        "source": "T15n0634_001:0476a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時尊者舍利弗從座而起，至妙吉祥童真菩薩前，白言：「仁者！",
        "translation": "Venerable Śāriputra then got up from his seat and went to Mañjuśrī Bodhisattva and said, \"Sir!",
        "source": "T15n0634_001:0476a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此世尊入是如來智印三摩地，而我等輩云何不能見如來身及與住處？」",
        "translation": "Now, how is it that we can't see the Tathāgata's body and abode when the Bhagavān has entered this samādhi of the seal of wisdom of the Tathāgata?\"",
        "source": "T15n0634_001:0476a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時妙吉祥童真菩薩告舍利弗言：「汝諸聲聞具大智慧，得諸解脫，常修梵行，離諸怖畏，一切人天悉皆恭敬。",
        "translation": "The wonderfully auspicious boy true bodhisattva addressed Śāriputra, \"You śrāvakas possess great wisdom, attain liberation, always cultivate the religious practice, part with fears, and are all respected by humans and gods.",
        "source": "T15n0634_001:0476b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應當各各依自所得三摩地門，以智慧力觀察如來身色住處。」",
        "translation": "You should each rely on the approach of samādhi that you've attained and use the power of wisdom to examine the Tathāgata's abode of body and form.\"",
        "source": "T15n0634_001:0476b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗等即時各各入自所得三摩地門，以智慧力觀察推求如來色身及與住處，遍於三千大千世界微塵剎土，窮盡神力皆不能見。",
        "translation": "Śāriputra and the others then each entered the gate of samādhi that they had attained, and with the power of wisdom they examined and inquired about the Tathāgata's physical body and its abodes, which pervaded a tiny dusty land in a world of 3,000 great one-thousand worlds and could not be seen by using all their supernormal powers.",
        "source": "T15n0634_001:0476b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗白妙吉祥童真菩薩言：「我等依自所得三摩地門，以智慧力觀察推求如來色身及與住處，了不可見。",
        "translation": "Śāriputra then said to Mañjuśrī Bodhisattva, \"We relied on the entrance of samādhi that we had acquired ourselves, and we investigated the Tathāgata's form body and abodes with the power of wisdom, but we couldn't see them.",
        "source": "T15n0634_001:0476b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願仁者為我等輩分別指示，咸令得見！」",
        "translation": "May I ask you, sir, to show them to us and allow us to see them!\"",
        "source": "T15n0634_001:0476b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時妙吉祥童真菩薩告舍利弗言：「汝諸聲聞雖具智慧及與神通，而於如來智印三摩地門不能思惟，故於佛身及所住處不能得見。",
        "translation": "Miaojixiang dongzhen pusa then addressed Śāriputra, \"Even though you śrāvakas possess wisdom and supernormal abilities, you can't contemplate the tathāgata's wisdom-seal samādhi aspect, so you can't see the Buddha's body or where he lives.",
        "source": "T15n0634_001:0476b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0634_001:0476b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸聲聞以差別心，觀視如來色身住處，由此分別自為障礙。",
        "translation": "\"You śrāvakas observe the abode of the Tathāgata's physical body with a discriminating mind, and this discrimination is its own obstruction.",
        "source": "T15n0634_001:0476b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是如來身非分別心所能觀見，若以汝身即如來身，汝等所住即如來住，乃至一切有情之身即如來身，一切有情之所住處即如來住，空有一相自他無二，不舍有為而證無為，不離無為而悟有為，以如是心觀如來身及與住處，爾乃可見。",
        "translation": "The Tathāgata's body is not something that can be observed by a discriminated mind, so if you think that your body is the Tathāgata's body, that your abode is the Tathāgata's abode, that the bodies of all sentient beings are the Tathāgata's body, that the abodes of all sentient beings are the Tathāgata's abodes, that emptiness and existence are one and the same, that self and other are not two, that you don't abandon the existent and realize the nonexistent, that you don't part with the nonexistent and come to understand the existent, and that you observe the Tathāgata's body and its abodes with this kind of mind, then you can see it.",
        "source": "T15n0634_001:0476b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等既用有分別心，欲見如來無相境界，設經無量塵沙劫數莫復能得。」",
        "translation": "Since you use discriminating minds, if you want to see the Tathāgata's markless realm, you couldn't possibly attain it after countless dusty eons.\"",
        "source": "T15n0634_001:0476b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是眾會悲感懊惱，離分別心，安住正念，身心內外猶如虛空寂靜而住。",
        "translation": "The assembly was then overcome with pity and distress, parted with the mind of discrimination, and abided in right mindfulness, mindfully abiding in and out of body and mind like space in a state of stillness.",
        "source": "T15n0634_001:0476b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從禪定起，其心廣大如海汪洋，澄清映徹如淨瑠璃，普觀眾生若身、若土，與諸如來平等不二。",
        "translation": "At the time, the Bhagavān rose from meditative concentration, and his mind was as vast as a vast ocean, clear and reflective like pure lapis lazuli, and he universally observed that all sentient beings, whether bodies or lands, are equal and not different from the tathāgatas.",
        "source": "T15n0634_001:0476b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身相廓然，眾會皆覩。",
        "translation": "The contours of their bodies were so vast that all assemblies could see them.",
        "source": "T15n0634_001:0476b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時三千大千世界皆大振動。",
        "translation": "At that moment, the 3,000 great one-thousand worlds are all greatly agitated.",
        "source": "T15n0634_001:0476b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸天心大歡喜，離諸怖畏，於虛空中雨天寶華，其華微妙繽紛而下。",
        "translation": "The hearts of all the gods are overjoyed and freed from fear, and in the sky they rain down celestial jeweled flowers in a profusion of exquisite flowers.",
        "source": "T15n0634_001:0476c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於空中作天妓樂，種種歌詠、上妙音聲、琴瑟、箜篌、琵琶、笙簫，是諸樂器不鼓自鳴，於是會中以為供養。",
        "translation": "In the sky, they created celestial musicians, various songs, wonderful sounds, lutes, harps, lutes, and pianos, all of which sounded on their own without drums, and offered them up as offerings at the assembly.",
        "source": "T15n0634_001:0476c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時舍利弗從座而起，至世尊前曲躬合掌，而白佛言：「大悲世尊！",
        "translation": "Śāriputra then rose from his seat, bowed his head before the Bhagavān, and put his palms together as he said to the Buddha, \"Great compassionate Bhagavān!",
        "source": "T15n0634_001:0476c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所入智印三昧，而我等輩無所覺知。",
        "translation": "\"The Tathāgata enters the wisdom-seal samādhi, but we don't know what it is.",
        "source": "T15n0634_001:0476c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各以神通入自所得三摩地門，以智慧力周遍推求如來身色及與住處，杳不可得，不能了知。",
        "translation": "Each of us used our supernormal powers to enter the samādhi gate that we had attained, and we used our wisdom powers to scrutinize the Tathāgata's body and form and abode, but they were nowhere to be found, and we couldn't understand them.",
        "source": "T15n0634_001:0476c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是我等輩先自所得三摩地門及智慧力狹劣短促，未得如來無相正智自在法門。",
        "translation": "Because our group's previously acquired samādhi gate and the power of wisdom were so narrow and weak, we hadn't yet attained the Tathāgata's approach of formless correct wisdom and sovereignty.",
        "source": "T15n0634_001:0476c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願世尊大慈悲力深加憐愍，與我等輩而為開導，於佛知見定慧法門使令悟入，於無相境任運現前。」",
        "translation": "May the Bhagavān have profound compassion for us and guide us to the Dharma gate of Buddha's knowledge, vision, concentration, and wisdom so that we might awaken to it and freely manifest it in the signless realm.\"",
        "source": "T15n0634_001:0476c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告舍利弗：「我入如是智印三摩地，非汝聲聞及諸緣覺所得智慧之所了解及能推求，唯佛與佛乃能知之。",
        "translation": "It was then that the Buddha addressed Śāriputra, \"I've entered this wisdom-seal samādhi, and it's not something you śrāvakas and pratyekbuddhas understand or can discern based on the wisdom they acquire; only the Buddha and the buddhas can know it.",
        "source": "T15n0634_001:0476c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T15n0634_001:0476c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來色身由無動心，離諸希求，捨分別緣，絕自他相，凝然湛寂，勝智功力之所任持，大定如如為一體相。",
        "translation": "The Tathāgata's physical body is composed of an unmoving mind, free of longing, free of discriminating objects, free of the characteristics of self and other, and firmly and calmly maintained by the power of superior wisdom, with great concentration and thusness as its single characteristic.",
        "source": "T15n0634_001:0476c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若汝聲聞及諸緣覺唯求自利，不樂利他，所證法門及智慧境未解融通，自他隔閡，空有互違，於佛、如來法空無相智印三昧難解難入。",
        "translation": "If you śrāvakas and pratyekbuddhas seek only to improve yourselves and don't enjoy improving others, you don't understand and blend the Dharma teachings and objects of wisdom that you've realized, and you're separated from self and others, and you contradict emptiness and existence, so it's difficult to understand and difficult to enter the samādhi of the Buddha and Tathāgata's wisdom seal of Dharma emptiness and signlessness.",
        "source": "T15n0634_001:0476c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等於佛身相及與住處不可得見，亦不了知。」",
        "translation": "Therefore, you can't see the Buddha's body and form or abode, nor do you understand them.\"",
        "source": "T15n0634_001:0476c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說大乘智印經卷第一",
        "translation": "Foshuo dasheng Zhizin jing roll 1",
        "source": "T15n0634_001:0476c24_0",
        "is_bad_quality": false
    }
]