[
    {
        "source_sentence": "佛說弘道廣顯三昧經卷第三",
        "translation": "Foshuo hongdao guangxian sanmei jing, vol. 3",
        "source": "T15n0635_003:0498c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏三藏竺法護譯",
        "translation": "Translation of the Tripiṭaka of the Yuezhi Family of the Western Jin Dynasty by Zhu Fahou",
        "source": "T15n0635_003:0498c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信值法品第六",
        "translation": "Sixth Chapter of Faith Worthy Dharma",
        "source": "T15n0635_003:0498c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿耨達龍王心甚悅豫，又及龍王五百太子宿發無上正真道意，聞佛說是，尋即皆得柔順法忍，忻心無量各樂供養，輒為如來施飾寶蓋，進上世尊！",
        "translation": "At the time, the Anavatapta-nāga-rāja was so pleased that he and the five hundred nāga-rāja princes who had long since arisen from the intention to pursue the unsurpassed true path heard the Buddha teach this, and they all immediately attained the patience of the pliant Dharma, were filled with countless intentions to make offerings, and readily decorated their jeweled canopies for the Tathāgata, advancing to the Bhagavān!",
        "source": "T15n0635_003:0498c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同時白佛言：「聖師如來、至真、正覺！",
        "translation": "At the same time, he said to the Buddha, \"Noble Tathāgata, Most True, Perfectly Enlightened!",
        "source": "T15n0635_003:0498c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為吾等故出現生世。",
        "translation": "It's for our sake that we appear in the world of birth.",
        "source": "T15n0635_003:0498c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何則然者？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0498c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令吾等聞普信道品。",
        "translation": "Let's hear the words of the path of universal faith.",
        "source": "T15n0635_003:0498c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得聞是已，意而無惓不有懈退，亦無驚恐，聞以加重專心習行，樂聽無厭如是像法也。",
        "translation": "After hearing it, we will have no laziness of mind, no laziness, and no fear, and we will intensify our concentration and practice after hearing it, gladly listening without tiring to such things as this.",
        "source": "T15n0635_003:0498c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又惟，如來！",
        "translation": "Again, Tathāgata!",
        "source": "T15n0635_003:0498c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解說菩薩云何得值諸佛世尊？」",
        "translation": "How does a bodhisattva come to meet the world honored buddhas?\"",
        "source": "T15n0635_003:0498c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來告曰：「諸賢者等勤念受聽，吾當廣說。」",
        "translation": "The Tathāgata told them, \"Good men, please diligently remember to listen, and I will explain it in detail.\"",
        "source": "T15n0635_003:0498c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸太子言：「唯思樂聞，彼諸上士受世尊教。」",
        "translation": "The princes said, \"Only consider and delight in hearing that the best of them accept the Bhagavān's teaching.\"",
        "source": "T15n0635_003:0498c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來告曰：「樹信賢者興值有佛。",
        "translation": "The Tathāgata told them, \"Good men who have faith will rise to meet the Buddha.",
        "source": "T15n0635_003:0498c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為信？",
        "translation": "What's meant by faith?",
        "source": "T15n0635_003:0498c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信謂：正士修諸明法，奉之為先。",
        "translation": "Belief says, \"Correct people cultivate knowledgeable qualities and hold them in high regard.",
        "source": "T15n0635_003:0498c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂明法？",
        "translation": "What's meant by insightful dharmas?",
        "source": "T15n0635_003:0498c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：依行應不離德本，習求樂賢慕隨聖眾，勤心樹信志無勞疲，思僥聞法拔棄陰、蓋，順習於道，得法利養以施周慧，戒與不戒濟接等與，在諸恚怒而常有悅，勤樂普智心無懈退，信佛不休、未曾亂法、悅心聖眾，志道難動喜樂正真，而離貢高於眾自卑，常有等心諸處無著，終捨身命不造惡行，修立質信言行相應，等過於著心無垢穢，身口意行順隨聖化，明了諸事得為清淨，知足無貪所行應淨，曉入智幻習求慧根，依順七財修念誠信，根、力以備而行正見，所受師友謙恪禮敬，安足易養數詣法會，心無退厭有患生死，示無為德勤心精進，求昇普智以弘道化，於如來法志樂出家，修諸無數梵清淨行，造立慈悲救彼眾生。",
        "translation": "曰：依行應不離德本，習求樂賢慕隨聖眾，勤心樹信志無勞疲，思僥聞法拔棄陰、蓋，順習於道，得法利養以施周慧，戒與不戒濟接等與，在諸恚怒而常有悅，勤樂普智心無懈退，信佛不休、未曾亂法、悅心聖眾，志道難動喜樂正真，而離貢高於眾自卑，常有等心諸處無著，終捨身命不造惡行，修立質信言行相應，等過於著心無垢穢，身口意行順隨聖化，明了諸事得為清淨，知足無貪所行應淨，曉入智幻習求慧根，依順七財修念誠信，根、力以備而行正見，所受師友謙恪禮敬，安足易養數詣法會，心無退厭有患生死，示無為德勤心精進，求昇普智以弘道化，於如來法志樂出家，修諸無數梵清淨行，造立慈悲救彼眾生。",
        "source": "T15n0635_003:0498c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "志存反復，其有報恩及不報者，等接護之心無適莫。",
        "translation": "Their aspirations are repeated, and those who repay kindnesses and those who don't repay them are equally accepted and protected without fail.",
        "source": "T15n0635_003:0499a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不自念利常悅彼恭，忍調之行以悉備足，目見無惡不背說人，內性以寂、志於閑居、心常樂靜，專念習法而無諍訟，等己彼過。",
        "translation": "He's not mindful of his own benefit, always pleases them with respect, fully completes the practice of patience, sees no evil in his eyes, doesn't speak ill of others, is still in his nature, aims for a quiet life, always keeps his mind happy and still, focuses on cultivating the Dharma without disputing it, and equals his own faults with those of others.",
        "source": "T15n0635_003:0499a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求備戒具，集合定行，勤謹於道，斯謂賢者行應俗信。",
        "translation": "Seeking to complete the observance of precepts, assemble his practice of concentration, and diligently pursue the path, this is called a good person whose practice deserves conventional faith.",
        "source": "T15n0635_003:0499a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹信如是，此謂興值佛世者也。",
        "translation": "Such a tree of faith is called someone who's excited about the Buddha's life.",
        "source": "T15n0635_003:0499a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又賢者等！",
        "translation": "\"And so it is, good men!",
        "source": "T15n0635_003:0499a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其於世俗造信無忘，是謂興信值佛世也。",
        "translation": "When they create faith in the conventional world and don't forget it, this is called generating faith that's worthy of the Buddha world.",
        "source": "T15n0635_003:0499a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又賢者等！",
        "translation": "Also, good men!",
        "source": "T15n0635_003:0499a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂俗信？",
        "translation": "What is meant by conventional faith?",
        "source": "T15n0635_003:0499a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有信者：信諸法空以離妄見、信知諸法以為無想而離念應、信知諸法悉皆無願不有去來；信知諸法無識無念，靜身口意寂無有識；信知諸法以為離欲，無我、人、壽命；信知諸法信知本無去來自然；信知諸法真際無跡如本無跡；信知諸法已皆自然等若空跡；信知諸法而依法性；信知諸法等過三世；信知諸法欲處邪見而皆悉盡，信法無著以離本癡本無清淨；信知諸法心常清淨，亦不興起客欲之垢；信知諸法無所觀見；信諸法護等斷眾行，信法無我以過喜怒；信諸法無心無形像而不可獲；信諸法偽如握空拳誘調小兒；信法無欺不有上下無所捨置；信諸法虛若芭蕉樹；信法自由如常寂靜；信法無審不住三處；信法永無不有所生；信法若空以等無數；信知諸法若如泥洹常自寂靜。",
        "translation": "其有信者：信諸法空以離妄見、信知諸法以為無想而離念應、信知諸法悉皆無願不有去來；信知諸法無識無念，靜身口意寂無有識；信知諸法以為離欲，無我、人、壽命；信知諸法信知本無去來自然；信知諸法真際無跡如本無跡；信知諸法已皆自然等若空跡；信知諸法而依法性；信知諸法等過三世；信知諸法欲處邪見而皆悉盡，信法無著以離本癡本無清淨；信知諸法心常清淨，亦不興起客欲之垢；信知諸法無所觀見；信諸法護等斷眾行，信法無我以過喜怒；信諸法無心無形像而不可獲；信諸法偽如握空拳誘調小兒；信法無欺不有上下無所捨置；信諸法虛若芭蕉樹；信法自由如常寂靜；信法無審不住三處；信法永無不有所生；信法若空以等無數；信知諸法若如泥洹常自寂靜。",
        "source": "T15n0635_003:0499a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，賢者！",
        "translation": "Thus, good man!",
        "source": "T15n0635_003:0499b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其於世俗興起是信，斯謂造信而值佛法。",
        "translation": "This is called creating faith that's worthy of the Buddha's teaching when it arises from worldly belief.",
        "source": "T15n0635_003:0499b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復賢者！",
        "translation": "\"Again, good man!",
        "source": "T15n0635_003:0499b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有信值佛法名者，此則名曰諸法都無起之謂也。",
        "translation": "\"If someone has faith in the value of the Buddha's name for the teaching, then this is called the condition in which all dharmas are unarisen.",
        "source": "T15n0635_003:0499b10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0499b11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不色生故、不色無生，化轉之習，不痛、想、行、識，已無識起，不以眼、耳、鼻、舌、身、意，無起轉習。",
        "translation": "Because form doesn't arise and form doesn't arise, the habit of transformation doesn't cause pain, perception, volition, or consciousness, and there's no consciousness that arises anymore, and it doesn't cause the eyes, ears, nose, tongue, body, or mind to be without arising and transforming habits.",
        "source": "T15n0635_003:0499b11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不身起轉、不癡有無、不生老死，有無起故。",
        "translation": "He doesn't undergo physical arising and transformation, doesn't become deluded about existence and nonexistence, and doesn't undergo birth, aging, and death, because existence and nonexistence arise.",
        "source": "T15n0635_003:0499b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如值佛世，不起有生亦不起滅；又復無起習於無滅，不以正意無志意習而值佛世。",
        "translation": "Just as in the Buddha's lifetime, there's no arising, there's no arising, and there's no arising and accumulation in the absence of arising and accumulation, so he doesn't enter the Buddha's lifetime with right intention and without the accumulation of will.",
        "source": "T15n0635_003:0499b14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總要言之，亦不以三十七道品法起無起習；亦不以道無生之習，不以起慧，亦不滅慧，不慧無慧，無二之習，如值佛世。」",
        "translation": "To sum up, it's not with the accumulation of the thirty-seven factors of the path that there's neither arising nor nonarising, nor with the accumulation of the path that's nonarising, nor with the accumulation of wisdom that arises or ceases, nor with the accumulation of wisdom that doesn't arise or doesn't arise, nor with the accumulation of wisdom that's nondual, that one is thus worthy of the Buddha-age.\"",
        "source": "T15n0635_003:0499b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當說值信佛品世時，無熱龍王五百太子皆悉逮得柔順法忍。",
        "translation": "When it was said that they were worthy of the Buddha's time, the five hundred princes of the dragon king Wuhei all attained the supple tolerance of the Dharma.",
        "source": "T15n0635_003:0499b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊復說頌曰：「興信值佛世，　　而習於不生；　其無向信者，　　斯不值佛世。",
        "translation": "The Bhagavān then spoke another verse, \"Arouse faith that's worthy of the Buddha world, but the habituation is unarisen; those who don't aspire to faith don't reach the Buddha world.",
        "source": "T15n0635_003:0499b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修信謂最上，　　從致清淨法；　行質有報應，　　不違厥所修。",
        "translation": "Cultivating faith is the highest, which brings about pure dharmas; its quality of practice is rewarded, and it doesn't contradict what's cultivated.",
        "source": "T15n0635_003:0499b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　信習諸賢聖，　　勤隨常禮敬；　心不有懈退，　　此信之所行。",
        "translation": "Faith cultivates the cultivation of good men and sages, always venerating them with diligence and following them, and not being lazy in mind, which is the practice of faith.",
        "source": "T15n0635_003:0499b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勤行聽法說，　　陰、蓋不能動；　從信得致道，　　行逮於柔順。",
        "translation": "Diligently practicing and listening to the teaching of the Dharma, the aggregates and hindrances can't be moved; from faith they attain the path, and their actions are accomplished with gentleness.",
        "source": "T15n0635_003:0499b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以法所得財，　　轉惠普周濟；　護戒與毀戒，　　行信而等施。",
        "translation": "With the wealth gained from the Dharma, he extends universal benefit, protects precepts and violates them, and conducts himself with faith and equal charity.",
        "source": "T15n0635_003:0499c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能悅諸恚怒，　　道心不懈惓；　勤求大乘法，　　有信悅向眾。",
        "translation": "He pleases anger, doesn't relent in his attitude of enlightenment, diligently seeks the great vehicle teaching, and has faith that pleases all people.",
        "source": "T15n0635_003:0499c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　永離大貢高，　　志常自卑下；　所在無所著，　　立信相如是！",
        "translation": "Forever free from great pride, his resolve is always low; his place is unattached, and he establishes faith in this way!",
        "source": "T15n0635_003:0499c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　志信不惜身，　　終不造惡行；　守善無妄語，　　言行常相應。",
        "translation": "Wishing to believe and not shying away from body, they never commit bad acts; keeping their goodness and not speaking falsely, their words and deeds are always in accord.",
        "source": "T15n0635_003:0499c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悅信以過界，　　樂行於無心；　身口意清淨，　　習隨聖所護。",
        "translation": "Delighting in faith that transcends the realm and delighting in mindless practice, their body, speech, and thought are purified, and they habitually follow the protection of sages.",
        "source": "T15n0635_003:0499c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有信行內淨，　　常為慧所將；　知身之要本，　　求問宣所聞。",
        "translation": "With faith and inner purity in their practice, they're always bound by wisdom; knowing the essentials of their bodies, they seek to question and proclaim what they've heard.",
        "source": "T15n0635_003:0499c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　等念於七財，　　得力、根以足；　長離眾邪見，　　志常習等行。",
        "translation": "Equally mindful of the seven assets, he attains the strength and faculties to fulfill them, is free of mistaken views, and always aims to cultivate equal conduct.",
        "source": "T15n0635_003:0499c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　禮恪有悅心，　　敬事如其師；　心宿善虔恭，　　知足無所遺。",
        "translation": "With a mind that's respectful and pleasant, he serves his teacher, remains well-intentioned and respectful, and knows there's nothing left to lose.",
        "source": "T15n0635_003:0499c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其心常無念，　　所志唯道法；　有厭生死者，　　引示無為德。",
        "translation": "Their mind is always without thought, and their only aim is the path; those who are weary of birth and death are shown the virtue of doing nothing.",
        "source": "T15n0635_003:0499c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　脫之所當行，　　唯常求悅心；　速離於是世，　　修梵行無惓。",
        "translation": "They should practice liberation only by always seeking to please their minds, quickly depart from this world, and cultivate the religious practice without tire.",
        "source": "T15n0635_003:0499c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　懷受諸眾生，　　救彼無利望；　當報所受恩，　　悅信當勤求。",
        "translation": "He harbors the hope of saving sentient beings without benefit; he should repay the kindnesses he's received and diligently seek to please and believe in them.",
        "source": "T15n0635_003:0499c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　己利不以悅，　　亦不嫉彼供；　仁忍而悉備，　　無諂調質直。",
        "translation": "He doesn't seek to please others for his own benefit, and he doesn't envy their offerings; he is fully prepared with kindness and tolerance, and he is straightforward without flattery or agitation.",
        "source": "T15n0635_003:0499c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行信目所見，　　不背說人短；　根寂性安敏，　　志悅樂閑居。",
        "translation": "He acts with faith and sees with his eyes, doesn't criticize others' shortcomings, has tranquility and sensitivity, and enjoys quiet living with joyful intentions.",
        "source": "T15n0635_003:0499c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其心無憒閙，　　自勵備恩行；　先順不有諍，　　內省剋己過。",
        "translation": "Without agitation in his mind, he encourages himself to cultivate good conduct, submitting to no quarrels in advance and reflecting on his faults.",
        "source": "T15n0635_003:0499c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勤求具戒行，　　專習於定道；　悅信慕樂行，　　信者相如是！",
        "translation": "He diligently seeks to cultivate the practice of precepts, devotes himself to the path of concentration, and enjoys the practice of faith and adoration, and this is the mark of a believer!",
        "source": "T15n0635_003:0499c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其過欲信者，　　彼行而解此；　興法不有諍，　　深妙佛所說。",
        "translation": "Those who want to believe in their faults will practice and understand them, creating no disputes about the Dharma and profoundly subtle Buddha teachings.",
        "source": "T15n0635_003:0500a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　誠信信於空，　　彼都無眾見；　諸法無有想，　　不意離眾念。",
        "translation": "With sincere faith and belief in emptiness, they all see nothing, conceive nothing of the qualities, and don't intend to part with many thoughts.",
        "source": "T15n0635_003:0500a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當除斷諸念，　　覺了去來事；　法求無著作，　　不有於身心。",
        "translation": "They should remove mindfulness, realize what happened in the past and future, and seek the lack of works of the Dharma, which don't exist in body and mind.",
        "source": "T15n0635_003:0500a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　信為無欲法，　　離我、人、壽命；　信者解無本，　　得至不二處。",
        "translation": "Believing in a desireless dharma, he parts with self, person, and life; believing this, he understands that there's no root, and he attains the nondual state.",
        "source": "T15n0635_003:0500a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其本無有積，　　體無若虛空；　諸法信亦然，　　便與法性同。",
        "translation": "Its origin is without accumulation, and its body is nothing like space; so is faith in all dharmas, and it's the same as the nature of dharmas.",
        "source": "T15n0635_003:0500a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　等過於三世，　　諸法無有漏；　欲處及與貪，　　樂信無受見。",
        "translation": "They're equal to and surpass the three worlds, and the dharmas are uncontaminated; they're pleasant, faithful, and unacquired views in the realm of desire and greed.",
        "source": "T15n0635_003:0500a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法不有著，　　其本明清淨；　客欲無能蔽，　　不處心有住。",
        "translation": "All dharmas lack attachment, their origin is clear and pure, objective desires don't obscure them, and there's no place for the mind to abide.",
        "source": "T15n0635_003:0500a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法不可見，　　因緣而無起；　常觀於高行，　　不受所住短。",
        "translation": "All things are invisible, cause and condition, and nothing arises; always observing lofty behavior, they aren't subject to the shortcomings of their abode.",
        "source": "T15n0635_003:0500a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無合不有離，　　脫者無合同；　信悅於空法，　　愚之所可惑。",
        "translation": "There's no union and no separation, and those who are liberated have no contract; faith and joy in the teachings of emptiness are no delusion for the foolish.",
        "source": "T15n0635_003:0500a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　湛泊意無起，　　欺偽如芭蕉；　口言而自然，　　無去亦不有。",
        "translation": "With a calm, collected mind that arises from nothing, he deceives like a plantain; his words come naturally, leaving nothing and existing nothing.",
        "source": "T15n0635_003:0500a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法無所有，　　所見皆不要；　其法若虛空，　　等緣無有數。",
        "translation": "All dharmas are nonexistent, and what's seen is rejected; they are like space, and their equivalence has no number.",
        "source": "T15n0635_003:0500a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法如泥洹，　　本無不可見；　信悅而行此，　　解了身虛空。",
        "translation": "All dharmas are like nirvāṇas, which are inherently invisible; believing and practicing them with joy, they understand their bodies as empty.",
        "source": "T15n0635_003:0500a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有如是信，　　菩薩及凡人；　彼則值奉佛，　　所處無有惡。",
        "translation": "With such faith, bodhisattvas and ordinary people then value and serve the Buddha, and there's nothing bad about where they are.",
        "source": "T15n0635_003:0500a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不以造色行，　　得應值佛世；　無色不有處，　　不來亦不去。",
        "translation": "Not acting based on the creation of form, they're worthy of the Buddha world; there's no form and no place, and they don't come or go.",
        "source": "T15n0635_003:0500a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於色無有生，　　不滅亦無住；　當來無所至，　　值佛廣演說。",
        "translation": "There's no birth in form, and it doesn't cease or abide; there's no place to which they'll come when the Buddha explains it in detail.",
        "source": "T15n0635_003:0500b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五陰亦如是，　　化習轉無生；　值佛當敢說，　　慧達諸菩薩！",
        "translation": "'The five aggregates are likewise, transformative habits are unarisen,' the Buddha will dare to say, 'Wisdom reaches the bodhisattvas!'",
        "source": "T15n0635_003:0500b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其身及諸情，　　亦習以無生；　佛興以無生，　　常救諸墮生。",
        "translation": "Their bodies and beings are also accustomed to nonproduction, and the Buddha arises from that nonproduction to always save those who fall into birth.",
        "source": "T15n0635_003:0500b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　癡本無有生，　　生死亦如斯！",
        "translation": "Delusion originally has no birth, and so does birth-and-death!",
        "source": "T15n0635_003:0500b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是緣如本無，　　從法而有佛！",
        "translation": "These conditions are as originally nonexistent, and from the Dharma comes the Buddha!",
        "source": "T15n0635_003:0500b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無起不有生，　　不滅無有住；　是以知無處，　　處亦不可見。",
        "translation": "Nothing arises, nothing is produced, and nothing ceases without abiding; therefore, you know there's no place, and the place can't be seen.",
        "source": "T15n0635_003:0500b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斯亦不自生，　　與佛而博演；　無志不有住，　　是亦佛所轉。",
        "translation": "Nothing arises of its own accord, and it's expounded by the Buddha; without intention or abiding, it's also transformed by the Buddha.",
        "source": "T15n0635_003:0500b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸種亦如是，　　佛種順如法；　斯類亦起無，　　如佛而等與。",
        "translation": "Thus are the varieties, the Buddha's varieties that conform to the Dharma, and these varieties also arise into nonexistence, just as the Buddha does.",
        "source": "T15n0635_003:0500b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其行如是者，　　佛興為若此；　悅信斯大處，　　其限不可量。」",
        "translation": "Such is their practice, such is the rise of the Buddha, and the limit of their joy and faith is immeasurable.\"",
        "source": "T15n0635_003:0500b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉法輪品第七",
        "translation": "The Seventh Chapter of the Turning of the Wheel of the Dharma",
        "source": "T15n0635_003:0500b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告太子等：「又諸賢者！",
        "translation": "It was then that the Bhagavān addressed the prince and others, \"Good men!",
        "source": "T15n0635_003:0500b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩得轉法輪？",
        "translation": "What does it mean for a bodhisattva to attain the turning of the wheel of the Dharma?",
        "source": "T15n0635_003:0500b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有布露如是像法樂說句義，受持不忘修而行之，諸有不發大悲意者，為興普智隨順眾願，而為說之廣宣布示，志不有惓忽棄利養，勸念順時受持護行，斯謂菩薩應轉法輪。",
        "translation": "If someone discloses such likenesses, readily explains their phrases and meanings, accepts and doesn't forget them, cultivates and practices them, and there are those who don't have a greatly compassionate intention to arouse universal knowledge and accord with the vows of all people, then they explain them and explain them in detail, don't have an earnest intention to neglect gain and benefit, and encourage mindfulness and timely maintenance and protection of practice, this is called a bodhisattva who should turn the wheel of the Dharma.",
        "source": "T15n0635_003:0500b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又若如來所轉法輪，而其法輪，行像入德當粗剖說。",
        "translation": "\"Furthermore, if the Tathāgata turns the wheel of the Dharma, then his wheel of the Dharma, practice, images, and virtues will be explained in rough detail.",
        "source": "T15n0635_003:0500b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以起法亦不滅法，不以凡夫下劣行法，亦復不以賢聖法故而轉法輪。",
        "translation": "It doesn't turn the Dharma wheel because of the arising or ceasing of dharmas, because of the inferior ways of worldlings, and because of the noble dharmas as well.",
        "source": "T15n0635_003:0500b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，不中斷絕等斷善惡，彼以是故為無斷輪。",
        "translation": "That Dharma wheel isn't interrupted or cut off, and it equally cuts off good and evil, which is why it's the uninterrupted wheel.",
        "source": "T15n0635_003:0500b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪因緣之起，不起無起而有其轉，以斯之故為無起輪。",
        "translation": "Furthermore, when the wheel of the Dharma arises from causes and conditions, it doesn't arise and has no arising, and yet it turns, which is why it's the wheel of no arising.",
        "source": "T15n0635_003:0500b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，不以眼色、耳聲、鼻香、舌味、身更、心法諸情轉隨有轉，以此之故彼無二輪，若有二者則非法輪。",
        "translation": "Also, that Dharma wheel doesn't depend on the form of the eye, the sound of the ear, the smell of the nose, the taste of the tongue, the movement of the body, or the mental factors that follow the movement of feelings, and because of this there are no two wheels, and if there were two, then it wouldn't be a Dharma wheel.",
        "source": "T15n0635_003:0500b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，亦不過去、當來、現在所著而轉，是無著輪。",
        "translation": "Moreover, that Dharma wheel doesn't turn based on attachments from the past, future, or present, which is the nonattachment wheel.",
        "source": "T15n0635_003:0500c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，不我見轉，非人、命壽所住而轉，是為空輪。",
        "translation": "Also, that Dharma wheel doesn't turn based on views of self and doesn't turn based on the abiding of persons or life spans, which is the wheel of emptiness.",
        "source": "T15n0635_003:0500c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，不識行想滅念之轉，是無想輪。",
        "translation": "Also, that Dharma wheel doesn't turn with consciousness, volition, perception, and cessation in mind, which is the contemplationless wheel.",
        "source": "T15n0635_003:0500c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，不於欲界形無形界所望而轉，是無願輪。",
        "translation": "Also, that Dharma wheel doesn't turn based on desires in the form and formless realms, which is the wishless wheel.",
        "source": "T15n0635_003:0500c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，不計眾生有異而轉，不處二法，是凡人法、是聖戒法，是聲聞法、是緣覺法、是菩薩法、是為佛法，彼以是故為無異輪。",
        "translation": "That Dharma wheel also turns without discriminating between the existence and differences of sentient beings and doesn't discriminate between two things, namely, mortal things, noble moral things, śrāvaka things, pratyekabuddha things, bodhisattva things, and Buddha things, which is why it's the wheel of no difference.",
        "source": "T15n0635_003:0500c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其法輪，不以有住法輪而轉，以斯之故為無住輪也。",
        "translation": "Furthermore, that Dharma wheel doesn't turn based on an abiding Dharma wheel; it's therefore an unabiding wheel.",
        "source": "T15n0635_003:0500c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「法輪名乎，諸賢者等！",
        "translation": "\"What's the name of the wheel of the Dharma, you good men!",
        "source": "T15n0635_003:0500c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真諦正輪，常無毀故；要義之輪，等三世故；無處之輪，諸習見處以等過故；寂寞靜輪，身心無著不可見轉意識離故；無樔之輪，五道不處；審諦之輪，無諦現故；行信之輪，等化眾生用無欺故；不可盡輪，字無字故；法性之輪，以其諸法依法性故；本積諦輪，本無積故；本無之輪，如本無故；無所造輪，無念漏故；無數之輪，導至聖故；如空之輪，明見內故；無想之輪，無外念故；無願之輪，無內外故；不可得輪，修過度故。",
        "translation": "真諦正輪，常無毀故；要義之輪，等三世故；無處之輪，諸習見處以等過故；寂寞靜輪，身心無著不可見轉意識離故；無樔之輪，五道不處；審諦之輪，無諦現故；行信之輪，等化眾生用無欺故；不可盡輪，字無字故；法性之輪，以其諸法依法性故；本積諦輪，本無積故；本無之輪，如本無故；無所造輪，無念漏故；無數之輪，導至聖故；如空之輪，明見內故；無想之輪，無外念故；無願之輪，無內外故；不可得輪，修過度故。",
        "source": "T15n0635_003:0500c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸賢者！",
        "translation": "\"And you, good men!",
        "source": "T15n0635_003:0500c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其如來者，以此法輪轉之眾生諸意行也，其轉不轉，彼不可得，法無所捨。」",
        "translation": "The Tathāgata is the one who acts on the intentions of sentient beings who turn the wheel of the Dharma, which turns and doesn't turn, which is unobtainable, and which has no abandonment of the Dharma.\"",
        "source": "T15n0635_003:0500c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊！",
        "translation": "At that point, Bhagavān!",
        "source": "T15n0635_003:0500c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是轉法輪品之時，天、龍、鬼、人及諸種神欣心踊躍，顯光讚揚如來斯法，皆同聲曰：「善哉世尊！",
        "translation": "When this chapter of the turning of the wheel of the Dharma was taught, gods, dragons, ghosts, and other kinds of spirits rejoiced and roused with joy, shining brightly in praise of this teaching of the Tathāgata's, and all said with one voice, \"Good, Bhagavān!",
        "source": "T15n0635_003:0500c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚為難值，如來示說轉此法輪，聞者奉行則應法輪，是法名轉空虛之輪。",
        "translation": "It's extremely difficult to attain, so the Tathāgata shows and explains that turning this wheel of the Dharma and those who hear and practice it should be the wheel of the Dharma, which is called turning the wheel of emptiness.",
        "source": "T15n0635_003:0500c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸已過佛及與當來并諸現在，悉由是法。",
        "translation": "It's the Dharma that turns the wheel of space for all past buddhas, future ones, and all present ones.",
        "source": "T15n0635_003:0500c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有信者斯則已度，諸行此法，吾等，世尊！",
        "translation": "Those who believe in it will have been saved, and they will practice this teaching, we, the Bhagavān!",
        "source": "T15n0635_003:0500c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "代其勸助彼諸眾生，其興是心常欲聞斯法輪品者，聞當發求是道要行，彼亦不久得轉法輪。」",
        "translation": "Encourage those sentient beings on their behalf who have this constant desire to hear this chapter of the wheel of the Dharma, and when they hear it, they will undertake the essential practice of seeking this path, and they will soon be able to turn the wheel of the Dharma.\"",
        "source": "T15n0635_003:0500c28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是眾中聞是說者，有萬天人皆發無上正真道意，五千菩薩逮得法忍。",
        "translation": "When this was heard among the multitude, ten thousand gods and humans aroused the intention for the unsurpassed true path, and five thousand bodhisattvas attained the tolerance of the Dharma.",
        "source": "T15n0635_003:0501a01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊告諸賢曰：「又正士等！",
        "translation": "The Bhagavān then addressed the good men, \"And you, righteous men!",
        "source": "T15n0635_003:0501a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其護正法、受持正法、營護正法，是謂護法。",
        "translation": "This is called protecting the right teaching, upholding the right teaching, and maintaining the right teaching.",
        "source": "T15n0635_003:0501a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0501a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於永無滅。",
        "translation": "In eternity, there's no cessation.",
        "source": "T15n0635_003:0501a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應是行者，天及世人終不能當。」",
        "translation": "Such a practitioner would never be acceptable to gods and humans.\"",
        "source": "T15n0635_003:0501a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時無憂前白佛言：「又唯，世尊！",
        "translation": "Wuzu then said to the Buddha, \"Yes, Bhagavān!",
        "source": "T15n0635_003:0501a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若斯正士以如是法而得最覺，於其本無不有惑者；又如是像諸正士等當共擁護，所以護者，令諸正士使其速應於此大乘，彼皆行已得轉法輪，又能與識法之大明。",
        "translation": "If these upright gentlemen attain supreme awakening based on such a teaching, there's no one in their original state who doesn't have mental disturbances, and such upright gentlemen as these will be jointly defended, so that they will quickly adapt to this great vehicle, which is practiced by them, and they'll be able to turn the wheel of the Dharma and bring great insight into the teaching of consciousness.",
        "source": "T15n0635_003:0501a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，世尊！",
        "translation": "Therefore, Bhagavān!",
        "source": "T15n0635_003:0501a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以斯等教要法正護使發大乘，以護法師安救敬禮順聽禁戒。」",
        "translation": "These are the essentials of the teaching that correctly safeguard the Dharma and cause the development of the great vehicle, and these are the teachers who safeguard the Dharma, rescue them, honor them, and obey the precepts.\"",
        "source": "T15n0635_003:0501a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊讚歎無憂龍王子曰：「善哉善哉！",
        "translation": "The Bhagavān then praised Prince Aśoka, saying, \"Good, good!",
        "source": "T15n0635_003:0501a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂正士！",
        "translation": "Aśoka Shōshi!",
        "source": "T15n0635_003:0501a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸發大乘為法師故安救擁護，是謂護法，為諸法師營護正法護持正法。",
        "translation": "These are called Dharma protectors who guard the right Dharma and maintain the right Dharma for the Dharma masters who have arisen from the great vehicle and are rescued and defended by them.",
        "source": "T15n0635_003:0501a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復無憂！",
        "translation": "\"Again, no worries!",
        "source": "T15n0635_003:0501a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護正法者得十功德。",
        "translation": "\"Those who protect the right teaching will attain ten virtues.",
        "source": "T15n0635_003:0501a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T15n0635_003:0501a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無其自本降下貢高，又行恭敬，亦無諂行，勤思樂法，志慕習法，專意隨法，行觀於法，樂宣說法，樂修行法，隨所志乘順如說之。",
        "translation": "They don't have their own roots, descend in pride, conduct themselves respectfully, don't engage in flattery, diligently contemplate the teaching, aspire to cultivate the teaching, concentrate their minds on following the teaching, practice and observe the teaching, delight in expounding the teaching, delight in cultivating the teaching, and follow whatever aspirations they have in accordance with what's explained.",
        "source": "T15n0635_003:0501a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十行以護正法。",
        "translation": "These are the ten practices that protect the right teaching.",
        "source": "T15n0635_003:0501a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復無憂！",
        "translation": "\"And again, no sorrow!",
        "source": "T15n0635_003:0501a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十事行護得正法。",
        "translation": "\"There are ten things to do to protect and attain the right teaching.",
        "source": "T15n0635_003:0501a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are the ten?",
        "source": "T15n0635_003:0501a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若族姓子及於族姓女！",
        "translation": "If there are sons of the clan and daughters of the clan!",
        "source": "T15n0635_003:0501a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所聞法師遙禮其處，思樂得奉，來輒敬愛，供給所欲衣被、飲食，護以諸事，往詣謙敬，順聽所說以宣同學，障其說非，常樂稱歎，使譽流布。",
        "translation": "The Dharma teacher they hear from pays distant homage to them, considers it a pleasure to serve them, pays frequent respect to them, offers them whatever clothing and food they desire, guards them with precepts, goes to them humbly, follows what's taught, teaches them to students, hinders their explanations from being false, and always happily praises them so that their reputation spreads.",
        "source": "T15n0635_003:0501a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十事得護正法。",
        "translation": "These are the ten things that make it possible to protect the right teaching.",
        "source": "T15n0635_003:0501a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復無憂！",
        "translation": "\"And again, no sorrow!",
        "source": "T15n0635_003:0501a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四施行得護正法。",
        "translation": "\"There are four ways to protect the right teaching.",
        "source": "T15n0635_003:0501a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are the four?",
        "source": "T15n0635_003:0501a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "筆墨素施給與法師；衣被、飲食、床臥、醫藥供養眾所；若從法師聞所說法，以無諂心而讚善之；所聞受持廣為人說。",
        "translation": "They give alms of writing and ink to the Dharma teacher, make offerings of clothing, food, bedding, and medicine to various places, praise the Dharma teacher without flattery when they hear what he teaches, and explain what they've heard and accepted to others.",
        "source": "T15n0635_003:0501a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四施得持正法。",
        "translation": "These are the four gifts that enable them to maintain the right teaching.",
        "source": "T15n0635_003:0501a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復無憂！",
        "translation": "\"And again, no sorrow!",
        "source": "T15n0635_003:0501a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四精進得持正法。",
        "translation": "\"There are four kinds of exertion that allow you to maintain the right teaching.",
        "source": "T15n0635_003:0501a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are the four?",
        "source": "T15n0635_003:0501b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求法精進，勤廣說法，敬禮法師，若毀法人正法降之亦以精進。",
        "translation": "They make effort to seek the teaching, diligently explain the teaching in detail, revere the teacher of the teaching, and subdue any person who disparages the Dharma and correct teaching with effort.",
        "source": "T15n0635_003:0501b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是四精進得持正法。」",
        "translation": "These four kinds of exertion will enable them to maintain the right teaching.\"",
        "source": "T15n0635_003:0501b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿耨達五百太子，聞佛說是，悅懌欣喜歡樂無量，同聲言：「如來所說甚善無比，解諸狐疑。」",
        "translation": "When the five hundred princes of Anavatapta heard the Buddha say this, they were delighted and rejoiced, rejoiced immeasurably, and said with one voice, \"What the Tathāgata teaches is excellent and incomparable, and it resolves all your misgivings.\"",
        "source": "T15n0635_003:0501b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各以宮室及其官屬，盡以上佛奉給所應，以敬順心而重言曰：「從今，世尊！",
        "translation": "Each of them presented his palace and his officials with as many of the above-mentioned buddhas as were promised, and with reverence and obedience they repeatedly said, \"Now, Bhagavān!",
        "source": "T15n0635_003:0501b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當勤受化永常無惓，至於如來無為之後，佛之所說是像寶法，當共敬受是經要品，求索通達勸進修行。",
        "translation": "They should diligently accept the teaching as eternal and untiring, and then, after the Tathāgata's inaction, the Buddha's teaching will be like a precious dharma that should be revered and accepted by all as an essential part of the sūtra, which should be sought, comprehended, and encouraged to practice.",
        "source": "T15n0635_003:0501b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯則，世尊！",
        "translation": "Thus, Bhagavān!",
        "source": "T15n0635_003:0501b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等至願，又若如來無為之後，吾等聖尊在所國邑，當共同心供養舍利，護奉禮敬至於現滅也。」",
        "translation": "It is our firm wish that, after the Tathāgata's inactivity, we noble ones will make offerings to the Śāriputra with a common heart and mind, and we will guard, honor, and venerate it until its present disappearance.\"",
        "source": "T15n0635_003:0501b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是賢者耆年迦葉謂諸太子：「又賢目等！",
        "translation": "Thereupon, the good elder Kāśyapa addressed the princes, \"Good eyes!",
        "source": "T15n0635_003:0501b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如仁輩言，獨欲全完供養如來神身舍利。",
        "translation": "\"Suppose you people say that you alone want to fully and completely offer the Tathāgata's spiritual body as a relic.",
        "source": "T15n0635_003:0501b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等是言，多斷眾生諸德之本，障蔽明淨翳道至化，使興是言。",
        "translation": "Such words from you often cut off the roots of virtue in sentient beings and block the insight and purity that obscure the path to its ultimate transformation.",
        "source": "T15n0635_003:0501b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何則然者？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0501b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若如來本始造願，使留舍利布如芥子，為諸眾生降大悲故，何得全完而獨供養耶？」",
        "translation": "Furthermore, if the Tathāgata had originally vowed to preserve the relics spread like a mustard seed and to subdue great compassion for all sentient beings, how could he have completely finished them and offered them up alone?\"",
        "source": "T15n0635_003:0501b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼正士等即答賢者大迦葉曰：「唯然，迦葉！",
        "translation": "Those upright gentlemen then answered that good man Mahākāśyapa, \"Yes, Kāśyapa!",
        "source": "T15n0635_003:0501b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿以聲聞所有智限而限如來深邃無極明達之慧。",
        "translation": "Don't limit the Tathāgata's profound and infinitely insightful wisdom by thinking it's limited by the knowledge of the direct disciples.",
        "source": "T15n0635_003:0501b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0501b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來者，有普智心一切之見，處以神足感動變化。",
        "translation": "\"Suppose the Tathāgata has omniscience and omniscient views, and he acts with miraculous powers to effect change.",
        "source": "T15n0635_003:0501b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其興念，能使三千大千世界天、龍、鬼神，各於宮殿普令完全安置舍利，使各念言：『吾獨供養如來舍利，其餘者不。』",
        "translation": "If he gives rise to that thought, he can cause gods, dragons, and spirits throughout the 3,000 great one-thousand worlds to completely place the relics in their palaces, causing each to think, 'I alone will make offerings to the Tathāgata's relics; the others won't.'",
        "source": "T15n0635_003:0501b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復迦葉！",
        "translation": "Again, Kāśyapa!",
        "source": "T15n0635_003:0501b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如世尊無為之後，隨眾生心應置舍利。",
        "translation": "\"If the Bhagavān had done nothing, he would have placed relics according to the minds of sentient beings.",
        "source": "T15n0635_003:0501b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復迦葉！",
        "translation": "Again, Kāśyapa!",
        "source": "T15n0635_003:0501b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來德，至阿迦膩吒天上立置舍利，其如芥子，能普明照一天地內。",
        "translation": "Suppose the Tathāgata deems it appropriate to go up to Akaniṣṭha Heaven and place a relic there, like a mustard seed, that can shine brightly throughout the whole sky and earth.",
        "source": "T15n0635_003:0501b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是佛世尊神威變化感動力也。」",
        "translation": "It's the result of the power of the Bhagavān's miraculous transformation.\"",
        "source": "T15n0635_003:0501b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "決諸疑難品第八",
        "translation": "Resolving Doubts and Questions [Chapter 8]",
        "source": "T15n0635_003:0501b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時賢者須菩提曰：「諸族姓子！",
        "translation": "It was then that the good man Subhūti said, \"Sons of the clans!",
        "source": "T15n0635_003:0501b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如來者為滅度耶？」",
        "translation": "And does the Tathāgata cease to exist?\"",
        "source": "T15n0635_003:0501b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「須菩提！",
        "translation": "He said, \"Subhūti!",
        "source": "T15n0635_003:0501c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於起生處當有其滅。」",
        "translation": "Where there's birth, there'll be its cessation.\"",
        "source": "T15n0635_003:0501c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提曰：「諸族姓子！",
        "translation": "Subhūti said, \"Clansmen!",
        "source": "T15n0635_003:0501c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來有生乎？」",
        "translation": "Does the Tathāgata ever arise?\"",
        "source": "T15n0635_003:0501c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「如來者，如其本無，無生而生。」",
        "translation": "He said, \"The Tathāgata, as originally nonexistent, arises without being born.\"",
        "source": "T15n0635_003:0501c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提曰：「如如本無，無生不生，彼都無生也？」",
        "translation": "Subhūti said, \"As such, there is originally nothing, and nothing arises and doesn't arise, so they are all unarisen?\"",
        "source": "T15n0635_003:0501c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「是者。",
        "translation": "They replied, \"Yes.",
        "source": "T15n0635_003:0501c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T15n0635_003:0501c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則佛所生如其本無而不有生。」",
        "translation": "Then what's produced by the Buddha is as originally nonexistent and doesn't come into being.\"",
        "source": "T15n0635_003:0501c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提曰：「佛生如是，滅復云何？」",
        "translation": "Subhūti said, \"Thus is the Buddha born, so what about cessation?\"",
        "source": "T15n0635_003:0501c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「亦復如如本無，生於無生，無為滅度亦爾本無。",
        "translation": "He answered, \"Also, just as such, originally nothing is produced, and so is the extinction of nonarising.",
        "source": "T15n0635_003:0501c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯，須菩提！",
        "translation": "Yes, Subhūti!",
        "source": "T15n0635_003:0501c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不起而生，滅度亦爾！",
        "translation": "When it arises without rising, so does it cease!",
        "source": "T15n0635_003:0501c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是其滅亦爾，本無也。」",
        "translation": "So it is in its extinction; it was never there in the first place.\"",
        "source": "T15n0635_003:0501c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，無熱淵池現大蓮花，若如車輪，[卄/敷]有無量種種之色，以名眾寶而用光飾，於諸花間有大蓮華色最暉明，現奇異好特獨踊高。",
        "translation": "When he spoke these words, a large lotus flower appeared in the nonheated abyss like a chariot wheel, [20/sharing] with measureless variety of colors, decorated with light from the names of various treasures, and among the flowers a large lotus with the most brilliant color and a distinctive, unique appearance that stands out.",
        "source": "T15n0635_003:0501c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者阿難在於無熱大池之中，覩其變化，所見若斯，尋啟世尊：「今此變化為何瑞應興其感動乃如此耶？」",
        "translation": "Good man Ānanda was in the middle of the great, heatless lake when he saw its transformation, and he asked the Bhagavān, \"What are these changes that give rise to such an auspicious response and cause such an uproar?\"",
        "source": "T15n0635_003:0501c11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來告曰：「且忍，阿難！",
        "translation": "The Tathāgata told him, \"Hold on, Ānanda!",
        "source": "T15n0635_003:0501c14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自當見之。」",
        "translation": "You will see it for yourself.\"",
        "source": "T15n0635_003:0501c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說適未久，忽從下方乃於寶英如來佛土寶飾世界，六萬菩薩與濡首俱，忽然踊出遷能仁界，昇於無熱大池之中，各現妙大蓮花座上，濡首童子即就蓮花高廣顯座。",
        "translation": "Not long after he had spoken, suddenly from below in the jeweled world of the Tathāgata's land, 60,000 bodhisattvas and Mañjuśrī suddenly sprang forth and moved to the large, heatless pond, each appearing on a marvelously large lotus-flowered throne, and Boy Mañjuśrī took his high, broad, lotus-flowered seat.",
        "source": "T15n0635_003:0501c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時眾會皆悉見之，愕然而驚。",
        "translation": "The congregation was stunned and amazed by what they all saw.",
        "source": "T15n0635_003:0501c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿耨達及諸菩薩、釋、梵、持世來會，諸眾悉各叉手稽首敬禮。",
        "translation": "Anavatapta, the bodhisattvas, Śākyamunis, Brahmās, and Lokêśvaras assembled, and they all saluted him with their palms together.",
        "source": "T15n0635_003:0501c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首童子退住虛空，共持珠寶交露之蓋。",
        "translation": "The boy Mañjuśrī withdrew and stood in space, holding the jeweled dew receivers together.",
        "source": "T15n0635_003:0501c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時濡首與諸菩薩俱并蓮花座，亦踊虛空去地乃遠，於上而雨未曾所見最妙蓮花，供養如來！",
        "translation": "Mañjuśrī and the bodhisattvas then joined him on the lotus-flower throne, which also rose into the sky far below the ground and rained down the most marvelous lotus flowers ever seen on it to offer to the Tathāgata!",
        "source": "T15n0635_003:0501c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從諸花中有聲出曰：「寶英如來問訊世尊：『起居無量、體祚康強、神力安和乎？』",
        "translation": "From among the flowers, a voice emerged, \"The Jeweled Tathāgata asks the Bhagavān, 'Does he rise and abide without measure, enjoy good health and strength, and have his powers in harmony?'",
        "source": "T15n0635_003:0501c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲復言曰：『濡首童子與諸菩薩六萬人俱往詣忍土！",
        "translation": "Again, the voice said, 'Suppository Boy and 60,000 other bodhisattvas will go to the Land of Tolerance!'",
        "source": "T15n0635_003:0501c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於無熱龍王淵池觀彼感變，又志樂聽龍王所問莊飾道品入法要說，為世尊廣勸法言，便有懽悅。』」",
        "translation": "As the nonheated dragon king Abyss observed his transformation, he was also interested in hearing the dragon king's questions about the ornamentation of the factors of the path and the essentials of entering the Dharma, and he gave extensive instructions on the Dharma for the Bhagavān, which made him happy.'\"",
        "source": "T15n0635_003:0501c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是濡首及諸菩薩從虛空下，悉詣正覺，稽首如來！",
        "translation": "Thereupon, Mañjuśrī and the bodhisattvas descended from the sky, all went to Zhengjue, and paid homage to the Tathāgata!",
        "source": "T15n0635_003:0501c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欣心肅敬住世尊前。",
        "translation": "He stayed in front of the Bhagavān with reverence and gladness.",
        "source": "T15n0635_003:0502a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時天師告濡首曰：「童子來乎！",
        "translation": "The divine preceptor then addressed Moishu, \"Here's the boy!",
        "source": "T15n0635_003:0502a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為何志故與諸菩薩俱至此耶？」",
        "translation": "Why do you wish to come here with the bodhisattvas?\"",
        "source": "T15n0635_003:0502a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首白佛：「吾等世尊在彼寶英如來佛土寶飾世界，承聞至真能仁如來！",
        "translation": "Mochou said to the Buddha, \"We, the Bhagavān, are here in the jeweled world of the Tathāgata's land, and we have heard of the most truly humane Tathāgata!",
        "source": "T15n0635_003:0502a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "垂慈十方演說斯要。",
        "translation": "\"Please have mercy on the ten directions and explain this teaching.",
        "source": "T15n0635_003:0502a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是法故，尋從彼土昇遊詣此奉禮天師！",
        "translation": "Hearing this teaching, they had traveled from that land, ascended here, and paid homage to the Divine Teacher!",
        "source": "T15n0635_003:0502a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣聞如來所講法也。」",
        "translation": "I've heard the Tathāgata's teaching as a condition.\"",
        "source": "T15n0635_003:0502a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛：「近如？",
        "translation": "Kāśyapa said to the Buddha, \"How close is the Tathāgata?",
        "source": "T15n0635_003:0502a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0635_003:0502a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶英佛土寶飾世界，而諸大志忽至此耶？」",
        "translation": "The jeweled world of the jeweled Ying Buddha Land, and all the great aspirants suddenly arrive here?\"",
        "source": "T15n0635_003:0502a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首答曰：「唯如迦葉坐一定時，極其神足飛行之力，盡其壽命於中滅度，而由不能達到彼土，其國境界弘遠乃爾！」",
        "translation": "Mochu replied, \"Only as Kāśyapa sat for a certain time with the power of his spiritual legs flying, he was able to use up his life span and perish in the midst of it, but because he couldn't reach the other land, his country's realm was vast!\"",
        "source": "T15n0635_003:0502a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告迦葉：「其土去此，過於六十恒沙佛剎乃至寶英如來佛土。」",
        "translation": "The Buddha told Kāśyapa, \"That land is more than 60 Tathāgatas and even Jewel Tathāgata Buddha lands away from here.\"",
        "source": "T15n0635_003:0502a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「其來久如而到此乎？」",
        "translation": "He said, \"How long has it been since he came here?\"",
        "source": "T15n0635_003:0502a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「久如，耆年漏盡意得解也。」",
        "translation": "He answered, \"For a long time, just like that, the contaminants in his senior years have ended, and his mind has been liberated.\"",
        "source": "T15n0635_003:0502a13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大迦葉曰：「甚未曾有。",
        "translation": "Mahākāśyapa said, \"That's quite unprecedented.",
        "source": "T15n0635_003:0502a13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然，濡首！",
        "translation": "Yes, Mañjuśrī!",
        "source": "T15n0635_003:0502a14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸正上神足若斯。」",
        "translation": "These are the correct and superior spiritual abilities.\"",
        "source": "T15n0635_003:0502a14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首又曰：「耆年漏盡意解久如耶？」",
        "translation": "Mooshu also asked, \"Has the contaminants in your senior years ended, and has your mind been liberated for so long?\"",
        "source": "T15n0635_003:0502a15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「如其轉意之頃。」",
        "translation": "They replied, \"As soon as they change their minds.\"",
        "source": "T15n0635_003:0502a15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰：「耆年意以解乎？」",
        "translation": "Again, he said, \"What do the elderly think about understanding?\"",
        "source": "T15n0635_003:0502a16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「以解。」",
        "translation": "He replied, \"In order to be freed.\"",
        "source": "T15n0635_003:0502a16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首復曰：「其誰縛心而有解乎？」",
        "translation": "Mooshu then replied, \"Who has fetters on their mind and yet has liberation?\"",
        "source": "T15n0635_003:0502a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「濡首！",
        "translation": "He replied, \"Moisten your head!",
        "source": "T15n0635_003:0502a17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以心結解，非脫有解致慧見也。」",
        "translation": "A mind that's fettered with understanding isn't liberated from the view that there's understanding that leads to wisdom.\"",
        "source": "T15n0635_003:0502a18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「唯，迦葉！",
        "translation": "He said, \"Yes, Kāśyapa!",
        "source": "T15n0635_003:0502a18_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其無縛心以何解乎？」",
        "translation": "How can their unfettered minds be understood?\"",
        "source": "T15n0635_003:0502a19_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉答曰：「知心無縛，斯則為解。」",
        "translation": "Kāśyapa answered, \"Knowing that the mind is unfettered is liberating.\"",
        "source": "T15n0635_003:0502a19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「唯，迦葉！",
        "translation": "He said, \"Yes, Kāśyapa!",
        "source": "T15n0635_003:0502a20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何等心？",
        "translation": "With what kind of mind?",
        "source": "T15n0635_003:0502a20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何知心？",
        "translation": "How do we know the mind?",
        "source": "T15n0635_003:0502a20_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去知耶？",
        "translation": "Did you know in the past?",
        "source": "T15n0635_003:0502a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當來、現在乎？",
        "translation": "care about the future and the present?",
        "source": "T15n0635_003:0502a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去者滅盡，當來未至、現在無住，以何等心而知其心？」",
        "translation": "What kind of mind is it that knows the mind of someone who has left and has ceased, which has not yet arrived in the future, and which has no present abiding?\"",
        "source": "T15n0635_003:0502a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「心已滅者，是濡首即無身心之計數也。」",
        "translation": "He said, \"When the mind has ceased, this is the moistening of the head, which means there's no mental or physical calculation.\"",
        "source": "T15n0635_003:0502a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「賢者心知其滅耶？」",
        "translation": "He said, \"Good man, does your mind know that it's ceased?\"",
        "source": "T15n0635_003:0502a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「心滅者不可得知。」",
        "translation": "He said, \"You can't know when the mind ceases.\"",
        "source": "T15n0635_003:0502a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「其得致都滅心者，彼永無有身識之得？」",
        "translation": "He said, \"Which one attains the total extinction of mind, then there's never any attainment of the bodily consciousness?\"",
        "source": "T15n0635_003:0502a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「大辯哉！",
        "translation": "He said, \"What a great eloquence!",
        "source": "T15n0635_003:0502a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首童子！",
        "translation": "Mañjuśrī Boy!",
        "source": "T15n0635_003:0502a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等微劣，豈能應答上辯之辭？」",
        "translation": "How could we, being so inferior, respond to the words of the above eloquence?\"",
        "source": "T15n0635_003:0502a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首又曰：「云何迦葉！",
        "translation": "Moisau also said, \"Why, Kāśyapa!",
        "source": "T15n0635_003:0502a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "響寧有辭耶？」",
        "translation": "How could there be words to resound?\"",
        "source": "T15n0635_003:0502a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「無。",
        "translation": "He said, \"No.",
        "source": "T15n0635_003:0502a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0635_003:0502a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣起耳！」",
        "translation": "arising from causes and conditions!\"",
        "source": "T15n0635_003:0502a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「不云乎，唯、大迦葉！",
        "translation": "He said, \"No, it's just, Mahākāśyapa!",
        "source": "T15n0635_003:0502a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切音聲若響耶？」",
        "translation": "What about the sound of all sounds?\"",
        "source": "T15n0635_003:0502a28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「爾！」",
        "translation": "He said, \"Yes!\"",
        "source": "T15n0635_003:0502a29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首又曰：「響辯可致不乎？」",
        "translation": "Moishu also said, \"Is it possible to respond to this, or not?\"",
        "source": "T15n0635_003:0502a29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「不可致。」",
        "translation": "He said, \"It's not possible to cause.\"",
        "source": "T15n0635_003:0502a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰：「如是。",
        "translation": "And he said, \"So it is.",
        "source": "T15n0635_003:0502b01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯，大迦葉！",
        "translation": "Yes, Mahākāśyapa!",
        "source": "T15n0635_003:0502b01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩協懷權辯之才不可思議，亦無其斷，若耆年問，從劫至劫，菩薩機辯難可究盡。」",
        "translation": "The bodhisattva's ability to harmonize discernment is unfathomable, and it's not possible to eliminate it.",
        "source": "T15n0635_003:0502b01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉而白佛言：「唯願世尊加勸濡首！",
        "translation": "It was then that Kāśyapa said to the Buddha, \"May the Bhagavān encourage him to help us!",
        "source": "T15n0635_003:0502b03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為此大眾弘講法說，令諸會眾長夜致安，普使一切得明法要。」",
        "translation": "He taught the Dharma for this great crowd, so that the congregation would be at peace for a long time and all would come to understand the essentials of the Dharma.\"",
        "source": "T15n0635_003:0502b04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是眾中有大菩薩，其名智積，問濡首曰：「何故，童子！",
        "translation": "Thereupon, a great bodhisattva named Jñānagupta asked Mochu, \"Why, boy?",
        "source": "T15n0635_003:0502b05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老迦葉年耆極舊，所言怯弱微劣乃爾？",
        "translation": "Is it true that the elder Kāśyapa is extremely old and speaks of weakness and inferiority?",
        "source": "T15n0635_003:0502b07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為以何故名之耆年？」",
        "translation": "Why is it called old age?\"",
        "source": "T15n0635_003:0502b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首答曰：「是聲聞耳！",
        "translation": "Moisau replied, \"These are the ears of the śrāvakas!",
        "source": "T15n0635_003:0502b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故不果辯。」",
        "translation": "Therefore, it's not a fruitful argument.\"",
        "source": "T15n0635_003:0502b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積復曰：「斯不知發大乘志耶？」",
        "translation": "Zhigye then replied, \"Does he not know that he has aroused the aspiration of the great vehicle?\"",
        "source": "T15n0635_003:0502b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「永不矣！",
        "translation": "He said, \"Never again!",
        "source": "T15n0635_003:0502b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯以聲聞乘之脫也。」",
        "translation": "It's only by means of the śrāvaka vehicle that he's liberated.\"",
        "source": "T15n0635_003:0502b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「又濡首！",
        "translation": "He said, \"And moistens his head!",
        "source": "T15n0635_003:0502b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名為聲聞之乘？」",
        "translation": "Why is it called the vehicle of the śrāvakas?\"",
        "source": "T15n0635_003:0502b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首答曰：「是族姓子！",
        "translation": "Moisau replied, \"This is a son of the clan!",
        "source": "T15n0635_003:0502b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊能仁隨諸眾生，興三乘教敷以說法，有聲聞乘、緣一覺乘及大乘行。",
        "translation": "The Bhagavān is able to benevolently follow sentient beings and present the Dharma teaching of the three vehicles, which are the śrāvaka vehicle, the vehicle of the solitary realizers, and the practice of the great vehicle.",
        "source": "T15n0635_003:0502b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0502b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此眾生意多懷貪、志劣弱故，說三行耳！」",
        "translation": "Because of this, many businesspeople harbor craving and have weak aspirations, so they explain the three practices!\"",
        "source": "T15n0635_003:0502b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積又曰：「云何？",
        "translation": "Zhizhe also said, \"What is it?",
        "source": "T15n0635_003:0502b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首！",
        "translation": "Moishu!",
        "source": "T15n0635_003:0502b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如空、想、願都無其限，何故限之有三乘乎？」",
        "translation": "If emptiness, perception, and the vow have no limit, why should they be limited to the three vehicles?\"",
        "source": "T15n0635_003:0502b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「族姓子！",
        "translation": "He said, \"Sons of the clan!",
        "source": "T15n0635_003:0502b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸如來執權之行，空無想願不有其限，為諸著限而諸有限，終不限於無限行也。」",
        "translation": "These tathāgatas' practice of asserting power, emptiness, and the wish that there's no limit to it, are limited by attachments, and are ultimately unlimited in their practice.\"",
        "source": "T15n0635_003:0502b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「又濡首！",
        "translation": "He said, \"Again, Mochou!",
        "source": "T15n0635_003:0502b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等可退，使永莫與劣志眾生得有會也。」",
        "translation": "We may retire, so that we may never meet with sentient beings of low resolve.\"",
        "source": "T15n0635_003:0502b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首答曰：「諸族姓子！",
        "translation": "Mooshu replied, \"Clansmen!",
        "source": "T15n0635_003:0502b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且忍。",
        "translation": "Still, he tolerates it.",
        "source": "T15n0635_003:0502b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當從無熱龍王聞其智辯及無量法。」",
        "translation": "You will hear about the wisdom and eloquence of the nonheated dragon king and his innumerable teachings.\"",
        "source": "T15n0635_003:0502b20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耆年迦葉謂智積曰：「云何正土！",
        "translation": "The elder Kāśyapa said to Jñānagupta, \"What's the right land?",
        "source": "T15n0635_003:0502b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼寶英如來佛土，云何說法？」",
        "translation": "Like that jeweled tathāgata's Buddha-lands, how does he preach?\"",
        "source": "T15n0635_003:0502b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積答曰：「唯一法味，從其一法演出無量法義之音，但論菩薩不退轉法，諸佛奧藏要行之論，從已取脫不由眾雜，依於普智永無餘脫，恒講菩薩清純之談，其土都無怯弱之行也。」",
        "translation": "Zhigye replied, \"It's only the flavor of the Dharma, and from that one teaching comes the sound of measureless meanings of the Dharma; it's only the theory of the nonretrogression of the bodhisattvas, the theory of the essential practices of the buddhas' arsenal, from which liberation is obtained without any mixture, relying on universal wisdom for permanent liberation without remainder, always speaking of the purity of the bodhisattvas, and the absence of timid behavior in all their lands.\"",
        "source": "T15n0635_003:0502b22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿耨達問濡首曰：「仁尊濡首來奉如來！",
        "translation": "Anavatapta then asked Moishu, \"Renzun Moishu, come and serve the Tathāgata!",
        "source": "T15n0635_003:0502b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為何等像觀於如來？",
        "translation": "\"What kind of image does the Tathāgata contemplate?",
        "source": "T15n0635_003:0502b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以色觀耶？",
        "translation": "Is it based on contemplation of form?",
        "source": "T15n0635_003:0502b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛、想、行、識觀如來乎？」",
        "translation": "What about the Tathāgata who observes pain, perception, volition, and consciousness?\"",
        "source": "T15n0635_003:0502b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "They replied, \"No.\"",
        "source": "T15n0635_003:0502b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以約言之，色苦觀耶？",
        "translation": "\"In a conventional sense, is it true that form is painful to contemplate?",
        "source": "T15n0635_003:0502b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛、想、行、識苦觀之乎？",
        "translation": "What about the contemplation of pain, perception, volition, and consciousness as suffering?",
        "source": "T15n0635_003:0502b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅色、痛、想、行、識觀耶？",
        "translation": "What about the contemplation of the extinction of form, pain, perception, volition, and consciousness?",
        "source": "T15n0635_003:0502c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為以空無想願行觀如來乎？」",
        "translation": "Why do you contemplate the Tathāgata with the vow to practice in emptiness and without ideation?\"",
        "source": "T15n0635_003:0502c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He answered, \"No.\"",
        "source": "T15n0635_003:0502c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「云何去、來、現在相好，肉眼、天眼、慧眼觀如來乎？」",
        "translation": "Again, he asked, \"What are the past, future, and present appearances of the Tathāgata as observed by the physical eye, divine eye, and wisdom eye?\"",
        "source": "T15n0635_003:0502c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "They replied, \"No.\"",
        "source": "T15n0635_003:0502c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何？",
        "translation": "\"What's the answer?",
        "source": "T15n0635_003:0502c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濡首！",
        "translation": "Moishu!",
        "source": "T15n0635_003:0502c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何等相觀如來耶？」",
        "translation": "What kind of characteristics does the Tathāgata have in view?\"",
        "source": "T15n0635_003:0502c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「龍王！",
        "translation": "He replied, \"Dragon King!",
        "source": "T15n0635_003:0502c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀於如來當如如來。」",
        "translation": "Observe that the tathāgata should be just like the tathāgata.\"",
        "source": "T15n0635_003:0502c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰：「軟首！",
        "translation": "Again, he said, \"Soft head!",
        "source": "T15n0635_003:0502c05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來云何乎？」",
        "translation": "What does the Tathāgata say?\"",
        "source": "T15n0635_003:0502c05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「如來者無等之等，等不可見，用無雙故，故妙矣。",
        "translation": "He said, \"The Tathāgata is peerless and invisible, and his function is marvelous because it's peerless.",
        "source": "T15n0635_003:0502c06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍王！",
        "translation": "Dragon King!",
        "source": "T15n0635_003:0502c07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來極尊，無偶無雙、無比無喻、無儔無等、無匹無倫、亦無色相。",
        "translation": "The Tathāgata is a supreme being who has no duality, no comparison, no metaphor, no equal, no equal, and no form.",
        "source": "T15n0635_003:0502c07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為其無像、無形無影、無名無字、無說無受也。",
        "translation": "It has no image, no form, no shadow, no name, no letter, and no teaching or feeling.",
        "source": "T15n0635_003:0502c08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，龍王！",
        "translation": "Thus, Dragon King!",
        "source": "T15n0635_003:0502c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來若此，當作是觀觀於如來！",
        "translation": "If this is the case with the Tathāgata, you should thus contemplate the Tathāgata!",
        "source": "T15n0635_003:0502c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦不肉眼、天眼、慧眼而觀如來。",
        "translation": "Nor do they observe the Tathāgata with the physical eye, divine eye, or wisdom eye.",
        "source": "T15n0635_003:0502c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0502c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其肉眼者以見明故，如如來者無冥無明，故不可以肉眼而觀；又天眼者有作之相，若如來者等過無住故，不可以天眼而觀；又其慧眼知本無相，又如來者眾都永無，故不可以慧眼而觀。」",
        "translation": "The physical eye sees because of insight, but because the Tathāgata has neither darkness nor insight, it's not possible to look at it with the physical eye; the divine eye has the mark of contrivance, but because the Tathāgata has no abiding in excess, it's not possible to look at it with the divine eye; and the eye of wisdom knows that the original has no marks, and because the Tathāgata's multitude is permanently absent, it's not possible to look at it with the eye of wisdom.\"",
        "source": "T15n0635_003:0502c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何？",
        "translation": "\"What's the answer?",
        "source": "T15n0635_003:0502c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "軟首！",
        "translation": "Ushikawa!",
        "source": "T15n0635_003:0502c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀其如來得為清淨？」",
        "translation": "Is it possible to observe the Tathāgata as pure?\"",
        "source": "T15n0635_003:0502c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「若，龍王！",
        "translation": "He said, \"Wakey-wakey, dragon king!",
        "source": "T15n0635_003:0502c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其知眼識心不有起，又知色識心無起滅，其作是觀觀於如來，為應清淨。」",
        "translation": "They know that the mind of the eye consciousness doesn't arise, and they know that the mind of the form consciousness doesn't arise or cease, and they thus observe the Tathāgata, which should be purified.\"",
        "source": "T15n0635_003:0502c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其從寶英如來寶飾佛土菩薩來者，得未曾有，而皆歎曰：「甚快妙哉！",
        "translation": "Those bodhisattvas who came from the Jeweled Tathāgata's Jeweled Buddha Land then attained something unprecedented, and they all praised them, saying, \"How wonderfully pleasant!",
        "source": "T15n0635_003:0502c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯諸眾生善值如來！",
        "translation": "Such sentient beings are well worthy of the Tathāgata!",
        "source": "T15n0635_003:0502c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逮聞如是龍王所問決狐疑品，聞已悅信，不恐不怖又無驚怪，加復受持諷誦宣布，如是正士應在慧署。",
        "translation": "After hearing this chapter on resolving doubts that the dragon king asks, they are delighted and confident, aren't afraid or frightened, aren't surprised, and furthermore accept, recite, and proclaim that such a righteous person would be at the department of wisdom.",
        "source": "T15n0635_003:0502c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等，世尊，不空至此，值聞是要無極像法。",
        "translation": "We, Bhagavān, have come here to hear this essential and limitless teaching.",
        "source": "T15n0635_003:0502c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若，世尊！",
        "translation": "And if, Bhagavān!",
        "source": "T15n0635_003:0502c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯法所至聚落國邑，當知其處如來常在，終不滅度，正法無毀道化興隆。",
        "translation": "Where this teaching reaches a village or country, you should know that the Tathāgata is always present there, never ceases to exist, and the right teaching is without disruption, so that the teaching prospers.",
        "source": "T15n0635_003:0502c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何則然者？",
        "translation": "Why is that?",
        "source": "T15n0635_003:0502c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此法品能降魔場伏諸外道也。」",
        "translation": "This quality of the Dharma can subdue demonic forces and subdue non-Buddhists.\"",
        "source": "T15n0635_003:0502c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿耨達謂軟首曰：「善修行者軟首童子！",
        "translation": "Ānavatapta then addressed Soft Chief, \"Good cultivator, Boy Soft Chief!",
        "source": "T15n0635_003:0502c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯之菩薩逮聞是法得佛不難，進己勸人勤道無惓也。」",
        "translation": "It's not difficult for such a bodhisattva to hear this teaching and attain Buddhahood, and it's effortless to motivate oneself and encourage others to pursue the path.\"",
        "source": "T15n0635_003:0502c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何謂菩薩應修善行？」",
        "translation": "\"What is meant by a bodhisattva cultivating good conduct?\"",
        "source": "T15n0635_003:0503a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "軟首答曰：「若是，龍王！",
        "translation": "Giving a gentle reply, he said, \"If so, Dragon King!",
        "source": "T15n0635_003:0503a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如貪行空，施行亦空，等解於此是謂善行。",
        "translation": "As the practice of craving is empty, so is its performance, and this is called good conduct that's equally understood.",
        "source": "T15n0635_003:0503a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以約言之，不戒與戒、懷恚及忍、懈退精進、亂意一心、如其愚空智慧亦空，於是等行，斯謂善行。",
        "translation": "In a general sense, such actions as not observing precepts and morality, harboring anger and forbearance, being lazy and diligent, being distracted and single-minded, and acting as if foolishness is empty and wisdom is empty are called good actions.",
        "source": "T15n0635_003:0503a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復龍王！",
        "translation": "\"Furthermore, Nāgârjuna!",
        "source": "T15n0635_003:0503a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其婬欲、恚怒、愚癡為之空者，無其婬欲、恚、癡亦空；如參行空，無雜亦空。",
        "translation": "If their lust, anger, and folly are empty, then the absence of those lusts, anger, and folly is also empty; as the practices involved are empty, the absence of mixture is also empty.",
        "source": "T15n0635_003:0503a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其等行，是謂善行。",
        "translation": "Such conduct is called good conduct.",
        "source": "T15n0635_003:0503a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復龍王！",
        "translation": "\"Furthermore, Nāgârjuna!",
        "source": "T15n0635_003:0503a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其八萬四千行空，賢聖正脫亦悉為空，於斯等行，是謂善行。",
        "translation": "Just as 84,000 of those practices are empty, the right emancipation of the noble ones is also empty, and such practices are called good practices.",
        "source": "T15n0635_003:0503a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復龍王！",
        "translation": "\"Furthermore, Nāgârjuna!",
        "source": "T15n0635_003:0503a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有明賢修菩薩行，無行無不行，亦不見行；不有惑行，亦無念行，又不知行，於是等行，是謂善行。」",
        "translation": "If there are wise men who cultivate the bodhisattva practice, have no practice, don't practice, don't see practice, don't have deluded practice, don't think about practice, and don't know about practice, this is called good practice.\"",
        "source": "T15n0635_003:0503a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無熱龍王謂軟首曰：「云何？",
        "translation": "The king of the nonheating dragons told Soft Chief, \"What's the answer?",
        "source": "T15n0635_003:0503a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T15n0635_003:0503a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩行於無所行乎？」",
        "translation": "Does a bodhisattva practice what he does not practice?\"",
        "source": "T15n0635_003:0503a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「龍王！",
        "translation": "He replied, \"Dragon King!",
        "source": "T15n0635_003:0503a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若初發意行菩薩道至得佛坐，所行功德，悉由初行、不生之行、無受處行、無獲捨行、無樔之行；又無著行、亦無諦行、無有限行、亦無惑行；又無婬行、無所作行、亦無特行、無審之行、亦無底行，是謂菩薩無行之行。",
        "translation": "\"If a person first resolves to practice the bodhisattva path until they attain the Buddha's seat, the merits of their practice are all the result of their first practice, unarisen practice, practice in the absence of sensation, practice in gaining equanimity, practice in the absence of transference, practice in the absence of attachment, practice in the absence of truth, practice in the absence of limitation, and practice in the absence of delusion, practice in the absence of lust, practice in the absence of action, practice in the absence of particulars, practice in the absence of discernment, and practice in the absence of bottom, which is called the bodhisattva's practice in the absence of practice.",
        "source": "T15n0635_003:0503a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩以不生之行，無行不行，得三十七品無所造作，以慧而脫永脫於脫，不過二際明了本際而不取證，菩薩作是，此謂菩薩得不起忍。",
        "translation": "If a bodhisattva conducts himself in a way that's not produced, conducts himself in a way that's not possible, attains the 37 classes of no creation, liberates himself forever through wisdom, and doesn't attain realization without understanding the past two realms, a bodhisattva does this, which is called a bodhisattva attaining the patience of not rising.",
        "source": "T15n0635_003:0503a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如斯之行。",
        "translation": "Such is called a good practice.",
        "source": "T15n0635_003:0503a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此謂善行。」",
        "translation": "This is called good conduct.\"",
        "source": "T15n0635_003:0503a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，三萬四千天、龍、鬼神、菩薩行者，逮無從生法樂之忍。",
        "translation": "When he spoke these words, 34,000 gods, dragons, ghosts, and bodhisattva practitioners seized the patience that never arises from the happiness of the Dharma.",
        "source": "T15n0635_003:0503a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說弘道廣顯三昧經卷第三",
        "translation": "Foshuo hongdao guangxian sanmei jing, vol. 3",
        "source": "T15n0635_003:0503a23_0",
        "is_bad_quality": false
    }
]