[
    {
        "source_sentence": "十善業道經",
        "translation": "Shishen yezhangdao jing",
        "source": "T15n0600_001:0157c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐于闐三藏實叉難陀奉　制譯",
        "translation": "Translated by the Tripiṭaka of Yutan, Great Tang, by the Honour of Sikṣānanda",
        "source": "T15n0600_001:0157c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在娑竭羅龍宮，與八千大比丘眾、三萬二千菩薩摩訶薩俱。",
        "translation": "Thus I have heard: One time, the Buddha was present at the Sāgara dragon palace with a group of 8,000 great monks and 32,000 bodhisattvas and mahāsattvas.",
        "source": "T15n0600_001:0157c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告龍王言：「一切眾生心想異故，造業亦異，由是故有諸趣輪轉。",
        "translation": "It was then that the Bhagavān addressed the dragon king, \"All sentient beings have different mental conceptions and create different actions, and as a result, there are transmigration through various paths.",
        "source": "T15n0600_001:0157c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍王！",
        "translation": "King of Dragons!",
        "source": "T15n0600_001:0157c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見此會及大海中，形色種類各別不耶？",
        "translation": "Do you see a distinction in form and shape in this assembly and in the ocean?",
        "source": "T15n0600_001:0157c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切，靡不由心造善不善身業、語業、意業所致。",
        "translation": "None of these things are caused by the mind creating good and unskillful physical, verbal, and mental actions.",
        "source": "T15n0600_001:0157c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而心無色，不可見取，但是虛妄諸法集起，畢竟無主，無我、我所。",
        "translation": "The mind is formless and invisible, but it's a collection of false dharmas that are ultimately ownerless and lack self and what belongs to self.",
        "source": "T15n0600_001:0157c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖各隨業，所現不同，而實於中無有作者。",
        "translation": "Although each one appears differently depending on its activity, there's really no author in it.",
        "source": "T15n0600_001:0157c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故一切法皆不思議，自性如幻。",
        "translation": "Therefore, all dharmas are inconceivable and their own nature is illusory.",
        "source": "T15n0600_001:0157c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者知已，應修善業，以是所生蘊、處、界等，皆悉端正，見者無厭。",
        "translation": "Knowing this, a wise person cultivates good actions, so that the aggregates, fields, elements, and so forth that are produced are all correct, and those who see them are never wearied of them.",
        "source": "T15n0600_001:0157c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「龍王！",
        "translation": "\"Dragon King!",
        "source": "T15n0600_001:0157c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝觀佛身，從百千億福德所生，諸相莊嚴，光明顯曜，蔽諸大眾。",
        "translation": "\"You see the Buddha's body, which arises from a hundred trillion merits, adorned with various appearances and shining brightly, covering the masses.",
        "source": "T15n0600_001:0157c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設無量億自在梵王，悉不復現；其有瞻仰如來身者，莫不目眩！",
        "translation": "Suppose there are measureless millions of sovereign Brahmā kings who don't reappear, and none of them would fail to dazzle their eyes when they look at the Tathāgata's body!",
        "source": "T15n0600_001:0157c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝又觀此諸大菩薩，妙色嚴淨，一切皆由修集善業福德而生。",
        "translation": "\"You also observe the marvelous appearance and purity of these great bodhisattvas, all of which arise from cultivating good actions and merit.",
        "source": "T15n0600_001:0157c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸天龍八部眾等大威勢者，亦因善業福德所生。",
        "translation": "The great authority of the gods, dragons, the eight groups, and so forth also arises from the accumulation of good actions and merit.",
        "source": "T15n0600_001:0157c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今大海中所有眾生，形色麁鄙，或大或小，皆由自心種種想念，作身、語、意諸不善業，是故隨業各自受報。",
        "translation": "Now, all the sentient beings in the ocean, whether large or small, are crude and mean in appearance because of various thoughts in their own minds that create unskillful actions of body, speech, and thought; therefore, each is rewarded according to its actions.",
        "source": "T15n0600_001:0157c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當應如是修學，亦令眾生了達因果，修習善業。",
        "translation": "Now, you should train in this way, so that sentient beings will also understand cause and effect and cultivate good actions.",
        "source": "T15n0600_001:0157c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當於此正見不動，勿復墮在斷、常見中！",
        "translation": "Here, you must hold to this right view without moving, so that you don't again fall into nihilism or common sense!",
        "source": "T15n0600_001:0157c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸福田歡喜、敬養，是故汝等亦得人天尊敬、供養。",
        "translation": "Rejoicing in and venerating fields of merit, you too will therefore be honored and offered up by humans and gods.",
        "source": "T15n0600_001:0157c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「龍王！",
        "translation": "\"Dragon King!",
        "source": "T15n0600_001:0157c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知菩薩有一法，能斷一切諸惡道苦。",
        "translation": "You should know that there's one thing that bodhisattvas can do to end the suffering of all bad destinies.",
        "source": "T15n0600_001:0157c27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為一？",
        "translation": "What's that one thing?",
        "source": "T15n0600_001:0157c28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於晝夜，常念、思惟、觀察善法，令諸善法念念增長，不容毫分不善間雜。",
        "translation": "\"During the day and night, he always thinks about, contemplates, and observes good qualities, so that they will grow in mindfulness of good qualities and won't allow even the slightest interruption of unskillfulness.",
        "source": "T15n0600_001:0157c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是即能令諸惡永斷、善法圓滿，常得親近諸佛、菩薩及餘聖眾。",
        "translation": "This will cause the permanent cessation of evil and the perfection of good qualities, and they'll always be able to draw near to the buddhas, bodhisattvas, and other noble beings.",
        "source": "T15n0600_001:0158a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言善法者，謂人天身、聲聞菩提、獨覺菩提、無上菩提，皆依此法以為根本而得成就，故名善法。",
        "translation": "When we say good dharma, we mean that the human and divine bodies, śrāvaka bodhi, pratyekabuddha bodhi, and peerless bodhi all rely on this dharma as their foundation and attain their accomplishment, so they're called good dharmas.",
        "source": "T15n0600_001:0158a02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法即是十善業道。",
        "translation": "This dharma is the path of the ten good activities.",
        "source": "T15n0600_001:0158a04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0600_001:0158a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂能永離殺生、偷盜、邪行、妄語、兩舌、惡口、綺語、貪欲、瞋恚、邪見。",
        "translation": "It's the ability to be permanently free of killing, stealing, wrong actions, false speech, duplicity, harsh words, fancy speech, craving, anger, and wrong views.",
        "source": "T15n0600_001:0158a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「龍王！",
        "translation": "\"Dragon King!",
        "source": "T15n0600_001:0158a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離殺生，即得成就十離惱法。",
        "translation": "If you part with killing, you'll achieve ten dharmas of freedom from affliction.",
        "source": "T15n0600_001:0158a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0600_001:0158a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、於諸眾生普施無畏；二、常於眾生起大慈心；三、永斷一切瞋恚習氣；四、身常無病；五、壽命長遠；六、恒為非人之所守護；七、常無惡夢，寢覺快樂；八、滅除怨結，眾怨自解；九、無惡道怖；十、命終生天；是為十。",
        "translation": "1. they universally bestow fearlessness on sentient beings; 2. they always have great compassion for sentient beings; 3. they permanently end all karmic impressions of anger; 4. they are always without illness; 5. their life expectancy is long; 6. they are always guarded by non-humans; 7. they always have no bad dreams and experience happy sleep; 8. they end the bond of enmity and are freed from many enemies; 9. they have no fear of a bad path; 10. they are born in heaven at the end of their life; these are the ten.",
        "source": "T15n0600_001:0158a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，得佛隨心自在壽命。",
        "translation": "If someone can dedicate their mind to unsurpassed, perfect enlightenment, then when they later become a buddha, they'll attain the unimpeded life of a buddha at their own pace.",
        "source": "T15n0600_001:0158a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離偷盜，即得十種可保信法。",
        "translation": "If you part with theft, you'll attain ten kinds of trustworthy qualities.",
        "source": "T15n0600_001:0158a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0600_001:0158a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、資財盈積，王、賊、水、火，及非愛子，不能散滅；二、多人愛念；三、人不欺負；四、十方讚美；五、不憂損害；六、善名流布；七、處眾無畏；八、財、命、色、力安樂，辯才具足無缺；九、常懷施意；十、命終生天；是為十。",
        "translation": "1. his wealth and possessions are so abundant that kings, thieves, water, fire, and people who aren't his darlings can't be scattered; 2. they are loved by many; 3. they aren't mistaken by others; 4. they are praised in ten directions; 5. they don't worry about harm; 6. their good reputation spreads; 7. they handle people without fear; 8. their possessions, lives, forms, and powers are peaceful and enjoyable, and their eloquence is complete and faultless; 9. they always have the intention to give; 10. they are born in heaven when their life ends; these are the ten.",
        "source": "T15n0600_001:0158a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，得證清淨大菩提智。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct, and complete enlightenment, they'll realize pure, great bodhi knowledge when they later become a buddha.",
        "source": "T15n0600_001:0158a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離邪行，即得四種智所讚法。",
        "translation": "If you part with wrong practices, you'll attain four kinds of knowledge of the things praised.",
        "source": "T15n0600_001:0158a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T15n0600_001:0158a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、諸根調順；二、永離諠掉；三、世所稱歎；四、妻莫能侵；是為四。",
        "translation": "1. their faculties are tamed; 2. they're free of agitation; 3. they're praised by the world; 4. their wives can't invade them; these are the four.",
        "source": "T15n0600_001:0158a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，得佛丈夫隱密藏相。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct enlightenment, then when they later become a buddha, they'll attain the hidden, stealthy appearance of a buddha-husband.",
        "source": "T15n0600_001:0158a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離妄語，即得八種天所讚法。",
        "translation": "If they part with false speech, they'll attain eight kinds of qualities praised by the gods.",
        "source": "T15n0600_001:0158a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T15n0600_001:0158a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、口常清淨、優鉢華香；二、為諸世間之所信伏；三、發言成證，人天敬愛；四、常以愛語安慰眾生；五、得勝意樂，三業清淨；六、言無誤失，心常歡喜；七、發言尊重，人天奉行；八、智慧殊勝，無能制伏；是為八。",
        "translation": "1. his mouth is always pure and fragrant with superior flowers; 2. he's believed and subdued by the world; 3. he speaks with accomplished realization and is loved by humans and gods; 4. he always comforts sentient beings with loving words; 5. he attains superior aspirations and purifies his three activities; 6. his words are without error and his mind is always joyous; 7. he speaks with respect and is accepted by humans and gods; 8. his wisdom is so superior that it can't be subdued; these are the eight.",
        "source": "T15n0600_001:0158a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，即得如來真實語。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct enlightenment, then when they later become a buddha, they'll attain the true words of the Tathāgata.",
        "source": "T15n0600_001:0158b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離兩舌，即得五種不可壞法。",
        "translation": "If they part with duplicity, they'll attain five indestructible qualities.",
        "source": "T15n0600_001:0158b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0600_001:0158b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、得不壞身，無能害故；二、得不壞眷屬，無能破故；三、得不壞信，順本業故；四、得不壞法行，所修堅固故；五、得不壞善知識，不誑惑故；是為五。",
        "translation": "1. attaining indestructible body, which can't be harmed; 2. attaining indestructible followers, which can't be broken; 3. attaining indestructible faith, which follows one's original actions; 4. attaining indestructible practice of the Dharma, which is cultivated and resolute; and 5. attaining indestructible good teachers, which don't lead to confusion.",
        "source": "T15n0600_001:0158b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，得正眷屬，諸魔外道不能沮壞。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct dependents when they later become a buddha, Māra and non-Buddhists won't be able to disrupt them.",
        "source": "T15n0600_001:0158b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離惡口，即得成就八種淨業。",
        "translation": "If you part with bad speech, you'll achieve eight kinds of pure action.",
        "source": "T15n0600_001:0158b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T15n0600_001:0158b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、言不乖度；二、言皆利益；三、言必契理；四、言詞美妙；五、言可承領；六、言則信用；七、言無可譏；八、言盡愛樂；是為八。",
        "translation": "1. words don't misconstrue the rules; 2. words are beneficial; 3. words always match reality; 4. words are beautiful; 5. words are acceptable; 6. words are trustworthy; 7. words are not open to criticism; and 8. words bring joy to all; these are the eight.",
        "source": "T15n0600_001:0158b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，具足如來梵音聲相。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct, and complete transcendent sound characteristics of the Tathāgata when they later become a buddha, then they'll be able to achieve enlightenment.",
        "source": "T15n0600_001:0158b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離綺語，即得成就三種決定。",
        "translation": "If you part with fancy speech, you'll achieve three kinds of certainty.",
        "source": "T15n0600_001:0158b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T15n0600_001:0158b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、定為智人所愛；二、定能以智，如實答問；三、定於人天，威德最勝，無有虛妄；是為三。",
        "translation": "1. concentration that's loved by wise people, 2. concentration that's able to answer questions accurately and with wisdom, and 3. concentration that's most dignified among humans and gods and has no falsehoods; these are the three.",
        "source": "T15n0600_001:0158b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，即得如來諸所授記，皆不唐捐。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct enlightenment, then when they later become a buddha, they'll receive the Tathāgata's various assurances, none of which will be given in vain.",
        "source": "T15n0600_001:0158b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離貪欲，即得成就五種自在。",
        "translation": "If you become free of craving, you'll achieve five kinds of mastery.",
        "source": "T15n0600_001:0158b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0600_001:0158b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、三業自在，諸根具足故；二、財物自在，一切怨賊不能奪故；三、福德自在，隨心所欲，物皆備故；四、王位自在，珍奇妙物皆奉獻故；五、所獲之物，過本所求百倍殊勝，由於昔時不慳嫉故；是為五。",
        "translation": "1. mastery over the three activities because their faculties are fully developed; 2. mastery over possessions because they can't be taken by enemies and thieves; 3. mastery over virtue because they have everything they want at their own will; 4. mastery over the king's position because they offer up precious and wonderful things; and 5. the one hundredfold superiority of the things they obtain over what they originally sought because they weren't stingy or jealous in the past are five.",
        "source": "T15n0600_001:0158b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，三界特尊，皆共敬養。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct enlightenment, then when they later become a buddha, they'll be honored by the three worlds.",
        "source": "T15n0600_001:0158b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離瞋恚，即得八種喜悅心法。",
        "translation": "If you're free of anger, you'll attain eight kinds of joyous states of mind.",
        "source": "T15n0600_001:0158b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T15n0600_001:0158b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、無損惱心；二、無瞋恚心；三、無諍訟心；四、柔和質直心；五、得聖者慈心；六、常作利益安眾生心；七、身相端嚴，眾共尊敬；八、以和忍故，速生梵世；是為八。",
        "translation": "1. a mind that's not harmful; 2. a mind that's not angry; 3. a mind that's not contentious; 4. a mind that's gentle and straightforward; 5. a mind that's attained the compassion of noble people; 6. a mind that's always working to improve the well-being of sentient beings; 7. a body whose features are dignified and respected by all; and 8. a mind that's quickly born into the Brahma world because of its peacefulness and forbearance; these are the eight.",
        "source": "T15n0600_001:0158b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，得無礙心，觀者無厭。",
        "translation": "If someone can dedicate themselves to unsurpassed, correct enlightenment, they'll attain an unobstructed mind when they later become a buddha, and they won't tire of observing it.",
        "source": "T15n0600_001:0158c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "\"Furthermore, Dragon King!",
        "source": "T15n0600_001:0158c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離邪見，即得成就十功德法。",
        "translation": "If you part with wrong views, you'll attain ten meritorious qualities.",
        "source": "T15n0600_001:0158c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T15n0600_001:0158c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、得真善意樂、真善等侶；二、深信因果，寧殞身命，終不作惡；三、唯歸依佛，非餘天等；四、直心正見，永離一切吉凶疑網；五、常生人天，不更惡道；六、無量福慧，轉轉增勝；七、永離邪道，行於聖道；八、不起身見，捨諸惡業；九、住無礙見，十、不墮諸難；是為十。",
        "translation": "1. attains true good intentions and true good associates; 2. deeply believes in the results of causes and conditions, preferring to die and never do evil; 3. solely relies on the Buddha and not on other gods; 4. has a straight mind and right view, permanently parting with all webs of doubt about good and evil; 5. is always born in heaven and doesn't change into a bad path; 6. has measureless merit and wisdom that continually increase; 7. is permanently freed from wrong paths and practices the noble path; 8. doesn't give rise to views of self and abandons bad actions; 9. abides in unobstructed views; 10. doesn't fall into difficulties; these are the ten.",
        "source": "T15n0600_001:0158c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能迴向阿耨多羅三藐三菩提者，後成佛時，速證一切佛法，成就自在神通。」",
        "translation": "If someone can dedicate themselves to unsurpassed, correct enlightenment, they'll quickly realize all the Buddha's teachings and achieve unimpeded supernormal abilities when they later become a buddha.\"",
        "source": "T15n0600_001:0158c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復告龍王言：「若有菩薩依此善業，於修道時，能離殺害而行施故，常富財寶，無能侵奪；長壽無夭，不為一切怨賊損害。",
        "translation": "It was then that the Bhagavān again addressed the dragon king, \"If a bodhisattva relies on this good action and, when cultivating cultivation, is able to avoid killing and harm and give, he'll always be rich in wealth and treasure that can't be taken, have a long life without dying, and won't be harmed by all enemies and thieves.",
        "source": "T15n0600_001:0158c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離不與取而行施故，常富財寶，無能侵奪；最勝無比，悉能備集諸佛法藏。",
        "translation": "Because they practice generosity free of taking what's not given, they're always rich in possessions and treasures that can't be taken away, and they're most excellent and incomparable in their ability to gather the Buddha's Dharma treasury.",
        "source": "T15n0600_001:0158c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離非梵行而行施故，常富財寶，無能侵奪；其家直順，母及妻子，無有能以欲心視者。",
        "translation": "Because they practice generosity free of unchaste behavior, they're always rich in possessions and treasures that can't be taken away, and their family is straightforward; there's no mother or wife who can look at them with desire.",
        "source": "T15n0600_001:0158c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離虛誑語而行施故，常富財寶，無能侵奪；離眾毀謗，攝持正法，如其誓願，所作必果。",
        "translation": "Because they practice generosity free of false speech, they'll always have wealth and treasure that can't be taken away, and because they avoid criticism, they'll maintain the right Dharma and do what they vow.",
        "source": "T15n0600_001:0158c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離離間語而行施故，常富財寶，無能侵奪；眷屬和睦，同一志樂，恒無乖諍。",
        "translation": "Because they practice generosity free of indirect speech, they'll always have wealth and treasure that can't be taken away, and their retinue will be harmonious and unified in their aspirations, so there'll always be no disagreement.",
        "source": "T15n0600_001:0158c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離麁惡語而行施故，常富財寶，無能侵奪；一切眾會，歡喜歸依，言皆信受，無違拒者。",
        "translation": "Because they practice generosity free of harsh words, they're always rich in possessions and treasures that can't be taken away, and all their congregations joyfully rely on them, accepting their words with confidence and not rejecting them.",
        "source": "T15n0600_001:0158c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離無義語而行施故，常富財寶，無能侵奪；言不虛設，人皆敬受，能善方便，斷諸疑惑。",
        "translation": "Because they practice generosity free of pointless speech, they're always rich in possessions and treasures that can't be taken away, their words aren't false and are accepted with respect, and they're able to skillfully perform tasks that end doubt and confusion.",
        "source": "T15n0600_001:0158c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離貪求心而行施故，常富財寶，無能侵奪；一切所有，悉以慧捨，信解堅固，具大威力。",
        "translation": "Because they practice generosity free of desire, they're always rich in possessions and treasures that can't be taken away, and they abandon all that they have with wisdom, their faith and understanding are resolute, and they possess great authority.",
        "source": "T15n0600_001:0158c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離忿怒心而行施故，常富財寶，無能侵奪；速自成就無礙心智，諸根嚴好，見皆敬愛。",
        "translation": "Because they practice generosity free of anger, they're always rich in possessions and treasures that can't be taken away, and they quickly achieve unhindered mental knowledge and adoration for the fineness of their faculties when they see them.",
        "source": "T15n0600_001:0158c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離邪倒心而行施故，常富財寶，無能侵奪；恒生正見敬信之家，見佛、聞法、供養眾僧，常不忘失大菩提心。",
        "translation": "Because they practice generosity free of mistaken thought, they're always rich in possessions and treasures that can't be taken away, and they always produce a home of right view and respect and faith, see the Buddha, hear the Dharma, and make offerings to the saṃgha, and never lose sight of the great mind of bodhi.",
        "source": "T15n0600_001:0159a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為大士修菩薩道時，行十善業，以施莊嚴，所獲大利如是。",
        "translation": "This is the kind of great person who cultivates the bodhisattva path, does ten good deeds, and adorns themselves with generosity, which obtains great rewards.",
        "source": "T15n0600_001:0159a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「龍王！",
        "translation": "\"Dragon King!",
        "source": "T15n0600_001:0159a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉要言之，行十善道，以戒莊嚴故，能生一切佛法義利，滿足大願；忍辱莊嚴故，得佛圓音，具眾相好；精進莊嚴故，能破魔怨，入佛法藏；定莊嚴故，能生念、慧、慚、愧、輕安；慧莊嚴故，能斷一切分別妄見；慈莊嚴故，於諸眾生不起惱害；悲莊嚴故，愍諸眾生，常不厭捨；喜莊嚴故，見修善者，心無嫌嫉；捨莊嚴故，於順違境，無愛恚心；四攝莊嚴故，常勤攝化一切眾生；念處莊嚴故，善能修習四念處觀；正勤莊嚴故，悉能斷除一切不善法，成一切善法；神足莊嚴故，恒令身心輕安、快樂；五根莊嚴故，深信堅固，精勤匪懈，常無迷忘，寂然調順，斷諸煩惱；力莊嚴故，眾怨盡滅，無能壞者；覺支莊嚴故，常善覺悟一切諸法；正道莊嚴故，得正智慧常現在前；止莊嚴故，悉能滌除一切結使；觀莊嚴故，能如實知諸法自性；方便莊嚴故，速得成滿為、無為樂。",
        "translation": "舉要言之，行十善道，以戒莊嚴故，能生一切佛法義利，滿足大願；忍辱莊嚴故，得佛圓音，具眾相好；精進莊嚴故，能破魔怨，入佛法藏；定莊嚴故，能生念、慧、慚、愧、輕安；慧莊嚴故，能斷一切分別妄見；慈莊嚴故，於諸眾生不起惱害；悲莊嚴故，愍諸眾生，常不厭捨；喜莊嚴故，見修善者，心無嫌嫉；捨莊嚴故，於順違境，無愛恚心；四攝莊嚴故，常勤攝化一切眾生；念處莊嚴故，善能修習四念處觀；正勤莊嚴故，悉能斷除一切不善法，成一切善法；神足莊嚴故，恒令身心輕安、快樂；五根莊嚴故，深信堅固，精勤匪懈，常無迷忘，寂然調順，斷諸煩惱；力莊嚴故，眾怨盡滅，無能壞者；覺支莊嚴故，常善覺悟一切諸法；正道莊嚴故，得正智慧常現在前；止莊嚴故，悉能滌除一切結使；觀莊嚴故，能如實知諸法自性；方便莊嚴故，速得成滿為、無為樂。",
        "source": "T15n0600_001:0159a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「龍王！",
        "translation": "\"Dragon King!",
        "source": "T15n0600_001:0159a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此十善業，乃至能令十力、無畏、十八不共，一切佛法皆得圓滿。",
        "translation": "You should know that these ten good actions ... can cause the ten powers, fearlessness, and 18 distinctive characteristics of all buddhas to be perfected.",
        "source": "T15n0600_001:0159a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等應勤修學！",
        "translation": "You therefore should diligently cultivate them!",
        "source": "T15n0600_001:0159a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍王！",
        "translation": "Dragon King!",
        "source": "T15n0600_001:0159a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如一切城邑、聚落，皆依大地而得安住；一切藥草、卉木、叢林，亦皆依地而得生長。",
        "translation": "It's like the earth on which all cities and towns are built and where they can stand, and the earth on which all medicinal plants, trees, and groves can grow.",
        "source": "T15n0600_001:0159a25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此十善道亦復如是，一切人、天依之而立，一切聲聞、獨覺菩提、諸菩薩行、一切佛法，咸共依此十善大地而得成就。」",
        "translation": "So it is with these ten good destinies, upon which all humans and gods are founded, and upon which all śrāvakas, pratyekabuddhas, bodhisattva practices, and all Buddha teachings are accomplished.\"",
        "source": "T15n0600_001:0159a27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，娑竭羅龍王及諸大眾，一切世間天、人、阿修羅等，皆大歡喜，信受奉行。",
        "translation": "After the Buddha spoke this sūtra, the Sāgara-nāga-rāja and the great assembly of gods, humans, asuras, and others of the world rejoiced greatly, believed, accepted, and approved.",
        "source": "T15n0600_001:0159b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十善業道經",
        "translation": "Sutra on the Ten Good Acts",
        "source": "T15n0600_001:0159b03_0",
        "is_bad_quality": false
    }
]