[
    {
        "source_sentence": "寶雲經卷第六",
        "translation": "Jewel Cloud Sutra, Vol. 6",
        "source": "T16n0658_006:0234c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梁扶南三藏曼陀羅仙譯",
        "translation": "Liang Funan sanzang mandarinshi translation",
        "source": "T16n0658_006:0234c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「◎善男子！",
        "translation": "\"-Good sons!",
        "source": "T16n0658_006:0234c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名為信敬。",
        "translation": "\"Again, there are ten things that bodhisattvas call faith and reverence.",
        "source": "T16n0658_006:0234c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0234c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善根深厚宿殖德本、得於正見不隨他信不歸依他、志性恒正不為虛妄、其心質直無有諂曲、利根智慧功德具足、除諸陰蓋其心清淨、常依善知識遠離惡知識、摧伏憍慢、聞深妙法能善諦受、終不顛倒妄解如來甚深法藏威德自在。",
        "translation": "With deep roots and a long history of virtue, they attain right view, don't follow others' beliefs, don't take refuge in others, have a constant and correct resolve that isn't false, are straightforward in mind and lack flattery, are endowed with the virtues of sharp faculties and wisdom, are purified in mind and freed from the hindrances of the aggregates, always rely on good teachers and seclude themselves from bad teachers, subdue pride, hear the profound and wonderful Dharma and accept it well, and never mistakenly and falsely understand the Tathāgata's profound dharma treasure of authority and mastery.",
        "source": "T16n0658_006:0234c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0234c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩能多信敬。」",
        "translation": "To have these ten things is to be called a bodhisattva capable of much faith and respect.\"",
        "source": "T16n0658_006:0234c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，除蓋障菩薩白佛言：「世尊！",
        "translation": "At that point, the Bodhisattva Removing Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T16n0658_006:0234c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今於如來大威德所願說少法，令我得聞。」",
        "translation": "Now, I've vowed to teach a few things at the Tathāgata's place of great authority so that I can hear them.\"",
        "source": "T16n0658_006:0234c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0234c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今善聽，當為說之，如來要法、威德少分。」",
        "translation": "Now, listen well, and you will explain for them the essential teaching and the smallest part of the Tathāgata's authoritative qualities.\"",
        "source": "T16n0658_006:0234c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善哉，世尊！",
        "translation": "\"Good, Bhagavān!",
        "source": "T16n0658_006:0234c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為演說。」",
        "translation": "Please explain it for us.\"",
        "source": "T16n0658_006:0234c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如來大慈等與一切眾生樂，若於一眾生起慈心時，乃至十方眾生亦復如是，遍一切眾生界亦滿虛空界，無能遍知如來甚深境界邊際。",
        "translation": "The Buddha said, \"When the Tathāgata's great compassion is equal to the delight of all sentient beings, if he becomes compassionate toward one sentient being, it's likewise true for sentient beings in ten directions, pervading the whole realm of sentient beings and filling the realm of space, with no possibility of fully knowing the limits of the Tathāgata's profound realm.",
        "source": "T16n0658_006:0234c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來有大悲心，不與聲聞、辟支佛共。",
        "translation": "\"The Tathāgata has a mind of great compassion that's not shared by śrāvakas and pratyekabuddhas.",
        "source": "T16n0658_006:0234c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來於一眾生起於悲心，乃至一切眾生亦復如是，為作利益。",
        "translation": "When the Tathāgata arouses compassion for one sentient being, it's likewise for all sentient beings, for their benefit.",
        "source": "T16n0658_006:0234c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來大悲無有邊際，非諸二乘所能究竟。",
        "translation": "The Tathāgata's great compassion has no limit, and it's beyond the reach of the two vehicles.",
        "source": "T16n0658_006:0235a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0235a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來說法不可窮盡，能於一時普為十方眾生說法，若一劫、百千萬億劫、無量阿僧祇劫作如是說，一切眾生無有能知如來說法邊際本末。",
        "translation": "The Tathāgata's teaching is inexhaustible, and he can teach sentient beings in ten directions at one time, and if he does so for one eon, a hundred thousand million million eons, or measureless incalculable eons, none of the sentient beings will be able to know the limits of the Tathāgata's teaching or its origin.",
        "source": "T16n0658_006:0235a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「假使無量眾生一時問難，而如來於一念中各隨其類一音能答，然如來辯才無有窮盡。",
        "translation": "\"Suppose an incalculable number of sentient beings were to ask a question at one time, and the Tathāgata were able to answer it with a single voice, according to their type, in a single thought, yet there's no limit to the Tathāgata's eloquence.",
        "source": "T16n0658_006:0235a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來有無量阿僧祇禪定三昧之所行處。",
        "translation": "\"The Tathāgata has measureless and incalculable places where he conducts meditation and concentration.",
        "source": "T16n0658_006:0235a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0235a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使一切眾生皆得十住，各各皆入無量三昧，於百千劫中各入異定，如是經無量劫猶不能盡知如來三昧境界。",
        "translation": "Suppose all sentient beings attain the ten abodes and each enters a limitless number of samādhis, and each enters a different concentration during a hundred thousand eons, it would still be impossible to fully know the Tathāgata's samādhi realm after passing through measureless eons like this.",
        "source": "T16n0658_006:0235a09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來又作無量阿僧祇應身，令一切眾生應受化者，悉見如來皆現其前，於一念頃，一一色相皆生信解，各有差別。",
        "translation": "\"The Tathāgata also creates measureless incalculable response bodies, so that all sentient beings who should be transformed see the Tathāgata in front of them, and in a moment of thought, faith and understanding arise from each form and shape, with each having its own distinctions.",
        "source": "T16n0658_006:0235a11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來又復一時皆現其前，隨其所應而為說法，令諸眾生悉皆受行。",
        "translation": "Again, the Tathāgata appears before them all at once, teaching as he sees fit, and causing all sentient beings to accept and practice it.",
        "source": "T16n0658_006:0235a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0235a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來天眼所見境界無量無邊，非肉眼所見。",
        "translation": "The realm seen by the Tathāgata's divine eye is measureless and limitless, and it's not visible to the physical eye.",
        "source": "T16n0658_006:0235a16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是天眼境界，如來於一念中悉皆見之，如觀掌中阿摩勒果。",
        "translation": "The Tathāgata sees all these realms of the divine eye in a single moment of thought, just as he observes the fruit of amalā in his palm.",
        "source": "T16n0658_006:0235a17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來天耳所聞境界無量無邊，如上天眼，一切眾生、異類音聲，隨其大小於一念頃悉分別知。",
        "translation": "\"The range of objects heard by the Tathāgata's divine ear is measureless and limitless, and as with the divine eye, the Tathāgata discerns all sentient beings and sounds of different kinds according to their size in a single moment of thought.",
        "source": "T16n0658_006:0235a18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來復有無量無邊無礙智慧，無與等者、不可為譬。",
        "translation": "\"The Tathāgata also has measureless, limitless, and unimpeded wisdom, and there's no equal that can't be compared to it.",
        "source": "T16n0658_006:0235a20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生若心念所知，隨其根性種種差別，如來於一剎那頃悉分別知。",
        "translation": "If the mindfulness of all sentient beings knows various differences according to their faculties, the Tathāgata discerns them all in a single moment of time.",
        "source": "T16n0658_006:0235a21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨彼眾生各各所念、各各所作、隨造善惡所得業報，如來能以三達無礙智慧，於剎那頃悉分別知。",
        "translation": "According to what each of those sentient beings thinks and does, and according to the results of good and bad actions that they create, the Tathāgata can discern them all in a split second with the three kinds of penetrating, unimpeded wisdom.",
        "source": "T16n0658_006:0235a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0235a25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來常在禪定。",
        "translation": "The Tathāgata is always in meditative concentration.",
        "source": "T16n0658_006:0235a25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0658_006:0235a26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來終無忘念。",
        "translation": "\"The Tathāgata is never forgetful.",
        "source": "T16n0658_006:0235a26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來諸根無有錯謬，如來斷一切結使，其心寂靜；若雜結使，其心散亂，離清淨法。",
        "translation": "There's no mistake about the Tathāgata's faculties, and the Tathāgata ends all the bonds and tendencies, and his mind is quiescent; if there are mixed bonds and tendencies, his mind is distracted, and he parts with the pure Dharma.",
        "source": "T16n0658_006:0235a26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來已離一切業習，塵垢永盡，無漏、無為，於法自在，一切三昧三摩提無量境界，已度彼岸。",
        "translation": "Having parted with all karmic impressions, the Tathāgata permanently ends defilement, is uncontaminated and uncontaminated, attains mastery over principles, and has crossed to the other shore in all the limitless realms of samādhi and concentration.",
        "source": "T16n0658_006:0235a28_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來常在三昧、常一威儀，乃至涅槃。",
        "translation": "\"The Tathāgata is always in samādhi and always uniform in demeanor, right up to nirvāṇa.",
        "source": "T16n0658_006:0235b01_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來於無量百千億劫修集所得，無有眾生能思惟分別知其量者。」",
        "translation": "\"There are no sentient beings who can contemplate, discern, and know the amount of what the Tathāgata has cultivated over measureless hundreds of billions of eons.\"",
        "source": "T16n0658_006:0235b02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除蓋障菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Removing Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T16n0658_006:0235b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來不從阿僧祇劫積集功德耶？」",
        "translation": "Hasn't the Tathāgata accumulated merit from incalculably long eons?\"",
        "source": "T16n0658_006:0235b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不爾。",
        "translation": "The Buddha said, \"No. Why is that?",
        "source": "T16n0658_006:0235b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0658_006:0235b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0235b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩不能思議如來境界。",
        "translation": "A bodhisattva can't conceive of the Tathāgata's realm.",
        "source": "T16n0658_006:0235b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來境界不可思量，但為淺近眾生，說三阿僧祇修集所得，菩薩而實發心以來不可計數。」",
        "translation": "The Tathāgata's realm is unfathomable, but it's only for shallow sentient beings who have cultivated it for three incalculable periods since the bodhisattva really started his mind.\"",
        "source": "T16n0658_006:0235b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除蓋障菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Removing Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T16n0658_006:0235b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眾生久修善根、植諸業行、除去蓋障、多有信解、近於阿耨多羅三藐三菩提、得聞如來無量威德，聞是法已歡喜信樂，況復受持、讀誦、書寫、供養、為人廣說？",
        "translation": "If sentient beings have long cultivated good roots, planted karmic practices, removed hindrances, had much faith and understanding, approached unsurpassed, samyak-saṃbodhi, and have heard of the Tathāgata's immeasurable authority, how could they rejoice and be delighted after hearing this teaching, much less accept, recite, write, make offerings, and explain it widely to others?",
        "source": "T16n0658_006:0235b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之人不久亦當得大威德，堪任法器。」",
        "translation": "Such a person will also soon attain great authority and become a vessel for the Dharma.\"",
        "source": "T16n0658_006:0235b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如汝所說，如是如是。",
        "translation": "The Buddha said, \"As you've said, it's so and so.",
        "source": "T16n0658_006:0235b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此眾生為佛所護，久種善根、親近諸佛，聞佛有大威德，善男子、善女人而於其中不生疑惑。",
        "translation": "Such a sentient being is protected by the Buddha, has long cultivated good roots, gets close to the buddhas, and hears that the Buddha has great authority, and good sons and good women don't have doubts about it.",
        "source": "T16n0658_006:0235b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子、善女人心不錯亂，不錯亂故，思惟如來有大威德，深生殷重信樂之心，七日七夜著鮮淨衣恭敬供養，專念如來大功德寶，心不移易必得見佛；若不滿七日，乃至一日一夜，命終之時亦得見佛。」",
        "translation": "Good sons and good women, whose minds aren't disturbed and aren't disturbed by anything, contemplate that the Tathāgata has great authority, give rise to a deep, sincere faith, dress in fresh and pure clothing for seven days and nights, honor and make offerings, and concentrate on the Tathāgata's treasures of great merit, and their minds won't change; if they aren't disturbed for seven days or even for a day and a night, they'll surely see the Buddha when their lives end.\"",
        "source": "T16n0658_006:0235b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除蓋障菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Removing Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T16n0658_006:0235b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗有眾生於如來所說不信受者？」",
        "translation": "Are there sentient beings who don't believe and accept what the Tathāgata teaches?\"",
        "source": "T16n0658_006:0235b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即答言：「善男子！",
        "translation": "The Buddha then replied, \"Good sons!",
        "source": "T16n0658_006:0235b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有。",
        "translation": "\"There are.",
        "source": "T16n0658_006:0235b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生聞佛所說不肯信受，深生惱害，於說法者生惡知識想，以是因緣，身壞命終墮於地獄。",
        "translation": "Perhaps a sentient being who hears what the Buddha teaches refuses to believe it, becomes deeply distressed, and gives rise to the idea of a bad friend in the person who teaches the Dharma; as a result, they'll be destined to fall into hell when their body breaks up and their life ends.",
        "source": "T16n0658_006:0235b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0235b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞如來有大威德，生世尊想、生大師想，如此之人已於前世得聞如來無量功德，以是因緣今復續聞。",
        "translation": "If someone hears that the Tathāgata has great authority and gives rise to the conception of the world-honored one and the conception of the great teacher, then they've already heard about the Tathāgata's measureless merits in a previous life, and they'll continue to hear about it now because of these causes.",
        "source": "T16n0658_006:0235b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即自思惟：『我等先身必曾從佛聞如此法。』」",
        "translation": "They then thought to themselves, 'We must have heard this teaching from the Buddha in our previous lives.'\"",
        "source": "T16n0658_006:0235b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，如來即出廣長舌相自覆其面，其舌廣長踰於髮際乃至覆頭，覆頭已復覆其身，覆身已覆師子座，又覆菩薩、聲聞、緣覺、護世四天王、梵天、帝釋，遍覆一切無量大眾。",
        "translation": "At that point, the Tathāgata then produced a broad and long tongue that covered his face, was so broad and long that it reached past the hairline and covered his head, covered his body after covering his head, covered the lion's throne after covering his body, covered bodhisattvas, śrāvakas, pratyekabuddhas, the four heavenly kings who protect the world, the Brahma gods, and Indra, and covered an incalculable number of people.",
        "source": "T16n0658_006:0235b28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛還攝舌相告諸大眾：「善男子等！",
        "translation": "The Buddha also gathered his tongue and addressed the crowd, \"Good sons!",
        "source": "T16n0658_006:0235c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是舌相無虛妄耶。",
        "translation": "\"Is such a tongue shape not false?",
        "source": "T16n0658_006:0235c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0235c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若信是事，長夜安隱，得諸利樂。」",
        "translation": "If they believe this, they'll be tranquil for a long time and attain benefits and happiness.\"",
        "source": "T16n0658_006:0235c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，八萬四千眾生得無生法忍，無量眾生遠塵離垢得法眼淨，無量眾生未發菩提心者皆發阿耨多羅三藐三菩提心。",
        "translation": "When he spoke these words, 84,000 sentient beings attained the forbearance of the nonarising of the Dharma, measureless sentient beings became dustless and spotless and attained purification of the Dharma eye, and measureless sentient beings who hadn't yet developed the mind of enlightenment all developed the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0658_006:0235c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告除蓋障菩薩言：「善男子！",
        "translation": "The Buddha again addressed the Bodhisattva Removing the Hindrances, saying, \"Good sons!",
        "source": "T16n0658_006:0235c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名滿世間善。",
        "translation": "\"Again, bodhisattvas have ten things called the filling of worldly goodness.",
        "source": "T16n0658_006:0235c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0235c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖說於色，而於實諦不見有相，亦不著色相；受、想、行、識亦復如是。",
        "translation": "Although it's said to be form, it doesn't see a mark in its true nature and doesn't attach to the mark of form; likewise are feeling, perception, volition, and consciousness.",
        "source": "T16n0658_006:0235c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖說於地，而於實諦不見有相，亦不著地相；水、火、風、空識亦復如是。",
        "translation": "Although it's said to be the ground, it doesn't see a mark in its true nature and doesn't attach to the mark of the ground; likewise are water, fire, air, and space consciousnesses.",
        "source": "T16n0658_006:0235c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖說於眼，而於實諦不見有相，亦不著眼相；雖說鼻、舌、身、意法，而於實諦不見有相，亦不著意法等相。",
        "translation": "Although it's said that the eye exists, it doesn't see any marks in its true nature, and it doesn't attach to the marks of the eye; although it's said that the nose, tongue, body, and mind are phenomena, they don't see any marks in their true nature, and they don't attach to the marks of mind as phenomena.",
        "source": "T16n0658_006:0235c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖說有我，而於實諦不見有相，亦不著我相；眾生壽者、命者、丈夫人，而於實諦不見有相，亦不取著。",
        "translation": "Although it's said that there's a self, but in their true nature they don't see any marks, and they don't attach to the marks of self, and although it's said that there are sentient beings with long lives, lives, and husbands, in their true nature they don't see any marks, and they don't attach to them.",
        "source": "T16n0658_006:0235c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但世諦假施設有，第一義諦則不可得，亦不取著；世諦假施設有，第一義諦無有體相，亦不取著。",
        "translation": "But whereas the conventional truth nominally has existence, the ultimate truth is unobtainable and isn't attached to, and whereas the conventional truth nominally has existence, the ultimate truth has no essence or characteristics and isn't attached to.",
        "source": "T16n0658_006:0235c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世流布中而有佛法差別，若於實諦亦無佛法善惡之相；但世諦中而有菩提，第一義諦則無菩提，亦無取著。",
        "translation": "Whereas in the conventional truth there are distinctions between the buddha-dharma, in the real truth there's no such thing as the good or bad characteristics of the buddha-dharma; but in the conventional truth there's enlightenment, in the ultimate truth there's no enlightenment, and there's no attachment to it.",
        "source": "T16n0658_006:0235c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0235c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假施設法名為世諦，終不說世諦為第一義諦。",
        "translation": "Suppose he were to designate a teaching as the conventional truth, but he would never say that the conventional truth is the ultimate truth.",
        "source": "T16n0658_006:0235c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0235c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩善於世諦，不名為善於第一義諦。",
        "translation": "A bodhisattva who is good at the conventional truth is not called good at the ultimate truth.",
        "source": "T16n0658_006:0235c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0235c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩滿世間善。",
        "translation": "To have these ten things is called a bodhisattva full of worldly goodness.",
        "source": "T16n0658_006:0235c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0235c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名為善說第一義諦。",
        "translation": "\"Again, there are ten things that bodhisattvas call the well-explained truth of the ultimate truth.",
        "source": "T16n0658_006:0235c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0235c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就無生法忍、成就滅法、成就不壞法、非造作法、是究竟法、非處所法、無言語法、無調戲法、是寂滅法、是賢聖法。",
        "translation": "They achieve the forbearance of nonproduction, achieve cessation, achieve indestructibility, are not created dharmas, are ultimate dharmas, are not situated dharmas, have no verbal dharmas, have no playful dharmas, are tranquil dharmas, and are noble dharmas.",
        "source": "T16n0658_006:0235c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0658_006:0235c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一義諦不生、不滅，非壞、非所作，亦非盡，非文字，亦非調戲所得。",
        "translation": "The ultimate truth is not produced, not ceased, not destroyed, not done, not exhausted, not written, and not acquired through play.",
        "source": "T16n0658_006:0236a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一義諦非言語道，法相寂滅，賢聖之所證覺。",
        "translation": "The ultimate truth is not the path of words, but the tranquility of phenomena, which is realized by the noble ones.",
        "source": "T16n0658_006:0236a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一義諦非壞敗相，諸佛出世及不出世，法相常爾。",
        "translation": "The cardinal truth is not a mark of decay, and the marks of the buddhas that appear or don't appear in the world are always the same.",
        "source": "T16n0658_006:0236a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，菩薩剃除鬚髮、信家非家、出家學道、正信出家、身服袈裟、著壞色衣，精勤修道如救頭然，捨諸虛妄，志求實法。",
        "translation": "Because of this reason, bodhisattvas shave off their hair, believe in what's family and what's not family, leave home and train on the path, leave home with right faith, put on the reddish-brown robes and decaying-colored robes, and diligently cultivate their religious practice as if they were heads of salvation, abandoning all falsehoods and aspiring to the true teaching.",
        "source": "T16n0658_006:0236a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無實法則虛出家，諸佛如來亦虛出世，以是因緣，有真實法。",
        "translation": "If there's no real dharma, then they leave home in vain, and the buddha-tathāgatas also leave the world in vain; for this reason, there's a real and true dharma.",
        "source": "T16n0658_006:0236a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩善解第一義諦。",
        "translation": "To have these ten things is to be called a bodhisattva who well understands the ultimate truth.",
        "source": "T16n0658_006:0236a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0236a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名為善知十二因緣。",
        "translation": "\"Again, bodhisattvas have 10 things called good knowledge of 12 causes and conditions.",
        "source": "T16n0658_006:0236a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0236a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知體相空、善知剎那法、善知不堅法、善知如影、如水中月、如呼聲響、善知法如幻、善知法如電、善知法如焰、如因緣生法。",
        "translation": "They well know the emptiness of substances, well know momentary things, well know insubstantial things, well know things like shadows, like the moon in water, like the sound of voices, well know things like illusions, well know things like lightning, well know things like flames, and well know things that arise by causes and conditions.",
        "source": "T16n0658_006:0236a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此悉是空，一剎那頃不堅法，如是，乃至因緣生法，此法生亦見生、住亦見住、異壞亦見異壞。",
        "translation": "These are all empty, insubstantial dharmas of a moment's duration, such as these, and even dharmas that arise from causes and conditions, which are born and seen to be born, abide and seen to abide, and change and see to change and change.",
        "source": "T16n0658_006:0236a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是思惟：『以何因緣生？",
        "translation": "The bodhisattva thus contemplates, 'By what causes and conditions is it produced?'",
        "source": "T16n0658_006:0236a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣滅？』",
        "translation": "By what causes and conditions does it cease?'",
        "source": "T16n0658_006:0236a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復更思惟：『因無明故，能生諸法；無明力故，諸法得出。",
        "translation": "The bodhisattva then further contemplates, 'It's because of ignorance that dharmas can arise, and it's because of the power of ignorance that dharmas can come forth.",
        "source": "T16n0658_006:0236a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法，無明為導；一切諸法，依止無明。",
        "translation": "Nescience guides all dharmas, and all dharmas rely on nescience.",
        "source": "T16n0658_006:0236a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依無明故，能生於行；依行故，生識；識因緣生名色、名色因緣生六入、六入因緣生觸、觸因緣生受；受因緣故，凡愚眾生於受少分便起染愛；愛因緣生取、取因緣生有、有因緣生生、生因緣有老死；丈夫人老死，死因緣憂、悲、苦、惱眾苦聚集，以是因緣生大苦陰。』",
        "translation": "It's because of nescience that form can arise; it's because of form that consciousness can arise; it's because of consciousness that name-and-form arise, and because of name-and-form arise the six sense-fields, and because of the six sense-fields arise contact, and because of contact arise sensation; it's because of sensation that ordinary foolish sentient beings develop defiled attachment to a small part of sensation; it's because of attachment that grasping arises, because of grasping arises, because of being arises, and because of birth arises old age and death; when a man ages and dies, the causes of death are grief, sorrow, suffering, and vexation, and the many kinds of suffering gather; by these causes and conditions, the great aggregate of suffering arises.'",
        "source": "T16n0658_006:0236a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以深智慧慇懃方便，當斷無明、拔無明根，滅於無明，無明相應法一切盡滅。",
        "translation": "With the skillful means of profound wisdom, they'll end ignorance, uproot ignorance, and cease ignorance, and all the things associated with ignorance will cease.",
        "source": "T16n0658_006:0236a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如命根盡時，諸根都盡；無明盡時，依無明法一切悉盡。",
        "translation": "It's like when the life root is ended, all the faculties are ended, and when ignorance is ended, all the things that depend on ignorance are ended.",
        "source": "T16n0658_006:0236a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明滅故，諸煩惱滅；煩惱滅故，生死因皆滅；生死滅故，近於涅槃。",
        "translation": "When nescience ceases, the afflictions cease; when the afflictions cease, the causes of birth-and-death all cease; and when birth-and-death ceases, it's close to nirvāṇa.",
        "source": "T16n0658_006:0236a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩善知十二因緣。",
        "translation": "To have these ten things is called a bodhisattva who well knows the twelve causes and conditions.",
        "source": "T16n0658_006:0236b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0236b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名善知我。",
        "translation": "\"Again, bodhisattvas have ten things called good knowledge of self.",
        "source": "T16n0658_006:0236b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0236b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作如是觀察：『我生誰家？",
        "translation": "The bodhisattva makes this observation: 'Whose family was I born into?'",
        "source": "T16n0658_006:0236b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是婆羅門家？",
        "translation": "Why is it a Brāhmaṇa?",
        "source": "T16n0658_006:0236b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是剎利家？",
        "translation": "Why is it a warrior?",
        "source": "T16n0658_006:0236b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是長者家？",
        "translation": "Why is this the house of an elder?",
        "source": "T16n0658_006:0236b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是下賤家？』",
        "translation": "Why is it a lowly family?'",
        "source": "T16n0658_006:0236b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩雖生上族家而無憍慢想。",
        "translation": "Although a bodhisattva is born into a higher family, he doesn't have thoughts of pride.",
        "source": "T16n0658_006:0236b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生下賤處而作是念：『我本曾作不善諸業，以惡業故，今生下賤家。』",
        "translation": "If they are born in a lowly place, they think, 'I've done unskillful actions in the past, and because of bad actions, I've been born in a lowly home.'",
        "source": "T16n0658_006:0236b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣多修厭惡，多修厭惡故欲得出家。",
        "translation": "As a result, they often cultivate disillusionment with evil, and because they often cultivate disillusionment, they want to leave home.",
        "source": "T16n0658_006:0236b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「既出家已作是思惟：『我為何事而求出家？",
        "translation": "\"Once he leaves home, he thinks, 'What do I seek to leave home for?'",
        "source": "T16n0658_006:0236b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫出家法為自度脫亦度於彼，以是因緣，不應懈怠而自懶墮。』",
        "translation": "A renunciant's goal is to save himself and save others; for this reason, he shouldn't be lazy and fall into laziness.'",
        "source": "T16n0658_006:0236b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「作是思惟：『我今出家當何不善？",
        "translation": "\"Thus, he thinks, 'Why isn't it good for me to leave home now?'",
        "source": "T16n0658_006:0236b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有少惡速疾除斷，於諸善法深起愛樂、歡喜無厭，所未斷惡方便令斷。』",
        "translation": "If there's a little evil, quickly remove it, deeply delight in the good qualities, rejoice in them, and make them cease by skillful means.'",
        "source": "T16n0658_006:0236b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是復更觀察：『我等出家，云何增廣善法？",
        "translation": "Again, observe, 'How have we left home to increase and expand the good qualities?'",
        "source": "T16n0658_006:0236b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善法增已，當倍愛樂、深心歡喜；善法未增當令增廣。",
        "translation": "After the good qualities increase, you'll be doubly delighted and deeply rejoice, and you'll cause the good qualities that have yet to increase to increase.",
        "source": "T16n0658_006:0236b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今依怙師僧增廣善法，以是因緣於和上所——若持戒、若破戒，若多聞、若少聞，若聰明、若無智——悉皆恭敬生世尊想。",
        "translation": "Now, I rely on the teachers and saṃgha to increase and expand the good Dharma, and for this reason, I respect and give rise to the idea of the world-honored one in all the peaceful places - whether observing or violating the precepts, well-versed or little-versed, intelligent or not-intelligent.",
        "source": "T16n0658_006:0236b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸世尊恭敬供養，信樂歡喜；於和上所亦復如是，於阿闍梨復生恭敬。",
        "translation": "They respect and make offerings to the world-honored ones, believing and rejoicing in them, and so it is at the higher realms, where they also give rise to respect for the ācārya.",
        "source": "T16n0658_006:0236b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我依阿闍梨故，善法增廣，菩提法分未滿足者當令使滿、諸結未斷者當令使斷。』",
        "translation": "Because I rely on the ācārya, the good qualities will increase and expand, and I'll cause those portions of the awakening dharma that haven't been fulfilled to be completed, and I'll cause those bonds that haven't been cut to be cut.'",
        "source": "T16n0658_006:0236b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於阿闍梨復生和上想，供養如前，愛樂歡喜，增長右法、損減左法。",
        "translation": "Again, he gives rise to the superior conception of the ācārya, makes offerings as before, and loves and rejoices in him, increasing the right dharma and diminishing the left dharma.",
        "source": "T16n0658_006:0236b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，左法不令增長。",
        "translation": "Thus, they won't allow the left dharma to grow.",
        "source": "T16n0658_006:0236b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復更觀察：『誰是我世尊？",
        "translation": "\"Again, he investigates, 'Who is the Bhagavān?'",
        "source": "T16n0658_006:0236b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切種智是我世尊；能一切覺、能一切說、救濟世間、憐愍眾生、具大悲心、是大福田，是我世尊、天人之師。』",
        "translation": "'This is the Bhagavān who has omniscience, is able to understand everything, explains everything, saves the world, has compassion for sentient beings, has great compassion, and is a great field of merit, which makes him the Bhagavān and teacher of gods and humans.'",
        "source": "T16n0658_006:0236b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣、以是相貌，應生信敬，愛樂歡喜。",
        "translation": "Because of these causes and conditions and because of this appearance, you should have faith and respect, love and rejoice.",
        "source": "T16n0658_006:0236b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復思惟：『我得大利，遇佛、世尊、如來制戒，我今寧捨身命終不毀犯如來制戒。』",
        "translation": "\"Again, he thinks, 'I've attained great rewards in meeting the Buddha, the Bhagavān, and the Tathāgata's established precepts; now, I'd rather lay down my life and never violate the Tathāgata's established precepts.'",
        "source": "T16n0658_006:0236b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名善受佛教。",
        "translation": "This is called the well-acquired teaching.",
        "source": "T16n0658_006:0236b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『我今當應從誰受供？",
        "translation": "\"'From whom should I accept offerings now?'",
        "source": "T16n0658_006:0236c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今者，當從剎利、婆羅門、聚落、城邑受彼供施，令彼果報尊貴富樂。",
        "translation": "\"Now, I will accept an offering from a bāli, a brāhmaṇa, a village, or a town, so that their rewards will be honorable and prosperous.",
        "source": "T16n0658_006:0236c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦不應虛受人供，如是剎利、婆羅門、聚落、城邑皆作何想？",
        "translation": "I also shouldn't accept offerings from people in vain; what would I think of such a bāli, brāhmaṇa, village, or town?",
        "source": "T16n0658_006:0236c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今思惟有何功德而施飲食？",
        "translation": "Now, I think, what merit do I have in giving and drinking?",
        "source": "T16n0658_006:0236c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎利、婆羅門、聚落、城邑當念我是沙門、作福田想，我今應當具滿沙門所行之道、比丘功德、沙門功德，福田淨業宜稱其名。』",
        "translation": "'Bālīs, brāhmaṇas, villages, and towns should think of me as an ascetic and cultivate the notion of a field of merit; now I should complete the path practiced by ascetics, the virtues of monks, the virtues of ascetics, and the pure activities of the field of merit that should be called their names.'",
        "source": "T16n0658_006:0236c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『我今處生死中當自拔出，我今已得出家善利、我今初得無上大利、我得出家即是無上大利、我今能稱出家之法亦是無上大利，我今當勤精進，遠離懈怠，亦疾速出生死災患。』",
        "translation": "\"'Now, when I'm in the midst of birth-and-death, I'll extricate myself, for now I've attained the good benefits of leaving home, now I've attained the unsurpassed benefits of first attaining home, my attaining home is the unsurpassed benefits, and now I can claim that the method of leaving home is also the unsurpassed benefits, so now I'll make diligent effort to avoid laziness and quickly escape the scourge of birth-and-death.'",
        "source": "T16n0658_006:0236c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩出家常應執念如是思惟。",
        "translation": "A bodhisattva who leaves home should always be mindful and think in this way.",
        "source": "T16n0658_006:0236c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0236c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩善知於我。",
        "translation": "To have these ten things is to be called a bodhisattva who well knows the self.",
        "source": "T16n0658_006:0236c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0236c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名善知世法。",
        "translation": "\"Again, bodhisattvas have ten things called good knowledge of worldly phenomena.",
        "source": "T16n0658_006:0236c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0236c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於自高人起卑賤想、於憍慢人起恭敬想、於諂曲人起質直想、於妄語人起真實想、於憎惡人起愛樂想、於剛強人起柔軟想、於不忍人起忍辱想、於瞋忿人起慈心想、於苦惱人起悲心想、於多貪人起施與想。",
        "translation": "They give rise to thoughts of inferiority in regard to someone who's proud, respectful thoughts in regard to someone who's proud, honest thoughts in regard to someone who's flattering, true thoughts in regard to someone who's lying, pleasant thoughts in regard to someone who's hateful, tender thoughts in regard to someone who's strong, tolerant thoughts in regard to someone who's intolerant, compassionate thoughts in regard to someone who's angry, compassionate thoughts in regard to someone who's suffering, and generous thoughts in regard to someone who's greedy.",
        "source": "T16n0658_006:0236c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩善知世法。",
        "translation": "To have these ten things is called a bodhisattva who well knows the ways of the world.",
        "source": "T16n0658_006:0236c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0236c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名能生淨佛國土。",
        "translation": "\"Again, there are ten things that bodhisattvas call being able to give rise to a pure Buddha land.",
        "source": "T16n0658_006:0236c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0236c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持戒清淨無闕戒無嫌戒、於一切眾生心常平等、同其事業具諸功德、遠離名聞讚歎利養、不染八法深信不疑、勤修精進無有懈怠、攝心禪定無諸錯亂、善修多聞遠離無智、利根聰慧滅除愚闇、於瞋惱眾生恒修慈心。」",
        "translation": "They observe the precepts with purity, have no defective precepts, have no objection to the precepts, are always equal in mind toward all sentient beings, share their undertakings with virtue, are free of fame and praise for profit, aren't defiled by the eight dharmas and are convinced without doubt, diligently cultivate effort without laziness, collect their minds in meditation without distortion, well cultivate learning, avoid ignorance, sharpen their faculties and wisdom, eliminate ignorance, and cultivate a constant mind of kindness toward angered sentient beings.\"",
        "source": "T16n0658_006:0236c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除蓋障菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Removing Hindrances said to the Buddha, \"Bhagavān!",
        "source": "T16n0658_006:0236c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若十事不具，能生淨土不？」",
        "translation": "If you don't have all ten things, can you be born in the Pure Land?\"",
        "source": "T16n0658_006:0236c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即答言：「善男子！",
        "translation": "The Buddha then replied, \"Good sons!",
        "source": "T16n0658_006:0236c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能於一事具足無闕，當知十事悉皆清淨，以是義故，名具十事得生淨土。",
        "translation": "If you can completely fulfill one thing without fail, you should know that all ten things are purified, and because of this, it's called fulfilling ten things to be born in the Pure Land.",
        "source": "T16n0658_006:0236c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0236c29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩能生淨佛國土。",
        "translation": "When these ten things are present, this is called a bodhisattva who's capable of giving rise to a pure Buddha land.",
        "source": "T16n0658_006:0237a01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0237a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法名胎不染污。",
        "translation": "\"Again, bodhisattvas have ten things called the undefiled womb.",
        "source": "T16n0658_006:0237a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0237a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作諸形像、如來塔寺若有毀壞嚴飾修治、復以諸香泥塗於佛塔如來形像、常以香湯洗浴、於如來塔塗掃清淨、於父母所躬自供養、於和上阿闍梨同梵行者心常恭敬供養不為財利、以此善根迴與一切眾生、願令皆得胎不染污、心常殷重如是思惟。",
        "translation": "\"He makes images of the Tathāgata, decorates and repairs them if they're damaged, paints the images of the Tathāgata with scented clay, always washes them with scented baths, cleans the Tathāgata's stūpa with scented water, makes offerings to his parents, always venerates and makes offerings to Vajra practitioners and fellow priests, doesn't seek financial gain, and returns this good root to all sentient beings in the hope that they'll all be born undefiled, always paying close attention to his mind as he thinks.",
        "source": "T16n0658_006:0237a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0237a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩胎不染污。",
        "translation": "These are the ten things that make a bodhisattva's womb undefiled.",
        "source": "T16n0658_006:0237a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0658_006:0237a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復有十法，名捨家出家。",
        "translation": "\"Again, there are ten things that bodhisattvas call renouncing home and leaving home.",
        "source": "T16n0658_006:0237a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0658_006:0237a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所受用、於可染處終不親近、背於五欲、除諸愛渴、於如來所制禁戒終不毀犯、少欲知足、衣服飲食床敷臥具趣得支命終不貪積、於五欲所常生畏怖、恒念厭離、修集善法。",
        "translation": "They have no enjoyment, never approach defiled places, turn their backs on the five desires, get rid of cravings, never violate the prohibitions established by the Tathāgata, have few desires and are satisfied, dress themselves in food and drink, lay on beds and bedding, never accumulate cravings for a living, always become frightened of the five desires, always become disillusioned, and cultivate good qualities.",
        "source": "T16n0658_006:0237a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0658_006:0237a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具此十事是名菩薩捨家出家。",
        "translation": "These ten things are called a bodhisattva renouncing home and leaving home.",
        "source": "T16n0658_006:0237a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶雲經卷第六",
        "translation": "Jewel Cloud Sutra, Vol. 6",
        "source": "T16n0658_006:0237a16_0",
        "is_bad_quality": false
    }
]