[
    {
        "source_sentence": "佛說摩訶剎頭經(亦名灌佛形像經)西秦沙門釋聖堅譯「摩訶剎頭、諸天、人民、長老，皆明聽。",
        "translation": "The Mahāsaṃdhara Sutra (also called the Sutra on Consecrating Buddha Images) was translated by the Western Qin ascetic Śākyamuni: \"The Mahāsaṃdhara, the gods, the people, and the elders all listened clearly.",
        "source": "T16n0696_001:0797c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「夫得為人難，無上道亦然；人命難得，佛世難值。",
        "translation": "\"It's difficult for a person to become a human being, and so is the unsurpassed path; human life is difficult to obtain, and the Buddha's life is difficult to attain in this world.",
        "source": "T16n0696_001:0797c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦文佛本出阿僧祇劫時，佛身作白衣時，累功積德，每生自剋；展轉五道，不貪財寶出身施與。",
        "translation": "When the Śākyamuni Buddha first emerged from the incalculably long eon, the Buddha himself worked as a white-robed man, accumulating merit and virtue, and he took turns in the five destinies, not craving wealth or birth to give.",
        "source": "T16n0696_001:0797c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自致為王太子，以四月八日，夜半明星出時生。",
        "translation": "He became the king's prince and was born on the eighth day of the fourth month, at midnight, when the stars rose.",
        "source": "T16n0696_001:0797c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "墮地行七步，舉右手而言：『天上天下，我當為人民作師。』",
        "translation": "He fell to the ground and took seven steps, raised his right hand, and said, 'I will be a teacher for the people of heaven and earth.'",
        "source": "T16n0696_001:0797c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「太子生時，天地皆為大動。",
        "translation": "\"When the crown prince was born, the heavens and earth were greatly agitated.",
        "source": "T16n0696_001:0797c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七梵天、第二忉利天王釋，及第一四天王，皆來下，持十二種香湯、雜華，用浴太子身。",
        "translation": "The seventh brahma god, the second goddess Śākyamuni, and the first four heavenly kings all came down and brought 12 kinds of fragrant baths and mixed flowers to bathe the prince's body.",
        "source": "T16n0696_001:0797c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子立身作佛，開視道法，以示天下人。」",
        "translation": "The prince established himself as a buddha and revealed the teaching of the Way to the people of the world.\"",
        "source": "T16n0696_001:0797c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告天下人民：「十方諸佛，皆用四月八日夜半時生；十方諸佛，皆用四月八日夜半時，去家入山行學道；十方諸佛，皆用四月八日夜半時得佛道；十方諸佛，皆用四月八日夜半時般泥洹。」",
        "translation": "The Buddha told the people of the world, \"It's the eighth day of the fourth month when all the buddhas of the ten directions are born, the eighth day of the fourth month when all the buddhas of the ten directions leave home and enter the mountains to train on the path, the eighth day of the fourth month when all the buddhas of the ten directions attain the Buddha Way, and the eighth day of the fourth month when all the buddhas of the ten directions become parinirvāṇas.\"",
        "source": "T16n0696_001:0797c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「所以用四月八日者何？",
        "translation": "The Buddha said, \"Why do they use the eighth day of the fourth month?",
        "source": "T16n0696_001:0797c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "春夏之際殃罪悉畢，萬物普生毒氣未行，不寒不熱時氣和適。",
        "translation": "In spring and summer, all misfortune and sin are ended, all things that grow in abundance have not yet become toxic, and it's neither cold nor hot when the weather is pleasant.",
        "source": "T16n0696_001:0797c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是佛生日故，諸天下人民共念佛功德，浴佛形像如佛在時，是故以示天下人。」",
        "translation": "Now, on the Buddha's birthday, the people of the world remember the merits of the Buddha and bathe him in his image as if he were here, so I'm showing him to the people of the world.\"",
        "source": "T16n0696_001:0797c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我為菩薩在世時，三十六反為天王釋、三十六反作金輪王、三十六反作飛行皇帝。",
        "translation": "The Buddha said, \"When I was a bodhisattva in the world, I was 36 times the king of gods and 36 times the golden wheel-turning king, and 36 times the flying emperor.",
        "source": "T16n0696_001:0797c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日諸賢者，誰有好心善意，念釋迦文佛恩德者，以香華浴佛形像求第一福者，諸天鬼神所證明知。」",
        "translation": "Today, good men, whoever has good intentions and good intentions and is mindful of the merits of Śākyamuni Buddha and seeks the greatest merit by bathing his image with incense and flowers, gods and spirits will clearly know about it.\"",
        "source": "T16n0696_001:0797c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人身難得，佛經難得聞。",
        "translation": "The Buddha said, \"The human body is hard to come by, and Buddhist sūtras are hard to hear.",
        "source": "T16n0696_001:0797c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能自減省，持五家財物，用浴佛形像，自在所願。",
        "translation": "Those who can reduce themselves, maintain five household possessions, and bathe a Buddha's image with flowers can freely pursue their desires.",
        "source": "T16n0696_001:0798a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲求度世無為道，長不欲與生死會者，可得；欲求精進勇猛，立身如釋迦文佛者，可得；欲求文殊師利、阿惟越致菩薩飛行教授，人民具相，可得；欲求辟支佛、阿羅漢，可得；欲求閉絕三惡，根本生天上、人間，可得；欲求作第七梵天及第二忉利天王釋，可得；欲作飛行皇帝，可得；欲在世間豪貴，可得；欲求財富巨億萬家生，可得；欲求百子千孫，可得；欲求長壽無病，可得。",
        "translation": "欲求度世無為道，長不欲與生死會者，可得；欲求精進勇猛，立身如釋迦文佛者，可得；欲求文殊師利、阿惟越致菩薩飛行教授，人民具相，可得；欲求辟支佛、阿羅漢，可得；欲求閉絕三惡，根本生天上、人間，可得；欲求作第七梵天及第二忉利天王釋，可得；欲作飛行皇帝，可得；欲在世間豪貴，可得；欲求財富巨億萬家生，可得；欲求百子千孫，可得；欲求長壽無病，可得。",
        "source": "T16n0696_001:0798a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間人寧亡身上一臠肉，不欲亡一錢，人生不持一錢來，死亦不持一錢去，財物故留世間，死當受苦惱；持用浴佛，生死與俱，無有斷絕。」",
        "translation": "People in the world would rather lose a cut of flesh on their bodies than a penny, and they don't want to lose a penny when they're born and don't want to leave with a penny when they die.",
        "source": "T16n0696_001:0798a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「閻浮利內外諸天梵釋、鬼神、龍，皆當擁護浴佛形像者，從是因緣，得佛泥洹道。」",
        "translation": "The Buddha said, \"The gods, priests, spirits, and dragons inside and outside of Jambudvīpa will embrace those who bathe the Buddha's image, and from this cause they'll attain the Buddha's nirvāṇa path.\"",
        "source": "T16n0696_001:0798a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸持好香、湯，浴佛形像者，自得其福，所在清淨名聞；持好花上佛者，自得其福，端正好色無比；持繒幡上佛者，自得其福，在所從生常得自然，好衣無極。」",
        "translation": "The Buddha said, \"Those who bathe a Buddha's image with good incense and hot water will attain their own fortune and be known for the purity of their location; those who present the Buddha with good flowers will attain their own fortune and have an unsurpassed appearance of beauty; and those who present the Buddha with a silken banner will attain their own fortune and always attain naturalness in their place of birth, with good clothing that has no limit.\"",
        "source": "T16n0696_001:0798a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我累功積德行善至誠，持戒、忍辱、精進、一心、智慧，乃自致得作佛耳。",
        "translation": "The Buddha said, \"I've accumulated merit, cultivated goodness and sincerity, and I've attained Buddhahood by observing precepts, tolerating humiliation, making effort, unifying my mind, and exercising wisdom.",
        "source": "T16n0696_001:0798a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「灌佛形像所得多少，當作三分分之：一者為佛錢、二者為法錢、三者為比丘僧錢。",
        "translation": "\"The amount obtained by consecrating a Buddha image should be divided into three parts: one for the Buddha's money, two for the Dharma's money, and three for the monks' money.",
        "source": "T16n0696_001:0798a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛錢繕作佛形像，若金、若銅、若木、若泥、若塐、若畫，以佛錢修治之；法錢者，架立樓塔、精舍、籬落、牆壁、內外屋，是為法錢；比丘僧有萬錢，千比丘當共分之。",
        "translation": "The Buddha's money is used to make an image of the Buddha, whether of gold, bronze, wood, clay, aluminum, or paint, and to repair it with the Buddha's money; the Dharma money is used to erect a tower, a dwelling, a hedge, a wall, or an interior or exterior house, which is the Dharma money; and the monks and nuns have ten thousand coins, which should be shared by a thousand monks.",
        "source": "T16n0696_001:0798a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無眾比丘，但一分作，有以一分給與法錢。",
        "translation": "If there aren't many monks but only one share of the work, then one share will be given as Dharma money.",
        "source": "T16n0696_001:0798a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數人亦三分分之，出以一分。",
        "translation": "A few people also shared three parts of it, and one part was given.",
        "source": "T16n0696_001:0798a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持後法錢、僧錢，一文以上不可妄用，私取一錢自私用，以為施惠，見世貧極，後長受苦。",
        "translation": "After collecting the Dharma money and the saṃgha's money, you mustn't spend more than a penny haphazardly; to privately take a penny and use it for selfish purposes would be to see the world in extreme poverty and suffer long afterward.",
        "source": "T16n0696_001:0798a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧以利刀割肉，以施惠人，不以灌佛一錢，私作恩惠；寧吞洋銅，不以灌佛一錢以作恩分；寧自投大火中，不以灌佛一錢與妻子，若共持治，生飯食也，今現世當受恐怖，後世魂神，當受是痛。",
        "translation": "They'd rather cut their flesh with a sharp knife to give alms to someone than use a penny to pour Buddha out as a personal favor; they'd rather swallow foreign copper than use a penny to pour Buddha out as a favor; they'd rather throw themselves into a great fire than use a penny to pour Buddha out with their wives, and if they were to share their treatment and give birth to food, they'd be terrorized in the present life, and their souls and spirits would suffer this pain in the afterlife.",
        "source": "T16n0696_001:0798b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世人多有發意求所願者，布施之日，不計少多，趣使充饒事業，必敬者疲極。",
        "translation": "Many people in the world have the intention to seek what they wish for, and on the day they give alms, they don't count how little or how much they have, but rather aim to enrich their work, and those who respect them will become exhausted.",
        "source": "T16n0696_001:0798b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾家殘肴饌，噉食不盡，當持那置。」",
        "translation": "The leftover food and drink of many families that are devoured will not be exhausted, so they must be preserved.\"",
        "source": "T16n0696_001:0798b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「少多皆當，送以給與，守嵩寺中，持法沙門。",
        "translation": "The Buddha said, \"Both the small and the large should be given, and the monks who maintain the Dharma in Shoushan Temple should give them.",
        "source": "T16n0696_001:0798b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾僧自共分，以出物當望生。",
        "translation": "The saṃgha will share it among themselves, and the things that come out will hopefully grow.",
        "source": "T16n0696_001:0798b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何春種食之，福那得生耶？",
        "translation": "How will the merit of eating it in the spring grow?'",
        "source": "T16n0696_001:0798b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應各各竟分、分歸與妻子。",
        "translation": "They shouldn't each end up with a share and return it to their wives.",
        "source": "T16n0696_001:0798b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為種於石上，根株焦盡終無生時。",
        "translation": "This is planted on a rock, and when its roots are scorched, there's never a time for it to grow.",
        "source": "T16n0696_001:0798b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今以布施者餘福，重以施眾僧，是為施一得萬倍。",
        "translation": "Now, I'll give the rest of the merit of the donor to the saṃgha, for this is a gift that's worth ten thousand times as much as one.",
        "source": "T16n0696_001:0798b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「四月八日浴佛法，都梁、藿香、艾納，合三種草香，挼而漬之，此則青色水；若香少，可以紺黛、秦皮，權代之矣。",
        "translation": "\"On the eighth day of the fourth month, the Buddha's bath is made by combining three kinds of herbaceous incense with turuṣka, patchouli, and āna, and pickling it, which makes it blue-colored water; if the incense is scarce, then Khandai and qinpi can be used as a substitute.",
        "source": "T16n0696_001:0798b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欝金香手挼而漬之於水中，挼之以作赤水；若香少若乏無者，可以面色權代之。",
        "translation": "Ugandan incense is mixed with water and pickled, and this makes red-colored water; if there's little or no incense, you can substitute the color of your face for it.",
        "source": "T16n0696_001:0798b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "丘隆香擣而後漬之，以作白色水；香少可以胡粉足之，若乏無者，可以白粉權代之。",
        "translation": "He then sours it to make white water; if the fragrance is small, he can add powder to it; if it's lacking, he can substitute white powder for it.",
        "source": "T16n0696_001:0798b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白附子擣而後漬之，以作黃色水；若乏無白附子者，可以梔子權代之。",
        "translation": "He pounds the white aconite and then wets it to make yellow-colored water; if there's a lack of white aconite, he can substitute gardenia seeds for its potency.",
        "source": "T16n0696_001:0798b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "玄水為黑色，最後為清淨，今見井華水名玄水耳。",
        "translation": "Xuanshui is black and ultimately pure, so now we see that well-water is called xuanshui.",
        "source": "T16n0696_001:0798b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右五色水灌，如上疏。",
        "translation": "\"The five-colored water on the right is consecrated as in the above commentary.",
        "source": "T16n0696_001:0798b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以水清淨灌像訖，以白練若白綿拭之矣，斷後自占更灌，名曰清淨灌。",
        "translation": "\"After the image is purified and water is used to cleanse it, he wipes it with a white linen or white cotton, and then he takes it upon himself to further purify it by calling it a purifying watering.",
        "source": "T16n0696_001:0798b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其福與第一福無異也。」",
        "translation": "Its merit is no different from the first merit.\"",
        "source": "T16n0696_001:0798b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說摩訶剎頭經",
        "translation": "Foshuo mahāsattu jing",
        "source": "T16n0696_001:0798b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(此經，宋藏即云：灌洗佛形像經，法炬譯。",
        "translation": "(This sūtra, as it is called in the Song Canon, is called the Sutra on the Washing of Buddha Images, a translation of the Dharma Torch.",
        "source": "T16n0696_001:0798b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "撿尋經文，與宋藏中《摩訶剎頭經》相濫，即宋藏錯亂。",
        "translation": "When I examined the text of the sūtra, I found that it was confused with the Mahāsaṃdhara-sūtra in the Song Canon, which means that the Song Canon was mistaken.",
        "source": "T16n0696_001:0798b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今按丹本，此經却是《摩訶剎頭經》，聖堅譯者，今從丹本，換其經題及譯者云)。",
        "translation": "Now, according to the Dan edition, this sūtra is the Mahāsaṃdhara-sūtra, which was translated by Shengjian, so now we have replaced its title and translator from the Dan edition.)",
        "source": "T16n0696_001:0798b29_2",
        "is_bad_quality": false
    }
]