[
    {
        "source_sentence": "菩薩瓔珞經卷第一(一名現在報)",
        "translation": "Pusa yingluo jing, vol. 1 (A present retribution)",
        "source": "T16n0656_001:0001a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian Translation",
        "source": "T16n0656_001:0001a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普稱品第一",
        "translation": "Most Eminent in the Chapter of Samantabhadra",
        "source": "T16n0656_001:0001a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在摩竭界普勝講堂，與大比丘眾俱，比丘十千、菩薩萬五千人，一切大聖靡不雲集。",
        "translation": "Thus I heard: One time, the Buddha was in the Māgāra realm's universally distinguished discussion hall, accompanied by a large assembly of monks, 10,000 monks, 15,000 bodhisattvas, and all the great sages gathered there.",
        "source": "T16n0656_001:0001a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸德具足不捨總持，其志弘普無所不包，辯才通達除去疑網，遊於神通解說深義，以權方便適化隨宜，慈及下劣得至彼岸，宣暢如來三昧正受。",
        "translation": "They were replete with virtues that didn't let go of the Dhāraṇī, their aspirations were widespread and omnipresent, their eloquence and knowledge removed webs of doubt, they traveled around with supernormal powers, explained profound subjects, adapted them with expedient methods, were kind and inferior, reached the other shore, and proclaimed the Tathāgata's correct reception of samādhi.",
        "source": "T16n0656_001:0001a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛嗟歎天人所敬，所願自在而無罣礙，普遊殊勝奇特之域，神足變化眾相具足，降伏眾魔曉了法慧。",
        "translation": "They are held in high esteem by gods and humans, freely wishing for something without obstruction, traveling to extraordinary and peculiar places, fully endowed with miraculous abilities and various forms, and subduing Māra to understand the wisdom of the Dharma.",
        "source": "T16n0656_001:0001a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別諸法深知本際，觀察眾生昔所根原，演暢道品空無相願，於世八事而無染著，加以大慈救濟眾生，護身口意無有邪見，志崇精進心若金剛。",
        "translation": "He discerns the fundamental nature of all dharmas, observes the origins of sentient beings in the past, presents the qualities of the path as empty and formless, vows to perform eight worldly tasks without defiled attachment, combines great kindness to save sentient beings, guards his body, speech, and mind from wrong views, and has a heart as resolute as adamantine in his determination and dedication.",
        "source": "T16n0656_001:0001a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖執勤勞於無數劫，心恒勇猛無有厭惓。",
        "translation": "Although he perseveres in exertion for countless eons, his mind remains resolute and untiring.",
        "source": "T16n0656_001:0001a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在諸大眾現師子威，降伏異學令不有退，以聖別號而印可之，諸佛遊處悉皆履行，皆是正覺之所修行。",
        "translation": "He demonstrates the authority of a lion among the masses, subdues renegade students so that there's no turning back, approves them with the distinctive names of sages, and fulfills all of the places where the buddhas travel, all of which are practiced by the right awakening.",
        "source": "T16n0656_001:0001a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嚴淨道場巍巍無量，若行若坐入無底慧，心恒悅豫亦無怯弱，所講演法平等無二，以成未成視如同類，功稱名勳常得自在，修深法要訓以道教，若在大眾威相光光，神智妙達不可稱計。",
        "translation": "His adorned and pure site of enlightenment is so lofty and immeasurable that if he walks or sits there, he enters into the bottomless wisdom, his mind is constantly pleased, and he has no faltering, the teachings he presents are equal and without distinction, he regards those who have accomplished or failed to accomplish anything as equals, he always attains mastery over names and honors, cultivates the profound essentials of the Dharma, and teaches the Way, and if he's in the masses, his authority and features are radiant, and his spiritual wisdom is marvelous and incalculable.",
        "source": "T16n0656_001:0001a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彈指之頃，遊於無量諸佛國土，供養十方諸正覺等。",
        "translation": "In a snap of his fingers, he travels to measureless buddha lands and makes offerings to the correct awakenings in ten directions.",
        "source": "T16n0656_001:0001a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰：歡曜菩薩、山雷菩薩、慧密菩薩、普明菩薩、濟彼菩薩、總持菩薩、金剛菩薩、石磨王菩薩、雷震菩薩、雨渧菩薩、善算菩薩、智積菩薩、法上菩薩、息意菩薩、除幻菩薩、善稱菩薩、虛空藏菩薩、威力菩薩、焰光菩薩、識機菩薩、盡慧菩薩、無邊際菩薩、堅固志菩薩、月光菩薩、法熾菩薩、無見菩薩、無等菩薩、日盛明菩薩。",
        "translation": "其名曰：歡曜菩薩、山雷菩薩、慧密菩薩、普明菩薩、濟彼菩薩、總持菩薩、金剛菩薩、石磨王菩薩、雷震菩薩、雨渧菩薩、善算菩薩、智積菩薩、法上菩薩、息意菩薩、除幻菩薩、善稱菩薩、虛空藏菩薩、威力菩薩、焰光菩薩、識機菩薩、盡慧菩薩、無邊際菩薩、堅固志菩薩、月光菩薩、法熾菩薩、無見菩薩、無等菩薩、日盛明菩薩。",
        "source": "T16n0656_001:0001a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十方諸佛世界眾菩薩等，普來雲集詣忍世界，欲聽如來說法瓔珞，大智根門趣菩薩藏，不可思議權現無量。",
        "translation": "Thus, all these bodhisattvas from the Buddha-realms in the ten directions have gathered in clouds to visit the world of patience to hear the Tathāgata explain the diadem of the Dharma and the unfathomably powerful and limitless bodhisattva canon.",
        "source": "T16n0656_001:0001b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及賢劫中彌勒、濡首，十六大聖颰陀惒等，八大神士、帝釋四天王與忉利天人、俱焰天、兜術天、不憍樂天、化自在天、魔子導師、梵天王、梵淨天王、善梵天王、梵具足天王、大神妙天、淨居天、離垢光天，上至一善住天、燕居無善神，及諸樹神、山神、金翅鳥神，及餘一切諸大尊神，一一尊復尊，及諸天、龍、鬼神、阿須倫、迦留羅、真陀羅、摩休勒、人及非人，各與眷屬來詣佛所，稽首畢而立侍焉。",
        "translation": "During the good eon, Maitreya, Mañjuśrī, the 16 great sages, the eight great sages, the four Tishrei gods, the Thirty-three gods, the Kuyen Heaven, the Tuṣita Heaven, the Nirmāṇarati Heaven, the Paranirmitavaśavartin Heaven, the Māra's Son tutor, the Brahmakāyika God, the Brahmakāyika God, the Brahmakāyika God, the Brahmakāyika God, the Mahāsāravaśaila God, the Pure Abode Heaven, the Vimalakīrti Heaven, the Vimalakīrti Heaven, the Vimalakīrti Heaven, the Vimalakīrti Heaven, the Vimalakīrti Heaven, and the Vimalakīrti Heaven, all of them with their retinues came to the Buddha, paid homage, and stood at attention.",
        "source": "T16n0656_001:0001b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘、比丘尼、清信士、清信女，各自修敬，前為佛作禮，各坐一面。",
        "translation": "The monks, nuns, faithful men, and faithful women each paid homage to the Buddha and sat to one side.",
        "source": "T16n0656_001:0001b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊與若干百千之眾營從圍繞。",
        "translation": "At the time, the Bhagavān was surrounded by hundreds of thousands of people in camps.",
        "source": "T16n0656_001:0001b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛昇嚴淨高廣師子之座，與諸大眾說法瓔珞。",
        "translation": "The Buddha ascended to his lion's seat, which was high and wide, and spoke to the crowd about the diadem of the Dharma.",
        "source": "T16n0656_001:0001b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在眾中如須彌山，晃若金[卄/積]，威神光明超世無雙，道德威儀巍巍無量，放大光明靡所不照。",
        "translation": "The Buddha was like Mount Sumeru in the midst of the crowd, shining like gold [twenty/calculus], surpassing the world in majestic radiance, and his moral and dignified bearing was so lofty and immeasurable that his magnificent light didn't fail to shine.",
        "source": "T16n0656_001:0001b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以神變感動十方，應時空中尋有百千寶珓珞蓋，眾珍雜廁遍覆其上，無價寶珠照虛空珠，懸處空中光從珠出，色像無比。",
        "translation": "Again, because of the miraculous transformation that moved the ten directions, there were then hundreds of thousands of jeweled jeweled canopies in the sky, with a variety of precious toilets covering them, and priceless jewels shining as pearls in the sky, where they hung, and light emanating from the pearls, with form and appearance without parallel.",
        "source": "T16n0656_001:0001b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其空中，而興微雲雨諸香華。",
        "translation": "In the sky, a subtle cloud arises and rains down fragrant flowers.",
        "source": "T16n0656_001:0001b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，空中華積至于膝，復出大音遍滿世界。",
        "translation": "The flowers in the sky then piled up to their knees and produced another great sound that filled the world.",
        "source": "T16n0656_001:0001b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有菩薩名曰普照，承佛聖旨，即從座起長跪叉手，前白佛言：「今所神感未曾見聞，此何瑞應乃至於斯？",
        "translation": "Then, a bodhisattva named Puzhao, who had received the Buddha's holy command, rose from his seat, knelt down long with his palms together, and said to the Buddha, \"I've never seen or heard of this miraculous feeling before, what is this auspicious response up to here?",
        "source": "T16n0656_001:0001b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願大聖敷演其義，使諸會者永無狐疑。」",
        "translation": "May the great sage expound its meaning so that those who attend will never have misgivings.\"",
        "source": "T16n0656_001:0001b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告普照：「還復汝座。",
        "translation": "The Buddha told Puzhao, \"Return to your seat.",
        "source": "T16n0656_001:0001c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當與汝一一分別法瓔珞義，修立根門超越妄想，近一切智諸通慧地。」",
        "translation": "I will give you the meaning of a single, distinctive Dharma yarn, cultivate the faculties, transcend deluded perceptions, and approach the stage of omniscience and all-powerful wisdom.\"",
        "source": "T16n0656_001:0001c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復以神足，觀諸菩薩所入定意，其法名曰道樹瓔珞，淨諸大士莊嚴道場，覺道正法而無所畏，遊諸聖慧而得自在，所入道門不失辯才。",
        "translation": "At the time, the Bhagavān again had the miraculous powers to observe the concentrations entered by the bodhisattvas, which are called jewels of the path tree, purify the adorned site of enlightenment of great persons, awaken to the right path and teachings without fear, travel to the noble wisdoms, and attain freedom, and enter the path without losing their eloquence.",
        "source": "T16n0656_001:0001c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以神通瓔珞其座，演暢分別不退轉地，解一法界空無所有。",
        "translation": "They also decorate their seats with the superknowledge, speak fluently and discern the ground of nonretrogression, and understand that the single reality realm is empty and nonexistent.",
        "source": "T16n0656_001:0001c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀察眾生利鈍之性，堅固其心決一切法，除去塵勞隨順法要，所言信用無所染著，應對無疑來往發遣，說無礙智永離縛著，積功累德不懷希望，所說諸法真如審諦，不計有為當有成辦，相則無相，為興相為？",
        "translation": "He observes the sharp and dull natures of sentient beings, resolutely determines all dharmas in his mind, rids himself of worldly sufferings and follows the essentials of the Dharma, speaks faithfully without defiled attachment, responds without doubt and dispatches, explains unhindered cognition, remains free of fetters, accumulates merit, doesn't harbor hopes, truly examines the truth of the teachings he presents, doesn't discriminate between existent and will-be accomplishments, and produces marks when there are no marks.",
        "source": "T16n0656_001:0001c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了深妙十二緣起，尋究根源而不可限。",
        "translation": "He had understood the profound and subtle twelve links of dependent arising, and he had investigated their source without limit.",
        "source": "T16n0656_001:0001c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，普照菩薩復從座起，前白佛言：「願欲所問，唯然聽者，乃自宣陳。」",
        "translation": "The Universal Illumination Bodhisattva then rose from his seat and said to the Buddha, \"I wish to ask this question, but I'll explain it myself if you'll listen.\"",
        "source": "T16n0656_001:0001c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, \"Good!",
        "source": "T16n0656_001:0001c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在所欲問，若有疑者便自演暢，如來當為具發遣之。」",
        "translation": "If you have any questions, then you can explain them yourself, and the Tathāgata will fully explain them away.\"",
        "source": "T16n0656_001:0001c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，普照見聽喜踊，尋時問曰：「何謂菩薩法瓔珞身？",
        "translation": "Seeing and hearing this, Prasenajit was elated and asked, \"What's the bodhisattva's diadem body?",
        "source": "T16n0656_001:0001c17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩除其妄見？",
        "translation": "What does it mean for a bodhisattva to be free of his false views?",
        "source": "T16n0656_001:0001c18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩起出世法？",
        "translation": "What does it mean for a bodhisattva to give rise to transmundane dharmas?",
        "source": "T16n0656_001:0001c19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩遊至世界？",
        "translation": "What is meant by a bodhisattva traveling to the world?",
        "source": "T16n0656_001:0001c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩親近如來？",
        "translation": "What is meant by a bodhisattva being intimate with the Tathāgata?",
        "source": "T16n0656_001:0001c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不處母胎？",
        "translation": "What is meant by a bodhisattva not being in his mother's womb?",
        "source": "T16n0656_001:0001c20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩生輒神識不有錯亂？",
        "translation": "What is meant by a bodhisattva's innate divine consciousness not being disturbed?",
        "source": "T16n0656_001:0001c21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩而懷篤信？",
        "translation": "What does it mean for a bodhisattva to have devout faith?",
        "source": "T16n0656_001:0001c21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩不自為己？",
        "translation": "How do bodhisattvas not take it upon themselves?",
        "source": "T16n0656_001:0001c22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩救眾緣苦？",
        "translation": "What does it mean for a bodhisattva to save all people from suffering?",
        "source": "T16n0656_001:0001c22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩法施財施？",
        "translation": "What is meant by a bodhisattva's giving of goods and services according to the Dharma?",
        "source": "T16n0656_001:0001c23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩分別空義？",
        "translation": "What does it mean for a bodhisattva to discern the meaning of emptiness?",
        "source": "T16n0656_001:0001c23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩除其陰蓋？",
        "translation": "What does it mean for a bodhisattva to remove the hindrances of his aggregate?",
        "source": "T16n0656_001:0001c24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩廣熾法戒？",
        "translation": "What is meant by the bodhisattva precept for extensively blazing the Dharma?",
        "source": "T16n0656_001:0001c24_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩聞法無厭？",
        "translation": "What is meant by a bodhisattva hearing the Dharma without tiring of it?",
        "source": "T16n0656_001:0001c25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩遊戲止觀？",
        "translation": "What is meant by a bodhisattva's playful cessation and contemplation?",
        "source": "T16n0656_001:0001c25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩奉修禁戒？",
        "translation": "What is meant by a bodhisattva's commitment to the observance of the precepts?",
        "source": "T16n0656_001:0001c26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩誓離世法？",
        "translation": "What is meant by a bodhisattva's vow to leave worldly dharmas?",
        "source": "T16n0656_001:0001c26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不處家業？",
        "translation": "What is meant by a bodhisattva not being in family business?",
        "source": "T16n0656_001:0001c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩無著？",
        "translation": "What does it mean for a bodhisattva to be unattached?",
        "source": "T16n0656_001:0001c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩一坐一起？",
        "translation": "What is meant by a bodhisattva sitting together in one place?",
        "source": "T16n0656_001:0001c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩口密心非？",
        "translation": "What is meant by a bodhisattva's being secretive in speech but not in thought?",
        "source": "T16n0656_001:0001c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所問義旨要如是。」",
        "translation": "The gist of his question is this.\"",
        "source": "T16n0656_001:0001c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「普照！",
        "translation": "The Buddha said, \"Puzhao!",
        "source": "T16n0656_001:0001c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉善哉！",
        "translation": "Bravo, bravo!",
        "source": "T16n0656_001:0001c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃問如來如此之義。",
        "translation": "He then asked the Tathāgata what this meant.",
        "source": "T16n0656_001:0001c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今諦聽，善思念之！",
        "translation": "Now, listen closely, and consider it well!",
        "source": "T16n0656_001:0002a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戢在心懷，無令捨之在凡夫行。」",
        "translation": "They collect them in their minds and don't let them go in worldly behavior.\"",
        "source": "T16n0656_001:0002a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普照對曰：「唯然，世尊！",
        "translation": "Puzhao replied, \"Yes, Bhagavān!",
        "source": "T16n0656_001:0002a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞大聖之法。」",
        "translation": "May I wish to hear the teachings of great sages.\"",
        "source": "T16n0656_001:0002a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，世尊告普照曰：「行菩薩道，當念十德瓔珞其體。",
        "translation": "The Bhagavān then addressed Bojo, \"Practicing the bodhisattva path, you should remember that the ten virtues decorate its body.",
        "source": "T16n0656_001:0002a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身口意法無說人短，於諸同學不興輕慢，心平若空亦無增減，棄諸惡趣不加害人，視彼眾生如己無異，志得由身所知無盡。",
        "translation": "They don't speak ill of others in body, speech, or thought; they don't despise fellow students; their minds are level as if they were empty and don't increase or decrease; they abandon bad destinies and don't harm others; they regard sentient beings as themselves, with no difference in their aspirations; and their knowledge of the body is inexhaustible.",
        "source": "T16n0656_001:0002a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以四諦教授眾生，持心寂然令寤使成。",
        "translation": "Again, he teaches sentient beings about the four truths, maintaining his mind in quiescence and causing them to awaken and make it happen.",
        "source": "T16n0656_001:0002a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以眾智瓔珞妙門，訓化二乘得至所趣，勤大乘學觀達諸法，修如來行功勳之德，教導以漸不行暴逸。",
        "translation": "Again, he teaches the marvelous approach of the diadem of wisdom, instructs the two vehicles to reach their destinies, diligently trains in the great vehicle, observes and comprehends the teachings, cultivates the merits of the Tathāgata's practices, and teaches so that they gradually don't become careless.",
        "source": "T16n0656_001:0002a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自省己過不譏彼短，踰出眾難，常愛樂法，寂定無亂，蠲除諸疑望見之事，有猶豫者使得時寤，不捨道心所造德本。",
        "translation": "He introspects his faults, doesn't criticize their shortcomings, surpasses the many difficulties, always loves the Dharma, remains calm and collected, isn't disturbed, clears away doubts and expectations, and causes those who hesitate to awaken at an opportune time, not abandoning the roots of virtue created by the mind of the path.",
        "source": "T16n0656_001:0002a10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又教化人使不毀戒，常以大哀為人說經，所遊世界不離諸佛，宣示禁戒逮一切智。",
        "translation": "He also teaches people not to disparage the precepts, always explains the sūtras to them with great compassion, never leaves the buddhas in the world he travels, and proclaims the prohibitions and acquires all wisdom.",
        "source": "T16n0656_001:0002a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以照曜瓔珞莊嚴諸佛寶淨道場，光明瓔珞靡不周遍，悉照三千大千世界，蔽此日月使無光明，正使神妙釋梵四王，所有威光悉不復現。",
        "translation": "They also adorn the Buddha's jeweled and pure abode of enlightenment with radiant diaphanous jewelry, which is completely surrounded by bright diaphanous jewelry and thoroughly illuminates the 3,000 great thousand worlds, obscuring the sun and moon so that there's no light, and correctly causing the four miraculous Śākyamuni kings to lose their authoritative light.",
        "source": "T16n0656_001:0002a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來至真難測之光，獨明獨顯無有及者，是謂普照！",
        "translation": "The Tathāgata's most genuine and unfathomable light, which alone shines and shows like no other, is called universal illumination!",
        "source": "T16n0656_001:0002a18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修菩薩道十德瓔珞而自纏裹。",
        "translation": "He cultivates the ten virtues of the bodhisattva path and wraps himself in diadem.",
        "source": "T16n0656_001:0002a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常念諸佛供養如來，嗟歎聖教，勸化眾生使入道門。",
        "translation": "He is always mindful of the buddhas, makes offerings to the Tathāgata, praises the noble teaching, and encourages sentient beings to enter the path.",
        "source": "T16n0656_001:0002a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告眾生發大弘誓，其所趣向聞佛名號，將養萌類願生彼國，志弘大普不懷怯弱，深入聖慧不恥下問，常樂微妙，所言柔和而無自大，好喜隱居除諸貪嫉，見有行者代其歡喜，以功德力瓔珞道樹，報力心力及乳脯力，諸聖所居解脫之力，常以此法育養眾生，慈悲喜護不捨眾生。",
        "translation": "Again, he tells sentient beings to make a great and vast vow, to aspire to hear the Buddha's name, to nourish their young and wish to be born in that country, to aim for greatness and universality without timidity, to penetrate deeply into the noble wisdom without shame, to always delight in subtlety, to speak softly without arrogance, to prefer to live in seclusion without craving or jealousy, to rejoice on behalf of those who practice, to use the power of merit to decorate the tree of the way, the power of retribution, the power of mind and milk, and the power of liberation inhabited by the sages to always nurture sentient beings with this teaching, and to compassionately delight in and protect sentient beings without abandoning them.",
        "source": "T16n0656_001:0002a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護諸緣著拔去根本，觀了三世無去來今，善惡報應都無所生，法法自滅法法自生，法不見滅法不見生，心無想念無我人壽，亦無往來無所歸趣，復以空法瓔珞諸根。",
        "translation": "He guards the attachments of conditions, uprooted the roots, observes that there are no past, future, or present in the three worlds, that the rewards of good and evil arise from nothing, that things cease by themselves and things arise by themselves, that things don't cease when they don't see them, that things don't arise when they don't see them, that his mind lacks longing and selfless life, that there's no past and future, and that there's no destination to which he should return, and that he uses the teachings of emptiness to decorate the faculties.",
        "source": "T16n0656_001:0002a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾昔成佛，皆由清淨空無之想，自致正覺。",
        "translation": "\"I became a buddha in the past because I purified the notion of emptiness and nonexistence and attained right awakening on my own.",
        "source": "T16n0656_001:0002b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行善本不造諸緣，興起善法無放逸行，去離世事不處俗法，所可演說流布十方，親侍禮拜諸佛世尊，所施清淨捨貪無欲，心意鮮潔而無垢穢，慧無邊際眼視通達，三礙六塵永已消盡，是謂菩薩法之瓔珞。",
        "translation": "Cultivating wholesome roots and not creating conditions, producing wholesome qualities and not engaging in careless behavior, departing from worldly affairs and not dealing with mundane phenomena, disseminating what could be taught in ten directions, personally serving and venerating the buddhas and world-honored ones, making pure offerings and abandoning craving and desire, having a pure and undefiled mind, seeing and penetrating wisdom without limit, and permanently eliminating the three hindrances and six dusts are called the jewel of a bodhisattva's dharma.",
        "source": "T16n0656_001:0002b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩復當發弘誓心，莊嚴瓔珞智度無極，隨其本器而與授法，如所聞慧便能建立，應如斯行則不退轉，執意堅牢追從善友。",
        "translation": "\"Bodhisattvas should then summon the great vow, adorn the diadem with unlimited wisdom, bestow the Dharma according to their original capacity, establish wisdom as heard, conduct themselves accordingly, and then they won't turn back, holding fast to their resolve and following good friends.",
        "source": "T16n0656_001:0002b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所行言教終不虛妄，念常恭恪不違經業，心習深智受而不失，常專一心念不錯亂，了病深淺後乃投藥，意樂忍辱行步審諦。",
        "translation": "His words and teachings are never false, his mind is always respectful and scrupulous, he doesn't act contrary to the sūtras, his mind cultivates deep knowledge that's accepted but not lost, he always focuses his mind without distraction, he investigates the depths of his illness before administering medicine, and he takes steps with patience and sincerity in mind.",
        "source": "T16n0656_001:0002b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所施財物亦無適莫，其意清密而無煩憒，學習根本心不流馳。",
        "translation": "The goods he gives are not inappropriate, his intentions are clear and precise, and he's not troubled, and his mind doesn't drift away from the fundamentals of learning.",
        "source": "T16n0656_001:0002b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人欲聞法，尋常指示令知要道，設見困厄不自濟者，便能惠施自致珍寶，加以善本眾妙之行，勸人持戒，所聞智慧成菩薩道。",
        "translation": "When people want to hear the Dharma, they seek constant instruction so that they'll know the essentials, and if they see someone in trouble who can't help themselves, they can then give generously of their own treasures, apply their good roots to many wonderful practices, and encourage others to observe precepts, so the wisdom they hear will become the bodhisattva path.",
        "source": "T16n0656_001:0002b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「假使學人處在梵志，復能建立覺了所生不離忍辱，棄捐家業而修精進，觀達無常因緣之本，於諸憎愛不興二想，所為平等，令眾生類得無所從生法忍。",
        "translation": "\"Suppose a student of the Brahma Path also establishes awareness of what's produced, doesn't part with forbearance, abandons family karma and cultivates effort, observes the basis of impermanent causes and conditions, doesn't give rise to two conceptions of what's hated, and is equal in what he does, so that all sentient beings attain the patience of the Dharma that arises from nothing.",
        "source": "T16n0656_001:0002b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常能憑其無極大哀，漸訓勸導弘誓之法，施於一切使得聞知，志性寂然知無吾我，一心禪思興其智慧，使不斷絕。",
        "translation": "Always able to rely on his infinite compassion, he gradually instructs and encourages all people to hear and know the teaching of the great vow, becoming quiescent in will and nature and knowing that there's no self, and unifying his wisdom with single-minded meditation, so that it doesn't stop.",
        "source": "T16n0656_001:0002b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所施設不離四恩，救濟危厄使至無為，護身口過不犯三事，建立至真無上之法，意斷意止真如法性，修而不失，是謂，普照！",
        "translation": "His generosity doesn't part from the four kinds of kindnesses, rescues people in danger and distress so that they'll attain inaction, protects his body and speech from three infractions, establishes the most genuine and unsurpassed Dharma, and cultivates and doesn't lose the true nature of reality by stopping thought and intent.",
        "source": "T16n0656_001:0002b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆是菩薩瓔珞所建。",
        "translation": "They're all made of bodhisattvas' diadem.",
        "source": "T16n0656_001:0002b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，普照！",
        "translation": "\"Furthermore, Prabhūtaratna!",
        "source": "T16n0656_001:0002b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復當思惟校計料度無極，行施修戒和顏忍辱，精進寂靜不失意止。",
        "translation": "\"Again, the bodhisattva should contemplate and evaluate the infinitude of discriminations, practice generosity, cultivate precepts, be pleasant and tolerant, and work energetically and quietly without losing control of his mind.",
        "source": "T16n0656_001:0002b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以聖明一心定意，深察四諦甘露之道，直至無為無復虛偽，是謂智慧之所瓔珞。",
        "translation": "Also, with noble insight and single-minded concentration, he deeply investigates the noble path of the four truths until it becomes nothing and is no longer false, which is called the necklace of wisdom.",
        "source": "T16n0656_001:0002c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「常當一意純淑其心，一切所有施而不悋，開化功勳解空脫門。",
        "translation": "\"He should always single-mindedly purify his mind, giving all that exists without stinginess, and opening the door to the merit of transformation and the liberation of emptiness.",
        "source": "T16n0656_001:0002c03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在行業訓導垂誡，廣接眾生隨順度之，而有殊勝仁和之德。",
        "translation": "If they are instructed and guided in their occupation, they will widely accept sentient beings and accord with them, and they will have the excellent virtue of kindness and harmony.",
        "source": "T16n0656_001:0002c04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了時宜若干品類，宣其慈心不著苦樂，悲哀一切不避劇難，寤彼眾生應正法教，施心滿世護使成就，瓔珞光明靡不照曜，普愍一切使濟彼岸。",
        "translation": "He understands the appropriate times and types, proclaims his compassionate mind not attached to suffering and happiness, sympathizes with all without avoiding serious difficulties, awakens sentient beings to the correct teaching of the Dharma, fills the world with generosity and protects its accomplishment, and his diadem shines brightly without fail, pitying all and bringing them to the other shore.",
        "source": "T16n0656_001:0002c05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使有人在隱蔽處，消除其闇永使無餘，無畏之力愍育一切，除其老病無放逸行。",
        "translation": "Just when a person is in a sheltered place, he removes its darkness so that there's no remainder, his fearless power nurtures them all with compassion, and he removes old age and illness without careless behavior.",
        "source": "T16n0656_001:0002c09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "導師所至靡不從教，所含如海聞施他人，開化塵勞令無妄想。",
        "translation": "Everywhere a guide goes, he complies with the teaching, contains an ocean of information that's heard and given to others, and enlightens the dusty and laborious so that there are no false notions.",
        "source": "T16n0656_001:0002c11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所居之處如華無著，了一切法寂寞清淨，其所演教分別因緣，所造德本習而致之。",
        "translation": "The place where he lives is like a flower without attachment, and he understands the loneliness and purity of all things, discerns the causes and conditions of the teachings he presents, and cultivates the virtues that originally led to them.",
        "source": "T16n0656_001:0002c12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「愍世哀苦故訓生類，虛空非實亦非真有，解知世法如泡如幻，眾生不寤習而不捨。",
        "translation": "\"Because he pities the world's suffering, he instructs sentient beings, saying that space is neither real nor truly existent, and he understands that worldly phenomena are bubbles and illusions that sentient beings don't wake up from and cultivate without abandoning.",
        "source": "T16n0656_001:0002c14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖處居家能離生難，道眼清淨亦如蓮華，神德巍巍不可稱計，正使世界眾生之類，咸共嗟歎莫知其原。」",
        "translation": "Even though they live at home, they're able to escape the difficulties of birth, their eye of enlightenment is purified like a lotus, and their spiritual virtue is so imposing and incalculable that it precisely causes the world's sentient beings to lament together, not knowing its origin.\"",
        "source": "T16n0656_001:0002c16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，世尊重告普照：「夫坐道行解無去來，若見去來則有想著，分別罪福亦無起滅，斯皆自然空無所有。",
        "translation": "At that point, the Bhagavān addressed Bojo, \"A person's practice of sitting on the path understands that there's no going or coming, and if they see going or coming, then they'll have thoughts and attachments, discriminate between sins and merits, and have no arising or ceasing, which are all naturally empty and non-existent.",
        "source": "T16n0656_001:0002c18_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相住無主而無本末，亦無願求而可獲者，能自校計如此之法，是謂菩薩趣於聖道。",
        "translation": "Being able to discriminate such things for oneself is called a bodhisattva headed for the noble path, which has no owner and no beginning or end, and has no wish or desire that can be obtained.",
        "source": "T16n0656_001:0002c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復當分別三世之法，解知無二、無我、無人，及諸境界虛無所有。",
        "translation": "\"They should also discern the dharmas of the three times and understand that there are no two, no self, no person, and the objective realms are empty and nonexistent.",
        "source": "T16n0656_001:0002c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見有來，則是報應緣起之法，無起無滅乃應道教。",
        "translation": "If you see anything coming, it's the principle of dependent arising in response to retribution, and the teaching of the path that accords with neither arising nor ceasing.",
        "source": "T16n0656_001:0002c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "計聲有音，音無形像，分別文字斯皆無實，一切明達靡不通暢。",
        "translation": "They conceptualize sound as having sound but no form, and these discriminating words are all insubstantial, so their understanding is not fluent.",
        "source": "T16n0656_001:0002c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩瓔珞，真實無虛亦無罣礙，除去陰蓋悉無所有。",
        "translation": "\"A bodhisattva's diadem is real, unreal, and unobstructed, and it contains nothing when the hindrances of the aggregates are removed.",
        "source": "T16n0656_001:0002c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若建所施在在所欲，設不有建斯應施度，心懷謹慎棄眾不可。",
        "translation": "If there's something to be built or given, it's whatever you want, and if there's nothing to be built, then you should give it away, being cautious and discarding the many things that are unacceptable.",
        "source": "T16n0656_001:0002c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持此心者，乃應戒律，達了諸法自然無住亦無本際，勤修思惟建立處所，精進禪思攝身口意，慧明自曜去眾穢行，乃應智慧。",
        "translation": "Those who maintain this mind should observe precepts, comprehend that dharmas are naturally without abode or origin, diligently contemplate and establish their place, diligently meditate and contemplate on the collection of body, speech, and mind, and have their own wisdom and clarity to rid themselves of all defiling activities.",
        "source": "T16n0656_001:0002c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「普照！",
        "translation": "\"Universally illuminating!",
        "source": "T16n0656_001:0003a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復知神通所及得其報應，以其天眼便得徹視，皆由修奉施行禁戒，恒順正見無所毀犯。",
        "translation": "\"Also, knowing the rewards of their psychic abilities and being able to see thoroughly with their divine eyes, they all cultivate the observance of the precepts, always following right view and committing no infractions.",
        "source": "T16n0656_001:0003a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修法瓔珞致天耳聽，念行勸助因發道意，或復成就識念神通，憶過去世皆悉自然，為生類故積功累德。",
        "translation": "He cultivates a diadem of teachings that causes the divine ear to listen, encourages mindfulness of actions that lead to the development of the intention for enlightenment, or accomplishes the supernormal power of consciousness and mindfulness, recalls past lives as natural, and accumulates merit for the sake of those who are born in the category.",
        "source": "T16n0656_001:0003a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每自剋責不及彼證，懷來神通變化無極，捨諸識著思惟禪定平等無二，斯解因緣報應之果。",
        "translation": "He always criticizes himself for not realizing as well as the other, carries with him the supernormal powers of infinite variety, discards attachments to consciousness, contemplates meditation, and equality and non-duality, and thus understands the results of causes and conditions and the rewards that flow from it.",
        "source": "T16n0656_001:0003a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以慧神通消滅眾垢，因其三昧究暢聖法而不二入，盡諸有漏不失道意使人修德，加慕世俗布施之德，雖有施恩不望其報，令無數人喜樂務法。",
        "translation": "He uses the superknowledge of wisdom to subdue all defilements, investigates and penetrates the noble teaching because of his samādhi without entering it twice, exhausts contaminants without losing the will to cultivate virtue, admires the worldly virtue of generosity, and causes countless people to delight in serving the Dharma despite the kindnesses they receive without expecting rewards.",
        "source": "T16n0656_001:0003a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能知一切靡不通暢，能使奉行菩薩之法，皆由精進不興懈怠，慈愍護彼一切成就。",
        "translation": "He knows that nothing is unobstructed, causes people to practice the bodhisattva's teaching because of their effort, doesn't become lazy, and compassionately protects them in all their endeavors.",
        "source": "T16n0656_001:0003a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用眾生故不惜身命，不貪己身珍寶之貨，所生之處因奉道義，前人所求亦無疑難，聞慧信施不有猶豫，所行言教悉共信用。",
        "translation": "They don't spare their own lives because they use sentient beings, don't crave their own valuables, consecrate the meaning of the path wherever they're born, don't have doubts about what others have asked, don't hesitate to hear, wisely and faithfully bestow, and share credit with everyone for the words and teachings they practice.",
        "source": "T16n0656_001:0003a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來至真無所罣礙，所行寂靜亦無放逸，堅固忍辱而樂閑居，復化眾生自責不及，禪思脫門正受不亂，恒遊神通以自娛樂，復以無極光明之勳，適時隨宜分別一切章句義理，消滅諸患無所藏匿，恒常一心開道聖慧，示無數人報應之果。",
        "translation": "\"The Tathāgata's utmost truth is unimpeded, his practice is tranquil and not careless, he resolutely tolerates humiliation and enjoys quiet living, furthermore, he causes sentient beings to reproach themselves for falling short, he correctly experiences the gate of liberating meditation without confusion, constantly travels with supernormal powers for his own amusement, and with the grace of infinite light, he discerns all phrases and principles as appropriate, extinguishes various afflictions without hiding them, always focuses his mind on the enlightenment of noble wisdom, and shows measureless people the results of their rewards.",
        "source": "T16n0656_001:0003a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾德具足，以勇猛力不為所侵，解了三世都無所有，去來今事無有增損，然後乃應智度無極。",
        "translation": "Complete with all the virtues, he's unobtrusive with courageous strength, understands that the three worlds are nonexistent, and there's nothing to add or subtract from past or present events, and then he should know how to achieve infinity.",
        "source": "T16n0656_001:0003a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以能布施自發道意，欲使眾生一切普安，自散諸結不患己身。",
        "translation": "Because he can offer alms, he generates his own intention for the path, wants to make all sentient beings completely comfortable, and dispels the bonds himself so that he doesn't suffer personally.",
        "source": "T16n0656_001:0003a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人杖捶悉以能忍，亦化他人令行忍辱，具眾德本加以專心，修諸佛教勸諸生類出家學道。",
        "translation": "He's able to tolerate being caned, teach others to practice forbearance, cultivate the virtues of the past, and concentrate his mind on cultivating Buddhism to encourage sentient beings to leave home and train on the path.",
        "source": "T16n0656_001:0003a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自觀惡露萬物不淨，輒厭惡趣功勳究竟。",
        "translation": "He observes for himself that all things are impure in the face of evil, and he readily becomes disillusioned with the ultimate merit of bad destinies.",
        "source": "T16n0656_001:0003a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所行善業其心悅豫，智慧深達而不懷恨，篤信禁戒自致善德。",
        "translation": "They are encouraged by the good actions they perform, deeply penetrating in wisdom and not harboring resentment, and faithful to the precepts that lead to good virtue on their own.",
        "source": "T16n0656_001:0003b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以和心慚愧不惑，常御神志不執麁獷，思惟地獄湯火痛苦，歎天受福無極之樂，寂然無憂無復貪欲。",
        "translation": "Also, with a peaceful mind, conscience and modesty and without confusion, they always control their thoughts and don't cling to the crude, contemplating the pain of hell's baths and fires and the supreme bliss of enjoying the blessings of heaven, they are calm and without sorrow, and they have no more desires.",
        "source": "T16n0656_001:0003b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所惠施自去三想，心不猗內不受外塵，修行道法眾望休息，分別智慧自悟其心，空無想願建立脫門，除去顛倒無所傷害，是謂普照！",
        "translation": "He freely parts with the three conceptions of beneficence, isn't distracted by internal or external objects, cultivates the path and teachings, rests in hope for all, discerns wisdom and self-realizes his mind, establishes the gate to liberation by wishing for emptiness and no ideation, and rids himself of delusion and does no harm, which is called universal illumination!",
        "source": "T16n0656_001:0003b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞心無所著。",
        "translation": "\"A bodhisattva's diadem has no attachment of mind.",
        "source": "T16n0656_001:0003b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其意平等空無不遍，不懷妄想，布施以備，調意安庠。",
        "translation": "\"Equality of mind and emptiness don't pervade it, they don't harbor deluded notions, and they are prepared by generosity and peaceful in their temperament.",
        "source": "T16n0656_001:0003b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為人說法不離空義，慈哀一切行不漏失。",
        "translation": "He explains the teaching to others without departing from the meaning of emptiness, and he's compassionate about all his actions without missing anything.",
        "source": "T16n0656_001:0003b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀其眾生所受法識，知其志性而開化之。",
        "translation": "He observes the dharmic consciousnesses that sentient beings receive, knows their aspirations, and enlightens them.",
        "source": "T16n0656_001:0003b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在所遊處導為一切，遵修聖明而現道義。",
        "translation": "He guides them all wherever he goes, cultivating noble wisdom in accordance with it and revealing the meaning of the path.",
        "source": "T16n0656_001:0003b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無極大哀開度餘人，亦以善權方便之力，入諸外道異學之中，隨彼法則順從祠祀，觀其志趣使得度脫，令諸梵志興福無量。",
        "translation": "With infinite compassion, he enlightens others, and with the power of skillful means, he enters the midst of heretics and trainees, follows their rules of conduct, conforms to their sacrifices, observes their aspirations, and liberates them, causing priests to produce measureless merit.",
        "source": "T16n0656_001:0003b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或在惡部盜賊之中，將導牽致而顯其行，緣此化度無數眾生，於往古世功德已備，見皆喜悅莫不恭恪，為雨甘露道法之味，除去眾生瞋恨之結。",
        "translation": "He might lead them to reveal their actions while they're among the bandits and thieves, saving countless sentient beings because of this, making them well endowed with merit from ages past, delighting them all and making them respect him, raining down the taste of the Dharma as sweet dew, and removing the bond of hatred in sentient beings.",
        "source": "T16n0656_001:0003b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復前人以若干惱而來犯之，不以厭患，而為頒示寂然之法，知其所興非真非實。",
        "translation": "If someone in the past had violated it with some sort of affliction, he wouldn't be disillusioned but would instead present the tranquil Dharma, knowing that what they arouse is neither real nor true.",
        "source": "T16n0656_001:0003b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，普照！",
        "translation": "\"So it is, Prasenajit!",
        "source": "T16n0656_001:0003b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所修心意瓔珞，而遊其中常樂於此，不見所樂樂無所樂，以真法性而娛樂之。",
        "translation": "The bodhisattva cultivates a mind-diadem, travels around in it, always takes pleasure in it, doesn't see what's pleasant, and enjoys nothing, and entertains it with the true nature of reality.",
        "source": "T16n0656_001:0003b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明知眾生根本所趣，救濟使度無眾塵勞，危害之患永使無餘。",
        "translation": "Knowing full well the fundamental destinies of sentient beings, they rescue, deliver, and liberate them from all the world's defilements, and permanently endanger them without remainder.",
        "source": "T16n0656_001:0003b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "執御其心平等如空，分別四大所興起滅，欲化眾生而訓誨之。",
        "translation": "He controls his mind equally as emptiness, discerns what arises and ceases in the four elements, and wants to teach and transform sentient beings.",
        "source": "T16n0656_001:0003b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說真正無有憎愛，降棄一切邪見之心，堅心瓔珞堅固之幢。",
        "translation": "What he teaches is genuine, has no craving, subdues all minds of wrong views, and firmly bases his mind on a diadem.",
        "source": "T16n0656_001:0003b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若干法品而與共戰，猶如勇猛大軍之將，降伏外敵使入法律。",
        "translation": "They fight together with certain qualities of the Dharma like a brave general of a great army who subdues external enemies and brings them into line with the Dharma.",
        "source": "T16n0656_001:0003b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若入習俗施設法教，施便受報持戒生天，所造之德皆有報應，以此濟之令至無為。",
        "translation": "If they enter the conventional world and define the teaching of the Dharma, then they'll be rewarded for bestowing precepts and being born in the heavens, and all the virtues they create will be rewarded, which will help them achieve nothingness.",
        "source": "T16n0656_001:0003b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫為菩薩自順瓔珞，心初未曾隨惡友語，然後乃全大士之行。",
        "translation": "A bodhisattva who adapts himself to the necklace has never followed the words of a bad friend in his mind before he completes the practice of a great man.",
        "source": "T16n0656_001:0003c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意懷清白終無吾我，持心如山行無缺漏，智遍一切猶月初照。",
        "translation": "With a mind that's clear and bright, there's never any self, and he maintains his mind like a mountain of practices without any defects, while his wisdom pervades them all as if he were illuminating them early in the month.",
        "source": "T16n0656_001:0003c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在大眾無能及者，是謂，普照！",
        "translation": "If there's no one among the masses who can match it, this is called universal illumination!",
        "source": "T16n0656_001:0003c04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞周滿一切。",
        "translation": "The bodhisattva's diadem completely encompasses them all.",
        "source": "T16n0656_001:0003c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「覺了虛寂空無所有，所生之處恒見光明，所聞輒解至成佛道，常念頒宣根門之要，自建立業無所侵害，覩見本性自然起滅，過世八法無所罣礙，身口心意未曾有欺。",
        "translation": "\"He perceives that space and quiescence are empty and non-existent, always sees the light where he's born, readily understands what he's heard, and attains the buddha path, always mindful of the essentials of the faculty of preaching, creates his own karma without infringement, sees his original nature naturally arise and cease, has no obstruction from the eight past worldly dharmas, and is never deceived by body, speech, or thought.",
        "source": "T16n0656_001:0003c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以權慧救濟眾生，窮厄之士令其飽足，持心如地不犯三過，日進其道不行放逸，逮不退轉牢固之心，不起法忍而現在前。",
        "translation": "Furthermore, he uses expedient wisdom to rescue sentient beings, feed those in dire straits, maintain his mind like the ground without violating the three faults, advance on his path day by day without negligence, and acquire a resolute mind that doesn't falter and doesn't tolerate the appearance of things that don't arise.",
        "source": "T16n0656_001:0003c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十力不畏覺道正觀，捐棄吾我及人壽命，分別思惟有無之法，感動變化無量佛國，斯由神通而得自在。",
        "translation": "He correctly observes the ten powers and fearlessness of the awakening path, discards self and human life, discerns and contemplates the existence and nonexistence of things, and is moved to change measureless buddha lands, which then attain mastery because of his supernormal powers.",
        "source": "T16n0656_001:0003c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所宣言辭瓔珞，超越諸見無復希望，心向正道亦無顛倒，辯才無礙而無留滯，周旋往返不生想著，蠲除一切諸縛結使，憍慢自大永滅無餘。",
        "translation": "The bodhisattva's proclamation is a necklace that transcends views and has no further hope, leads his mind to the right path without confusion, has unimpeded eloquence without hindrance, moves around without conceptual attachment, removes all fetters and bonds, and permanently extinguishes arrogance without remainder.",
        "source": "T16n0656_001:0003c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其聲音響如師子吼，亦如雷震無不聞聲，永立究竟乃至滅度，發於無極瓔珞之雲，演法雷吼法鼓電光。",
        "translation": "Its sound is like a lion's roar or a thunderclap that's unmistakable, which permanently establishes its ultimate realization even up to its cessation, and it arouses a cloud of infinite jewels that gives rise to a thunderclap of the Dharma and a drum of Dharma lightning.",
        "source": "T16n0656_001:0003c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雨解脫味宣七覺意，念法清淨不離三寶，心如明月亦無沾污，通達往來不除正業，具足眾相殊勝之法，是謂，普照！",
        "translation": "He rains down the taste of liberation, declares the seven factors of awakening, purifies mindfulness of the Dharma and doesn't part from the Three Treasures, his mind is like the bright moon and isn't stained, penetrates past and future without removing right action, and is fully endowed with the distinctive qualities of all characteristics, which are called, \"universal illumination!",
        "source": "T16n0656_001:0003c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞而無窮盡。",
        "translation": "A bodhisattva's diadem knows no limit.",
        "source": "T16n0656_001:0003c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上中下善中間通利，懷來炤曜不失禁戒，過去當來諸恒沙聖，靡不嗟歎斯菩薩德。",
        "translation": "Their superior, middling, and inferior virtues are so well-integrated that they shine brightly in the mind and don't lose their observance of the precepts, and none of the sages of the past and future constellations would fail to praise this bodhisattva's virtue.",
        "source": "T16n0656_001:0003c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，普照！",
        "translation": "Thus, illuminating universally!",
        "source": "T16n0656_001:0003c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢聖道品妙法之藏，珍寶之門而不可盡。」",
        "translation": "The store of the wonderful Dharma of the noble stages is an inexhaustible collection of treasures.\"",
        "source": "T16n0656_001:0003c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞經識定品第二",
        "translation": "Bodhisattva Yingluojing Consciousness Concentration Chapter 2",
        "source": "T16n0656_001:0003c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，座上有寶王菩薩，即從坐起長跪叉手，前白佛言：「唯然，世尊！",
        "translation": "At that point, a bodhisattva on the throne, the Jewel King, rose from his seat, knelt down long and saluted the Buddha with his palms together, saying, \"Yes, Bhagavān!",
        "source": "T16n0656_001:0003c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩所習意識瓔珞，多所開寤靡不蒙度，如今十方恒沙如來，及去來今諸滅度者，云何修學瓔珞戒品，使至彼岸，令眾生類普聞香熏？」",
        "translation": "How do bodhisattvas cultivate the diadem of consciousnesses that are often awakened and liberated, and how do they cultivate the diadem of precepts that will bring them to the other shore and cause all sentient beings to hear the fragrance of the past and future ones that are now extinct?\"",
        "source": "T16n0656_001:0003c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告寶王曰：「諦聽諦聽！",
        "translation": "It was then that the Bhagavān addressed the Jewel King, \"Listen closely! Listen closely!",
        "source": "T16n0656_001:0004a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T16n0656_001:0004a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今為汝敷演其義。",
        "translation": "Now, I'll explain their meaning for you.",
        "source": "T16n0656_001:0004a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩習行戒品瓔珞，功德香熏自瓔珞身。」",
        "translation": "A bodhisattva's practice of the precepts is like a diadem, and the fragrance of their virtues perfumes their diadem body.\"",
        "source": "T16n0656_001:0004a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶王對曰：「願樂欲聞。」",
        "translation": "The jeweled king answered, \"I'd like to hear about it.\"",
        "source": "T16n0656_001:0004a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「奉遵道法，乃修戒定解脫之慧，勸眾生類篤信於戒，願其志性各充所願，曉了隨宜不失本誓，兼除一切愚惑之心。",
        "translation": "The Bhagavān told him, \"To follow the path is to cultivate the wisdom of liberation from morality and concentration, to encourage sentient beings of all kinds to devote themselves to the precepts, to wish that their aspirations and natures would be fulfilled, to understand and follow appropriately without losing their original vows, and to remove all foolishness and confusion in their minds.",
        "source": "T16n0656_001:0004a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嚴淨道場具眾品宜，不以麁獷使經其心，志常慕及一生補處。",
        "translation": "They adorn the pure site of enlightenment with all its attributes, don't let crudity get in the way of their minds, and always aspire to be in a position to make up for a lifetime.",
        "source": "T16n0656_001:0004a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總持正法深遠之藏，意恒遊戲百千三昧，感動變化無以為喻，一切萬物悉皆無常，難得之寶不可恃怙。",
        "translation": "He holds the profound store of the true teaching in his mind, constantly plays with a hundred thousand samādhis, is moved by changes that can't be described, and all things are impermanent, so he can't rely on that rare treasure.",
        "source": "T16n0656_001:0004a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行權方便而無所住，眾生心惑不解正道，心著吾我不明無常。",
        "translation": "Practicing expedient methods but having no abode, the minds of sentient beings are confused and don't understand the right path, and their minds are attached to self and don't understand impermanence.",
        "source": "T16n0656_001:0004a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩誓心為分別說，了一切空虛而不真，雖崇大道不捨二乘，所遊之剎莫不蒙慶，轉加精進倍行道業，於諸經法去其妄想。",
        "translation": "\"The bodhisattva vows to explain for discernment, realizing that everything is empty and unreal, not abandoning the two vehicles even though he reveres the great way, blessed by none of the buddhas he travels to, intensifying his efforts and redoubling his practice of the path, and ridding himself of deluded notions of the sūtras and Dharma.",
        "source": "T16n0656_001:0004a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩法要不離十地，以次上位不越其敘，加以智慧消眾塵勞，不及道者自致道門。",
        "translation": "The bodhisattva's essentials of the Dharma don't part from the ten stages, so he doesn't surpass their categories in order of higher rank, and with wisdom he eliminates the trouble of the many dusts, so those who fall short of the path will themselves reach the gate of the path.",
        "source": "T16n0656_001:0004a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒念剋責意自念言：『施為是誰？",
        "translation": "With constant mindfulness and criticism, he thinks to himself, 'Who is this charity?'",
        "source": "T16n0656_001:0004a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受者何人？』",
        "translation": "Who is the recipient?'",
        "source": "T16n0656_001:0004a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如觀財寶皆無有主，設有毀辱當自制意，後若受報端正殊妙，所遊之處見莫不歡。",
        "translation": "\"As he observes, 'Wealth and treasure have no owner, and when there's disgrace or humiliation, he must control his thoughts; if his subsequent reward is correct and marvelous, no one will be unhappy where he goes.'",
        "source": "T16n0656_001:0004a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若見貧匱裸形體者，躬自入海致如意珠，語以正法令知返復，以甘露法消竭眾難，念不馳泆。",
        "translation": "\"If he sees someone poor and naked, he himself goes into the ocean to obtain the wish-granting pearl, speaks correctly, tells them to return, and uses the nectar Dharma to quell their many difficulties, so his thoughts aren't wasted.",
        "source": "T16n0656_001:0004a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，寶王！",
        "translation": "Therefore, King of Treasures!",
        "source": "T16n0656_001:0004a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩道果之所瓔珞，意得自在，復以勇猛大力之教，建立訓導莫不隨順。",
        "translation": "\"Where the fruit of the bodhisattva path is diademed, his mind attains mastery, and he establishes guidance with courage and vigor that none fail to follow.",
        "source": "T16n0656_001:0004a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行若坐不離十念，心在三尊未曾忽忘，了知地獄苦痛之惱，至心寂靜去塵勞垢，眾惡不犯無能迴轉，應於正理奉修禁法，德光普照皆蒙潤澤。",
        "translation": "Whether walking or sitting, he doesn't part with the ten invocations, his mind is present in the three honored ones without ever losing sight of them, he understands the pain and suffering of hell's torment, attains mental serenity and rids himself of the defilements of worldly sufferings, doesn't transgress numerous evils and isn't able to turn around, consecrates the forbidden Dharma in accord with the right principles, and his virtues are all moistened by universal illumination.",
        "source": "T16n0656_001:0004a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自計所有無所貪悋，施佛眾僧不興想著，或以權慧與王交接，輒能使王捐棄高位，若有人來求索頭目眼耳鼻口，即能惠施不逆人意。」",
        "translation": "They should count their possessions as nothing to be desired, give to the buddhas and saṃgha without conceptual attachment, or use their authority and wisdom to associate with the king, so that he can easily cause him to abandon his high position, and if someone comes seeking their head, eyes, ears, nose, and mouth, they'll be able to give generously without disagreeing with them.\"",
        "source": "T16n0656_001:0004a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，座上一切弟子諸菩薩等，聞此功勳瓔珞之德，踊躍歡喜不能自勝，思惟深邃善心生焉，各自興敬僉共供養，散眾名華若干珍寶，一時同聲稱歎其德：「我等宿福而遇善利，乃聞殊妙瓔珞之訓。",
        "translation": "At the time, all the disciples on the throne, the bodhisattvas and others who heard about the merits of this decorative jewel were overcome with joy and excitement, and their profound, good thoughts arose as they each made homage and shared offerings, scattering flowers of fame and various treasures as they praised its virtue with one voice, \"We were blessed from long ago to encounter good fortune, and we've heard the teaching of this marvelous jewel.",
        "source": "T16n0656_001:0004b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當眾生聞斯法教，勸發菩薩識定之要，諸福功勳不可稱量，安住所演諦而不虛。",
        "translation": "If sentient beings hear this teaching and are encouraged to awaken the bodhisattva to the essentials of consciousness concentration, their merits and rewards will be incalculable, and they'll be able to live in peace and expound the truth without fail.",
        "source": "T16n0656_001:0004b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有菩薩遭遇此識定瓔珞者，觀了諸法解無處所，識定瓔珞，神心澹然，不復貪食樂念為食，所可勸助興致福業。",
        "translation": "Suppose a bodhisattva encounters this diadem of consciousness and concentration, observes that the understanding of qualities has no place, and his mind is calm as he gazes at the diadem of consciousness and concentration, so that he no longer craves food and enjoys mindfulness as food, which could encourage and produce meritorious activity.",
        "source": "T16n0656_001:0004b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「吾於昔佛上五百華，建志弘誓自致成佛，道果不朽興隆正法。",
        "translation": "\"In the past, the Buddha rose to 500 flowers, established his intention and vow to become a buddha himself, and the fruit of his path became imperishable and prospered the right Dharma.",
        "source": "T16n0656_001:0004b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以禁戒消除眾垢，救彼眾苦如救頭然，令眾厄難必得濟度。",
        "translation": "Again, I removed all the stain with the precepts, saved their suffering as I would save my head, and caused all the difficulties and hardships to be readily remedied.",
        "source": "T16n0656_001:0004b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自念往昔入海求寶，遭摩竭魚及水形山，吾為導主入識定瓔珞，尋有善神將示好道，快樂安隱還至本邦。",
        "translation": "Remembering that I once went into the ocean to search for treasure and encountered a fish named Maghī and a mountain in the shape of water, I entered the diadem of consciousness concentration as a guide, found a good deity who would show me the good way, and returned happily and peacefully to my native land.",
        "source": "T16n0656_001:0004b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯由願誓精進不退，入禪正受無若干想，諸佛世尊之所遊堂，勸使眾生生於梵天及無想天，皆是識定瓔珞所致。",
        "translation": "That was because I vowed to make effort and not retreat, entered meditation and experienced correctly, had no more numerous concepts, visited the halls of the buddhas and honored ones, and encouraged sentient beings to be born in the brahma heavens and the non-thought heaven, all because of the consciousness-concentration diadem.",
        "source": "T16n0656_001:0004b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若在人間十方國土，隨俗染化講度世道，復以十善諸道果證，利益眾生令達空慧，宣示一切不違聖教，解知本空都無所造，所殖德本不自為己，皆使獲於道法之果。",
        "translation": "\"If he were to go among humans in ten lands, teach the worldly path according to worldly defilements, realize the fruits of the ten good paths, bring sentient beings to the wisdom of emptiness, proclaim that everything is not contrary to the noble teaching, understand that nothing is created by the fundamental emptiness, and that the virtues he produces are not his own, he would all attain the fruit of the path.",
        "source": "T16n0656_001:0004b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設法傾沒能為重任，若遭苦惱永無憂慼，亦無妄想識著心者，將養身口使不漏失，以權方便深入生死，為說八解正受之味，建立世俗慕崇佛道。",
        "translation": "Suppose he were to dump the Dharma as a heavy burden, never become sad if afflicted, and doesn't have deluded conciousnesses attached to his mind, then he would nourish his body and speech so that they wouldn't be lost, penetrate into birth and death with expedient methods, explain the taste of the eight understandings that are rightly experienced, and establish a secular admiration for the Buddha Way.",
        "source": "T16n0656_001:0004b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或演一教或若干品，趣引令入在聖賢律，漸漸牽示而滅度之，能令正法住若干劫。",
        "translation": "Sometimes he teaches a single lesson or several texts, leads them into the noble and virtuous teachings, and gradually leads them to deliverance, which can cause the right teaching to endure for several eons.",
        "source": "T16n0656_001:0004b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有餘眾生，令至無餘寂然泥洹，無生老死受形之患，不依四大地水火風。",
        "translation": "He causes all remaining sentient beings to attain the nirvāṇa of tranquility without remainder, free from the dangers of birth, old age, death, and form, and not dependent on the four elements of earth, water, fire, and wind.",
        "source": "T16n0656_001:0004b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸在邪見愚惑之部，示以正見一道之法。",
        "translation": "Those who are mistaken and deluded in their views are shown the way of the single path of right view.",
        "source": "T16n0656_001:0004c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若在閑處修十二法勤苦之行，燕坐樹下而無所猗，思惟禪法唯空為務，一心靜定而無謬錯。",
        "translation": "\"If he cultivates the painful practice of twelve dharmas in a secluded place, sits quietly under a tree without agitation, contemplates that the only task of meditation is emptiness, and concentrates his mind with single-minded serenity without error.",
        "source": "T16n0656_001:0004c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩識定瓔珞之寶，亦不念色有相無相，相自虛寂種好亦爾，分別內外了之為一，三世空寂無去來今，以識定心。",
        "translation": "The bodhisattva's consciousness concentrates on the jewel of a diadem, isn't mindful that form has form and formlessness, and so do forms themselves, discriminating internal and external and comprehending them as one, and the three worlds are empty and tranquil without past or future in the present, using consciousness to concentrate the mind.",
        "source": "T16n0656_001:0004c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復觀五陰性諸衰持入，為從何來、復從何滅？",
        "translation": "Furthermore, when he observes the nature of the five aggregates and the debilitating tendencies, from where do they come and when do they cease?",
        "source": "T16n0656_001:0004c07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一分別知為巧偽，非有生滅不興希望。",
        "translation": "Knowing that a single aspect is distinct is clever and counterfeit, for it's not arising or ceasing, and it doesn't give rise to hope.",
        "source": "T16n0656_001:0004c08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復不見有是有非，不因心意得發道教，識興則興識滅則滅，不見相像亦無我想。",
        "translation": "Again, he doesn't see that there's right and wrong, doesn't get the teaching of the path from his mind, and when consciousness arises, it arises and ceases, doesn't see images, and has no conception of self.",
        "source": "T16n0656_001:0004c09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復不著住立處所，內外六塵亦復如是。",
        "translation": "Again, he doesn't attach to abiding or standing places, and the six internal and external objects are likewise.",
        "source": "T16n0656_001:0004c11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "計挍耳目尚無所有，何況當有見聞之事？",
        "translation": "How could there be things to see and hear in the future when the ear and eye have nothing to offer?",
        "source": "T16n0656_001:0004c12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此則不然。",
        "translation": "This is not the case.",
        "source": "T16n0656_001:0004c13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「寶王當知，菩薩瓔珞心識定法，不起不滅亦無終始，緣起則起、緣滅則滅，起不見起、滅不見滅，內自思惟增減之意，無苦樂想。",
        "translation": "\"King of Treasures, you should know that the bodhisattva's diadem-like mind and concentration of consciousness neither arises nor ceases, has no beginning or end, arises when conditions arise and ceases when conditions cease, doesn't see what arises and doesn't see what ceases, and reflects internally on thoughts of increase and decrease without thoughts of suffering or pleasure.",
        "source": "T16n0656_001:0004c13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，離吾我念，雖復在欲眾惱之中心無染著，以遠三界欲色無色，意如金剛不可沮壞。",
        "translation": "That's why they're free of mindfulness of self, even though they're still in the center of desire and affliction and have no defiled attachment, so they're far removed from the three realms of desire, form, and formlessness, and their mind is as indestructible as adamant.",
        "source": "T16n0656_001:0004c16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知本宿命究竟根元，而斷諸結不以為難，不見有極不見無極，是謂菩薩識定瓔珞。",
        "translation": "To know the ultimate root of one's past lives, cut off the bonds and not think it's difficult, and not see the existent and the imperishable is known as a bodhisattva's consciousness concentration diadem.",
        "source": "T16n0656_001:0004c18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「隨世訓誨恭奉尊長，不望其報，於百千劫勤修精進，具足成就道慧之法，宣諸菩薩平等持忍，諷誦通利啟受不忘。",
        "translation": "\"Following the teachings of the world, he respects venerable elders, doesn't expect any reward, diligently cultivates his efforts over a hundred thousand eons, fully accomplishes the teaching of the path and wisdom, proclaims that all bodhisattvas equally uphold tolerance, recites it, fully understands it, and doesn't forget it.",
        "source": "T16n0656_001:0004c20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來法身五分之性，一一頒暢言跡不飾，語常含笑心無所著，不起斷滅二見之想。",
        "translation": "Each of the five aspects of the Tathāgata's Dharma body is universally expressed without adornment, always smiling in speech, and without attachment in mind, without conceptions of nihilism or nihilism.",
        "source": "T16n0656_001:0004c23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在大眾亦無適莫，於空無法亦無想念，內實充滿外現諮受，亦不生意我行過量彼有短乏，離諸利養無所希望。",
        "translation": "If he's in the company of people, he has no discomfort, doesn't miss emptiness or nothingness, isn't really filled up on the inside and consults the outside, doesn't criticize the excesses of his own actions or the shortcomings of others, and has no hope of redeeming himself from the benefits.",
        "source": "T16n0656_001:0004c25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常自思惟知身無主，從頭至足達了本無，修行六度解無處所，挍計諸法悉是假號知無形質，一切諸法不可覩見，分別音響亦無所聞。",
        "translation": "He always reflects on himself, knowing that his body has no owner, comprehends fundamental nothingness from head to toe, cultivates the six perfections, understands that there's no place for them, evaluates all things as nominal, knows that they have no form or substance, doesn't see all things, and discerns sounds and hears nothing.",
        "source": "T16n0656_001:0004c27_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，寶王！",
        "translation": "\"So it is, King of Treasures!",
        "source": "T16n0656_001:0005a01_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩大士修法瓔珞識定法者，見善不喜聞惡不慼，然後乃應精進瓔珞，入百千定恬然無想，天雷地震龍電霹靂，山崩水漂師子鳴吼，心意寂定永無錯亂。",
        "translation": "\"When a bodhisattva-mahāsattva cultivates the method of consciousness concentration, he sees goodness and doesn't rejoice when he hears evil, then he should concentrate on the mantle, enter a hundred thousand concentrations, and become tranquil and without thought, as the heavens thunder and earthquake, dragons and lightning thunder, mountains crumble and waters drift, and lions roar, but his mind is still and concentrated, and he's never disturbed.",
        "source": "T16n0656_001:0005a02_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或時菩薩入定正受，乃經一劫及百千劫，形體軟美不復仰食，斯由定意，禪悅為食、八解為漿。",
        "translation": "Sometimes a bodhisattva enters concentration and experiences it correctly, and after one or a hundred thousand eons, his body becomes soft and beautiful, and he doesn't look up again to eat.",
        "source": "T16n0656_001:0005a05_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或時，菩薩復以神足而入三昧，其三昧名號曰普照。",
        "translation": "At another time, the bodhisattva then enters a samādhi with miraculous powers, and the name of that samādhi is Puzhao.",
        "source": "T16n0656_001:0005a07_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見於東方江河沙剎諸佛國土，禮事供養不失威儀；如是南方西方北方，各江河沙諸佛國土，悉能供養諸佛世尊，演暢思惟識定瓔珞。",
        "translation": "Seeing the buddha lands of the rivers and sands in the east, he serves and makes offerings to them without losing his dignity; thus, in the south, west, and north, each of the buddha lands of the rivers and sands can make offerings to the buddha-honored ones, and he presents a necklace of images of consciousness concentration that's thoroughly contemplated.",
        "source": "T16n0656_001:0005a09_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，寶王！",
        "translation": "\"So it is, King of Treasures!",
        "source": "T16n0656_001:0005a12_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩入定所感如是。",
        "translation": "This is how a bodhisattva feels when he enters concentration.",
        "source": "T16n0656_001:0005a12_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且捨十方江河沙剎，一一諸剎滿其中塵，復舉一塵著諸佛剎，斯塵猶盡佛土難量。",
        "translation": "Furthermore, if they abandon the rivers and sands of buddhas in ten directions, each of which is filled with dust, and then lift up one dust to attach to a buddha-blossom, that dust is still exhausted, and the buddha-lands are incalculable.",
        "source": "T16n0656_001:0005a12_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩三昧皆悉覩見一切眾會，亦聞彼佛演說瓔珞神識定意，了諸法本虛寂無主，從初起學乃至道場，思惟發意瓔珞道樹，悉過諸縛婬怒癡病，其心堅固不可移轉，正使天魔將眾億姟，欲來毀壞識定意者，終不為彼之所屈還，不為邪部而見錯悞，意弘如海靡不容受，眾德瓔珞悉為成辦，恒講無常苦空非身，常非有常豈有身耶！",
        "translation": "The bodhisattva's samādhi is fully visible to all assemblies, and he hears that Buddha preach a jeweled, spiritual consciousness concentration, understands that the fundamentals of all dharmas are empty and have no owner, rises from the beginning of training up to the site of enlightenment, contemplates the arousal of the mind, declares the jeweled path tree to be completely free of the illnesses of bondage, lust, anger, and delusion, and his mind is resolute and irreversible.",
        "source": "T16n0656_001:0005a14_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸計常者則離定遠，墮于生死不能自濟。",
        "translation": "Those who impute permanence are far removed from concentration, and they fall into birth-and-death and can't help themselves.",
        "source": "T16n0656_001:0005a22_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩所修唯務於道，其心恬然永無眾想，不離諸佛所造德業。",
        "translation": "\"A bodhisattva's practice is solely devoted to the path, his mind is serene and free of conceptions, and he doesn't part with the virtuous actions created by the buddhas.",
        "source": "T16n0656_001:0005a23_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意如太山不可移轉，獨步世界而無所畏，以四智辯包納諸法，指示眾生知道慧要，內實質直而無諛諂。",
        "translation": "With a mind like Mt. Tai that's irreversible, he walks alone in the world without fear, uses the four kinds of wisdom and eloquence to subsume all dharmas and instruct sentient beings in the essentials of wisdom, and has substantial inner integrity without flattery.",
        "source": "T16n0656_001:0005a24_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，用本淨故。",
        "translation": "That's why it's so, because the essence of function is pure.",
        "source": "T16n0656_001:0005a27_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既無眾垢諸冥消索，慧光普照莫不蒙澤，心大弘廣而無邊岸，沐浴意穢令使鮮明，隨世所好悉能成辦，詣佛樹下自修法義。",
        "translation": "Since the many defilements are gone and the darkness disappears, the light of wisdom shines universally, and no one is left untouched, his mind is vast and limitless, he bathes his thoughts in defilement and makes them clear, accomplishes whatever the world desires, and goes under a buddha tree to cultivate the Dharma and its meaning on his own.",
        "source": "T16n0656_001:0005a27_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切法不有狐疑，於諸愍智具足成就，順諸所聞救濟尠知，瓔珞定意拔濟亂者，及諸所習常得寂定，修行賢聖八道之品，立一切人使見正諦，是謂寶王！",
        "translation": "Not having misgivings about any teaching, fully accomplishing the knowledge of counsel, following what's heard to rescue those who don't know, plundering the mind with a diadem, always attaining quiescent concentration with respect to all disciplines, cultivating the noble eightfold path, and establishing all people to see the right truth, this is called the king of treasures!",
        "source": "T16n0656_001:0005b01_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩識定瓔珞之要。",
        "translation": "The bodhisattva's consciousness concentration is a diadem of essentials.",
        "source": "T16n0656_001:0005b05_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有聞持在于懷者，未曾遠離諸佛世尊，得不退轉於無上正真之道。」",
        "translation": "If someone hears and retains it in their heart, they've never been removed from the buddhas and honored ones, and they'll attain irreversibility on the unsurpassed true path.\"",
        "source": "T16n0656_001:0005b05_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是識定瓔珞時，於座上有無量億百千天、龍、鬼神、人與非人，皆發無上正真道意。",
        "translation": "When the Buddha spoke this necklace of consciousness concentration, there were measureless hundreds of millions of gods, dragons, ghosts, humans, and nonhumans on the throne who aroused the intention for the unsurpassed true path.",
        "source": "T16n0656_001:0005b07_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有異方菩薩六十二千人，得不起法忍。",
        "translation": "There were another 62,000 bodhisattvas from another place who attained the tolerance of not rising above the Dharma.",
        "source": "T16n0656_001:0005b09_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八千清信士女，遠塵離垢得法眼淨；五千比丘漏盡意解；九萬天子離諸貪欲。",
        "translation": "There are another 8,000 pure faithful women who are free of dust and pollution and attain purification of the Dharma eye, 5,000 monks whose contaminants are ended and whose minds are liberated, and 90,000 celestials who are free of desire.",
        "source": "T16n0656_001:0005b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞經莊嚴道樹品第三",
        "translation": "Bodhisattva Yingluo jing zhuangyan daozhu pin 3",
        "source": "T16n0656_001:0005b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸賢者：「吾昔無數阿僧祇劫，積功累行修清淨法，坐臥經行不捨四等，一時、一行、一念之頃修于十法。",
        "translation": "It was then that the Bhagavān addressed the good men, \"In the past, for countless incalculably long eons, I accumulated a lot of effort and cultivated pure things, didn't abandon the four equal things when sitting and lying down in meditation and practice, and cultivated ten things during one moment, one practice, and one moment of thought.",
        "source": "T16n0656_001:0005b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T16n0656_001:0005b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、從兜術天降神下生，盡見十方無數佛剎，見諸菩薩一生補處，皆詣道樹修淨瓔珞，當舉右足欲詣道場慈愍眾生，三千大千剎土皆悉震動。",
        "translation": "One: When he descends from the Tuṣita Heaven and sees as many buddha bases as possible in the ten directions, he sees all the bodhisattvas in their first lifetime patchwork, all headed for the path tree to cultivate their pure jewelry, and when he raises his right foot to go to the path site to have compassion for sentient beings, the 3,000 great thousand buddha lands all shake.",
        "source": "T16n0656_001:0005b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩自念：『吾昔誓願今日已辦，當壞魔界莊嚴佛土。』",
        "translation": "The bodhisattva thinks to himself, 'Now that I've fulfilled my past vows, I will destroy the demon realm and adorn the Buddha land.'",
        "source": "T16n0656_001:0005b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩大慈瓔珞進趣道場心不退轉。",
        "translation": "This is called the bodhisattva's great compassionate diadem as he enters the site of enlightenment with an attitude of nonretrogression.",
        "source": "T16n0656_001:0005b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「二者、盡見三千大千世界菩薩大士心識所念，又入定意三昧不亂，或見菩薩於空成道，或見閑靜樹下之處，或入水光空界三昧，莊嚴道樹不離大悲，是謂菩薩摩訶薩大悲瓔珞進趣道場心不退轉。",
        "translation": "\"Second, when he sees the mindfulness of the bodhisattva's mind and consciousness in all of the 3,000 great one-thousand worlds, enters concentration and mindfulness samādhi without being distracted, sees a bodhisattva attain enlightenment in the sky, sees a place under a quiet tree, or enters the meditative absorption of the watery, empty realm, and adorns the tree of the path without departing from great compassion, this is called the bodhisattva-mahāsattva's great compassionate necklace as he advances to the site of the path with an attitude of nonretrogression.",
        "source": "T16n0656_001:0005b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「三者、菩薩摩訶薩普見三千大千世界，進趣道場不捨喜心，吾今成佛必然不疑，以我法本普潤一切，悉與眾生同黃金色，三十二相八十種好，無央數眾前後圍繞，壞魔羅網成己國土，是謂菩薩摩訶薩修喜瓔珞心不退轉。",
        "translation": "\"Third, the bodhisattva Mahāsattva sees 3,000 great one-thousand worlds in general, advances to the site of enlightenment without abandoning his joyous attitude, has no doubt about becoming a buddha now, pervasively nourishes them all with the source of my teaching, is golden in color with all sentient beings, has thirty-two marks and eighty kinds of beauty, is surrounded by measureless multitudes, and destroys Māra's net to make his own land, which is called the bodhisattva Mahāsattva's joyful diadem of mind that doesn't falter.",
        "source": "T16n0656_001:0005b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「四者、菩薩摩訶薩欲趣道場詣佛樹下，盡見十方阿僧祇剎，一生補處菩薩大士，盡修護心莊嚴道樹，令無數眾生同己護心，不捨一切瓔珞定意，是謂菩薩摩訶薩進趣道場護心正受心不退轉。",
        "translation": "\"4. When a bodhisattva Mahāsattva desires to proceed to the site of enlightenment and goes under a buddha tree, he sees all the incalculable buddhas in the ten directions and the bodhisattvas and mahāsattvas in the patchwork of a lifetime, fully adorning the site of enlightenment with their minds, causing countless sentient beings to share his guarded mind, and not abandoning all his diademed intentions, this is called a bodhisattva advancing to the site of enlightenment who protects his mind and correctly receives his mind and doesn't regress.",
        "source": "T16n0656_001:0005c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「五者、菩薩摩訶薩復見十方無數剎土，一生補處菩薩大士，皆轉法輪不退轉行，法無言說亦無形貌，一相無相空界無形，空猶無空況有法界，是謂菩薩摩訶薩瓔珞空無無形之法。",
        "translation": "\"5. Furthermore, the bodhisattva Mahāsattva sees countless buddha-lands in ten directions where bodhisattvas and bodhisattvas in the patchwork of a lifetime all turn the wheel of the Dharma and practice irreversibly, where the Dharma has neither words nor form, where the single characteristic has no form and the empty realm has no form, and where emptiness is still no emptiness, so why should there be a Dharma realm?",
        "source": "T16n0656_001:0005c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「六者、菩薩摩訶薩普觀十方恒沙剎土，通慧眾生諸根淳淑，意向三乘不捨法忍，慈悲喜護行六重法，四無礙慧一向道忍，自知受決。",
        "translation": "\"Sixth, the bodhisattva Mahāsattva universally observes the buddha lands of the ten directions, fully discerns the purity of sentient beings' faculties, intends to tolerate the three vehicles without abandoning the Dharma, compassionately enjoys the practice of the six grave dharmas, and tolerates the four unhindered views and the one path, knowing and accepting their own decisions.",
        "source": "T16n0656_001:0005c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復見他授其決者，或授羅漢辟支佛決，菩薩自念：『吾從無數阿僧祇劫，捨身受身，皆是幻化非真實法，今得受決，進趣無上正真之道，成最正覺。』",
        "translation": "Also, when he sees another person give him a decision, or when he's given a decision by a arhat or pratyekabuddha, the bodhisattva thinks to himself, 'Since countless incalculably long eons, I've been abandoning body and receiving body, which are illusory and not real dharmas, and now I've attained a decision that will lead me to the unsurpassed true path and to perfect enlightenment.'",
        "source": "T16n0656_001:0005c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊空往來無所罣礙，一時、一處得總持定，諸佛所歎苦習盡道，此苦非苦，苦由何生？",
        "translation": "He wanders through emptiness, goes back and forth without obstruction, attains a single moment or place of total concentration, and attains the path to the end of suffering and accumulation that's praised by the buddhas, which is not suffering but where does suffering arise?",
        "source": "T16n0656_001:0005c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解苦無苦乃應明慧，習由愛興，愛本無形亦不可見，生本無生，況法有滅？",
        "translation": "Understanding suffering and non-suffering should be followed by insight; habituation arises from craving; craving is originally formless and invisible; birth is originally unarisen, so why should things cease?",
        "source": "T16n0656_001:0005c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生愚惑，從起更樂習是得是，解習無習乃應明慧，諸法無生為磨滅法，盡者無生亦無有盡。",
        "translation": "The foolishness of sentient beings is that from arising, further enjoyment and accumulation are attained, and understanding accumulation and non-acquisition should be followed by insight, that dharmas that are unarisen are abrasive and extinct, and that those that are exhausted are unarisen and inexhaustible.",
        "source": "T16n0656_001:0005c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法無盡，眾生愚惑謂盡非盡，於中興想莫貿諸法，盡者實盡，是謂明慧。",
        "translation": "The dharmas are inexhaustible, but the foolishness and confusion of sentient beings say they are not exhausted, and the thoughts that arise in them don't miscarry the dharmas, which are really exhausted, are called insights.",
        "source": "T16n0656_001:0005c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道無相貌，非眼境界之所能見，八直平正坦然無礙，是謂明慧，是謂菩薩摩訶薩進趣道樹心不退轉。",
        "translation": "The path has no appearance, which is not visible to the visual realm but is eightfold, straight, level, and unobstructed is called insight, and this is called the mind of a bodhisattva-mahāsattva who advances to the tree of the path and doesn't turn back.",
        "source": "T16n0656_001:0005c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「七者、菩薩摩訶薩盡觀三千大千剎土，眾生根源高下大小，或與如來心識同趣，本行共合智無增減，大慈大悲瓔珞其身，布施、持戒、忍辱、精進、禪定、智慧、善權方便，十六妙行百千總持，其心廣大不為褊狹，雖見羅漢辟支佛行，心無染著不從彼受，是謂菩薩摩訶薩莊嚴道樹心不退轉。",
        "translation": "\"7. When the bodhisattva Mahāsattva fully observes the 3,000,000 buddha-lands, the root causes of sentient beings, both high and low, large and small, or the same destination as the Tathāgata's mind and consciousness, the merging of past lives and knowledge, the lack of increase and decrease, great kindness and compassion that adorn his body, generosity, observance of precepts, patience, humility, effort, meditation, wisdom, skillful means, and 16 marvelous practices that are summarized in a hundred thousand, his mind is vast and not narrow, and even though he sees the practices of arhats and pratyekbuddhas, his mind is unadulterated and he doesn't follow them, which is called the bodhisattva's adorned tree of the path, and his mind doesn't falter.",
        "source": "T16n0656_001:0005c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「八者、菩薩摩訶薩修行八百總持法門德行法門，菩薩得此法門者，眾行具滿莊嚴道樹。",
        "translation": "\"Eight, when the bodhisattva Mahāsattva cultivates the 800 dharma-gates of maintaining merit and conduct, the bodhisattva attains this dharma-gate, and his multitude of practices are fully ornamented as a tree of the path.",
        "source": "T16n0656_001:0006a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有普忍法門，菩薩得此法門者，普潤一切雨甘露法。",
        "translation": "There's also the Dharma-gate of universal forbearance, which thoroughly moistens all that the bodhisattva possesses as sweet dew.",
        "source": "T16n0656_001:0006a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無相法門，菩薩得此法門者，盡入空行不退轉地。",
        "translation": "\"Again, there's the teaching of marklessness, which allows a bodhisattva to enter the ground of nonretrogression in terms of the practice of emptiness.",
        "source": "T16n0656_001:0006a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有音響法門，菩薩得此法門者，八等行具不聞異音。",
        "translation": "There's also the teaching of sound, which is the eightfold practice of a bodhisattva who doesn't hear different sounds when he attains it.",
        "source": "T16n0656_001:0006a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有身行法門，菩薩得此法門者，身行清淨不造眾惡。",
        "translation": "\"Furthermore, there's the practice of bodily actions, which is a method by which a bodhisattva's physical actions are purified and don't create numerous evils.",
        "source": "T16n0656_001:0006a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有口行法門，菩薩得此法門者，不作四過無他惡行。",
        "translation": "Once again, there's the practice of verbal conduct, which is the bodhisattva's method of not committing the four fallacies and no other bad actions.",
        "source": "T16n0656_001:0006a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有意行法門，菩薩得此法門者，意不馳想寂然滅盡。",
        "translation": "Also, there's the practice of mind as a dharma-gate, which is a way for a bodhisattva to attain tranquility and extinction without distracting thoughts.",
        "source": "T16n0656_001:0006a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無念法門，菩薩得此法門者，入滅盡定觀了無形。",
        "translation": "\"Again, there's the dharma-gate of no-mindfulness, which allows a bodhisattva to enter into the concentration of total cessation and contemplate the immaterial.",
        "source": "T16n0656_001:0006a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有究竟法門，菩薩得此法門者，從此岸得至彼岸。",
        "translation": "\"Again, there's the dharma-gate of finality, which allows a bodhisattva to reach the other shore from this shore.",
        "source": "T16n0656_001:0006a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無著法門，菩薩得此法門者，於生死法不起染著。",
        "translation": "\"Again, there's the dharma-gate of no attachment, which allows a bodhisattva to enter the state of birth-and-death without defiled attachment.",
        "source": "T16n0656_001:0006a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無礙法門，菩薩得此法門者，通達往來不滯生死。",
        "translation": "\"Again, there's the teaching of nonobstruction, which allows a bodhisattva to penetrate past and future without being stranded in birth-and-death.",
        "source": "T16n0656_001:0006a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有應聲法門，菩薩得此法門者，隨行進趣不譏彼受。",
        "translation": "\"Again, there's the teaching of response to sounds, which is a method that allows a bodhisattva to follow the course of conduct and not criticize its appropriation.",
        "source": "T16n0656_001:0006a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有神足法門，菩薩得此法門者，變化自由禮事諸佛。",
        "translation": "\"Again, there's the dharma-gate of supernormal powers, which allows a bodhisattva to change and serve the buddhas freely.",
        "source": "T16n0656_001:0006a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有清淨法門，菩薩得此法門者，淨於智慧無國土想。",
        "translation": "\"Again, there's the dharma-gate of purity, which purifies a bodhisattva's wisdom and gives rise to no conceptions of land.",
        "source": "T16n0656_001:0006a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有空行法門，菩薩得此法門者，解知諸法虛偽不真。",
        "translation": "\"Again, there's the practice of emptiness, which is the gate of bodhisattvas who understand that all things are false and unreal.",
        "source": "T16n0656_001:0006a22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有幻化法門，菩薩得此法門者，觀了眾生權詐合數不可摸像。",
        "translation": "There's also the teaching of illusory transformation, which allows the bodhisattva to observe the unfathomable combination of the provisional and fraudulent in sentient beings.",
        "source": "T16n0656_001:0006a24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無形法門，菩薩得此法門者，眾生根原不可究盡。",
        "translation": "There's also the teaching of immateriality, which is a way for bodhisattvas to understand that the origin of sentient beings can't be fully investigated.",
        "source": "T16n0656_001:0006a25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有道種法門，菩薩得此法門者，修三十七道品不斷。",
        "translation": "\"Again, there's the dharma-gate of the seed of the path, which allows a bodhisattva to cultivate the thirty-seven factors of the path without stopping.",
        "source": "T16n0656_001:0006a26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有意止法門，菩薩得此法門者，觀內外身念念不斷。",
        "translation": "Also, there's the dharma-gate of intentional stabilization, which allows a bodhisattva to observe the internal and external body with unceasing mindfulness.",
        "source": "T16n0656_001:0006a28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有意斷法門，菩薩得此法門者，觀察諸法無若干想。",
        "translation": "Also, there's the dharma-gate of intentional cessation, which is the gate by which a bodhisattva observes the absence of certain conceptions of things.",
        "source": "T16n0656_001:0006a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有神足法門，菩薩得此法門者，住壽無數阿僧祇劫。",
        "translation": "\"Again, there's the dharma-gate of spiritual power, which allows a bodhisattva to live for an incalculably long eon.",
        "source": "T16n0656_001:0006b01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有諸根法門，菩薩得此法門者，道慧甚深牢固無礙。",
        "translation": "\"Again, there's the dharma-gate of the faculties, for when a bodhisattva attains this dharma-gate, his path and wisdom are profound, firm, and unimpeded.",
        "source": "T16n0656_001:0006b02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有神力法門，菩薩得此法門者，安處諸法不可沮壞。",
        "translation": "Once again, there's the dharma-gate of supernormal powers, and when a bodhisattva attains this dharma-gate, he'll be able to stand in a position where all dharmas are undefiled.",
        "source": "T16n0656_001:0006b04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有覺意法門，菩薩得此法門者，以覺意華不為塵垢之所污染。",
        "translation": "\"Again, there's the awakened mind aspect of the teaching, for when a bodhisattva attains this aspect of the teaching, the flowers of awakened mind won't be polluted by the dust of defilements.",
        "source": "T16n0656_001:0006b05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有道品法門，菩薩得此法門者，入定無礙心不錯亂。",
        "translation": "\"Again, there's the dharma-gate of the quality of the path, which enables the bodhisattva to enter concentration without obstruction and without mental disturbance.",
        "source": "T16n0656_001:0006b06_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有空慧法門，菩薩得此法門者，安處眾生永離欲怒。",
        "translation": "Also, there's the dharma-gate of empty wisdom, which is a way for a bodhisattva to be comfortable with sentient beings and be free of desire and anger forever.",
        "source": "T16n0656_001:0006b08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無相法門，菩薩得此法門者，使眾生類懷來道故。",
        "translation": "\"Again, there's the dharma-gate of marklessness, which is the gate of the bodhisattva's attainment of this dharma-gate, so that sentient beings of all kinds will embrace the path of the future.",
        "source": "T16n0656_001:0006b09_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無願法門，菩薩得此法門者，教化眾生除去願求；是謂菩薩摩訶薩八百總持，略說其要，進趣道場莊嚴佛樹，心如金剛不可沮壞。",
        "translation": "Also, there's the aspect of the Dharma of wishlessness, which teaches sentient beings to abandon their aspirations when the bodhisattva attains it; this is called the bodhisattva-mahāsattva's eight hundred cardinal principles, the outline of which explains the essentials, the way to proceed to the site of enlightenment, the adorned Buddha-tree, and the mind that's as indestructible as adamant.",
        "source": "T16n0656_001:0006b10_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「九者、菩薩摩訶薩觀此三千大千世界，一足、二足、三足、四足至無數足，有愛欲心、無愛欲心、有瞋恚心、無瞋恚心、有愚癡心、無愚癡心、有苦樂心、無苦樂心，一時一起一念之頃皆能分別，為說苦空無我人想，是謂菩薩摩訶薩行無想定進趣道場莊嚴佛樹。",
        "translation": "\"9. The bodhisattva Mahāsattva observes these 3,000 great one-thousand worlds, whether one-footed, two-, three-, four-, or countless-footed, with desires and desires, anger and no anger, delusion and no delusion, and pain and pleasure and no pain and pleasure, and is able to discern them all in the moment of a single thought, explaining that suffering is empty and there's no conception of self and person, which is called the bodhisattva practicing the concentration without conception and proceeding to the enlightenment site to adorn the Buddha tree.",
        "source": "T16n0656_001:0006b13_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「十者、菩薩摩訶薩復觀三千大千世界，當來過去現在之心諸根寂靜，行應無上正真之道，是謂菩薩摩訶薩進趣道場莊嚴佛樹。」",
        "translation": "\"Ten, the bodhisattva Mahāsattva also observes the 3,000 great thousand worlds, the future, past, and present, and their minds, their faculties are quiescent, and they practice what should be the unsurpassed true path, which is called the bodhisattva Mahāsattva's advancing to the site of the path and adorning the Buddha tree.\"",
        "source": "T16n0656_001:0006b19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告族姓子：「菩薩摩訶薩初舉右足行第一步，於其中間修行十法，進趣道場莊嚴佛樹。",
        "translation": "The Buddha again told the clansman, \"When the bodhisattva first raises his right leg and takes the first step, he cultivates ten practices in the interim, which lead him to the place of enlightenment and adorn the Buddha tree.",
        "source": "T16n0656_001:0006b22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T16n0656_001:0006b24_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、菩薩摩訶薩當舉右足蹈地之時，自稱名號，三界至尊，過佛恒沙皆行七步，當來諸佛亦皆當然。",
        "translation": "\"1. When the bodhisattva Mahāsattva raises his right foot and steps onto the ground, he calls himself by his own name, 'Most honored in the three realms,' and he takes seven steps beyond the sands of Buddha, which will certainly be the case for all the buddhas of the future.",
        "source": "T16n0656_001:0006b24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今現在出現於世，三界獨尊亦無等侶，諸佛標式不可漏脫，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "Now, when I appear in the world, I'm the sole honored one in the three realms, have no peers, and the standards of the buddhas are unmissable, which is called the bodhisattva-mahāsattva's approach to the site of enlightenment and the adorned Buddha tree.",
        "source": "T16n0656_001:0006b27_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩當舉右足蹈地之時，便作是念：『吾今已逮不退轉地，亦使眾生同我所趣，不捨弘誓廣大之心。』",
        "translation": "\"Furthermore, when he lifts his right foot to the ground, the bodhisattva then thinks, 'Now that I've attained the stage of nonretrogression, I want sentient beings to share my path and not abandon the vast vow.'",
        "source": "T16n0656_001:0006b29_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩莊嚴佛樹進至道場。",
        "translation": "This is called the bodhisattva Mahāsattva adorning the Buddha tree as he enters the site of enlightenment.",
        "source": "T16n0656_001:0006c02_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩初舉右足蹈地之時，復作是念：『過去諸佛，先行是法，當觀一生補處菩薩，紹吾處者名號是誰？』",
        "translation": "\"Furthermore, when the bodhisattva first raised his right foot and stepped onto the ground, he again thought, 'Did the buddhas of the past precede this teaching, and who is the name of the bodhisattva who will guide us to our place in life?'",
        "source": "T16n0656_001:0006c03_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即自右旋顧謂彌勒：『卿後如我成佛不久，百千天人聞皆欣然，異嚮同音稱善無量。",
        "translation": "He then turned to his right and looked at Maitreya, saying, 'Soon after you become a buddha like me, a hundred thousand gods and humans who hear this will rejoice and speak with one voice, saying, 'That's good and immeasurable.'",
        "source": "T16n0656_001:0006c06_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快哉！",
        "translation": "How pleasant!",
        "source": "T16n0656_001:0006c07_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世雄！",
        "translation": "Hero of the World!",
        "source": "T16n0656_001:0006c08_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種不斷。』",
        "translation": "The buddha seed doesn't stop.'",
        "source": "T16n0656_001:0006c08_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於爾時，十一那術諸天、人民見授彌勒印封，皆發無上正真之道，是謂菩薩摩訶薩莊嚴佛樹進至道場。",
        "translation": "At the time, the gods and people of 11 nāmas who saw Maitreya being given the seal of approval all aroused the unsurpassed true path, which is called the bodhisattva Mahāsattva adorned by the Buddha tree as he entered the site of enlightenment.",
        "source": "T16n0656_001:0006c08_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩初舉右足蹈地之時，便作是念：『吾今已逮眾智自在，神慧無礙辯才通達，斯等眾生久抱狐疑，沒溺塵垢不求度脫。",
        "translation": "\"Furthermore, when the bodhisattva first raised his right foot and stepped to the ground, he thought, 'Now, I've gained mastery over many kinds of wisdom and unimpeded eloquence, and these sentient beings have long harbored doubts, drowned in the dust and defilements, and haven't sought deliverance.",
        "source": "T16n0656_001:0006c10_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今當以智慧之火，焚燒心中狐疑之叢。』",
        "translation": "Now, I will use the fire of wisdom to burn up the foxes and doubts in my mind.'",
        "source": "T16n0656_001:0006c13_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩莊嚴佛樹進趣道場。",
        "translation": "This is called the bodhisattva Mahāsattva adorning the Buddha tree as he enters the site of the path.",
        "source": "T16n0656_001:0006c14_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩初舉右足蹈地之時，便復念言：『吾今已得無為解脫，當復接度有為解脫，過去恒沙諸佛世尊皆悉同我無為解脫，當來諸佛亦獲此法。",
        "translation": "\"Furthermore, when the bodhisattva first raised his right foot and stepped to the ground, he then repeatedly thought, 'Now that I've attained liberation from immortality, I will again liberate those who exist, and the buddhas and world-honored ones of the past have all shared my liberation from immortality, and the buddhas of the future will also attain this teaching.'",
        "source": "T16n0656_001:0006c15_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快哉！",
        "translation": "How wonderful!",
        "source": "T16n0656_001:0006c18_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "福報不有斷滅，妄想已盡無所貪求。』",
        "translation": "There's no cessation of merit, and once deluded conceptions have ended, there's nothing to crave.'",
        "source": "T16n0656_001:0006c18_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "This is called the bodhisattva Mahāsattva advancing to the site of enlightenment to adorn the Buddha-tree.",
        "source": "T16n0656_001:0006c19_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩初舉右足蹈地之時，復生此心：『眾生永處邪見顛倒，不覩三向空無之慧。",
        "translation": "\"Furthermore, when the Bodhisattva Mahāsattva first raised his right foot and stepped onto the ground, he again gave rise to this thought: 'Sentient beings are permanently mistaken in their mistaken views and don't see the wisdom of emptiness and nonexistence in the three directions.",
        "source": "T16n0656_001:0006c20_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當演護心清淨，無覺無觀法性虛寂，知慚知愧眾行之本，苦空非身無人無壽，當以此心普覆一切。』",
        "translation": "Now, I will demonstrate that my mind is pure, has no perception or contemplation, is void of the nature of reality, knows conscience and modesty as the basis of all conditioned phenomena, is painfully empty and non-bodily, has no person and no life span, and will use this mind to completely cover them all.'",
        "source": "T16n0656_001:0006c22_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "This is called the bodhisattva Mahāsattva advancing to the site of enlightenment to adorn the Buddha-tree.",
        "source": "T16n0656_001:0006c25_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩初舉右足欲趣浴池，琉璃水精七寶園觀，鳧鴈鴛鴦異類奇鳥，諸天導從不可稱量。",
        "translation": "\"Furthermore, when the bodhisattva first raises his right foot to go to the bathing pool, he sees a crystal-clear water essence, a seven-jeweled garden, ducks, rains, pearls, and strange birds of various kinds, and gods guiding him incalculably.",
        "source": "T16n0656_001:0006c25_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『我今露形乃非其宜，設當入城村落人眾，謂為裸形不知慚恥，宜求袈裟以障于體。』",
        "translation": "'It's not appropriate for me to show my body now, but suppose I were to enter a city or village where people say that I'm naked and don't know how to be ashamed, so I should seek a reddish-brown robe to cover my body.'",
        "source": "T16n0656_001:0006c28_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有天子名曰福蓋，即知菩薩心中所念，尋奉八萬四千金縷織成袈裟。",
        "translation": "A god named Fugai then knew what was on the mind of the bodhisattva and found 84,000 threads of gold to weave into the reddish-brown robe.",
        "source": "T16n0656_001:0006c29_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩自念：『過去諸佛法服云何？",
        "translation": "The bodhisattva thought to himself, 'What was the Dharma robe of the buddhas of the past?'",
        "source": "T16n0656_001:0007a02_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "進趣行來斯用何法？』",
        "translation": "What is the purpose of this advancement?'",
        "source": "T16n0656_001:0007a03_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空神天叉手白言：『過去諸佛皆著織成金縷袈裟，亦如今日諸天所獻。』",
        "translation": "The sky spirits and gods saluted with their palms together, saying, 'The buddhas of the past all wore robes of woven gold, which the gods of today are also offering.'",
        "source": "T16n0656_001:0007a03_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即受八萬四千織成金縷袈裟，以道神力而合為一。",
        "translation": "The bodhisattva then accepted 84,000 robelets of woven gold, which he combined into one with the spiritual power of the Way.",
        "source": "T16n0656_001:0007a05_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "袈裟著體，三十二相八十種好盡皆外現，斯由曩昔施無想報行度無施，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "With the robe over his body, the thirty-two marks and eighty beauties all appear outwardly, which is called the bodhisattva-mahāsattva's approach to the site of enlightenment and adornment of the Buddha-tree because of the results of past generosity and thoughtlessness, conduct, and lack of generosity.",
        "source": "T16n0656_001:0007a06_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩舉右足時，便生此心：『眾生若干性行不同。",
        "translation": "\"Furthermore, when the bodhisattva raised his right leg, this thought arose: 'The natures and actions of sentient beings are different.",
        "source": "T16n0656_001:0007a09_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今當以智慧光明，普照三千大千世界。』",
        "translation": "Now, I will shine the light of wisdom universally on the 3,000 great thousand worlds.'",
        "source": "T16n0656_001:0007a10_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即放頂相光明，普照十方諸佛剎土。",
        "translation": "He then radiated a top-shaped light that universally illuminated the buddha-lands in the ten directions.",
        "source": "T16n0656_001:0007a11_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生之類見光明者，悉來雲集詣忍世界，奉事如來香華供養。",
        "translation": "All the sentient beings who see that light come together in clouds to visit the world of tolerance and serve the Tathāgata with incense and flowers and make offerings.",
        "source": "T16n0656_001:0007a12_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "威神所感，使令天地六返震動，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "This is called the bodhisattva-mahāsattva's approach to the site of enlightenment and the adorned Buddha-tree, which is caused by his authoritative power and spirit to cause the six rebirths of heaven and earth to shake.",
        "source": "T16n0656_001:0007a13_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩當舉足時，心自生念：『生分已盡更不受胎，三界獨尊無有疇匹，當號為佛、如來、至真、等正覺，十號具足。』",
        "translation": "\"Furthermore, when the bodhisattva raises his feet, his mind naturally thinks, 'Having ended the portion of birth and gone beyond birth, I'm the sole honored one in the three realms without peer, and I will be called Buddha, Tathāgata, Supreme Truth, and Completely Awakened One, with all ten epithets.'",
        "source": "T16n0656_001:0007a15_70",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方剎土諸佛世尊，各各於其國土，告四部眾、天、龍、鬼神、乾沓和、阿須倫、迦留羅、緊陀羅、摩休勒、人與非人：『今日忍界釋迦文佛出現于世，眾相具足如星中月，福度眾生天人蒙祐，有欲興敬供養彼佛，宜知是時。』",
        "translation": "The buddhas of the buddha lands in the ten directions each addressed four groups of people, gods, dragons, ghosts, gods, gods, asuras, garuḍas, kiṃnara, mahoraga, humans, and nonhumans, saying, 'Today, the Śākyamuni Buddha of the forbearance realm appears in the world, replete with features like the moon among the stars, and blessings are bestowed on sentient beings, gods, and humans who wish to revere and make offerings to him.",
        "source": "T16n0656_001:0007a17_71",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，十方諸佛世界神通菩薩辯才具足，得總持門，千七百七十七億那術眾，皆來雲集詣此忍界，興致供養華至于膝。",
        "translation": "At the time, in the ten directions of the Buddha-realm, there were 707.7 billion Nārāyaṇa multitudes of bodhisattvas with supernormal abilities and the ability to master the gate, all of whom gathered in clouds at this forbearance realm and offered offerings in flowers up to their knees.",
        "source": "T16n0656_001:0007a22_72",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八十萬姟天魔波旬，皆詣忍界，興致供養給事菩薩。",
        "translation": "Another 800,000 gods, Māra Pāpīyān, all visited the forbearance realm and made offerings to serve the bodhisattva.",
        "source": "T16n0656_001:0007a25_73",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有百千億姟神力龍王，各各七首，獻奉香湯浴洗菩薩。",
        "translation": "There were another 100,000,000,000 dragon-king gods with supernormal powers, each with seven heads, who presented incense and hot water to bathe the Bodhisattva.",
        "source": "T16n0656_001:0007a26_74",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯由曩昔口演甘露無厭足法，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "This is called the bodhisattva Mahāsattva advancing to the site of enlightenment and adorning the Buddha-tree because of the nectar of the mouth that spoke the unsatisfied Dharma in the past.",
        "source": "T16n0656_001:0007a27_75",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩內自生念：『眾生著有迷惑來久，設聞空無虛寂之法，意懷恐懼衣毛為竪。",
        "translation": "\"Furthermore, the bodhisattva himself thinks, 'Long have sentient beings been attached to the delusion of existence, and if they hear about the teaching of emptiness and nonsubstantiality, their minds become frightened, and their hair stands on end.",
        "source": "T16n0656_001:0007a29_76",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛法深奧不可思議，漸當以次說道根原，分別眾生根原所由，玄鑒三世生法滅法，除去想著無貪悋心，從無數劫積行已來，所以不得道者皆由恩愛。",
        "translation": "The Buddha's teaching is unfathomably profound, so gradually we'll explain the origin of the path in order, discern the origin of the roots of sentient beings, examine profoundly the three worlds, remove conceptual attachments, become free of craving and stinginess, and accumulate practice since innumerable eons, so those who don't attain the path all come from kindness and love.",
        "source": "T16n0656_001:0007b02_77",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今當除恩愛刺本，拔濟眾生安處無為。』",
        "translation": "Now, I will remove the thorns of craving and relieve sentient beings of the root of their lack of activity.'",
        "source": "T16n0656_001:0007b05_78",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "This is called the bodhisattva Mahāsattva advancing to the site of enlightenment to adorn the Buddha-tree.",
        "source": "T16n0656_001:0007b06_79",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，族姓子！",
        "translation": "\"So it is, clansman!",
        "source": "T16n0656_001:0007b07_80",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩大士降神出生、墮地舉右足，於其中間思惟十法，莊嚴道樹亦不退轉。",
        "translation": "That bodhisattva-mahāsattva is born by descent, falls to the ground, raises his right foot, and contemplates the ten dharmas in his midst, adorning the tree of the path and not turning back.",
        "source": "T16n0656_001:0007b07_81",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007b09_82",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩初生時，墮地行七步欲趣金机，次舉左足內自思惟：『諸佛世尊句義無量道法淳粹，應度無極無起滅法，行無生滅不可思議，非是羅漢辟支所及。",
        "translation": "When the bodhisattva is first born, he falls to the ground and walks the seven steps to the golden opportunity of desire, then he raises his left foot and reflects to himself, 'The Bhagavān's phrases and meanings are limitless, his path and principles are pure, his deliverables are limitless, his arising and ceasing are unfathomable, and his practice is beyond the reach of arhats and pratyekbuddhas.",
        "source": "T16n0656_001:0007b09_83",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道當一意多念非道，道當少欲多欲非道，道當知足多求非道，道當正見邪見非道。』",
        "translation": "The path should be single-minded and many-minded, not the path; the path should be few in desires and many desires, not the path; the path should be satisfying and many-seeking, not the path; and the path should be right view and wrong view, not the path.'",
        "source": "T16n0656_001:0007b13_84",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，菩薩復作是念：『過去諸佛所行正法，為何謂耶？』",
        "translation": "The bodhisattva then again had this thought, 'What was the meaning of the right teaching practiced by the buddhas in the past?'",
        "source": "T16n0656_001:0007b15_85",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：『過去恒沙諸佛世尊出現於世，以神足力現身威德，十根本義不可思議。",
        "translation": "Again, he thought, 'The buddhas of the sands of the past appeared in the world and demonstrated their physical prowess with miraculous powers, and the ten fundamental meanings are unfathomable.",
        "source": "T16n0656_001:0007b16_86",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？』",
        "translation": "What are the ten?'",
        "source": "T16n0656_001:0007b18_87",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，族姓子！",
        "translation": "Thus, the sons of the clan!",
        "source": "T16n0656_001:0007b18_88",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩達士先舉左足，遍滿三千虛空境界，不嬈眾生無覺知者，其有眾生覩足相輪，皆發無上正真道意，斯由曩昔禮敬之報，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "The bodhisattva first raises his left foot and fills the 3,000 sky realm without agitating sentient beings who don't perceive it, and then when they see his feet in the wheel of characteristics, they all arouse the intention for the unsurpassed true path because of the rewards of veneration in the past, which is called the bodhisattva-mahāsattva's approach to the path and adornment of the Buddha-tree.",
        "source": "T16n0656_001:0007b18_89",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007b22_90",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，菩薩左足蹈地，心自生念：『古昔諸佛說法，云何分別句身義味？",
        "translation": "At that point, the bodhisattva planted his left foot on the ground and thought to himself, 'In the past, when the buddhas taught, how did they discern the meaning and taste of the phrases?'",
        "source": "T16n0656_001:0007b22_91",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何過去諸佛世尊進止行來威儀法則，以一句義演出無量諸佛法藏，從劫至劫乃至百劫，不能究盡一句之義？",
        "translation": "How is it that in the past, the Bhagavān, in his code of conduct and manner, performed measureless collections of the Buddha's teachings with the meaning of a single phrase, and from eon to eon and up to a hundred eons, couldn't exhaust the meaning of a single phrase?",
        "source": "T16n0656_001:0007b24_92",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來祕要不可思議，非是小節所能測度。』",
        "translation": "The Tathāgata's esoteric teachings are unfathomable and can't be fathomed in minor detail.'",
        "source": "T16n0656_001:0007b27_93",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩進趣道場莊嚴佛樹。」",
        "translation": "This is called the bodhisattva Mahāsattva advancing to the site of enlightenment to adorn the Buddha-tree.\"",
        "source": "T16n0656_001:0007b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告族姓子：「菩薩爾時放一毛孔光明，遍照無量諸佛剎土。",
        "translation": "The Buddha again told Clansman, \"At the time, the bodhisattva radiated a single pore of light that illuminated measureless buddha-lands.",
        "source": "T16n0656_001:0007b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於光明中，演說六度平等大法、空無想願不起法忍，亦使眾生畢志堅固，皆發無上正真道意，是謂菩薩進趣道場莊嚴佛樹。",
        "translation": "In that light, he explained the great dharma of equality of the six perfections, the acceptance of emptiness, absence of ideation, and vowing, and caused all sentient beings to become resolute and develop the intention for the unsurpassed true path, which is called the bodhisattva's adorned Buddha tree of advancing to the site of enlightenment.",
        "source": "T16n0656_001:0007c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時，內自思惟：『吾今當以三昧正受，普遊虛空諸佛法界。』",
        "translation": "At that point, the bodhisattva thought to himself, 'Now, with samādhi and correct feelings, I will travel throughout the Dharma realm of the buddhas in space.'",
        "source": "T16n0656_001:0007c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，菩薩即入無形想定意，遍遊虛空諸佛法界，左右翼從，天世人民莫覺知者，謂為菩薩進趣金机，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "At that point, the bodhisattva then entered the concentration of immaterial perception and traveled throughout the universe to the Dharma realms of the buddhas, assisted by right and left, and was considered by the gods and people of the world to be a bodhisattva advancing to the golden opportunity, which is called the bodhisattva-mahāsattva advancing to the site of the path to adorn the buddha tree.",
        "source": "T16n0656_001:0007c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即化一形，遍滿三千大千世界，復還如故，眾生之類無覺知者，是謂菩薩進趣道場莊嚴佛樹。",
        "translation": "To instantly transform one form and pervade 3,000 great one-thousand worlds and return to it as before, with no awareness among sentient beings, is called a bodhisattva advancing to the site of the path and adorning the Buddha-tree.",
        "source": "T16n0656_001:0007c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時，慧明之光遍照三千大千剎土，一一光中皆出音聲：『今日釋迦文佛、如來、至真、等正覺，於閻浮利地，當轉法輪度未度者，福利眾生名稱遠布。』",
        "translation": "At that point, the bodhisattva's light of insight shone throughout 3,000 great thousand buddha-lands, and from each of those lights there was a sound, 'Today, the Śākyamuni Buddha, the Tathāgata, the Supreme Truth, and the Completely Awakened One, is turning the wheel of the Dharma in the land of Jambudvī to save those who have yet to be saved and to spread the name of the welfare of sentient beings far and wide.'",
        "source": "T16n0656_001:0007c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩進趣道場莊嚴佛樹。",
        "translation": "This is called a bodhisattva advancing to the site of enlightenment to adorn the Buddha-tree.",
        "source": "T16n0656_001:0007c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時一念之頃，令十方界諸佛世尊，各各舒手扶接菩薩，一切眾會皆悉見之，是謂菩薩進趣道場莊嚴佛樹。",
        "translation": "In that moment of instantaneous thought, the bodhisattva causes the world-honored buddhas of the ten directions to reach out and support the bodhisattva, and all the assembled people see them, which is called the bodhisattva's approach to the site of enlightenment and adornment of the Buddha-tree.",
        "source": "T16n0656_001:0007c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛法藏深奧難測，吾當以次布現三乘緣覺聲聞菩薩之道，聞法覺寤終不中滯，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "The treasury of the buddhas' teachings is profound and unfathomable, so I will present in order the path of the śrāvaka bodhisattvas, the pratyekabuddhas of the three vehicles, who hear the teachings and awaken to them and never become stranded, which is called a bodhisattva-mahāsattva advancing to the site of the path to adorn the buddha tree.",
        "source": "T16n0656_001:0007c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去三世諸佛世尊，吾今欲成無為大道，皆當證明令我成道。",
        "translation": "\"In the past three worlds, the buddhas and world-honored ones, now that I want to achieve the great path of nonproductivity, will all make it possible for me to achieve the path.",
        "source": "T16n0656_001:0007c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛稱善皆在前立：『汝從阿僧祇劫，苦行無數，布施持戒六度具足，國財妻子無所悋惜，今當成佛廣度眾生。",
        "translation": "The buddhas all praised him for his goodness and stood before him, 'Since the incalculably long eon, you've done countless ascetic practices, bestowed generosity, upheld precepts, fulfilled the six perfections, and spared nothing for your country, wealth, or wife.",
        "source": "T16n0656_001:0007c23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等扶接上至成佛不使中住。』",
        "translation": "We'll help you to go up to become a buddha and not let you stop in the middle.'",
        "source": "T16n0656_001:0007c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "This is called the bodhisattva Mahāsattva advancing to the site of enlightenment to adorn the Buddha tree.",
        "source": "T16n0656_001:0007c27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0007c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩分別過去現在未來，空無想願，亦是諸佛所應行法。",
        "translation": "A bodhisattva's discrimination of past, present, and future, emptiness, and wishlessness are also things that buddhas should practice.",
        "source": "T16n0656_001:0007c28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從初發意乃至成佛，要當修習三向諸道、四等大慈、八無礙道，瓔珞其身，是謂菩薩摩訶薩進趣道場莊嚴佛樹。」",
        "translation": "From the time they first arouse their intention until they become buddhas, they must cultivate the three paths, the four great compassionate qualities, and the eight unhindered paths, and they must decorate their bodies, which is called the bodhisattva-mahāsattva's adorned buddha tree as he advances to the site of enlightenment.\"",
        "source": "T16n0656_001:0007c29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告族姓子：「菩薩次舉右足當蹈地時，當具足此神足十慧不可思議。",
        "translation": "The Buddha again told the clansman, \"When the bodhisattva next raises his right foot and steps onto the ground, he will have perfected these ten unfathomable miraculous abilities and wisdoms.",
        "source": "T16n0656_001:0008a03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T16n0656_001:0008a04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有神足慧名曰無著，菩薩得此慧者，盡遊諸佛深要法藏，是謂菩薩摩訶薩進趣道場莊嚴佛樹。",
        "translation": "\"There's the spiritual wisdom called 'unattached,' and when a bodhisattva attains this wisdom, he travels fully to the profound Dharma treasury of the buddhas, which is called the bodhisattva-mahāsattva's adorned Buddha tree as he advances to the site of enlightenment.",
        "source": "T16n0656_001:0008a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有神慧名曰無形，菩薩得此神慧者，入無厭定意，諮受十方諸佛言教。",
        "translation": "\"Furthermore, there's the spiritual wisdom called immaterial, which enables a bodhisattva to enter into the mind of unwearying concentration and consult the words and teachings of the buddhas in the ten directions.",
        "source": "T16n0656_001:0008a07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有無二神慧，菩薩得此神慧者，勸進眾生成無上等正覺，不取聲聞辟支佛道。",
        "translation": "\"Again, there's the spiritual wisdom of nonduality, which encourages bodhisattvas to become unsurpassed, perfectly enlightened beings who don't pursue the path of the śrāvakas and pratyekbuddhas.",
        "source": "T16n0656_001:0008a08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有虛空神慧，菩薩得此神慧者，盡觀世界空無我人。",
        "translation": "\"Furthermore, there's the spiritual wisdom of space, which enables a bodhisattva to fully observe that the world is empty of self and has no one.",
        "source": "T16n0656_001:0008a10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有無相神慧，菩薩得此神慧者，演暢諸法解一相無相，亦無生滅著斷之法。",
        "translation": "\"Furthermore, there's the spiritual wisdom of marklessness, which enables a bodhisattva to understand the understanding of all things as being one mark and markless, and to have no dharmas that arise or cease from attachment.",
        "source": "T16n0656_001:0008a11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有空觀神慧，菩薩得此神慧者，見諸佛土成者敗者，如觀掌珠。",
        "translation": "\"Furthermore, there's the spiritual wisdom of contemplation of emptiness, which enables a bodhisattva to see all the buddha lands that are made or unmade like observing a pearl in the palm of his hand.",
        "source": "T16n0656_001:0008a13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有棄壽神慧，菩薩得此神慧者，觀壽緣報捨形受形。",
        "translation": "\"Furthermore, there's the spiritual wisdom of renouncing life, which enables a bodhisattva to observe the conditioned rewards of life and to abandon form and receive form.",
        "source": "T16n0656_001:0008a15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有無言說神慧，菩薩得此神慧者，說法無法想，亦無若干念。",
        "translation": "\"Furthermore, there's the spiritual wisdom of no language, which gives the bodhisattva the spiritual wisdom that makes discourse inconceivable and has no number of thoughts.",
        "source": "T16n0656_001:0008a16_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有無近遠神慧，菩薩得此神慧者，不見諸法窠窟遠近。",
        "translation": "\"Furthermore, there's the spiritual wisdom of no nearness or remoteness, which gives the bodhisattva the spiritual wisdom to not see the nooks and crannies of dharmas as far away or near.",
        "source": "T16n0656_001:0008a18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有無生滅神慧，菩薩得此神慧者，分別十二因緣根本，生者滅者悉無所有，是謂菩薩摩訶薩十神足慧進趣道場莊嚴佛樹。」",
        "translation": "\"Furthermore, there's the spiritual wisdom of no arising or ceasing, and when a bodhisattva attains this spiritual wisdom, he discerns the root of 12 causes and conditions, and what's born and what's ceased are all nonexistent. This is called the bodhisattva-mahāsattva's ten miraculous powers and wisdom that advance to the site of enlightenment and adorn the Buddha-tree.\"",
        "source": "T16n0656_001:0008a19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告族姓子：「菩薩初生舉左足時，復當具足十業無量究竟。",
        "translation": "The Buddha again told the clansman, \"When a bodhisattva is first born and raises his left leg, he'll also be fully endowed with ten actions that are measureless.",
        "source": "T16n0656_001:0008a22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T16n0656_001:0008a23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，族姓子！",
        "translation": "Thus, the sons of the clan!",
        "source": "T16n0656_001:0008a24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來之所修行，如來降形出世教化，分別三世十二牽連，三界五道塵垢縛著，沐浴諸結永無塵曀，是謂菩薩修第一業進趣道場莊嚴佛樹。",
        "translation": "The practice of buddha-tathāgatas, descending from the Tathāgata in form to appear in the world to teach and discern the twelve connections in the three worlds, the three realms and five destinies that are tied by the dust and dirt, and bathing the bonds in a permanent absence of dust and clouds is called the first activity cultivated by a bodhisattva who advances to the site of enlightenment and adorns the Buddha-tree.",
        "source": "T16n0656_001:0008a24_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0008a27_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來出世化諸眾生，安處三乘隨其所願；或有眾生，意趣羅漢不向佛門；或有眾生，習緣覺行不趣佛道；或有眾生，修無上道，不向聲聞緣覺辟支；或有眾生，退於佛道志慕小乘。",
        "translation": "The Tathāgata appears in the world to convert sentient beings who are settled in the three vehicles according to their wishes; there are sentient beings who purposefully pursue the arhat path rather than the Buddha path; there are sentient beings who cultivate the pratyekabuddha path rather than the śrāvakas, pratyekabuddhas, and pratyekabuddhas; or there are sentient beings who retrogress from the Buddha path and aspire to the lesser vehicle.",
        "source": "T16n0656_001:0008a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，菩薩誘進前人，逮成無上正真之道。",
        "translation": "\"At that point, the bodhisattva induces and advances the former person to achieve the unsurpassed true path.",
        "source": "T16n0656_001:0008b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生，在凡夫地不求方便上及三乘，菩薩勸進成三乘道，是謂菩薩第二之業進趣道場莊嚴佛樹。",
        "translation": "Sometimes there are sentient beings in the worldling stage who don't seek the higher way or the three-vehicle path, and the bodhisattva encourages them to achieve the three-vehicle path, which is called the second bodhisattva activity of advancing to the site of enlightenment and adorning the Buddha tree.",
        "source": "T16n0656_001:0008b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來出世布現言教，以權方便適化眾生，荷負重擔為人重任。",
        "translation": "\"The Tathāgata appears in the world, disseminates the teaching, adapts it to sentient beings with expedient methods, and carries a heavy burden for others.",
        "source": "T16n0656_001:0008b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或與眾生現作父母兄弟朋友，或現國師尊長道士，或現大富長者、神力鬼王，周給貧困惠施七寶，開說道教成三乘果，是謂菩薩修習三業進趣道場莊嚴佛樹。",
        "translation": "Whether he appears to sentient beings as parents, brothers, friends, national masters, venerable teachers, or great wealthy elders or powerful demon kings, bestows seven treasures on the poor and needy, and explains the path's teaching to achieve the fruit of the three vehicles, this is called the bodhisattva's third practice of advancing to the path and adorning the Buddha-tree.",
        "source": "T16n0656_001:0008b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來出世轉無上法輪，不失四辯，觀察人心授十善行，分別演暢苦習盡道。",
        "translation": "\"When the Tathāgata appears in the world and turns the unsurpassed wheel of the Dharma, he doesn't lose his four abilities, observes people's minds and teaches the ten good practices, and discerns and presents the path to the end of suffering and accumulation.",
        "source": "T16n0656_001:0008b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或生迷惑沒溺三界，行權拔濟永離生死，是謂菩薩修第四業進趣道場莊嚴佛樹。",
        "translation": "When a person is deluded and submerged in the three realms, he practices expedient deliverance and permanently escapes birth and death; this is called the fourth activity of a bodhisattva who approaches the enlightenment site and adorns the Buddha-tree.",
        "source": "T16n0656_001:0008b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來世尊出現於世，恒以大悲加被眾生，如母愛子心不捨離。",
        "translation": "\"When the Tathāgata appeared in the world, the Bhagavān always bestowed great compassion on sentient beings, like a mother who loves her child and doesn't abandon him at heart.",
        "source": "T16n0656_001:0008b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如龍王伊羅鉢多羅，住於須彌金福山邊七寶宮殿，與諸龍女共相娛樂，若欲往至忉利天宮興致供養，化身七萬由延三十二頭，一一頭者邊有七牙，一一牙上有寶浴池，一一池中生七百蓮華，一一蓮華七百玉女，共相娛樂作倡伎樂，彈琴鼓瑟音聲不絕。",
        "translation": "Suppose the dragon king Airāpattra lives in a palace of seven treasures on the edge of Sumeru's golden mountain of merit, entertains the nymphs together, and, if he wants to go to the palace of the Thirty-three gods to make offerings, transforms into a body of 70,000 leagues and 32 heads, and on each head there are seven teeth, and on each tooth there's a jeweled bath, and in each pond there are 700 lotus flowers, and in each lotus flower 700 jade maidens who entertain each other with music and play the lutes and drum, making endless sounds.",
        "source": "T16n0656_001:0008b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復雨七寶乃至于膝，菩薩大士亦復如是，以四等心加被眾生，雨七覺意無窮法財，隨其志趣皆成道果，是謂菩薩修第五業進趣道場莊嚴佛樹。",
        "translation": "It rains down seven treasures up to his knees, and so does the bodhisattva-mahāsattva bestow four equal qualities on sentient beings, raining down seven awarenesses and limitless treasures of the Dharma that will bring about the fruit of the path according to their aspirations, which is called the fifth activity of a bodhisattva cultivating the path to adorn the Buddha tree.",
        "source": "T16n0656_001:0008b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來世尊以權方便隨時適化，可行知行可坐知坐、可言知言可默知默，遍入眾生心識所念，隨病療救不使增減，普令永處無為之岸，是謂菩薩修第六業進趣道場莊嚴佛樹。",
        "translation": "\"The Tathāgata World Honored One uses skillful means to adapt at any time, knowing when he's walking, knowing when he's sitting, knowing when he's sitting, knowing when he's speaking, and knowing when he's silent, pervading the thoughts of sentient beings' minds and consciousnesses, treating illnesses as they arise and not allowing them to increase or decrease, and universally placing them permanently on the shore of nonproductivity is called the sixth activity of a bodhisattva cultivating the adorned Buddha tree of the path of advancement.",
        "source": "T16n0656_001:0008b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0008c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來出世，化導眾生不自為身，為一人故經百千劫，代彼受苦不懷厭惓，安處佛慧成無上道，是謂菩薩修第七業進趣道場莊嚴佛樹。",
        "translation": "When the Tathāgata appears in the world, he guides sentient beings without making himself into a body, goes through a hundred thousand eons for the sake of one person, suffers suffering on their behalf without wearying, and stands in the Buddha's wisdom to achieve the unsurpassed path, which is called the seventh action of a bodhisattva cultivating and proceeding to the site of enlightenment to adorn the Buddha-tree.",
        "source": "T16n0656_001:0008c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛興出不壞法界，法性自爾亦非自爾，如爾真際亦不有壞非不有壞，修而不懼亦不恐畏，是謂菩薩修第八業進趣道場莊嚴佛樹。",
        "translation": "\"When buddhas arise and appear, they don't despoil the Dharma realm, their Dharma nature is self-evident and not self-evident, there's neither decay nor non-decay at the true state of suchness, and they cultivate it without fear or trepidation, which is called the eighth activity of a bodhisattva cultivating the adorned Buddha-tree of advancing to the enlightenment site.",
        "source": "T16n0656_001:0008c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來出世，當復具足一相無相，彈指之頃於過去未來現在法中，出生三世諸佛世尊，實而不異亦不變易，是謂菩薩修第九業進趣道場莊嚴佛樹。",
        "translation": "\"When the Tathāgata arises in the world, he'll again possess unity of character and signlessness, and in the snap of a finger, in the past, future, and present, he'll give rise to the buddhas and world-honored ones of the three times, which are real and not different and don't change, which is called the ninth karma of a bodhisattva cultivating the path of advancement and adorning the Buddha-tree.",
        "source": "T16n0656_001:0008c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如來出世慈愍眾生，以一日之數令三世為一劫，其中眾生無覺知者，是謂菩薩初生墮地舉左足修行十業進趣道場莊嚴佛樹。」",
        "translation": "\"When the Tathāgata appeared in the world, he had compassion on sentient beings and made the three worlds into one eon for the number of one day, and sentient beings therein had no awareness of it, which is called a bodhisattva who is first born, falls to the ground, raises his left foot, cultivates the ten activities, and proceeds to the enlightenment site to adorn the Buddha tree.\"",
        "source": "T16n0656_001:0008c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告族姓子：「菩薩初生墮地七步，於其中間復當思惟十法，降伏外道壞魔羅網，諸天侍衛，進趣道場莊嚴佛樹，乃至滅度終不捨離。",
        "translation": "The Buddha again told Clansman, \"When a bodhisattva first arises and falls seven steps to the ground, he should again contemplate ten things during that time, subdue non-Buddhists, destroy Māra's web, be guarded by gods, and proceed to the site of enlightenment to adorn the Buddha tree, never abandoning it until he reaches extinction.",
        "source": "T16n0656_001:0008c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T16n0656_001:0008c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是族姓子，先當降魔，身被慈仁之鎧，手執慧劍，善權前導，頭戴無畏華鬘，摧却憍慢之眾，永除貢高。",
        "translation": "Then, the clansman first subdues Māra, puts on the armor of kindness, carries the sword of wisdom in his hand, guides him with good authority, wears a fearless garland on his head, destroys the arrogant masses, and permanently removes arrogance.",
        "source": "T16n0656_001:0008c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂，族姓子！",
        "translation": "This is called, clansman!",
        "source": "T16n0656_001:0008c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先當修此第一難得之法。",
        "translation": "First, you should cultivate this first difficult-to-obtain teaching.",
        "source": "T16n0656_001:0008c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0008c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復當思惟玄妙廣義，斷漏取證，攝彼外道而為上首，加以神足神力無量，設彼現一，我當現二，趣使邪部安處正見。",
        "translation": "\"Furthermore, you should contemplate its profound and detailed meaning, cut off contaminants and grasp at their realization, gather in those non-Buddhists as their leaders, and add their spiritual powers, which are immeasurable, so that if they show one, I will show two, and aim to put the wrong group in the right view.",
        "source": "T16n0656_001:0008c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是謂，族姓子！",
        "translation": "That's right, clansman!",
        "source": "T16n0656_001:0008c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩當念修此第二難得之法。",
        "translation": "Bodhisattvas should be mindful of cultivating this second difficult-to-obtain teaching.",
        "source": "T16n0656_001:0008c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0008c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩大士化度眾生，受法歡喜，必至堅固不趣餘道，是謂菩薩修行第三難得之法。",
        "translation": "This is called the third most difficult thing for a bodhisattva to attain when he cultivates the practice of saving sentient beings and is delighted by the teaching, which will surely become resolute and not lead to another path.",
        "source": "T16n0656_001:0008c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0008c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊恒所行法，日夜四時觀察眾生，彈指之頃周遍十方恒沙剎土，周而復始不著三界，是謂菩薩修行第四難得之法。",
        "translation": "The Bhagavān always practices a Dharma, observes sentient beings day and night at four times, and in the snap of a finger travels around the buddha lands of the ten directions, never getting attached to the three realms again and again, which is called the fourth difficult-to-obtain dharma for bodhisattvas to cultivate.",
        "source": "T16n0656_001:0008c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0009a01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行無礙智，遍滿三千大千世界，雖度眾生不見有度，是謂菩薩修習第五難得之法。",
        "translation": "To practice unhindered cognition and to pervade a world of 3,000 great one-thousand worlds, even though one doesn't see any sentient beings being saved, is called the fifth difficult-to-obtain thing for a bodhisattva to cultivate.",
        "source": "T16n0656_001:0009a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0009a03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩大士以神足力，遍遊十方恒沙剎土，遍觀眾生心識所念，或以一身化百千身還合為一，無覺知者，是謂菩薩修行第六難得之法。",
        "translation": "When a bodhisattva travels around the lands of the sands of the ten directions with miraculous powers, observes the thoughts of the minds and consciousnesses of sentient beings, or transforms one body into a hundred thousand bodies that merge back into one without perception, this is called the sixth difficult-to-obtain thing that a bodhisattva cultivates.",
        "source": "T16n0656_001:0009a03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0009a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩思惟四無礙慧，亦非羅漢辟支所修，亦非天龍鬼神八部之眾所能及逮，是謂菩薩修行第七難得之法。",
        "translation": "The bodhisattva's contemplation of the four kinds of unhindered wisdom, which are not cultivated by arhats and pratyekbuddhas and are beyond the reach of gods, dragons, ghosts, spirits, and the eight orders of beings, is called the seventh difficult-to-obtain thing for a bodhisattva to cultivate.",
        "source": "T16n0656_001:0009a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0009a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來神力不可思議，十方無量諸佛剎土入一塵孔，周旋往來無有罣礙，還復如故無覺知者，是謂菩薩修行第八難得之法。",
        "translation": "The unfathomable power of the Tathāgata, the unfathomable ability to enter a single dust pore of measureless buddha bases in ten directions, move around without obstruction, and return as before without perception is called the eighth difficult-to-obtain thing for a bodhisattva to practice.",
        "source": "T16n0656_001:0009a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0009a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、至真、等正覺，得四辯才無生滅智，遍滿三千大千世界，是謂菩薩修行第九難得之法。",
        "translation": "The Tathāgata, the supremely true, and the perfectly enlightened one attains the knowledge of the four abilities of eloquence that lack arising and ceasing and pervade a world of 3,000 great one-thousand worlds, which is called the ninth difficult-to-obtain thing for a bodhisattva to cultivate.",
        "source": "T16n0656_001:0009a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，族姓子！",
        "translation": "\"Furthermore, clansmen!",
        "source": "T16n0656_001:0009a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊行無盡法法門覆蓋眾生，十力、無畏、十八不共諸佛之法，是謂菩薩修行第十難得之法，進趣道場莊嚴佛樹。」",
        "translation": "The Bhagavān's practice of the inexhaustible Dharma teachings that cover sentient beings and the ten powers, fearlessness, and eighteen distinctive characteristics of the buddhas is called the tenth difficult-to-obtain dharma that bodhisattvas cultivate to advance to the site of enlightenment and adorn the buddha tree.\"",
        "source": "T16n0656_001:0009a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞經卷第一",
        "translation": "Pusa yingluo jing, vol. 1",
        "source": "T16n0656_001:0009a19_0",
        "is_bad_quality": false
    }
]