[
    {
        "source_sentence": "大乘密嚴經卷中",
        "translation": "Great Vehicle Sutra of Mysterious Adornment, Volume 1",
        "source": "T16n0682_002:0755c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開府儀同三司特進試鴻臚卿",
        "translation": "Minister Hong of the Specially Advanced Examination of the Third Secretary of the Kaifu Ritual",
        "source": "T16n0682_002:0755c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "肅國公食邑三千戶賜紫贈司空",
        "translation": "The Duke of Sukuk received a grant of 3,000 households and was given a purple robe as a gift from the Secretary of State.",
        "source": "T16n0682_002:0755c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諡大鑑正號大廣智大興善寺",
        "translation": "Dajian Zhenghao, Daguangzhi Daxingshansi",
        "source": "T16n0682_002:0755c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏沙門不空奉　詔譯",
        "translation": "Tripiṭaka Master Bhikṣu translates from the imperial edict",
        "source": "T16n0682_002:0755c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入密嚴微妙身生品之餘",
        "translation": "the rest of the Chapter on the Production of the Subtle Body of Mysterious Adornment",
        "source": "T16n0682_002:0755c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大會中有普賢眾色大威德菩薩摩訶薩，與其同類持世菩薩摩訶薩、持進菩薩摩訶薩、曼殊室利菩薩摩訶薩、神通王菩薩摩訶薩、得大勢菩薩摩訶薩、解脫月菩薩摩訶薩、金剛臍菩薩摩訶薩、大樹緊那羅王菩薩摩訶薩、虛空藏菩薩摩訶薩等，乃至摩尼大寶藏殿無量諸天。",
        "translation": "At the time, there was in the assembly the Bodhisattva Mahāsattva of Bhadraśri and his counterparts, the Bodhisattva Mahāsattva of World Preservation, the Bodhisattva Mahāsattva of Progress, the Bodhisattva Mahāsattva of Mañjuśrī, the Bodhisattva Mahāsattva of King of Psychic Powers, the Bodhisattva Mahāsattva of Attaining Great Power, the Bodhisattva Mahāsattva of the Moon of Liberation, the Bodhisattva Mahāsattva of the Vajra Navel, the Bodhisattva Mahāsattva of the Great Tree Kinnar King, the Bodhisattva Mahāsattva of the Sky Store, and so forth, as well as measureless gods in the great maṇi treasure house.",
        "source": "T16n0682_002:0755c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有密嚴土中諸瑜祇眾，與彼無量俱胝佛剎來聽法者，聞說密嚴甚深功德，於法恭敬定得轉依，恒居此土不生餘處，咸共悲愍未來世中一切有情，普欲等慈為作饒益，各共瞻仰金剛藏菩薩摩訶薩，一心同聲以偈問曰：「尊者具辯才，　　唯願見開示，　世間諸色像，　　其誰之所作？",
        "translation": "Furthermore, there are all the yoginis in the land of mysterious adornment and those countless corpuscles of buddhas who come to hear the teaching, hear about the profound merits of mysterious adornment, respect the teaching, attain certainty of conversion, remain in this land, aren't born elsewhere, pity all sentient beings in future lives together, and universally desire to work together for the benefit of all sentient beings, each venerating the Vajragarbha Bodhisattva Mahāsattva with one mind and one voice, they ask in verse, \"Venerable one with eloquence, may I only see it revealed, who are the creators of the world's various forms and images?",
        "source": "T16n0682_002:0755c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為如工造瓶，　　泥輪以埏埴？",
        "translation": "Why is it like a potter who makes a clay wheel of clay?",
        "source": "T16n0682_002:0756a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為如奏樂者，　　擊動所成音？",
        "translation": "Why is it like a musician who produces sounds from percussion?",
        "source": "T16n0682_002:0756a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為如一物體，　　有三種自性，　謂已成未成，　　咸在於一物？",
        "translation": "Why is it that the essence of a single thing has three kinds of self-nature, which are considered to be formed and unformed, but they all reside in a single thing?",
        "source": "T16n0682_002:0756a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何種種色，　　一物而建立？",
        "translation": "\"What kinds of form are created from a single thing?",
        "source": "T16n0682_002:0756a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為兜率所作？",
        "translation": "Was it created for Tuṣita?",
        "source": "T16n0682_002:0756a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　夜摩所作耶？",
        "translation": "Yama's work?",
        "source": "T16n0682_002:0756a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　他化自在作？",
        "translation": "unimpeded activity of transformation by others?",
        "source": "T16n0682_002:0756a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大樹緊那羅？",
        "translation": "Mahādruma Kiṃnara?",
        "source": "T16n0682_002:0756a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善見天所作？",
        "translation": "skillfully seeing the works of the gods?",
        "source": "T16n0682_002:0756a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　色究竟天耶？",
        "translation": "What is the ultimate heaven of form?",
        "source": "T16n0682_002:0756a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　螺髻梵王作？",
        "translation": "Is the conch-tufted Brahmā king doing it?",
        "source": "T16n0682_002:0756a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無色天作耶？",
        "translation": "Is it the work of a formless god?",
        "source": "T16n0682_002:0756a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切天主作？",
        "translation": "all the works of the lord of heaven?",
        "source": "T16n0682_002:0756a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　自然所作耶？",
        "translation": "What does it do naturally?",
        "source": "T16n0682_002:0756a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　變化之所作？",
        "translation": "the work of transformation?",
        "source": "T16n0682_002:0756a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸佛所作耶？",
        "translation": "What are the works of the buddhas?",
        "source": "T16n0682_002:0756a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為餘世界中，　　佛子之所作？",
        "translation": "Is it the work of the Buddha's disciples in other worlds?",
        "source": "T16n0682_002:0756a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是諸作眾色，　　惑亂而建立，　所起於惑亂，　　如鹿見陽焰。",
        "translation": "\"These are the numerous forms that are created, which are confused and established, and which arise from confusion, like a deer seeing the sun's flame.",
        "source": "T16n0682_002:0756a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如於瓶處，　　為德之所依，　一切諸世間，　　能住於處者，　非德者屬德，　　非德依德者，　展轉和合故，　　眾德所集成。",
        "translation": "It's like the place in a vase that's the basis of virtue, and all the world can abide in that place, where what's not virtuous belongs to virtue and what's not virtuous depends on virtue, which is the result of the merging of qualities.",
        "source": "T16n0682_002:0756a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸色唯惑亂，　　為亦有住耶？",
        "translation": "Are all forms merely confused, or are they also abiding?",
        "source": "T16n0682_002:0756a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為梵王所作？",
        "translation": "Is it the work of Brahmā?",
        "source": "T16n0682_002:0756a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　那羅延作耶？",
        "translation": "What does Nārāyaṇa do?",
        "source": "T16n0682_002:0756a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雄猛及勝論、　　數論自作耶？",
        "translation": "Are they self-made, or are they based on their own theories or commentaries?",
        "source": "T16n0682_002:0756a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勝性之所作？",
        "translation": "What is the work of a superior being?",
        "source": "T16n0682_002:0756a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　自在自然耶？",
        "translation": "Is it spontaneous?",
        "source": "T16n0682_002:0756a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時無明所生？",
        "translation": "whence nescience arises?",
        "source": "T16n0682_002:0756b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　愛業所作耶？",
        "translation": "Is it the result of karmic desire?",
        "source": "T16n0682_002:0756b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天仙及世定，　　皆悉懷疑惑。",
        "translation": "\"The gods and sages and the worldly meditation all harbor doubts.",
        "source": "T16n0682_002:0756b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為先無有體，　　猶如於幻夢，　亦如熱時焰，　　及乾闥婆城？",
        "translation": "Why is it that they lack substance in the first place, just like in an illusion or dream, or like a burning lamp or a city of gandharvas?",
        "source": "T16n0682_002:0756b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無始妄分別，　　隨彼彼相續，　起能耶所耶，　　如蛇有二頭，　亦如起屍行，　　木人機所轉，　空中見垂髮，　　及旋火輪耶？」",
        "translation": "beginningless false discrimination, following this and that continuum, gives rise to what is active and what is object, like a snake with two heads, or like a corpse that arises and travels, or a wooden man whose faculties turn, or a man with hanging hair in the air, or a fire-wheel that spins?\"",
        "source": "T16n0682_002:0756b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時金剛藏菩薩摩訶薩告普賢眾色大威德菩薩摩訶薩及餘大眾，而說偈言：「世間眾色像，　　不從作者生，　亦如劫比羅，　　因陀羅等作，　亦非祠祭果，　　亦非圍陀教，　彼有多因種，　　修行常不住；　亦復非無有，　　能持世間因，　謂第八丈夫，　　是名為藏識。",
        "translation": "It was then that the Vajragarbha Bodhisattva Mahāsattva addressed the Samantabhadra Bodhisattva of Form and the rest of the assembly and spoke in verse, \"The world's many images of form don't arise from their authors, nor are they like Kapila, Indra, and so forth, nor are they the result of a shrine offering, nor are they the teachings of Veda, which have many kinds of causes and whose cultivation is never stopped, nor are they nonexistent, which can sustain worldly causes, called the eighth male, which is called the store consciousness.",
        "source": "T16n0682_002:0756b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由此成眾色，　　如轉輪眾瓶，　如油遍在麻，　　鹽中有醎味，　如無常遍色，　　丈夫識亦然，　如香在沈麝，　　及光居日月，　遠離能所作，　　及以有無宗，　亦離於一異，　　一切外道過，　非智所尋求，　　不可得分別。",
        "translation": "As a result, it creates many forms, like the many vials of the turning wheel, like oil that pervades hemp, like salt that has a salty taste, like impermanence that pervades form, so does the husband consciousness, like fragrance in sunken musk, like light that resides in the sun and moon, that's free of what can be done, and because of the doctrine of existence and nonexistence, it's free of sameness and difference, and all the faults of non-Buddhists are not sought by cognition and cannot be discerned.",
        "source": "T16n0682_002:0756b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　定心解脫者，　　自覺之所證，　若離阿賴耶，　　即無有餘識。",
        "translation": "He who is liberated in a concentrated mind, which is realized by self-realization, would have no remainder in consciousness if he were free of the ālayas.",
        "source": "T16n0682_002:0756b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如海波浪，　　與海雖不異，　海靜波去來，　　亦不可言一。",
        "translation": "Like the waves of the ocean, even though they're not different from the ocean, the ocean's still waves coming and going can't be described as one.",
        "source": "T16n0682_002:0756b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如修定者，　　內定清淨心，　神通自在人，　　所有諸通慧，　觀行者能見，　　非餘之所了。",
        "translation": "Like a person who cultivates concentration, whose internal concentration purifies his mind and whose psychic abilities are unimpeded, he has penetrating insights that can be seen by those who observe and practice them and that can't be comprehended by others.",
        "source": "T16n0682_002:0756b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是流轉識，　　依彼藏識住，　佛及諸佛子，　　定者常觀見。",
        "translation": "Thus, the transmigration consciousness abides depending on that store consciousness, which is always observed by the concentrated ones, including the buddhas and the buddha-sons.",
        "source": "T16n0682_002:0756c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　藏識持於世，　　如以線貫珠，　如輪與車合，　　業風之所轉。",
        "translation": "The store consciousness is maintained in the world like a string running through a pearl, like a wheel and chariot coming together, and is turned by the wind of karma.",
        "source": "T16n0682_002:0756c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　陶師運輪杖，　　器成隨所用，　藏識與諸界，　　共力無不成，　內外識世間，　　彌給悉周遍。",
        "translation": "The potter carries the wheel and staff, forming the vessel as he uses it, and the store consciousness and the elements share a common strength that's unparalleled, and the internal and external consciousnesses of the world are all pervasive.",
        "source": "T16n0682_002:0756c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如眾星象，　　布列在虛空，　風力之所持，　　運行常不息。",
        "translation": "It's like the stars and elephants that line the sky and are sustained by the power of the wind, which never stops moving.",
        "source": "T16n0682_002:0756c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如空中鳥跡，　　求之莫能見，　若離於虛空，　　飛翔不可得，　藏識亦如是，　　不離自他身。",
        "translation": "Like the traces of a bird in the sky that can't be seen when sought, if it were free of space, its flight wouldn't be possible, and so would the store consciousness, which isn't separate from its own body or from others.",
        "source": "T16n0682_002:0756c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如海起波濤，　　如空含萬象，　丈夫識亦爾，　　蘊藏諸習氣。",
        "translation": "Like the ocean that gives rise to waves and the sky that contains myriad forms, so does the husband's consciousness, which harbors the karmic impressions.",
        "source": "T16n0682_002:0756c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如水中月，　　及以諸蓮華，　與水不相雜，　　不為水所著。",
        "translation": "It's like the moon in the water and the lotus flowers, which are not mixed with water and don't get caught up in water.",
        "source": "T16n0682_002:0756c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　藏識亦如是，　　習氣莫能染，　如目有童子，　　眼終不自見。",
        "translation": "So is the store consciousness, which can't be defiled by habituated tendencies, like a child with eyes, whose eyes never see for themselves.",
        "source": "T16n0682_002:0756c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　賴耶住於身，　　攝藏諸種子，　遍持壽煖識，　　如雲覆世間，　業用曾不停，　　有情莫能見。",
        "translation": "Laya abides in the body, harboring all seeds and pervading the consciousness of longevity and warmth like a cloud covering the world, whose activity never stops and which no sentient being can see.",
        "source": "T16n0682_002:0756c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身者眾色成，　　又能作諸色，　如陶師不依，　　以泥成眾器。",
        "translation": "That body is made of many forms, and it can create forms like a potter who doesn't rely on clay to make many vessels.",
        "source": "T16n0682_002:0756c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間妄分別，　　見牛等有角，　不了角非有，　　因言兔角無，　分析至極微，　　求角無所有。",
        "translation": "The world falsely discerns that cattle and so forth have horns, doesn't understand that horns don't exist, and therefore claims that rabbits' horns don't exist.",
        "source": "T16n0682_002:0756c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　要待於有法，　　而起於無見，　有法本自無，　　無見何所待？",
        "translation": "They want to look to existent things, but they give rise to views of nonexistence. Existing things are inherently nonexistent, so why should views be looked to?",
        "source": "T16n0682_002:0756c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有若無法，　　展轉互相因，　有無二法中，　　不應起分別，　若離於所覺，　　能覺即不生。",
        "translation": "\"Whether it's existent or nonexistent, they are mutual causes in their development, and in the two things that are existent and nonexistent, they shouldn't be discriminated; if they were free of the perception, the perception wouldn't arise.",
        "source": "T16n0682_002:0757a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如旋火輪，　　翳幻乾城等，　皆因少所見，　　而生是諸覺，　若離於所因，　　此覺即無有。",
        "translation": "Like the whirling wheel of fire or the illusory city of cataracts, these feelings arise from seeing a little, and if they were free of the cause, this feeling would be nonexistent.",
        "source": "T16n0682_002:0757a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　名相互相繫，　　習氣無有邊，　一切諸分別，　　與意而俱起，　有情流轉故，　　圓成則不證。",
        "translation": "Names are bound to each other, habituated tendencies have no limit, and all discriminations arise together with the mind, which is the result of the transmigration of sentient beings and is not realized when fully formed.",
        "source": "T16n0682_002:0757a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無始時積集，　　沈迷諸妄境，　戲論而熏習，　　生於種種心。",
        "translation": "It's accumulated since beginningless time, sunken in deluded objects, perfumed by conceptualization, and given rise to various minds.",
        "source": "T16n0682_002:0757a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能取及所取，　　有情心自性，　瓶衣等諸相，　　見實不可得。",
        "translation": "What's apprehended and what's apprehended is the own-nature of the minds of sentient beings, and views of such things as bottles and robes are really unobtainable.",
        "source": "T16n0682_002:0757a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切唯有覺，　　所覺義皆無，　能覺所覺性，　　自然如是轉，　愚夫不除斷，　　習氣心迷惑。",
        "translation": "Everything is merely perceived, but what's perceived has no meaning, and the nature of what's perceived naturally changes in this way. Foolish people don't remove these habituated tendencies and mental delusions.",
        "source": "T16n0682_002:0757a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　賴耶及七識，　　有時而頓生，　猶如海波浪，　　風緣之所動，　洄澓而騰轉，　　無有斷絕時。",
        "translation": "Laya and the seven consciousnesses suddenly arise at one time, just like the waves of the ocean, which are moved by wind and other conditions, swooshing and roiling, with no time to stop them.",
        "source": "T16n0682_002:0757a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　識浪亦如是，　　境界風所擊，　種種諸分別，　　自內而執取。",
        "translation": "Similarly, the waves of consciousness are buffeted by the winds of the objective realm, and various kinds of discrimination are grasped from within.",
        "source": "T16n0682_002:0757a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如地無分別，　　庶物依以生，　藏識亦復然，　　眾境之依處。",
        "translation": "Just as the earth has no discrimination, and everything that exists depends on it, so does the store consciousness, which is the basis of all objects.",
        "source": "T16n0682_002:0757a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人以己手，　　還自捫其身，　亦如象以鼻，　　取水自霑灑，　復似諸嬰孩，　　以口含其指，　是知識分別，　　現境還自緣。",
        "translation": "Like a person using their hand to examine their own body, or like an elephant using its trunk to gather water and sprinkle it, or like a baby using its mouth to hold its fingers, this is discrimination by knowledge, and the present object refers back to itself.",
        "source": "T16n0682_002:0757a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是心之境界，　　普遍於三有，　久修觀行者，　　而能善通達，　內外諸世間，　　一切唯心現。」",
        "translation": "This is the realm of the mind that pervades the three existences and can be well comprehended by someone who has long cultivated the practice of contemplation, for both internal and external worlds are nothing but the mind's manifestation.\"",
        "source": "T16n0682_002:0757a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時金剛藏，　　說是妙法已，　默然而止住，　　思惟於法界，　微妙普遍定，　　則入諸佛境，　見無量佛子，　　當修住密嚴。",
        "translation": "After speaking this wonderful teaching, the Vajraṭṭhaka then stood silently, contemplated the Dharma realm, and considered the subtle and universal concentration, then he entered the realm of the buddhas and saw measureless buddha children who would then cultivate their mysterious adornment.",
        "source": "T16n0682_002:0757b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即從禪定起，　　放光而普照，　欲色與無色，　　及無想天宮，　如是光明中，　　復現諸佛剎，　悉見無量佛，　　相好妙端嚴，　種種微妙色，　　皆從佛身出。",
        "translation": "Rising from meditative concentration, he radiates a light that universally illuminates desire form, formless form, and the palace of the nonconceptual gods, and in this light he also shows up buddha bases, where he sees measureless buddhas with marvelously beautiful features and a variety of subtle forms that all emerge from the buddha's body.",
        "source": "T16n0682_002:0757b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨其所愛樂，　　世間作利益，　皆使彼佛子，　　稱讚密嚴名，　欣然相顧視。",
        "translation": "According to their desires and worldly benefits, they cause their sons to praise their densely adorned names and look at them joyfully.",
        "source": "T16n0682_002:0757b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　復作如是說：「密嚴妙無垢，　　能除一切罪，　觀行者勝處，　　其土最殊妙。",
        "translation": "They also say, \"Densely adorned and marvelously unsullied, it removes all sins, and it's a place of excellence for those who contemplate its practice, making it the most marvelous land.",
        "source": "T16n0682_002:0757b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等聞名字，　　心生大喜悅，　各從其所住，　　俱來詣密嚴。」",
        "translation": "Hearing its name, we were so delighted that we each went from our abode and visited him at Mysterious Adornment.\"",
        "source": "T16n0682_002:0757b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　色盡螺髻梵，　　及與淨居天，　希慕此密嚴，　　佛子所生處，　同心而共聚，　　咸請梵王言：「我等今云何，　　得至密嚴土？",
        "translation": "The Brahmā Saṃkusumitarāja and the Pure Land gods admired this densely adorned land as a place where the Son of the Buddha was born, and they all came together with the same intention, inviting the Brahmin King to say, \"Now, how did we get to the land of densely adorned land?",
        "source": "T16n0682_002:0757b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天王若往彼，　　我等當營從。」",
        "translation": "If the king of the gods goes there, we'll camp out and follow him.\"",
        "source": "T16n0682_002:0757b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時螺髻梵，　　聞諸天眾言，　遽即與同行，　　中路迷所適。",
        "translation": "It was then that the conch-tufted Brahmā, hearing the words of the gods, rushed along with them, confused about where to go in the middle of the road.",
        "source": "T16n0682_002:0757b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵王先覺悟，　　以慧審觀察：「彼勝觀行境，　　何階而可至？",
        "translation": "The king of the Brahmas first awakened and examined the situation with wisdom, \"What are the steps to reach that superior contemplative state?",
        "source": "T16n0682_002:0757b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲色自在者，　　非彼所能詣，　非空處識處，　　及與非非想，　并餘外道宗，　　邪定者能往，　云何作善巧，　　得至於密嚴？",
        "translation": "\"Whoever is at ease with desire and form is not accessible to them, not to the abode of emptiness and consciousness and neither perception nor non-perception, and there are other non-Buddhist schools to which wrongly determined people can go, how can they skillfully attain mysterious adornment?",
        "source": "T16n0682_002:0757b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或以天中天，　　威神力加護，　能令至亟行，　　得會密嚴宮。」",
        "translation": "Perhaps it's the mighty power of a god among gods that protects him and enables him to practice resolutely and assemble at the palace of Mysterious Adornment.\"",
        "source": "T16n0682_002:0757c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　螺髻梵發聲，　　即時盡歸命，　見佛滿空界，　　威光而熾然，　告彼梵王言：　　「汝當還本殿；　如來密嚴剎，　　是觀行之境，　非想尚難階，　　色者何能往？」",
        "translation": "The conch-tufted Brahmā gave voice, immediately gave up his life, saw the Buddha filling the realm of space, his aura blazing, and told the Brahma king, \"Return to your home palace; the Tathāgata's densely adorned temple is a place of contemplation and practice that's difficult to reach without conception, so how can a form person go there?\"",
        "source": "T16n0682_002:0757c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵王從諸佛，　　聞如是告已，　退還於本處，　　尋至梵天宮。",
        "translation": "After hearing this advice from the buddhas, the king of Brahmā retired to his original place and searched for the palace of Brahmā.",
        "source": "T16n0682_002:0757c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時淨居諸天，　　各各相共議：「螺髻梵天主，　　威神不能往，　當知密嚴土，　　勝妙難思議，　自非如幻定，　　誰能詣斯剎？」",
        "translation": "The celestials of the Pure Land then said together, \"The conch-tufted Brahmakāyika gods, whose authority and spirit can't reach them, should know that the land of mysterious adornment is so marvelous and unfathomable that who could have reached this buddha unless it were a miraculous concentration?\"",
        "source": "T16n0682_002:0757c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此會聞天眾，　　稱讚功德聲，　生於奇特心，　　乃白金剛藏：「我等皆樂聞，　　唯垂演深法。」",
        "translation": "When the congregation heard the sound of the gods praising their virtue, they became so impressed that they asked Vajragarbha, \"We're all glad to hear it, but we'll only explain the profound teaching.\"",
        "source": "T16n0682_002:0757c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時金剛藏，　　即告大眾言：「如來所說法，　　誰能盡敷演？",
        "translation": "It was then that Vajragarbha addressed the crowd, saying, \"Who can explain in detail what the Tathāgata teaches?",
        "source": "T16n0682_002:0757c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自覺之聖智，　　境界不思議，　非深觀行人，　　云何可開示？」",
        "translation": "How can the noble wisdom of self-realization, whose objective realm is inconceivable, be revealed unless one is a profound meditator?\"",
        "source": "T16n0682_002:0757c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時持進夜摩，　　自在諸佛子，　異口同音言：　　「唯願速宣說。」",
        "translation": "\"Jñānacandra and the Śubha Buddha's disciples then spoke with one voice, saying, 'Please explain this quickly.'",
        "source": "T16n0682_002:0757c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　神通與曼殊、　　慈氏緊那王，　及餘修定者，　　咸皆作是請。",
        "translation": "The Shentong, Mañjuśrī, King Caitanya, and the others who cultivate meditation all made this request.",
        "source": "T16n0682_002:0757c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天持明仙，　　空中奏眾樂，　同心而勸請：　　「唯垂為宣說。」",
        "translation": "The gods, the luminous-holding sages, and the musicians in the sky all spoke with one voice and urged them, \"Please explain this.\"",
        "source": "T16n0682_002:0757c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是勸請已，　　各坐於勝座。",
        "translation": "After thus inviting them, they each sat down on a superior seat.",
        "source": "T16n0682_002:0757c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵王承佛力，　　還來此會中，　復白金剛藏，　　作於如是問：「今此諸大會，　　嚴飾未曾有，　悉是尊弟子，　　聰慧無等倫，　皆於尊者處，　　渴仰而求法。",
        "translation": "In response to the Buddha's power, the king of Brahmā returned to this assembly and again platinum adorned the Ganges store, asking, \"Now, this is a great assembly, ornamented like no other, full of venerable disciples, with unsurpassed intelligence, who long for the venerable and seek the Dharma with great reverence.",
        "source": "T16n0682_002:0757c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今猶未知，　　所問為何等？",
        "translation": "I still don't know, 'What was the question?'",
        "source": "T16n0682_002:0758a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憍臘與勝墮，　　及頂生輪王，　為是少年馬？",
        "translation": "\"Kauṇḍinya, Vikramāditya, and the wheel-turning king at the top of his head, why is this a young horse?",
        "source": "T16n0682_002:0758a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為是古仙傳？",
        "translation": "Why is this an ancient immortal biography?",
        "source": "T16n0682_002:0758a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　甘蔗種之子，　　千弓持國王，　欲色無色中，　　人天等之法，　為是菩薩行，　　獨覺及聲聞？",
        "translation": "\"Is this the practice of the bodhisattva, the prince of the sugarcane plant, the king of a thousand bow holders, in desire, form, and formlessness, men and gods, etc., a practice of the solitary realizers and direct disciples?",
        "source": "T16n0682_002:0758a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至修羅明，　　星象等眾論，　唯願如是事，　　次第而演說。",
        "translation": "Up to the point of the Shura teachings, the astrology, and other treatises, may these things be explained in order.",
        "source": "T16n0682_002:0758a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等及天人，　　一心咸聽受。」",
        "translation": "We and the gods will all listen and accept it with one mind.\"",
        "source": "T16n0682_002:0758a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時解脫月、　　持世虛空藏、　大勢觀自在、　　總持自在王、　寶髻與天冠、　　金剛手寂慧，　及寶手大士，　　并諸最勝子，　皆從俱胝剎，　　來坐蓮花宮，　咸請金剛藏：　　「唯願大慧說，　過去及未來，　　牟尼清淨智。",
        "translation": "It was then that the Moon of Liberation, the Ākāśagarbha of World Preservation, the Avalokitêśvara of Great Power, the Śubhavyuktâgama, the Jeweled Topknot, the Crown of Heaven, the Vajrapāṇiśekhara, the Jeweled Handed Bodhisattva, and the most excellent sons all came from Kucha and sat in the lotus-palace, and they all invited the Vajra-garbha: \"May Great Wisdom teach us the pure wisdom of the Muni, past and future.",
        "source": "T16n0682_002:0758a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仁於佛親受，　　明了心不疑，　此眾皆樂聞，　　願尊時演說。」",
        "translation": "You personally know the Buddha, understand him, and have no doubts, and this crowd is delighted to hear it; may the venerable explain it at the right time.\"",
        "source": "T16n0682_002:0758a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　定王金剛藏，　　普告大眾言：「如來所說法，　　非我具能演，　唯除佛菩薩，　　威神之所護。",
        "translation": "The adamantine store of the meditation king addressed the crowd, \"The Tathāgata's teaching is not something I can explain except to the Buddha and bodhisattvas, who are protected by their authority and spirits.",
        "source": "T16n0682_002:0758a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今至心禮，　　自在清淨宮，　摩尼寶藏殿，　　佛及諸佛子。",
        "translation": "Now, I wholeheartedly venerate the Buddha and his disciples in the Śubhavyūha Palace and the Mani-prabhāsa Hall.",
        "source": "T16n0682_002:0758a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我以敬心說，　　如來清淨智，　能令紹佛種，　　汝等應諦聽。",
        "translation": "I will speak with reverence, saying that the Tathāgata's pure wisdom can make known the Buddha's lineage, and you should listen closely.",
        "source": "T16n0682_002:0758a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此非諸王論，　　及輪王軌儀，　但示於密嚴，　　如來之種性，　正定者境界，　　諸佛之勝事。",
        "translation": "These are not the treatises of kings or the regulations of wheel-turning kings, but rather they show the mysterious adornment, the Tathāgata's seed nature, the realm of the correctly determined, and the surpassing qualities of the buddhas.",
        "source": "T16n0682_002:0758b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來微妙智，　　離於能所覺，　是故非我力，　　能演此甚深；　但以佛威神，　　從佛而聽受。",
        "translation": "The Tathāgata's subtle wisdom is free of perception of subject and object, so it's not my power to explain this profundity; rather, it's the Buddha's authoritative power that makes me listen and receive it from him.",
        "source": "T16n0682_002:0758b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此智甚微妙，　　是三摩地花，　佛在密嚴中，　　正受而開演；　遠離諸言說，　　及以一切見，　若有若無等，　　如是四種邊，　是名最清淨，　　中道之妙理。",
        "translation": "This very subtle wisdom, which is the flower of samādhi, is correctly experienced and explained by the Buddha in his mysterious adornment; free of language and all views, whether existent or nonexistent, and so forth, these four kinds of extremes are called the purest, most subtle principle of the middle way.",
        "source": "T16n0682_002:0758b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　密嚴諸定者，　　於此能觀察，　離著而轉依，　　速入如來地。」",
        "translation": "Those who are concentrated in the mysterious adornment can observe it here, free themselves from attachment and change their basis, and quickly enter the Tathāgata's stage.\"",
        "source": "T16n0682_002:0758b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時諸佛子眾，　　從尊聞是語，　頭面禮雙足，　　恭敬而白言：「我等受樂法，　　如渴人思飲，　如遊蜂念蜜。",
        "translation": "When the sons of the Buddha heard these words, they bowed their heads with both feet, paid respect, and said, \"We accept the pleasant teaching like thirsty people longing for a drink or like wandering bees longing for honey.",
        "source": "T16n0682_002:0758b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　瑜伽自在尊，　唯願正宣說，　　令諸菩薩眾，　於定得自在，　　智慧大威德；　及諸剎土王，　　深解觀行者，　咸欲聞如來，　　所說甚深法，　皆願聽尊者，　　微妙梵帝聲，　如來所悅可，　　深遠善巧聲，　演說殊勝義，　　悉令得明了。」",
        "translation": "Venerable Yoga Sovereign wishes to explain it correctly so that all the bodhisattvas may attain freedom of concentration and great authority of wisdom, and the kings of the bhadras and lands who deeply understand and contemplate practice all want to hear the Tathāgata explain the profound Dharma, and they all want to hear the Venerable's exquisite, Brahmadeva-like voice, which is pleasing to the Tathāgata, a profound, skillful voice that explains the excellent meaning and makes it completely clear.\"",
        "source": "T16n0682_002:0758b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金剛藏告言：　　「如來所說義，　真實甚希有，　　離相難可見；　如空中無物，　　見影為希有，　如來所說義，　　希有亦復然。",
        "translation": "The Vajraṭṭhaka told them, \"The Tathāgata's explanation of the meaning is so rare in truth that it's difficult to see apart from its characteristics; just as there's nothing in the sky, and it's rare to see a shadow, so too is the Tathāgata's explanation of the meaning that's rare.",
        "source": "T16n0682_002:0758b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　空中風鳥跡，　　其形不可見，　牟尼演妙理，　　難見亦復然。",
        "translation": "The traces of wind and birds in the sky are invisible, and the Muni teaches marvelous principles that are difficult to see and are likewise.",
        "source": "T16n0682_002:0758b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間之事喻，　　智者能明了，　諸佛所宣說，　　譬喻不能知，　令我之所見，　　如夢乾城等。",
        "translation": "Worldly phenomena and metaphors can be understood by wise people, but they're taught by the buddhas, not known by metaphors, and cause what I see to be like a dream about a dry city.",
        "source": "T16n0682_002:0758c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此會有觀行，　　具大智慧者，　通達真實義，　　無不皆明了，　云何為是人，　　說佛難思境？",
        "translation": "In this assembly, there are those who contemplate and practice, who possess great wisdom, who understand the true meaning, and who all understand it, so why do they explain the Buddha's inconceivable objects?",
        "source": "T16n0682_002:0758c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　然今所開演，　　憑佛威神力，　一切最勝子，　　至心應諦聽。",
        "translation": "Yet now, by virtue of the Buddha's authoritative power, all the most excellent sons should listen intently with their hearts.",
        "source": "T16n0682_002:0758c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來妙言說，　　句義皆相應，　超越心境界，　　遠離於譬喻。",
        "translation": "The Tathāgata's subtle words match every word, transcend the mind's realm, and stay far removed from metaphors.",
        "source": "T16n0682_002:0758c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如蜂採花，　　先者取精粹，　是諸後至者，　　皆悉味其餘。",
        "translation": "It's like a bee picking a flower, and the first one takes the essence, so those who come after will all taste the rest.",
        "source": "T16n0682_002:0758c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勝牟尼亦然，　　先得妙法味，　我則飲其餘，　　今為眾宣說。",
        "translation": "Victor Muni was likewise. Having first obtained the taste of the wonderful Dharma, I then drank the rest, and now I'll explain it for the crowd.",
        "source": "T16n0682_002:0758c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天中天境界，　　增悅諸明智，　實非意測量，　　言象可能表。",
        "translation": "The celestial realm in the heavens is a delightful blend of wisdom that's really not measured by intention and can be expressed in words and images.",
        "source": "T16n0682_002:0758c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　示同人形色，　　相好以嚴身，　現於勝妙宮，　　寶冠以為飾，　圓光及輪輻，　　種種皆成就，　照曜於宮殿，　　能除外道憍。",
        "translation": "He takes on the form of a human being, adorns his body with his appearance, appears in a marvelous palace, is adorned with a jeweled crown, has a perfect radiance and a spoke, and is accomplished in various ways, shines in the palace, and is capable of arousing the outer path.",
        "source": "T16n0682_002:0758c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛四時中，　　恒依密嚴住，　而於一切處，　　現生及涅槃。",
        "translation": "During the buddhas' four periods of existence, they're always abiding in dense adornment, and in all places, they manifest birth and nirvāṇa.",
        "source": "T16n0682_002:0758c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　純善少減時，　　惡生及濁亂，　隨彼之意樂，　　利益諸有情，　業用無暫停，　　常住密嚴剎，　此之清淨處，　　瑜祇安樂宮。",
        "translation": "When pure goodness is diminished, bad birth and turbidity follow their desires, benefit sentient beings, have no pause in karma, and always abide in a densely adorned blaze, which is a pure place, the palace of Yogin's paradise.",
        "source": "T16n0682_002:0758c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　濁亂少減時，　　顯示如來相，　譬如淨滿月，　　影遍於眾水。",
        "translation": "When the turbidity is lessened, the Tathāgata's features are revealed, like a pure full moon whose shadow pervades all the waters.",
        "source": "T16n0682_002:0758c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛以一切身，　　隨宜而應化，　如來淨智境，　　觀行者皆見。",
        "translation": "With all of his bodies, the Buddha responds to transformation as appropriate, and the Tathāgata's pure cognitive objects are seen by those who contemplate and practice them.",
        "source": "T16n0682_002:0759a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或現大自在，　　或現那羅延，　或現迦毘羅，　　住空而說法；　或現圍陀者，　　常行及妙喜，　童天及尸棄，　　羅護都牟盧；　或現緊那羅，　　甘蔗月種姓，　及諸國王等，　　一切所瞻奉；　或作大醫王，　　示現於眾人，　金剛等眾寶，　　銅鐵及諸礦，　明珠與鉛錫，　　紅碧二頗梨，　隨彼諸有情，　　愛樂而顯現，　由佛加持力，　　令彼悉安樂。",
        "translation": "Sometimes he appears as Mahêśvara, Nārāyaṇa, or Kapila, abiding in space and teaching; sometimes he appears as Veda, ever-practicing and exalted, a youthful god or goddess, or Rāhudu Mulu; sometimes he appears as Kunarā, a member of the sugarcane moon clan, and all the kings of countries who venerate him; sometimes he becomes a great king of doctors, manifesting himself to all people, including adamantine and other treasures, copper, iron, and ores, pearls and lead, and red and blue pearls, manifesting himself to the desires and pleasures of sentient beings, making them all comfortable because of the Buddha's empowering power.",
        "source": "T16n0682_002:0759a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天女及龍女，　　乾闥婆之女，　欲界自在者，　　不能動其心。",
        "translation": "Divine maidens and nāga maidens, the sisters of the gandharvas, and those who are at ease in the desire realm can't be moved by their minds.",
        "source": "T16n0682_002:0759a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　超勝欲境界，　　及勝色界色，　空處及識處，　　無所有之處，　非想非非想，　　於彼不迷惑，　無想諸定者，　　未離於惑纏，　非安非清淨，　　流轉於諸有，　有身者所生，　　非如密嚴國。",
        "translation": "They transcend the desire realm and form, surpass form in the form realm, abide in emptiness and consciousness, have no place, neither perception nor non-perception, are not deluded there, are concentrated without perception, are not free of the tethers of affliction, are neither stable nor pure, and are in the flux of existence, not like the Land of Mysterious Adornment, where those who have bodies are born.",
        "source": "T16n0682_002:0759a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　密嚴微妙土，　　清淨福為嚴，　解脫知見人，　　最勝之依處。",
        "translation": "It's a marvelous land of mysterious adornment, adorned with pure merit, and the most excellent base for those who know and see liberation.",
        "source": "T16n0682_002:0759a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具十種自在，　　六通三摩地，　皆以成意身，　　如佛於彼現。",
        "translation": "Equipped with ten kinds of mastery, the six supernormal powers of the samādhi are all manifested in the body of the accomplished mind, just like the Buddha.",
        "source": "T16n0682_002:0759a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修行於十地，　　檀等波羅蜜，　一切相好花，　　常以為嚴飾。",
        "translation": "They cultivate the ten stages, the perfection of giving, and all the flowers of beauty that always adorn them.",
        "source": "T16n0682_002:0759a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離於分別，　　亦非無覺了，　無有我意根，　　惠根常悅樂。",
        "translation": "Far removed from discrimination and not without perception, they lack the faculty of self-will and the faculty of wisdom that's always pleasant.",
        "source": "T16n0682_002:0759a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　施等諸功德，　　淨業悉圓滿，　得佛勝所依，　　密嚴之淨國。",
        "translation": "With all these attributes of generosity and so forth, his pure activities are all completed, and he attains the buddha's excellent support, the pure land of mysterious adornment.",
        "source": "T16n0682_002:0759b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此土最微妙，　　不假日月明，　佛及諸菩薩，　　清淨光恒照。",
        "translation": "This land is most subtle, not like the brightness of the holiday moon, where the pure light of the Buddha and the bodhisattvas always shines.",
        "source": "T16n0682_002:0759b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　密嚴中眾聖，　　其光逾聚日，　無有晝夜時，　　亦無老死患。",
        "translation": "Among the sages of Mysterious Adornment, their light exceeds that of a great sun, there's no day or night, and there's no danger of old age and death.",
        "source": "T16n0682_002:0759b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　殊勝密嚴宮，　　諸天所希慕，　最上瑜伽者，　　地地而進修，　了知一切法，　　皆以心為性。",
        "translation": "A special palace of mysterious adornment that gods admire, the supreme yogi trains from ground to ground, knowing all things to be the nature of mind.",
        "source": "T16n0682_002:0759b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善說阿賴耶，　　三性法無我，　其身轉清淨，　　而生密嚴國。」",
        "translation": "He well explains the store consciousness, the three natures of things as selfless, and his body becomes pure, and he's born in the land of mysterious adornment.\"",
        "source": "T16n0682_002:0759b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘密嚴經胎藏生品第三",
        "translation": "*Mahāyāna Sutra of Mysterious Adornment, Birth in the Womb, Chapter 3",
        "source": "T16n0682_002:0759b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時金剛藏，　　菩薩摩訶薩，　復告螺髻梵：　　「天主應當知，　一切有情身，　　九物以為性，　有為相遷動，　　能造所造俱，　精血共和合，　　增長於不淨，　為無量諸業，　　之所常覆纏，　如毒樹所生，　　扶踈而蓊欝，　貪瞋等煩惱，　　增長亦如是。",
        "translation": "It was then that the Vajraṭṭhaka, the Bodhisattva Mahāsattva, again addressed the conch-tufted Brahmā, \"Gods, you should know that the bodies of all sentient beings, which have nine things as their nature, are marked by the movement of things, are created and created together, are united by semen and blood, grow impure, and are constantly tethered by measureless actions, like poisonous trees that grow, are fragile and luxuriant, and are proliferated by such afflictions as craving and anger.",
        "source": "T16n0682_002:0759b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　九月或十月，　　生於滿足時，　既從胎藏出，　　顛危受諸苦。",
        "translation": "When he's born in the ninth or tenth month, at the time of fulfillment, he emerges from the womb, is in danger, and experiences suffering.",
        "source": "T16n0682_002:0759b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天主應當知，　　此諸有情類，　皆由業力故，　　驅馳運動生。",
        "translation": "You should know, Lord of the gods, that these kinds of sentient beings are all driven into motion and born because of the power of karma.",
        "source": "T16n0682_002:0759b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或自人中來，　　或以傍生趣，　非天與羅剎，　　龍及於諸鬼，　或以持明族，　　天趣之勝身，　或於瑜祇中，　　退失三摩地，　輪王之貴族，　　而來生此中。",
        "translation": "Some come from among humans, some go to other rebirths, not as gods or rājas, dragons or ghosts, some are a family of luminaries, a superior body in a heavenly destiny, or in Yuga, lose their samādhi, or become noble members of wheel-turning kings, and are born here.",
        "source": "T16n0682_002:0759b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是既生已，　　諸根遂增長，　隨親近宿習，　　復造于諸業，　由斯業大故，　　輪迴諸趣中。",
        "translation": "After being born here, their faculties then grow, and they create karma according to their proximity to past habits, and because of the magnitude of that karma, they are reborn in various destinies.",
        "source": "T16n0682_002:0759c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有諸智者，　　聞法得覺悟，　離文字分別，　　入三解脫門，　得證真實理，　　清淨之殊勝，　上上最清淨，　　即往於密嚴，　能遍俱胝剎，　　隨宜而應現。",
        "translation": "If there are wise people who hear the teaching and attain awakening, part with literal discrimination, enter the gate of the three liberations, realize the true and real principle, become superior in purity, and most pure of all, then they'll go to the mysterious adornment, which can pervade the corpuscles and manifest itself as appropriate.",
        "source": "T16n0682_002:0759c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天主如是生，　　永脫諸險趣，　是名為丈夫，　　亦名為智者，　亦名天中天，　　佛子眾圍繞。",
        "translation": "Thus born, the lord of gods is permanently liberated from all perilous destinies, and he's called a man, also known as a wise one, also called a god of gods, and surrounded by sons of the Buddha.",
        "source": "T16n0682_002:0759c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天主應當知，　　胎藏身虛偽，　非從自性生，　　非從癡愛業；　以皆因相有，　　了達滅無餘，　亦離於分別，　　及以於文字，　能如斯觀者，　　即往密嚴場。",
        "translation": "The lord of gods should know that the body of the womb is false, not produced from its own nature or from the karma of delusion and craving; because they all have causes and characteristics, they comprehend cessation without remainder, are free of discrimination, and are based on words, and those who can thus observe them will go to the site of mysterious adornment.",
        "source": "T16n0682_002:0759c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若諸修定人，　　住定攀緣境，　即便為聲色，　　誑惑生取著，　不能得堅固，　　亦名散動心，　以斯邪定縛，　　流轉生三界。",
        "translation": "If someone who cultivates concentration abides in concentration and attaches to objects, even though they're sound and form, and deludedly becomes attached, they can't become resolute, which is also called a distracted mind, and because they're bound by this wrong concentration, they're re reborn in the three realms.",
        "source": "T16n0682_002:0759c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有勝瑜祇，　　善住三摩地，　遠離能所取，　　寂然心不生，　是名真實修，　　無相觀行者，　欲生密嚴土，　　常應如是觀。」",
        "translation": "If there's a victorious yogin who well abides in samādhi, is free of attachment to what's possible and what's acquired, and whose mind is still and unarisen, this is called a truly genuine cultivation, a practice of markless contemplation, and one who wants to be born in the land of mysterious adornment should always observe it in this way.\"",
        "source": "T16n0682_002:0759c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘密嚴經自作境界品第四",
        "translation": "*Mahāyāna Sutra of Mysterious Adornment, Chapter 4: The Realm of Self-Made",
        "source": "T16n0682_002:0759c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時金剛藏，　　菩薩摩訶薩，　復告螺髻梵：　　「天主應當知，　八種九種心，　　常與無明轉，　能生諸世間，　　皆心心法現。",
        "translation": "It was then that the Vajrajogarbha, the bodhisattva Mahāsattva, again addressed the conch-tufted Brahmā, \"You should know, gods, that the eight and nine kinds of mind, which are constantly in flux with nescience, give rise to the world, and are all manifestations of mind and mental factors.",
        "source": "T16n0682_002:0759c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由彼流轉故，　　諸識與諸根，　無明所變異，　　本心堅不動。",
        "translation": "Because of their transmigration, the consciousnesses and faculties are altered by nescience, but the original mind is resolute and unmoving.",
        "source": "T16n0682_002:0760a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間及根境，　　皆從十二支，　能生及所生，　　剎那而滅壞。",
        "translation": "The world and its faculties and objects all come from the twelve branches, which produce and are produced, and momentarily cease and decay.",
        "source": "T16n0682_002:0760a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵世至非想，　　亦從於因緣，　唯有天中天，　　能離作所作。",
        "translation": "From the Brahma world to non-conceptions, they also come from causes and conditions, and only the gods of gods can be free of actions.",
        "source": "T16n0682_002:0760a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有情及無情，　　動與不動法，　皆如於瓶等，　　滅壞以為性。",
        "translation": "Both sentient and insentient beings, moving and immovable things, are like vases and so forth, which perish and decay as their nature.",
        "source": "T16n0682_002:0760a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天主應當知，　　諸識甚微細，　遷流而速疾，　　是佛之境界。",
        "translation": "You should know, lord of gods, that consciousnesses are very subtle, mobile, and rapid, which is the realm of the buddhas.",
        "source": "T16n0682_002:0760a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸仙及外道，　　假稱是牟尼，　以言互相縛，　　而貪種種色，　於此生滅識，　　悉皆不能知。",
        "translation": "Sages and non-Buddhists who falsely claim that they're Muni and who are bound by words to each other and crave various forms cannot know anything about this consciousness of arising and ceasing.",
        "source": "T16n0682_002:0760a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使一千歲，　　思惟四吠陀，　行施得梵天，　　還當有退落。",
        "translation": "Suppose he were 1,000 years old, contemplates the four Vedas, and practices generosity to attain Brahmā, yet he would surely retrogress.",
        "source": "T16n0682_002:0760a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或四月苦行，　　祠祭所獲果，　或修異類壇，　　事火所求福，　或修三趣法，　　宰羊以祈禱，　得果還有退，　　梵王何不悟？",
        "translation": "Perhaps he practices austerities for four months, rewards the sacrifices he makes, cultivates altars for different types of beings, seeks merit by fire, cultivates the teachings of the three destinies, slaughters sheep to pray, and then attains fruition but still falls back, why doesn't the king of Brahmā realize that?",
        "source": "T16n0682_002:0760a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三德果繫屬，　　不堅如芭蕉，　唯以智解脫，　　得生密嚴土。",
        "translation": "Their bonds to the three virtues are not hard like plantains, but only through intellectual liberation can they be born in the land of mysterious adornment.",
        "source": "T16n0682_002:0760a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　定者證斯境，　　方能往彼宮，　是故大梵天，　　應當善修習。",
        "translation": "Only when someone who's concentrated realizes this state can they go to that palace, so the great brahma gods should cultivate it well.",
        "source": "T16n0682_002:0760a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　密嚴中之人，　　無生死眷屬，　一切有情識，　　不斷亦不壞，　諸業無染著，　　亦無染熏習，　如蓮不著水，　　猶空不染塵，　日月無雲翳，　　瑜伽者亦爾。",
        "translation": "Those in the densely adorned realm have no followers in birth-and-death, the consciousnesses of all sentient beings are neither cut off nor destroyed, karma is not tainted, and there's no defiled permeation, like a lotus that doesn't cling to water, like space that's not tainted with dust, and the sun and moon are not clouded or obscured, so is the yoginis.",
        "source": "T16n0682_002:0760a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　速修是觀行，　　如來所攝持，　沐之淨戒流，　　飲以智慧液，　由修勝戒智，　　生死得解脫。",
        "translation": "He quickly cultivates this practice of contemplation, which is maintained by the Tathāgata, washes it in the pure stream of precepts, drinks the liquid of wisdom, and attains liberation from birth-and-death because he cultivates the knowledge of superior precepts.",
        "source": "T16n0682_002:0760b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天主應當知，　　有情蘊處界，　眾法所合成，　　悉皆無所有。",
        "translation": "You should know, lord of the gods, that the aggregates and fields of sentient beings and the compositions of all dharmas are all nonexistent.",
        "source": "T16n0682_002:0760b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眼色等因緣，　　而得生於識，　猶火因薪熾，　　識起亦復然。",
        "translation": "The causes and conditions such as vision and form that give rise to consciousness are like fire caused by blazing fuel, so too is consciousness produced.",
        "source": "T16n0682_002:0760b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　境轉隨妄心，　　猶鐵逐磁石，　如乾城陽焰，　　愚渴之所取，　中無能造物，　　但隨心變異，　復如乾城人，　　往來皆不實。",
        "translation": "As objects change and follow the deluded mind, they're like iron chasing a magnet, like the sun and flame of a dry city, which foolish people grasp as thirst, in which there's nothing that can be made but changes according to the mind, like the man in the dry city whose past and future are all unreal.",
        "source": "T16n0682_002:0760b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生身亦爾，　　進止悉非真，　亦如夢中見，　　寤後即非有，　妄見蘊等法，　　覺已本寂然。",
        "translation": "So it is with the bodies of sentient beings, which are all unreal when they advance and stop, just as they're seen in a dream and don't exist when they awaken, deludedly viewing the aggregates and other things, but originally quiescent after awakening.",
        "source": "T16n0682_002:0760b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　四大微塵眾，　　離心無所得，　世間可持物，　　孰非四大成。",
        "translation": "The four elements are so numerous and minute that they are unobtainable apart from mind, and none of the world's supportable things are not formed by the four elements.",
        "source": "T16n0682_002:0760b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如風疾緣，　　或現見諸境，　起屍無作者，　　世間法亦然。",
        "translation": "Like the cause of a swift breeze or the manifestation of objects, a corpse arises without an author, and so do the world's dharmas.",
        "source": "T16n0682_002:0760b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等諸佛子，　　應當善觀察，　世間諸動植，　　猶如水聚沫，　瓶衣等妄想，　　不實如陽焰，　苦樂等諸受，　　方之水上泡，　眾行如芭蕉，　　中無有堅實，　是識如幻事，　　虛偽悉非真。",
        "translation": "You Buddhist disciples should well observe that the world's movers and shakers are like foam in water, delusive ideas like bottles and robes, insubstantial like mirage flames, sensations like pain and pleasure that are bubbles on water, and the multitude of actions like plantains, in which there's nothing real, which are consciousnesses like illusory things that are false and not real at all.",
        "source": "T16n0682_002:0760b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼三界中，　　動與不動法，　皆同於夢境，　　迷心之所現，　亦如幻化事，　　及乾闥婆城，　但誑於愚夫，　　初無有真實。",
        "translation": "In those three realms, what moves and what doesn't move are all the same as a dream, and what appears in a deluded mind is like an illusion or a city of gandharvas that's only for fools and has no reality in the beginning.",
        "source": "T16n0682_002:0760b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛子覺此法，　　其心無所畏，　慧火焚諸患，　　即生密嚴國。",
        "translation": "When the Buddha-child realizes this teaching, his mind has no fear, and the fires of wisdom burn the afflictions, and he's born in the Land of Mysterious Adornment.",
        "source": "T16n0682_002:0760b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間皆無相，　　相為所繫縛，　無相為吉祥，　　相及心境界，　心境界非真，　　真為慧境界，　遠離於眾相，　　慈悲之所行，　無相遍一切，　　三界皆清淨。",
        "translation": "The world is without marks, marks are fetters, marklessness is auspicious, marks and the mental realm are not real, and true is the realm of wisdom, free from marks, the practice of compassion, marklessness pervades them all, and the three realms are all purified.",
        "source": "T16n0682_002:0760c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　色聲等眾相，　　名為三界法，　一切諸根境，　　有情之縛因，　由慧得解脫，　　安樂而自在。」",
        "translation": "Form and sound and other characteristics are called the dharmas of the three realms, and all faculties and objects are the cause of the bonds of sentient beings.",
        "source": "T16n0682_002:0760c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時寶髻菩薩，　　坐殊妙之座，　向於金剛藏，　　而作如是言：「遍諸俱胝剎，　　尊者為上首，　成就最妙智，　　了達所知法，　於無量悉檀，　　皆已得明見。",
        "translation": "The Jewel-topknot Bodhisattva then sat on a marvelous seat and addressed the Vajraśekhara, saying, \"Among the many kalpas, the venerable is the head, has accomplished the most sublime knowledge, has comprehended the knowables, and has clearly seen measureless siddhântas.",
        "source": "T16n0682_002:0760c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今在修行眾，　　能淨於彼疑，　覺察有情身，　　一切之本起，　以妙音演暢，　　窮劫不能盡。",
        "translation": "Now, he's among those who practice, purifies their doubts, discerns the bodies of sentient beings and the origins of all things, and speaks smoothly with a marvelous voice that can't be exhausted in an entire eon.",
        "source": "T16n0682_002:0760c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應當為眾會，　　說離諸逆順，　似非似等因，　　及以真實法，　令此諸智者，　　心淨無有疑，　捨於諸蘊因，　　不久得解脫。",
        "translation": "They should explain for this congregation the causes that are free of adversity, seeming and unlikely, and the true teaching, so that those who know them will be purified of mind and have no doubt, abandon the causes of the aggregates, and soon attain liberation.",
        "source": "T16n0682_002:0760c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　蘊因法非法，　　生此身後身，　智則能脫苦，　　受則為堅縛。",
        "translation": "The causes of the aggregates and dharmas are not lawful, giving rise to this body and the body afterward, which are capable of escaping suffering with knowledge and are firmly bound with feelings.",
        "source": "T16n0682_002:0760c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有情心所起，　　由色及以明，　作意等眾緣，　　馳散於諸境，　迅疾其奔電，　　難可得覺知，　無明及愛業，　　以之而濁亂。",
        "translation": "The minds of sentient beings are produced by form and by cognition, by attention and by a multitude of other causes, by rushing about objects so rapidly and rapidly that it's difficult to perceive them, and by nescience and the karma of craving they become turbid.",
        "source": "T16n0682_002:0760c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法意先導，　　意速意殊勝，　法與意相應，　　皆以意為性，　譬如摩尼寶，　　顯現於眾彩。",
        "translation": "The mind of all dharmas leads, the mind is quick, the mind is superior, dharmas are associated with the mind, and all are based on the mind as their nature, like a maṇi jewel that shows up in many colors.",
        "source": "T16n0682_002:0760c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是之妙義，　　佛子何不說？",
        "translation": "Why doesn't the Son of the Buddha explain the subtle meaning of this?",
        "source": "T16n0682_002:0761a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如眾色摩尼，　　隨色而顯現。",
        "translation": "It's like a maṇi of many forms that appears according to form.",
        "source": "T16n0682_002:0761a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仁者瑜祇中，　　照耀亦如是，　具足如來像，　　恒住自在宮，　佛子眾圍繞，　　隨宜應為說。」",
        "translation": "You, Ugra, also shine like this, fully possessing the Tathāgata's image, constantly abiding in the palace of Avalokitêśvara, surrounded by sons of the Buddha, and teaching it as appropriate.\"",
        "source": "T16n0682_002:0761a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時金剛藏，　　菩薩摩訶薩，　於法自在者，　　復告大眾言：「密嚴微妙土，　　是最勝寂靜，　亦是大涅槃，　　解脫淨法界，　亦是妙智境，　　及以大神通，　修諸觀行者，　　所依之妙剎。",
        "translation": "It was then that the Vajrajogarbha, the bodhisattva Mahāsattva who has mastery over the Dharma, again addressed the crowd, saying, \"The subtle land of mysterious adornment is the most excellent quiescence, the great nirvāṇa, the pure Dharma realm of liberation, the realm of marvelous wisdom, and the marvelous bases of those who cultivate contemplation and practice with great supernormal powers.",
        "source": "T16n0682_002:0761a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不斷亦不境，　　常住無變易，　水亦不能濡，　　風亦不能燥，　非如瓶等體，　　勤勇成而壞，　非似不似因，　　二種所成立。",
        "translation": "It's neither cut off nor conditioned, always abiding without change, not wet by water nor dried by wind, not like a clay pot or other body that's diligently formed and then destroyed, not resembling or unlike a cause, but both established.",
        "source": "T16n0682_002:0761a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　立宗及諸分，　　皆是不定法，　以宗及以因，　　各執差別故。",
        "translation": "The proposition and its parts are all indeterminate dharmas, because each holds to a distinction between a proposition and a cause.",
        "source": "T16n0682_002:0761a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　密嚴微妙剎，　　體是轉依識，　超於分別心，　　非妄情境界。",
        "translation": "The subtle blaze of mysterious adornment, whose essence is the transforming consciousness, is beyond the discriminating mind and not the realm of deluded emotions.",
        "source": "T16n0682_002:0761a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來密嚴剎，　　無終亦無始，　非微塵自性，　　非由於樂欲，　非大自在作，　　非無明愛業，　但由無功用，　　妙智之所生，　出欲色無色，　　超無想暗網。",
        "translation": "The Tathāgata's subtle blaze has neither beginning nor end, is not the own-nature of particles, doesn't arise from pleasures and desires, isn't created with great freedom, isn't the result of nescience and craving, but is produced by effortless, marvelous knowledge, transcends desire, form, and formlessness, and transcends the dark web of nonconception.",
        "source": "T16n0682_002:0761a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　密嚴微妙土，　　是阿若悉檀，　非諸因明者，　　所量之境界，　非由於勝性，　　自在與聲論，　及吠陀等宗，　　之所能開顯，　乃至資糧位，　　智慧不能了，　唯是於如來，　　及十地智境。",
        "translation": "The subtle land of mysterious adornment is an arjñāta-siddha, not a sphere measured by those who understand causation, not revealed by a superior nature, nor by the teachings of śrāvaka, śāstra, or the Vedas, nor can wisdom comprehend it up to the level of accumulation, but only by the Tathāgata and the sphere of wisdom of the tenth ground.",
        "source": "T16n0682_002:0761a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仁者今諦聽，　　愚夫迷世間，　為業及非業，　　我今演此義，　令修勝定者，　　獲得於安樂。",
        "translation": "Now, listen closely, foolish people who are deluded in the world and who create actions and non-actions, I will explain this meaning so that those who cultivate superior concentration will attain well-being.",
        "source": "T16n0682_002:0761b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　內外一切物，　　所見唯自心，　有情心二性，　　能取及所取。",
        "translation": "Of all the things internal and external, what's seen is only one's own mind, and there are two natures of the mind of sentient beings, that which is apprehended and that which is apprehended.",
        "source": "T16n0682_002:0761b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心體有二門，　　即心見眾物，　凡夫性迷惑，　　於自不能了。",
        "translation": "There are two aspects of the mind's essence, namely, the mind's view of all things, and the nature of ordinary people is so deluded that they can't understand it for themselves.",
        "source": "T16n0682_002:0761b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如瓶現色相，　　無體唯自心，　羸定及諸仙，　　於此義惑亂，　捨於真實理，　　而行分別路。",
        "translation": "Like a vase that shows its form, it has no body but its own mind, and weak meditation and sages are confused by its meaning, abandoning the true principle and following the path of discrimination.",
        "source": "T16n0682_002:0761b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是心有二性，　　如鏡像月影，　如目而有翳，　　妄見於毛輪。",
        "translation": "This mind has two natures, like a mirror that's like the shadow of the moon, and like eyes that are clouded, which falsely see a hairline wheel.",
        "source": "T16n0682_002:0761b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　空中無毛輪，　　應無珠瓔珞，　但從病翳眼，　　若斯而顯現，　虛妄計著者，　　不覺恒執取，　廣現諸嚴飾，　　種種梵等相。",
        "translation": "If there's no hair wheel in space, there should be no pearl or bejewel, but from a sick, blind eye, if this were to appear, a person who falsely discriminates, doesn't perceive and constantly grasps, and extensively presents ornaments, such as the various Brahmā characteristics.",
        "source": "T16n0682_002:0761b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸有情，　　及與瓶衣等，　內外種種事，　　皆悉從心起。",
        "translation": "All sentient beings, their vases and garments, and various internal and external things all arise from the mind.",
        "source": "T16n0682_002:0761b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此密嚴妙定，　　非餘之所有，　若有修行者，　　生於眾福地，　或生欲自在，　　或於色界天，　乃至無相宮，　　色究竟天處，　空識無所有，　　非想非非想，　種種諸宮殿，　　漸次除貪欲，　不久得生彼，　　密嚴觀行宮，　眾佛子圍繞，　　自在而遊戲。",
        "translation": "This marvelous concentration of mysterious adornment belongs to no one else, and if someone cultivates it, they'll be born in one of many blessed places, or in the gods of the desire realm or the form realm, or up to the palace of signlessness, the place in the gods of the form realm where emptiness and consciousness are nonexistent, neither perceived nor unperceived, various kinds of palaces and halls, gradually ridding themselves of desire, and soon they'll be born there, surrounded by the sons of the Buddha who play freely in the palace of mysterious adornment and contemplation.",
        "source": "T16n0682_002:0761b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝應修此定，　　如何著親屬，　親屬常繫縛，　　輪迴生死因。",
        "translation": "You should cultivate this concentration, for how would you attach yourself to your relatives, who are always bound, and who are the cause of transmigration through birth and death?",
        "source": "T16n0682_002:0761b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　男女意惑亂，　　精血共和合，　如蟲生自泥，　　此中生亦爾，　九月或十月，　　彼體漸增長。",
        "translation": "A man and a woman's minds are distracted, and their semen and blood are united like a worm born from its own mud, so is it born here.",
        "source": "T16n0682_002:0761c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時至出胎已，　　譬如蟲蠕動，　從此而長大，　　乃至心了知。",
        "translation": "When it emerges from the womb, it's like a worm wriggling, and from there it grows up until it's mentally known.",
        "source": "T16n0682_002:0761c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我觀諸有情，　　生生悉如此，　父母無有數，　　妻子亦復然，　於諸世間中，　　無處不周遍。",
        "translation": "I've observed that all sentient beings are born like this, with parents numberless and wives likewise, and there's nowhere in the world that they don't reach.",
        "source": "T16n0682_002:0761c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如彼石女，　　夢己忽生子，　生已方歡樂，　　尋又見其亡，　悲哀不自勝；　　忽然從睡覺，　不見有其子，　　初生及後終。",
        "translation": "It's like that woman of stone who suddenly gives birth to a child in a dream, is happy after birth, then sees him die again, and is overcome with sorrow; suddenly she falls asleep and doesn't see her child, first born and then at death.",
        "source": "T16n0682_002:0761c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又夢遊山川，　　城邑與園苑，　一切諸境界，　　世間共受用，　彼此互相見，　　馳鶩而往來，　運轉與屈伸，　　無量之境界；　及從於睡覺，　　一切皆非有。",
        "translation": "In another dream, he traveled to a mountain or river, a city or garden, all the realms that are shared by the world, saw each other, swept back and forth, moved about and stretched, and had measureless realms; and then, after falling asleep, he realized that none of them existed.",
        "source": "T16n0682_002:0761c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦如多欲者，　　夢見於女人，　顏貌甚端嚴，　　服玩皆珍綺，　種種恣歡樂，　　覺已悉皆無。",
        "translation": "Also like a person with many desires who sees a woman in a dream, whose features are exquisite, whose clothing and playthings are elaborate, and whose various kinds of pleasure are indulged in, they all disappear after awakening.",
        "source": "T16n0682_002:0761c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸世間，　　當知亦如是，　王位及營從，　　父母等宗姻，　但誑於愚夫，　　體性皆非實。",
        "translation": "You should know that all the worlds are likewise, and that royal positions, subordinations, and the marriages of parents and others are only for fools, whose essence is not real.",
        "source": "T16n0682_002:0761c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝於三摩地，　　何故不勤修？",
        "translation": "Why don't you diligently cultivate samādhi?",
        "source": "T16n0682_002:0761c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量諸聲聞，　　獨覺及菩薩，　住山間樹下，　　寂靜修禪處，　摩羅耶乳海，　　頻陀婆利師，　摩醯因陀羅，　　雞羅雪山等，　或止圓生樹，　　或住嬌微那，　處須彌半腹，　　或憩如意樹，　絆住劍摩羅，　　於中而宴默，　或食贍部果，　　及飲甘露味，　具足諸神通，　　而常修此觀。",
        "translation": "Measureless śrāvakas, pratyekbuddhas, and bodhisattvas live among the mountains and under the trees, in tranquil meditation places, such as the Mālayavijñāna ocean, the Vetapālī masters, the Mahêndra, and the Kislôśa mountains, or they stop at the Pārijāta tree, or they stay at Kuvera, or they sit halfway up Sumeru, or they rest at the Ruyi tree, or they trip over the Kalmāra, and they feast in silence, or they eat the fruit of the almsbowl and drink the taste of ambrosia, fully possessing the supernormal powers, and they always cultivate this contemplation.",
        "source": "T16n0682_002:0761c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去未來世，　　坐於蓮華臺，　結加住等引，　　如是常觀察。",
        "translation": "In a past life or future life, he sat on a lotus pedestal, took refuge in the restraints of conditioning, and always observed it this way.",
        "source": "T16n0682_002:0762a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善攝諸根故，　　不散一切境，　如以鉤制象，　　住定亦復然。",
        "translation": "Because he well gathers his faculties, he doesn't disperse from any object like an elephant restrained by a hook, and so does he abide in meditative concentration.",
        "source": "T16n0682_002:0762a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間若出世，　　一切諸餘定，　佛定淨無垢，　　貪愛皆遣除。",
        "translation": "Whether mundane or transmundane, all the other concentrations of the Buddha's concentration are pure and undefiled, and craving for them is all removed.",
        "source": "T16n0682_002:0762a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遍愛無色定，　　無想等禪中，　見彼日月形，　　蓮花與深險，　如空火眾色，　　邪定非究竟。",
        "translation": "Pervasively craving the concentrations of the formless realm, the meditation of no ideation, seeing the shape of the sun and moon, the lotus flower and the deepest dangers, and the many forms of an empty fire, wrong concentrations aren't perfect.",
        "source": "T16n0682_002:0762a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　拂除如是相，　　得淨無分別，　則見俱胝剎，　　諸佛住等引，　同時共舒手，　　以水灌其頂，　即入於佛地，　　示現眾色形。",
        "translation": "After ridding themselves of such marks and attaining purity and nondiscrimination, they see the corpus buddha, the buddhas standing together in equal measure, extend their hands together, pour water over their heads, and enter the buddha-stage, where they display a multitude of forms.",
        "source": "T16n0682_002:0762a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既得種種身，　　則具薩婆若，　力通及自在，　　正定陀羅尼，　如是等功德，　　莫不皆成就。",
        "translation": "Once they've attained a variety of bodies, they then possess the sarvajña, the powers and abilities, and the dhāraṇī of right concentration, and none of these attributes have been completely achieved.",
        "source": "T16n0682_002:0762a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　分析於諸色，　　乃至觀極微，　自性無所有，　　譬如於兔角，　無分無分別，　　蘊有蘊亦然，　同於幻所作，　　一切皆如是。",
        "translation": "An analysis of form, even to the point of observing the minutest detail, reveals its own nature to be nonexistent, like the horns of a rabbit, without discrimination or parts, and so are the aggregates and existent aggregates, which are the same as illusory creations; they are all thus.",
        "source": "T16n0682_002:0762a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此中無業果，　　亦無作業人，　無能作世間。",
        "translation": "There's no result of karma, no operator, and nothing that can create the world.",
        "source": "T16n0682_002:0762a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　設有作能作，　能作待於作，　　何名能作人？",
        "translation": "If there were an agent who does, and an agent who waits to do, what would be called an agent who does?",
        "source": "T16n0682_002:0762a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此言成過患。",
        "translation": "This statement creates a fallacy.",
        "source": "T16n0682_002:0762a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　說作者清淨，　我者成諸境，　　地輪依水輪，　及有情世間，　　次第而安布。",
        "translation": "It's said to be the author's purification, that I create objects, that the earth wheel depends on the water wheel, and that the world of sentient beings is sequentially distributed.",
        "source": "T16n0682_002:0762a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸趣各差別，　　彼此互往來，　於事起諸根，　　而能取於境，　此等非由我，　　皆是於分別，　展轉而變異，　　同於乳酪酥，　如是生住滅，　　計業與非業。",
        "translation": "The various destinies are distinct, they go back and forth with each other, and they give rise to the faculties that are able to grasp objects, which are not based on self, but are all discriminated, change, and alter, just like butter and cheese, such are birth, abiding, and cessation, which are imagined as actions and non-actions.",
        "source": "T16n0682_002:0762b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　定者常觀此，　　如乾城與夢，　無始來戲論，　　熏習於有情，　種種之過咎，　　而生分別業。",
        "translation": "Those who are concentrated always observe this, like a dry city or a dream, beginningless conceptualization, which is perfumed in sentient beings, and various faults and errors give rise to discriminated karma.",
        "source": "T16n0682_002:0762b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸根猶如幻，　　境界同於夢，　能作所作業，　　定者能遠離。",
        "translation": "The faculties are like illusions, the objective realm is like a dream, and the karma that's created can be avoided by those who are concentrated.",
        "source": "T16n0682_002:0762b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惡覺微劣者，　　迷惑生妄計，　分別於能作，　　一切諸世間。",
        "translation": "The weak in negative perception, delusion, and false imagination discriminate between what can be done and all the world.",
        "source": "T16n0682_002:0762b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或謂摩尼珠，　　金銀等眾礦，　鳥獸色差別，　　刺端銛以利，　此等皆不同，　　應知無作者。",
        "translation": "It might be called a maṇi-pearl, a variety of minerals like gold and silver, a difference in the color of birds and animals, or a sharp thorn at the tip of a blade, all of which are different and should be known as having no author.",
        "source": "T16n0682_002:0762b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間相差別，　　皆從分別生，　非勝性微塵，　　無因自然等，　惡覺者妄計，　　不知其體性。",
        "translation": "All worldly distinctions arise from discrimination, aren't superior to innumerable particles, have no cause to be natural, and so forth, and are falsely imputed by those with bad awakening who don't know their true nature.",
        "source": "T16n0682_002:0762b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為業為非業，　　如是起分別，　如毒在於乳，　　隨變與相應，　一切處分別，　　諸法亦如是。",
        "translation": "Whether it's action or non-action, discrimination arises like this, like poison in milk, which changes and corresponds, discriminating all places, and so do all dharmas.",
        "source": "T16n0682_002:0762b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是性亦不生，　　是性亦不滅，　惑者不能了，　　種種異分別。",
        "translation": "'This nature also doesn't arise, and this nature also doesn't cease, so deluded people can't understand and discriminate variously.'",
        "source": "T16n0682_002:0762b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間唯積集，　　定者乃能觀，　汝等應勤修，　　無思業非業。",
        "translation": "The world only accumulates, but those who are concentrated can observe it, so you should diligently cultivate it, thinking nothing of actions and non-actions.",
        "source": "T16n0682_002:0762b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有情互來往，　　如日月超迴，　在空無所依，　　隨風而運轉。",
        "translation": "Sentient beings come and go together like the sun and moon transcend, have no support in space, and carry on according to the wind.",
        "source": "T16n0682_002:0762b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　業性甚微隱，　　密嚴者能見，　修諸勝觀行，　　不為甚所羇，　如火燎長焚，　　須臾作灰燼，　智火焚業薪，　　當知亦如是。",
        "translation": "The nature of karma is very subtle and hidden, but those of mysterious adornment can see it, cultivate superior contemplative practices, and it isn't even fettered, like a fire that burns and lasts forever, and in a moment it turns to ashes. The fire of wisdom burns the fuel of karma, so you should know it to be so.",
        "source": "T16n0682_002:0762c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又如燈破闇，　　一念盡無餘，　諸業習暗冥，　　無始之熏聚，　牟尼智燈起，　　剎那頓皆滅。」",
        "translation": "It's like a lamp that pierces darkness, a single thought exhausts it without remainder, and the darkness of karmic impressions that have accumulated since beginningless time are suddenly extinguished when the lamp of Muni wisdom arises.\"",
        "source": "T16n0682_002:0762c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘密嚴經辯觀行品第五",
        "translation": "Dasheng miyan jing bian guanxing pin 5",
        "source": "T16n0682_002:0762c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時金剛藏，　　菩薩摩訶薩，　復告於大眾：　　「諸仁應諦聽，　譬如空閑地，　　欲造立宮室，　匠人資土木，　　然後方得成，　諦觀諸物中，　　二皆無舍宅。",
        "translation": "It was then that the Vajragarbha, the bodhisattva-mahāsattva, again addressed the crowd, \"Gentlemen, listen closely! It's like an empty lot that you want to build a palace, and a craftsman builds the wood and earth before it can be completed; truly, when you examine these things, they both lack a home.",
        "source": "T16n0682_002:0762c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦如於眾指，　　和合以成拳，　離指而推求，　　拳體不可得。",
        "translation": "It's also like when you combine many fingers to form a fist, but when you look beyond the fingers and try to find the fist's body, it's unobtainable.",
        "source": "T16n0682_002:0762c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　軍師及車乘，　　城邑與園林，　雲物須山川，　　瓶衣等諸相，　皆是假和合，　　智者了如夢。",
        "translation": "Armies and chariots, cities and gardens, clouds and mountains, bottles and robes, and other features are all falsely combined, and a wise person understands them as a dream.",
        "source": "T16n0682_002:0762c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是身舍宅，　　諸界所集成，　蘊積猶崇山，　　攲危如朽屋，　不生亦不滅，　　非自亦非他，　如乾闥婆城，　　如雲亦如影，　復如熱時焰，　　亦如觀繪事，　相自於妄現，　　性淨離有無。",
        "translation": "Thus, his body's abode, which is integrated into the elements, is like a lofty mountain with accumulated piles, is perilous like a rotten house, doesn't arise or cease, isn't self or other, is like the city of Gandhāra, like clouds and shadows, like a flame when it's hot, or like an object of contemplation, whose characteristics are themselves deludedly manifested and whose nature is pure from existence and nonexistence.",
        "source": "T16n0682_002:0762c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦如盲與跛，　　相假而得行，　自性無能持，　　凡愚身亦爾。",
        "translation": "They're also like the blind and the lame, who walk nominally in each other's shoes and whose own nature can't be maintained, and so is the body of ordinary foolish people.",
        "source": "T16n0682_002:0762c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　分析至極微，　　空名無實物，　極微不可得，　　諸法亦如是。",
        "translation": "When analyzed to the utmost detail, it's called empty and lacks real substance, and while the utmost detail is unobtainable, so are all dharmas.",
        "source": "T16n0682_002:0762c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　瑜伽淨慧者，　　作是思惟時，　便於色聲等，　　遠離於覺念，　一切意息已，　　泰然得解脫，　不愛於有情，　　常樂於等持。",
        "translation": "When someone of the yoga's pure wisdom contemplates this, they then become free of perceptions of form and sound, and once all thoughts have stopped, they attain unhindered liberation, don't crave sentient beings, and always delight in equanimity.",
        "source": "T16n0682_002:0762c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設有諸天仙，　　姝麗女人等，　而來供養者，　　如觀夢無染。",
        "translation": "Suppose there are gods and sages, beautiful women, and so forth, who come to offer support, as if they were observing a dream without defilement.",
        "source": "T16n0682_002:0763a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身雖住於此，　　外道不能見，　持明與梵天，　　亦不覩其頂。",
        "translation": "Even though they live here, they can't be seen by non-Buddhists, and neither the Śrīmitra nor Brahmā gods can see their heads.",
        "source": "T16n0682_002:0763a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當生摩尼宮，　　自在而遊戲，　與諸明妃眾，　　離欲常歡娛。",
        "translation": "He'll be born in a mani-palace, play freely, and be free from desire and always delighting in the company of beautiful women.",
        "source": "T16n0682_002:0763a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此之觀行法，　　薩埵之境界，　仁應速修習，　　發於勇猛心，　當生光明宮，　　利益於三有，　則斷貪欲分，　　及離瞋恚癡，　能詣大密嚴，　　寂靜殊勝處。",
        "translation": "This is a method of contemplation and practice, a realm of sattva, that you should quickly cultivate, and with courageous effort you'll be born in a palace of light that will benefit the three existences, then you'll eliminate the aspect of desire and free yourself from anger and delusion, and you'll be able to reach the great, mysterious, tranquil, and extraordinary place.",
        "source": "T16n0682_002:0763a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼無死境界，　　亦非識所行，　遠離於諸相，　　非分別所得，　為此微妙處，　　瑜伽者相應，　是故修觀行，　　希求於彼土。",
        "translation": "That realm of deathlessness is not practiced by consciousness, is free of characteristics, and isn't separately attained; for this subtle place, the yogis associate with it; therefore, they cultivate contemplation and aspire to that land.",
        "source": "T16n0682_002:0763a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既勝於貪恚，　　無我亦無人，　勝定汝應修，　　勿生於三毒，　若執於境界，　　則有二覺生。",
        "translation": "Since you're above craving and ill-will, there's no self and no person, so you should cultivate superior concentration and not give rise to the three poisons; if you cling to the objective realm, then two kinds of awareness will arise.",
        "source": "T16n0682_002:0763a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如美女人，　　曼臉而縝髮，　多欲者見已，　　愛著而思惟，　迷惑生染覺，　　專想無餘念，　行來及坐起，　　飲食與眠睡，　彼女之容姿，　　常現於心想。",
        "translation": "She's like a beautiful woman with a beautiful face and coiffured hair who's seen by many desires, attracted to and contemplated, deluded, given rise to defiled perceptions, focused on thoughts without remainder, walking, sitting, rising, eating, drinking, and sleeping, whose appearance is always present in the mind's perception.",
        "source": "T16n0682_002:0763a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如此之惡慧，　　皆由妄境生，　溺在境淤泥，　　是故不應著。",
        "translation": "Such bad wisdom arises from a false object and drowns in the mire of that object; therefore, it shouldn't be attached to it.",
        "source": "T16n0682_002:0763a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或如諸世間，　　邪慧妄分別，　於牛及山羊，　　設婆與麋鹿，　見彼有角故，　　執之以為實，　而於彪兔等，　　便生無角解。",
        "translation": "Perhaps there are worldly beings whose mistaken wisdom falsely discerns that cattle, goats, asps, and elk have horns and therefore attach to them as real, and then they give rise to the understanding that bull rabbits and so forth are hornless.",
        "source": "T16n0682_002:0763a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若非見牛角，　　於兔寧執無？",
        "translation": "If they hadn't seen the horns of the ox, how could they have attached to the rabbit as nonexistent?",
        "source": "T16n0682_002:0763b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間亦復然，　　妄見有所得，　後求體非實，　　便言法定無，　未捨分別來，　　常生是邪覺。",
        "translation": "\"The world is likewise. They falsely see that something is obtained, and when they later investigate that the essence is not real, they say that the Dharma is inherently nonexistent, and they always produce mistaken perceptions before they abandon discrimination.",
        "source": "T16n0682_002:0763b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仁應審觀察，　　心行諸境界，　皆如妄所得，　　角與無角等。",
        "translation": "You, sir, should carefully examine the various objects of mental functioning as deludedly attained, such as horns and hornless horns.",
        "source": "T16n0682_002:0763b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若諸修行者，　　能作如是觀，　隨其所意樂，　　或作轉輪王，　昇空而往還，　　具有大威力；　或生日月殿，　　及諸星宿宮，　四王忉利天，　　焰摩及兜率，　化樂與他化，　　摩尼寶殿中；　色界梵眾身，　　并十梵天處，　無煩及無熱，　　善見與善現，　阿迦尼吒宮，　　自在而遊戲；　空識無所有，　　非想非非想，　住彼漸除欲，　　乃至諸佛剎，　常遊微妙定，　　解脫之境界。",
        "translation": "If practitioners thus observe and follow their desires, they might become wheel-turning kings who ascend and return to the sky with great power; they might be born in the moon palace or the palaces of the stars, the four kings and the grievous gods, Yama and Tuṣita, the gods of transformation and other transformation, the mani-palace of precious treasures; the bodies of the Brahmā realm and the ten Brahma heavens, free of affliction and heat, well seen and well presented, the palace of Akaniṣṭha, where they play freely; the consciousness of emptiness that has no existence, neither perception nor non-perception, abiding in that gradual removal of desire, up to the buddha bases, always swimming in subtle concentration, the realm of liberation.",
        "source": "T16n0682_002:0763b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如因破瓶，　　而乃成於瓦，　壞性剎那現，　　於常見無常；　種子生於芽，　　芽生種已壞。",
        "translation": "It's like a broken vase that becomes a tile, whose nature is momentarily manifested by decay, and which is commonly impermanent; a seed arises from a sprout, but the sprout produces a seed that's already decayed.",
        "source": "T16n0682_002:0763b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又如彼陶匠，　　以泥而作瓶，　泥若是奢摩，　　瓶亦如其色；　或時彼匠者，　　兼用雜色泥，　比至燒已成，　　各隨其泥色。",
        "translation": "Suppose another potter makes a vase out of clay, and if the clay is calabash, the vase is likewise colored; sometimes that potter uses a mixture of colored clay, and then when it's burned, each follows the color of the clay.",
        "source": "T16n0682_002:0763b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從箭竹生葱，　　從角生於[卄/秝]，　穢蠅與敗蜜，　　各得生於蟲。",
        "translation": "From the arrowroot comes forth the scallion, from the horn comes forth the [twenty/penis], and from the filthy fly and rotten honey, each can give rise to insects.",
        "source": "T16n0682_002:0763b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當知世間果，　　似因不似因，　皆因變壞故，　　乃得生於果，　眾塵成所作，　　體性不變壞，　皆是世愚夫，　　而生妄分別。",
        "translation": "You should know that worldly results that appear to be causes and don't appear to be causes are produced as a result of the decay of causes, and that the effects are produced by the accomplishment of all the dust in the world whose nature doesn't change are produced by worldly foolish people who make false discriminations.",
        "source": "T16n0682_002:0763c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能作我內我，　　勝我不可得，　亦無於意我，　　亦無積集因，　及以親生因，　　不從識緣有。",
        "translation": "They are capable of creating a self within a self, a superior self that's unobtainable, no thinking self, no causes of accumulation, and no pro-life causes that exist independently of consciousness.",
        "source": "T16n0682_002:0763c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者之境界，　　善巧力所生，　拔除煩惱刺，　　降魔并眷屬，　世間貪愛盡，　　如蜜能消瘦。",
        "translation": "The realm of the wise is produced by the power of skillful means, which removes the thorns of affliction, subdues Māra and his retinue, and ends worldly cravings like honey that slakes them.",
        "source": "T16n0682_002:0763c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸仙由有貪，　　流轉生諸趣，　多時所熏習，　　譬如瞋恚蛇。",
        "translation": "Because of their cravings, immortals are reborn in various destinies, and they're often perfumed, like an angry snake.",
        "source": "T16n0682_002:0763c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　煩惱火燒然，　　流轉險惡趣，　離貪即解脫，　　常勤修觀行。」",
        "translation": "Burned by the fires of affliction, they are reborn into dangerous and evil destinies. Free of greed, they are liberated, and they always diligently cultivate the practice of contemplation.\"",
        "source": "T16n0682_002:0763c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘密嚴經趣入阿賴耶品第六",
        "translation": "Sixth Chapter of the Sutra of the Great Vehicle's Secret Adornment Going into the Alaya",
        "source": "T16n0682_002:0763c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時金剛藏，　　菩薩摩訶薩，　復告諸大眾：　　「仁等應當知，　我昔蒙佛力，　　加持得妙定，　明見俱胝剎，　　修行世定者。",
        "translation": "It was then that the Vajragarbha, the bodhisattva Mahāsattva, again addressed the crowd, \"You should know, my lords, that in the past I was endowed by the Buddha's power with the maintenance of marvelous concentration, and I clearly saw the corpuscles and those who cultivate worldly concentration.",
        "source": "T16n0682_002:0763c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛與佛子，　　清淨所住處，　於中唯密嚴，　　安樂最第一。",
        "translation": "The buddhas and their sons are pure abodes, only densely adorned among them, and their well-being is the greatest.",
        "source": "T16n0682_002:0763c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛坐蓮花，　　有如殊妙殿，　我等從定起，　　一心以瞻仰，　自見住密嚴，　　佛子眾圍繞。",
        "translation": "The buddhas sit in lotus blossoms, and there's this marvelous palace, where we rise from our concentration, single-mindedly look up, and see ourselves abiding in dense adornment, surrounded by sons of the Buddha.",
        "source": "T16n0682_002:0763c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復見解脫藏，　　住在於宮中，　身量如指節，　　色相甚明朗，　如空淨滿月，　　如阿恒思花。",
        "translation": "We also see the store of liberation abiding in a palace, with a body the size of a knuckle, a form that's as clear as the pure full moon in space, and a flower like Ahimsa.",
        "source": "T16n0682_002:0763c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我即心自念：　　『是誰難思事？』",
        "translation": "I then thought to myself, 'Who is this difficult thing to contemplate?'",
        "source": "T16n0682_002:0763c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即便見已身，　　在於彼腹內，　亦於中普見，　　一切諸世間。",
        "translation": "\"Even when he sees his body inside his belly, he sees all the world in it.",
        "source": "T16n0682_002:0764a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　蓮花藏佛子，　　以佛神力故，　亦皆如是見，　　咸歎不思議。",
        "translation": "The lotus-flower hidden Buddha-child, by virtue of the Buddha's supernormal powers, is also thus seen, and everyone praises him without conceivable reason.",
        "source": "T16n0682_002:0764a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天中天作已，　　即攝威神力，　大眾悉如故，　　希有妙難思，　瑜祇種種色，　　是佛之境界。",
        "translation": "After the gods in the heavens created them, they then gathered in their authoritative power, as did the great multitude, rare and unfathomable, and the various forms of the yoginas, which are the Buddha's realm.",
        "source": "T16n0682_002:0764a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸仁應當知，　　佛昔為菩薩，　從彼歡喜地，　　得至於離垢，　發光及焰慧，　　難勝與現前，　遠行及不動，　　善慧法雲地，　獲得陀羅尼，　　生無盡句義，　首楞嚴等定，　　及以意成身，　細性與輕性，　　大性及意樂，　尊貴欲壽等，　　獲斯八自在，　如應而顯現，　　遊戲於密嚴。",
        "translation": "You, my lords, should know that the Buddha was once a bodhisattva who, from that joyous stage, attained freedom from defilement, emitted light and burning wisdom, became both difficult and present, traveled far and was motionless, attained the ground of the dharma-cloud of good wisdom, obtained the dhāraṇī, produced inexhaustible phrases and meanings, attained concentrations like śūraṃgama, and formed bodies with intent, subtle and light natures, great natures and aspirations, noble desires, longevity, and so forth, attaining these eight kinds of mastery, which are manifested as they should be, and play in mysterious adornment.",
        "source": "T16n0682_002:0764a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　名稱妙光明，　　功德皆成就，　轉復得清淨，　　現成等正覺。",
        "translation": "Their names are marvelously brilliant, their virtues are all accomplished, they are further purified, and they now become perfectly enlightened.",
        "source": "T16n0682_002:0764a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　化為佛菩薩，　　種種妙色像，　自然遍一切，　　而轉妙法輪，　速令諸眾生，　　以智斷諸惑，　利樂諸趣已，　　還住密嚴中。",
        "translation": "He transforms himself into a buddha-bodhisattva with a variety of beautiful forms and images that naturally pervade all, turning the wonderful wheel of the Dharma and quickly causing sentient beings to quickly end their afflictions with wisdom and return to their densely adorned abodes after benefiting and delighting in their destinies.",
        "source": "T16n0682_002:0764a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或有諸大士，　　見佛現身色，　莊嚴吉祥相，　　光明自然發，　熾盛如火聚，　　住於蓮花宮，　與諸觀行人，　　嬉遊安樂定，　三摩地自在，　　處所最殊勝。",
        "translation": "Sometimes there are great men who see the Buddha's body in form, adorned with auspicious appearances, his light naturally shining, blazing like a cluster of fire, standing in a lotus-flower palace, with contemplatives, wandering about in peaceful concentration, freely in the meditative absorption, and in a most extraordinary place.",
        "source": "T16n0682_002:0764a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或見於大樹，　　緊那羅王身，　現於百千億，　　種種之變化，　光明皎如月，　　遍照諸國王。",
        "translation": "Sometimes I see the body of King Kisnaṇḍa in a great tree, appearing in a hundred billion different ways, shining brightly like the moon, and shining brightly as the king of all the countries.",
        "source": "T16n0682_002:0764a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或見兜率天，　　無量諸佛子，　身如帝青色，　　功德相莊嚴，　首飾摩尼冠，　　坐於殊勝殿，　光明普照耀，　　一切智通達。",
        "translation": "Perhaps they see in the Tuṣita Heaven measureless sons of the Buddha, their bodies the color of Tejaprabhā, their features adorned with virtue, their heads adorned with a jeweled crown, sitting in a special hall, their brilliance shining forth, and their omniscience fully comprehended.",
        "source": "T16n0682_002:0764b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或見於普賢，　　具有大威力，　得於一切智，　　四無礙辯才，　身相現光明，　　獨勝無倫匹，　住於滿月殿，　　密嚴之定海，　遍現眾色像，　　賢聖所稱歎。",
        "translation": "Sometimes they see Samantabhadra, possessed of great authority, having attained omniscience, with the four unhindered abilities of eloquence, a body whose features are radiant, unique, and unequaled, standing in a palace full of moons, a dense and adorned ocean of meditative concentration, pervading images of various forms, and praised by good men and sages.",
        "source": "T16n0682_002:0764b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量諸天眾，　　及乾闥婆等，　明仙及國王，　　眷屬眾圍繞。",
        "translation": "Countless gods, gods and goddesses, luminous sages and kings, and their retinues are all around them.",
        "source": "T16n0682_002:0764b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或見最勝子，　　并諸觀行師，　寂靜而住禪，　　儼如在睡眠，　遠離於沈怠，　　順行諸佛教，　勤苦而清羸，　　示同於外道。",
        "translation": "Sometimes they see the most excellent sons and masters of contemplation, calmly abiding in meditation as if in sleep, far removed from laziness, practicing Buddhism accordingly, diligent and exhausted, and shown to be the same as non-Buddhists.",
        "source": "T16n0682_002:0764b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　六欲及梵天，　　有頂至贍部，　於中而現化，　　多種之光明，　神通調御者，　　赫奕而熾盛。",
        "translation": "The six desires and brahma heavens, the highest and highest order of beings, are manifested within them, and their many kinds of light, supernormal abilities, and control are brilliant and ardent.",
        "source": "T16n0682_002:0764b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或見為導師，　　降胎并誕育，　出家修靜慮，　　乃至般涅槃。",
        "translation": "Sometimes they see them as guides, descend into the womb and birth, leave home, cultivate meditation, and attain parinirvāṇa.",
        "source": "T16n0682_002:0764b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛智不思議，　　一切皆圓滿，　得自在無畏，　　人天等歸依。",
        "translation": "The Buddha's wisdom is inconceivable, all things are perfected, he attains sovereignty and fearlessness, and humans and gods take refuge in him.",
        "source": "T16n0682_002:0764b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仁者應當知，　　諸佛之體性，　智慧最無比，　　唯佛所能知。",
        "translation": "You, sir, should know that the buddhas' natures are unsurpassed in terms of wisdom, which only the buddhas can understand.",
        "source": "T16n0682_002:0764b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如釋迦已獲，　　人中勝師子，　汝等咸當得，　　生信勿懷疑，　信即為佛體，　　必當得解脫。",
        "translation": "As Śākyamuni has attained, he's the best teacher among men, and you all should attain it; give rise to faith and don't doubt it; faith is the Buddha's essence, and you will surely attain liberation.",
        "source": "T16n0682_002:0764b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或為彼天主，　　及以諸粟散，　乃至生梵宮，　　而作轉輪王，　轉生蓮花藏，　　在彼佛會中，　蓮花而化生，　　獲大精進力。",
        "translation": "Perhaps you'll be one of the lords of the gods or scattered with millet, or you'll be born in a brahma palace, become a wheel-turning king, be reborn in the lotus-flower store, or be born in that Buddha's assembly with lotus flowers, and attain the power of great effort.",
        "source": "T16n0682_002:0764b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由此降魔眾，　　及欲熏習因，　志意無怯弱，　　證成一道法，　紹繼於佛事，　　得王諸國土。",
        "translation": "He thus subdues the host of Māra and the causes of permeation by desire, has no faltering resolve, realizes the single truth, perpetuates the works of the Buddha, and attains the status of king of the lands.",
        "source": "T16n0682_002:0764c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲得作佛，　　當淨佛性道，　種姓既淨已，　　諸佛即授記，　瑜祇轉覺悟，　　不久當成佛，　一切修行者，　　而為作依怙。",
        "translation": "If someone wants to become a buddha, they must purify the path of buddha-nature, and once their lineage is purified, the buddhas will grant their approval, Ujjayin will become enlightened, and soon they'll become a buddha, and all those who practice will serve as their support.",
        "source": "T16n0682_002:0764c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如彼大地，　　亦為眾所依，　如於妙行者，　　能療一切病，　覺者亦如是，　　能除虛妄疾。",
        "translation": "Like the great earth that also serves as a support for many, like the marvelous practitioner who can treat all illnesses, the awakened one is likewise, able to remove false illnesses.",
        "source": "T16n0682_002:0764c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得無分別心，　　支解不傾動，　內外之境界，　　了達皆唯識，　能遠離於我，　　亦離於我所。",
        "translation": "He attains a mind without discrimination, a mind that's untethered in its supports, a mind that comprehends both internal and external objects as nothing but consciousness, a mind that's free of self and free of what belongs to self.",
        "source": "T16n0682_002:0764c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無能害所害，　　及以於害具，　一切悉皆是，　　意識之境界，　皆依阿賴耶，　　如是妄分別。",
        "translation": "Nothing that can harm, nothing that can harm, and everything that is harmful are all these, and the objects of the mind rely on the store consciousness, which is falsely discriminated like this.",
        "source": "T16n0682_002:0764c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如珠合日光，　　相感而生火，　此火非珠出，　　亦非從日生。",
        "translation": "Like a pearl combined with sunlight, the mutual influence produces fire, but this fire doesn't come from the pearl, nor does it arise from the sun.",
        "source": "T16n0682_002:0764c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心意識亦爾，　　根境意和合，　能生於諸心，　　如海起波浪。",
        "translation": "Similarly, mind, mind, and consciousness are united, and the combination of sense and object can produce waves in the mind like an ocean rising.",
        "source": "T16n0682_002:0764c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此性非陽焰，　　亦非於夢幻，　非同如是等，　　迷惑之所取，　非同龜鼃毛，　　及與於兔角。",
        "translation": "This nature is not a mirage, nor is it dreamlike, nor is it like this, which is grasped by delusion, nor is it like the hair of a tortoise or the horns of a rabbit.",
        "source": "T16n0682_002:0764c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又如雷電合，　　震發而生火，　此火為從水，　　為從雷電生，　竟無有定知，　　此火從生處。",
        "translation": "It's also like when thunder and lightning combine to shake and start a fire, whether it's from water or from thunder and lightning, there's no definite way to know where this fire comes from.",
        "source": "T16n0682_002:0764c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如火為從水，　　造作於瓶等，　欲等諸心法，　　與心而共生，　和合無定性，　　當知亦如是。",
        "translation": "Just as fire is made from water, it creates a vase or other, desires and other mental factors that arise together with the mind, and there's no definite combination, so you should know it to be so.",
        "source": "T16n0682_002:0765a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心境不思議，　　密嚴者知見，　有情之藏護，　　無始妙俱生，　如涅槃虛空，　　擇滅無為性，　遠離於三世，　　清淨常圓滿。",
        "translation": "The mind and its objects are inconceivable, and those of mysterious adornment know and see that they're the storehouse of sentient beings, beginningless and marvelously produced together, like the void of nirvāṇa, selectively extinguishing the nature of noncontrivance, remote from the three worlds, and pure and always perfect.",
        "source": "T16n0682_002:0765a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如月有虧盈，　　顯現諸國土，　循環體是一，　　其性無增減；　愚夫所分別，　　見月有增減，　往來於四洲，　　而實無盈缺。",
        "translation": "Like the moon with deficiency and fullness, it reveals lands whose cycles are one in essence and whose nature doesn't increase or decrease; foolish people discriminate and see the moon as increasing or decreasing, traveling to and from the four continents when there's really no increase or decrease.",
        "source": "T16n0682_002:0765a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是之藏識，　　普現有情界，　其體無增減，　　圓潔常光明；　愚夫妄分別，　　恒於賴耶識，　計著有增減，　　應知亦如是。",
        "translation": "Thus, the store consciousness universally manifests in the realm of sentient beings, has no increase or decrease in its essence, and is perfectly clean and always shining; a foolish man's false discrimination constantly imputes increase or decrease in attachment to the store consciousness should be known to be likewise.",
        "source": "T16n0682_002:0765a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有於此識，　　能正而了知，　即便得無漏，　　轉依位差別，　如是差別法，　　得者甚為難。",
        "translation": "If there's someone who correctly understands this consciousness, then even if they attain uncontaminatedness, they'll be transformed into a differentiation of status based on such differentiation, which is very difficult to attain.",
        "source": "T16n0682_002:0765a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　藏識亦如是，　　與七識俱轉，　熏習以相應，　　體性而無染。",
        "translation": "Hidden consciousness is likewise, evolving together with the seven consciousnesses, perfumed to correspond, and undefiled in essence.",
        "source": "T16n0682_002:0765a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如河中木，　　隨水以漂流，　而木與於流，　　體相各差別。",
        "translation": "It's like a log in a river that floats along with the water, but the log and the current have their own distinctive characteristics.",
        "source": "T16n0682_002:0765a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　藏識亦如是，　　諸識習氣俱，　而恒性清淨，　　不為其所業。",
        "translation": "*So it is with the store consciousness, which is endowed with the habituated tendencies of the consciousnesses but is always pure in nature and doesn't do anything for them.",
        "source": "T16n0682_002:0765a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　清淨與雜染，　　皆依阿賴耶，　聖者現法樂，　　等引之境界，　人天等諸趣，　　一切佛剎土，　如是染淨法，　　如來藏為因，　由彼悟成佛，　　為諸乘種性。",
        "translation": "Both purity and defilement rely on the store, the sages' enjoyment of the present life, the objects of equal guidance, humans, gods, and other destinies, and all the buddha-lands, such are the causes of defiled and pure dharmas, the tathāgatagarbha, from which they awaken and become buddhas, and the seed-natures of the vehicles.",
        "source": "T16n0682_002:0765a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸眾生，　　有具於威力，　自在諸功德，　　殊勝諸吉祥，　乃至險惡處，　　上中下差別，　賴耶恒住中，　　遍為作依止。",
        "translation": "All sentient beings possess authoritative power, individual merits, exceptional good fortune, and even dangerous and unpleasant places, with distinctions between higher and middle and lower, which are always present in Rājagṛha and are universally used as supports.",
        "source": "T16n0682_002:0765b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉是諸有情，　　無始時來果，　以諸業習氣，　　而能自增長，　亦復而增長，　　所餘之七識。",
        "translation": "They are all sentient beings who, as a result of karmic impressions that have come since beginningless time, are able to grow on their own and also to grow the remaining seven consciousnesses.",
        "source": "T16n0682_002:0765b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由是之愚夫，　　執以為內我，　能作所依我，　　輪迴於生死。",
        "translation": "As a result, this foolish man clings to what he thinks is an internal self, which serves as a basis for a self, and transmigrates through birth and death.",
        "source": "T16n0682_002:0765b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　意識在身中，　　迅疾如風轉，　業風所吹動，　　遍住於諸根，　常與七識俱，　　流轉如波浪。",
        "translation": "With the mind consciousness in his body, it quickly moves like a wind, is blown by the wind of karma, is pervasive in his faculties, is always with the seven consciousnesses, and flows like waves.",
        "source": "T16n0682_002:0765b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　微塵與勝性，　　自在及時方，　悉是淨賴耶，　　於中妄分別。",
        "translation": "The subtle and ultimate natures, which are self-existent and temporal, are all pure laya, in which they are falsely discriminated.",
        "source": "T16n0682_002:0765b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　賴耶由業力，　　及愛以為因，　成就諸世間，　　種種之品類；　愚夫恒不了，　　執之為作者。",
        "translation": "As a result of karma and craving, Leya produces the various categories of the world, which foolish people never grasp as their author.",
        "source": "T16n0682_002:0765b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此識之體相，　　微細甚難知，　未見於真實，　　心迷不能覺，　常於根境意，　　而生於愛著。」",
        "translation": "The essence and characteristics of this consciousness are subtle and difficult to know, and because they aren't seen to be true, the mind is confused and unable to perceive them, always attaching to faculties, objects, and thoughts.\"",
        "source": "T16n0682_002:0765b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金剛藏復言：　　「無畏諸佛子！",
        "translation": "Vajrajñāta then replied, \"Fearless, you buddhas!",
        "source": "T16n0682_002:0765b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是賴耶體，　　云何不見聞，　眾身之所依，　　性淨恒無染，　具足三十二，　　佛相及輪王，　遍於三界中，　　而現種種色。",
        "translation": "\"Thus is the laya body, why don't you see and hear that it's the basis of the many bodies, pure and undefiled in nature, complete with the thirty-two, buddha forms and wheel-turning kings, pervading the three realms, and displaying various forms.",
        "source": "T16n0682_002:0765b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如淨空月，　　眾星所環繞，　藏識與諸識，　　住身亦如是。",
        "translation": "They're like the moon in pure space, surrounded by stars, and the store consciousness and other consciousnesses, which reside in the body as well.",
        "source": "T16n0682_002:0765b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦如欲天主，　　天女眾圍繞，　顯於寶宮殿，　　藏識亦如是。",
        "translation": "Like the lord of the desire gods, who's surrounded by goddesses and displayed in a jeweled palace, so is the stored consciousness.",
        "source": "T16n0682_002:0765b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如江海諸神，　　水中而自在，　藏識處於世，　　當知亦如是。",
        "translation": "Like the gods of the rivers and seas who are at ease in the water and whose hidden consciousnesses are in the world, you should know that they are likewise.",
        "source": "T16n0682_002:0765c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如龍依水天，　　如百川歸海，　如樹王依地，　　現心亦如是。",
        "translation": "As a dragon relies on a watery heaven, as a hundred rivers return to the ocean, and as a tree king relies on the ground, so too is the present mind.",
        "source": "T16n0682_002:0765c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如日在宮殿，　　旋繞妙高山，　諸天皆敬禮，　　佛地心亦爾。",
        "translation": "Like the sun in a palace, it circles a high, marvelous mountain, and the gods all venerate it, so does the mind of the buddha-stage.",
        "source": "T16n0682_002:0765c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十種諸地中，　　修行一切行，　在於菩薩身，　　顯現於大海，　遍利與安樂，　　如來常稱讚，　地地皆清淨，　　故號為佛子。",
        "translation": "Among the ten kinds of stages, he cultivates all practices, manifests them in the bodhisattva body, appears in the ocean, brings universal benefit and happiness, and is always praised by the Tathāgata as being pure from ground to ground, which is why he's called the son of the Buddha.",
        "source": "T16n0682_002:0765c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　在於菩薩身，　　是即名菩薩，　佛與諸菩薩，　　皆是賴耶名。",
        "translation": "Here in the bodhisattva body, this is called a bodhisattva, and the Buddha and the bodhisattvas are all called ālayas.",
        "source": "T16n0682_002:0765c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛及最勝子，　　已授當授記，　廣大阿賴耶，　　當成等正覺。",
        "translation": "The Buddha and the paramount son, having been granted and will be granted assurance, will become perfectly enlightened with the vast storey of ālayas.",
        "source": "T16n0682_002:0765c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即此賴耶體，　　密嚴者能見，　由最勝瑜伽，　　妙定相應故。",
        "translation": "This is the essence of the storey, which can be seen by those of mysterious adornment because it's associated with the most excellent yoga and marvelous concentration.",
        "source": "T16n0682_002:0765c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛與緣覺，　　聲聞及外道，　證理無畏人，　　所觀皆此識。",
        "translation": "It's the same consciousness that's observed by buddhas and pratyekbuddhas, śrāvakas and non-Buddhists, and those who realize the principle without fear.",
        "source": "T16n0682_002:0765c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種諸識境，　　皆從心所變，　瓶衣等眾物，　　如是性皆無，　悉依阿賴耶，　　所見皆迷惑，　謂以諸熏習，　　妄生能所取。",
        "translation": "The various objects of consciousness are all transformed by the mind, and bottles, clothing, and other things that are like this are all nonexistent in nature, all rely on the store consciousness, and all that they see are deluded, meaning that they are deludedly produced by permeation, able to grasp what's appropriate.",
        "source": "T16n0682_002:0765c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　體非如幻化，　　非陽焰毛輪，　非生非不生，　　空性空遠離，　有無皆無性，　　長短等亦然。",
        "translation": "Their bodies are not illusory, not miraculous, not flaming sun or hair circles, not produced or unproduced, empty and remote from emptiness, and neither existence nor nonexistence are of the same nature, nor are their lengths and so forth.",
        "source": "T16n0682_002:0765c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者觀幻事，　　此皆唯幻術，　未曾有一物，　　與幻而同起。",
        "translation": "A wise person observes illusory phenomena, which are nothing but illusory techniques, and there's never been a single thing that arises together with an illusion.",
        "source": "T16n0682_002:0765c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有情所分別，　　如幻而可見，　陽焰毛輪相，　　二俱不可得，　離一亦無二，　　無過世當世。",
        "translation": "What's discriminated by sentient beings is illusory and visible, the sun, flame, and hair of the wheel, both of which are unknowable, separate from one and not two, without surpassing the world and the present.",
        "source": "T16n0682_002:0765c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此皆識變異，　　無幻無幻名，　諸性無所得，　　是幻幻所作。",
        "translation": "These are all transformations of consciousness, which are neither illusory nor named as illusory, and their natures are unobtainable and created by illusory illusions.",
        "source": "T16n0682_002:0766a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間有迷惑，　　其心不自在，　妄說有能幻，　　幻成種種物，　動搖及往來，　　雖見皆非實，　如鐵因磁石，　　所向而轉移。",
        "translation": "There's delusion in the world, and their minds aren't free to falsely claim there's something that's illusory, that's illusory in various ways, that moves and comes and goes, that's not real even though it's seen, like an iron that's shifted by a magnet.",
        "source": "T16n0682_002:0766a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　藏識亦如是，　　隨於分別種，　一切諸世間，　　無處不周遍。",
        "translation": "Hidden consciousness is likewise, according to the kinds of discrimination, there's nowhere in the world that it doesn't reach.",
        "source": "T16n0682_002:0766a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如日摩尼寶，　　無思及分別，　此識遍諸處，　　見之謂流轉。",
        "translation": "Like the sun and the maṇi treasure, without thought or discrimination, this consciousness pervades all places and is called transmigration when seen.",
        "source": "T16n0682_002:0766a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不死亦不生，　　本非流轉法，　如夢見生死，　　覺悟即解脫。",
        "translation": "Not dying or being born, it's not originally a transmigration, like seeing birth and death in a dream, but awakening is liberation.",
        "source": "T16n0682_002:0766a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛子若轉依，　　即名解脫者，　此即是諸佛，　　最勝之教理。",
        "translation": "If a buddha-son changes his basis, he's called liberated, which is the most excellent teaching of the buddhas.",
        "source": "T16n0682_002:0766a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　審量一切法，　　如稱如明鏡，　照曜如明燈，　　試驗如金石，　正道之標相，　　遠離於斷滅。",
        "translation": "He examines all things as they're described, like a bright mirror, shining like a bright lamp, tested like gold and stone, and the mark of the right path, far removed from cessation.",
        "source": "T16n0682_002:0766a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修習勝定者，　　皆由清淨因，　令離諸雜染，　　轉依而顯現。」",
        "translation": "Those who cultivate superior concentration all result from pure causes, which free them from defilements and transform them into manifestations.\"",
        "source": "T16n0682_002:0766a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘密嚴經卷中",
        "translation": "(Dasheng miyan jing, mid-fascicle)",
        "source": "T16n0682_002:0766a21_0",
        "is_bad_quality": false
    }
]