[
    {
        "source_sentence": "佛說寶雨經卷第六",
        "translation": "Foshuo baoyu jing, vol. 6",
        "source": "T16n0660_006:0306b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐天竺三藏達摩流支譯",
        "translation": "Translated by Dharmaruci, the Tripiṭaka of the Tang Dynasty",
        "source": "T16n0660_006:0306b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0306b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得廣大心。",
        "translation": "Bodhisattvas achieve ten kinds of qualities that make their minds vast.",
        "source": "T16n0660_006:0306b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0306b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、我當積集一切平等諸波羅蜜多，是名發起廣大之心；二者、我當圓滿一切佛法，是名發起廣大之心；三者、我當調伏一切有情，是名發起廣大之心；四者、我當坐於菩提道場，於阿耨多羅三藐三菩提而現等覺，是名發起廣大之心；五者、現等覺已，轉於法輪，若諸沙門、婆羅門，及天、魔、梵、世間人等，一切無能同我轉者，是名發起廣大之心；六者、我為利益一切有情，往於無量無邊諸世界中，為彼彼有情作利益事，是名發起廣大之心；七者、我當積集般若以為船筏，度生死海中一切有情令至彼岸，是名發起廣大之心；八者、見諸有情無主無歸、無救無護、無有處所，我當為彼而作眷屬，與彼有情為救護等，是名發起廣大之心；九者、於一切佛最勝事業，我當示現能作；諸佛最勝事業佛師子吼，我當能作大師子吼；佛所遊戲，我當遊戲；大龍觀察，我當觀察；我所得者，令諸天、魔、梵、世、沙門、婆羅門、一切世間天、人、阿素洛等皆當得之，是名發起廣大之心；十者、佛大威德調伏有情，我當調伏，不為麁惡行、不為無利苦行、不為下劣行，是名發起廣大之心。",
        "translation": "一者、我當積集一切平等諸波羅蜜多，是名發起廣大之心；二者、我當圓滿一切佛法，是名發起廣大之心；三者、我當調伏一切有情，是名發起廣大之心；四者、我當坐於菩提道場，於阿耨多羅三藐三菩提而現等覺，是名發起廣大之心；五者、現等覺已，轉於法輪，若諸沙門、婆羅門，及天、魔、梵、世間人等，一切無能同我轉者，是名發起廣大之心；六者、我為利益一切有情，往於無量無邊諸世界中，為彼彼有情作利益事，是名發起廣大之心；七者、我當積集般若以為船筏，度生死海中一切有情令至彼岸，是名發起廣大之心；八者、見諸有情無主無歸、無救無護、無有處所，我當為彼而作眷屬，與彼有情為救護等，是名發起廣大之心；九者、於一切佛最勝事業，我當示現能作；諸佛最勝事業佛師子吼，我當能作大師子吼；佛所遊戲，我當遊戲；大龍觀察，我當觀察；我所得者，令諸天、魔、梵、世、沙門、婆羅門、一切世間天、人、阿素洛等皆當得之，是名發起廣大之心；十者、佛大威德調伏有情，我當調伏，不為麁惡行、不為無利苦行、不為下劣行，是名發起廣大之心。",
        "source": "T16n0660_006:0306b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0306c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得廣大心。",
        "translation": "Accomplishing these ten things, a bodhisattva attains a vast mind.",
        "source": "T16n0660_006:0306c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0306c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得清淨心。",
        "translation": "Bodhisattvas accomplish ten kinds of things to attain a pure mind.",
        "source": "T16n0660_006:0306c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0306c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、得圓滿意樂，以此意樂性不動故、常安住故、無虛偽故；二者、遠離不如理作意，謂我當作佛師子吼，終不發起聲聞作意，亦不發起緣覺作意，亦不發起少分作意；三者、永離一切塵垢，謂能除去諸煩惱塵；四者、永離身現矯詐，謂能遠離一切矯詐威儀異相；五者、永離語言矯詐，終不示現不真實語；六者、永離心業矯詐，謂身無所著故、語言知足故、心無悕求故；七者、報恩，於少分恩常不忘失，況有多恩而不念報；八者、知恩，於有恩者，必無隱諱，亦不輕賤；見彼有德，踊躍歡喜，稱揚讚歎，除彼世間無慚愧者；九者、如言而作，謂諸菩薩示現美言，稱心相應；心常寂靜，不懷怨結；尊重於他，不生輕慢；實言而說，無有矯詐；不為慳悋、嫉妬、諂誑之所隨逐；菩薩終不令他鬪戰，亦非展轉破壞於他；說真實義、隨利益事而皆與之；十者、於如來教中永離誹謗，謂此菩薩發阿耨多羅三藐三菩提心已，剃除鬚髮，覆袈裟衣，於如來教中正信出家，非因王力逼令出家，不為盜賊抑令出家，不為負債方便出家，不為驚怖而求出家，非怖不活邪命出家，希求正法以信出家。",
        "translation": "一者、得圓滿意樂，以此意樂性不動故、常安住故、無虛偽故；二者、遠離不如理作意，謂我當作佛師子吼，終不發起聲聞作意，亦不發起緣覺作意，亦不發起少分作意；三者、永離一切塵垢，謂能除去諸煩惱塵；四者、永離身現矯詐，謂能遠離一切矯詐威儀異相；五者、永離語言矯詐，終不示現不真實語；六者、永離心業矯詐，謂身無所著故、語言知足故、心無悕求故；七者、報恩，於少分恩常不忘失，況有多恩而不念報；八者、知恩，於有恩者，必無隱諱，亦不輕賤；見彼有德，踊躍歡喜，稱揚讚歎，除彼世間無慚愧者；九者、如言而作，謂諸菩薩示現美言，稱心相應；心常寂靜，不懷怨結；尊重於他，不生輕慢；實言而說，無有矯詐；不為慳悋、嫉妬、諂誑之所隨逐；菩薩終不令他鬪戰，亦非展轉破壞於他；說真實義、隨利益事而皆與之；十者、於如來教中永離誹謗，謂此菩薩發阿耨多羅三藐三菩提心已，剃除鬚髮，覆袈裟衣，於如來教中正信出家，非因王力逼令出家，不為盜賊抑令出家，不為負債方便出家，不為驚怖而求出家，非怖不活邪命出家，希求正法以信出家。",
        "source": "T16n0660_006:0306c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩常為求善知識，親近承事，聽聞正法，聞已修行。",
        "translation": "A bodhisattva always seeks a good teacher, becomes intimate with and serves them, hears the right teaching, and cultivates its practice after hearing it.",
        "source": "T16n0660_006:0306c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復菩薩不為我慢之所掩蔽，離我慢故；又不顛倒取，以無顛倒領受性故；證通達道，得通達故；證於法性，得法性故。",
        "translation": "Furthermore, the bodhisattva isn't hindered by self-conceit because he's free of it; he doesn't mistakenly grasp because he has no mistaken apprehension; he realizes the path of penetration and attains penetration; and he realizes the nature of the teaching and attains the nature of the teaching.",
        "source": "T16n0660_006:0306c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證法性已，決定能得阿耨多羅三藐三菩提。",
        "translation": "After realizing the Dharma nature, they're certain to attain supreme perfect enlightenment.",
        "source": "T16n0660_006:0306c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩於佛教中離諸誹謗。",
        "translation": "This is called a bodhisattva who's free of slander in Buddhism.",
        "source": "T16n0660_006:0307a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0307a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得清淨心。",
        "translation": "Accomplishing these ten things, a bodhisattva attains a pure mind.",
        "source": "T16n0660_006:0307a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0307a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得無猶豫心。",
        "translation": "When a bodhisattva accomplishes ten things, he attains a mind without hesitation.",
        "source": "T16n0660_006:0307a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0307a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、深信如來身業祕密；二者、深信如來語業祕密；三者、深信如來意業祕密；四者、深信菩薩積集；五者、深信菩提；六者、能信如來出現；七者、能信演說一乘實相；八者、能信宣說種種實相；九者、能信如來言音深遠；十者、深信如來知有情意，樂而調伏之。",
        "translation": "1. they are convinced of the Tathāgata's mysterious physical actions; 2. they are convinced of the Tathāgata's mysterious verbal actions; 3. they are convinced of the Tathāgata's mysterious mental actions; 4. they are convinced that the bodhisattva has accumulated; 5. they are convinced of enlightenment; 6. they can believe in the Tathāgata's appearance; 7. they can believe in the explanation of the true characteristics of the One Vehicle; 8. they can believe in the explanation of various true characteristics; 9. they can believe in the profundity of the Tathāgata's speech; 10. they are convinced that the Tathāgata knows the thoughts of sentient beings and is happy to subdue them.",
        "source": "T16n0660_006:0307a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩深信如來身業祕密？",
        "translation": "\"How do bodhisattvas have faith in the Tathāgata's esoteric physical actions?",
        "source": "T16n0660_006:0307a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0307a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩若聞如來法身之性、寂靜身性、無等身性、無量身性、不共身性、金剛身性，作是思惟：『此為真實，非是虛誑。』",
        "translation": "Suppose bodhisattvas hear about the nature of the Tathāgata's Dharma body, quiescent body nature, peerless body nature, limitless nature, distinct body nature, and adamantine body nature and think, 'This is real, not false.'",
        "source": "T16n0660_006:0307a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此菩薩於彼法中心無猶豫，是名菩薩深信如來身業祕密。",
        "translation": "This is called a bodhisattva who has no hesitation about that Dharma center, and it's called a bodhisattva who deeply believes in the secrets of the Tathāgata's physical actions.",
        "source": "T16n0660_006:0307a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩深信如來語業祕密？",
        "translation": "\"How does a bodhisattva firmly believe in the secrets of the Tathāgata's verbal actions?",
        "source": "T16n0660_006:0307a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩聞於如來為諸有情現前授記、不現前授記、祕密記已，菩薩如是思惟：『如來言音終無虛誑，得無誤失！』",
        "translation": "It means that after a bodhisattva hears the Tathāgata give a present or impresent assurance or a secret assurance to sentient beings, the bodhisattva thus reflects, 'The Tathāgata's words and sounds are never false and are not misconstrued!'",
        "source": "T16n0660_006:0307a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，語得真實。",
        "translation": "By this cause and condition, words can be true.",
        "source": "T16n0660_006:0307a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0307a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由如來永斷一切過患故、永斷一切諸塵垢故、永斷一切諸熱惱故、永無一切諸煩惱故，能得自在，皎潔澄清，無諸穢濁。",
        "translation": "Because the Tathāgata permanently ends all faults, permanently ends all defilements, permanently ends all fever, and permanently ends all afflictions, he attains freedom, purity, and clarity, and is unsullied.",
        "source": "T16n0660_006:0307a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來之言有虛誑、誤犯，無容是處，惟此真實，非為虛誑。",
        "translation": "If the Tathāgata's words are false or mistaken, there's no room for them, but this is true and not false.",
        "source": "T16n0660_006:0307a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於此法中得無猶豫，是名菩薩深信如來語業祕密。",
        "translation": "When a bodhisattva attains no hesitation in this teaching, this is called a bodhisattva who deeply believes in the secrets of the Tathāgata's speech.",
        "source": "T16n0660_006:0307a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩深信如來意業祕密？",
        "translation": "\"How does a bodhisattva firmly believe in the secrets of the Tathāgata's actions of thought?",
        "source": "T16n0660_006:0307a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩聞於如來意之祕密，謂如來所有意樂、法義依止於心，依心而住，一切菩薩聲聞、緣覺，及諸有情無能知者，惟除如來之所加持。",
        "translation": "\"If bodhisattvas hear the secret of the Tathāgata's intention, which is that the Tathāgata's intentions and the meaning of the Dharma rest in the mind and abide based on the mind, none of the bodhisattvas, śrāvakas, pratyekbuddhas, or sentient beings will be able to know it except for the Tathāgata's empowerment.",
        "source": "T16n0660_006:0307a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0307a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來甚深難可度量，超過計度及計度所行，廣大無量，猶若虛空，超越一切虛妄計者所有境界。",
        "translation": "The Tathāgata's depth is difficult to fathom, surpasses calculation and what's done by calculation, and is so vast and immeasurable that it's like space, transcending all the realms of those who falsely conceptualize.",
        "source": "T16n0660_006:0307a29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是正思惟：『此是真實，非為虛誑！』",
        "translation": "The bodhisattva thus correctly contemplates, 'This is real, not false!'",
        "source": "T16n0660_006:0307b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼法中得無猶豫，是名菩薩深信如來意業祕密。",
        "translation": "Attaining no hesitation in that teaching is called a bodhisattva's conviction in the secrets of the Tathāgata's intentions.",
        "source": "T16n0660_006:0307b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何深信菩薩積集？",
        "translation": "\"How does a convinced bodhisattva accumulate?",
        "source": "T16n0660_006:0307b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂聞諸菩薩現前利益一切有情，是諸有情所作之事皆能作之，終無疲倦，亦不驚怖。",
        "translation": "It means hearing about bodhisattvas who are presently benefiting all sentient beings and are capable of doing whatever it is that sentient beings do, never grows weary, and isn't frightened.",
        "source": "T16n0660_006:0307b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復能荷負大願重擔，有大勢力，勇猛堅固，遍能積集諸波羅蜜多，次第積集一切佛法，得無礙智、無邊智性、無等智性、不共智性、精進堅固、被甲堅固、誓願堅固、誓願不動、誓願不共，以為無上菩提因緣。",
        "translation": "They are also able to bear the burden of the great vow, have great power and fortitude, are able to accumulate the perfections, accumulate all the buddhas in sequence, attain unhindered cognition, limitless cognition, peerless cognition, and uncommon cognition, and become resolute in their effort, resolute in their armor, resolute in their vows, immovable in their vows, and uncommon in their vows, in order to serve as the cause and condition for unsurpassed bodhi.",
        "source": "T16n0660_006:0307b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩次第修習，令生增長，圓滿廣大。",
        "translation": "These bodhisattvas sequentially cultivate them, producing growth and completeness.",
        "source": "T16n0660_006:0307b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是思惟：『此為真實，非是虛誑！』",
        "translation": "The bodhisattvas thus think, 'This is real, not false!'",
        "source": "T16n0660_006:0307b12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於彼諸法之中得無猶豫，是名菩薩能得深信積集。",
        "translation": "When a bodhisattva attains no hesitation among those qualities, this is called a bodhisattva who can accumulate conviction.",
        "source": "T16n0660_006:0307b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩深信菩提及如來出現？",
        "translation": "\"How do bodhisattvas have deep faith in the enlightenment and the Tathāgata's appearance?",
        "source": "T16n0660_006:0307b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如是思惟：『聞諸菩薩坐菩提道場已，無著、無礙、無障；得天眼智通、天耳智通、他心智通、宿住隨念智通、神境智通、漏盡智通；成就勝智，一一剎那了達三世，無著、無礙、無障。』",
        "translation": "It means that bodhisattvas thus contemplate, 'After hearing that bodhisattvas sit on the site of the enlightenment path, they become unattached, unhindered, and unobstructed; they attain the knowledge of the divine eye, the knowledge of the divine ear, the knowledge of other minds, the knowledge of mindfulness of past lives, the knowledge of the spiritual objects, and the knowledge of the end of contamination; and they accomplish superior knowledge, comprehending the three worlds moment by moment without attachment, hindrance, or impediment.'",
        "source": "T16n0660_006:0307b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣能遍觀察諸有情界。",
        "translation": "Because of these causes and conditions, they can completely observe the realms of sentient beings.",
        "source": "T16n0660_006:0307b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此類有情成就身惡行、成就語惡行、成就意惡行，受諸邪法，起於邪見，誹謗聖者，由是因緣身壞命終墮諸惡趣，生捺洛迦中。",
        "translation": "These kinds of sentient beings achieve bad physical conduct, achieve bad verbal conduct, achieve bad mental conduct, accept wrong things, develop wrong views, and denigrate the noble ones, and because of these causes and conditions, they are destined to fall into bad destinies when their bodies break up and their lives end, and they're born among the hell beings.",
        "source": "T16n0660_006:0307b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復能觀察如是有情，成就身善行、成就語善行、成就意善行，領受正法，起於正見，不謗聖者，以是因緣命終之後，生諸善趣，得生天中。",
        "translation": "Furthermore, if he can observe such a sentient being who has accomplished good physical conduct, accomplished good verbal conduct, accomplished good mental conduct, received right teachings, arisen from right views, and doesn't denigrate the noble ones, then he'll be born in a good destiny or among the gods after his life ends as a result.",
        "source": "T16n0660_006:0307b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是能實觀察諸有情界善、不善業已，作是思惟：『我於往昔行菩薩行有如是願：「若自覺悟，令他覺悟；我願既滿，意樂亦足！」",
        "translation": "After truly observing the good and unskillful actions of the world of sentient beings in this way, the bodhisattva thinks, 'In the past, I practiced bodhisattva behavior with this vow: \"If I awaken myself, I'll make others awaken; once I fulfilled my vow, my intention was fulfilled!\"'",
        "source": "T16n0660_006:0307b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟此真實，非是虛妄。』",
        "translation": "Only this is true, not false.'",
        "source": "T16n0660_006:0307b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩能於彼法之中得無猶豫，由是菩薩能證菩提名為正覺。",
        "translation": "A bodhisattva can attain no hesitation within that teaching, and as a result, a bodhisattva can realize enlightenment called right awakening.",
        "source": "T16n0660_006:0307b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0307c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩深信菩提及如來出現。",
        "translation": "This is called a bodhisattva's conviction about enlightenment and the Tathāgata's appearance.",
        "source": "T16n0660_006:0307c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩深信演說一乘實相？",
        "translation": "\"How are bodhisattvas deeply convinced of the true character of the One Vehicle as explained?",
        "source": "T16n0660_006:0307c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如是思惟：『聞於如來一乘法已，唯此真實，非是虛妄，恒不變易。』",
        "translation": "It means that bodhisattvas thus contemplate, 'After hearing the Tathāgata's One Vehicle teaching, it's only this that's true, not false, and remains unchanging.'",
        "source": "T16n0660_006:0307c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0307c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由從一乘出諸乘故。",
        "translation": "\"It's because from the One Vehicle come the Vehicles.",
        "source": "T16n0660_006:0307c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子？",
        "translation": "Good sons?",
        "source": "T16n0660_006:0307c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如贍部洲中有諸小洲，雖各異名，然彼同依於贍部洲，由是說名一贍部洲。",
        "translation": "\"It's like the small continents in Jambudvīpa that have different names but are all based on the same Jambudvīpa, so that's why it's called the One Jambudvīpa.",
        "source": "T16n0660_006:0307c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說一乘亦復如是，由如來乘出現諸乘，而諸乘等雖有異名，然同依止如來乘故，說名一乘。",
        "translation": "Similarly, the One Vehicle that's explained is called the One Vehicle because the Tathāgata Vehicle appears as vehicles, and although they have different names, they all rely on the Tathāgata Vehicle in the same way.",
        "source": "T16n0660_006:0307c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩能於彼正法中得無猶豫，是名菩薩深信演說一乘實相。",
        "translation": "When a bodhisattva can attain no hesitation in that right teaching, this is called a bodhisattva who deeply believes in the true character of the exposition of the One Vehicle.",
        "source": "T16n0660_006:0307c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩能深信演說種種實相？",
        "translation": "\"How can a bodhisattva deeply believe and expound the various real aspects?",
        "source": "T16n0660_006:0307c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如是思惟：『聞於如來素怛纜中宣說如是種種實相已，唯此真實，非為虛誑。』",
        "translation": "It means that bodhisattvas thus think, 'After hearing these kinds of true characteristics proclaimed in the Tathāgata's sūtra, this alone is true, not false.'",
        "source": "T16n0660_006:0307c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0307c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由諸如來能調伏故，隨諸有情種種勝解演說妙法。",
        "translation": "Because the tathāgatas are able to tame them, they explain the wonderful Dharma according to the various superior understandings of sentient beings.",
        "source": "T16n0660_006:0307c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於此正法之中能無猶豫，是名菩薩能深信演說種種實相。",
        "translation": "A bodhisattva's ability to have no hesitation in this right teaching is called a bodhisattva who is able to explain the various real features with deep conviction.",
        "source": "T16n0660_006:0307c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩得深信如來言音深遠？",
        "translation": "\"How can a bodhisattva become convinced of the profundity of the Tathāgata's speech and voice?",
        "source": "T16n0660_006:0307c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如是思惟：『聞於如來言音深遠已，唯此真實，非為虛誑。』",
        "translation": "It means that bodhisattvas thus contemplate, 'After hearing the profound voice of the Tathāgata, this alone is real, not false.'",
        "source": "T16n0660_006:0307c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0307c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸天子少福善根，尚得深遠美妙音聲，何況如來以於無量百千數劫積集妙行！",
        "translation": "How could the Tathāgata accumulate marvelous practices over measureless hundreds of thousands of eons when the sons of gods have few virtuous roots and still attain a profound and beautiful voice?",
        "source": "T16n0660_006:0307c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是菩薩於彼法中得無猶豫，是名菩薩深信如來言音深遠。",
        "translation": "Because a bodhisattva attains no hesitation in regard to that teaching, this is called a bodhisattva's conviction that the Tathāgata's voice is profound.",
        "source": "T16n0660_006:0307c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩得深信如來知有情意樂而調伏之？",
        "translation": "\"How does a bodhisattva attain conviction that the Tathāgata knows the intentions of sentient beings and subdues them?",
        "source": "T16n0660_006:0307c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸菩薩如是思惟：『聞於如來能知一切有情意樂、種種隨眠、種種勝解，一音說法皆令調伏，各隨意解，斷除疑惑，成熟有情。",
        "translation": "It means that bodhisattvas thus think, \"After hearing that the Tathāgata knows the aspirations, various latencies, and various resolve of all sentient beings, he explains the teaching with a single voice, causes them to be disciplined, understands each according to its own intention, ends doubt, and matures sentient beings.",
        "source": "T16n0660_006:0307c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一有情如是思惟：「各謂如來獨為我故，演說妙法。」",
        "translation": "Each sentient being thus thinks, \"Each says that the Tathāgata explains the wonderful Dharma solely for my sake.\"",
        "source": "T16n0660_006:0307c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來於此實無分別——我為能說、有情為所化。",
        "translation": "The Tathāgata really doesn't discriminate between this - that I'm the speaker and sentient beings are the transformation.",
        "source": "T16n0660_006:0307c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟此真實，非為虛妄。』",
        "translation": "Only this is true, not false.'",
        "source": "T16n0660_006:0307c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩能於彼法之中得無猶豫，是名菩薩深信如來知有情意樂而調伏之。",
        "translation": "When a bodhisattva can attain no hesitation about those things, this is called a bodhisattva who is convinced that the Tathāgata knows the wishes of sentient beings and subdues them.",
        "source": "T16n0660_006:0307c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0660_006:0308a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，心無猶豫。",
        "translation": "When a bodhisattva accomplishes these ten things, his mind isn't hesitant.",
        "source": "T16n0660_006:0308a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0308a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得智如海。",
        "translation": "Bodhisattvas accomplish ten kinds of dharmas, and they attain wisdom like an ocean.",
        "source": "T16n0660_006:0308a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0308a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、得如寶所；二者、甚深難度；三者、廣大無量；四者、隨順漸深；五者、不與煩惱死尸同住；六者、皆同一味；七者、容受駛流；八者、潮不過時；九者、與大有情為所依止；十者、無有窮盡。",
        "translation": "1. it's attained like a jeweled place; 2. it's extremely deep and difficult to fathom; 3. it's vast and immeasurable; 4. it follows gradual depth; 5. it doesn't dwell with the corpses of affliction and death; 6. it's all the same flavor; 7. it's tolerated to flow; 8. it doesn't stop when the tide flows; 9. it's supported by a large group of sentient beings; and 10. it has no limit.",
        "source": "T16n0660_006:0308a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩得如寶所？",
        "translation": "\"How does a bodhisattva attain such a jeweled place?",
        "source": "T16n0660_006:0308a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海有諸寶所，贍部洲人皆來取寶，終無窮盡。",
        "translation": "\"It's like when there are places of treasure in the ocean, and people from all the continents come to get that treasure, which never ends.",
        "source": "T16n0660_006:0308a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，有功德寶所，一切有情取功德寶亦無窮盡。",
        "translation": "Thus, the bodhisattva has a place of treasures of merit, and all sentient beings take treasures of merit that also don't end.",
        "source": "T16n0660_006:0308a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩甚深難度？",
        "translation": "\"How are the bodhisattvas so profound and difficult to cross over?",
        "source": "T16n0660_006:0308a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海甚深難度。",
        "translation": "\"It's like an ocean that's too deep to cross.",
        "source": "T16n0660_006:0308a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，成就智慧甚深大海，一切有情無能越度。",
        "translation": "Thus, the bodhisattva has accomplished a profound ocean of wisdom that's impossible for all sentient beings to cross.",
        "source": "T16n0660_006:0308a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩廣大無量？",
        "translation": "\"How is the bodhisattva vast and immeasurable?",
        "source": "T16n0660_006:0308a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海周遍廣大。",
        "translation": "It's like an ocean that's vast and extensive.",
        "source": "T16n0660_006:0308a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，智慧之海廣大無邊。",
        "translation": "Thus, the bodhisattva's ocean of wisdom is vast and limitless.",
        "source": "T16n0660_006:0308a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩隨順漸深？",
        "translation": "\"How do bodhisattvas accord with gradual depth?",
        "source": "T16n0660_006:0308a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海隨順向下，漸低漸深。",
        "translation": "\"It's like the ocean that follows downward, gradually lowering and becoming deeper.",
        "source": "T16n0660_006:0308a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，一切智海隨順法性，漸低漸深。",
        "translation": "Thus, the bodhisattva follows the Dharma nature of the ocean of omniscience, gradually lowering and deepening it.",
        "source": "T16n0660_006:0308a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩不與煩惱死尸同住？",
        "translation": "\"How do bodhisattvas not live with the dead bodies of affliction?",
        "source": "T16n0660_006:0308a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海不宿死尸。",
        "translation": "\"It's like the ocean that doesn't harbor dead bodies.",
        "source": "T16n0660_006:0308a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0308a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以海性法爾故。",
        "translation": "\"It's because the nature of the ocean is so fundamental.",
        "source": "T16n0660_006:0308a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，不與煩惱死屍丈夫同處而住。",
        "translation": "Thus, a bodhisattva doesn't live in the same place as a corpse husband who's dead from affliction.",
        "source": "T16n0660_006:0308a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0308a20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩法如是故。",
        "translation": "It's because the bodhisattva's teaching is thus.",
        "source": "T16n0660_006:0308a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩皆同一味？",
        "translation": "\"How are the bodhisattvas all of the same flavor?",
        "source": "T16n0660_006:0308a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海，諸瀑流水澍入之者，一切皆同一醎味性。",
        "translation": "\"It's like the ocean, into which the water from cascading springs flows, and they all have the same olfactory quality.",
        "source": "T16n0660_006:0308a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，積集無量白淨之法至一切智，皆得同於一切智味。",
        "translation": "Thus, the bodhisattva accumulates measureless white pure dharmas up to omniscience, and they all attain the same taste as omniscience.",
        "source": "T16n0660_006:0308a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩容受駛流？",
        "translation": "\"How does the bodhisattva tolerate the flow of water?",
        "source": "T16n0660_006:0308a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海容受無量諸駛流水而無增減。",
        "translation": "It's like the ocean that tolerates measureless streams of water without increase or decrease.",
        "source": "T16n0660_006:0308a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，容受無量法雨駛流，無增無減。",
        "translation": "Thus, the bodhisattva tolerates a measureless amount of water carrying the Dharma rain without increase or decrease.",
        "source": "T16n0660_006:0308a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩潮不失時？",
        "translation": "\"How does a bodhisattva's tide not lose its moment?",
        "source": "T16n0660_006:0308a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海潮不失時。",
        "translation": "\"It's like the tide of a great ocean that doesn't lose its time.",
        "source": "T16n0660_006:0308a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，教化有情隨其根性，不失於時。",
        "translation": "Thus, the bodhisattva teaches sentient beings according to their faculties, without losing track of the time.",
        "source": "T16n0660_006:0308a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩與大有情為所依止？",
        "translation": "\"How do bodhisattvas and large sentient beings serve as supports?",
        "source": "T16n0660_006:0308a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海與大有情為所依止。",
        "translation": "\"It's like the ocean and the great sentient being that serve as its support.",
        "source": "T16n0660_006:0308a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，為一切有情諸白淨法之所依止。",
        "translation": "Thus, the bodhisattva is the support for the white pure dharmas of all sentient beings.",
        "source": "T16n0660_006:0308b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何菩薩得無窮盡？",
        "translation": "\"How does a bodhisattva attain infinity?",
        "source": "T16n0660_006:0308b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如大海為一切有情汲引，其水無有窮盡。",
        "translation": "\"It's like the ocean that draws all sentient beings into its water, and its water has no limit.",
        "source": "T16n0660_006:0308b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是，為諸有情種種說法無有窮盡。",
        "translation": "Thus, the bodhisattvas explain the various teachings for sentient beings, and there's no limit to the number of teachings.",
        "source": "T16n0660_006:0308b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0660_006:0308b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得智如海。",
        "translation": "When a bodhisattva accomplishes these ten things, he attains wisdom like an ocean.",
        "source": "T16n0660_006:0308b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0308b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得微妙智善巧。",
        "translation": "Bodhisattvas accomplish ten kinds of things and attain subtle knowledge and skill.",
        "source": "T16n0660_006:0308b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0308b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、得希求出離善巧；二者、得通達一切法善巧；三者、得悟入一切法平等善巧；四者、得悟入一切法幻相善巧；五者、得遍知一切法善巧；六者、得緣起甚深難度善巧；七者、得業不思議善巧；八者、得了知隨所說義善巧；九者、得證知如實義善巧；十者、得真實善巧。",
        "translation": "1. skillfulness in seeking escape; 2. skillfulness in comprehending all things; 3. skillfulness in realizing the equality of all things; 4. skillfulness in realizing the illusory aspects of all things; 5. skillfulness in fully knowing all things; 6. skillfulness in understanding the profundity and difficulty of dependent arising; 7. skillfulness in inconceivable activity; 8. skillfulness in understanding the meaning of whatever is explained; 9. skillfulness in realizing the true meaning; and 10. skillfulness in realizing the truth.",
        "source": "T16n0660_006:0308b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0660_006:0308b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩得希求出離善巧，乃至云何得真實善巧？",
        "translation": "How do bodhisattvas attain the skillful means of seeking emancipation, and how do they attain the skillful means of being genuine?",
        "source": "T16n0660_006:0308b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此菩薩觀察如是一切有情處於世間，常為貪欲之所燒然、瞋恚之所昏繞、愚癡黑暗之所盲冥，菩薩作是思惟：『此諸有情云何能得出離善巧？』",
        "translation": "When this bodhisattva observes all these sentient beings in the world, which are constantly burned by desire, beset by anger, and blinded by the darkness of ignorance, the bodhisattva thinks, 'How can these sentient beings attain freedom from skillful means?'",
        "source": "T16n0660_006:0308b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩為彼，希求通達諸法。",
        "translation": "For these reasons, bodhisattvas want to understand all dharmas.",
        "source": "T16n0660_006:0308b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以通達故，悟入一切諸法平等；以悟入故，了知虛幻之相；以了知故，如實遍知一切諸法；以遍知故，隨順思惟甚深緣起；以思惟故，隨順觀業不思議性。",
        "translation": "Because of that penetration, they realize the equality of all things; because of that realization, they understand illusory appearances; because of that knowledge, they truly know all things; because of that universal knowledge, they conform to the contemplation of profound dependency; and because of that contemplation, they conform to the contemplation of the inconceivable nature of actions.",
        "source": "T16n0660_006:0308b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作如是觀：『一切法中都無有實，而業有種種異。』",
        "translation": "The bodhisattva thus observes, 'All things lack reality, but actions are variously different.'",
        "source": "T16n0660_006:0308b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是菩薩即能悟入微妙智慧，而於諸佛及菩薩所聞說法要，即了其義；以了義故，得見真實；見真實故，於生死海中度脫有情。",
        "translation": "Because of this, the bodhisattva is able to awaken to subtle wisdom and immediately understand the meaning of the teachings heard from the buddhas and bodhisattvas; because he understands their meaning, he attains a vision of reality; and because he sees reality, he liberates sentient beings in the ocean of birth-and-death.",
        "source": "T16n0660_006:0308b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩得希求出離善巧，乃至得真實善巧。",
        "translation": "This is called a bodhisattva attaining the skillful means of seeking escape, up to the skillful means of attaining the truth.",
        "source": "T16n0660_006:0308b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得微妙智。",
        "translation": "Accomplishing these ten things, a bodhisattva attains subtle knowledge.",
        "source": "T16n0660_006:0308b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0308b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得應辯才。",
        "translation": "Bodhisattvas achieve ten kinds of abilities that are responsive to discernment.",
        "source": "T16n0660_006:0308b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0308b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、於諸法中施設無我；二者、無有情；三者、無命者；四者、無養育者；五者、無補特伽羅；六者、遠離作者、受者；七者、遠離知者、見者；八者、空無所有、無主；九者、虛妄分別空；十者、一切諸法施設緣生。",
        "translation": "1. it's assumed that there's no self in all dharmas; 2. there are no sentient beings; 3. there are no living beings; 4. there are no nurturers; 5. there's no person in the pantheon; 6. they're free of authors and recipients; 7. they're free of knowers and viewers; 8. they're empty of existence and have no owner; 9. they're falsely discriminated into emptiness; and 10. all dharmas are conditioned by definition to arise.",
        "source": "T16n0660_006:0308b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切諸法無我、無有情、無命者、無養育者、無補特伽羅，遠離作者、受者，遠離知見者，空無所有、無主，虛妄分別從緣所生，如是此應隨順法性。",
        "translation": "Because all things lack self, lack sentient beings, lack life, lack nurturers, and lack pudgala, are free of author and recipient, and are free of knower and viewer, are empty of existence and lack owner, and false discrimination arises from conditions, such should be the nature of the Dharma that's followed.",
        "source": "T16n0660_006:0308c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有應隨順法性、不相違法性、相應法性、悟入法性、明了法性，如是法性菩薩摩訶薩皆應遍知，是名應辯。",
        "translation": "\"All things that should be conformed to the nature of reality, are not mutually exclusive, are associated with the nature of reality, are awakened to the nature of reality, and are clearly understood as such, the bodhisattva-mahāsattva should know them all, and this is called articulation.",
        "source": "T16n0660_006:0308c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得應辯才。",
        "translation": "Accomplishing these ten things, a bodhisattva attains the ability to respond eloquently.",
        "source": "T16n0660_006:0308c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0308c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得解脫辯。",
        "translation": "There are ten kinds of things that bodhisattvas accomplish to attain the eloquence of liberation.",
        "source": "T16n0660_006:0308c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0308c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、得無著辯；二者得無盡辯；三者、得覺悟辯；四者、得不怯弱辯；五者、得謙卑辯；六者、得無畏辯；七者、得不共辯；八者、得無蔽辯；九者、得無邊辯；十者、得無礙辯。",
        "translation": "1) to attain unattached discernment; 2) to attain inexhaustible discernment; 3) to attain awakened discernment; 4) to attain unintimidated discernment; 5) to attain humble discernment; 6) to attain fearless discernment; 7) to attain uncommon discernment; 8) to attain unobstructed discernment; 9) to attain limitless discernment; 10) to attain unobstructed discernment.",
        "source": "T16n0660_006:0308c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩成就此十種法，得解脫辯才。",
        "translation": "Accomplishing these ten things, the bodhisattva-mahāsattva attains the eloquence of liberation.",
        "source": "T16n0660_006:0308c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0308c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得清淨辯才。",
        "translation": "Bodhisattvas accomplish ten kinds of qualities and attain pure eloquence.",
        "source": "T16n0660_006:0308c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0308c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、得無[斯/瓦]嗄辯；二者、得不雜亂辯；三者、得不下劣辯；四者、得不倨傲辯；五者、得義不退失辯；六者、得文字不下劣辯；七者、得方便不下劣辯；八者、得時不下劣辯；九者、得不麁獷辯；十者、得明了辯。",
        "translation": "1. they attain eloquence without [s/w]; 2. they attain eloquence without confusion; 3. they attain eloquence without inferiority; 4. they attain eloquence without arrogance; 5. they attain eloquence without loss of meaning; 6. they attain eloquence without inferiority in words; 7. they attain eloquence without inferiority in skillful means; 8. they attain eloquence without inferiority in time; 9. they attain eloquence without crudity; 10. they attain eloquence with clarity.",
        "source": "T16n0660_006:0308c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0660_006:0308c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩於眾會中遠離怖畏故，得無[斯/瓦]嗄辯才。",
        "translation": "Because he's free of fear in this assembly, the bodhisattva Mahāsattva attains the eloquence of no [s/w] ga.",
        "source": "T16n0660_006:0308c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安住智慧故，得不雜亂辯才。",
        "translation": "Because they abide in wisdom, they attain the eloquence of unconfused eloquence.",
        "source": "T16n0660_006:0308c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於眾會中無所畏故，如師子王不驚不怖，得不下劣辯才。",
        "translation": "Because the bodhisattva has no fear in the assembly, he's like a lion king who isn't frightened or terrified and attains the eloquence of not being inferior.",
        "source": "T16n0660_006:0308c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無煩惱故，得不倨傲辯才。",
        "translation": "Because he has no afflictions, he attains the eloquence of not being arrogant.",
        "source": "T16n0660_006:0308c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有煩惱者即有倨傲，非無煩惱有倨傲也。",
        "translation": "\"When there's affliction, there's arrogance, not arrogance without affliction.",
        "source": "T16n0660_006:0308c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證法性故，得於義不退失辯才。",
        "translation": "Because they've realized the nature of the teaching, they'll attain the eloquence that doesn't lose its meaning.",
        "source": "T16n0660_006:0308c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0308c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未證法者於義有失，非已得者有退失也。",
        "translation": "Those who haven't yet realized the teaching have a loss of meaning, and those who haven't attained it have a loss of retrogression.",
        "source": "T16n0660_006:0308c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切言論無所畏故，得文字不下劣辯才。",
        "translation": "Because they have no fear in all discourse, they attain the eloquence of words that are not inferior.",
        "source": "T16n0660_006:0309a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知少分論者，而於文字即有退失，非知一切論者名下劣也。",
        "translation": "Someone who knows a little bit of the treatises and falls back on the words is called inferior, even though they don't know all the treatises.",
        "source": "T16n0660_006:0309a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "積集諸方便故，得方便不下劣辯才。",
        "translation": "Because he has accumulated skillful means, he attains skillful means and doesn't have inferior eloquence.",
        "source": "T16n0660_006:0309a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無善巧者而於方便即有退失，有善巧者無下劣也。",
        "translation": "Someone who lacks skillful means will fall back, but someone with skillful means won't be inferior.",
        "source": "T16n0660_006:0309a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩知長時、知應時、知初中後時，非先說後，非後說先，應時而說故，得時不下劣辯才。",
        "translation": "The bodhisattva Mahāsattva knows the long time, knows the appropriate time, and knows the middle and last times, not when he speaks first and not when he speaks last, and because he speaks according to the time, he attains the eloquence of not being inferior at the time.",
        "source": "T16n0660_006:0309a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "永離語言戲論故，得無麁獷辯才。",
        "translation": "Because they are forever free of verbal conceptual elaborations, they attain the eloquence of no harshness.",
        "source": "T16n0660_006:0309a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以有戲論名為麁獷，無戲論者非麁獷也。",
        "translation": "It's called coarse because of conceptual proliferation, but it's not coarse if there's no conceptual proliferation.",
        "source": "T16n0660_006:0309a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309a10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩諸根聰利故，得明了辯才。",
        "translation": "\"The bodhisattva Mahāsattva's faculties are sharp, so he attains insight and eloquence.",
        "source": "T16n0660_006:0309a10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根鈍者，即不明了；非根利者，不明了也。",
        "translation": "Those whose faculties are dull don't understand it, and those whose faculties aren't sharp don't understand it.",
        "source": "T16n0660_006:0309a11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309a12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得清淨辯才。",
        "translation": "Accomplishing these ten things, a bodhisattva attains pure eloquence.",
        "source": "T16n0660_006:0309a12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0309a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得一切眾生歡喜滿足。",
        "translation": "Bodhisattvas achieve ten kinds of qualities that make all sentient beings happy and fulfilled.",
        "source": "T16n0660_006:0309a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0309a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、得可愛語；二者、面門微笑，遠離顰蹙；三者、能演說義；四者、能演說法；五者、能平等說；六者、無有貢高；七者、遠離輕賤；八者、無染；九者、不瞋；十者、得種種辯才。",
        "translation": "1. attains agreeable speech; 2. smiles from ear to ear and avoids knitting the brows; 3. is able to expound meaning; 4. is able to expound the Dharma; 5. is able to speak equally; 6. has no pride; 7. is free from contempt; 8. is without defilement; 9. doesn't hold grudges; 10. has attained various kinds of eloquence.",
        "source": "T16n0660_006:0309a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何得愛語？",
        "translation": "How do we get to love words?",
        "source": "T16n0660_006:0309a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩言辭能令有情心喜悅故。",
        "translation": "A bodhisattva's words can cause sentient beings to rejoice in their hearts.",
        "source": "T16n0660_006:0309a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何面門微笑？",
        "translation": "How does smiling with one's face open make them happy?",
        "source": "T16n0660_006:0309a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩和顏安慰，能令有情得安隱故。",
        "translation": "A bodhisattva's pleasant countenance comforts sentient beings because it helps them attain peace.",
        "source": "T16n0660_006:0309a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何能演說義？",
        "translation": "How can they explain the meaning?",
        "source": "T16n0660_006:0309a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩言辭應量說故。",
        "translation": "A bodhisattva's words are measurable because they're explained.",
        "source": "T16n0660_006:0309a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何能演說法？",
        "translation": "How can they expound the Dharma?",
        "source": "T16n0660_006:0309a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩凡所演說饒益有情故。",
        "translation": "It's because whatever the bodhisattva teaches benefits sentient beings.",
        "source": "T16n0660_006:0309a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何平等說？",
        "translation": "How is it explained equally?",
        "source": "T16n0660_006:0309a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩恒以等心授有情法故。",
        "translation": "\"It's because bodhisattvas are always teaching the Dharma to sentient beings with equal intentions.",
        "source": "T16n0660_006:0309a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無有貢高？",
        "translation": "How is there no pride?",
        "source": "T16n0660_006:0309a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩遠離我慢、憍逸，同類性故。",
        "translation": "Bodhisattvas are free of self-conceit and pride, because of their similar nature.",
        "source": "T16n0660_006:0309a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何遠離輕賤？",
        "translation": "How are they free from despising others?",
        "source": "T16n0660_006:0309a25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩說法，尊重法故。",
        "translation": "A bodhisattva preaches the Dharma because he respects the Dharma.",
        "source": "T16n0660_006:0309a25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無染？",
        "translation": "How is it undefiled?",
        "source": "T16n0660_006:0309a26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩尸羅極清淨故。",
        "translation": "\"It's because the bodhisattva śīla is extremely pure.",
        "source": "T16n0660_006:0309a26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不瞋？",
        "translation": "Why isn't there anger?",
        "source": "T16n0660_006:0309a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩性能行忍辱故。",
        "translation": "\"It's because bodhisattvas practice forbearance.",
        "source": "T16n0660_006:0309a27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何得種種辯才？",
        "translation": "How do they attain various kinds of eloquence?",
        "source": "T16n0660_006:0309a27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩言辭美妙，悅眾生故。",
        "translation": "Bodhisattvas speak beautifully, so they please sentient beings.",
        "source": "T16n0660_006:0309a27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309a28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，能令有情歡喜滿足。",
        "translation": "These ten kinds of accomplishment by a bodhisattva can cause sentient beings to rejoice and be satisfied.",
        "source": "T16n0660_006:0309a28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0309b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，能令有情領受所說。",
        "translation": "There are ten kinds of things that bodhisattvas accomplish that enable sentient beings to receive what's taught.",
        "source": "T16n0660_006:0309b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0309b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、不為非器者說法；二、不為瞋害者說法；三、不為增上慢者說法；四、不為外道說法；五、不為不生尊重者說法；六、不為無淨信者說法；七、不為諂誑者說法；八、不為愛樂活命者說法；九、不為規求利養、得他尊重、嫉妬、慳悋所纏者說法；十、不為頑鈍、瘖啞者說法。",
        "translation": "1. don't teach for those who aren't worthy; 2. don't teach for those who are hateful; 3. don't teach for those who are arrogant; 4. don't teach for non-Buddhists; 5. don't teach for those who don't have respect; 6. don't teach for those without pure faith; 7. don't teach for those who flatter; 8. don't teach for those who enjoy living; 9. don't teach for those who seek profit, gain the respect of others, are jealous, or are tethered by parsimony; 10. don't teach for the dull and dumb.",
        "source": "T16n0660_006:0309b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0309b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩不以慳悋法故，而不為說；亦不為師，奉祕而不說；亦不為有情輕於我故，亦不為棄捨法故，但以非法器故而不為說。」",
        "translation": "The bodhisattva Mahāsattva doesn't explain the teaching because he's stingy with the Dharma, doesn't serve as a teacher who keeps it secret but doesn't explain it, doesn't despise sentient beings because they despise themselves, and doesn't discard the Dharma because it's not a vessel for the Dharma.\"",
        "source": "T16n0660_006:0309b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0309b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等有情，諸佛菩薩為之說法？」",
        "translation": "What kinds of sentient beings do buddhas and bodhisattvas teach for?\"",
        "source": "T16n0660_006:0309b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0309b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸有情具足信根，成熟法器，承事諸佛，心無諂曲，亦無虛誑，威儀無詐，不貪利養，意樂具足，為善丈夫，聞法覺悟，善能開曉，聰慧利根，隨所說義即能了知，為得法故，勤修精進，順如來法依教修行。",
        "translation": "If sentient beings possess the faculty of faith, have matured the Dharma vessel, serve the buddhas, have hearts that aren't flattering and deceptive, have respectful manners that aren't deceptive, don't crave gain, and have fulfilled intentions, they're good sentient beings who hear the teaching and awaken, are well able to understand it, are intelligent and have sharp faculties, understand the meaning according to what's being taught, diligently cultivate and exert themselves in order to attain the teaching, and follow the Tathāgata's teaching in its cultivation.",
        "source": "T16n0660_006:0309b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是種類諸有情等，佛及菩薩為之演說。",
        "translation": "Such are the kinds of sentient beings and so forth for whom the Buddha and the bodhisattvas preach.",
        "source": "T16n0660_006:0309b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，即能領受所說之法。",
        "translation": "When a bodhisattva accomplishes these ten things, he'll be able to comprehend the teaching.",
        "source": "T16n0660_006:0309b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0309b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，能為說法之師。",
        "translation": "A bodhisattva has accomplished ten kinds of teaching that make him a teacher who can explain the teaching.",
        "source": "T16n0660_006:0309b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0309b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、為積集佛法故能演說法，然佛法不可得，積集亦不可得；二者、為積集諸波羅蜜多故演說法，波羅蜜多不可得，積集亦不可得；三者、為積集菩提故演說法，然菩提不可得，積集亦不可得；四者、為斷煩惱故演說法，然煩惱不可得，斷亦不可得；五者、為厭貪、離貪、滅貪故演說法，然厭、離、滅及貪俱不可得；六者、為得預流、一來、不還向果故演說法，然預流、一來、不還向果俱不可得；七者、為得阿羅漢向、果故演說法，然阿羅漢向、果俱不可得；八者、為得緣覺向、緣覺果故演說法，然緣覺向、果俱不可得；九者、為永斷執著我故演說法，然我與執著俱不可得，十者、為顯示業及異熟故演說法，而業及異熟俱不可得。",
        "translation": "一者、為積集佛法故能演說法，然佛法不可得，積集亦不可得；二者、為積集諸波羅蜜多故演說法，波羅蜜多不可得，積集亦不可得；三者、為積集菩提故演說法，然菩提不可得，積集亦不可得；四者、為斷煩惱故演說法，然煩惱不可得，斷亦不可得；五者、為厭貪、離貪、滅貪故演說法，然厭、離、滅及貪俱不可得；六者、為得預流、一來、不還向果故演說法，然預流、一來、不還向果俱不可得；七者、為得阿羅漢向、果故演說法，然阿羅漢向、果俱不可得；八者、為得緣覺向、緣覺果故演說法，然緣覺向、果俱不可得；九者、為永斷執著我故演說法，然我與執著俱不可得，十者、為顯示業及異熟故演說法，而業及異熟俱不可得。",
        "source": "T16n0660_006:0309b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0309c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩作是思惟：『由彼名字故說有法，其所說法本不可得。』",
        "translation": "Those bodhisattvas thus think, 'It's because of their names that they say there are dharmas, and the dharmas they teach are inherently unobtainable.'",
        "source": "T16n0660_006:0309c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0309c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法非文字，文字非法，但於俗諦法中順世俗故，於無名法中施設其名。",
        "translation": "\"Dharmas are not words, and words are not things, but in the conventional truth, they conform to conventionality and give names to things that have no names.",
        "source": "T16n0660_006:0309c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝義諦中無有名字，但是虛妄施設、假立作其名字，誘引愚夫故作是說。",
        "translation": "In the ultimate truth, there are no names, but they are falsely designated and falsely established as names, which entices foolish people to say that.",
        "source": "T16n0660_006:0309c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法故，能為說法師。",
        "translation": "Because the bodhisattva has accomplished these ten things, he can be a Dharma preacher.",
        "source": "T16n0660_006:0309c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0309c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得隨法性行。",
        "translation": "Bodhisattvas accomplish ten kinds of dharmas, which allow them to practice according to the nature of the Dharma.",
        "source": "T16n0660_006:0309c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0309c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、菩薩隨法性行，不離於色亦不離受、想、行、識；二者、隨法性行，不離欲界；三者、隨法性行，不離色界；四者、隨法性行，不離無色界；五者、隨法性行，不捨於法；六者、隨法性行，不執著於法；七者、隨法性行而不捨於有情；八者、隨法性行而不行於斷見；九者、隨法性行而不行於常見；十者、隨法性行而不捨於正道。",
        "translation": "1. a bodhisattva's practice according to the nature of the Dharma doesn't part from form and doesn't part from feeling, perception, volition, and consciousness; 2. his practice according to the nature of the Dharma doesn't part from the desire realm; 3. his practice according to the nature of the Dharma doesn't part from the form realm; 4. his practice according to the nature of the Dharma doesn't part from the formless realm; 5. his practice according to the nature of the Dharma doesn't abandon the Dharma; 6. his practice according to the nature of the Dharma doesn't cling to the Dharma; 7. his practice according to the nature of the Dharma doesn't abandon sentient beings; 8. his practice according to the nature of the Dharma doesn't lead to nihilism; 9. his practice according to the nature of the Dharma doesn't lead to common sense; 10. his practice according to the nature of the Dharma doesn't abandon the right path.",
        "source": "T16n0660_006:0309c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0309c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就般若方便善巧故，雖隨順法性，然於色等不捨、不著亦不行。",
        "translation": "Although a bodhisattva accomplishes the skillful means of prajñā, even though he follows the nature of things, he doesn't abandon or attach to form and so forth.",
        "source": "T16n0660_006:0309c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0309c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得隨法性行。",
        "translation": "Accomplishing these ten qualities, a bodhisattva attains the ability to practice according to the nature of the Dharma.",
        "source": "T16n0660_006:0309c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0309c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就十種法，得法界善巧。",
        "translation": "Bodhisattvas accomplish ten kinds of qualities that make them adept in the Dharma realm.",
        "source": "T16n0660_006:0309c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T16n0660_006:0309c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、有智慧；二者、攝取善知識；三者、勤行精進；四者、離一切障；五者、極清淨；六者、尊重教誡；七者、多修空性；八者、離諸慢見；九者、向於道；十者、見真實義。",
        "translation": "One has wisdom; two, gathers good teachers; three, conducts himself diligently; four, is free of all hindrances; five, is extremely pure; six, respects instruction; seven, cultivates emptiness; eight, is free of conceited views; nine, is headed for the path; and ten, sees the true meaning.",
        "source": "T16n0660_006:0309c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T16n0660_006:0309c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩有智慧者，求善知識。",
        "translation": "\"When a bodhisattva has wisdom, he seeks a good teacher.",
        "source": "T16n0660_006:0309c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見善知識故，得歡喜悅樂。",
        "translation": "Because they see a good teacher, they attain joy and happiness.",
        "source": "T16n0660_006:0309c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善知識生如佛想，依止彼住。",
        "translation": "They give rise to the perception of a good teacher as a buddha, and they abide in reliance on him.",
        "source": "T16n0660_006:0310a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依止彼故，得勤行精進，永斷一切不善法，圓滿一切善法。",
        "translation": "Because they rely on them, they attain diligent effort, permanently ending all unskillful qualities and perfecting all good qualities.",
        "source": "T16n0660_006:0310a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以勤修精進故，滅除一切障，得無障礙，開示正道，遠離身、口、意麁重。",
        "translation": "Because they diligently cultivate exertion, they eliminate all hindrances, become unobstructed, reveal the right path, and become free of debilitating physical, verbal, and mental hindrances.",
        "source": "T16n0660_006:0310a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由離障故，得最極清淨。",
        "translation": "Because they're free of hindrances, they attain the utmost purity.",
        "source": "T16n0660_006:0310a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既清淨已，得尊重教誡。",
        "translation": "Once they're purified, they'll attain respect for the instructions.",
        "source": "T16n0660_006:0310a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得教誡已，能多修行空性。",
        "translation": "After attaining admonition, they'll be able to often practice emptiness.",
        "source": "T16n0660_006:0310a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行空已，即得遠離慠慢之見。",
        "translation": "After cultivating emptiness, they can then become free of the view of arrogance.",
        "source": "T16n0660_006:0310a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離慠慢見已，得向正道。",
        "translation": "After being free of the view of arrogance, they can then head for the right path.",
        "source": "T16n0660_006:0310a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩得住道已，見於真義。」",
        "translation": "After attaining abiding on the path, the bodhisattva sees its true meaning.\"",
        "source": "T16n0660_006:0310a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "The Zhigai Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T16n0660_006:0310a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名真義？」",
        "translation": "What is the true meaning of the term?\"",
        "source": "T16n0660_006:0310a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0310a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真義者即是實義增語。」",
        "translation": "'True meaning is the true meaning of increased speech.'\"",
        "source": "T16n0660_006:0310a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0310a09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名實義？」",
        "translation": "What is the real meaning of the term?\"",
        "source": "T16n0660_006:0310a10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0310a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂不虛妄是實義。」",
        "translation": "What's called not false is the real meaning.\"",
        "source": "T16n0660_006:0310a11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0310a11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名不虛妄？」",
        "translation": "What is the term not false?\"",
        "source": "T16n0660_006:0310a12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0310a12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂真如是不虛妄，無別異也！」",
        "translation": "What is called true is not false and has no distinctions!\"",
        "source": "T16n0660_006:0310a12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0310a13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂真如？」",
        "translation": "What is true thusness?\"",
        "source": "T16n0660_006:0310a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0310a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法自內所證，非有文字能施設之。",
        "translation": "This is a teaching that's realized within oneself and can't be defined by words.",
        "source": "T16n0660_006:0310a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0310a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法超過一切文字、言說及戲論故，離諸入出，無有計度，非計所行，無相離相，非諸愚夫所行之處，遠離一切諸魔境界及以一切煩惱境界，非識所行，住無所住，自性寂靜，超過眾聖智之所入。",
        "translation": "This teaching transcends all words, speech, and conceptual proliferation, is free of entry and exit, has no calculation, is not measured, has no marks and parts with marks, is not where foolish people go, is free of all the realms of Māra and all the realms of affliction, is not formulated by consciousness, abides in nothing, and has a quiescent self-nature that transcends the entry of all noble cognitions.",
        "source": "T16n0660_006:0310a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣自內所證，無垢無染，清淨微妙，最上無比，恒常不動，性不滅壞。",
        "translation": "Because of this cause and condition, what he personally realizes is unsullied, undefiled, pure, and subtle, unsurpassed, permanent, and unmoving, and whose nature doesn't cease and despoil.",
        "source": "T16n0660_006:0310a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸如來出現於世、若不出世，如是法界自性常住。",
        "translation": "If tathāgatas appear in the world or don't appear in the world, the self-nature of the Dharma realm thus abides forever.",
        "source": "T16n0660_006:0310a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為利益故，是諸菩薩勇猛修行無量苦行，證此法性。",
        "translation": "For the sake of their benefit, these bodhisattvas courageously cultivate measureless ascetic practices to realize this Dharma nature.",
        "source": "T16n0660_006:0310a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得法性已，安置有情住如是法。",
        "translation": "After attaining the Dharma nature, they place sentient beings in such a state of abiding.",
        "source": "T16n0660_006:0310a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為真如，亦名實際；名一切智，亦名一切種智；名不思議界，亦名不二界。」",
        "translation": "Thus, it's called true thusness and also called reality, it's called omniscience and also omniscient, and it's called the inconceivable realm and also the nondual realm.\"",
        "source": "T16n0660_006:0310a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0310a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於此法中現證？",
        "translation": "How is it manifestly realized in this teaching?",
        "source": "T16n0660_006:0310a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何自內所證？」",
        "translation": "What is realized within oneself?\"",
        "source": "T16n0660_006:0310a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0310a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應以出世間般若自內所證。」",
        "translation": "It should be realized internally by means of supramundane wisdom.\"",
        "source": "T16n0660_006:0310a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0310a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是者，般若現證即是自內證耶？」",
        "translation": "If this is the case, then is the direct realization of wisdom the internal realization?\"",
        "source": "T16n0660_006:0310a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不也。",
        "translation": "The Buddha said, \"No.",
        "source": "T16n0660_006:0310b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若如實觀見法，身為內證也！」",
        "translation": "Prajñārucian truth is seen as a dharma, and the body is the internal witness!\"",
        "source": "T16n0660_006:0310b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0310b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以聞所成慧、思所成慧如是證法，為內證乎？」",
        "translation": "If this is the internal realization of the wisdom attained by hearing and the wisdom attained by thinking, is it an internal realization?\"",
        "source": "T16n0660_006:0310b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不也！",
        "translation": "The Buddha said, \"No!",
        "source": "T16n0660_006:0310b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "終不但以聞所成慧、思所成慧為內證也！",
        "translation": "Ultimately, not only is the wisdom attained by hearing and the wisdom attained by contemplating taken as internal realization!",
        "source": "T16n0660_006:0310b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣我當為汝說於譬喻。",
        "translation": "For this reason, I will explain this metaphor for you.",
        "source": "T16n0660_006:0310b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬若有人熱際之餘在於曠野，從東方來將詣西方。",
        "translation": "It's like a person who's in the wilderness at the end of a hot spell and comes from the east and goes to the west.",
        "source": "T16n0660_006:0310b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一人從西方來往於東方，其人熱乏，為渴所逼，語東方人言：『我今熱乏，為渴所逼，請示我路。",
        "translation": "Another person comes from the west and goes east, and they're hot and weary and are overcome by thirst. They say to someone in the east, 'Now that I'm hot and weary and I'm overcome by thirst, show me the way.",
        "source": "T16n0660_006:0310b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何處應有泉林、池沼清淨冷水？",
        "translation": "Where should there be a spring, a forest, or a pond with pure, cold water?'",
        "source": "T16n0660_006:0310b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若得之，熱惱、渴乏皆得止息。』",
        "translation": "If I were to obtain it, my fever and thirst would be quelled.'",
        "source": "T16n0660_006:0310b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從東來人語西來者，作如是言：『我諳道路，知有水處，我經甞飲。",
        "translation": "The person from the east says to the person from the west, 'I know the way and know where there's water that I've used to drink.",
        "source": "T16n0660_006:0310b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是東行去此不遠，便有二道，應捨左路，趣於右道。",
        "translation": "If you go east from here, there are two paths not far from here, so you should abandon the left path and go to the right path.",
        "source": "T16n0660_006:0310b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見青山，彼有林泉、清淨冷水能解渴乏。",
        "translation": "If you see a green hill, there's a forest spring there with pure, cold water that quenches your thirst.",
        "source": "T16n0660_006:0310b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可往彼，必得捨除熱渴之患！』",
        "translation": "Go there, and you'll surely escape the pain of thirst!'",
        "source": "T16n0660_006:0310b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何，彼熱渴人唯聞水名，但思水事，即得除其熱渴患不？」",
        "translation": "What do you think, will that person with burning thirst simply hear the name water and think about water, and that will remove their burning thirst?\"",
        "source": "T16n0660_006:0310b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「世尊！",
        "translation": "Zhigai addressed the Buddha, saying, \"Bhagavān!",
        "source": "T16n0660_006:0310b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼熱渴人要當內證清涼之水，然後除其熱渴之患。」",
        "translation": "That person with feverish thirst must realize cool, clear water on the inside, and then he'll be relieved of the pain of fever and thirst.\"",
        "source": "T16n0660_006:0310b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310b18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，如是！",
        "translation": "So it is, so it is!",
        "source": "T16n0660_006:0310b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但聞、思即能證得自內所證真如之法。",
        "translation": "It's not just hearing and thinking that enables them to realize the true reality that they themselves have realized.",
        "source": "T16n0660_006:0310b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言曠野者，即是生死；言熱渴者，即是一切有情於境界中，為煩惱熱之所渴乏；示道路者，即是諸佛、菩薩善知識也；經自甞飲者，即是善巧；能知一切智道，自內所證勝法性也。",
        "translation": "He who speaks of the wilderness is born and died; he who speaks of thirst is all sentient beings in the objective realm who are thirsty for the heat of affliction; he who shows the way is the good teachers of the buddhas and bodhisattvas; and he who tastes the sūtras himself is adept, able to know all the paths of cognition and the superior Dharma nature that he personally realizes.",
        "source": "T16n0660_006:0310b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T16n0660_006:0310b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今更說譬喻曉悟於汝。",
        "translation": "Now, I'll explain another parable to enlighten you.",
        "source": "T16n0660_006:0310b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使如來住世一劫，為贍部洲人讚歎諸天所食甘露，色香美味，清淨微妙，若觸彼時，受其安樂。",
        "translation": "Suppose the Tathāgata lived in the world for an eon and praised for the people of Jambudvīpa the sweet nectar that the gods eat, which has a delicious, pure, and sublime flavor, and when they touch it, they experience its well-being.",
        "source": "T16n0660_006:0310b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何，然彼有情聞是語已，即得如是自內所證甘露味不？」",
        "translation": "What do you think, then, when sentient beings hear this, will they attain the taste of the nectar that they personally realize?\"",
        "source": "T16n0660_006:0310b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止蓋菩薩白佛言：「不也。",
        "translation": "Zhigai said to the Buddha, \"No.",
        "source": "T16n0660_006:0310b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0660_006:0310b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人雖聞佛說甘露，終不能得甘露之味！」",
        "translation": "Even though they hear the Buddha teach the taste of ambrosia, they still can't get the taste of ambrosia!\"",
        "source": "T16n0660_006:0310b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0310c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於此喻應如是知，非唯聞、思即能得彼自內所證。",
        "translation": "You should thus know this metaphor, for it's not something that can be personally realized simply by hearing and thinking about it.",
        "source": "T16n0660_006:0310c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人食美果已，於未食人前讚歎其果香味具足。",
        "translation": "It's like a person who eats a beautiful fruit and praises it as having a full flavor in front of someone who hasn't eaten it yet.",
        "source": "T16n0660_006:0310c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何，彼未食人能得內證知其味不？」",
        "translation": "What do you think? Can someone who hasn't eaten it yet internally realize its flavor?\"",
        "source": "T16n0660_006:0310c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不也。",
        "translation": "\"No.",
        "source": "T16n0660_006:0310c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T16n0660_006:0310c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T16n0660_006:0310c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼亦如是。",
        "translation": "They are likewise.",
        "source": "T16n0660_006:0310c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於此喻應如是知，非唯聞、思即能證得自內所證。」",
        "translation": "You should thus know from this metaphor that it's not something you can personally realize merely by hearing and thinking about it.\"",
        "source": "T16n0660_006:0310c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是說已，止蓋菩薩白佛言：「世尊！",
        "translation": "After speaking thus, the Zhigai Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T16n0660_006:0310c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚為希有！",
        "translation": "How rare!",
        "source": "T16n0660_006:0310c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來今者善能為我說斯法要。",
        "translation": "\"Now, the Tathāgata is well-positioned to explain this essentials of the Dharma for me.",
        "source": "T16n0660_006:0310c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有得聞如是法門，應當證得。",
        "translation": "If anyone hears such a teaching, they will surely realize it.",
        "source": "T16n0660_006:0310c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0660_006:0310c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0660_006:0310c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子得此法因，決定當得此法性故。」",
        "translation": "Because that good man has obtained this cause of the teaching, he's certain to attain this nature of the teaching.\"",
        "source": "T16n0660_006:0310c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是，如是！",
        "translation": "The Buddha said, \"So it is, so it is!",
        "source": "T16n0660_006:0310c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既知因已，當得此法。",
        "translation": "Once you know the cause, you'll then attain this teaching.",
        "source": "T16n0660_006:0310c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0660_006:0310c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就此十種法，得法界善巧。",
        "translation": "When a bodhisattva accomplishes these ten kinds of teaching, he attains skillfulness in the Dharma realm.",
        "source": "T16n0660_006:0310c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說寶雨經卷第六",
        "translation": "Foshuo baoyu jing, vol. 6",
        "source": "T16n0660_006:0310c13_0",
        "is_bad_quality": false
    }
]