[
    {
        "source_sentence": "大乘百福莊嚴相經",
        "translation": "Dasheng bai fuxu zhuangyanxiang jing",
        "source": "T16n0662_001:0330c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐天竺三藏地婆訶羅再譯",
        "translation": "Dīpaṃkara Translation of the Tripiṭaka of the Tang Dynasty",
        "source": "T16n0662_001:0330c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時婆伽婆在舍衛大城普妙宮殿，為欲化導無量眾生，坐寶莊嚴師子之座，與大比丘等千二百五十人俱，菩薩摩訶薩無央數眾，皆共恭敬周匝圍繞，瞻仰世尊身心不動。",
        "translation": "Thus I have heard: One time, the Bhagavān was sitting at the Palace of the Universally Wonderful in the great city of Śrāvastī, sitting on his jeweled lion's seat with 1,250 great monks and others, surrounded by an incalculable number of bodhisattvas, mahāsattvas, and aiming to guide measureless sentient beings, and he looked up to the Bhagavān without moving his body or mind.",
        "source": "T16n0662_001:0330c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼眾中有大菩薩，名文殊師利，承佛威神從座而起，偏袒右肩右膝著地，合掌向佛而作是言：「世尊！",
        "translation": "At the time, a great bodhisattva named Mañjuśrī rose from his seat in response to the Buddha's authoritative power, bared his right shoulder and knelt on his right knee, put his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T16n0662_001:0330c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞如來有大福聚，大福聚者其量云何？",
        "translation": "I've heard that the Tathāgata has a great stock of merit, but what is the measure of that great stock of merit?",
        "source": "T16n0662_001:0330c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願世尊為我解說，利益無量百千眾生，令其意樂咸得滿足。」",
        "translation": "May the Bhagavān explain this for me, so that I can benefit measureless hundreds of thousands of sentient beings and cause their aspirations to be fulfilled.\"",
        "source": "T16n0662_001:0331a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告文殊師利言：「善男子！",
        "translation": "It was then that the Bhagavān addressed Mañjuśrī, saying, \"Good sons!",
        "source": "T16n0662_001:0331a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已超過一切聲聞及辟支佛，能以智慧大悲之心，為諸眾生請問如來如是之義，諦聽諦聽，善思念之，吾當為汝分別解說。",
        "translation": "You have surpassed all direct disciples and solitary buddhas in being able to ask the Tathāgata about such things for sentient beings with wisdom and great compassion, listen closely, consider them well, and I will explain them for you.",
        "source": "T16n0662_001:0331a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一閻浮提所有眾生十善福聚，如是福聚挍計籌量數滿百倍，成一轉輪聖王王四天下自在福聚，七寶成就、千子具足。",
        "translation": "\"Suppose a cluster of ten good merits of all sentient beings in Jambudvīpa, and such a cluster of merits is measured and counted a hundred times over, becoming a cluster of the four worlds' sovereign merits of the wheel-turning sage king, complete with seven treasures and a thousand sons.",
        "source": "T16n0662_001:0331a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂七寶？",
        "translation": "What are the seven treasures?",
        "source": "T16n0662_001:0331a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者金輪寶、二者白象寶、三者紺馬寶、四者神珠寶、五者玉女寶、六者主藏寶、七者主兵寶。",
        "translation": "There's a golden wheel treasure, a white elephant treasure, a violet horse treasure, a sacred pearl treasure, a jade maiden treasure, a lord's store treasure, and a lord's army treasure.",
        "source": "T16n0662_001:0331a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼之千子，各各威猛端正勇健能破怨敵。",
        "translation": "Each of those thousand sons is formidable, correct, and courageous enough to defeat enemies.",
        "source": "T16n0662_001:0331a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0331a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為轉輪聖王所有福聚。",
        "translation": "This is called the merit stock of the wheel-turning sage king.",
        "source": "T16n0662_001:0331a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是轉輪聖王，及四天下一切眾生所有福聚，如是福聚挍計籌量復滿百倍，成一忉利天王帝釋福聚。",
        "translation": "Thus, the merit stock of the wheel-turning sage king and all the sentient beings under the four heavens is calculated and measured to be a hundredfold greater than the merit stock of the single Dhṛtarāṣṭra king.",
        "source": "T16n0662_001:0331a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是忉利天王，及四天下一切眾生所有福聚，如是福聚挍計籌量復滿百倍，成一欲界最第六天教受護持魔王福聚。",
        "translation": "Thus, the merit stock of the King of the Thirty-three Celestials and all the sentient beings under the four heavens is calculated and measured to be a hundredfold greater than the merit stock of the sixth most powerful heaven in the desire realm that teaches and protects the Māra King.",
        "source": "T16n0662_001:0331a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第六自在天魔，及四天下一切眾生所有福聚，如是福聚挍計籌量滿百千倍，成一慈心照察小千世界初禪梵王所有福聚。",
        "translation": "Thus, the sixth Āryācalanātha demon and all the sentient beings under the four heavens are endowed with fortune, and such an accumulation of fortune is measured and filled a hundred thousand times over to form a single compassionate mind that illuminates the fortune of the first meditation brahma king of the small chiliocosm.",
        "source": "T16n0662_001:0331a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是慈心照察小千世界初禪梵王，及彼世界一切眾生所有福聚，如是福聚挍計籌量復百千倍，成一中千世界二禪梵王所有福聚。",
        "translation": "Thus, they compassionately observe the merit of the first meditation king of the lesser chiliocosm and all the sentient beings in that world, and they calculate and measure the merit of such an accumulation a hundred thousand times over, making it the merit of the second meditation king of the medium chiliocosm.",
        "source": "T16n0662_001:0331a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是中千世界二禪梵王，及彼世界一切眾生所有福聚，如是福聚挍計籌量復百千倍，成一大千世界慈心照察第四禪內摩醯首羅所有福聚。",
        "translation": "Thus, the merit accumulated by the Brahma King of the Second Meditation in a world of a thousand mediums and by all the sentient beings in that world is measured and measured a hundred thousand times over, making it a merit accumulated by Mahêśvara in the fourth meditation in a world of a thousand compassionate mental states of awareness.",
        "source": "T16n0662_001:0331a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大千主摩醯首羅，非少善根之所成就。",
        "translation": "\"This Mahêśvara, lord of the great trichiliocosm, isn't the result of a few good roots.",
        "source": "T16n0662_001:0331b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0662_001:0331b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩醯首羅有大智慧、大威神故，如器世間災火焚已將更成立，於第四禪天降大雨，經五中劫不斷不絕，其水遍彼大千界上至梵世，無缺無減如是雨渧，彼大千主摩醯首羅悉能得知。",
        "translation": "Because of his great wisdom and authority, Mahêśvara, like the container world that's been engulfed in flames and will soon be reestablished, sends down a great rain in the fourth dhyāna heaven that doesn't stop for five medium-length eons and whose water pervades those great chiliocosms up to the Brahma world without missing or diminishing like this rain, which Mahêśvara, the lord of those great chiliocosms, is able to know.",
        "source": "T16n0662_001:0331b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是摩醯首羅所有福聚，如是福聚名為梵福。",
        "translation": "Thus, Mahêśvara possesses a stock of merit, and such a stock of merit is called pure merit.",
        "source": "T16n0662_001:0331b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三千大千世界主摩醯首羅，及彼世界一切眾生所有福聚，如是福聚挍計籌量，無量無邊億百千倍，成一獨出大辟支佛所有福聚。",
        "translation": "Thus, the merit accumulated by Mahêśvara, lord of the 3,000 great one-thousand worlds, and by all the sentient beings in that world is measured and counted to be measureless and limitless hundreds of millions of times greater than the merit accumulated by a solitary great pratyekabuddha.",
        "source": "T16n0662_001:0331b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且置如是一大千界。",
        "translation": "\"Suppose we set aside a great chiliocosm like this.",
        "source": "T16n0662_001:0331b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使十方諸佛世界，一切眾生及辟支佛所有福聚，如是福聚挍計籌量，至於無量億百千倍，成一最後生身菩薩福聚。",
        "translation": "Suppose there were a stock of merit in all the sentient beings and solitary buddhas in the Buddha world in the ten directions, and that stock of merit were calculated and measured to be measureless billions of times a hundred thousand, and it becomes a stock of merit for the bodhisattva in his final lifetime.",
        "source": "T16n0662_001:0331b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是最後生身菩薩福聚，及彼十方盡虛空際所有世界一切眾生，若卵生、若胎生、若濕生、若化生，若有色、若無色，若有想、若無想、若非有想非無想，彼諸眾生所有福聚，如是福聚挍計籌量，至於無量億百千倍，成彼如來身一毛孔所有福聚。",
        "translation": "Such a stock of merit of the bodhisattva in his final lifetime and of all the sentient beings in all the worlds of the ten directions, whether oviparous, wombborn, wet, or transformed, with or without form, with or without perception, without perception, or neither with nor without perception, constitute a stock of merit in every pore of the Tathāgata's body that's measured and measured to be measureless billions of hundreds of thousands of times greater than such a stock of merit.",
        "source": "T16n0662_001:0331b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0331b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來身諸毛孔，其數乃有九萬九千，如是毛孔一一皆具如上所說無量福聚。",
        "translation": "Thus, the Tathāgata's body has 99,000 pores, and each of those pores is filled with the measureless accumulation of merit described above.",
        "source": "T16n0662_001:0331b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來一切毛孔所有福聚，如是福聚挍計籌量，復至無量億百千倍，成如來身隨好之中一好福聚。",
        "translation": "Thus, the Tathāgata's merit accumulated in all of his pores is measured and measured, and it amounts to measureless millions of times a hundred thousand, making it one good merit among the Tathāgata's minor marks.",
        "source": "T16n0662_001:0331b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0331c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來身諸隨好，略說其數有八十種。",
        "translation": "Such are the Tathāgata's minor bodily attractions, the number of which is briefly described as eighty.",
        "source": "T16n0662_001:0331c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂八十？",
        "translation": "What are the eighty?",
        "source": "T16n0662_001:0331c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者首分圓滿、二者髮際嚴好、三者髮色青紺、四者髮香芬馥、五者髮甚柔軟、六者髮不紛亂、七者髮不稀穊、八者髮常增長、九者髮本波委、十者髮端螺旋、十一者髮狀花輪、十二者髮如德字、十三者面部平正、十四者毫分充足、十五者眉色青紺、十六者眉不雜亂、十七者兩目美好、十八者兩目修廣、十九者兩目清淨、二十者兩目明朗、二十一者目色紺艶如青蓮花、二十二者耳甚長好、二十三者耳無缺減、二十四者耳無過惡、二十五者鼻修高直、二十六者兩頰滿足、二十七者頰無缺減、二十八者頰無過惡、二十九者牙甚圓正、三十者其牙均等、三十一者脣色赤好如頻婆果、三十二者舌赤柔軟、三十三者聲如雷震、三十四者其音朗徹、三十五者身普滿足、三十六者身肉豐好、三十七者身肉平正、三十八者身肉柔軟、三十九者身漸傭直、四十者身分相稱、四十一者身極圓好、四十二者身無缺減、四十三者其身柔軟、四十四者其身清潔、四十五者其身輕妙、四十六者身不動搖、四十七者身極端嚴、四十八者身無疵穢、四十九者身光破闇、五十者其腹美好、五十一者其腹圓滿、五十二者其腹不現、五十三者其臍深密、五十四者其臍不曲、五十五者臍稱其位、五十六者腋下平滿、五十七者臂肘纖長、五十八者手指圓滿、五十九者手指纖美、六十者手文深好、六十一者手文徑徹、六十二者手文不亂、六十三者手文潤澤、六十四者文無麁細、六十五者文端纖銳、六十六者膝輪圓廣、六十七者足跟傭滿、六十八者足善按地、六十九者行順於右、七十者行如象王、七十一者行如牛王、七十二者行如鵝王、七十三者行步威猛如師子王、七十四者手足甲端微悉高起、七十五者手足等甲如赤銅色、七十六者手足等甲並皆潤澤、七十七者筋脈不現、七十八者支節密緻、七十九者諸根無染、八十者見者歡喜。",
        "translation": "一者首分圓滿、二者髮際嚴好、三者髮色青紺、四者髮香芬馥、五者髮甚柔軟、六者髮不紛亂、七者髮不稀穊、八者髮常增長、九者髮本波委、十者髮端螺旋、十一者髮狀花輪、十二者髮如德字、十三者面部平正、十四者毫分充足、十五者眉色青紺、十六者眉不雜亂、十七者兩目美好、十八者兩目修廣、十九者兩目清淨、二十者兩目明朗、二十一者目色紺艶如青蓮花、二十二者耳甚長好、二十三者耳無缺減、二十四者耳無過惡、二十五者鼻修高直、二十六者兩頰滿足、二十七者頰無缺減、二十八者頰無過惡、二十九者牙甚圓正、三十者其牙均等、三十一者脣色赤好如頻婆果、三十二者舌赤柔軟、三十三者聲如雷震、三十四者其音朗徹、三十五者身普滿足、三十六者身肉豐好、三十七者身肉平正、三十八者身肉柔軟、三十九者身漸傭直、四十者身分相稱、四十一者身極圓好、四十二者身無缺減、四十三者其身柔軟、四十四者其身清潔、四十五者其身輕妙、四十六者身不動搖、四十七者身極端嚴、四十八者身無疵穢、四十九者身光破闇、五十者其腹美好、五十一者其腹圓滿、五十二者其腹不現、五十三者其臍深密、五十四者其臍不曲、五十五者臍稱其位、五十六者腋下平滿、五十七者臂肘纖長、五十八者手指圓滿、五十九者手指纖美、六十者手文深好、六十一者手文徑徹、六十二者手文不亂、六十三者手文潤澤、六十四者文無麁細、六十五者文端纖銳、六十六者膝輪圓廣、六十七者足跟傭滿、六十八者足善按地、六十九者行順於右、七十者行如象王、七十一者行如牛王、七十二者行如鵝王、七十三者行步威猛如師子王、七十四者手足甲端微悉高起、七十五者手足等甲如赤銅色、七十六者手足等甲並皆潤澤、七十七者筋脈不現、七十八者支節密緻、七十九者諸根無染、八十者見者歡喜。",
        "source": "T16n0662_001:0331c03_3",
        "is_bad_quality": true
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0332a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如向所說，此八十種是名如來隨好福聚。",
        "translation": "As we've explained, these 80 kinds are called the Tathāgata's stock of merit in accordance with good qualities.",
        "source": "T16n0662_001:0332a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0332a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來八十隨好所有福聚，如是福聚挍計籌量，復滿無量億百千倍，成如來身手足等中隨相之文一文福聚。",
        "translation": "Thus, the Tathāgata's eighty minor marks of merit are measured and counted, and they are filled measurelessly, billions, and thousands of times over, to form a single textual mark of merit in the Tathāgata's body, hands, feet, and so forth.",
        "source": "T16n0662_001:0332a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0332a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來手足等中隨相之文有八十種。",
        "translation": "\"Thus, there are 80 kinds of texts that follow the characteristics of the Tathāgata's hands and feet.",
        "source": "T16n0662_001:0332a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂八十？",
        "translation": "What are the eighty?",
        "source": "T16n0662_001:0332a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者梵王像、二者天帝像、三者提頭賴吒像、四者毘樓勒叉像、五者毘樓博叉像、六者毘沙門像、七者功德天女像、八者日天子像、九者月天子像、十者水天像、十一者火天像、十二者風天像、十三者雲天像、十四者大仙像、十五者山王像、十六者童男像、十七者童女像、十八者寶幢像、十九者傘蓋像、二十者寶冠像、二十一者花鬘像、二十二者珠瓔像、二十三者耳璫像、二十四者臂印像、二十五者寶釧像、二十六者指環像、二十七者寶鏡像、二十八者白拂像、二十九者德字像、三十者花瓶像、三十一者摩尼像、三十二者寶劍像、三十三者金剛杵像、三十四者弓弧像、三十五者箭矢像、三十六者戈戟像、三十七者矛矟像、三十八者鉞斧像、三十九者羂索像、四十者長鉤像、四十一者[車*童]刃像、四十二者金鎚像、四十三者天棒像、四十四者天鼓像、四十五者天螺像、四十六者腰鼓像、四十七者花輪像、四十八者宮殿像、四十九者寶座像、五十者浴池像、五十一者蓮花像、五十二者粉米像、五十三者麰麥像、五十四者藥草像、五十五者靈茅像、五十六者花樹像、五十七者果樹像、五十八者金翅鳥像、五十九者迦陵頻伽像、六十者共命鳥像、六十一者孔雀像、六十二者鳩鴿像、六十三者鴈王像、六十四者青雀像、六十五者鸚鵡像、六十六者翠鳥像、六十七者輪中師子像、六十八者雪山白象像、六十九者龍王像、七十者象王像、七十一者馬王像、七十二者鹿王像、七十三者牛王像、七十四者野牛像、七十五者牸牛像、七十六者羖羊像、七十七者大鼇像、七十八者大龜像、七十九者魚王像、八十者螺王像。",
        "translation": "一者梵王像、二者天帝像、三者提頭賴吒像、四者毘樓勒叉像、五者毘樓博叉像、六者毘沙門像、七者功德天女像、八者日天子像、九者月天子像、十者水天像、十一者火天像、十二者風天像、十三者雲天像、十四者大仙像、十五者山王像、十六者童男像、十七者童女像、十八者寶幢像、十九者傘蓋像、二十者寶冠像、二十一者花鬘像、二十二者珠瓔像、二十三者耳璫像、二十四者臂印像、二十五者寶釧像、二十六者指環像、二十七者寶鏡像、二十八者白拂像、二十九者德字像、三十者花瓶像、三十一者摩尼像、三十二者寶劍像、三十三者金剛杵像、三十四者弓弧像、三十五者箭矢像、三十六者戈戟像、三十七者矛矟像、三十八者鉞斧像、三十九者羂索像、四十者長鉤像、四十一者[車*童]刃像、四十二者金鎚像、四十三者天棒像、四十四者天鼓像、四十五者天螺像、四十六者腰鼓像、四十七者花輪像、四十八者宮殿像、四十九者寶座像、五十者浴池像、五十一者蓮花像、五十二者粉米像、五十三者麰麥像、五十四者藥草像、五十五者靈茅像、五十六者花樹像、五十七者果樹像、五十八者金翅鳥像、五十九者迦陵頻伽像、六十者共命鳥像、六十一者孔雀像、六十二者鳩鴿像、六十三者鴈王像、六十四者青雀像、六十五者鸚鵡像、六十六者翠鳥像、六十七者輪中師子像、六十八者雪山白象像、六十九者龍王像、七十者象王像、七十一者馬王像、七十二者鹿王像、七十三者牛王像、七十四者野牛像、七十五者牸牛像、七十六者羖羊像、七十七者大鼇像、七十八者大龜像、七十九者魚王像、八十者螺王像。",
        "source": "T16n0662_001:0332a17_2",
        "is_bad_quality": true
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0332b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說此八十種，是名如來隨相福聚。",
        "translation": "These 80 kinds are called the Tathāgata's stock of merit in accordance with characteristics.",
        "source": "T16n0662_001:0332b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0332b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來八十隨相所有福聚，如是福聚挍計籌量，復滿無量億百千倍，成如來身三十二種大人相中一相福聚。",
        "translation": "Thus, the Tathāgata's eighty meritorious accumulations in accordance with characteristics are measured and counted, and they are filled measurelessly, billions, and thousands of times over, forming a single meritorious accumulation in one of the thirty-two major characteristics of the Tathāgata's body.",
        "source": "T16n0662_001:0332b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0332b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來大人之相，其數乃有三十二種。",
        "translation": "Thus, the number of the Tathāgata's major characteristics is thirty-two.",
        "source": "T16n0662_001:0332b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂三十二種大人之相？",
        "translation": "What are the thirty-two kinds of major marks of a great person?",
        "source": "T16n0662_001:0332b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者頂有肉髻圓好高勝、二者髮紺青色其毛右旋、三者其額廣大平正嚴好、四者眉間毫相白逾珂雪、五者目睫青緻猶如牛王、六者口四十齒無有增減、七者其齒齊密無有踈缺、八者其齒白淨無有垢黑、九者口有四牙其色鮮潔、十者其頷圓滿如師子王、十一者其舌柔薄廣大紅赤、十二者於諸味中而得上味、十三者其語雷震得梵音聲、十四者缺骨不現其處平滿、十五者兩肩圓正無有缺減、十六者垂申兩臂手摩其膝、十七者其身上分如師子王、十八者身所有毛皆悉上靡、十九者身相圓滿如尼拘陀樹、二十者其身高妙滿足七肘、二十一者身體皮膚皆作金色、二十二者一一毛孔有一毛生、二十三者勢峯藏匿隱密不現、二十四者兩髀圓正其肉滿足、二十五者[蹲-酋+(十/田/ㄙ)]相嚴好如伊尼鹿王、二十六者兩足豐滿無諸缺減、二十七者兩足掌下皆悉平滿、二十八者足膚骨肉皆悉隆起、二十九者兩手兩足皆悉柔軟、三十者兩手兩足皆有網鞔、三十一者兩手兩足皆悉纖長、三十二者兩手兩足皆有輪相。",
        "translation": "一者頂有肉髻圓好高勝、二者髮紺青色其毛右旋、三者其額廣大平正嚴好、四者眉間毫相白逾珂雪、五者目睫青緻猶如牛王、六者口四十齒無有增減、七者其齒齊密無有踈缺、八者其齒白淨無有垢黑、九者口有四牙其色鮮潔、十者其頷圓滿如師子王、十一者其舌柔薄廣大紅赤、十二者於諸味中而得上味、十三者其語雷震得梵音聲、十四者缺骨不現其處平滿、十五者兩肩圓正無有缺減、十六者垂申兩臂手摩其膝、十七者其身上分如師子王、十八者身所有毛皆悉上靡、十九者身相圓滿如尼拘陀樹、二十者其身高妙滿足七肘、二十一者身體皮膚皆作金色、二十二者一一毛孔有一毛生、二十三者勢峯藏匿隱密不現、二十四者兩髀圓正其肉滿足、二十五者[蹲-酋+(十/田/ㄙ)]相嚴好如伊尼鹿王、二十六者兩足豐滿無諸缺減、二十七者兩足掌下皆悉平滿、二十八者足膚骨肉皆悉隆起、二十九者兩手兩足皆悉柔軟、三十者兩手兩足皆有網鞔、三十一者兩手兩足皆悉纖長、三十二者兩手兩足皆有輪相。",
        "source": "T16n0662_001:0332b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0332c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說三十二種大人之相，是名如來正相福聚。",
        "translation": "These are called the Tathāgata's correctly proportioned mass of merit, which are the thirty-two major characteristics of a person as described here.",
        "source": "T16n0662_001:0332c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0332c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來三十二種大人福聚，如是福聚校計籌量，復滿無量阿僧祇倍，不可量倍不思議倍，始成如來大法圓螺，隨類教化一切眾生音聲福聚。",
        "translation": "Thus, the Tathāgata's thirty-two kinds of merit stock of great persons is measured and measured, and it fills measureless incalculable and unfathomable multiples before it becomes the Tathāgata's great conch of perfect dharma, which follows the types of sentient beings it teaches to sound and merit.",
        "source": "T16n0662_001:0332c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0332c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來大法圓螺，能隨彼彼無量無邊阿僧祇等無量世界一切眾生所有意樂，如其意樂能悉遍滿，隨其類音說法教化，利益安樂如是眾生。",
        "translation": "Thus, the Tathāgata's great conch of the Dharma can follow the aspirations of all sentient beings in the numberless, unlimited, incalculable, and infinite worlds, filling them completely according to their aspirations, teaching and instructing them according to their type of voice, and benefiting and comforting such sentient beings.",
        "source": "T16n0662_001:0332c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0332c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼如來所有音聲，能有如是無量勢力，如來威光亦復如是，等彼音聲能有如是無量勢力。",
        "translation": "\"Just as the Tathāgata's voice can have such measureless power, so too can the Tathāgata's authoritative radiance, and just like that voice can have such measureless power.",
        "source": "T16n0662_001:0332c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0333a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼如來所有威光，能有如是無量勢力，如來之身亦復如是，等彼威光能有如是無量勢力。",
        "translation": "\"Just as the Tathāgata's authoritative radiance can have such measureless power, so too can the Tathāgata's body, and so can his authoritative radiance have such measureless power.",
        "source": "T16n0662_001:0333a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0333a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如上所說，如是福聚不可思議、不可算數，非諸聲聞、辟支佛等之所能得。",
        "translation": "As I said above, such an accumulation of merit is unfathomable, incalculable, and incapable of being obtained by anyone other than śrāvakas and pratyekabuddhas.",
        "source": "T16n0662_001:0333a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T16n0662_001:0333a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是福聚從大智慧及大慈悲普遍一切最上願力所生起故，是故聲聞、辟支佛等所不能得。",
        "translation": "Such a stock of merit arises from the power of great wisdom and compassion and the universal, supreme vow, and therefore is unobtainable by śrāvakas and pratyekabuddhas.",
        "source": "T16n0662_001:0333a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0333a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來如是妙色之身，悉是一切最勝清淨施戒修等及二因緣之所成立。",
        "translation": "Such a wonderfully colored body of the Tathāgata is the result of two causes and conditions that establish all the most excellent and pure generosity, morality, cultivation, and so forth.",
        "source": "T16n0662_001:0333a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are the two?",
        "source": "T16n0662_001:0333a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者如來最勝願力，二者如來化導善巧。",
        "translation": "One is the Tathāgata's supreme vow power, and the other is the Tathāgata's skillful means of teaching and guiding.",
        "source": "T16n0662_001:0333a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂如來化導善巧？",
        "translation": "What's meant by the Tathāgata's skillful means of guiding?",
        "source": "T16n0662_001:0333a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂諸眾生未種善根令種善根，已種善根令彼成熟，已成熟者令得解脫。",
        "translation": "It means that sentient beings plant good roots before they are planted, mature good roots after they are planted, and attain liberation after they are matured.",
        "source": "T16n0662_001:0333a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是二種因緣力故，是故獲得妙色之身。",
        "translation": "Because of these two kinds of causal forces, they attain a marvelously colored body.",
        "source": "T16n0662_001:0333a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T16n0662_001:0333a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來妙色之身，由二因緣之所成就；如來音聲亦復如是，以二因緣而得成就。",
        "translation": "Thus, the Tathāgata's beautifully-formed body is produced by two causes, and so is the Tathāgata's voice, which is produced by two causes.",
        "source": "T16n0662_001:0333a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0333a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來所有音聲，以二因緣之所成就；如來威光亦復如是，以二因緣而得成就。",
        "translation": "\"Thus are all the Tathāgata's sounds made by two causes, and thus is the Tathāgata's authoritative radiance made possible by two causes.",
        "source": "T16n0662_001:0333a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0333a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來所有威光，以二因緣之所成就；如來說法亦復如是，以二因緣而得成就。",
        "translation": "Thus is the Tathāgata's authoritative radiance made possible by two causes, and likewise is the Tathāgata's exposition of the Dharma made possible by two causes.",
        "source": "T16n0662_001:0333a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0333a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如來所有說法，以二因緣之所成就；如來之行亦復如是，以二因緣而得成就。",
        "translation": "Thus, all the Tathāgata's teachings are accomplished by two causes, and likewise are the Tathāgata's actions accomplished by two causes.",
        "source": "T16n0662_001:0333a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "\"Mañjuśrī!",
        "source": "T16n0662_001:0333a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來如是為欲哀愍諸眾生故出現於世，為欲利益諸眾生故出現於世，為欲安樂諸眾生故出現於世，以諸眾生若干種性願樂差別各各不同，是故如來隨其意樂，為現種種相好之身，說法教化令彼調伏，入佛法中使得成就。」",
        "translation": "Thus, the Tathāgata appears in the world because he wants to pity sentient beings, appears in the world because he wants to benefit sentient beings, appears in the world because he wants to bring comfort to sentient beings, and appears in the world because he wants to bring well-being to sentient beings whose various natures differ according to their wishes and aspirations.",
        "source": "T16n0662_001:0333a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利菩薩摩訶薩聞佛所說如上福聚，利益一切諸天世人，便作是言：「世尊！",
        "translation": "It was then that Mañjuśrī Bodhisattva Mahāsattva heard what the Buddha had said about such a stock of merit that benefits all gods and humans, and he said, \"Bhagavān!",
        "source": "T16n0662_001:0333b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者得大善利，我於今者得大最勝，我於今者得無等等，我於今者得大吉祥，我思如來於世間中為諸眾生作大依止，清淨不動猶如虛空，難遇難遭我今得見。」",
        "translation": "Now, I've attained great good benefits, now I've attained great excellence, now I've attained peerlessness, now I've attained great good fortune, and I consider that the Tathāgata is a great support for sentient beings in the world, pure and immovable like space, and I've now attained a view that's difficult to encounter and difficult to encounter.\"",
        "source": "T16n0662_001:0333b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是經已，彼諸比丘及諸菩薩摩訶薩等，歡喜合掌，信受奉行。",
        "translation": "After the Buddha spoke this sūtra, the monks and the bodhisattvas, mahāsattvas, and others rejoiced, put their palms together, and faithfully accepted and approved of it.",
        "source": "T16n0662_001:0333b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘百福莊嚴相經",
        "translation": "Dasheng bai fuxue zhuangyanxiang jing",
        "source": "T16n0662_001:0333b13_0",
        "is_bad_quality": false
    }
]