[
    {
        "source_sentence": "佛說四輩經",
        "translation": "Sutra on the Four Categories of Practicing Buddhists",
        "source": "T17n0769_001:0705b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, Tripiṭaka of the Yuezhi State, Western Jin Dynasty",
        "source": "T17n0769_001:0705b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T17n0769_001:0705b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸四輩弟子、天帝、龍、鬼神、質諒神，皆詣祇樹，稽首佛足，却就常位坐。",
        "translation": "At the time, four groups of disciples, gods, dragons, demons, and gods of understanding all went to Jeta and bowed their heads at the Buddha's feet and withdrew to sit in their usual positions.",
        "source": "T17n0769_001:0705b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸弟子：「吾今所出經法，所可教誡，皆自各守其意念。",
        "translation": "The Buddha told the disciples, \"Now, I've given out sūtras and teachings that are admonishable, so each of you should guard your own thoughts.",
        "source": "T17n0769_001:0705b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "末世毒然之時，四輩弟子，若出家、若居家修道，皆狂醉眾色，不復承用佛經法，專愚自用，便使吾道薄淡，令世人謗訕吾道，信是弟子慠慢所致！」",
        "translation": "In the poisonous state of the latter days, four groups of disciples, whether renunciant or lay practitioners, were drunk with color, didn't apply the Buddha's teachings, and concentrated on their own foolish use, which made our path dilute and caused people to denigrate our path, which I believe was the result of their arrogance!\"",
        "source": "T17n0769_001:0705b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鶖鷺子整衣服，叉手，一心聽佛說《四輩經》如是。",
        "translation": "The Śāriputra adjusted his clothes, folded his arms, and single-mindedly listened to the Buddha's teaching of the Sutra of the Four Categories, thus.",
        "source": "T17n0769_001:0705b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若末世男子能出家，除剃頭髮為道者，第一去離愛欲，志存大乘，常當慈悲喜護為主，去想行，普念一切蜎飛蠕動之類，視之如身無異，不得妄起恚怒。",
        "translation": "The Buddha said, \"If a man of the latter age could leave home, shave his hair, and undertake the path, he should first part with desire, aim for the great vehicle, always be compassionate, joyful, and protective, depart from conceptualization, be universally mindful of all flying and wriggling creatures, and regard them as though they were himself, without distinction, so that they don't become angry rashly.",
        "source": "T17n0769_001:0705b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深入明度，常以明度權便，誘致曚冥，使入無極，以戒德除心穢病，不得為世間之業。",
        "translation": "He deeply enters into luminous salvation, always using the expedient of luminous salvation to induce ignorance and cause entry into the limitless, and uses the virtue of morality to remove mental defilements and not to create worldly karma.",
        "source": "T17n0769_001:0705b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能行此者，便可出家，名曰道士。",
        "translation": "Those who can practice this can then leave home and be called a practitioner of the Way.",
        "source": "T17n0769_001:0705b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可依恃吾法，自以出家為信，不專念道。",
        "translation": "They mustn't rely on our teaching and consider themselves renunciant believers who aren't dedicated to the path.",
        "source": "T17n0769_001:0705b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或能有下賤之人，倚道自活，無益一切，而但出意說。",
        "translation": "Perhaps there's a lowly person who depends on the path for his own livelihood, doesn't help anyone, and only speaks out of intention.",
        "source": "T17n0769_001:0705b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為人師主，輕薄戲調，不自撿察，使尊法薄淡，世人不信，非吾出家弟子之法也！」",
        "translation": "Being a teacher and master for others, they make light of it and don't examine it for themselves, which makes the pre-eminent teaching dilute and the world not believe in it.",
        "source": "T17n0769_001:0705b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若有女人出家，除髮為道，以去愛欲，當專精靜處，不得與出家男子同廟止。",
        "translation": "The Buddha said, \"If a woman leaves home and removes her hair for the path in order to rid herself of craving, she must concentrate on a quiet place and mustn't share the same temple with a man who leaves home.",
        "source": "T17n0769_001:0705c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行師受，當有等類，不得獨往稟受。",
        "translation": "If they practice mastery, they must have equals, and they mustn't go to the temple alone to receive them.",
        "source": "T17n0769_001:0705c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常當晚出早還，不得妄出廟宿止。",
        "translation": "They must always leave late and return early, and they mustn't leave the temple to stay overnight.",
        "source": "T17n0769_001:0705c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但得教授女人，不得教授男子。",
        "translation": "Only women may be taught, but not men.",
        "source": "T17n0769_001:0705c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所著衣服，不得刻繒帛綵色苾芬。",
        "translation": "Whatever clothes they wear, they mustn't carve silks, colors, or finery.",
        "source": "T17n0769_001:0705c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不得輕言戲語，不得貪財寶物，戒行清淨，名曰出家道人。",
        "translation": "They mustn't speak softly or playfully, mustn't covet wealth or valuables, and conduct themselves in a pure manner, which is called a renunciant practitioner.",
        "source": "T17n0769_001:0705c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若輕言戲調，未語預笑，心志不寂，意行穢濁，惡口罵詈，輕言不節，不能靜處，憍慢自大，不自撿勅者，雖復出家，故是賤人，非出家弟子也！」",
        "translation": "If someone speaks glibly and playfully, laughs before speaking, has a mind that's not still, behaves in a defiled way, badmouths, speaks disrespectfully, can't stand still, is conceited and arrogant, and doesn't own up to commands, even though they've left home, they're a lowly person and not a renunciant disciple!\"",
        "source": "T17n0769_001:0705c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若有男子心志繫道，不能出家者，在於愛欲之中，當受持五戒、月六齋。",
        "translation": "The Buddha said, \"If a man's mind is bound to the path and he's unable to leave home, then in the midst of his desires, he should observe the five precepts and six monthly observances of purification.",
        "source": "T17n0769_001:0705c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一孝順父母，治家養子；朝暮燒香、然燈，稽首三尊，悔過十方，恭敬四輩；不得慢輕自大，去離慳貪；常以至誠，不得欺殆世人；不得與世間人妻婦坐起同席、住行相隨、同室異床。",
        "translation": "The first is to be dutiful to your father and mother, to train your family and raise your children, to burn incense and lamps in the morning and evening, to pay homage to the three honored ones, to repent of faults in ten directions, and to respect the four groups of people; not to be conceited and arrogant, to be free of stinginess and greediness; always to be sincere and not to deceive the world; not to sit up at the same table with the wives and widows of worldlings, to live and walk together, or to share the same room and bed.",
        "source": "T17n0769_001:0705c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除去四事，以四等心普視一切，老者，若父、若母；少者，若弟、若子。",
        "translation": "He removes four things and looks at all people with four kinds of equal mind, regarding the elderly as father and mother and the young as younger disciples and sons.",
        "source": "T17n0769_001:0705c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒以明度法藥洗除眾病，不得妄瞋恚、罵詈。",
        "translation": "He always cleanses himself of illnesses with the medicine of the Dharma of luminous salvation, and he mustn't mistakenly get angry or ridicule them.",
        "source": "T17n0769_001:0705c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常以無極方便誘解世人，使入大乘；不得為新學者說深經、奧妙之義，當為除想識無罣礙者；不得綺飾衣服，不得與世間妻女戲調言語、往來報答。",
        "translation": "He always uses the supreme method to guide and understand people into the great vehicle; he mustn't teach profound sūtras or subtle doctrines to newcomers, but rather, he must remove the obstruction of perception and consciousness; he mustn't adorn his clothes or engage in flirtatious speech with worldly wives and daughters or exchange rewards.",
        "source": "T17n0769_001:0705c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以致因緣，如是者為清淨道人。",
        "translation": "Such a person is a pure practitioner because of the causes and conditions that result.",
        "source": "T17n0769_001:0705c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行不清淨，貪利財色；或於世俗綺飾衣服，互相翹舉，但結非惡，眄睞所欲；輕言戲調，未語預笑；託己同法，口說妙言；外似清虛，內懷貪惑；心存財帛，以自供給，活於妻子；慢佛，尊經不復修學，反習外道之術——世藥解奏、符呪厭說、療治眾病因緣、外道解奏之術，或於財帛勾束上下，賊意欲得，因解奏之術，不持吾法，當來者却皆由斯輩，是故非吾法學弟子也！」",
        "translation": "If someone doesn't conduct themselves in a pure way and lusts after wealth and form, or if they adorn themselves in worldly finery and raise their clothes to one another, making unwholesome connections and looking at one another's desires, speaking softly and flirtatiously, laughing before speaking, trusting in themselves and the same principles, speaking eloquently, appearing to be clean on the outside but harboring craving and delusion on the inside, keeping wealth and possessions in mind to provide for themselves and to support their wives, hating the Buddha, not studying the venerable sūtras but instead practicing the techniques of non-Buddhists - the techniques of explaining the world's medicines, reciting charms and spells, treating the causes and conditions of various illnesses, explaining the techniques of non-Buddhists, or tying up or down wealth and possessions with the intention of stealing them, and not upholding our teachings because of the techniques of explaining the teachings, these people will all be the cause of the future.",
        "source": "T17n0769_001:0705c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若有女人不能出家，在於愛欲之中心樂道者，當持五戒、月六齋。",
        "translation": "The Buddha said, \"If a woman is unable to leave home and is in the center of desire and the path of pleasure, she must observe the five precepts and six monthly observances of purification.",
        "source": "T17n0769_001:0706a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孝順父母、姑嫜、叔妹、夫婿；不得撾罵兒子、婢使；不得輕行，來宿止他家；不得與世間男子語言，調弄譺笑；不得妄瞋恚、罵詈、惡口；不得證說他人惡，不得陷人兒子、妻妾、奴婢過惡；恒當專精念道為上首；不得與世間凡人說法顏貌；不得與人男子相斥，不得教他人男子；不得說世間吉凶、善惡、災變之相；不得憍慢自大；晝夜三時燒香，稽首三尊，悔過十方，稟受經行，言數自勸；不得希望供養、貪利、財帛；不得嫉妬夫主，當自賤女人身，願為男子轉身受福，可得上天宮觀自然。",
        "translation": "孝順父母、姑嫜、叔妹、夫婿；不得撾罵兒子、婢使；不得輕行，來宿止他家；不得與世間男子語言，調弄譺笑；不得妄瞋恚、罵詈、惡口；不得證說他人惡，不得陷人兒子、妻妾、奴婢過惡；恒當專精念道為上首；不得與世間凡人說法顏貌；不得與人男子相斥，不得教他人男子；不得說世間吉凶、善惡、災變之相；不得憍慢自大；晝夜三時燒香，稽首三尊，悔過十方，稟受經行，言數自勸；不得希望供養、貪利、財帛；不得嫉妬夫主，當自賤女人身，願為男子轉身受福，可得上天宮觀自然。",
        "source": "T17n0769_001:0706a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是清信女人學道之法。",
        "translation": "This is the way for a pure and faithful woman to train in the path.",
        "source": "T17n0769_001:0706a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不孝順，憍慢姑嫜，嫉妬夫主，撾罵奴婢，造惡自是，怨恨、恚怒、毒意向人，行者如是，是為非法學女人弟子也！」",
        "translation": "If someone is unfilial, arrogant, and proud of their parents, jealous of their husbands and masters, ridicules their servants, does evil of their own accord, resents, becomes angry, and has harmful intentions for others, and does this, they are an unlawful disciple of a woman in training!\"",
        "source": "T17n0769_001:0706a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸弟子：「清慎汝心，守護身口，恒以四等濟眾生已，道寶之慧恩施一切，如佛教誡，必得度世！」",
        "translation": "The Buddha told his disciples, \"Be careful with your mind, guard your body and speech, and always use the four kinds of equanimity to help sentient beings afterward, so that the wisdom of the jewel of the Way will be extended to all, just as the Buddha instructs, and you will surely be saved from the world!\"",
        "source": "T17n0769_001:0706a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子諸來會者，聞佛說經，歡喜奉行，作禮而去。",
        "translation": "The disciples who came to the meeting heard the Buddha teach the sūtras, rejoiced, handed them down, paid homage, and departed.",
        "source": "T17n0769_001:0706a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說四輩經",
        "translation": "The Buddha taught the Four Categories Sutra.",
        "source": "T17n0769_001:0706a24_0",
        "is_bad_quality": false
    }
]