[
    {
        "source_sentence": "佛說出生菩提心經一卷",
        "translation": "Foshuo chusheng penti xinzhou jing one roll",
        "source": "T17n0837_001:0891c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大隋北印度三藏闍那崛多譯",
        "translation": "Tathāgata Translation of the Northern Indian Tripiṭaka of the Sui dynasty",
        "source": "T17n0837_001:0891c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時婆伽婆在王舍城迦蘭陀竹園，與大比丘眾百千人俱，復與無量阿僧祇不可說大菩薩眾，所謂十方來集。",
        "translation": "Thus I have heard: One time, the Bhagavān was present in the Kalandaka Bamboo Park of Rājagṛha with a large assembly of monks and one hundred thousand people, along with an incalculably large assembly of bodhisattvas that could not be described as having come from ten directions.",
        "source": "T17n0837_001:0891c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王舍大城有婆羅門姓大迦葉，於睡眠中夢見閻浮提內有大蓮華，其華千葉，光明遍照三千大千世界，微妙最勝七寶所成。",
        "translation": "At the time, there was a Brahman named Mahākāśyapa in the great city of Rājagṛha who, while asleep, dreamt that there was a large lotus inside Jambudvīpa with a thousand petaled flowers whose light shone throughout the 3,000 great thousand worlds, made of the most subtle and excellent seven treasures.",
        "source": "T17n0837_001:0891c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於蓮華內見有月輪，彼月輪內又見丈夫，放大光明普照一切，此四天下所有眾生見斯光者，生大歡喜踊躍無量皆受快樂。",
        "translation": "Inside the lotus was seen a moon wheel, and inside that moon wheel was seen a man whose magnificent light shone brightly and universally, and all the sentient beings in the four worlds who saw that light became overjoyed and jumped for measure, and they were all made happy.",
        "source": "T17n0837_001:0891c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門睡覺已，念所夢事心喜生疑：「此何因緣，竟有何事？",
        "translation": "After he fell asleep, the Kāśyapa Brāhmaṇa remembered what he had dreamed and was delighted at heart, wondering, \"What cause and condition did this happen?",
        "source": "T17n0837_001:0892a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於先現此未曾有相，昔所未聞，如我夢見？」",
        "translation": "Did this unprecedented mark appear in the past that was never heard before, as I saw in a dream?\"",
        "source": "T17n0837_001:0892a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已生大歡喜未曾見有，復作如是念：「此有沙門瞿曇！",
        "translation": "After thinking this thought, he became greatly elated at having never seen anything like it before and then thought, \"Here's the ascetic Gautama!",
        "source": "T17n0837_001:0892a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從他聞六年苦行，降伏魔眾證大菩提，轉妙法輪摧諸外道，為諸智人之所讚歎，聰明善巧知諸事相，我今應往詣彼沙門瞿曇問此夢相。」",
        "translation": "I've heard from others about their six years of austerities, their subjugation of demons and realization of great enlightenment, their turning of the wheel of the wonderful Dharma and destruction of non-Buddhists, their praise by wise men, and their wisdom and skillful knowledge of phenomena, so now I should go to that ascetic Gautama and ask about the characteristics of this dream.\"",
        "source": "T17n0837_001:0892a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門，夜既過已，從王舍城往詣迦蘭陀竹園往到佛所，到已頂禮佛足却住一面。",
        "translation": "After the night had passed, the Kāśyapa Brāhmaṇa went from Rājagṛha to the Kalandaka's Bamboo Park and reached the Buddha, bowed his head at his feet when he arrived, and withdrew to one side.",
        "source": "T17n0837_001:0892a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住一面已，如夢所見而向佛說。",
        "translation": "After staying at one side, he told the Buddha what he had seen in his dream.",
        "source": "T17n0837_001:0892a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門具說夢已，爾時世尊告迦葉婆羅門言：「汝善男子！",
        "translation": "After the Brāhmaṇa had fully explained the dream, the Bhagavān addressed the Kāśyapa Brāhmaṇa, saying, \"You good sons!",
        "source": "T17n0837_001:0892a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四種善夢得於勝法。",
        "translation": "\"There are four kinds of good dreams that attain superior states.",
        "source": "T17n0837_001:0892a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0837_001:0892a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：於睡眠中夢見蓮華，或見繖蓋，或見月輪，及見佛形。",
        "translation": "They say, 'In a dream while asleep, I saw a lotus, or I saw a parasol, or I saw the moon, or I saw the shape of a buddha.",
        "source": "T17n0837_001:0892a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見已，應自慶幸我遇勝法。」",
        "translation": "After seeing it this way, you should rejoice in yourself that I've encountered a remarkable teaching.\"",
        "source": "T17n0837_001:0892a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「若有睡夢見蓮華，　　及以夢見於繖蓋；　或復夢裏見月輪，　　應當獲得大利益。",
        "translation": "It was then that the Bhagavān wanted to reiterate this teaching and spoke the verse, \"If someone sees a lotus in a dream while asleep, or sees an umbrella in a dream, or sees the moon in a dream, they will receive great benefit.",
        "source": "T17n0837_001:0892a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有夢見佛形像，　　諸相具足莊嚴身；　眾生見者應歡喜，　　念當必作調御人。」",
        "translation": "If there's a dream that sees a buddha image with all its features and adorned body, sentient beings will rejoice when they see it, remembering that they will surely become disciplined people.\"",
        "source": "T17n0837_001:0892a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門聞此偈已，復白佛言：「世尊！",
        "translation": "After hearing this verse, the Kāśyapa Brāhmaṇa again said to the Buddha, \"Bhagavān!",
        "source": "T17n0837_001:0892a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是大利，諸眾生等若為能得此利益求菩提道？」",
        "translation": "What would be the great benefit for all sentient beings who seek the path to enlightenment for this benefit?\"",
        "source": "T17n0837_001:0892a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告迦葉婆羅門言：「大利者所謂一切智者是其利也。」",
        "translation": "It was then that the Buddha addressed Kāśyapa Brāhmaṇa, \"This is called the great advantage of having omniscience.\"",
        "source": "T17n0837_001:0892a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時迦葉婆羅門復白佛言：「世尊！",
        "translation": "Kāśyapa Brāhmaṇa then again said to the Buddha, \"Bhagavān!",
        "source": "T17n0837_001:0892a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言一切智利者，有何因緣而可得也？」",
        "translation": "What are the causes and conditions that make it possible for someone who talks about all the chile to attain them?\"",
        "source": "T17n0837_001:0892a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為迦葉婆羅門而說偈言：「我今說大利，　　婆羅門善聽。",
        "translation": "It was then that the Bhagavān spoke a verse for the Brahmin Kāśyapa, saying, \"Now, I've spoken about the great benefits, and the Brahmin has listened well.",
        "source": "T17n0837_001:0892a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有利和合，　　當作兩足尊。",
        "translation": "If there's beneficial combination, he'll become a two-legged honored one.",
        "source": "T17n0837_001:0892a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若作轉輪王，　　自在四天下；　眾生欲作者，　　須發菩提心。",
        "translation": "If he becomes the wheel-turning king, he'll have automatic control over the four worlds, and sentient beings who want to author must arouse the mind of enlightenment.",
        "source": "T17n0837_001:0892b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若作梵天王，　　於眾得自在；　眾生欲作者，　　須發菩提心。",
        "translation": "If he becomes a brahma king, he'll attain mastery over all of them, and sentient beings who want to authorize it must arouse the mind of enlightenment.",
        "source": "T17n0837_001:0892b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲界及色界、　　無色及上界；　眾生欲作者，　　須發菩提心。",
        "translation": "In the desire realm, form realm, formless realm, and higher realm, sentient beings wanting to author must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　若欲作商主，　為商主導師，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to be merchant masters and instruct merchant masters, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲作大光明，　破滅諸黑暗，　　須發菩提心。",
        "translation": "If there are sentient beings who want to be great lights and destroy darkness, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅諸顛倒，　及以三有等，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease [their] mistakenness and the three existences, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅諸蓋障，　及諸惡法者，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease the hindrances and bad qualities, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅於無明，　及斷貪愛網，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to cease ignorance and cut off the web of craving, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅有及愛，　及滅垢無垢，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease existence and craving and cease defilement and undefiledness, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅於我慢，　及色使我慢，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to cease self-conceit and the conceit that comes from form, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲離於貢高，　無病命我慢，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to be free of pride and the conceit that there's no illness or life, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅老我慢，　無常常住慢，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease the conceit of old age and the conceit of no long-abiding self, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅多聞慢，　及以持戒慢，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease the conceit of being well-versed and the conceit of observing precepts, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅蘭若慢，　乞食等諸慢，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease the conceit of being a lambda and the conceit of begging for food, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅知識慢，　愛糞掃衣慢，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease the conceit of being a teacher and the conceit of loving sweeping clothes, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅神通慢，　一食以為淨，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to cease the conceit of having supernormal powers and the conceit that a single meal is purified, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅一切慢，　所有有為慢，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to cease all conceit and all artificial conceit, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　當欲供養佛，　於先滅度者，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to make offerings to the Buddha, they must give rise to the mind of enlightenment when they first cease to exist.",
        "source": "T17n0837_001:0892c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　當欲供養佛，　所有諸如來，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to make offerings to the Buddha, they must give rise to the mind of enlightenment for all the tathāgatas.",
        "source": "T17n0837_001:0892c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲得轉法輪，　世間無能轉，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to turn the Dharma wheel, which no one in the world can do, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲滅應當滅，　當思所多思，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to cease and should cease, they must contemplate what should be contemplated, and must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　當欲行梵行，　初中後最上，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to practice the religious life, the first, middle, and last are the highest, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲攝諸精進，　往來諸有中，　　須發菩提心。",
        "translation": "If there are sentient beings who want to gather all their effort, going and coming among existences, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲說諸行苦，　見眾生受苦，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to explain the suffering of conditioned phenomena and see sentient beings suffering, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　諸法無有我，　欲為眾生說，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to teach that dharmas are without self and want to teach that for sentient beings, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲轉於法輪，　欲觸上菩提，　　須發菩提心。",
        "translation": "If there are sentient beings and so forth who want to turn the wheel of the Dharma and want to reach higher enlightenment, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有眾生等，　　欲說寂涅槃，　當證勝菩提，　　須發菩提心。",
        "translation": "If there are sentient beings and others who want to teach tranquil nirvāṇa and will realize supreme enlightenment, they must give rise to the mind of enlightenment.",
        "source": "T17n0837_001:0892c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是等功德，　　發心者能得；　梵志當聞已，　　應行菩提道。」",
        "translation": "Such are the attributes that those who arouse their minds can attain; after hearing them, priests should practice the path of enlightenment.\"",
        "source": "T17n0837_001:0892c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門聞此偈已，復白佛言：「世尊！",
        "translation": "After hearing this verse, the Kāśyapa Brāhmaṇa again said to the Buddha, \"Bhagavān!",
        "source": "T17n0837_001:0892c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發菩提心者應攝幾許福聚？」",
        "translation": "How much of the merit stock should be gathered by those who give rise to the aspiration for enlightenment?\"",
        "source": "T17n0837_001:0892c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即以偈頌向迦葉婆羅門說如是言：「若此佛剎諸眾生，　　令住信心及持戒；　如彼最上大福聚，　　不及道心十六分。",
        "translation": "It was then that the Bhagavān addressed the Kāśyapa Brāhmaṇa with this verse, saying, \"Suppose there were sentient beings in this Buddha's buddha who are made to abide in faith and observe precepts; like that, the greatest heap of merit is not as great as the sixteen parts of the mind of the path.",
        "source": "T17n0837_001:0892c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若此佛剎諸眾生，　　令住信心於法行；　如彼最上大福聚，　　不及道心十六分。",
        "translation": "Suppose there were sentient beings in this Buddha's buddha who were made to abide in faith and practice the Dharma, for example, like that most excellent cluster of great merit, they wouldn't match the sixteen parts of the mind of the path.",
        "source": "T17n0837_001:0893a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若諸佛剎恒河沙，　　皆悉造寺求福故，　復造諸塔如須彌，　　不及道心十六分。",
        "translation": "If there are buddha buddhas that are like the sands of the Ganges, they all build temples to seek merit, and then they build stūpas like Sumeru, which are not as great as the sixteen parts of the path's aspiration.",
        "source": "T17n0837_001:0893a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有佛剎如恒沙，　　皆悉遍施諸七寶；　如彼最上大福聚，　　不及道心十六分。",
        "translation": "If there were buddha buddhas like the sands of the Ganges, they would all pervasively bestow seven treasures, like the greatest heap of merit, which is not as great as the sixteen parts of the mind of the Way.",
        "source": "T17n0837_001:0893a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如鐵圍山高廣大，　　造塔無量為諸佛；　如是求福眾生等，　　不及道心十六分。",
        "translation": "Like Mount Telegraph, which is so tall and vast that it builds measureless stūpas for the buddhas, such sentient beings seeking merit aren't as fortunate as the sixteen parts of the path's aspiration.",
        "source": "T17n0837_001:0893a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若諸眾生具滿劫，　　若頭若髆常擔戴；　如彼最勝福德聚，　　不及道心十六分。",
        "translation": "If all sentient beings complete an entire eon, even if they have heads or shoulder blades that are always worn, such a cluster of the most excellent fortune wouldn't match the sixteen parts of the path's aspiration.",
        "source": "T17n0837_001:0893a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是人等得勝法，　　若求菩提利眾生；　彼等眾生最勝者，　　此無比類況有上。",
        "translation": "Such people attain excellence if they pursue bodhi for the benefit of sentient beings, and they're the most excellent of sentient beings, so there's no match for them, much less for the best.",
        "source": "T17n0837_001:0893a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故得聞此諸法，　　智者常生樂法心；　當得無邊大福聚，　　速得證於無上道。」",
        "translation": "Therefore, when they hear these things, the wise man always becomes delighted with the teaching; they will attain an infinite stock of merit and quickly realize the unsurpassed path.\"",
        "source": "T17n0837_001:0893a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門復白佛言：「世尊！",
        "translation": "It was then that Kāśyapa Brāhmaṇa again said to the Buddha, \"Bhagavān!",
        "source": "T17n0837_001:0893a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是發菩提心者有退轉不？」",
        "translation": "Is there retrogression for those who thus arouse the intention to achieve enlightenment?\"",
        "source": "T17n0837_001:0893a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時佛告迦葉婆羅門言：「如是發菩提心者，於解脫中無有退也。",
        "translation": "The Buddha then addressed the Kāśyapa Brāhmaṇa, \"Thus arousing the mind of enlightenment, there's no turning back from that liberation.",
        "source": "T17n0837_001:0893a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但就事別，有三種菩提。",
        "translation": "But with respect to specific things, there are three kinds of bodhi.",
        "source": "T17n0837_001:0893a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T17n0837_001:0893a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：聲聞菩提、辟支佛菩提、阿耨多羅三藐三菩提。",
        "translation": "They are: śrāvaka bodhi, pratyekabuddha bodhi, and unsurpassed samyak-saṃbodhi.",
        "source": "T17n0837_001:0893a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "\"Great brāhmaṇa!",
        "source": "T17n0837_001:0893a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是聲聞菩提？",
        "translation": "What is śrāvaka bodhi?",
        "source": "T17n0837_001:0893a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子善女人發阿耨多羅三藐三菩提，而不教他發菩提心、不令他住，亦不為說如是經典，不自受持亦不為人廣說其義，亦有親近是富伽羅，而不承事供養所須；若有來者及不來者亦不恭敬，而於彼所不生隨喜，以此因緣心得解脫。",
        "translation": "\"If good sons and good women arouse the unsurpassed, correct enlightenment and don't teach others to arouse the aspiration for enlightenment, don't cause others to abide, don't teach such sūtras, don't memorize them for themselves or explain their meaning to others, and become intimate with such a rich man or woman but don't serve or offer what's needed, and if they come or don't come, they don't respect them and don't give rise to joy in their place, then this is the cause for their attainment of liberation.",
        "source": "T17n0837_001:0893a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0893a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則名為聲聞菩提。",
        "translation": "This is called the enlightenment of the śrāvakas.",
        "source": "T17n0837_001:0893a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次何者是辟支佛菩提？",
        "translation": "\"Furthermore, what's the enlightenment of the pratyekabuddhas?",
        "source": "T17n0837_001:0893a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子善女人自發菩提心，而不教他發菩提心、不令他住，亦不為說如是經典，不自受持亦不廣為他人解說，亦不親近如是富伽羅，而不承事供養所須；若有來者及不來者，亦不恭敬亦不隨喜，以此因緣心證辟支菩提，是故名為辟支佛道。",
        "translation": "If good sons and good women themselves develop the mind of enlightenment but don't teach others to develop the mind of enlightenment, don't cause others to abide, don't teach such scriptures for their own sake, don't accept them or explain them to others in detail, don't become intimate with such a rich man or woman, and don't serve and provide for what's needed, and don't respect or follow those who come or don't come, this is called the pratyekabuddha path because of that cause and condition of mind realizing pratyekabuddha enlightenment.",
        "source": "T17n0837_001:0893b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次何者是阿耨多羅三藐三菩提？",
        "translation": "\"Furthermore, what's supreme, perfect, and complete enlightenment?",
        "source": "T17n0837_001:0893b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子善女人，自發阿耨多羅三藐三菩提心，亦復教他發阿耨多羅三藐三菩提心，既令彼住，復為人說如是經典悉令受持，親近如是富伽羅等，承事供養；若有來者及不來者，亦悉恭敬亦生隨喜，如此解脫自利利他，為多人利益故、為多人安樂故、憐愍世間利益安樂諸天人等故，名阿耨多羅三藐三菩提也。",
        "translation": "\"If good men and good women develop the mind of unsurpassed, corrected, and complete enlightenment, teach others to develop the mind of unsurpassed, corrected, and complete enlightenment, and then teach people such sūtras, make them memorable, become close to such rich men and women, serve and make offerings to them, and if they come or don't come, they also respect and give joy to them, which is called unsurpassed, corrected, and beneficial to others for the benefit of many people, for the welfare of many people, and for the welfare and happiness of gods and humans in the world, then that's called unsurpassed, corrected, and complete enlightenment.",
        "source": "T17n0837_001:0893b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何義故名阿耨多羅三藐三菩提？",
        "translation": "What does that mean to be called unsurpassed, correct, and complete enlightenment?",
        "source": "T17n0837_001:0893b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於上更無有勝可求，是故名為阿耨多羅三藐三菩提。」",
        "translation": "There's nothing higher than that to seek, and therefore it's called unsurpassed, correct, and complete enlightenment.\"",
        "source": "T17n0837_001:0893b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，以偈頌曰：「自發菩提心，　　不教他受持；　因自心力故，　　於後般涅槃。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke in verse, \"He motivates his own mind to achieve enlightenment, doesn't teach it to others, and because of the strength of his own mind, he attains parinirvāṇa at a later time.",
        "source": "T17n0837_001:0893b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為自利勤劬，　　不教他受持；　是故名沙門，　　佛子最勝師。",
        "translation": "He diligently works for his own benefit and doesn't teach others to retain it; therefore, he's called an ascetic, the most excellent teacher of the Buddha's children.",
        "source": "T17n0837_001:0893b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼發菩提心，　　教化生歡喜；　是故自得道，　　果報如是知。",
        "translation": "They arouse the aspiration for enlightenment, teaching and transforming others to rejoice; therefore, they attain the path for themselves, and the result is thus known.",
        "source": "T17n0837_001:0893b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自成不成他，　　諸仙中福田；　得名為緣覺，　　婆羅門當知。",
        "translation": "Accomplishing it on their own and not for others is a field of merit among sages; they're called pratyekabuddhas, as the Brāhmaṇas should know.",
        "source": "T17n0837_001:0893b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自發菩提心，　　復脫多眾生；　為世作利益，　　故名佛導師。",
        "translation": "He generates his own aspiration for enlightenment, liberates many more sentient beings, and works for the benefit of the world, which is why he's called a Buddhist guide.",
        "source": "T17n0837_001:0893b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　成就自利益，　　復令他解脫；　此彼無差別，　　故名不思議。」",
        "translation": "He accomplishes his own benefit and also causes the liberation of others; there's no difference between this and that, which is why he's called inconceivable.\"",
        "source": "T17n0837_001:0893b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門白佛言：「世尊！",
        "translation": "It was then that the Kāśyapa Brāhmaṇa said to the Buddha, \"Bhagavān!",
        "source": "T17n0837_001:0893c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解脫解脫有差別不？」",
        "translation": "Is there a difference between being liberated and being liberated?\"",
        "source": "T17n0837_001:0893c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「婆羅門！",
        "translation": "The Buddha said, \"Brāhmaṇa!",
        "source": "T17n0837_001:0893c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解脫於解脫無有差別；道於道無有差別；乘於乘而有差別。",
        "translation": "There's no difference between liberation and liberation; there's no difference between the path and the path; and there's a difference between a vehicle and a vehicle.",
        "source": "T17n0837_001:0893c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如王路，有象輿者、有馬輿者、有驢輿者，彼等次第行於彼路同至一城。",
        "translation": "It's like the king's road, where there's an elephant marcher, a horse marcher, and a donkey marcher, and they all travel in order on that road to reach the same city.",
        "source": "T17n0837_001:0893c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0893c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T17n0837_001:0893c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等乘有差別不？」",
        "translation": "Is there a difference between these vehicles?\"",
        "source": "T17n0837_001:0893c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「大德世尊！",
        "translation": "The brāhmaṇas said, \"Bhagavān!",
        "source": "T17n0837_001:0893c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼諸乘實有差別。」",
        "translation": "Yet there really is a difference between those vehicles.\"",
        "source": "T17n0837_001:0893c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是如是。",
        "translation": "The Buddha said, \"So it is, so it is.",
        "source": "T17n0837_001:0893c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0893c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞乘、辟支佛乘、阿耨多羅三藐三菩提乘有差別，道與解脫無有差別。",
        "translation": "There are distinctions between the vehicle of the direct disciples, the vehicle of the solitary realizers, and the vehicle of the unsurpassed, correct enlightenment.",
        "source": "T17n0837_001:0893c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0893c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如恒河，有三種人，有從此岸至於彼岸。",
        "translation": "It's like the Ganges River, where there are three kinds of people who reach the other side from this side.",
        "source": "T17n0837_001:0893c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其初人者，以草為筏倚之而度；第二人者若以皮囊、若以皮船倚之而度；第三人者，造作大船乘之入河，於此船中載百千人。",
        "translation": "The first of those people uses a raft made of grass to cross it; the second person uses a leather bag or a leather boat to cross it; and the third person builds a large boat to ride into the river, carrying a hundred thousand people in it.",
        "source": "T17n0837_001:0893c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第三人，復勅長子安置守護如此船舫：『所有眾生來者，汝從此岸度至彼岸，為多人等作利益故。』",
        "translation": "The third person then orders his eldest son to place and guard such a boat, saying, 'All the sentient beings who come will be taken from this shore to the other shore for the benefit of many people.'",
        "source": "T17n0837_001:0893c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0893c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T17n0837_001:0893c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫彼岸者有差別不？」",
        "translation": "Is there a difference between those on the other side?\"",
        "source": "T17n0837_001:0893c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「不也。",
        "translation": "The brāhmaṇas said, \"No.",
        "source": "T17n0837_001:0893c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T17n0837_001:0893c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復問言：「婆羅門！",
        "translation": "Again, the Buddha asked, \"Brāhmaṇa!",
        "source": "T17n0837_001:0893c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T17n0837_001:0893c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼乘之乘有差別不？」",
        "translation": "Is there a difference between that vehicle and its vehicle?\"",
        "source": "T17n0837_001:0893c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「所乘之乘實有差別。」",
        "translation": "The Brāhmaṇa said, \"There really is a difference between the vehicles that are ridden.\"",
        "source": "T17n0837_001:0893c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是如是。",
        "translation": "The Buddha said, \"So it is, and so it is.",
        "source": "T17n0837_001:0893c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0893c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然聲聞乘、辟支佛乘、阿耨多羅三藐三菩提乘實有差別。",
        "translation": "Still, there really are differences between the vehicle of the śrāvakas, the vehicle of the solitary realizers, and the vehicle of the unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0837_001:0893c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0893c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如第一人，依倚草筏從於此岸至於彼岸，獨一無二，聲聞菩提應如是知；第二人者，若倚皮囊及以皮船，從於此岸度至彼岸，辟支佛菩提應如是知；婆羅門！",
        "translation": "\"If the first person relies on a straw raft to reach the other shore from this shore, which is unique and not two, the śrāvakas should thus know enlightenment; if the second person relies on a leather bag and a leather boat to reach the other shore from this shore, the pratyekabuddhas should thus know enlightenment; Brāhmaṇa!",
        "source": "T17n0837_001:0893c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如第三人，成就大船共多人眾，從於此岸至於彼岸，如來菩提應如是知。」",
        "translation": "Just like the third person who completes a large boat with a multitude of people and reaches the other shore from this shore, the Tathāgata's enlightenment should be known like this.\"",
        "source": "T17n0837_001:0893c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「路及解脫無有上，　　諸乘皆悉有差別；　智者如是應挍量，　　當取最勝最上乘。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke in verse, \"There's no higher path or liberation, and all the vehicles have distinctions; wise ones should thus evaluate them and ascertain the most excellent and highest vehicle.",
        "source": "T17n0837_001:0893c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法教如是，　　正覺說此言；　簡擇諸法已，　　勝者應當學。」",
        "translation": "Such is the teaching of all dharmas, and this is what the rightful awakening says; after discriminating among the dharmas, the superior one should study them.\"",
        "source": "T17n0837_001:0894a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門復白佛言：「世尊！",
        "translation": "It was then that Kāśyapa Brāhmaṇa again said to the Buddha, \"Bhagavān!",
        "source": "T17n0837_001:0894a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩當云何行，云何念住，得至摩訶衍？」",
        "translation": "What practices and bases of mindfulness will bodhisattvas and mahāyānas undertake to attain mahāyāna?\"",
        "source": "T17n0837_001:0894a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告迦葉婆羅門作如是言：「婆羅門！",
        "translation": "It was then that the Buddha addressed the Kāśyapa Brāhmaṇa and said thus, \"Brāhmaṇa!",
        "source": "T17n0837_001:0894a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝聽是義：若諸菩薩摩訶薩如念修行，至摩訶衍。",
        "translation": "Listen to this meaning: \"If bodhisattvas, mahāsattvas, thus mindfully cultivate until they reach Mahāyāna.",
        "source": "T17n0837_001:0894a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0894a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子善女人自發菩提心，亦教他人發菩提心；自樂修行，勸他令修亦令他住，復為解釋如是修多羅義。",
        "translation": "\"If good men and good women themselves develop the mind of enlightenment and teach others to develop the mind of enlightenment, happily cultivate it themselves, encourage others to cultivate it and cause them to abide, and further explain the meaning of such a sūtra.",
        "source": "T17n0837_001:0894a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等富伽羅人，不來親近承受接事，當以四攝而攝取之。",
        "translation": "Such a rich man who doesn't come close to accept service should be collected in four ways.",
        "source": "T17n0837_001:0894a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0837_001:0894a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：布施、愛語、利益、同事。」",
        "translation": "They are: generosity, loving words, benefits, and coworkers.\"",
        "source": "T17n0837_001:0894a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「種種大布施，　　一切所有物；　欲攝受他故，　　菩薩無畏者。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke the verse, \"They are great almsgivers of all kinds, possessing all things, and wanting to take in others, they are fearless bodhisattvas.",
        "source": "T17n0837_001:0894a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　示現引接道，　　眾生不依來；　能以妙善語，　　數數當安慰。",
        "translation": "He shows them the way, leads them to the path, and sentient beings don't rely on him; he speaks beautifully and well, and his words are countless and will comfort them.",
        "source": "T17n0837_001:0894a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為自他安樂，　　彼所生善處；　晝夜常隨順，　　如是眾生等。",
        "translation": "For the welfare of self and others, they'll produce good places; always following them day and night, such are the sentient beings.",
        "source": "T17n0837_001:0894a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不信教令信，　　破戒令住戒；　慳悋令布施，　　一切巧利益。",
        "translation": "He makes them believe what's not taught, breaks the precepts and makes them stand, is stingy and makes them generous, and does all skillful things to benefit them.",
        "source": "T17n0837_001:0894a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　教人行菩提，　　牢固常精進；　同於利益事，　　智者如教行。",
        "translation": "Teaching people to practice bodhi, they are resolute and always diligent; in the same way that they benefit, the wise man thus teaches and practices.",
        "source": "T17n0837_001:0894a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如此智慧者，　　菩薩之導師；　智慧所行者，　　常樂大乘法。",
        "translation": "Such is the wise one, the bodhisattva's teacher; the one who practices wisdom always enjoys the great vehicle teaching.",
        "source": "T17n0837_001:0894a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勇猛是最勝，　　智者應當學；　以彼勝法故，　　最勝到彼岸。」",
        "translation": "Being bold and vigorous is the most excellent thing a wise person should learn; because of that excellent teaching, he most certainly reaches the other shore.\"",
        "source": "T17n0837_001:0894a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門復以偈頌而白佛言：「大德示彼行，　　菩薩諸導師；　當學彼所行，　　得至兩足尊。",
        "translation": "It was then that Kāśyapa Brāhmaṇa again spoke in verse to the Buddha, saying, \"Great virtuous one, show us these practices, the bodhisattvas' guides; we should train in their practices and attain the status of two-legged honored one.",
        "source": "T17n0837_001:0894a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為我說彼行，　　及行行所依；　菩提深廣大，　　慈愍願為說。」",
        "translation": "Explain those practices for me and the bases of those practices; the depth and breadth of bodhi, compassionately, I wish to explain them for you.\"",
        "source": "T17n0837_001:0894b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告迦葉婆羅門言：「善哉婆羅門！",
        "translation": "It was then that the Bhagavān addressed the Brahmin Kāśyapa, saying, \"Good, Brahmin!",
        "source": "T17n0837_001:0894b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩有三種行。",
        "translation": "There are three kinds of things that bodhisattvas do.",
        "source": "T17n0837_001:0894b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T17n0837_001:0894b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：天行、梵行、聖行。",
        "translation": "They are called the heavenly, brahma, and noble practices.",
        "source": "T17n0837_001:0894b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇas!",
        "source": "T17n0837_001:0894b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中何者名為天行？",
        "translation": "What of these is called the practice of gods?",
        "source": "T17n0837_001:0894b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子善女人，以慈身業、以慈意業、以慈口業，遍滿東方無量世界慈行充滿。",
        "translation": "\"Suppose there are good men and good women who, with kind physical actions, kind mental actions, and kind verbal actions, completely fill the measureless eastern world with kind deeds.",
        "source": "T17n0837_001:0894b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行此遍已，復能善入南西北方四維上下，皆以慈身業、慈意業、慈口業普遍充滿，是名天行。",
        "translation": "After doing so, he or she can also skillfully enter the four dimensions of the south, west, and north, filling them universally with the deeds of a merciful body, the deeds of a merciful mind, and the deeds of a merciful mouth, which is called the heavenly practice.",
        "source": "T17n0837_001:0894b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中何者名為梵行？",
        "translation": "Of these, what's called the religious practice?",
        "source": "T17n0837_001:0894b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：四無量。",
        "translation": "They're called the four immeasurables.",
        "source": "T17n0837_001:0894b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0837_001:0894b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈、悲、喜、捨，是名梵行。",
        "translation": "Compassion, pity, joy, and equanimity are called the religious practice.",
        "source": "T17n0837_001:0894b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0894b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中何者名為聖行？",
        "translation": "What of these is called holy practice?",
        "source": "T17n0837_001:0894b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：三解脫門。",
        "translation": "They're called the three gates of liberation.",
        "source": "T17n0837_001:0894b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為三？",
        "translation": "What are the three?",
        "source": "T17n0837_001:0894b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無願，是名聖行。」",
        "translation": "Emptiness, signlessness, and wishlessness are called noble conduct.\"",
        "source": "T17n0837_001:0894b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「勇猛行精進，　　菩薩之導師；　若有具天行，　　是人樂菩提。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke the verse, \"Vigorously exerting effort is the bodhisattva's guide; if there's someone who possesses the practices of gods, that person enjoys enlightenment.",
        "source": "T17n0837_001:0894b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聖行及梵行，　　是行聖所說；　若有修行者，　　是人得不動。」",
        "translation": "The holy and pure practices are explained by the noble practitioner; if there's someone who cultivates them, that person attains immovability.\"",
        "source": "T17n0837_001:0894b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門復以此偈而白佛言：「我樂深菩提，　　今問大導師；　此等當來世，　　如何集諸行？",
        "translation": "It was then that the Kāśyapa Brāhmaṇa again said this verse to the Buddha, \"I'm delighted with profound enlightenment, and now I'd like to ask the great teacher, 'How will these practices be gathered in a future life?'",
        "source": "T17n0837_001:0894b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為後眾生等，　　故我問世尊！",
        "translation": "For the sake of all the sentient beings that follow, I therefore ask the Bhagavān!",
        "source": "T17n0837_001:0894b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於佛菩提中，　　我意無分別；　令我發道心，　　利益眾生故。」",
        "translation": "In the buddha's enlightenment, my intentions are undiscriminated; it causes me to give rise to the mind of the path and benefits sentient beings.\"",
        "source": "T17n0837_001:0894b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復以偈頌報彼迦葉婆羅門言：「說此修多羅，　　令發大菩提；　梵志！",
        "translation": "The Bhagavān then again responded to that Kāśyapa Brāhmaṇa with a verse, \"Explaining this sūtra will cause me to give rise to great enlightenment; Brahmā!",
        "source": "T17n0837_001:0894b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛菩提，　　未曾有分別。",
        "translation": "\"Buddha's enlightenment has never been discerned.",
        "source": "T17n0837_001:0894b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說此修多羅，　　令發大菩提；　能斷一切疑，　　隨順眾生問。",
        "translation": "He teaches this sūtra, which causes the awakening of great bodhi, cuts off all doubt, and accords with the questions of sentient beings.",
        "source": "T17n0837_001:0894b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說此修多羅，　　令發大菩提；　能斷一切疑，　　稱彼眾生欲。",
        "translation": "He teaches this sūtra, which causes the awakening of great bodhi, cuts off all doubt, and accords with the desires of sentient beings.",
        "source": "T17n0837_001:0894b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得聞此經者，　　彼於未來世；　能行大布施，　　至於檀彼岸。",
        "translation": "Those who hear this sūtra will be able to perform great acts of generosity in the future and reach the other shore of giving.",
        "source": "T17n0837_001:0894c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得聞此經者，　　彼於未來世；　護持戒無缺，　　至於戒彼岸。",
        "translation": "When they hear this sūtra, they'll be able to observe the precepts without fail in the future, and they'll reach the other shore of morality.",
        "source": "T17n0837_001:0894c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得聞此經者，　　彼於未來世；　行忍為眾生，　　至於忍彼岸。",
        "translation": "Whoever hears this sūtra, in a future life he'll practice forbearance for the sake of sentient beings, and he'll reach the other shore of forbearance.",
        "source": "T17n0837_001:0894c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得聞此經者，　　彼於未來世；　精進為眾生，　　至於精進岸。",
        "translation": "Whoever hears this sūtra, in a future life he'll make effort for sentient beings, and he'll reach the shore of effort.",
        "source": "T17n0837_001:0894c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得聞此經者，　　彼於未來世；　常入諸禪定，　　至於禪彼岸。",
        "translation": "When they hear this sūtra, in the future they'll enter meditation for sentient beings, and they'll reach the other shore of meditation.",
        "source": "T17n0837_001:0894c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得聞此經者，　　彼於未來世；　為眾求勝智，　　至於智彼岸。",
        "translation": "Whoever hears this sūtra, in the future he'll seek superior knowledge for all sentient beings, which will reach the other shore of knowledge?",
        "source": "T17n0837_001:0894c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已曾作供養，　　憐愍眾生者；　得聞此經典，　　後世到其手。",
        "translation": "He who has made offerings and shown compassion for sentient beings and has heard of this sūtra will reach them in the afterlife.",
        "source": "T17n0837_001:0894c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　比丘住蘭若，　　意欲佛菩提；　得聞此經者，　　於後最先得。",
        "translation": "A monk who lives in a forest and wants the buddhas' enlightenment and has heard this sūtra will be the first to attain it in the future.",
        "source": "T17n0837_001:0894c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去數億佛，　　已持此經典；　為利諸菩薩，　　發起意欲故。",
        "translation": "Tens of millions of buddhas in the past have upheld this sūtra for the benefit of bodhisattvas who arouse their aspirations.",
        "source": "T17n0837_001:0894c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有婆羅門，　　欲樂佛菩提；　彼時得信已，　　是經至其手。",
        "translation": "If there's a Brāhmaṇa who wants to pursue the Buddha's enlightenment, then this sūtra comes into his hand after he attains faith.",
        "source": "T17n0837_001:0894c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我見彼眾生，　　悉知彼所行；　亦知彼名字，　　我見悉無礙。",
        "translation": "I see these sentient beings and know their actions, and I know their names, and my views are completely unobstructed.",
        "source": "T17n0837_001:0894c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切頗具說，　　恐迷未來人；　懼彼起諸過，　　是故少分說。」",
        "translation": "I've explained them all quite fully, lest I mislead future generations, and I'm afraid they'll raise errors, so I'll explain them in small portions.\"",
        "source": "T17n0837_001:0894c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門復以此偈而白佛言：「大德此善持，　　令生廣大意；　此世大丈夫，　　不久我當作。",
        "translation": "Kāśyapa Brāhmaṇa then again said to the Buddha in this verse, \"This good maintenance of the great virtuous one causes a broad and great intention to arise; this worldly great man will soon be mine.",
        "source": "T17n0837_001:0894c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去及未來，　　導師之所說；　為彼生善利，　　故住於菩提。」",
        "translation": "It was taught by guides in the past and future; for their good benefit, they abide in bodhi.\"",
        "source": "T17n0837_001:0894c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復以偈報婆羅門言：「彼等住此智，　　為誰之所說？",
        "translation": "The Bhagavān then again responded to the Brāhmaṇa in verse, \"Who taught this wisdom to those who abide here?",
        "source": "T17n0837_001:0895a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已知彼心行，　　我今當記彼。",
        "translation": "\"Having known their mental functions, I will now remember them.",
        "source": "T17n0837_001:0895a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所聞此經者，　　今現在我前；　彼等於後世，　　此經當現前。",
        "translation": "Those who have heard this sūtra are now in my presence, and in the afterlife, this sūtra will be presented to them.",
        "source": "T17n0837_001:0895a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有諸女人，　　抄寫此經典；　此經當在手，　　能生大菩提。",
        "translation": "If there are women who copy this sūtra, they'll put it in their hands, and it will give rise to great enlightenment.",
        "source": "T17n0837_001:0895a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於先已說，　　比丘樂蘭若；　手得此經典，　　於後當現前。",
        "translation": "I've already said that monks who delight in wisdom will then have this sūtra in their hands, and it will appear in the future.",
        "source": "T17n0837_001:0895a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　比丘聞此經，　　悲泣而雨淚；　我先作何業，　　今世得此利？",
        "translation": "When the monk hears this sūtra, he weeps tears of pity; what action did I take in the past to obtain this benefit in the present life?",
        "source": "T17n0837_001:0895a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於如是經，　　未曾善思惟；　我已得受記，　　何業獲此果？",
        "translation": "I've never well considered such a sūtra; after I've received its prediction, what karma will obtain this result?",
        "source": "T17n0837_001:0895a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔婆羅門，　　依於比丘活；　時比丘放逸，　　說此修多羅。",
        "translation": "In the past, a Brāhmaṇa relied on a monk for his living when he was careless and taught this sūtra.",
        "source": "T17n0837_001:0895a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵志於彼聞，　　時至而乞食；　泣淚已行出，　　是時心作願。",
        "translation": "When the priest heard it, he came to beg for food, and after weeping and wailing, he made a vow in his mind.",
        "source": "T17n0837_001:0895a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於修多羅，　　鈔義及文字；　後世作證明，　　亦復作擁護。",
        "translation": "'Regarding the sūtra, I will write its text and words, testify to it in a later life, and I will also defend it.'",
        "source": "T17n0837_001:0895a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以彼善業果，　　於後後末世；　得此修多羅，　　執持在其手。",
        "translation": "As a result of that good action, in a later and final age, I'll obtain this sūtra and hold it in my hand.",
        "source": "T17n0837_001:0895a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼時有比丘，　　悲泣淚滿目；　當時作懺悔，　　後得此經法。",
        "translation": "At the time, there was a monk whose eyes were filled with tears from weeping and pity, and he made a confession at the time and then attained the teaching of this sūtra.",
        "source": "T17n0837_001:0895a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於先業滅盡，　　彼時有相現；　於其睡夢中，　　得此修多羅。",
        "translation": "At the time when his prior actions ceased, there was a mark that appeared; in his sleep and dream, he attained this sūtra.",
        "source": "T17n0837_001:0895a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生死諸流轉，　　欺誑大恐怖；　斯由阿彌陀，　　願力如是果。",
        "translation": "The transmigration through birth and death is deceptive and terrifying, and it's because of Amitâbha that the vow is thus fulfilled.",
        "source": "T17n0837_001:0895a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　破戒諸比丘，　　為他所輕賤；　如是多諸過，　　流轉大恐怖。",
        "translation": "Monks who break the precepts are despised by others; such are the many faults and great fears of their transmigration.",
        "source": "T17n0837_001:0895a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是多諸惡，　　由得聞此經；　當至彼邊際，　　於後常顯曜。」",
        "translation": "Thus are the many evils that result from hearing this sūtra; they'll reach the limit and always shine forth later.\"",
        "source": "T17n0837_001:0895b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門復以此偈而白佛言：「此大修多羅，　　令發大道心；　為我及未來，　　分別廣宣說。」",
        "translation": "Kāśyapa Brāhmaṇa then again said to the Buddha in this verse, \"This great sūtra will cause you to give rise to the mind of the great way; explain it in detail for me and for the future.\"",
        "source": "T17n0837_001:0895b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復以偈告迦葉種姓婆羅門言：「未來諸音聲，　　乃至我所說；　此是廣經典，　　是故汝當知。",
        "translation": "The Bhagavān then again addressed the Kāśyapa Brahman in verse, saying, \"These will be the sounds of the future, even as I explain them; this is a broad scripture; therefore, you should know it.",
        "source": "T17n0837_001:0895b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說此大經典，　　此當作《阿含》；　當作祕密藏，　　聲聞所修學。",
        "translation": "This great scripture that was taught here should be taken as the Āgamas, which will be a secret store that's cultivated by direct disciples.",
        "source": "T17n0837_001:0895b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此處之所說，　　及餘得道者；　此是諸經母，　　梵志如此知。",
        "translation": "What's taught here and by others who have attained the way is the mother of scriptures, which Brahmā knows like this.",
        "source": "T17n0837_001:0895b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼時諸比丘！",
        "translation": "Those monks!",
        "source": "T17n0837_001:0895b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於我滅度後；　《雜》及《長阿含》，　　復名《中阿含》。",
        "translation": "After I died, the Zākyamuni and Nagarjuna scriptures were also called the Middle Length Āgamas.",
        "source": "T17n0837_001:0895b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼時有《阿含》，　　具數名《增一》；　復說雜經典，　　篋藏聲聞說。",
        "translation": "At the time, there was the Āgama, which was variously called the Incremental Āgamas, and there were also miscellaneous scriptures that were taught by śrāvakas in the bins.",
        "source": "T17n0837_001:0895b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復當作毘尼，　　亦作阿毘曇；　或於三篋藏，　　得名諸比丘！",
        "translation": "It was also called the Abhidharma, or the abhidharma, or the three baskets of scriptures, and it became known as the monks!",
        "source": "T17n0837_001:0895b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八萬有四千，　　法聚我已說；　一切從此出，　　名為最勝經。",
        "translation": "\"There are 80,000 and 4,000 dharmas that I've explained, all of which emerge from this and are called the most excellent sūtras.",
        "source": "T17n0837_001:0895b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於此說聲聞，　　及說獨一覺；　諸智之根本，　　不思議經典。",
        "translation": "It's called the śrāvaka and the pratyekabuddha, the root of all cognition, and it's not a deliberate scripture.",
        "source": "T17n0837_001:0895b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間之所有，　　三界未現者；　諸福之根本，　　由發菩提心。",
        "translation": "They are worldly possessions that have yet to manifest in the three realms, and the root of merit is the arousal of the mind of enlightenment.",
        "source": "T17n0837_001:0895b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　施、戒等功德，　　忍辱、精進行；　禪定勝功德，　　此經中善說。",
        "translation": "The virtues of generosity and morality, the tolerances and energies, and the superior virtues of meditation are well explained in this sūtra.",
        "source": "T17n0837_001:0895b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智慧勝功德，　　解脫忍寂滅；　一切皆示現，　　此經中善說。",
        "translation": "The superior virtues of wisdom, liberation, forbearance, and cessation are all manifested, as is well explained in this sūtra.",
        "source": "T17n0837_001:0895b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苦集及以道、　　寂滅於此現；　諸法皆佛法，　　此經之所說。",
        "translation": "Suffering, accumulation, and the path as well as cessation are all manifested here; these things are all Buddha teachings, as explained in this sūtra.",
        "source": "T17n0837_001:0895c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說諸苦無常，　　亦說無我法；　說寂靜涅槃，　　在此修多羅。",
        "translation": "It teaches that suffering is impermanent, and it also teaches the dharma of selflessness; it teaches that quiescent nirvāṇa is found here in the sutra.",
        "source": "T17n0837_001:0895c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此處說聲聞，　　所住諸因緣；　大乘此經典，　　攝受一切法。",
        "translation": "Here it's said that the śrāvakas abide in various causes and conditions, and this great vehicle scripture embraces all dharmas.",
        "source": "T17n0837_001:0895c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法甚廣大，　　在於菩提心；　此為最勝典，　　普說修多羅。",
        "translation": "These dharmas are vast, and they reside in the mind of enlightenment; this is the most excellent scripture, which universally explains the sutra.",
        "source": "T17n0837_001:0895c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現前見諸佛，　　及為彼說法；　當時現前聞，　　斯由此經典。",
        "translation": "He sees the buddhas before him and teaches for them; this is the scripture he hears before him at the time.",
        "source": "T17n0837_001:0895c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三界諸眾生，　　少有聞此經；　聞已生愛樂，　　為求佛乘故。」",
        "translation": "Few sentient beings in the three realms have heard this sūtra, and after hearing it, they become delighted in it because they seek the Buddha vehicle.\"",
        "source": "T17n0837_001:0895c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦葉婆羅門復白佛言：「希有世尊！",
        "translation": "It was then that Kāśyapa Brāhmaṇa again said to the Buddha, \"Sagely Bhagavān!",
        "source": "T17n0837_001:0895c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸眾生無有智慧，若聞如是無上無邊，乃至如是等眾生當無有智慧，若如是等無邊無上修多羅，聞已不能於此法中不生堅固樂欲。",
        "translation": "If sentient beings lack wisdom, if they hear such unsurpassed and limitless things, or if such sentient beings will lack wisdom, or if such limitless and unsurpassed sūtra is heard, they won't be able to abide in this teaching without a resolute, happy desire.",
        "source": "T17n0837_001:0895c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德世尊！",
        "translation": "Bhagavān!",
        "source": "T17n0837_001:0895c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何因緣既有如是妙法，然彼眾生而當虛過也？」",
        "translation": "What are the causes and conditions for having such a wonderful teaching that make it so sentient beings will be in vain?\"",
        "source": "T17n0837_001:0895c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告彼婆羅門言：「此三千大千世界，有百俱致(凡言俱致者，隋數千萬)諸魔宮殿。",
        "translation": "It was then that the Buddha addressed the Brāhmaṇa, \"In this world of 3,000 great one-thousand worlds, there are a hundred masses (commonly referred to as masses, meaning tens of millions) of Māra's palaces.",
        "source": "T17n0837_001:0895c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一一魔有俱致數魔眾眷屬，圍繞彼諸魔輩，常勤方便欲滅此經，作種種因緣，因彼因緣隨所在處作諸障礙。",
        "translation": "Each of those Māras has a retinue of Māra followers who surround those groups of Māras and always strive to extinguish this sūtra, creating various causes and conditions that cause them to act in ways that obstruct their locations.",
        "source": "T17n0837_001:0895c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0837_001:0895c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以三千大千世界所有眾生，皆悉得於阿羅漢果；若有善男子善女人聞此修多羅已，當發阿耨多羅三藐三菩提心。",
        "translation": "\"If all sentient beings in a world of 3,000 great one-thousand worlds were to attain the fruit of the arhat, and if there are good men and good women who hear this sūtra, they will give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0837_001:0895c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0895c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，令俱致數諸魔勤求方便欲滅此經，所以者何？",
        "translation": "What are the causes and conditions that cause the demons of the Kucha-numerous to diligently seek to extinguish this sūtra?",
        "source": "T17n0837_001:0895c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0895c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此修多羅是一切諸法種性根本，以是義故，俱致諸魔勤求方便欲滅此經。」",
        "translation": "This sūtra is the root of the seed nature of all dharmas, and because of this, it causes Māra to diligently seek ways to extinguish it.\"",
        "source": "T17n0837_001:0895c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告婆羅門：「今有修多羅，名曰『破魔眾會』。",
        "translation": "It was then that the Buddha addressed the Brāhmaṇa, \"Now there's a sūtra called 'Breaking the Congregation of Māra.'",
        "source": "T17n0837_001:0895c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等受持讀誦，即得破彼魔天眾會。",
        "translation": "If you memorize and recite it, you'll be able to refute that assembly of Māra gods.",
        "source": "T17n0837_001:0896a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0896a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日輪既出現時，能滅一切幽冥黑暗。",
        "translation": "\"It's like when the sun appears, it can extinguish all darkness.",
        "source": "T17n0837_001:0896a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是。",
        "translation": "It's thus and so forth.",
        "source": "T17n0837_001:0896a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0896a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說破魔眾會修多羅時，一切諸魔隱沒不現。",
        "translation": "When he explains that he'll destroy the congregation of Māra and assemble the sūtra, all the Māras disappear and don't appear.",
        "source": "T17n0837_001:0896a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0896a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者名為破魔眾會修多羅？」",
        "translation": "What is called a sūtra that destroys the congregation of Māra?\"",
        "source": "T17n0837_001:0896a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即說陀羅尼曰：「多(上)緻他(一)　阿[少/兔]謩大那(上)(二)　菩提三摩陀波那多(三)　伏哆(四)　紆伏哆(五)　怛怛羅伏哆(六)　尼興(蜎蠅反)伽魔(七)　波羅破(八)　多羅破(九)　哆噓(十)　哆隆(洛中反)伽磨伽魔那(十一)　毘唎磨(十二)　磨素磨(十三)　系(上聲)履婆伽磨(十四)　毘達囉魔(十五)　大囉麴磨(十六)　阿邏彌邏(十七)　伊迦叉邏那喻(十八)「婆羅門！",
        "translation": "It was then that the Bhagavān spoke the dhāraṇī, saying, \"Tāraketa(1) A[less/rabbit] Caitra(2) Bodhisambodhi(3) Vodā(4) Beast Vodā(5) Tantra Vodā(6) Nirgrantha(6) Gamma(7) Paranirmita(8) Paranirmita(9) Dāshu(10) Tārāṅgāma(11) Vīlāma(12) Māsukuma(13) Saṃbhogama(14) Vidyārāma(15) Mahārakauṣṭhila(16) Ārāḍmiḍū(17) Īkāraṇa(18), 'Brāhmaṇa!",
        "source": "T17n0837_001:0896a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此陀羅尼是。",
        "translation": "\"This is the dhāraṇī.",
        "source": "T17n0837_001:0896a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去、未來、現在諸佛世尊，同說此破魔眾會修多羅。",
        "translation": "All the buddhas, world-honored ones of the past, future, and present have taught this assemble of demon-busting sūtra together.",
        "source": "T17n0837_001:0896a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T17n0837_001:0896a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此破魔眾會修多羅時，一切魔宮皆悉震、動、大動、搖、大搖，一切諸魔各各從彼本座顛倒墮落不能語言。",
        "translation": "When he teaches this assemble of Māra-busting sūtra, all the Māra palaces are shaken, disturbed, greatly agitated, shaken, and greatly shaken, and all the Māras fall down from their original seats, confused, and unable to speak.",
        "source": "T17n0837_001:0896a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0837_001:0896a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等常為多人作不利益，常為多人作苦惱事令失利益，以是事故，現得如是恐怖果報。",
        "translation": "They always work for the disbenefit of many people, always do things that are painful and distressing for many people that cause them to lose their benefit, and as a result, they now experience such a fearful result.",
        "source": "T17n0837_001:0896a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛世尊常與一切眾生樂故，乃至慈悲喜捨，是故令彼諸波旬等皆生恐怖。",
        "translation": "Just as the Bhagavān always makes all sentient beings happy, so he has compassion, joy, and equanimity, which cause those pāpīyas and others to become frightened.",
        "source": "T17n0837_001:0896a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇas!",
        "source": "T17n0837_001:0896a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人，當能轉此發菩提修多羅者，於彼人所無有障礙，若諸天、龍、夜叉，若人非人，若魔、魔子、若魔眷屬，若水火刀杖，若惡行者，若諸惡獸，若身所惱、若意所苦，而有受者無有是處。",
        "translation": "\"If another person were able to change this arousal of the cultivation of bodhi, there would be no obstacle in their place, whether it's experienced by gods, dragons, yakṣas, humans or non-humans, Māra, Māra's sons, Māra's retinue, fire, water, swords, knives, bad actors, or unwholesome animals, whether they're afflicted by their bodies or suffer in their minds.",
        "source": "T17n0837_001:0896a21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0837_001:0896a25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子善女人，常為多人作利益事安樂故、常為多人作憐愍故、為諸天人等作覆護故，彼等諸善男子善女人慈行力故，應如是知。",
        "translation": "Those good men and good women who always work for the benefit and welfare of many people, always have compassion for many people, and always protect gods and humans should be known as such because of the compassionate actions of those good men and good women.",
        "source": "T17n0837_001:0896a25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇas!",
        "source": "T17n0837_001:0896a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子善女人，不作身惡行、不作口惡行、不作意惡行故，彼等諸苦事不逼其身亦不逼心。",
        "translation": "Because those good men and good women don't commit bad physical actions, don't commit bad verbal actions, and don't commit bad mental actions, those kinds of painful things don't constrain them physically or mentally.",
        "source": "T17n0837_001:0896a28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇas!",
        "source": "T17n0837_001:0896b02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此因緣故能滅一切苦。」",
        "translation": "This cause and condition makes it possible to cease all suffering.\"",
        "source": "T17n0837_001:0896b02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊重宣此義，而說偈言：「魔勤於此經，　　當欲壞滅之；　是故此經典，　　調御今為說。",
        "translation": "At the time, the Bhagavān declared this meaning and spoke in verse, \"Māra will want to destroy this sūtra if he diligently works on it; therefore, this is the sūtra that disciplines and now explains it for you.",
        "source": "T17n0837_001:0896b02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　令魔悉迷亂，　　叢聚坐戰慄；　相視不能言，　　此惡行果報。",
        "translation": "It causes Māra to be completely confused, to sit in a cluster and tremble, to look at each other and be unable to speak, and it's the result of such bad actions.",
        "source": "T17n0837_001:0896b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恐怖眾生故，　　常懷作惡心；　顛倒而墮落，　　是故得現報。",
        "translation": "Being afraid of sentient beings, they always harbor evil thoughts; they are mistaken and fall, which brings about their present retribution.",
        "source": "T17n0837_001:0896b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慈悲和合者，　　喜心有所說；　平等說法時，　　惡心意悉散。",
        "translation": "When someone who's kind and compassionate is in harmony with what's being said with joy, and when they explain the teaching equally, all bad thoughts are dispersed.",
        "source": "T17n0837_001:0896b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　降伏諸魔王，　　及散魔軍眾，　夜叉諸鬼等，　　自然皆墮落。",
        "translation": "He subdues Māra kings, scatters armies of Māra, and naturally falls down with yakṣas and ghosts.",
        "source": "T17n0837_001:0896b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼力杖不害，　　水火不漂然；　言說呪詛毒，　　不能有傷害。",
        "translation": "Their powerful staffs won't harm them, and they won't be swayed by water or fire; their words, curses, and poison cannot harm them.",
        "source": "T17n0837_001:0896b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　逼身及逼心，　　彼等不曾有；　常當所作誓，　　身口如是住。",
        "translation": "They never constrain body or mind; they always make a vow to thus abide in body and speech.",
        "source": "T17n0837_001:0896b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　閉塞諸惡道，　　遠離一切難；　諸魔悉摧滅，　　為說此經故。",
        "translation": "He'll shut out bad paths, free himself from all difficulties, and destroy all Māra for the sake of teaching this sūtra.",
        "source": "T17n0837_001:0896b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切法巧智，　　若欲度彼岸；　須聞此經典，　　聞已即能學。",
        "translation": "With the knowledge of all the skills of the Dharma, if someone wants to reach the other shore, they must hear this sūtra, and then they'll be able to study it after hearing it.",
        "source": "T17n0837_001:0896b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能學此經，　　無畏諸菩薩；　最上覺菩提，　　是向菩提句。」",
        "translation": "If they can study this sūtra, they'll be fearless of the bodhisattvas; supreme awakening and enlightenment are the words that lead to enlightenment.\"",
        "source": "T17n0837_001:0896b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經時，迦葉婆羅門及諸大會眾，乾闥婆、天人、阿修羅等，聞佛所說，歡喜奉行。",
        "translation": "When the Buddha taught this sūtra, the Kāśyapa Brahmins and the great assembly of gandharvas, gods, humans, asuras, and others who heard what he taught rejoiced and handed it down.",
        "source": "T17n0837_001:0896b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出生菩提心經",
        "translation": "Sutra of the Birth of the Mind of Enlightenment",
        "source": "T17n0837_001:0896b26_0",
        "is_bad_quality": false
    }
]