[
    {
        "source_sentence": "三慧經",
        "translation": "Sutra on the Three Kinds of Wisdom",
        "source": "T17n0768_001:0701b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "失譯人名今附涼錄",
        "translation": "Lost Translator's Name Presently Attached to the Cool Record",
        "source": "T17n0768_001:0701b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛常欲得三人，一者、信；二者、問；三者、行。",
        "translation": "The Buddha always desires three people: one, faith; two, questions; and three, actions.",
        "source": "T17n0768_001:0701b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人但信不喜，已作為信，不欲行為。",
        "translation": "Some people only believe but don't delight in what they've done, and they've made it a point to believe and not want to do it.",
        "source": "T17n0768_001:0701b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜有三亡：一者、不布施；二者、不行戒；三者、不定意。",
        "translation": "There are three negations of joy: one, not giving; two, not practicing the precepts; and three, not setting one's mind on them.",
        "source": "T17n0768_001:0701b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當滅思想乃得道，要在不念。",
        "translation": "The path will be attained when thoughts cease, and the essential thing is not to think about them.",
        "source": "T17n0768_001:0701b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已滅思想，色亦滅，識亦滅。",
        "translation": "Once thought has ceased, form will also cease, and consciousness will also cease.",
        "source": "T17n0768_001:0701b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心有所念，是為四所有對，是為想——當有想、當無想、不離想、當離想、不出想，還就。",
        "translation": "When the mind is mindful, these are the four oppositions, which are perceptions-those that will exist, those that will not exist, those that won't exist, those that will be free from perceptions, and those that won't exist in return.",
        "source": "T17n0768_001:0701b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當有想者，謂道想；當無想者，謂無色想；不離想者，謂不離經行想；當離想者，當離生死想；不出想，謂無道想，不出十二門；還就者，謂人生死，便不得脫。",
        "translation": "'When conceptions exist, they're conceptions of the path; when conceptions don't exist, they're conceptions of formlessness; when conceptions don't part, they're conceptions of sūtras and practices; when conceptions part, they're conceptions of birth-and-death; when conceptions don't part, they're conceptions of the absence of the path and don't exit the 12 sense gates; and when conceptions return, they mean that people are born dead and then can't be liberated.'",
        "source": "T17n0768_001:0701b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身譬如地，善意如禾，惡意如草。",
        "translation": "A body is like the ground, good intentions are like grass, and bad intentions are like weeds.",
        "source": "T17n0768_001:0701c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不去草穢，禾實不成。",
        "translation": "Unless the grass is removed and defiled, the grass really won't grow.",
        "source": "T17n0768_001:0701c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人不去惡意，亦不得道。",
        "translation": "When a person doesn't go without malice, he also can't attain the path.",
        "source": "T17n0768_001:0701c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有瞋恚，是為地生蒺[卄/梨]。",
        "translation": "When a person has anger, this is the ground that produces thorns [20/ears].",
        "source": "T17n0768_001:0701c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善意如電，來即明，去便復冥；邪念如雲覆日時，不見己惡意起，不見道。",
        "translation": "A good intention is like lightning, which comes to light and goes away again in the dark; when wrong thoughts are like clouds covering the sun, they don't see their own ill-will rising, and they don't see the path.",
        "source": "T17n0768_001:0701c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學者，有苦；不學者，無有苦。",
        "translation": "Those who train have suffering, but those who don't train have no suffering at all.",
        "source": "T17n0768_001:0701c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學者有苦，譬如人種，當先犁去草穢，便多得收，是為先苦。",
        "translation": "A trainee has suffering, like when a person planting seeds first plows away the filth, then they'll reap much success; this is the first suffering.",
        "source": "T17n0768_001:0701c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不學者無有苦者，譬如地不犁續，自生蒺[卄/梨]諸惡物，是為不學無有苦。",
        "translation": "When a person doesn't learn, there's no suffering, like when the ground isn't plowed continuously and thorns [20/ears] of bad things arise on their own, this is called not learning and having no suffering.",
        "source": "T17n0768_001:0701c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行道，第一、可禁苦；第二、可禁樂；三者、不可禁苦；四者、不可禁樂。",
        "translation": "When they practice the path, the first is that they can prohibit suffering; the second is that they can prohibit pleasure; the third is that they can't prohibit suffering; and the fourth is that they can't prohibit pleasure.",
        "source": "T17n0768_001:0701c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能樂得樂，便行道；能苦得苦，便行道。",
        "translation": "If someone can enjoy themselves and attain happiness, then they'll practice the path; if they can suffer and attain suffering, then they'll practice the path.",
        "source": "T17n0768_001:0701c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人行道得苦，便畏生死，能行道如是，不可與樂。",
        "translation": "When someone practices the path and attains pain, they fear birth and death; someone who practices the path as such can't partake of pleasure.",
        "source": "T17n0768_001:0701c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人得樂能行道，意不苦，如是不可與苦。",
        "translation": "When someone attains happiness and is able to practice the path, their thoughts aren't painful; thus, they can't be given pain.",
        "source": "T17n0768_001:0701c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人得樂能行道，得苦亦能行道，如是可與樂，不可與苦。",
        "translation": "There's a person who attains happiness and is able to practice the path and attains suffering and is also able to practice the path; thus, they can experience happiness but not suffering.",
        "source": "T17n0768_001:0701c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人得苦不能行道，得樂亦不能行道，如是當與苦，不可與樂。",
        "translation": "If someone attains happiness and can't practice the path and attains happiness, they can't practice the path; thus, they will be given happiness but not suffering.",
        "source": "T17n0768_001:0701c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "都有四求：一者、用身故求；二者、用願故求；三者、用癡故求；四者、用行故求。",
        "translation": "There are four kinds of seeking: 1. seeking because of the body; 2. seeking because of the wish; 3. seeking because of delusion; and 4. seeking because of actions.",
        "source": "T17n0768_001:0701c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人欲保身、長壽，是為身求；欲得豪貴、妻子、珍寶，是為願求；祠祀、鎮壓，欲從得福，是為癡求；所行非法，欲家安隱得道，是為行求。",
        "translation": "A person's desire to preserve his body and live a long life is a physical pursuit; his desire to obtain wealth, a wife, and treasure is a vow; his desire to obtain merit from sacrifice and suppression is a deluded pursuit; and his desire to live in peace and attain the path while practicing what's not the truth is a practice pursuit.",
        "source": "T17n0768_001:0701c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有三不可保：一者、喜意；二者、財寶；三者、人命。",
        "translation": "There are three things a person can't protect: first, joy and attention; second, possessions and treasures; and third, human life.",
        "source": "T17n0768_001:0701c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身亦可念，亦不可念；計身諸惡露是為可念，意墮五樂是不可念。",
        "translation": "The body can be thought of, but it can't be thought of; imagining the bad physical appearances is thinkable, and falling into the five pleasures with the mind is not thinkable.",
        "source": "T17n0768_001:0701c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善亦可念，亦不可念。",
        "translation": "He may think of what's good, but he mustn't think of it.",
        "source": "T17n0768_001:0702a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂得道意，是可念；不可念者，謂以得道意，當轉增上。",
        "translation": "This is called the mind that has attained the path, which can be mindful, and the mind that can't be mindful, which is the mind that will lead to increase because it has attained the path.",
        "source": "T17n0768_001:0702a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡亦可念，亦不可念。",
        "translation": "It's okay to think of evil, but it's also not okay to think of it.",
        "source": "T17n0768_001:0702a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有過自悔，是可念；意起墮惡，是不可念。",
        "translation": "Repenting of one's faults is mindful, but when thoughts arise and fall into evil, they're not mindful.",
        "source": "T17n0768_001:0702a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨正念邪，是為惑；不別是非，是為疑。",
        "translation": "To abandon right and think of wrong is confusion, and to not distinguish right from wrong is doubt.",
        "source": "T17n0768_001:0702a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡有二事：一為本，二為利。",
        "translation": "Evil has two things: one is the root, and the other is gain.",
        "source": "T17n0768_001:0702a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所作行是為本，受行福是為利，除是便得道。",
        "translation": "Doing what's undertaken is the root, and receiving the benefits of doing it is the gain; removing this will lead to the path.",
        "source": "T17n0768_001:0702a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪護謂已得復貪。",
        "translation": "To crave and guard means to crave again after attaining it.",
        "source": "T17n0768_001:0702a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念色為貪，上為非一，意滅故。",
        "translation": "Mindfulness of form is craving, and the above is not the same; it's because of the cessation of mindfulness.",
        "source": "T17n0768_001:0702a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護貪為得道，貪護為墮生死。",
        "translation": "To guard greed is to attain the path, and to guard greed is to fall into birth-and-death.",
        "source": "T17n0768_001:0702a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已得復護，故為貪護。",
        "translation": "To guard again after attaining it is therefore to guard covetousness.",
        "source": "T17n0768_001:0702a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂食者，謂歡喜飽。",
        "translation": "'Enjoying food' means to be happy and satisfied.",
        "source": "T17n0768_001:0702a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念食者，謂念三十七品經便飽。",
        "translation": "Those who eat with mindfulness are fed by mindfulness of the thirty-seven texts.",
        "source": "T17n0768_001:0702a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識食者，謂樂法。",
        "translation": "\"Food for consciousness is enjoyment of the Dharma.",
        "source": "T17n0768_001:0702a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已隨痛痒為栽，求後復念為識求。",
        "translation": "Supplying it with pain and itching afterwards is planting it, and mindfulness after seeking it is consciousness seeking.",
        "source": "T17n0768_001:0702a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世俗事皆屬身，一切名字皆屬意，一切不犯皆屬戒，除是無所有為道。",
        "translation": "All worldly things belong to the body, all names belong to the mind, and all non-violations belong to the precepts, except for this, which is the path of nothingness.",
        "source": "T17n0768_001:0702a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一法復壞道行，謂不精進；一法壞人，謂慳貪。",
        "translation": "One thing that also undermines the practice of the path is a lack of effort, and one thing that undermines people is stinginess and greed.",
        "source": "T17n0768_001:0702a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外惡因緣來向人，不受為忍；自身作惡，不出為辱己。",
        "translation": "When external bad causes come to a person, not accepting them is tolerated; doing evil yourself is not an insult.",
        "source": "T17n0768_001:0702a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去莫復念，未來亦莫待，今見在當斷。",
        "translation": "Don't think about the past again, and don't wait for the future; this view will be stopped in the future.",
        "source": "T17n0768_001:0702a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非人所有，莫得憂；一切有意，皆為結。",
        "translation": "Don't be concerned about something that doesn't belong to anyone, for all intentions are bonds.",
        "source": "T17n0768_001:0702a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善意亦忘，有惡意亦忘。",
        "translation": "He forgets even when he has good intentions, and he forgets even when he has ill intentions.",
        "source": "T17n0768_001:0702a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復用三因緣故：一者、不習念；二者、不數念；三者、不著意倒。",
        "translation": "It's also because of three causes: first, not remembering by habituation; second, not remembering by number; and third, not being attached to mistaken thoughts.",
        "source": "T17n0768_001:0702a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是三事不復忘。",
        "translation": "These three things are not again forgotten.",
        "source": "T17n0768_001:0702a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從有可得無，有不可得有，是謂三十七品經意。",
        "translation": "From existence can come nonexistence, and existence cannot be obtained from existence is the meaning of the thirty-seven factors of the sutra.",
        "source": "T17n0768_001:0702a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生死意，生死無有數，所以覺者，種忘故。",
        "translation": "The intention of birth-and-death is that birth-and-death has no number, which is why it's awakened because of various forgetfulnesses.",
        "source": "T17n0768_001:0702a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本意欲坐行道十日，不能竟十日，前世福薄故。",
        "translation": "His original intention was to sit on the path for ten days, but he couldn't finish it for ten days because his merits from previous lives were weak.",
        "source": "T17n0768_001:0702a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多福者，欲十日坐行便得。",
        "translation": "Those with lots of merit want to sit and practice for ten days, and then they'll be able to do so.",
        "source": "T17n0768_001:0702a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身不欲行，用劣瘦極故；意不欲行，不念死敗苦空故。",
        "translation": "He doesn't want to practice with his body because his exertion is weak and lean, and he doesn't want to practice with his mind because he's not mindful of the emptiness of the suffering of death and defeat.",
        "source": "T17n0768_001:0702a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧有四相：一者、聞善語便不轉；二者、已聽便受著意；三者、已意當思惟念；四者、意已思惟念。",
        "translation": "There are four aspects of wisdom: 1. when they hear good words, they don't change; 2. when they hear them, they're attracted to their mind; 3. when they think about their mind, they reflect on it; and 4. when they have reflected on their mind.",
        "source": "T17n0768_001:0702a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復重問欲知其意，倒是少慧。",
        "translation": "Again, asking repeated questions about wanting to know their thoughts is mistakenly a lack of wisdom.",
        "source": "T17n0768_001:0702b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五百人行道，得定意，恐復失之，因取人令殺。",
        "translation": "Five hundred people practicing the path have attained a concentrated mind, but they're afraid they'll lose it again, so they take someone and order them to kill them.",
        "source": "T17n0768_001:0702b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人報言：「殺道人，令我得重罪。」",
        "translation": "The person retaliates, saying, \"Killing the person of the Way will cause me to commit a serious sin.\"",
        "source": "T17n0768_001:0702b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道人言：「如人有怨家，欲殺之；不是身，為是我怨家，汝為我殺。",
        "translation": "The practitioner says, 'Suppose a person has a grudge and wants to kill them; it's not the body, but it's my grudge, so you'll kill them for me.'",
        "source": "T17n0768_001:0702b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：『當殺意，勿殺身。』」",
        "translation": "The Buddha says, 'You must kill the mind, not the body.'\"",
        "source": "T17n0768_001:0702b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有道人得定意，時野火燒之，衣不然。",
        "translation": "When a person of the Way attains a concentrated mind, a wildfire burns his clothes, but they don't fit.",
        "source": "T17n0768_001:0702b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人見之，謂是鬼，便斫之，刀折不入。",
        "translation": "When people see it, they think it's a ghost, so they chop it down, but it won't break or enter with a sword.",
        "source": "T17n0768_001:0702b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用心一故，不燒；柔軟故，不入。",
        "translation": "Because their minds are unified, they won't be burned; because they're gentle, they won't enter.",
        "source": "T17n0768_001:0702b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有道人得定意，弟子呼之飯，不覺。",
        "translation": "A man of the Way attains a concentrated state of mind, and his disciple calls him for food but doesn't realize it.",
        "source": "T17n0768_001:0702b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因前牽臂，臂申丈餘，弟子大恐，因取結之。",
        "translation": "He takes his arm, and it's about ten feet long. The disciple is terrified, so he ties it.",
        "source": "T17n0768_001:0702b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意結不可，復取解之。",
        "translation": "He then tried to untie the knot, but he tried again.",
        "source": "T17n0768_001:0702b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師禪覺，苦臂痛，問弟子，白如是。",
        "translation": "The teacher felt pain in his arm as he was meditating, and asked the disciple if he could do so.",
        "source": "T17n0768_001:0702b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師言：「汝不解者，誤折我臂。」",
        "translation": "The teacher said, \"If you don't untie it, you'll mistakenly break my arm.\"",
        "source": "T17n0768_001:0702b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人得定意，柔軟如綿，在母腹中亦爾。",
        "translation": "When a person attains concentration, his mind is as flexible as cotton, even when he's in his mother's womb.",
        "source": "T17n0768_001:0702b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三因緣，覺人無所知：一者、問不如對；二者、不能問；三者、不能語。",
        "translation": "There are three reasons why a person might not know: first, they can't answer a question; second, they can't ask; and third, they can't speak.",
        "source": "T17n0768_001:0702b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取要要經，譬喻說人逢大水，但當取珍寶去。",
        "translation": "The Essentials of Gathering sūtra is an analogy that says a person encountering a great flood should simply take a treasure and leave.",
        "source": "T17n0768_001:0702b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻人在世間但當取善意去。",
        "translation": "It's a metaphor for a person in the world who simply takes good intentions and leaves.",
        "source": "T17n0768_001:0702b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不所念，不得道。",
        "translation": "Without mindfulness, they won't attain the path.",
        "source": "T17n0768_001:0702b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0768_001:0702b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不念道因緣。",
        "translation": "\"They don't think about the causes and conditions of the path.",
        "source": "T17n0768_001:0702b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有道因緣，能得道。",
        "translation": "With the causes and conditions of the path, they can attain the path.",
        "source": "T17n0768_001:0702b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂六波羅蜜、安般守意、三十七品經，是為道因緣。",
        "translation": "These are the six perfections, the mindfulness of mindfulness of breathing, and the 37 lessons of the scriptures, which are the causes and conditions of the path.",
        "source": "T17n0768_001:0702b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五因緣可信：一者、信佛；二者、信法；三者、信戒；四者、信經；五者、信善知識。",
        "translation": "There are five causes and conditions that are believable: 1) faith in the Buddha, 2) faith in the Dharma, 3) faith in the precepts, 4) faith in the sūtras, and 5) faith in a good teacher.",
        "source": "T17n0768_001:0702b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信是五事，得道。",
        "translation": "Believing these five things attains the path.",
        "source": "T17n0768_001:0702b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語有四法：一者、直語；二者、分別語；三者、問語；四者、止語。",
        "translation": "There are four ways to speak: 1. straight talk; 2. discriminating talk; 3. questioning talk; and 4. stopping talk.",
        "source": "T17n0768_001:0702b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直語者，有黠人墮道得因緣直說。",
        "translation": "Direct speech is when a crafty person who falls into the path attains the cause and explains it directly.",
        "source": "T17n0768_001:0702b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別語者，為所以所受不諦，當分別本末重語說。",
        "translation": "Discriminating speech is when a person speaks repeatedly and discriminatingly about what's received because it's not true.",
        "source": "T17n0768_001:0702b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問語者，人自意為是，墮因緣問之即自知。",
        "translation": "Questioning speech is when a person thinks this is the cause and condition for falling into it and then knows it for themselves.",
        "source": "T17n0768_001:0702b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止語者，佛所不說，亦不說。",
        "translation": "Stopping speech is something the Buddha doesn't say, and it's not said.",
        "source": "T17n0768_001:0702b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四因緣問：一者、一切問；二者、分別問；三者、問問；四者、止問。",
        "translation": "There are four kinds of questions about causes and conditions: 1. all questions; 2. discriminating questions; 3. questions; and 4. stopping questions.",
        "source": "T17n0768_001:0702b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世間非常、苦、空，行道得安隱已，說是為應語，是為一切問。",
        "translation": "After all worldly existences are impermanent, painful, and empty, and the path of practice has been made peaceful, this is said to be a response, and this is an all-inclusive question.",
        "source": "T17n0768_001:0702b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人求問眼事，莫持耳往報，是為分別問。",
        "translation": "If someone asks about the eye and doesn't respond with their ear, this is a discriminating question.",
        "source": "T17n0768_001:0702c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人持白物來，言是黑物，因持黑物問之，見為何等？",
        "translation": "If someone comes with a white object and says it's a black object, and they ask about it because they have a black object, what do they see?",
        "source": "T17n0768_001:0702c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為問問。",
        "translation": "\"This is asking questions.",
        "source": "T17n0768_001:0702c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人來問道何類，因報寒何等類；若問意何等類，因報風何等類；若問無為何等類，因報空何等類；是止問。",
        "translation": "If someone comes and asks what kind of path it is, what kinds of cold are the causes and rewards, what kinds of thoughts are the causes and rewards, what kinds of winds are the causes and rewards, and what kinds of inaction are the causes and rewards of emptiness, this is stopping the questioning.",
        "source": "T17n0768_001:0702c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四顛倒：一者、非常，人意以為常；二者、以苦，人謂樂；三者、萬物皆空，人謂為實；四者、非身，貪以為有身。",
        "translation": "There are four mistaken attachments: first, what people think is extraordinary and take for normality; second, what people think is pleasant because it's painful; third, what people think is real because everything is empty; and fourth, what's not the body and what people crave because it's the body.",
        "source": "T17n0768_001:0702c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人墮顛倒如是，非常計常，以苦為樂，以空為實，非身以作身。",
        "translation": "Man falls into the error of thinking of things as permanent, mistaking suffering for pleasure, emptiness for reality, and what's not body for body.",
        "source": "T17n0768_001:0702c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人如是意，便得道。",
        "translation": "With this intention, a person attains the path.",
        "source": "T17n0768_001:0702c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人意墮四顛倒故，計是為我身。",
        "translation": "Because a person's mind has fallen into the four mistaken attachments, he imagines this to be the self-body.",
        "source": "T17n0768_001:0702c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦挍計身中無所有；已無所有，便墮空；已墮空，便為無身；已無身，便墮無為。",
        "translation": "When he evaluates and imagines that there's nothing in his body, once he has nothing, he falls into emptiness; once he falls into emptiness, he becomes bodiless; and once he has no body, he falls into nothingness.",
        "source": "T17n0768_001:0702c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有四癡，常著四顛倒：一者、萬物非常，自以為常；二者、天下皆苦，人持作樂；三者、天下空，人以為有；四者、身非身，不可保，人以為身；五者、月始生時拜；六者、十五日盛明時，反踞視之；七者、女小時從人抱；八者、女大不可得見。",
        "translation": "There are four delusions in human beings, and they are always attached to four mistaken attachments: 1. They think of themselves as permanent when everything is impermanent; 2. They think the whole world is painful, but they take it for pleasure; 3. They think the world is empty, but they think it's existent; 4. They think their body is not their body and cannot be preserved; 5. They worship the moon when it first appears; 6. They sit back and look at it when it's bright for fifteen days; 7. They let a woman be carried when she's young; 8. They can't see a woman when she's large.",
        "source": "T17n0768_001:0702c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四貴，亦有四賤：一者、道貴，人賤；二者、珍寶貴，人賤；三者、官位貴，人賤；四者、黠貴，癡賤。",
        "translation": "There are four things that are valuable and four things that are cheap: 1. the path is valuable, but people are cheap; 2. valuables are cheap; 3. an official position is valuable, but people are cheap; and 4. intelligence is valuable, but delusion is cheap.",
        "source": "T17n0768_001:0702c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「人得善知識，為得佛半！」",
        "translation": "Ānanda said, \"When a person attains a good teacher, that's half of what it takes to become a Buddha!\"",
        "source": "T17n0768_001:0702c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人得善知識，為得佛道。",
        "translation": "The Buddha said, \"A person attains the Buddha Way when he attains a good teacher.",
        "source": "T17n0768_001:0702c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識難得！」",
        "translation": "A good teacher is difficult to attain!\"",
        "source": "T17n0768_001:0702c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為道德？",
        "translation": "What is meant by morality?",
        "source": "T17n0768_001:0702c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信為道；制身、口、意為德。",
        "translation": "Faith is the path; control of body, speech, and mind are virtues.",
        "source": "T17n0768_001:0702c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人當有三知識：一者、富家；二者、事貴；三者、大尊者。",
        "translation": "A person should have three kinds of knowledge: one, a wealthy family; two, serving nobles; and three, a great venerable.",
        "source": "T17n0768_001:0702c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以布施是為富家，以持戒為事貴者，守意念道為是事大尊者。",
        "translation": "This is a wealthy family that gives alms, a noble person that observes precepts, and a great venerable person who observes the mindfulness of the path.",
        "source": "T17n0768_001:0702c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有內治生、外治生：索錢財、諸珍寶是為外治生；守意念道是為內治生。",
        "translation": "There's birth by internal discipline and birth by external discipline: seeking money and possessions and treasures is birth by external discipline, and keeping the mindfulness of the path is birth by internal discipline.",
        "source": "T17n0768_001:0702c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人不能自伏意，反欲伏他人意；能自伏意，他人意悉可伏。",
        "translation": "A person can't subdue their own thoughts but wants to subdue the thoughts of others; when they can subdue their own thoughts, the thoughts of others can be subdued.",
        "source": "T17n0768_001:0702c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有內力、有外力，有內色、有外色，有內識、有外識。",
        "translation": "There's internal power and external power, internal form and external form, and internal consciousness and external consciousness.",
        "source": "T17n0768_001:0703a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能制惡意，是為內力；能有所作，舉重瞋恚，是為外力。",
        "translation": "Being able to restrain ill will is internal power, and being able to do something and raise anger is external power.",
        "source": "T17n0768_001:0703a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛痒、思想、生死、識是為內色；地、水、火、風、空是為外色。",
        "translation": "Pain and itch, thought, birth and death, and consciousness are internal forms; earth, water, fire, wind, and space are external forms.",
        "source": "T17n0768_001:0703a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意念為內識，眼見為外識。",
        "translation": "Mentation is the internal consciousness, and visual views are the external consciousnesses.",
        "source": "T17n0768_001:0703a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四事大難：一者、與得道人共會大難，謂十二賢者；二者、聞經入心難，謂在八難處；三者、如本觀難，謂墮四顛倒；四者、如法行難，謂不能持戒。",
        "translation": "There are four things that are great difficulties: first, the great difficulty of meeting with someone who has attained the way, which are the 12 wise men; second, the difficulty of hearing the sūtras and entering their minds, which are the eight difficult places; third, the difficulty of observing things as they are, which is falling into the four mistaken attachments; and fourth, the difficulty of practicing according to the teaching, which is being unable to observe the precepts.",
        "source": "T17n0768_001:0703a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五事，求道大難：一者、年老；二者、疾病；三者、縣官；四者、盜賊；五者、飢渴。",
        "translation": "There are five things that make seeking the path very difficult: 1. old age, 2. illness, 3. magistrates, 4. thieves, and 5. hunger and thirst.",
        "source": "T17n0768_001:0703a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為五事，求道大難。",
        "translation": "These are the five things that make seeking the path very difficult.",
        "source": "T17n0768_001:0703a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五事難：一者、值佛世難；二者、聞經難；三者、得善師難；四者、得善人難；五者、得作人難。",
        "translation": "There are five things that are difficult: 1. it's difficult to meet the Buddha in his lifetime; 2. it's difficult to hear the sūtras; 3. it's difficult to get a good teacher; 4. it's difficult to get a good person; and 5. it's difficult to become a human being.",
        "source": "T17n0768_001:0703a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五難：一者、貧，能布施難；二者、豪貴，能忍辱者難；三者、有事對吏，不欺者難；四者、與端正女人同床，意不亂者難；五者、制人命，不得傷害者難。",
        "translation": "There are five difficulties: 1. difficulty in being poor and able to give; 2. difficulty in being wealthy and able to tolerate humiliation; 3. difficulty in not deceiving an official in a situation; 4. difficulty in sharing a bed with a decent woman and not having one's thoughts disturbed; 5. difficulty in controlling human life and not harming it.",
        "source": "T17n0768_001:0703a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有七難：一者、受經，能問難；二者、聞經，解意難；三者、與多智人對語，能自解難；四者、自教，復能教人者難；五者、自安隱，亦令人安隱難；六者、己自定意，亦令人定意難；七者、常不離法，至得佛道難。",
        "translation": "There are seven difficulties: 1. it's difficult to accept a sūtra and be able to ask questions; 2. it's difficult to hear a sūtra and understand its meaning; 3. it's difficult to speak to someone with much knowledge and be able to understand for yourself; 4. it's difficult to teach yourself and be able to teach others; 5. it's difficult to make yourself comfortable and make others comfortable; 6. it's difficult to fix your own mind and make others fix theirs; and 7. it's difficult to always remain indifferent to the teaching and attain the Buddha Way.",
        "source": "T17n0768_001:0703a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十八事，人於世間甚大難：一者、值佛世難；二者、正使值佛，成就得為人難；三者、正使成得為人，在中國生難；四者、正使在中國，種姓家難；五者、正使在種姓家，四支、六情完具難；六者、正使四支、六情完具，有財產難；七者、正使得財產，得善知識難；八者、正使得善知識，智慧難；九者、正使智慧，謹慎心難；十者、正使謹慎心，能布施難；十一、正使能布施，欲得賢善有德人難；十二者、正使得賢善有德人，往至其所難；十三者、正使往至其所，得宜適難；十四者、正使得宜適，聽問難；十五者、正使受聽問，說忠政難；十六者、正使忠政，解智慧難；十七者、正使得解智慧，能受深經難；十八者、正使能解深經，復重難。",
        "translation": "有十八事，人於世間甚大難：一者、值佛世難；二者、正使值佛，成就得為人難；三者、正使成得為人，在中國生難；四者、正使在中國，種姓家難；五者、正使在種姓家，四支、六情完具難；六者、正使四支、六情完具，有財產難；七者、正使得財產，得善知識難；八者、正使得善知識，智慧難；九者、正使智慧，謹慎心難；十者、正使謹慎心，能布施難；十一、正使能布施，欲得賢善有德人難；十二者、正使得賢善有德人，往至其所難；十三者、正使往至其所，得宜適難；十四者、正使得宜適，聽問難；十五者、正使受聽問，說忠政難；十六者、正使忠政，解智慧難；十七者、正使得解智慧，能受深經難；十八者、正使能解深經，復重難。",
        "source": "T17n0768_001:0703a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為十八事，人於世間大難。",
        "translation": "These are the 18 things that make it very difficult for people to live in the world.",
        "source": "T17n0768_001:0703b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有八處人，佛無那何？",
        "translation": "What are the eight places where a person lives that the Buddha doesn't have?",
        "source": "T17n0768_001:0703b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、瘂人；二者、聾人；三者、地獄中人；四者、餓鬼中人；五者、畜生中人；六者、邊地不知法義；七者、長生二十八天上；八者、受不精進行。",
        "translation": "1. a dumb person; 2. a deaf person; 3. a person in hell; 4. a person among hungry ghosts; 5. a person in an animal; 6. a person in a border land who doesn't know the meaning of the teaching; 7. a person in the 28 heavens who's born forever; and 8. a person who's subject to unrefined conduct.",
        "source": "T17n0768_001:0703b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為八處人，佛無那何。",
        "translation": "These are the eight abodes of people, and the Buddha has nothing to say about them.",
        "source": "T17n0768_001:0703b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五百人自說言：「我善。」",
        "translation": "There are 500 people who say to themselves, \"I'm good.\"",
        "source": "T17n0768_001:0703b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「汝當善，當隨我後。」",
        "translation": "The Buddha said, \"You must be good, and you will follow me.\"",
        "source": "T17n0768_001:0703b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：「諾！」",
        "translation": "The people said, \"No!\"",
        "source": "T17n0768_001:0703b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛便行入火中，五百人皆止住，無敢隨者，言善人至難得。",
        "translation": "The Buddha then marched into the fire, and five hundred people stopped, daring not to follow, saying that a good person is extremely difficult to attain.",
        "source": "T17n0768_001:0703b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人問佛：「佛教人作善，何等益？」",
        "translation": "Someone asked the Buddha, \"How will it benefit a Buddhist who does good deeds?\"",
        "source": "T17n0768_001:0703b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「天下人惱，我故教之耳！」",
        "translation": "The Buddha said, \"People everywhere are vexed, so I've taught them!\"",
        "source": "T17n0768_001:0703b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人復言：「人有心，當恣之。」",
        "translation": "People also say, \"A person's mind is wanton, so he must abandon it.\"",
        "source": "T17n0768_001:0703b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「坐天下人恣心故，我止住百劫，乃得佛道。」",
        "translation": "The Buddha said, \"As a result of sitting under the sun while people abandon their minds, I've stopped for a hundred eons and then attained the Buddha Way.\"",
        "source": "T17n0768_001:0703b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道有七事：一者、意喜布施不欲餘；二者、但欲聞；三者、但信；四者、但持戒；五者、但欲行；六者、欲學慧；七者、但欲脫去。",
        "translation": "There are seven things in the path: 1. a desire to like generosity and nothing else; 2. a desire only to hear; 3. a desire only to believe; 4. a desire only to observe precepts; 5. a desire only to practice; 6. a desire to train in wisdom; and 7. a desire only to be liberated.",
        "source": "T17n0768_001:0703b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在世時得脫，轉後世但學慧，復轉後世但欲行，復轉後世但持戒，復轉後世但信，復轉後世但欲聞，復轉後世但欲布施。",
        "translation": "When the Buddha was alive and attained liberation, he would change to a later life and only train in wisdom, then to a later life and only desire to practice, then to a later life and only observe precepts, then to a later life and only believe, then to a later life and only desire to hear, and then to a later life and only desire to give alms.",
        "source": "T17n0768_001:0703b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不但布施當復聞，不但聞當復信，不但信當復持戒，不但持戒當復行，不但行當復慧，不但慧當復脫去，是七事當并行。",
        "translation": "Not only will generosity be heard again, not only will hearing be followed by faith, not only will faith be followed by observance of precepts, not only will observance of precepts be followed by practice, not only will practice be followed by wisdom, and not only will wisdom be followed by liberation, but these seven things will go hand in hand.",
        "source": "T17n0768_001:0703b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五叢殘：一者、上世人長壽，今世人短壽；二者、上世人端正桃華色，今世人醜惡；三者、上世人多得道，今世人不能得；四者、上世人博達，通知經要，今世人不能通知；五者、上世人安隱，今世人多疾瘦。",
        "translation": "There are five kinds of disabilities: first, the world of the former world's longevity and the present world's shortevity; second, the former world's upright, peachy appearance and the present world's ugly appearance; third, the former world's many attainers of the Way and the present world's inability to attain it; fourth, the former world's knowledgeable people who were informed of the sūtras' essentials and the present world's inability to be informed; and fifth, the former world's peace and quiet and the present world's many illnesses and wasting.",
        "source": "T17n0768_001:0703c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為五叢殘世。",
        "translation": "These are the five piles of remnants of the world.",
        "source": "T17n0768_001:0703c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有長壽者道人，大富，財產無數，好作布施。",
        "translation": "There was a long-lived religious man who was very wealthy, had incalculable possessions, and liked to make alms.",
        "source": "T17n0768_001:0703c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「卿作布施大多！」",
        "translation": "Someone said, \"You make a lot of alms!\"",
        "source": "T17n0768_001:0703c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道人報言：「我從佛聞，人在世間往來生死，其日不可數。",
        "translation": "The Wayfarer replied, \"I've heard from the Buddha that there are incalculable days in the world when people are reborn and die.",
        "source": "T17n0768_001:0703c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我所有布施，尚不能日用一錢，何以為多！",
        "translation": "Now, with all the alms I've given, I still can't spend one penny a day, so how could I spend more?",
        "source": "T17n0768_001:0703c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說人得一切天下珍寶，不如聞佛一言。",
        "translation": "The Buddha said that a person couldn't obtain all the world's treasures as well as hear a single word from the Buddha.",
        "source": "T17n0768_001:0703c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0768_001:0703c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "徒多財產，不能離世間故。」",
        "translation": "They have so much property that they can't leave the world.\"",
        "source": "T17n0768_001:0703c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山中揭鳥，尾有長毛，毛有所著，便不敢復去，愛之恐拔，罷為獵者所得，身坐分散而為一毛故。",
        "translation": "A bird in the mountains with a long hair on its tail won't dare to go back; it's loved and feared to be plucked, so it might fall prey to a hunter and become a hair while sitting scattered.",
        "source": "T17n0768_001:0703c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人散意念，恩愛、財產不得脫苦，用貪婬故。",
        "translation": "When people scatter their thoughts, affection and possessions aren't freed from suffering because of their craving and lust.",
        "source": "T17n0768_001:0703c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人治生，譬如蜂作蜜。",
        "translation": "A person's rule over birth is like a bee making honey.",
        "source": "T17n0768_001:0703c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "採取眾華，勤苦積日。",
        "translation": "He takes many flowers and diligently accumulates days of suffering.",
        "source": "T17n0768_001:0703c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已成，人便攻，取持去，亦不得自食，適自疲極。",
        "translation": "Once it's grown, a person then attacks it, takes it away, and can't eat it for themselves; they're rightly exhausted.",
        "source": "T17n0768_001:0703c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人東走西走，求是作是，合聚財寶，勤苦不可言。",
        "translation": "That person travels east and west, seeking this and that, and amassing wealth and treasure, which is unspeakable for their hard work and suffering.",
        "source": "T17n0768_001:0703c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已命盡，他人得其財，身及得重罪，受苦不可量。",
        "translation": "After his life is ended, another person obtains his wealth, and he personally commits a heavy sin that causes immeasurable suffering.",
        "source": "T17n0768_001:0703c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人在世間，譬乘泥船渡河，當浮渡，船且壞。",
        "translation": "Man's time in the world is like crossing a river in a mud boat; when it's floating, the boat breaks down.",
        "source": "T17n0768_001:0703c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人身如泥船不可久，當疾行道。",
        "translation": "A person's body is like a mud boat that can't last long, so he must quickly make his way.",
        "source": "T17n0768_001:0703c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金有四試：一者、燒；二者、磨；三者、鍛；四者、鍊。",
        "translation": "There are four tests for gold: first, burning; second, grinding; third, forging; and fourth, smelting.",
        "source": "T17n0768_001:0703c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬喻人亦有四試：一者、嬈；二者、共從事；三者、色；四、為制不止。",
        "translation": "By analogy, there are also four tests of a person: one, to be seduced; two, to work together; three, form; and four, to go beyond restraint.",
        "source": "T17n0768_001:0703c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲得人相，有四因緣：一者、與共居；二者、共居當久；三者、當共語言；四者、共事可以知之。",
        "translation": "There are four causes for wanting to know the characteristics of a person: first, they live together; second, they'll live together for a long time; third, they'll speak together; and fourth, they'll work together so they can be known.",
        "source": "T17n0768_001:0703c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四因緣知為道人：一者、聞惡亂意，即時轉念；二者、不說人惡；三者、自不墮論議；四者、能自護。",
        "translation": "There are four reasons to know that you're a person of the Way: 1. you immediately change your mind when you hear of bad and disturbed thoughts; 2. you don't talk about the badness of people; 3. you don't fall into argumentation; and 4. you're able to defend yourself.",
        "source": "T17n0768_001:0703c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知為道人自護。",
        "translation": "Thus, he knows that he's a person of the Way who protects himself.",
        "source": "T17n0768_001:0704a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世四因緣乃受福：一者、有處；二者、有時；三者、業；四者、師。",
        "translation": "In this world, there are four causes to receive merit: first, a place; second, a time; third, actions; and fourth, a teacher.",
        "source": "T17n0768_001:0704a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有所止，得安隱、如意，是為處。",
        "translation": "This is the place where a person has a place to stay and attains peace and well-being.",
        "source": "T17n0768_001:0704a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人年三十，當富。",
        "translation": "Suppose a person is thirty years old and becomes wealthy.",
        "source": "T17n0768_001:0704a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五時，求不可得，至三十乃得，是為時。",
        "translation": "When he was fifteen, he couldn't get what he was seeking, but when he reaches thirty, he gets it; this is the time.",
        "source": "T17n0768_001:0704a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人宜賈白珠亦餘物，從得利，是為業。",
        "translation": "If a person chooses to buy white pearls or other things and obtains a profit from them, this is an action.",
        "source": "T17n0768_001:0704a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遭得明人分別說經，心即開解，是為師。",
        "translation": "To meet a wise person who discerns and teaches the sūtras and immediately enlightens the mind is considered a teacher.",
        "source": "T17n0768_001:0704a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有兄弟三人，各自謂高健無輩，共更持夜，二兄居前臥，小弟便獨坐。",
        "translation": "There are three brothers, each described as tall and strong without peers, who share the same nighttime routine, with the second brother lying down in front of them and the younger brother sitting alone.",
        "source": "T17n0768_001:0704a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一虫，名為不吉，來嚙其髀。",
        "translation": "A bug named Bujit came and attacked their thighs.",
        "source": "T17n0768_001:0704a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟便以手指之，虫便長大，復捶益大。",
        "translation": "The younger brother then pointed his finger at it, and the bug grew bigger and got bigger as he punched it again.",
        "source": "T17n0768_001:0704a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人瞋恚，取虫蹙踏，自致疲極，虫益大不止，其人便止休。",
        "translation": "Angry, he picked the bug and stomped on it, exhausting himself.",
        "source": "T17n0768_001:0704a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一夜已竟，便呼仲兄起，虫復嚙之，兄復如小弟與共鬪，虫更長大至屋，如是疲極，復止休。",
        "translation": "When the night is over, he then calls his middle brother to get up, and the bug starts to bite him again. He then fights with him like his younger brother, and the bug grows even bigger and reaches the house.",
        "source": "T17n0768_001:0704a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二夜竟，便呼大兄起坐，虫復嚙之。",
        "translation": "When the second night was over, he called his eldest brother to get up and sit down, and the insects again attacked him.",
        "source": "T17n0768_001:0704a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大兄便持手指摩娑，虫復起，兄生意以盎覆之，須臾極，虫便出盎去。",
        "translation": "The older brother then rubbed his finger against it, and the bug got up again.",
        "source": "T17n0768_001:0704a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至明日二弟極不能復起，兄知二弟與虫共鬪，便問：「何以不起？」",
        "translation": "Tomorrow, when he couldn't get up again, he knew he was fighting with the bug, so he asked, \"Why isn't it up?\"",
        "source": "T17n0768_001:0704a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二弟慚不敢語。",
        "translation": "My second brother was ashamed and didn't dare to say anything.",
        "source": "T17n0768_001:0704a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兄言：「與虫共鬪極耶？」",
        "translation": "He said, \"Is it true that we're fighting with bugs?\"",
        "source": "T17n0768_001:0704a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟言：「然！」",
        "translation": "The disciple said, \"Yes!\"",
        "source": "T17n0768_001:0704a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兄語弟言：「後儻有不吉虫來，但以盎覆之，不當指也！」",
        "translation": "My brother said to my younger brother, \"If there are any inauspicious bugs that come along later, just cover them with an umbrella; you shouldn't point at them!\"",
        "source": "T17n0768_001:0704a18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬喻如癡人得對便瞋恚，從得罪。",
        "translation": "\"It's an example like a foolish man who gets angry when he gets confronted, and then he commits a sin.",
        "source": "T17n0768_001:0704a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如弟與虫鬪，自致疲極。",
        "translation": "He's like a junior fighting with a bug, which causes him to tire.",
        "source": "T17n0768_001:0704a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "黠人見對，來便避之，是得福，譬如盎覆不吉虫。",
        "translation": "A clever person who sees the confrontation and avoids it at first will attain good fortune, like an insect that's covered with inauspicious material.",
        "source": "T17n0768_001:0704a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔有道人為國王說經。",
        "translation": "Once, a man of the Way taught sūtras for a king.",
        "source": "T17n0768_001:0704a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「佛在世，多人得道。",
        "translation": "The king said, \"When the Buddha was alive, many people attained the way.",
        "source": "T17n0768_001:0704a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今同說佛經，人不得道。",
        "translation": "Now, we're talking about the Buddha's sūtras together, but people can't attain the path.",
        "source": "T17n0768_001:0704a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為持道法去耶？」",
        "translation": "Is the Buddha holding the teachings of the Way and leaving?\"",
        "source": "T17n0768_001:0704a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道人言：「譬天下極美不過葡萄酒，飲一升便可醉，持一升水澆一升酒中，飲之不能復醉。",
        "translation": "The Daoist said, \"It's like the world's most beautiful wine, for which one liter of drinking would make you drunk.",
        "source": "T17n0768_001:0704a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在世時說經，知人意態。",
        "translation": "When the Buddha was in the world, he taught the sūtras and knew people's attitudes.",
        "source": "T17n0768_001:0704a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如人飲一升酒便得醉，今我輩不知是。",
        "translation": "It's like a person who drinks a liter of wine and becomes intoxicated, but we don't know that now.",
        "source": "T17n0768_001:0704a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經知人意態，應病與藥故，人多得道。」",
        "translation": "When the Buddha taught the sūtras, he knew people's states of mind and gave them medicine for their illnesses, so many people attained the Way.\"",
        "source": "T17n0768_001:0704a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有國王飯諸比丘，天來指示王，是人得阿羅漢，是人菩薩，是人得道迹，是人不持戒。",
        "translation": "When a king was dining monks, the gods came and told the king that this person had become an arhat, that person was a bodhisattva, that person had attained the steps of the path, and that person didn't observe the precepts.",
        "source": "T17n0768_001:0704b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王悉覺知，持心正等，無有異意，諸天代其歡喜。",
        "translation": "The king fully perceived this, maintained his mind in a correct way, and had no different thoughts, and the gods rejoiced on his behalf.",
        "source": "T17n0768_001:0704b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有國王與人共爭高價浴佛，王輒舉高價不止。",
        "translation": "There was a king who was competing with others for a high price to bathe the Buddha, and the king would often raise the high price and not stop there.",
        "source": "T17n0768_001:0704b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：「今我悉持所有財物、妻子、自身為奴婢，以浴佛。」",
        "translation": "The man said, \"Now, I'll take all my possessions, my wife, and myself and make them slaves for the bathing of the Buddha.\"",
        "source": "T17n0768_001:0704b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王便不得。",
        "translation": "The king then couldn't get it.",
        "source": "T17n0768_001:0704b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿育王作八萬塔，臨命欲絕時，菩薩、阿羅漢有五百人，共守護，更為說經，不使諸夫人得近與相見，欲令王上天故。",
        "translation": "When King Aśoka was about to die, there were 500 bodhisattvas and arhats who built 80,000 stūpas, guarded them, and spoke sūtras for them, not allowing the ladies to come near or see each other, in order to get the king up to heaven.",
        "source": "T17n0768_001:0704b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有小國王常起往伐。",
        "translation": "The king of a small country always rose up to attack him.",
        "source": "T17n0768_001:0704b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大國王思惟言：「亡身得惡，皆從貪愛故。",
        "translation": "The great king thought, \"The bad deeds that befall him are all the result of craving.",
        "source": "T17n0768_001:0704b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不如以國與之！」",
        "translation": "Why don't I give it to him?\"",
        "source": "T17n0768_001:0704b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大國王捨國，去作白衣在他國，久後歸故國。",
        "translation": "A great king leaves his country and goes away to make white robes in another country, but after a long time he returns to his old country.",
        "source": "T17n0768_001:0704b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人白言，王便勅左右往捕取，殺之。",
        "translation": "When someone told him, the king ordered his men to go get him and kill him.",
        "source": "T17n0768_001:0704b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨當死時，呼其子囑一言：「慎勿忘也！",
        "translation": "When he was about to die, he summoned his son and told him, \"Don't forget it!",
        "source": "T17n0768_001:0704b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝勿念怨家，要當慈心！」",
        "translation": "Don't be mindful of your enemy, but be compassionate!\"",
        "source": "T17n0768_001:0704b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有國王治行不平，侵抂人民，受取非法，天為雨不時節。",
        "translation": "When a king behaves unjustly, abuses his people, and takes what's unlawful, the gods make it rain unseasonably.",
        "source": "T17n0768_001:0704b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有女人言：「天雨不時節，王治行不平正故。」",
        "translation": "A woman said, \"The gods don't rain at the right time because the king's government and conduct are unjust.\"",
        "source": "T17n0768_001:0704b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王以聞知，便呼女人令請雨，以三器著地，女人願令雨墮中央器中，復令從一頭起，則如其願。",
        "translation": "When the king heard this, he summoned the woman to ask for rain and put three vessels on the ground. The woman wished to have the rain fall into the central vessel and to have it rise from one head, and then it would do as she wished.",
        "source": "T17n0768_001:0704b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問：「何因緣得是？」",
        "translation": "The king asked, \"What are the reasons for getting this?\"",
        "source": "T17n0768_001:0704b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人白言：「我至誠故。」",
        "translation": "The woman said, \"It's because I'm perfectly sincere.\"",
        "source": "T17n0768_001:0704b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有地乃有萬物，人有至誠乃有道。」",
        "translation": "The Buddha said, \"When there's earth, then there are all things, and when people have utmost sincerity, then there's the path.\"",
        "source": "T17n0768_001:0704b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有國王出行，見一女人端正無比，王意欲殺其夫，取是女人。",
        "translation": "When a king traveling in a country sees a woman of unsurpassed appearance, the king wants to kill her husband and take the woman.",
        "source": "T17n0768_001:0704b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "旁臣言：「不當殺，當享之。」",
        "translation": "The ministers nearby said, \"He shouldn't kill her; he should enjoy her.\"",
        "source": "T17n0768_001:0704b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王國序其夫，以金指環與之，語言：「忘環者殺汝！」",
        "translation": "The king then ordered his husband to give him a gold finger ring and said, \"He who forgets the ring will kill you!\"",
        "source": "T17n0768_001:0704b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王私呼婦，令盜取環。",
        "translation": "The king privately summons a woman to steal her ring.",
        "source": "T17n0768_001:0704b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以後王呼問其夫環所在，夫求不知處，便勅臣殺之，令美飲食。",
        "translation": "The king then summons her husband to ask where the ring is, and when he asks for it and doesn't know where it is, he orders his ministers to kill him and make him eat.",
        "source": "T17n0768_001:0704b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫恐，不敢食。",
        "translation": "The man was afraid and didn't dare to eat.",
        "source": "T17n0768_001:0704b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：「卿當死，何不食？」",
        "translation": "They said, \"You're going to die, so why don't you eat?\"",
        "source": "T17n0768_001:0704b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫適欲噉魚，因於魚腹中得環，是至誠所至。",
        "translation": "\"A person who wants to eat fish and obtains a ring in its belly because of it is the result of their utmost sincerity.",
        "source": "T17n0768_001:0704b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有道人貧窮，舉十萬用治生。",
        "translation": "A wayward man who's poor spends 100,000 to cure his livelihood.",
        "source": "T17n0768_001:0704c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便先持三萬布施，持餘錢行賈。",
        "translation": "He first gives 30,000 as alms and then travels on a caravan with the rest of his money.",
        "source": "T17n0768_001:0704c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "途中為賊所抄，王便以珍寶物匃與之。",
        "translation": "On his way, he was robbed by a thief, and the king gave him a pile of valuables.",
        "source": "T17n0768_001:0704c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有大囊、小囊，餘人各取大囊去。",
        "translation": "There was a large bag and a small bag, and the others each took the large bag and left.",
        "source": "T17n0768_001:0704c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道人自念言：「我錢少，不宜取大囊。」",
        "translation": "The Daoist man thought to himself, \"I have little money, so I shouldn't take the big bag.\"",
        "source": "T17n0768_001:0704c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便取小囊去。",
        "translation": "He then took the smaller bag and left.",
        "source": "T17n0768_001:0704c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中悉有白珠，賣得六千萬。",
        "translation": "Inside it were all white pearls, which he sold for 60 million.",
        "source": "T17n0768_001:0704c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用至誠不貪故，得是珍寶。",
        "translation": "Because he was sincere and didn't crave them, he was able to obtain this treasure.",
        "source": "T17n0768_001:0704c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔有國王徵國中諸盲人，令於象廐中觀象。",
        "translation": "Once, a king asked the blind men of his kingdom to look at an elephant in a stable of elephants.",
        "source": "T17n0768_001:0704c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中有持象足者，中有持象鼻者，中有持象耳者，中有持象尾者。",
        "translation": "There was a man with the elephant's legs, a man with the elephant's trunk, a man with the elephant's ears, and a man with the elephant's tail.",
        "source": "T17n0768_001:0704c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去後共相問：「象何等類？」",
        "translation": "After they left, they all asked each other, \"What kind of elephants are they?\"",
        "source": "T17n0768_001:0704c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持象足者言：「象大如柱。」",
        "translation": "The person holding the elephant's feet says, \"The elephant is as large as a pillar.\"",
        "source": "T17n0768_001:0704c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持象鼻者言：「象如繩索。」",
        "translation": "The person holding the elephant's trunk says, \"An elephant is like a rope.\"",
        "source": "T17n0768_001:0704c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持象耳者言：「象如簸箕。」",
        "translation": "He who holds the elephant's ear says, \"An elephant is like a winnowing basket.\"",
        "source": "T17n0768_001:0704c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持象尾者言：「象如大杖。」",
        "translation": "He who held the elephant's tail said, \"An elephant is like a large staff.\"",
        "source": "T17n0768_001:0704c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆共諍之，盲人各自信其意。",
        "translation": "They all argued together, and each blind man was confident in his own mind.",
        "source": "T17n0768_001:0704c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如人各見少所經，不了其法，自謂大解，亦如是。",
        "translation": "It's like a person who sees a little bit of a sūtra and doesn't understand its teaching but claims to have great understanding of it, or likewise.",
        "source": "T17n0768_001:0704c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有國王於城外大作伎樂戲，舉國中人民皆出行觀。",
        "translation": "Outside the city, a king puts on a great musical performance, and the people of the kingdom travel to watch it.",
        "source": "T17n0768_001:0704c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中有一家，其父有疾不能行步，家室共扶，將令行，言：「出城便止。」",
        "translation": "There was a family in the city whose father was too ill to walk, and the family helped him along, saying, \"Stop when you leave the city.\"",
        "source": "T17n0768_001:0704c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹下不能自致，語家中言：「汝自行觀，來還乃持我歸。」",
        "translation": "Unable to help himself, he said to the family, \"Look around on your own, and then take me back when you return.\"",
        "source": "T17n0768_001:0704c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋化作一道人，過其邊，便呼病人：「汝隨我去，我能令汝病愈。」",
        "translation": "Tendai then transformed into a man who passed by and called to the patient, \"Go with me, and I'll cure you of your illness.\"",
        "source": "T17n0768_001:0704c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人聞之大喜，便起隨行。",
        "translation": "The man was delighted when he heard that, so he got up and followed him.",
        "source": "T17n0768_001:0704c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋將上天，至宮，見金銀好物甚眾多，欲從求之。",
        "translation": "As he was about to ascend to heaven, he went to the palace and saw a great deal of nice gold and silver, and he wanted to ask for them.",
        "source": "T17n0768_001:0704c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：「勿得，可求匃瓶。」",
        "translation": "He was told, \"Don't get it; ask for a water bottle.\"",
        "source": "T17n0768_001:0704c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "病人因前到釋所言：「我欲去，願持此瓶匃我。」",
        "translation": "The patient then went to Śākyamuni and said, \"I want to leave, so take this vial and return it to me.\"",
        "source": "T17n0768_001:0704c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋即與之，語病人言：「中有物，在汝所願。」",
        "translation": "Śākyamuni then gave it to him and said to the patient, \"Here's something you wish to have.\"",
        "source": "T17n0768_001:0704c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "病人持歸室家，相對探之，轉得心中所願，金銀珍寶恣意皆得。",
        "translation": "The patient took it to his home, looked into it, and found what he had wished for in his heart, which was gold, silver, and treasure at will.",
        "source": "T17n0768_001:0704c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大會宗親諸家內外，共相娛樂。",
        "translation": "They gathered a large group of clansmen, both inside and outside the home, and entertained each other.",
        "source": "T17n0768_001:0704c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醉飽已後，因取瓶跳之，我受汝恩，令我富饒。",
        "translation": "When he was drunk and full, he took the vial and jumped out of it, saying, 'I've accepted your kindness, which has made me rich and prosperous.'",
        "source": "T17n0768_001:0704c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "跳踢不止，便墮地破之，所求不復得。",
        "translation": "When he doesn't stop jumping and kicking, he falls to the ground and breaks it, and what he seeks is no longer available.",
        "source": "T17n0768_001:0704c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間有黠人多無數，未有如彌勒者。",
        "translation": "There are countless intelligent people in the world, but none like Maitreya.",
        "source": "T17n0768_001:0704c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒尚復行學不厭，何況餘乎！",
        "translation": "Maitreya still practiced and never tired of training, so why wouldn't he stop at that?",
        "source": "T17n0768_001:0704c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛已得道，坐行安般守意。",
        "translation": "Once the Buddha has attained the way, he sits and practices in calm abiding and mindfulness.",
        "source": "T17n0768_001:0704c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我從無數世以來與不厭，乃得佛。」",
        "translation": "The Buddha said, \"Since uncountable ages, I've worked tirelessly to become a buddha.\"",
        "source": "T17n0768_001:0705a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後世人學當那得佛道！",
        "translation": "Those who come after him will surely follow suit and attain the Buddha Way!",
        "source": "T17n0768_001:0705a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已持戒，不復作惡。",
        "translation": "Once you observe the precepts, you won't do evil again.",
        "source": "T17n0768_001:0705a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有不信意故，復犯戒，便墮地獄。",
        "translation": "If someone with a lack of faith again violates the precepts, they'll fall into hell.",
        "source": "T17n0768_001:0705a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻王問之，便對言：「我不作惡。」",
        "translation": "When asked by King Yama, he then says, \"I don't do evil.\"",
        "source": "T17n0768_001:0705a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻王復問：「汝不作惡，何為是中？」",
        "translation": "Again, King Yama asked, \"You don't do evil, so why is this the middle?\"",
        "source": "T17n0768_001:0705a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有尊者為賊人所折辱。",
        "translation": "A venerable man was humiliated by a thief.",
        "source": "T17n0768_001:0705a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「何以不殺之？」",
        "translation": "Someone said, \"Why didn't you kill him?\"",
        "source": "T17n0768_001:0705a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者言：「我人客未具故。」",
        "translation": "The venerable said, \"It's because I don't have any human visitors.\"",
        "source": "T17n0768_001:0705a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人復言：「我為卿出人客。」",
        "translation": "The man again said, \"I'll give you a human guest.\"",
        "source": "T17n0768_001:0705a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者言：「不也！",
        "translation": "The Venerable said, \"No!",
        "source": "T17n0768_001:0705a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我兵今自具如是，二十餘歲殺賊人，被病死。」",
        "translation": "Now, my troops have equipped themselves like this. I was more than 20 years old when I killed the bandits, and I was stricken with illness and died.\"",
        "source": "T17n0768_001:0705a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人復言：「卿不殺之，今反自死！」",
        "translation": "Again, the people said, \"You didn't kill them, but now you've killed yourself!\"",
        "source": "T17n0768_001:0705a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者言：「我兵馬以具。",
        "translation": "The venerable said, \"I've got my army and horses.",
        "source": "T17n0768_001:0705a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is that?",
        "source": "T17n0768_001:0705a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人當入地獄，是為兵馬具。」",
        "translation": "A foolish man will go to hell, and this will be the armaments of soldiers and horses.\"",
        "source": "T17n0768_001:0705a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「何等為能知一萬事畢？」",
        "translation": "He asked, \"How can someone know the end of one million things?\"",
        "source": "T17n0768_001:0705a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報曰：「一者謂無意、無念，萬事自畢。",
        "translation": "The retribution says, \"One is thoughtless and thoughtless, and all things are accomplished on their own.",
        "source": "T17n0768_001:0705a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意有百念，萬事皆失。」",
        "translation": "When there are a hundred thoughts in the mind, everything is lost.\"",
        "source": "T17n0768_001:0705a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有道人夜行前，未得道人隨其後。",
        "translation": "A person of the Way travels by night, followed by someone who hasn't yet attained the Way.",
        "source": "T17n0768_001:0705a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後人有疑悔，前人舉手，五指頭出火，復以鑰開戶，後人乃覺悟，知為道人。",
        "translation": "When the latter person has doubts and regrets, the former person raises his hand, and fire comes out of his five fingers, and he opens his door with a key.",
        "source": "T17n0768_001:0705a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說經有六衰，有人言七衰，屋舍衰獨非衰耶？",
        "translation": "It's said in the sutra that there are six declines, and some people say there are seven declines; isn't the declining of a house alone a decline?",
        "source": "T17n0768_001:0705a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛謂人言：「我復饒汝一衰，癡為大衰。",
        "translation": "The Buddha told someone, \"I'll grant you one more loss, which is the great loss of delusion.",
        "source": "T17n0768_001:0705a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0768_001:0705a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人說身事，反說屋舍，是為癡。」",
        "translation": "It's foolish for someone to talk about personal matters and instead talk about a dwelling.\"",
        "source": "T17n0768_001:0705a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人墮海中，有人教食水盡，可得步出。",
        "translation": "A person falls into the ocean and is taught to finish his food and water so he can step out.",
        "source": "T17n0768_001:0705a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：「我已飲，後水復來！」",
        "translation": "The person says, \"I've drunk, but the water will come back later!\"",
        "source": "T17n0768_001:0705a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世俗如是，前後相趣不可極。",
        "translation": "Worldly conventions are thus, the mutual paths of past and future are inexhaustible.",
        "source": "T17n0768_001:0705a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人欲相見，有四緣：一者、其人端正故；二者、宿命相愛；三者、名聞；四者、欲聞深經。",
        "translation": "There are four reasons people want to meet each other: 1. because the person is correct; 2. because of a predilection for a former life; 3. because of fame and reputation; and 4. because they want to hear about profound sūtras.",
        "source": "T17n0768_001:0705a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安為知是，隱為自藏。",
        "translation": "Knowing this, they hide themselves in secrecy.",
        "source": "T17n0768_001:0705a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自藏者，不見惡態。",
        "translation": "Someone who hides himself doesn't see bad states.",
        "source": "T17n0768_001:0705a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間凡有千八道，佛一切已知，前世皆已學，從是不得道故，索知。",
        "translation": "Where there are 1,000 or 8 paths in the world, the Buddha has known them all and has trained them in previous lives; from this, he doesn't obtain the path, so he asks for knowledge.",
        "source": "T17n0768_001:0705a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問人語時，聲先生耶？",
        "translation": "When you ask someone about something they say, is that a \"sir\"?",
        "source": "T17n0768_001:0705a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意先生乎？",
        "translation": "What do you think, sir?",
        "source": "T17n0768_001:0705a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報意先生。",
        "translation": "Mr. Kapphiṇa.",
        "source": "T17n0768_001:0705a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以？",
        "translation": "How?",
        "source": "T17n0768_001:0705a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意覺聲，聲不能覺意故。",
        "translation": "The mind perceives sound, but sound can't perceive the mind.",
        "source": "T17n0768_001:0705a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人持珠度海，失亡其珠。",
        "translation": "A man carries a pearl across the ocean and loses it.",
        "source": "T17n0768_001:0705b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人便持木斗，[打-丁+氣]水棄岸上。",
        "translation": "The man then takes a wooden bucket and [strikes - d + air] it with water and throws it onto the shore.",
        "source": "T17n0768_001:0705b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海神言：「汝當何時盡是水？」",
        "translation": "The sea god says, \"When will you end up with all this water?\"",
        "source": "T17n0768_001:0705b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：「生死棄之不置。」",
        "translation": "People say, \"We abandon them in birth and death.\"",
        "source": "T17n0768_001:0705b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海神知其意大，出珠還之。",
        "translation": "The sea god knew how much he wanted it, so he returned the pearl.",
        "source": "T17n0768_001:0705b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三慧經",
        "translation": "Sutra on the Three Kinds of Wisdom",
        "source": "T17n0768_001:0705b04_0",
        "is_bad_quality": false
    }
]