[
    {
        "source_sentence": "諸法集要經卷第一",
        "translation": "Sutra of the Collection of Essentials of the Dharma, Volume 1",
        "source": "T17n0728_001:0458a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀無畏尊者集(總二千六百八十四頌)西天譯經三藏朝散大夫試鴻臚卿宣梵大師賜紫沙門臣日稱等奉　詔譯伏除煩惱品第一　稽首三有最勝尊，　　吉祥無垢盡諸漏，　愚夫為惑所沈溺，　　能以等慈而拔濟。",
        "translation": "Collected by the Venerable Guanfearless (2,684 verses in total) Western Translation of the Tripiṭaka Scriptures, the Chaoshan Dafu, the courtesy of the minister Xuanfan, the purple-hued ascetic Rixing, and others present at the imperial translation of the first rank of the chapter on subduing the afflictions. He looks up to the most honored among the three existences, auspicious and spotless, he ends the contaminants, and can rescue foolish people sunken in delusion with equal compassion.",
        "source": "T17n0728_001:0458a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　依正法念處，　　廣大契經海，　集成此伽陀，　　為作世間眼。",
        "translation": "Relying on the mindfulness of the true dharma and the vast sea of scriptures, he integrates this gāthā as his worldly eye.",
        "source": "T17n0728_001:0458a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當發生淨信，　　精進不放逸，　棄背於六塵，　　修習微妙智，　樂布施持戒，　　忍辱諸禪定，　以四無量心，　　利樂諸含識。",
        "translation": "They should give rise to pure faith, make effort and no dissipation, abandon the six dust motes, cultivate subtle knowledge, enjoy generosity, uphold precepts, tolerate meditation, and use the four immeasurable states of mind to bring benefit and joy to the contained consciousnesses.",
        "source": "T17n0728_001:0458a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若散亂放逸，　　起暴惡邪見，　常發虛妄言，　　當墮於地獄。",
        "translation": "If they are dissipated and careless, give rise to violent wrong views, and always speak falsely, they'll fall into hell.",
        "source": "T17n0728_001:0458b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若慳悋憎嫉，　　遠離於善法，　樂損惱眾生，　　定墮餓鬼趣。",
        "translation": "If they are stingy and hateful, distant from good qualities, and delight in harming sentient beings, they'll surely fall into the rebirth of hungry ghosts.",
        "source": "T17n0728_001:0458b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若破壞正法，　　愚癡著染欲，　耽飲食睡眠，　　當獲畜生報。",
        "translation": "If they disrupt the right Dharma, foolishly cling to defiled desires, and indulge in eating and sleeping, they'll be punished by being born in an animal camp.",
        "source": "T17n0728_001:0458b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身語意三種，　　造作諸不善，　為業之所纏，　　數數而增長。",
        "translation": "He creates unwholesome forms of the three kinds of body, speech, and thought, which are tied up by actions and grow repeatedly.",
        "source": "T17n0728_001:0458b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是彼愚夫，　　展轉無休息，　智者善修習，　　當得寂靜樂。",
        "translation": "Thus, that foolish man goes on without rest, but a wise man well cultivates it, and he'll attain quiescence and happiness.",
        "source": "T17n0728_001:0458b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　了知是業果，　　棄捨於放逸，　以智慧揀擇，　　此善無過上。",
        "translation": "Knowing the results of these actions, he abandons carelessness and discriminates them with wisdom, which is unsurpassed in goodness.",
        "source": "T17n0728_001:0458b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常樂修惠施，　　堅固持淨戒。",
        "translation": "He always enjoys cultivating generosity and firmly upholds pure precepts.",
        "source": "T17n0728_001:0458b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憐愍諸有情，　　令所願成就，　與慈悲相應，　　不生於希望，　為攝受於他，　　決定得成就。",
        "translation": "He takes pity on sentient beings, causes their desires to come true, is associated with kindness and compassion, doesn't give rise to hope, and is determined to attain success in order to accept others.",
        "source": "T17n0728_001:0458b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　解脫彼貪瞋，　　知足離過患，　愛念於眾生，　　決定得成就。",
        "translation": "Freed from their craving and ill-will, contented with their faults and free from distress, they are certain to achieve it when they are mindful of sentient beings.",
        "source": "T17n0728_001:0458b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以平等質直，　　無有冤親想，　永脫諸惡趣，　　決定得成就。",
        "translation": "Being straightforward and equal, having no thoughts of enmity, he's certain to attain permanent freedom from the bad destinies.",
        "source": "T17n0728_001:0458b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具足諸威儀，　　善平等說法，　離慳嫉過失，　　決定得成就。",
        "translation": "Possessing perfect manners, he teaches the Dharma well and equally, free of the faults of stinginess and jealousy, and he's certain to attain success.",
        "source": "T17n0728_001:0458b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂承事師尊，　　持戒修諸定，　明了罪福相，　　決定得成就。",
        "translation": "They are happy to serve the teacher, observe precepts and cultivate concentration, and understand the characteristics of sins and merits, which determines their accomplishment.",
        "source": "T17n0728_001:0458b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　起勇猛精進，　　坐禪若讀誦，　愛語無諂曲，　　決定得成就。",
        "translation": "Giving rise to vigorous exertion, sitting in meditation and recitation, loving words and no flattery, he's certain to attain success.",
        "source": "T17n0728_001:0458b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於時及彼方，　　或作或止息，　皆方便了知，　　決定得成就。",
        "translation": "At the time and in other directions, he sometimes does or doesn't do something, and he skillfully understands it, so he's certain to achieve it.",
        "source": "T17n0728_001:0458b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無瞋伏瞋恚，　　忍辱除暴惡，　正法捨非法，　　光明滅黑暗，　真實遣虛妄，　　寂靜摧兩舌，　憐愍息毀呰，　　無縛解纏縛，　慈心止殺害，　　樂施銷慳垢。",
        "translation": "Without anger, he quells anger; with patience, he removes violence; the right Dharma rejects what's not the Dharma; his light extinguishes darkness; the truth rejects falsity; quiescence destroys duplicity; kindness quells disparagement; he is unfettered and freed from bondage; his kindness stops killing; and he is willing to give and extinguishes the stain of stinginess.",
        "source": "T17n0728_001:0458b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以淨善對治，　　不如理作意，　以智照無明，　　無常破常執。",
        "translation": "With purification and skillful antidotes, illogical contemplation and wisdom illuminate ignorance, and impermanence refute attachment to permanence.",
        "source": "T17n0728_001:0458c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶日昃月虧，　　遷流本如是，　當自善思惟，　　觀察離邪欲。",
        "translation": "Just like the sun and moon are diminished, their transmigration is originally like this, so you should consider it well for yourself and observe it to be free of wrong desires.",
        "source": "T17n0728_001:0458c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八聖道為因，　　能越諸惡趣，　住四無所畏，　　能降諸恐怖，　正念祛妄念，　　勝智摧邪智，　樂住阿蘭若，　　淡泊絕貪欲。",
        "translation": "With the eight noble paths as their cause, they transcend the bad destinies, abide in the four fearlessnesses, subdue fears, dispel false thoughts with right mindfulness, destroy wrong knowledge with superior knowledge, abide comfortably in araṇya, and cut off desire with equanimity.",
        "source": "T17n0728_001:0458c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如眾山中，　　須彌為最勝，　如大海深廣，　　能生諸珍寶；　如皎日光明，　　映蔽諸宿曜。",
        "translation": "Like Sumeru, which is the tallest of mountains, it's like the ocean so deep and wide it produces treasures, and like the bright sun's rays, it shines brightly to cover all the constellations and celestial lights.",
        "source": "T17n0728_001:0458c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無生止有生，　　如火然槁木，　亦如妙飲食，　　能除於飢渴。",
        "translation": "It's like fire that stops birth and dries up wood, and it's like a wonderful meal that quells hunger and thirst.",
        "source": "T17n0728_001:0458c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如師子進止，　　能伏諸群獸，　知足絕貪求，　　無畏亦如是。",
        "translation": "Like a lion advancing and calming, he's able to subdue a multitude of animals, knowing when he's satisfied and stopping craving, and he's fearless in the same way.",
        "source": "T17n0728_001:0458c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仁慈世共稱，　　捨此咸輕鄙，　懈怠與顓愚，　　精進能除斷。",
        "translation": "Known throughout the world as a kind person, he abandons this common despise, and his laziness and ignorance are removed by effort.",
        "source": "T17n0728_001:0458c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如有暴惡人，　　非理相加謗，　智者以誠言，　　安忍能除遣。",
        "translation": "If there's a violent person who unjustifiably ridicules others, a wise person speaks sincerely, forbearingly, and then he's able to remove them.",
        "source": "T17n0728_001:0458c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天降脩羅，　　由信樂正法，　佛出於世間，　　能制諸外道。",
        "translation": "The gods send down sūras, and because they believe in and enjoy the right teaching, the Buddha emerges from the world and is able to restrain non-Buddhists.",
        "source": "T17n0728_001:0458c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說法品第二",
        "translation": "The Second Chapter of Explaining the Dharma",
        "source": "T17n0728_001:0458c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人善說法，　　能使彼開解，　為眾之導師，　　令至安隱處，　示菩提正路，　　畢竟令趣入，　生死險道中，　　永斷癡纏縛。",
        "translation": "\"If someone well explains the teaching, they can bring about their enlightenment, be a guide to all people, lead them to a place of comfort, show them the right path to enlightenment, lead them ultimately into it, enter the dangerous path of birth-and-death, and permanently end the bondage of delusion.",
        "source": "T17n0728_001:0458c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是法無過上，　　非世俗所說，　若有聞是者，　　能渡諸有海。",
        "translation": "This is a teaching without surpass, not something that's taught in the secular world, and if someone hears it, they'll be able to cross the ocean of existence.",
        "source": "T17n0728_001:0459a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有智慧人，　　於此勤修習，　有四種福田，　　能生諸善果。",
        "translation": "If there's a wise person who diligently cultivates it, there are four fields of merit that produce good results.",
        "source": "T17n0728_001:0459a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若奉持佛教，　　得諸根具足，　不生愛樂心，　　於後徒悔惱。",
        "translation": "If someone adheres to Buddhism and attains the perfection of their faculties, they won't become delighted with it, and later they'll regret it.",
        "source": "T17n0728_001:0459a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人於五欲，　　常追求耽染，　戀著於妻孥，　　當墮於惡趣。",
        "translation": "If a person always pursues the five desires and becomes defiled, clinging to wives and children, they'll fall into a bad destiny.",
        "source": "T17n0728_001:0459a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　起不正思惟，　　積集諸過失，　皆由於自心，　　為妄想縈縶。",
        "translation": "They give rise to incorrect contemplation and accumulate faults, all because of their own mind, which is entangled in deluded conceptualization.",
        "source": "T17n0728_001:0459a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是心難降伏，　　多攀緣欲境，　若能善制之，　　獲清涼安隱。",
        "translation": "This mind is difficult to subdue and often clings to objects of desire, but if it's well controlled, it'll attain a sense of coolness and well-being.",
        "source": "T17n0728_001:0459a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是心如惡馬，　　以正法調伏，　聞已當憶持，　　數數而觀察。",
        "translation": "That mind is like a stubborn horse that's tempered by the right teaching, which should be recalled after hearing it and repeatedly observed.",
        "source": "T17n0728_001:0459a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人聞正法，　　聞已悉明了，　發生於善根，　　遠離諸過咎。",
        "translation": "If a person hears the right teaching and fully understands it after hearing it, it produces good roots and keeps them free of faults and errors.",
        "source": "T17n0728_001:0459a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由聞正法故，　　心淨無垢染，　生踊躍歡喜，　　增長於明慧。",
        "translation": "As a result of hearing the right teaching, his mind is purified and undefiled, he becomes excited and joyous, and his insight grows.",
        "source": "T17n0728_001:0459a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由聞正法故，　　不造作眾罪，　知業果不虛，　　當得菩提道。",
        "translation": "Because they hear the right teaching, they don't commit any sins, knowing that the results of their actions are not in vain and that they'll attain the path to enlightenment.",
        "source": "T17n0728_001:0459a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由聞正法故，　　知佛諸功德，　法為解脫因，　　是為真智者。",
        "translation": "Because they hear the right teaching, they know the merits of the Buddha, that the teaching is the cause of liberation, and that they are truly wise.",
        "source": "T17n0728_001:0459a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由聞正法故，　　知法相常住，　是故當一心，　　於事勤修作。",
        "translation": "Because he hears the right teaching, he knows that the characteristics of dharmas are eternally abiding; therefore, he should be unified in mind and diligently work at things.",
        "source": "T17n0728_001:0459a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由聞正法故，　　解脫輪迴海，　斷種種貪愛，　　當證於實際。",
        "translation": "Because of hearing the right teaching, they'll be liberated from the ocean of transmigration, cut off various cravings, and will realize the truth.",
        "source": "T17n0728_001:0459a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由聞正法故，　　悟彼生滅相，　具四種因緣，　　當明了信解。",
        "translation": "As a result of hearing the right teaching, they'll understand the character of birth and cessation, and they'll have four kinds of causes and conditions that will be clearly understood and believed.",
        "source": "T17n0728_001:0459a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由聞正法故，　　了知蘊處界，　與生滅相應，　　令正智明顯。",
        "translation": "As a result of hearing the right teaching, they'll know the aggregates, fields, and realms that are associated with birth and cessation, which will cause their right knowledge to become apparent.",
        "source": "T17n0728_001:0459b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是三種過患，　　為輪迴之本，　樂多聞正法，　　當斷令永盡。",
        "translation": "These three faults are the basis of transmigration, and those who are happy to hear much of the right teaching will be stopped and made to permanently end them.",
        "source": "T17n0728_001:0459b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂於多聞，　　處世無過上，　於動不動法，　　悉究諸源底。",
        "translation": "If someone is comfortable being well-versed, they'll live in the world without error and fully investigate the origins of what's moving and immovable.",
        "source": "T17n0728_001:0459b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是人命終時，　　無復諸憂怖，　善達彼正法，　　不生於少苦。",
        "translation": "When his life ends, he'll have no more sorrow or fear, and he'll have a good understanding of the right teaching, so he won't experience less suffering.",
        "source": "T17n0728_001:0459b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能以正智火，　　焚燒煩惱薪，　由樂於多聞，　　後苦不復受。",
        "translation": "He can use the fire of right knowledge to burn the firewood of affliction, and because he's delighted in learning much, he'll no longer experience subsequent suffering.",
        "source": "T17n0728_001:0459b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若親近多聞，　　則生安隱樂，　離放逸燒然，　　此為善根本。",
        "translation": "If someone is close to someone who's well-versed, then they'll experience peace and happiness, and freedom from dissipation will burn them up, which is the root of goodness.",
        "source": "T17n0728_001:0459b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當承事耆德，　　欣樂彼宣說，　出離老死因，　　得證真常處。",
        "translation": "They will serve senior virtues and delight in their teachings, free themselves from the causes of old age and death, and attain the realization of true eternal states.",
        "source": "T17n0728_001:0459b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　了達一切法，　　解脫諸障染，　引發菩提心，　　多聞為最上。",
        "translation": "They comprehend all things, liberate themselves from the hindrances and defilements, and give rise to the mind of enlightenment, for which being well-versed is paramount.",
        "source": "T17n0728_001:0459b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若習近多聞，　　樂欲修正慧，　當以身語心，　　尊重常恭敬。",
        "translation": "If someone who's accustomed to learning much is interested in cultivating insight, they should honor and always venerate them with body and speech.",
        "source": "T17n0728_001:0459b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂多聞者，　　善住於法性，　堅固勤修作，　　能越三有海。",
        "translation": "If someone who's delighted in hearing much well abides in the nature of the Dharma and works resolutely and diligently to transcend the ocean of the three existences, then they'll be well equipped with the ability to hear much.",
        "source": "T17n0728_001:0459b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人有多聞，　　則具諸財寶，　無聞雖富饒，　　愚懵同貧窶。",
        "translation": "If someone is well-versed, they'll have wealth and possessions, and though they're rich and prosperous without hearing, their foolishness is the same as their poverty.",
        "source": "T17n0728_001:0459b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人無法財，　　遠離於師範，　虛受彼形軀，　　常懷於憂赧。",
        "translation": "If a person lacks possessions, they're far removed from their teacher's example, accept their body in vain, and always have misery and blushes.",
        "source": "T17n0728_001:0459b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若近惡知識，　　生放逸懈怠，　猶如磽田中，　　虛擲於種子。",
        "translation": "If they approach a bad teacher and become careless and lazy, they're like throwing seeds in vain in a field of rice.",
        "source": "T17n0728_001:0459b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多聞具法眼，　　雖瞽亦明覺，　無目無多聞，　　是為暗鈍者。",
        "translation": "Well-versed with the Dharma eye, even though they're blind they clearly perceive it, but without eyes and learning, they're dark and dull.",
        "source": "T17n0728_001:0459b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若遠離正法，　　依止於非法，　猶如捨良醫，　　而求愈篤疾。",
        "translation": "If someone parts with the right teaching and relies on what's not the right teaching, they're like abandoning a good doctor in order to heal a feverish illness.",
        "source": "T17n0728_001:0459b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法無限量，　　積學方悟入，　滴雨成駛流，　　皆由於漸次。",
        "translation": "There's no limit to the number of dharmas that can be realized only after accumulating study, and drops of rain become a driving current, all in gradual succession.",
        "source": "T17n0728_001:0459c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無始輪迴海，　　發起菩提心，　至金剛道場，　　成佛果亦爾。",
        "translation": "From the beginningless ocean of transmigration, they arouse the mind of enlightenment and arrive at the adamantine site of enlightenment, accomplishing the fruit of Buddhahood just the same.",
        "source": "T17n0728_001:0459c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨心持正法，　　不著於諸禪，　非欲境所牽，　　決定常安隱。",
        "translation": "Maintaining the right teaching with a pure mind, he's not attached to meditation, isn't pulled by objects of desire, and is determined and always at ease.",
        "source": "T17n0728_001:0459c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有智親智人，　　當捨離無智，　以智德修身，　　斯人甚希有！",
        "translation": "Those who have knowledge and are close to knowledge should abandon ignorance and cultivate their bodies with the virtue of knowledge, for this person is rare!",
        "source": "T17n0728_001:0459c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以信心求法，　　常生於勝處，　設墮險難中，　　諸天常捄護。",
        "translation": "Seeking the teaching with faith, they'll always be born in a place of victory, and if they fall into danger or trouble, the gods will always protect them.",
        "source": "T17n0728_001:0459c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於暗作明燈，　　於病為良藥，　貧乏與珍財，　　盲者使能視。",
        "translation": "They make a bright lamp in the dark, a cure for illness, and treasure for the poor, so that the blind can see.",
        "source": "T17n0728_001:0459c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於世間瀑流，　　為作彼舡筏，　若醉傲放逸，　　決定為自損。",
        "translation": "In the midst of the world's waterfalls, it's a raft for their boats, and if they become drunk and arrogant, they'll decide to harm themselves.",
        "source": "T17n0728_001:0459c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是先佛所說，　　當具足信受，　令正智現前，　　修習忘疲倦。",
        "translation": "These were the teachings of the previous Buddha, which should be fully believed and accepted, causing right knowledge to be revealed and cultivated without weariness.",
        "source": "T17n0728_001:0459c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "厭離自身品第三",
        "translation": "The Third Chapter of Being Disillusioned with Yourself",
        "source": "T17n0728_001:0459c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂利養名聞、　　飲食臥具等，　無少分希求，　　於我何所作？",
        "translation": "What do you want from me that's not limited to the pursuit of profit and fame, food and drink, and bedding?",
        "source": "T17n0728_001:0459c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是身可厭患，　　損害如冤賊，　造作諸過愆，　　常樂非梵行。",
        "translation": "\"This body is disgusting, damaging like a thief, creating transgressions, and always delighting in what's not the religious life.",
        "source": "T17n0728_001:0459c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復此身者，　　為眾病依止，　不淨常盈流，　　實罪惡之器；　與心為近住，　　無思惟覺知，　剎那命終時，　　惡色深可畏。",
        "translation": "Again, this body is the support for many illnesses, is constantly filled with impurities, and is really a vessel for sins and evil; it lives close to the mind, has no contemplation or awareness, and when its life ends in an instant, its bad form is profoundly frightening.",
        "source": "T17n0728_001:0459c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　壽煖識三緣，　　俱時而棄捨，　如枯木無知，　　形消流穢汁。",
        "translation": "He discards all three conditions of life, warmth, and consciousness at the same time, like withered wood without knowing, whose form disappears and which sheds its filthy sap.",
        "source": "T17n0728_001:0459c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫當盛年，　　迷亂多憍恣，　須臾不暫停，　　變異成衰老。",
        "translation": "When a foolish man is in the prime of life, he's confused and arrogant, and he doesn't pause for a moment to change into old age.",
        "source": "T17n0728_001:0459c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恃財富奢逸，　　廣造諸惡業，　是人命欲終，　　受極苦熱惱。",
        "translation": "Relying on wealth and extravagance, he creates a wide range of bad actions, and when his life is about to end, he suffers extreme pain and suffering.",
        "source": "T17n0728_001:0460a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不樂於正法，　　何異彼非人？",
        "translation": "Not delighting in the right teaching, how is he different from those who aren't human beings?",
        "source": "T17n0728_001:0460a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　違背涅盤城，　　棲止於邪道。",
        "translation": "He deviates from the city of nirvāṇa and rests in a wrong path.",
        "source": "T17n0728_001:0460a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　廣大修福報，　　由是生人間，　當乘智慧舟，　　永越於有海。",
        "translation": "As a result of this vast cultivation of the rewards of merit, he'll be born here, and he'll ride in the boat of wisdom, forever crossing the ocean of existence.",
        "source": "T17n0728_001:0460a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是身如掣電，　　類乾闥婆城，　云何於他人，　　數生於喜怒？",
        "translation": "This body is like a flash of lightning, and it's like the city of Gandhāra. How could joy and anger arise repeatedly in others?",
        "source": "T17n0728_001:0460a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此身非堅牢，　　暫時而動轉，　常諂曲為心，　　寧免老死怖；　為疾病城邑，　　是憂惱舍宅，　亦如於田疇，　　生善不善種。",
        "translation": "\"This body is not stable, it's momentarily disturbed, always flattering, and would rather avoid the fear of old age and death; it's a city of illness and a house of sorrow, just like a field that produces good and bad seeds.",
        "source": "T17n0728_001:0460a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人以施戒，　　慈智莊嚴身，　唯此善因緣，　　為第一堅固。",
        "translation": "If a person adorns his body with generosity and morality, kindness and wisdom, this alone is the best and most resolute of good causes.",
        "source": "T17n0728_001:0460a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又說此身者，　　為諸界所依，　若能善覺了，　　速得於解脫。",
        "translation": "It's also said that this body is the basis for all realms, and if one can well perceive it, they'll quickly attain liberation.",
        "source": "T17n0728_001:0460a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此明自身界，　　虛假強分別，　若樂他蘊界，　　愚癡無出要。",
        "translation": "This shows that his own realm is false and strongly discriminated, and if he enjoys the realms of other aggregates, he's foolish and lacks the essentials to escape.",
        "source": "T17n0728_001:0460a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若外具諸財。",
        "translation": "If he possesses external possessions, then the internal realm is devoid of quiescence.",
        "source": "T17n0728_001:0460a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　內界無寂靜，　於身善了知，　　則能脫諸苦。",
        "translation": "There's no quiescence in the internal realm, and when they well understand that body, they're freed from suffering.",
        "source": "T17n0728_001:0460a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由守護己財，　　復增於苦惱，　諸恐怖隨生，　　謂官賊水火。",
        "translation": "Because guarding one's own possessions further increases suffering and distress, terror ensues, which are officials, thieves, water, and fire.",
        "source": "T17n0728_001:0460a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若遠非法財，　　則無諸障礙，　棄捨常獲安，　　攝取當自咎。",
        "translation": "If they avoid illicit possessions, then they'll be unobstructed, always at ease when they abandon them, and self-reproach when they collect them.",
        "source": "T17n0728_001:0460a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應如實了知，　　自他蘊界相，　習定持經典，　　焚燒煩惱聚。",
        "translation": "You should truly understand the characteristics of your own and other aggregates and realms, cultivate concentration, and maintain the scriptures, and burn up the cluster of afflictions.",
        "source": "T17n0728_001:0460a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故有智人，　　於身善觀察，　既明彼界性，　　是名解脫者。",
        "translation": "Therefore, there's a wise person who well observes the body and understands the nature of those elements, which is called a liberated person.",
        "source": "T17n0728_001:0460a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離不善品第四",
        "translation": "Fourth Chapter of Being Free From Unwholesomeness",
        "source": "T17n0728_001:0460b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人於五欲，　　常生其渴愛，　由彼心動亂，　　諸惡此隨轉。",
        "translation": "\"If a person's desire for the five desires is constant, and their mind is disturbed by them, the evils are carried forward.",
        "source": "T17n0728_001:0460b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若見於女色，　　樂著無暫捨，　不悟彼無常，　　諸惡此隨轉。",
        "translation": "If they see a woman's form, they are attracted to it without momentarily abandoning it, and don't realize that it's impermanent, and the evils follow.",
        "source": "T17n0728_001:0460b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由彼貪癡故，　　增長於生死，　凡夫不了知，　　諸惡此隨轉。",
        "translation": "Because of their craving and delusion, they prolong birth and death, and ordinary people don't understand that, which is a direct result of the evils.",
        "source": "T17n0728_001:0460b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常樂行放逸，　　壽命非長久，　無正智思惟，　　諸惡此隨轉。",
        "translation": "They are always dissipated in their pleasures and actions, their life isn't long, and they lack right knowledge and contemplation, which follows the evils.",
        "source": "T17n0728_001:0460b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪欲無厭足，　　侈服恣嚴身，　生掉舉無慚，　　諸惡此隨轉。",
        "translation": "Their desires are insatiable, their clothing is lavish and lavish, their bodies are unkempt, and they give rise to agitation and lack of conscience, which are the ensuing evils.",
        "source": "T17n0728_001:0460b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常為六塵坌，　　五欲之所牽，　迷三世無知，　　諸惡此隨轉。",
        "translation": "They're constantly burdened by the six dust motes and pulled by the five desires, deluded about the three worlds and without knowledge, and the evils that follow from that.",
        "source": "T17n0728_001:0460b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂著己眷屬，　　自不知殞沒，　顧戀起恚心，　　諸惡此隨轉。",
        "translation": "They are attracted to their own retinue, don't know they're dying, become attached and become malevolent, and the bad things that follow follow follow.",
        "source": "T17n0728_001:0460b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔耽於欲境，　　則為後過患，　由意不寂靜，　　諸惡此隨轉。",
        "translation": "Being addicted to the objects of desire in the past, it's a later misdeed, and because the mind isn't quiescent, the evils follow.",
        "source": "T17n0728_001:0460b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受用彼富樂，　　恩愛忽乖離，　不究先苦因，　　諸惡此隨轉。",
        "translation": "They enjoy their wealth and pleasure, and affection is suddenly misplaced; they don't investigate the causes of prior suffering, and the evils follow.",
        "source": "T17n0728_001:0460b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為染欲所迷，　　譬若魚投網，　纏縛不能脫，　　諸惡此隨轉。",
        "translation": "Being deluded by defiled desire is like a fish throwing itself into a net, which is tethered and can't be freed, and the evils follow.",
        "source": "T17n0728_001:0460b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫常愛著，　　不知欲過失，　癡暗之所迷，　　諸惡此隨轉。",
        "translation": "A foolish man is always attached, doesn't know the faults of desire, is deluded by delusion, and is subject to the evils that follow.",
        "source": "T17n0728_001:0460b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多畜於寵嬖，　　命終而獨往，　為業羂所拘，　　諸惡此隨轉。",
        "translation": "He's often fond of animals, goes off on his own at the end of his life, is bound by the web of karma, and is subject to the evils that follow.",
        "source": "T17n0728_001:0460b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迷失於正道，　　三界殊不知，　不攝護諸根，　　諸惡此隨轉。",
        "translation": "They lose sight of the right path, don't know anything about the three realms, don't guard their faculties, and the evils follow.",
        "source": "T17n0728_001:0460b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於有戒、無戒，　　樂行於損惱，　破壞於正法，　　諸惡此隨轉。",
        "translation": "Enjoying the practice of harming those with and without precepts, and destroying the right Dharma, the evils follow.",
        "source": "T17n0728_001:0460b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於罪福損益，　　聞已如聾瘂，　譬愚童作戲，　　諸惡此隨轉。",
        "translation": "He's deaf and dumb after hearing about sins and merits and gain, like a foolish boy playing games, and these evils follow.",
        "source": "T17n0728_001:0460c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨寂靜園林，　　流泉諸勝處，　樂著於嬉逸，　　諸惡此隨轉。",
        "translation": "He leaves quiet gardens and rivers, and enjoys the pleasures of play, which follows the evils.",
        "source": "T17n0728_001:0460c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離巖谷宮殿，　　清淨蓮花池，　由貪彼欲樂，　　諸惡此隨轉。",
        "translation": "They leave the valley palace and the pure lotus pond, and because they desire their pleasures, the evils follow them.",
        "source": "T17n0728_001:0460c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖嗜妙飲食，　　無光澤威德，　作非法業緣，　　諸惡此隨轉。",
        "translation": "Even though they enjoy fine food and drink, they lack radiant splendor and virtue, and they create the causes of unlawful actions, which are followed by evils.",
        "source": "T17n0728_001:0460c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是愚癡人，　　常不生知覺，　為業風所飄，　　輪轉於三界。",
        "translation": "Thus, a foolish man always lacks awareness, is carried by the winds of karma, and rotates through the three realms.",
        "source": "T17n0728_001:0460c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或有生勝處，　　放逸而墮落，　由懈怠癡迷，　　不能斷諸過。",
        "translation": "Sometimes they're born in a superior place, become careless and fall down, and because of laziness and delusion, they aren't able to stop the faults.",
        "source": "T17n0728_001:0460c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若棄捨五欲，　　得最上安隱，　如諸佛聖人，　　無貪無憂惱。",
        "translation": "If they abandon the five desires and attain the highest peace, they'll be like the buddhas and sages who have no craving and no sorrow.",
        "source": "T17n0728_001:0460c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初中後修習，　　解脫諸垢染，　當得牟尼尊，　　第一寂靜樂。",
        "translation": "After cultivating them first, middle, and last, he'll be freed from all defilements and will attain the supreme tranquility and bliss of the venerable Muni.",
        "source": "T17n0728_001:0460c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂五欲者，　　則墮於惡趣，　彼無別功能，　　唯招其苦報。",
        "translation": "If someone enjoys the five desires, they'll fall into a bad destiny that has no special function but to bring about its painful results.",
        "source": "T17n0728_001:0460c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故有智人，　　於欲何所著？",
        "translation": "Therefore, what attachment does a wise person have to desires?",
        "source": "T17n0728_001:0460c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為彼輪迴因，　　定受諸楚毒。",
        "translation": "As a result of their transmigration, they're sure to experience pain and suffering.",
        "source": "T17n0728_001:0460c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或住天寶峰，　　園林淨池沼，　由戲妄染著，　　從彼而墮落。",
        "translation": "Perhaps they live on a jeweled peak in a heaven or in a pure pond in a forest, from which they fall due to play and false and defiled attachment.",
        "source": "T17n0728_001:0460c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天上妙金山，　　琉璃為峰頂，　由造不善業，　　從彼而墮落。",
        "translation": "There's a marvelous gold mountain in the sky, with a peak made of beryl, from which they fall because of unwholesome activity.",
        "source": "T17n0728_001:0460c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天上諸寶樹，　　清泉相間繞，　以貪欲因緣，　　從彼而墮落。",
        "translation": "There are jeweled trees in the heavens, surrounded by clear springs, from which they fall because of craving.",
        "source": "T17n0728_001:0460c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天上諸寶坊，　　香海可愛樂，　毀戒離諸善，　　從彼而墮落。",
        "translation": "The heavens are filled with jeweled mansions and seas of fragrance and delight, from which they fall after violating precepts and abandoning goodness.",
        "source": "T17n0728_001:0460c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天上妙音樂，　　聞已能適意，　由樂著廢時，　　從彼而墮落。",
        "translation": "There's marvelous music in the heavens that's pleasing to the ear, and when that pleasure is lost, they fall from it.",
        "source": "T17n0728_001:0460c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若意生貪著，　　欲境常現前，　無正智思惟，　　何因獲安樂？",
        "translation": "If mind becomes attached to desire, the object of desire is always present, and there's no correct intellectual consideration, what cause does it give to attain well-being?",
        "source": "T17n0728_001:0461a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如童稚無知，　　豈能修少福，　從彼墮落已，　　自受其業報。",
        "translation": "Like a child who's ignorant, how could he cultivate a little merit? After falling from that, he'll receive the results of his own actions.",
        "source": "T17n0728_001:0461a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人作不善，　　而求於樂果，　彼因不相似，　　愚夫心妄轉。",
        "translation": "If someone does unskillful deeds and seeks pleasant results, their causes aren't similar, and a foolish man's mind is falsely redirected.",
        "source": "T17n0728_001:0461a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於施戒正慧，　　不起於修習，　愚癡著欲人，　　為死所吞噉。",
        "translation": "Not initiating the cultivation of the right wisdom of generosity and morality, a foolish man attached to desire is devoured by death.",
        "source": "T17n0728_001:0461a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無智迷業果，　　常作諸過惡，　愚癡著欲人，　　為死所吞噉。",
        "translation": "Without knowledge and delusion about the results of actions and deeds, he often commits various faults, foolishly clinging to desires, and is devoured by death.",
        "source": "T17n0728_001:0461a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為貪火燒然，　　不知輪迴苦，　愚癡著欲人，　　為死所吞噉。",
        "translation": "Burned by the fire of greed, he doesn't know the suffering of transmigration, and he foolishly clings to his desires, which devour him in death.",
        "source": "T17n0728_001:0461a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由情愛所鍾，　　生別離苦惱，　愚人當爾時，　　為死所吞噉。",
        "translation": "When a person is deluded by craving and gives rise to the pain and suffering of separation, that foolish person is devoured by death.",
        "source": "T17n0728_001:0461a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不厭怖輪迴，　　心馳於色境，　愚癡著欲人，　　為死所吞噉。",
        "translation": "Not wearying of the fear of cyclic existence, his mind strays to the form realm, and he foolishly clings to desire, devouring it as death.",
        "source": "T17n0728_001:0461a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生病難憂怖，　　而不能厭患，　愚癡著欲人，　　為死所吞噉。",
        "translation": "When he's sick and distressed and can't get tired of suffering, a foolish man clings to desire, and he's devoured by death.",
        "source": "T17n0728_001:0461a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為彼惡知識，　　趣輪迴險道，　愚癡著欲人，　　為死所吞噉。",
        "translation": "For the sake of that bad friend, he'll go down the dangerous path of transmigration, foolishly clinging to desire, and he'll be devoured by death.",
        "source": "T17n0728_001:0461a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心起邪思惟，　　違背於正理，　愚癡著欲人，　　為死所吞噉。",
        "translation": "He gives rise to wrong thoughts in his mind, goes against the right principles, and foolishly clings to desires that devour him by death.",
        "source": "T17n0728_001:0461a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自行於非法，　　作生死怖畏，　愚癡著欲人，　　為死所吞噉。",
        "translation": "He takes it upon himself to act contrary to what's right and creates fear of birth and death, foolishly clinging to his desires, and he's devoured by death.",
        "source": "T17n0728_001:0461a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常發染污言，　　心寧知罪福，　愚癡著欲人，　　為死所吞噉。",
        "translation": "He always speaks slanderously, preferring to know sin and merit in his mind, and foolishly clings to desires that devour him by death.",
        "source": "T17n0728_001:0461a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由慣習貪愛，　　不樂真實法，　愚癡著欲人，　　為死所吞噉。",
        "translation": "Accustomed to craving, they don't enjoy the true teaching, and they foolishly cling to their desires, which devour them in death.",
        "source": "T17n0728_001:0461a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於己求快樂，　　於法生損壞，　愚癡著欲人，　　為死所吞噉。",
        "translation": "Seeking pleasure for himself and becoming corrupted by the teaching, a foolish man clinging to desire is devoured by death.",
        "source": "T17n0728_001:0461b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當專注一心，　　常修持淨業，　棄捨諸不善，　　是名為智者。",
        "translation": "This is called a wise person who focuses their mind on single-mindedly cultivating pure activities and discarding unwholesome ones.",
        "source": "T17n0728_001:0461b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若諸天著樂，　　不樂修施戒，　常生放逸心，　　決定當墮落。",
        "translation": "If gods are attached to pleasure, don't enjoy cultivating the precepts, and always give rise to carelessness, they'll surely fall.",
        "source": "T17n0728_001:0461b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有天寶山，　　諸珍所嚴瑩，　琉璃以為峰，　　與須彌相稱。",
        "translation": "\"Again, there's a celestial jewel mountain, adorned with treasures and capped with beryl, which is proportionate to Sumeru.",
        "source": "T17n0728_001:0461b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼天或初生，　　現住及將沒，　若生放逸心，　　於彼而流轉。",
        "translation": "Whether it's a god or a firstborn, presently abiding or about to perish, if they give rise to carelessness, they'll wander about there.",
        "source": "T17n0728_001:0461b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其地悉嚴淨，　　林木起涼風，　若生放逸心，　　於彼而流轉。",
        "translation": "Their ground is perfectly pure, and the trees in their forest produce a cool breeze, so if they give rise to carelessness, they'll circulate there.",
        "source": "T17n0728_001:0461b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有妙蓮花池，　　金葉琉璃幹，　若生放逸心，　　於彼而流轉。",
        "translation": "There's a wonderful lotus-flower pond and a beryl trunk with gold leaves, so if you give rise to a carefree mind, you'll flow through it.",
        "source": "T17n0728_001:0461b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有清勝河流，　　珍禽悉翔集，　若生放逸心，　　於彼而流轉。",
        "translation": "There's a pure, beautiful river where rare birds gather, and if you give rise to a carefree mind, you'll flow through it.",
        "source": "T17n0728_001:0461b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有上妙輦輿，　　層樓極高勝，　若生放逸心，　　於彼而流轉。",
        "translation": "There's a wonderful palanquin with a high, towering building, and if you give rise to a careless mind, you'll circulate there.",
        "source": "T17n0728_001:0461b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是流轉相，　　皆由迷欲境，　云何說名人，　　心不生厭捨？",
        "translation": "Such marks of transmigration are all caused by the objects of deluded desire, so how can we say that famous people don't become disillusioned with them?",
        "source": "T17n0728_001:0461b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂習放逸行，　　則增長輪迴，　於此不遠離，　　當受大苦惱。",
        "translation": "Enjoying careless behavior, they'll grow into the cycle of rebirth, and if they don't part with it, they'll experience great suffering and distress.",
        "source": "T17n0728_001:0461b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　屠者縛群畜，　　皆不令馳散，　眷屬累於身，　　何由能免脫？",
        "translation": "A butcher ties up a herd of animals, doesn't allow them to escape, and how can they escape the burden of having dependents on their bodies?",
        "source": "T17n0728_001:0461b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又彼諸天眾，　　常著諸欲樂，　不知生滅因，　　彼天如愚者。",
        "translation": "\"Furthermore, those gods are always addicted to desires and pleasures, and they don't know the causes of birth and death; they're like gods who are foolish.",
        "source": "T17n0728_001:0461b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是彼眾生，　　為放逸牽縛，　極增上愚癡，　　至死無醒悟。",
        "translation": "Thus, these sentient beings are bound by carelessness, which increases their folly so much that they never awaken to death.",
        "source": "T17n0728_001:0461b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心常造諸惡，　　為死所降伏，　欲火鎮燒然，　　徒增於後悔。",
        "translation": "Their minds are constantly creating evil, which is subjugated by death, and the fires of desire burn them down, adding to their regrets in vain.",
        "source": "T17n0728_001:0461b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由樂行非法，　　決定入輪迴，　於彼命終時，　　極怖無捄度。",
        "translation": "Because they enjoy practicing what's not the Dharma, they decide to enter the cycle of rebirth, and at the end of their lives, they are terrified and have no way to escape.",
        "source": "T17n0728_001:0461c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不思擇善法，　　常樂於歡聚，　倐爾忽乖違，　　則受別離苦。",
        "translation": "Not considering the selection of good qualities, he always enjoys pleasures and gatherings, but suddenly he deviates, and then he suffers separation.",
        "source": "T17n0728_001:0461c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　晝夜促壽命，　　在須臾頃刻，　死怖若現前，　　應知無能免。",
        "translation": "Day and night pass quickly into life, and in a moment's time, if the fear of death were to appear, you would know that it's impossible to escape.",
        "source": "T17n0728_001:0461c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者覩生滅，　　則興於嗟歎，　捨放逸愚癡，　　得離垢清淨。",
        "translation": "When a wise person sees birth and death, they are overcome with admiration, abandon carelessness and delusion, and attain freedom from defilement and purity.",
        "source": "T17n0728_001:0461c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀自他滅相，　　何容造諸惡，　若心離過失，　　當獲寂靜樂。",
        "translation": "Observing the cessation of self and other, how can he create evil? If his mind is free of faults, he'll attain quiescence and happiness.",
        "source": "T17n0728_001:0461c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不放逸最勝，　　是如來所說。",
        "translation": "Not being careless and most excellent, this is what the Tathāgata teaches.",
        "source": "T17n0728_001:0461c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人若悟無常，　　則捨諸不善。",
        "translation": "If a person understands impermanence, he'll abandon what's unwholesome.",
        "source": "T17n0728_001:0461c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無常品第五",
        "translation": "Chapter 5 of Impermanent",
        "source": "T17n0728_001:0461c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盡快樂邊際，　　一切無有常，　若自生愛樂，　　應知當棄捨。",
        "translation": "\"At the limit of expeditious pleasure, all things are impermanent, and if you yourself become attached to pleasure, you should know that you must abandon it.",
        "source": "T17n0728_001:0461c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是死怖可畏，　　迅速難防護，　或於戲笑中，　　忽爾而長逝。",
        "translation": "This is a fearful death that's difficult to protect against quickly, or it may suddenly and permanently pass away amidst play and laughter.",
        "source": "T17n0728_001:0461c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此滅法平等，　　處處悉周遍，　於此不了知，　　真是愚癡者。",
        "translation": "The equality of these cessation dharmas is fully pervasive everywhere, and not knowing it is truly foolish.",
        "source": "T17n0728_001:0461c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若年少衰老，　　或貧乏富足，　及在家出家，　　為死所勾攝。",
        "translation": "If he's young and old, poor and wealthy, or a householder or renunciant, he's taken under the spell of death.",
        "source": "T17n0728_001:0461c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若快樂苦惱，　　或有德無德，　淨行非淨行，　　為死所勾攝。",
        "translation": "If they are happy and distressed, or if they have virtue or lack virtue, or if their conduct is pure or impure, they're snared by death.",
        "source": "T17n0728_001:0461c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若持戒毀戒，　　或智者愚夫，　乃至尊及卑，　　為死所勾攝。",
        "translation": "If they observe precepts and disparage them, or if they're wise and foolish, or if they're most noble and base, they're liable to be snared by death.",
        "source": "T17n0728_001:0461c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若天若地獄，　　或餓鬼畜生，　醒覺及惛迷，　　為死所勾攝。",
        "translation": "If someone is born in heaven or hell, or a hungry ghost or animal, awake and confused, they're taken in by death.",
        "source": "T17n0728_001:0461c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若生於欲界，　　或住色界者，　無色亦復然，　　為死所勾攝。",
        "translation": "If someone is born in the desire realm or lives in the form realm, the formless realm is likewise, and they're taken in by death.",
        "source": "T17n0728_001:0461c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是身老病侵，　　如杖索捶縛，　彼死有強力，　　於眾無慈護。",
        "translation": "Their bodies are attacked by old age and illness, like being tied with a staff, and they have the strength of death and no compassion for others.",
        "source": "T17n0728_001:0462a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有種種恐怖，　　死畏極險惡，　諸天癡所盲，　　對此有啼笑。",
        "translation": "They have various fears, and the fear of death is so great and dangerous that gods blinded by delusion laugh and cry at them.",
        "source": "T17n0728_001:0462a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從天中墮沒，　　有乖離苦惱，　或墮地獄中，　　彼苦無窮極。",
        "translation": "They fall from among the gods, are subject to misfortune and suffering, or they fall into hell, where their suffering knows no limit.",
        "source": "T17n0728_001:0462a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受天上快樂，　　唯滅生憂苦，　如毒雜美味，　　是故當棄捨。",
        "translation": "Enjoying the pleasures of heaven, they only cease to give rise to sorrow and pain, like poison and delicious food, which should therefore be discarded.",
        "source": "T17n0728_001:0462a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼天福將盡，　　親屬皆捨去，　當其墮落時，　　是苦無相似。",
        "translation": "When their heavenly merit is about to end, their relatives are all abandoned, and when they fall, this pain has no resemblance.",
        "source": "T17n0728_001:0462a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以福減劣故，　　如油盡燈滅，　於此命臨終，　　但增其逼惱。",
        "translation": "Because their fortune is diminished, they're like a lamp that's run out of oil, and when their life ends, it only increases their distress.",
        "source": "T17n0728_001:0462a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為愛欲所纏，　　憂慼心狂亂，　語緩身顫動，　　是彼墮落怖。",
        "translation": "Being tethered by craving and desire, their sadness and distress, and their lax speech and body trembling, this is the fear of falling.",
        "source": "T17n0728_001:0462a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常著彼快樂，　　為欲所欺誑，　或暫時捨離，　　彼則生苦惱。",
        "translation": "They're always attached to their pleasures, deceived by their desires, or they temporarily abandon them, and then they become afflicted.",
        "source": "T17n0728_001:0462a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天墮落苦，　　比地獄猶輕，　於十六分中，　　而不及其一。",
        "translation": "The suffering of falling into the heavens is less severe than that of hell, and among the sixteen divisions, it's not one of them.",
        "source": "T17n0728_001:0462a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天中滅沒怖，　　人間死憂惱，　見已不厭患，　　況復輪迴火。",
        "translation": "The fear of annihilation in heaven and the sorrow of death among humans are not discomforted by what they've seen, much less by the fires of transmigration.",
        "source": "T17n0728_001:0462a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由著樂退失，　　即知世無常，　若覺悟彼因，　　心當造諸善。",
        "translation": "Because he loses his attachment to pleasure, he then knows the world is impermanent, and if he realizes its cause, his mind will create goodness.",
        "source": "T17n0728_001:0462a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　高者必當墜，　　世數終歸盡，　合會有分離，　　死為命邊際。",
        "translation": "The high will surely fall, the number of worlds will eventually end, there's separation in conjunction, and death is the limit of life.",
        "source": "T17n0728_001:0462a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法有無常，　　生滅即隨轉，　有生無滅者，　　三界何曾見！",
        "translation": "All things are impermanent, birth and death follow each other, and if there's birth and no death, how could we ever see the three realms?",
        "source": "T17n0728_001:0462a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或一生餘族，　　或一胎中喪，　或隨轉往來，　　或作欲事業，　如見日光明，　　出已定當沒，　一切有生者，　　滅即依前住。",
        "translation": "Whether born to another family, or killed in a single birth, or reborn following a rebirth, or engaged in a desirable occupation, like seeing the light of the sun, they're certain to disappear after emerging, and all those who are born will cease based on their previous abode.",
        "source": "T17n0728_001:0462a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫不了知，　　彼樂生即滅，　無出離方便，　　後當唯守死。",
        "translation": "A foolish man doesn't understand that their pleasure is produced and then extinguished, and without the method of escape, he'll only abide in death afterward.",
        "source": "T17n0728_001:0462b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當求彼常樂，　　未殞勤修善，　隨順正法行，　　此說為智者。",
        "translation": "They should seek their constant happiness, diligently cultivate goodness before they're retired, and practice in accord with the right teaching, which is described as wise.",
        "source": "T17n0728_001:0462b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無常亦何定？",
        "translation": "\"What is the certainty of impermanence?",
        "source": "T17n0728_001:0462b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　他世轉艱辛，　佛說輪迴因，　　唯此為真實。",
        "translation": "\"Adversity in other lives is the only true cause of transmigration as explained by the Buddha.",
        "source": "T17n0728_001:0462b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂彼彼生起，　　即數數墮滅，　諸天著樂故，　　則多生憍傲。",
        "translation": "They are those that are produced and then fall into extinction repeatedly, and because they are attached to the pleasures of gods, they often become proud.",
        "source": "T17n0728_001:0462b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復彼天中，　　滅時受苦惱，　唯除地獄中，　　餘苦無與等。",
        "translation": "Also, among those gods, suffering and distress are experienced when they cease, except in hell, where the rest of suffering is unequalled.",
        "source": "T17n0728_001:0462b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由堅著五欲，　　自不知退沒，　如是愚癡人，　　何由免老死？",
        "translation": "Because he's firmly attached to the five desires and doesn't know he's falling back, how can such a foolish man avoid old age and death?",
        "source": "T17n0728_001:0462b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受輪轉生滅，　　其數無有量，　不生出離心，　　彼為自欺誑。",
        "translation": "Their number is countless, and if they don't give rise to the mind of emancipation, they're self-deceived.",
        "source": "T17n0728_001:0462b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　居高者必危，　　聚寶當有乏，　恩愛有乖離，　　生者皆歸死。",
        "translation": "Those who stand tall will surely be at risk, those who gather treasure will lack it, there's a divergence in kindness, and all births return to death.",
        "source": "T17n0728_001:0462b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生已即長大，　　壯色不暫停，　倐爾即無常，　　俱生性如此。",
        "translation": "They'll grow up after birth, their robust appearance won't be suspended, and they'll be impermanent in a moment, so is the nature of all births.",
        "source": "T17n0728_001:0462b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於福不攝取，　　為境界所縛，　由貪愛愚癡，　　臨終無救護。",
        "translation": "They don't grasp at merit, are bound by the objective realm, and because of craving and delusion, they end up without protection.",
        "source": "T17n0728_001:0462b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有妙寶峰，　　莊嚴皆具足，　有種種蓮華，　　林木極可愛；　有種種河池，　　水鳥咸依止；　有眾妙名華，　　眾寶而嚴飾；　有最勝宮殿，　　皆珍寶所成，　劫樹發金光，　　葉布琉璃色，　尼俱律陀樹，　　銀光相間錯，　蓮蘤悉開敷，　　眾蜂如音樂，　有上妙瓔珞，　　奇巧勝無比，　人世昔所修，　　感果皆如意。",
        "translation": "\"Again, there's a peak of marvelous treasures, fully adorned, with various lotus flowers and desirable trees, various rivers and pools where waterfowl support, many wonderfully named flowers, adorned with many treasures, a most excellent palace made of precious treasures, an eon tree that glows with gold, leaves the color of lapis lazuli, a nyagrodha tree, silvery lights interspersed, lotus blossoms in full bloom, multitudes of bees like music, and a superb necklace with marvelous finery that's unsurpassed in its skillfulness, which people used to cultivate and which produces the results they desire.",
        "source": "T17n0728_001:0462b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼諸天著樂，　　不悟彼無常，　如乾闥婆城，　　如幻泡聚沫。",
        "translation": "Those gods are addicted to pleasure, don't understand that it's impermanent, and are like the city of Gandhāra, like an illusory bubble full of foam.",
        "source": "T17n0728_001:0462c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愛欲如熾火，　　依彼即破壞，　由此而命終，　　漂沈於有海。",
        "translation": "Their desires are like blazing fires that are destroyed when they rely on them, and their lives end as a result, sinking into the ocean of existence.",
        "source": "T17n0728_001:0462c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於五欲快樂，　　受用無厭捨，　滅時為彼燒，　　諸天皆遠離。",
        "translation": "Enjoying the five pleasures, they are relentlessly enjoyed, and when they cease, they are burned by them, and the gods all part with them.",
        "source": "T17n0728_001:0462c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多欲無慚恥，　　為第一鄙惡，　諸天縱癡冥，　　死魔得其便。",
        "translation": "Their numerous desires and lack of conscience are the worst offenders, and even though the gods are deluded, the demons of death get an advantage over them.",
        "source": "T17n0728_001:0462c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若天人脩羅，　　夜叉龍神等，　為死羂所拘，　　無一能捄者。",
        "translation": "If gods, humans, sūras, yakṣas, dragons, and gods are caught by the noose of death, there's no one who can rescue them.",
        "source": "T17n0728_001:0462c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至遍三界，　　皆為死所攝，　由堅著貪癡，　　何由得解脫？",
        "translation": "Even throughout the three realms, they're all caught by death, and because of their persistent addiction and delusion, how can they be liberated?",
        "source": "T17n0728_001:0462c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天由著樂，　　受百千死畏，　境界如乾薪，　　彼死如熾火。",
        "translation": "Because of their attachment to pleasure, gods experience the fear of a hundred thousand deaths, an object like dry wood, and their death is like a blazing fire.",
        "source": "T17n0728_001:0462c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若覩他滅謝，　　己何不知覺？",
        "translation": "If they see the cessation of others, why wouldn't they know it?",
        "source": "T17n0728_001:0462c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　病苦欲終時，　　自受其業報。",
        "translation": "When illness and suffering are about to end, they themselves will experience the results of their actions.",
        "source": "T17n0728_001:0462c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　放逸染於心，　　耽著欲境界，　不悟彼無常，　　俱生性如是。",
        "translation": "Their mind is stained by carelessness, and they become addicted to the desire realm, not realizing that it's impermanent, and their nature is thusness in their common birth.",
        "source": "T17n0728_001:0462c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂行放逸，　　常追求欲樂，　彼與毒相似，　　為死兵所逐。",
        "translation": "If someone enjoys practicing carelessness and always pursues desire and pleasure, they're similar to poison and are chased by the armies of death.",
        "source": "T17n0728_001:0462c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非呪術妙藥，　　及大力脩羅，　為死繩所牽，　　彼彼不能救。",
        "translation": "They can't be saved by the rope of death unless they have a spell for a wonderful medicine or a powerful sūtra.",
        "source": "T17n0728_001:0462c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為貪塵翳目，　　都無所覺知，　彼著欲眾生，　　唯死為歸趣。",
        "translation": "Blinded by the dust of craving, they don't even perceive it, and they're attached to desiring sentient beings whose only destination is death.",
        "source": "T17n0728_001:0462c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂於貪欲，　　多求於快樂，　不生厭離心，　　於死而不遠。",
        "translation": "If they delight in desire and often seek pleasure, they don't become disillusioned with it, and they aren't far from death.",
        "source": "T17n0728_001:0462c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼焰摩使者，　　強力無能却，　剎那現其前，　　即受大恐怖。",
        "translation": "That messenger Yama, powerful and unstoppable, appears before him momentarily and is immediately struck by great fear.",
        "source": "T17n0728_001:0463a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨彼天寶山，　　林泉殊勝境，　從彼而墮落，　　隨業受自果。",
        "translation": "He leaves that jeweled mountain in the sky or that superb forest or spring, falls down from there, and experiences the results of his actions.",
        "source": "T17n0728_001:0463a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂著於遊戲，　　受欲無厭足，　彼渴愛癡迷，　　墮落無能捄。",
        "translation": "They're addicted to play, experience desire without tire, and are deluded by thirst and desire, and their descent is unsurvivable.",
        "source": "T17n0728_001:0463a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如遙見彼煙，　　則知火非遠，　衰相若現前，　　彼定當退沒。",
        "translation": "Like seeing smoke from that place from afar, they know the fire isn't far away, and when decay and retreat appear, they'll surely fade away.",
        "source": "T17n0728_001:0463a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有生必當滅，　　無病暫輕安，　年少老所侵，　　榮盛倏衰變；　恩愛有別離，　　和合不久住，　諸法本無常，　　正覺之所說。",
        "translation": "'Birth will surely cease, absence of illness will be temporary and peaceful, youth will be attacked by old age, prosperity will soon decline, affection will be separated, union will not last, and dharmas are inherently impermanent, as explained by the correctly enlightened.'",
        "source": "T17n0728_001:0463a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自他生滅法，　　二種常隨轉，　滅己復還生，　　決定如是住。",
        "translation": "The dharmas of birth and death of self and others, both of which are always changing, cease and return to birth, and are definitely thus abiding.",
        "source": "T17n0728_001:0463a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚人剎那間，　　少福即消殄，　是故彼正士，　　速修調御法。",
        "translation": "A moment in time, a fool's small amount of merit is lost, so that righteous man quickly cultivates the Dharma of discipline.",
        "source": "T17n0728_001:0463a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　壯色非久停，　　壽命亦隨滅，　常祛放逸心，　　具足修諸善。",
        "translation": "Their good looks don't last long, and their life span also ends, so they always rid themselves of carelessness and fully cultivate goodness.",
        "source": "T17n0728_001:0463a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天具智者，　　悟剎那生滅，　勤修於福業，　　當證於真常。",
        "translation": "Those gods with wisdom understand that instantaneous birth and death occur, and they diligently cultivate meritorious actions that will lead to the realization of true eternalism.",
        "source": "T17n0728_001:0463a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有妙樓閣，　　密葉羅清陰，　修藤發異花，　　芬馥而圍繞。",
        "translation": "\"Again, there's a marvelous tower with a clear shade of dense foliage, and it's surrounded by fragrant flowers from cultivated vines.",
        "source": "T17n0728_001:0463a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有勝妙樓閣，　　眾寶所裝校，　金河泛清泉，　　諸珍廁階陛。",
        "translation": "There's a marvelous tower, decorated with many treasures, with a river of gold flooding its clear waters and a staircase lined with precious toilets.",
        "source": "T17n0728_001:0463a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆由善業招，　　畢竟不久住，　譬若彌盧山，　　劫盡亦散壞。",
        "translation": "It's all the result of good actions that lead to a final, near-term abiding like Mount Miliṇḍa, which also disintegrates at the end of an eon.",
        "source": "T17n0728_001:0463a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又彼諸天人，　　生憍慢放逸，　不念於無常，　　剎那而墮落。",
        "translation": "Those gods and humans become proud and careless, aren't mindful of impermanence, and fall down momentarily.",
        "source": "T17n0728_001:0463a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼天中有情，　　五欲得自在，　受多快樂已，　　定溺於惡趣。",
        "translation": "Those heavenly beings attain freedom from the five desires, and after they experience many pleasures, they're surely drowning in a bad destiny.",
        "source": "T17n0728_001:0463a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若身根意識，　　逼迫無時處，　彼苦極艱辛，　　不知其數量。",
        "translation": "If their physical faculties and consciousnesses are constrained for an indefinite period of time, their suffering is so severe that they don't know its amount.",
        "source": "T17n0728_001:0463b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恃己多眷屬，　　而生於常想，　當其退沒時，　　則受乖離苦。",
        "translation": "Relying on their many dependents, they give rise to the idea of permanence, and when they fade away, they'll suffer disagreement and separation.",
        "source": "T17n0728_001:0463b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於侍衛僮僕，　　俱時而棄捨，　由增上愚迷，　　至死無知覺。",
        "translation": "They abandon their attendants and servants at the same time, and because of their extreme delusion, they become unaware until death.",
        "source": "T17n0728_001:0463b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼天將滅時，　　根識唯憂苦，　覩斯墮落已，　　彼我當無異。",
        "translation": "When those gods are about to perish, their faculties and consciousnesses are only sad and painful, and after seeing their fall, their self will be no different.",
        "source": "T17n0728_001:0463b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是三界虛假，　　諸法皆有為，　旋轉如車輪，　　不堅如聚沫。",
        "translation": "These three realms are false, and all dharmas are artificial, revolving like a chariot wheel and insubstantial like clouds of foam.",
        "source": "T17n0728_001:0463b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是身如聚沫，　　著臥具衣服；　是心如車輪，　　樂和合動轉。",
        "translation": "That body is like foam, clothed in bedding, and that mind is like a chariot wheel that moves happily in combination.",
        "source": "T17n0728_001:0463b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非天人夜叉，　　脩羅迦樓羅，　唯自作善業，　　於死能捄度。",
        "translation": "No god, no human, no yakṣa, or sūra-kālôdayin, but only their own good actions will save them from death.",
        "source": "T17n0728_001:0463b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至未來世，　　死怖深可畏，　若不修勝因，　　後悔無所益。",
        "translation": "Even in future lives, the fear of death is so great and frightening that if we don't cultivate excellent causes, there's no benefit in regret.",
        "source": "T17n0728_001:0463b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是鄙劣境界，　　能生多欲樂，　由無智愚癡，　　不知命邊際。",
        "translation": "This is a despicable state that produces many desires and pleasures because of ignorance and delusion, and they don't know the limits of life.",
        "source": "T17n0728_001:0463b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何者是親屬？",
        "translation": "What's a relative?",
        "source": "T17n0728_001:0463b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何者為快樂？",
        "translation": "What is happiness?",
        "source": "T17n0728_001:0463b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　滅相現其前，　　彼天無依怙。",
        "translation": "With the appearance of cessation before them, those gods have no support.",
        "source": "T17n0728_001:0463b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨離諸勝處，　　林木花莊嚴，　為死繩所牽，　　隨業而長逝。",
        "translation": "They abandon their excellent places, adorned by trees and flowers, are tugged by the bonds of death, and they pass away long after their actions.",
        "source": "T17n0728_001:0463b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如水踊於空，　　勢墮即飄散，　聚首有睽離，　　輪迴各流轉。",
        "translation": "Like water that rises up in the sky and dissipates when its momentum falls, it gathers its head, separates, and transmigrates separately.",
        "source": "T17n0728_001:0463b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又如陽春時，　　眾花悉開發，　時景速遷流，　　人豈能長久？",
        "translation": "Also like a sunny spring day when all the flowers bloom, the landscape quickly moves on, so how can people last long?",
        "source": "T17n0728_001:0463b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法集要經卷第一",
        "translation": "Sutra of the Collection of Essentials of the Dharma, Volume 1",
        "source": "T17n0728_001:0463b28_0",
        "is_bad_quality": false
    }
]