[
    {
        "source_sentence": "諸法集要經卷第七",
        "translation": "Sutra on the Collection of Essentials of the Dharma, Volume 7",
        "source": "T17n0728_007:0492c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀無畏尊者集",
        "translation": "Sutra on the Collection of the Venerable Fearless One",
        "source": "T17n0728_007:0492c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫",
        "translation": "Tripiṭaka of the Western Paradise Translation Sutra, Chaosan Dashi",
        "source": "T17n0728_007:0492c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "試鴻臚卿宣梵大師賜紫",
        "translation": "the purple color bestowed by the great teacher Xuanfan, the minister of Kehong-lo",
        "source": "T17n0728_007:0492c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門臣日稱等奉　詔譯",
        "translation": "translated by imperial order by the ascetics Risshiang and others",
        "source": "T17n0728_007:0492c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說罪品第十五之餘",
        "translation": "the fifteenth chapter of the exposition of sins and the remaining chapters",
        "source": "T17n0728_007:0492c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　明了罪福相，　　是為具智者，　於此無正解，　　乃愚癡所作。",
        "translation": "This is a person of complete knowledge who understands the characteristics of sins and merits, and who lacks correct understanding here, which is the result of foolishness.",
        "source": "T17n0728_007:0492c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善達諸功德，　　於過惡亦然，　二種如實知，　　常獲於樂分。",
        "translation": "Well-versed in the virtues, he does the same with faults and evils, and truly knowing both, he always attains the pleasant part.",
        "source": "T17n0728_007:0492c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人造諸罪，　　如與冤同處，　樂行善利者，　　如近於良友。",
        "translation": "If someone commits sins, it's like living with an enemy, and they enjoy doing good actions and benefits, like being near a good friend.",
        "source": "T17n0728_007:0492c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由愛染造作，　　境界常現前，　展轉癡暗中，　　常受諸楚毒。",
        "translation": "As a result of the defiled creation of craving, the objective realm is always present, and in the darkness of recurring delusion, they're constantly subject to pain and suffering.",
        "source": "T17n0728_007:0492c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲境如稠林，　　貪愛常遊處，　愚夫不達法，　　何因能出離？",
        "translation": "The realm of desire is like a dense forest, where craving always wanders, and foolish people don't understand the teaching; what cause can they escape from?",
        "source": "T17n0728_007:0492c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墮彼地獄中，　　和合受眾苦，　當知不作罪，　　無由來至此。",
        "translation": "They'll fall into that hell, combining various sufferings, knowing that there's no way to get here without committing a sin.",
        "source": "T17n0728_007:0492c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行善獲勝報，　　無量福莊嚴，　為惡自招殃，　　決定無能免。",
        "translation": "Doing good deeds rewards them with excellent rewards and measureless merits, but doing evil brings its own retribution, and there's no way to avoid it.",
        "source": "T17n0728_007:0492c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂自他苦樂，　　循環三有海，　由業風所吹，　　如波依於水。",
        "translation": "These are the pain and pleasure of self and others, which circulate through the three oceans of existence and are blown by the wind of karma like waves depending on water.",
        "source": "T17n0728_007:0492c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人生於逸，　　常造作諸惡，　以是因緣故，　　當墮於地獄。",
        "translation": "If someone lives carelessly and always creates evil, as a result of these causes, they'll fall into hell.",
        "source": "T17n0728_007:0492c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從地獄得脫，　　生於餘趣中，　復為欲所牽，　　忘昔所受苦。",
        "translation": "Once freed from hell, he'll be born in another rebirth, again tethered by desire, and forget the suffering he once endured.",
        "source": "T17n0728_007:0492c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此心由慣習，　　暫悟即還迷，　樂壞苦復生，　　不思惟後患。",
        "translation": "Because this mind is accustomed to it, it returns to delusion after a moment of awakening, destroys pleasure and produces pain again, and doesn't contemplate the consequences.",
        "source": "T17n0728_007:0493a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為五根所誑，　　狂亂侵佗境，　受流轉無窮，　　皆由愛纏縛。",
        "translation": "They're deceived by the five faculties, confused, encroaching on the wandering world, and subject to endless transmigration, all tethered by craving.",
        "source": "T17n0728_007:0493a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墮地獄鬼趣，　　傍生及邊夷，　或暫生天中，　　須臾還退殃。",
        "translation": "They're cast into the hells, ghosts, animals, and peasants, or they're temporarily born in the heavens and soon fall back into misfortune.",
        "source": "T17n0728_007:0493a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受諸趣流轉，　　如世間車輪，　皆由業習牽，　　而不生疲厭。",
        "translation": "They're subject to the transmigration of all destinies like the wheels of a worldly cart, all pulled by karmic impressions, but they don't become weary.",
        "source": "T17n0728_007:0493a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設使生天中，　　受極妙快樂，　福盡還退墮，　　此皆輪迴行。",
        "translation": "If someone were to be born in a heaven and experience the most wonderful happiness but then fall back when their merits are exhausted, this is the practice of transmigration.",
        "source": "T17n0728_007:0493a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墮蓮華地獄，　　百千俱胝數，　受無量苦惱，　　愚癡無厭怖。",
        "translation": "They fall into the lotus-flower hell, which is a hundred thousand koṭīs in number, experience measureless suffering and distress, and have no tire of fear of foolishness.",
        "source": "T17n0728_007:0493a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三界無有樂，　　皆為苦所逼，　眾生癡所盲，　　未嘗懷憂畏。",
        "translation": "There's no happiness in the three realms, but they're all forced by suffering, and sentient beings are so blinded by delusion that they never experience sorrow and fear.",
        "source": "T17n0728_007:0493a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫迷苦因，　　於苦不能了，　是苦從因起，　　如種生其果。",
        "translation": "Foolish people are confused about the causes of suffering and can't understand it; it's from the causes that suffering arises, like seeds producing their effects.",
        "source": "T17n0728_007:0493a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由苦樂所拘，　　於三有往返，　唯除寂滅樂，　　永離諸憂惱。",
        "translation": "Bound by suffering and pleasure, they go back and forth among the three existences, except for the happiness of cessation, which permanently frees them from sorrow and distress.",
        "source": "T17n0728_007:0493a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在所生處，　　能思念諸苦，　是苦不復生，　　離苦獲安隱。",
        "translation": "If he can contemplate suffering in the place where it arises, suffering won't arise again, and he'll be freed from suffering and attain peace.",
        "source": "T17n0728_007:0493a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人能憶念，　　地獄中苦惱，　則於彼樂中，　　少分而不著。",
        "translation": "If a person can remember the suffering and distress of hell, then they won't be attached to a small part of that happiness.",
        "source": "T17n0728_007:0493a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是了知已，　　世間悉虛假，　當離諸過患，　　以慧善修作。",
        "translation": "After thus knowing this, the world is entirely false, and he will part with the faults and well-exercised wisdom.",
        "source": "T17n0728_007:0493a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　壽命不久住，　　瞬息剎那間，　斷除彼惡因，　　常奉行眾善。",
        "translation": "His life span is short, fleeting and momentary, and he removes those bad causes and always cultivates goodness.",
        "source": "T17n0728_007:0493a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　了住壽非堅，　　一切由心造，　依正行所作，　　不求邪活命，　未來世苦惱，　　何不生驚怖？",
        "translation": "Their longevity is not certain, but it's all created by the mind, based on right action, not seeking wrong livelihood, and suffering and distress in future lives, so why wouldn't they become frightened?",
        "source": "T17n0728_007:0493a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　癡索鎮縈纏，　　獄火常燒煮。",
        "translation": "The cords of delusion are tangled, and they're always burned by the fires of hell.",
        "source": "T17n0728_007:0493b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　癡為不善法，　　違白淨福業，　能引惡眾生，　　長淪於苦海。",
        "translation": "Delusion is an unskillful quality that goes against pure, white merit and leads bad sentient beings to fall into the ocean of suffering for a long time.",
        "source": "T17n0728_007:0493b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人不怖罪，　　樂多造諸惡，　展轉地獄中，　　為獄火燒炙。",
        "translation": "If someone isn't afraid of sin and is comfortable doing lots of evil, they'll roam around in hell and be burned by the fires of hell.",
        "source": "T17n0728_007:0493b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如一微細火，　　則能燒諸物，　愚夫罪少許，　　亦墮於地獄。",
        "translation": "Like a tiny flame, it can burn things, and even a foolish man who commits a small amount of sin falls into hell.",
        "source": "T17n0728_007:0493b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人怖惡道，　　不作諸罪行，　能攝受正法，　　捨惡而從善。",
        "translation": "If someone fears the evil path and doesn't commit crimes, they'll be able to accept the right teaching, abandon evil, and follow goodness.",
        "source": "T17n0728_007:0493b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惡友生放逸，　　起無慚無愧，　智者常遠之，　　彼如火如毒。",
        "translation": "A bad friend produces dissipation, arouses a lack of conscience and modesty, and is always kept away from by the wise, for he's like fire and poison.",
        "source": "T17n0728_007:0493b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苦法為魔障，　　樂法無所礙，　於二善分別，　　一切皆通達。",
        "translation": "Painful dharmas are demonic hindrances, but pleasant dharmas are no obstruction, and they all comprehend the two kinds of good discernment.",
        "source": "T17n0728_007:0493b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠彼惡知識，　　樂廣行施忍，　慈念諸眾生，　　是生天要行。",
        "translation": "Keeping those bad associates at a distance, he enjoys generosity and forbearance, and is compassionate toward sentient beings, which are essential practices for birth in heaven.",
        "source": "T17n0728_007:0493b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄品第十六",
        "translation": "The Sixteenth Chapter of the Book of Hell",
        "source": "T17n0728_007:0493b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人邪活命，　　造作眾惡業，　今當說其報，　　後墮於地獄。",
        "translation": "\"If someone lives a wrong life and creates many bad actions, I will now explain their consequences and will eventually fall into hell.",
        "source": "T17n0728_007:0493b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂等活黑繩，　　眾合二號叫，　燒然極燒然，　　無間地獄等；　如是八地獄，　　方面各一門，　彼一一獄門，　　四獄為城郭；　鐵城遍圍繞，　　造惡者充滿，　獄卒叉罪人，　　如魚烹鼎鑊；　雨山石器杖，　　斫截碎其身，　日夜常悲啼，　　渴令飲銅汁；　為極苦逼切，　　發聲大號吼，　受種種治罰，　　向四方奔竄。",
        "translation": "These are called the eight hells, each with a single gate, and the four gates of each of them are like cities; they're surrounded by iron cities, filled with evildoers, staffed by guards who fork sinners like fish cooking a pot or wok; they rain down mountain rock tools and staves, chop off their bodies, lament day and night, and make them drink copper juice when they're thirsty; they make a loud, resonant roar because of the extreme pain they're enduring, and they're subject to various punishments as they run in all directions.",
        "source": "T17n0728_007:0493b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人癡所覆，　　橫生諸惡見，　招彼地獄因，　　如海深且廣。",
        "translation": "If a person's delusion covers them, they give rise to various bad views that invite the causes of that hell, which is as deep and wide as the ocean.",
        "source": "T17n0728_007:0493b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此下劣惡見，　　損害於自佗，　無量苦因緣，　　汝為自纏縛。",
        "translation": "This poor, bad view damages your own livelihood, and you are bound by measureless causes and conditions of suffering.",
        "source": "T17n0728_007:0493c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由著邪見故，　　恃己生憍慢，　永墮惡道中，　　長時受極苦。",
        "translation": "Because of attachment to wrong views, you rely on yourself to become proud, forever falling into a bad path and suffering terribly for a long time.",
        "source": "T17n0728_007:0493c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由造彼惡業，　　汝今來至此，　下劣愚癡人，　　自作何愁怖？",
        "translation": "Because of that bad action, you've come here now, a poor foolish man, what sorrow did you cause yourself?",
        "source": "T17n0728_007:0493c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作惡希善報，　　則無有是處，　種植於深淵，　　必無其果利。",
        "translation": "When one does evil and hopes for a good reward, there's no place for it, and it's planted in an abyss that will surely bring no benefit.",
        "source": "T17n0728_007:0493c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人縱愚癡，　　數親近和合，　為彼少樂故，　　後受於多苦。",
        "translation": "If a person, even though foolish, often becomes intimate with a union, he'll experience much suffering later because of their few pleasures.",
        "source": "T17n0728_007:0493c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫妄為樂，　　戀著於妻孥，　起染污煩惱，　　皆由愛惑心；　於己命終時，　　無一能捄護，　獨趣險惡道，　　慘然而長逝。",
        "translation": "A foolish man's false desire for happiness, his attachment to a wife and child, and the defiled afflictions that arise are all caused by the mind's craving and delusion; at the end of his life, there's no one who can protect him, and he goes alone to a dangerous and evil path, where he dies a long, miserable death.",
        "source": "T17n0728_007:0493c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又彼地獄中，　　本無諸苦器，　隨造惡有情，　　自心之所變。",
        "translation": "In that hell, there are originally no instruments of suffering, but evil beings are created as they see fit, based on the transformations of their own minds.",
        "source": "T17n0728_007:0493c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如然妙香，　　倏爾飄無狀，　亦如群宿禽，　　夜集曉還散。",
        "translation": "It's like a wonderful fragrance that suddenly blows without shape, or like a flock of sleepy birds that gather at night and scatter at dawn.",
        "source": "T17n0728_007:0493c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或劫取佗財，　　及害彼身命，　造此極不善，　　皆為癡所致。",
        "translation": "Sometimes they steal valuables, harm their bodies and lives, and do this very unskillful thing, all because of delusion.",
        "source": "T17n0728_007:0493c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂由彼癡故，　　從暝入於暝，　失生天正行，　　及最上寂靜。",
        "translation": "It's because of that delusion that they go from darkness to darkness, lose their right behavior in birth in heaven, and attain the highest tranquility.",
        "source": "T17n0728_007:0493c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼妻子眷屬，　　纏縛難出離，　沒生死海中，　　而無所依怙。",
        "translation": "Their wives and retinues are tethered and difficult to escape, and they're submerged in the ocean of birth-and-death with no refuge.",
        "source": "T17n0728_007:0493c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪求造眾惡，　　云為於妻孥，　及自受酸辛，　　彼各知何所？",
        "translation": "They pursue numerous evil pursuits, say, for the sake of their wives and children, and suffer pain and suffering themselves, but what does each know?",
        "source": "T17n0728_007:0493c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於無量生中，　　常貪著美色，　由是造諸過，　　鄙劣而無愧。",
        "translation": "In measureless lifetimes, they've always desired beautiful things, and as a result, they've created faults that are both despicable and unworthy.",
        "source": "T17n0728_007:0493c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先造彼罪惡，　　後不生追悔，　定墮地獄中，　　長劫無出期。",
        "translation": "After committing those sins and evils and not repenting for them later, I'm sure to fall into hell, with no possibility of escape for a long time.",
        "source": "T17n0728_007:0494a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　親屬雖眾多，　　於己何能捄？",
        "translation": "Even though there are many relatives, how can they help themselves?",
        "source": "T17n0728_007:0494a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見餘著欲者，　　受報亦如此。",
        "translation": "\"Those who see other attachments to desire will receive the same reward.",
        "source": "T17n0728_007:0494a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自行於善行，　　必招其樂果，　愚夫癡所蔽，　　於此殊無悟。",
        "translation": "Doing good actions on their own will surely bring about their pleasant results, and foolish people, blinded by delusion, have little understanding here.",
        "source": "T17n0728_007:0494a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若為癡所覆，　　貪恚亦隨生，　所愛為佗有，　　己苦無能免。",
        "translation": "If they're hindered by delusion, then greed and ill-will will follow, and what they love becomes a woeful existence from which they can't escape suffering.",
        "source": "T17n0728_007:0494a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　內為三毒燒，　　外獄火圍繞，　長劫受楚毒，　　何時免惡道？",
        "translation": "Burned by the three poisons on the inside and surrounded by the fires of external hells, they'll suffer pain for a long time, so when will they escape the bad destiny?",
        "source": "T17n0728_007:0494a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自心造諸惡，　　曾不生愧恥，　為獄火燒炙，　　何用徒悲啼？",
        "translation": "He has never been ashamed of the evil he has done in his own mind; why should he lament when he's burned by the fires of hell?",
        "source": "T17n0728_007:0494a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝輩極暗鈍，　　樂行於非法，　不須生悔恨，　　於苦當安忍。",
        "translation": "You people are so dull that you're comfortable practicing what's not the Dharma; you needn't become regretful; you should tolerate suffering in peace.",
        "source": "T17n0728_007:0494a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫造眾罪，　　作已生驚怖，　業果常相隨，　　皆從因緣起。",
        "translation": "Foolish men create numerous sins, become frightened after committing them, and the results of karma are always mutual, all arising from causes and conditions.",
        "source": "T17n0728_007:0494a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於善何曾修，　　於惡不能斷，　若離彼惡者，　　地獄不復見。",
        "translation": "Having never cultivated goodness, he can't stop evil; if he parts with that evil, hell won't be seen again.",
        "source": "T17n0728_007:0494a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人癡所覆，　　不了於業果，　為邪師所悞，　　轉增其過咎。",
        "translation": "If a person's delusion prevents them from understanding the results of actions, they'll be entertained by evil teachers, which will further increase their faults and blame.",
        "source": "T17n0728_007:0494a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由怖先造罪，　　常生於熱惱，　無正法對治，　　終為苦逼切。",
        "translation": "Because of fear of prior sins, they're always tormented by anger and lack the right remedy, and they're ultimately forced to suffer.",
        "source": "T17n0728_007:0494a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能離諸過，　　於苦則無分，　住正念思惟，　　不應作諸罪。",
        "translation": "If they could avoid all faults, they'd have no part in suffering, and they'd abide in right mindfulness and contemplation, so they wouldn't commit sins.",
        "source": "T17n0728_007:0494a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂作眾惡，　　彼於苦無厭，　以苦而加苦，　　何由能出離？",
        "translation": "If someone enjoys doing numerous evils, they'll never tire of suffering; how can they escape from suffering when it's added to suffering?",
        "source": "T17n0728_007:0494a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心不生厭患，　　彼何有寂靜？",
        "translation": "When the mind doesn't become disillusioned, how can there be quiescence there?",
        "source": "T17n0728_007:0494a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於罪眾生，　　故不生悲愍。",
        "translation": "\"For me, there's no compassion for sinful sentient beings.",
        "source": "T17n0728_007:0494a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝為癡所縛，　　造彼非法行，　彼因汝自作，　　匪我而能捄。",
        "translation": "You were bound by delusion and created those unlawful actions, which were caused by your own actions and which no one other than I could protect.",
        "source": "T17n0728_007:0494a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　積集彼癡行，　　罪惡悉盈滿，　不能持淨戒，　　苦報孰能免。",
        "translation": "Accumulating those deluded actions, your sins are all filled to the brim, and if you can't observe pure precepts, who can avoid the painful consequences?",
        "source": "T17n0728_007:0494b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人造惡業，　　隨因則受報，　應知苦因緣，　　自作而自受。",
        "translation": "If you create bad actions, you'll be rewarded according to their causes, and you should know the causes and conditions of suffering, which you yourself create and receive.",
        "source": "T17n0728_007:0494b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝為愛索拘，　　狂亂無慚赧，　受極險治罰，　　彼苦無能說。",
        "translation": "You are bound by craving, confused without conscience, and subject to the most dangerous punishment, which cannot be described as painful.",
        "source": "T17n0728_007:0494b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人造眾惡，　　則受諸楚毒，　不作則不受，　　無因亦無報。",
        "translation": "If you do many evils, you'll be subject to pain and suffering, which you won't experience unless you do them, and which have no cause and no retribution.",
        "source": "T17n0728_007:0494b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是諸過患，　　果在於地獄，　於諸善法中，　　曾不生欣樂；　不修於福業，　　造無量罪惡，　受報亦如然，　　愚夫徒悔惱。",
        "translation": "Such are the faults and distress that result in hell, where happiness never arises from good qualities, and incalculable sins and evils are created without cultivating good actions, which bring retribution in the same way, to the regret of foolish people.",
        "source": "T17n0728_007:0494b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨離諸善人，　　多行於詭詐，　不修真實因，　　求樂不可得。",
        "translation": "He parts with the good, often acts deceitfully, doesn't cultivate true causes, and seeks enjoyment that's unobtainable.",
        "source": "T17n0728_007:0494b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　積集眾罪垢，　　從愚癡心起，　長劫受極苦，　　皆由昔所造。",
        "translation": "He accumulates the stain of many sins, starting with a foolish mind, and experiences extreme suffering for a long time, all created in the past.",
        "source": "T17n0728_007:0494b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　地獄諸有情，　　為獄卒囚執，　苦切而責之，　　業盡汝當出。",
        "translation": "Those sentient beings in hell are held captive by their jailers, and they are severely chastised for their suffering; you will escape when your karma is complete.",
        "source": "T17n0728_007:0494b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又彼愚癡人，　　為自心所誑，　不了所作業，　　煩惋懷悲愴；　以非利為善，　　以良友如冤，　損壞於自他，　　常處大黑暗。",
        "translation": "That foolish man, deceived by his own mind, doesn't understand the task he's doing, and is overcome with sorrow and grief; he considers what's not good for profit to be good, and considers a good friend to be like an enemy, damaging himself and others and always living in great darkness.",
        "source": "T17n0728_007:0494b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼三毒惡行，　　與深冤無異，　能牽諸有情，　　至焰摩羅所。",
        "translation": "Those three poisons and bad actions are no different than deep enemies, and they can pull sentient beings to the place of Yama.",
        "source": "T17n0728_007:0494b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是癡何因生？",
        "translation": "What is the cause of this delusion?",
        "source": "T17n0728_007:0494b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　皆由計我所。",
        "translation": "\"It's all because of imagining what belongs to self.",
        "source": "T17n0728_007:0494b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不修施等行，　　以何而濟度？",
        "translation": "Without cultivating practices like generosity, how can we save?",
        "source": "T17n0728_007:0494b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　罪為第一冤，　　隨惡趣顯現，　於此世他生，　　而不相捨離；　所造作諸惡，　　如利刀毒火，　險惡極可畏，　　作已汝當受。",
        "translation": "\"Sin is the worst offense, manifesting itself in a bad destiny, not separated from others in this world; the evil that's created is like the sharp sword, poison, and fire, and it's extremely dangerous and fearsome; you will experience it after it's done.",
        "source": "T17n0728_007:0494b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人心寂靜，　　不著諸境界，　不隨癡所行，　　則離於惡報。",
        "translation": "If the mind is still, doesn't attach to objects, and doesn't act according to delusion, then you'll be free of the results of evil.",
        "source": "T17n0728_007:0494c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞地獄苦聲，　　愚暗不生怖，　如持彼乾薪，　　投之於烈火。",
        "translation": "They hear the sound of hell's suffering, and ignorance and fear don't arise, like holding dry wood and throwing it into a blazing fire.",
        "source": "T17n0728_007:0494c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又世間火然，　　焰久即能滅，　當知彼業火，　　長時而熾盛；　常火勢可斷，　　業火長相續，　若人造惡行，　　畢竟為所燒。",
        "translation": "While it's true of worldly fires that burn out after a long time, you should know that that karmic fire burns brightly for a long time; its power can be stopped by a permanent fire, but karmic fires continue for a long time, and if people do bad deeds, they'll be burned after all.",
        "source": "T17n0728_007:0494c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故彼業火，　　常燒地獄人，　不怖惡道者，　　無能免斯害。",
        "translation": "Therefore, that karmic fire always burns people in hell, and those who aren't afraid of the evil path aren't spared that harm.",
        "source": "T17n0728_007:0494c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以慧當揀擇，　　於己善防護，　遠離彼惡業，　　則不受諸苦。",
        "translation": "Discriminating with wisdom, he protects himself well, and when he's free of that bad action, he won't suffer.",
        "source": "T17n0728_007:0494c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為癡之所覆，　　常造作眾惡，　今受此極苦，　　悲號徒爾為。",
        "translation": "Being hindered by delusion, he always did many bad deeds, and now he's subject to this extreme suffering, for which he laments in vain.",
        "source": "T17n0728_007:0494c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂初中後分，　　及盡苦邊際，　苦因與苦果，　　皆不可愛樂。",
        "translation": "It's the beginning, middle, and end of suffering, and the limit of suffering, the cause and effect of suffering, which are both unattractive.",
        "source": "T17n0728_007:0494c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔在於人間，　　廣作諸惡業，　招此險惡報，　　汝今當自受。",
        "translation": "In the past, when you were among humans, you did extensive bad actions that brought about this dangerous and bad retribution, which you will now experience yourself.",
        "source": "T17n0728_007:0494c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離顛倒分別，　　因果常相應，　如昔之所作，　　隨業而受報。",
        "translation": "Freed from mistaken discrimination, cause and effect are always concomitant, just as they were in the past, and they are rewarded according to their actions.",
        "source": "T17n0728_007:0494c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝能於自身，　　常生其保重，　云何起殺業，　　伺斷佗壽命？",
        "translation": "Can you always give pride of place to yourself, so why would you undertake the act of killing and seek to end your life?",
        "source": "T17n0728_007:0494c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝求彼財利，　　備受諸艱辛，　云何於佗財，　　興心而劫盜？",
        "translation": "\"You seek their wealth and profit, and you must endure many hardships, so why do you steal it with the intention of saving it?",
        "source": "T17n0728_007:0494c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝於自妻妾，　　專意而防護，　云何於佗色，　　而生於侵暴？",
        "translation": "Do you guard your own wife and concubine with care, and why do you become violent in regard to her?",
        "source": "T17n0728_007:0494c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝作妄語罪，　　欺誑於良善，　為佗不信受，　　彼舌極可畏。",
        "translation": "You commit the sin of lying, deceiving someone who's good, and you deceive someone who doesn't believe in you, so their tongue is extremely frightening.",
        "source": "T17n0728_007:0494c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝樂飲酒罪，　　引生於癡鈍，　招非法誹謗，　　何不生遠離？",
        "translation": "You enjoy the sin of drinking alcohol, which causes delusion and dullness and brings about unlawful slander, so why don't you avoid it?",
        "source": "T17n0728_007:0495a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是五種惡，　　皆汝先所造，　今受此惡報，　　何為徒悲慟？",
        "translation": "These five kinds of evil were all created by you in the past, and now you'll experience this bad retribution, so why is it so sad?",
        "source": "T17n0728_007:0495a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不善法如毒，　　應當常遠離，　能令諸有情，　　長淪於苦海。",
        "translation": "Unwholesome qualities are like poison that should always be avoided, which can cause sentient beings to fall into the ocean of suffering for a long time.",
        "source": "T17n0728_007:0495a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又彼貪欲火，　　於三有熾然，　見善利不修，　　後樂何所得？",
        "translation": "The fire of their desire is blazing in the three realms, and when they see good benefits and don't cultivate them, what pleasure will they obtain later?",
        "source": "T17n0728_007:0495a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說巧笑言辭，　　增長於貪欲，　斯為大過咎，　　當斷無有餘。",
        "translation": "Speaking cleverly and laughingly, and increasing desire for it, is a great misdeed that will be stopped without remainder.",
        "source": "T17n0728_007:0495a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墮彼地獄已，　　發聲大號哭，　獄卒咸謂言：　　如彼因而受。",
        "translation": "After falling into that hell, they make a loud noise and cry, and the jailers all say, \"Thus will they be punished.",
        "source": "T17n0728_007:0495a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不遠離諸惡，　　作已還復造，　彼因即增長，　　受報亦如此。",
        "translation": "Not being far removed from evil, they will again create it after doing it, and that cause will grow, so will the retribution they'll receive.",
        "source": "T17n0728_007:0495a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若畏未來苦，　　當現修眾善，　則無地獄報，　　亦不生悲啼。",
        "translation": "If they fear future suffering, they must cultivate goodness in the present, so they won't experience the retribution of hell and won't lament.",
        "source": "T17n0728_007:0495a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　放逸如彼地，　　出生諸不善，　無量諸有情，　　皆為貪所牽。",
        "translation": "Their carelessness is like that ground, producing unwholesomeness and measureless sentient beings, all tethered by greed.",
        "source": "T17n0728_007:0495a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝昔造眾罪，　　起貪等惡行，　愚夫不了知，　　當苦何人代！",
        "translation": "You created so many sins in the past, producing such bad actions as craving, that foolish people didn't understand them, and who will take their place in suffering?",
        "source": "T17n0728_007:0495a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不生慈愍心，　　隨諸惡流轉，　無邊苦海中，　　憑何而濟度？",
        "translation": "Without compassion, they are subject to the cycle of evil, and in the limitless ocean of suffering, how can they be saved?",
        "source": "T17n0728_007:0495a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　資財及所愛，　　命盡悉遺棄，　由造此眾罪，　　為獄卒所追。",
        "translation": "Their possessions and desires are all discarded when their lives are up, and because of these many sins, they're pursued by the jailer.",
        "source": "T17n0728_007:0495a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　極猛惡火聚，　　充遍於虛空，　乃至地方所，　　熾焰而無間。",
        "translation": "A fierce cluster of bad fires fills space, even down to the local level, blazing and without interruption.",
        "source": "T17n0728_007:0495a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苦切不可觀，　　惶怖何所至？",
        "translation": "Their suffering is unsurpassed, so what is the cause of their fear?",
        "source": "T17n0728_007:0495a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鋒刃為其道，　　驅逐令履踐。",
        "translation": "The sharp edge of the sword is their path, driving them away and making them tread.",
        "source": "T17n0728_007:0495a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　險難廣如海，　　獨逝而無伴，　何時得解脫，　　於我誰能捄？",
        "translation": "The perils and difficulties are as vast as an ocean, and I die alone without companionship.",
        "source": "T17n0728_007:0495b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我為苦逼切，　　疲乏不能往，　為彼所執縛，　　牽挽而將去；　妻孥朋屬等，　　到此皆如冤，　縱無量珍財，　　求囑無能脫。",
        "translation": "\"I'm so stifled by suffering that I'm weary and can't go there, so I'm bound by their grasp and pulled along; my wife, children, friends, and others all arrive here like enemies, and even though I have measureless treasures, I can't get rid of them when I ask for advice.",
        "source": "T17n0728_007:0495b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由昔放逸故，　　樂壞翻為苦，　為死羂所牽，　　冥莫何歸趣？",
        "translation": "Because of past carelessness, their pleasures were destroyed and turned into suffering, and they were dragged by the noose of death; where do they go from here?",
        "source": "T17n0728_007:0495b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼琰摩獄卒，　　極暴惡忿怒，　執縛加凌辱，　　心生大惶怖。",
        "translation": "That Diemite jailer is extremely violent and angry, binding and abusing him, and causing great fear in his mind.",
        "source": "T17n0728_007:0495b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我觀彼惡處，　　種種苦治罰，　一切情非情，　　皆騰於猛焰。",
        "translation": "I've observed that evil place, with all its painful punishments, and all sentient and insentient beings are inflamed with fierce flames.",
        "source": "T17n0728_007:0495b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有大毒蟒，　　周匝悉圍繞，　悲號求出離，　　無歸亦無捄。",
        "translation": "There's another great poisonous python that surrounds them all, crying out in pity for release, but there's no refuge or rescue.",
        "source": "T17n0728_007:0495b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墮黑暗獄中，　　深廣猶大海，　虛空宿曜光，　　長劫何由覩？",
        "translation": "He falls into a dark hell, as deep and wide as an ocean, with a ray of light from a constellation in space, but how could he see it for a long time?",
        "source": "T17n0728_007:0495b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂由彼五根，　　顛倒生貪著，　流轉三有中，　　何由能寂靜？",
        "translation": "That is, because of those five faculties, which are mistaken and give rise to craving and attachment, how can there be quiescence in the three transmigration [of existences]?",
        "source": "T17n0728_007:0495b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切身肢分，　　為利鋸分解，　無量極苦惱，　　言莫能盡宣。",
        "translation": "\"All the body's limbs are dismembered by the sharp saw, and there are measureless and extremely painful things that no words can explain.",
        "source": "T17n0728_007:0495b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　積集罪如山，　　眾苦常圍繞，　念念常增長，　　心作身自受。",
        "translation": "Accumulating sins like mountains, they're constantly surrounded by suffering, and their mind always grows in recollection as it creates its own body to suffer.",
        "source": "T17n0728_007:0495b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受極苦迫窄，　　辛酸唯自知，　琰摩勅彼言：　　汝觀昔所作。",
        "translation": "Being subjected to extreme suffering and constrained by pain, he only knows it himself, and Diemma commands him, \"Look at what you did in the past.",
        "source": "T17n0728_007:0495b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若了知自罪，　　於苦能堪忍，　乃至業未盡，　　一一當思惟。",
        "translation": "If you fully understand your own faults, you'll be able to tolerate suffering even when your actions have yet to end, and you'll consider each one.",
        "source": "T17n0728_007:0495b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔由癡所覆，　　今徒生悔惱，　汝作如是因，　　自受如是果。",
        "translation": "'In the past, you were hindered by delusion, and now you've ended up with regret and anguish; you did this as a cause and will bring this as a result yourself.'",
        "source": "T17n0728_007:0495b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由惡作所起，　　造增上重罪，　墮難中險難，　　受苦中極苦。",
        "translation": "As a result of bad actions, you created a greater misdeed, falling into the most difficult of difficulties and experiencing the most painful of pains.",
        "source": "T17n0728_007:0495b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫造罪已，　　如以薪投火，　從劫而至劫，　　業盡或當出。",
        "translation": "After committing a sin, a foolish man is like throwing firewood into the fire, going from eon to eon, or maybe he'll escape when his karma is finished.",
        "source": "T17n0728_007:0495c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非諸天脩羅，　　夜叉鬼神等，　我為死羂拘，　　彼皆不能捄。",
        "translation": "I'm not bound by the noose of death by gods, sūras, nightjars, ghosts, or other spirits, but none of them can save me.",
        "source": "T17n0728_007:0495c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為彼索所縛，　　牽至琰摩所，　惶怖無依歸，　　隨業之所趣。",
        "translation": "I'm bound by their noose, led to Diem's place, terrified, with no refuge, following the course of my karma.",
        "source": "T17n0728_007:0495c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若離欲過患，　　三界中最勝，　解脫一切縛，　　則不造諸罪。",
        "translation": "If I were free of the faults and distress of desire, the most superior of the three realms, I'd be freed from all bonds and wouldn't commit any sins.",
        "source": "T17n0728_007:0495c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若和合因緣，　　先從父所得，　彼如是劬勞，　　汝何行殺害？",
        "translation": "If the cause and condition for their union was first obtained from their father, and they thus labored, why would you do harm?",
        "source": "T17n0728_007:0495c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復害母罪，　　惡業無過此，　墮於地獄中，　　受增上極苦。",
        "translation": "\"Also, for the sin of harming his mother, his bad deeds are unsurpassed, and he's sentenced to fall into hell and experience intensified suffering.",
        "source": "T17n0728_007:0495c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斷三有結縛，　　是名阿羅漢，　愚癡行殺害，　　今受此苦報。",
        "translation": "To sever the bonds of the three existences is to be called an arhat, and foolishly to commit murder is now the result of that suffering.",
        "source": "T17n0728_007:0495c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸法藏，　　顯示解脫門，　汝破和合僧，　　今受此苦報。",
        "translation": "All the stores of the Dharma reveal the gate of liberation, and you destroyed the harmony of the saṃgha, which now brings the results of that suffering.",
        "source": "T17n0728_007:0495c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常發虛妄言，　　指東而談北，　所說無誠信，　　今受此苦報。",
        "translation": "You always speak falsely, pointing east and speaking north, and speaking without sincerity, and now you'll receive the results of that suffering.",
        "source": "T17n0728_007:0495c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復生綺語，　　損壞真實寶，　無益於自佗，　　今受此苦報。",
        "translation": "You also give rise to fancy speech that damages real treasures and doesn't help your own success, and now you'll receive the results of that suffering.",
        "source": "T17n0728_007:0495c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　起兩舌惡業，　　互相而讒謗，　離散彼親朋，　　今受此苦報。",
        "translation": "He produces the bad karma of duplicity, slanders one another, and scatters his friends and family, which brings this painful result.",
        "source": "T17n0728_007:0495c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說無義惡語，　　如刀杖毒火，　令佗生熱惱，　　今受此苦報。",
        "translation": "Speaking meaningless evil words, like the poisonous fire of a sword and stick, causes Tiao to become enraged, and now I'll receive the results of that suffering.",
        "source": "T17n0728_007:0495c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　護惜己身命，　　損害諸有情，　常無慈愍心，　　今受此苦報。",
        "translation": "He protects his own life and harms sentient beings, always lacking compassion, and now he suffers the results of that suffering.",
        "source": "T17n0728_007:0495c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佗所有珍財，　　偷取或劫奪，　恣為五欲因，　　今受此苦報。",
        "translation": "I stole or plundered their valuables, freely acting as a cause of the five desires, and now I'll receive the painful consequences of that.",
        "source": "T17n0728_007:0495c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂作欲邪行，　　如火益其薪，　常生疑怖心，　　增長諸不善；　樂著於邪見，　　損壞佗善根，　受惡報無窮，　　受第一苦惱。",
        "translation": "They enjoy indulging in lustful, mistaken behavior, which is like fire fuel, generates doubt and fear, and proliferates unwholesomeness; they are attracted to wrong views, which damage their good roots, bring bad consequences that know no limit, and are the most painful to bear.",
        "source": "T17n0728_007:0496a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此諸惡境界，　　汝愚癡隨轉，　皆由身語心，　　相應而造作。",
        "translation": "These bad states, which you foolishly follow, are all created by the actions of body, speech, and mind in response.",
        "source": "T17n0728_007:0496a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　造彼眾惡已，　　將終苦現前，　為獄卒所驅，　　速趣於地獄。",
        "translation": "After doing those many evils, you'll end up suffering, be driven by the jailer, and quickly go to hell.",
        "source": "T17n0728_007:0496a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是地獄苦惱，　　極難堪忍受，　假使海深廣，　　燒然亦枯涸。",
        "translation": "The suffering and torment of this hell are so difficult to endure that even if the ocean were deep and wide, it would burn up and dry up.",
        "source": "T17n0728_007:0496a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人了諸惡，　　因果非可樂，　常當正思惟，　　於罪不應作。",
        "translation": "If people understand evil, the causes and effects are not pleasant, and they should always correctly consider that they shouldn't commit sins.",
        "source": "T17n0728_007:0496a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謂佛法僧寶，　　眾德皆圓滿，　得生於人中，　　何不能親近？",
        "translation": "Suppose the treasures of buddhas, dharmas, and saṃgha, which are all perfect in their virtues, were to be born among humans, why wouldn't they be able to get close to them?",
        "source": "T17n0728_007:0496a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初作微細罪，　　如小火所燒，　後廣造惡因，　　如投身火聚。",
        "translation": "The first one commits a tiny sin like being burned by a small fire, and then he creates a wide range of bad causes like plunging into a cluster of fires.",
        "source": "T17n0728_007:0496a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於罪徒憂怖，　　意不斷諸惡，　常思受苦報，　　今汝復何造？",
        "translation": "Being sad and frightened by these sins, your mind doesn't stop at evil, and you always think about the painful consequences, so what else have you done now?",
        "source": "T17n0728_007:0496a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當知彼少罪，　　則能生眾苦，　業盡當出離，　　餘無有能捄。",
        "translation": "You should know that this person's few sins are capable of producing many kinds of suffering, and that when their karma is complete, they'll escape; there's nothing left to save them.",
        "source": "T17n0728_007:0496a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼琰摩使者，　　檢察隨釋放，　若惡報未盡，　　還牽受眾苦。",
        "translation": "The messenger Diem examines and releases him, but if the results of evil haven't ended, he'll still be subject to many sufferings.",
        "source": "T17n0728_007:0496a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於身肢方面，　　分裂而斫截，　無數罪有情，　　生悲愁號叫。",
        "translation": "His body is torn limb by limb and chopped off, and countless sentient beings who commit crimes lament and cry out in pity.",
        "source": "T17n0728_007:0496a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有惡有情，　　多作離間語，　猶如一種子，　　後增長無數。",
        "translation": "\"Furthermore, there are evil beings who often speak divorced words, just like a son of one kind, and whose subsequent growth is countless.",
        "source": "T17n0728_007:0496a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆由彼惡慧，　　而生於鬪亂，　於親屬朋友，　　悉為作破壞。",
        "translation": "It's all because of their bad wisdom that they get into fights and tumults, and they all do harm to their friends and relatives.",
        "source": "T17n0728_007:0496a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常遠諸善言，　　樂發於惡語，　當割截其舌，　　因果還相似。",
        "translation": "They always distance themselves from good words and delight in speaking ill, so they cut off their tongues and the result is similar.",
        "source": "T17n0728_007:0496a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　百千功德門，　　由舌而破壞，　今受此苦報，　　何時獲出離？",
        "translation": "A hundred thousand meritorious qualities are destroyed by the tongue, and now that I've suffered this painful retribution, when will I be freed?",
        "source": "T17n0728_007:0496b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墮彼地獄中，　　極熱生飢渴，　譬如以芥子，　　擲須彌火聚。",
        "translation": "Falling into that hell, extreme heat produces hunger and thirst, like tossing a mustard seed into a cluster of Sumeru fires.",
        "source": "T17n0728_007:0496b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又彼地獄火，　　復從飢渴生，　及墮落諸天，　　受報亦如此。",
        "translation": "That hellfire also produces hunger and thirst, and so do the rewards of falling into the heavens.",
        "source": "T17n0728_007:0496b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所造眾惡業，　　皆由三毒起，　展轉猛焰間，　　無藏竄逃避。",
        "translation": "The many bad actions they create all arise from the three poisons, which proliferate into a fierce flame with no refuge to escape.",
        "source": "T17n0728_007:0496b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無智諸有情，　　妄起於分別，　不善說為善，　　於良友如冤。",
        "translation": "Sentient beings without cognition falsely give rise to discrimination, describing what's unskillful as good and regarding good friends as enemies.",
        "source": "T17n0728_007:0496b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何諸眾生，　　不悟真實法？",
        "translation": "How do all sentient beings not understand the true teaching?",
        "source": "T17n0728_007:0496b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設為彼開示，　　心不生愛樂。",
        "translation": "\"Suppose someone were to reveal something to you, and your mind doesn't take delight in it.",
        "source": "T17n0728_007:0496b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不樂聞正法，　　輕毀說法師，　於濁惡世中，　　何由生慧眼？",
        "translation": "Not delighting in hearing the right teaching, they disparage the Dharma preacher. How can the eye of wisdom arise in a turbid, bad world?",
        "source": "T17n0728_007:0496b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫之境界，　　愛欲長迷惑，　不依正法律，　　無因能自悟；　為癡索所牽，　　常樂作諸惡，　作已受極苦，　　徒生於憂悔。",
        "translation": "In the realm of foolish men, their craving and desire grow deluded, and they don't rely on the right principles, having no cause for self-realization; led by the cords of delusion, they are always delighted to do evil, and after doing so they experience suffering in the extreme, giving rise to grief and regret.",
        "source": "T17n0728_007:0496b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由增上愚癡，　　於法說非法，　彼因既顛倒，　　則錯行亂學；　無明慧揀擇，　　耽嗜於五欲，　於善不修習，　　見惡則隨作。",
        "translation": "Because of their increased delusion, they teach what's not the Dharma, and since their cause is mistaken, they engage in erroneous behavior and disorderly training; lacking insight and wisdom to discriminate, they indulge in the five desires, don't cultivate goodness, and then do evil when they see it.",
        "source": "T17n0728_007:0496b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天心著樂，　　投放逸火中，　不遇勝善緣，　　彼即隨退墮。",
        "translation": "Devoid of insight and discrimination, they indulge in the five desires, don't cultivate goodness, and then do evil when they see it.",
        "source": "T17n0728_007:0496b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又彼愚癡人，　　憎嫉諸賢善，　矯現諸威儀，　　誑佗而求利。",
        "translation": "That foolish man hates and resents good people, manipulates their manner, and deceives others into seeking profit.",
        "source": "T17n0728_007:0496b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　口雖說正法，　　心常伺他咎，　是人於世間，　　為第一惡者。",
        "translation": "Even though he speaks the right teaching, his mind always looks for blame from others, and this person is the worst offender in the world.",
        "source": "T17n0728_007:0496b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人著欲樂，　　則是求苦惱，　為自心所誑，　　樂壞非他受。",
        "translation": "If someone is attached to desires and pleasures, they're seeking suffering and distress, and they are deceived by their own mind, which destroys their pleasures and doesn't allow others to experience them.",
        "source": "T17n0728_007:0496c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故以正慧，　　常修十善行，　於諸非義利，　　畢竟永除斷。",
        "translation": "Therefore, with right wisdom, he always cultivates the ten good actions, and these are not purposeful benefits that are ultimately and permanently eliminated.",
        "source": "T17n0728_007:0496c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂利益於佗，　　繫心無暫捨，　常依淨善法，　　應當如是住。",
        "translation": "Delighting in the benefits of wisdom, he binds his mind without momentarily abandoning it, always relying on pure good qualities, and should thus abide.",
        "source": "T17n0728_007:0496c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼品第十六",
        "translation": "The Sixteenth Chapter of the Hungry Ghosts",
        "source": "T17n0728_007:0496c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人不行施，　　如無燈求光，　捨離於善業，　　何能有樂報？",
        "translation": "If someone doesn't practice generosity, it's like seeking light without a lamp, and they abandon good actions, how can they have pleasant rewards?",
        "source": "T17n0728_007:0496c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如世間盲者，　　於物無所覩，　離施無福因，　　當墮餓鬼趣。",
        "translation": "Like a blind person in the world who doesn't see things and parts with the cause of merit, he'll fall into the destiny of hungry ghosts.",
        "source": "T17n0728_007:0496c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墮無財鬼中，　　周遍而求覓，　常困於飢渴，　　皆由慳所感。",
        "translation": "They'll fall into the category of propertyless ghosts, searching everywhere for it, always hungry and thirsty, all caused by stinginess.",
        "source": "T17n0728_007:0496c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂修施者，　　一切無能壞，　不作於少因，　　後乃徒生悔。",
        "translation": "If someone enjoys cultivating generosity, nothing can be destroyed, and if they don't do it for few causes, regret will result in vain.",
        "source": "T17n0728_007:0496c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由先造惡業，　　墮餓鬼趣中，　為獄火燒炙，　　長受飢渴苦；　何時離彼趣，　　暫得於快樂？",
        "translation": "Because of the bad actions they created in the past, they'll fall into the rebirth of hungry ghosts, be burned by the fires of hell, and experience hunger and thirst for a long time; when will they leave that rebirth and attain happiness for a while?",
        "source": "T17n0728_007:0496c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何劫得解脫，　　則捨諸熱惱？",
        "translation": "\"Which eon does one attain liberation and then abandon the burning afflictions?",
        "source": "T17n0728_007:0496c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由不了因果，　　及彼道非道，　為飢火所逼，　　相續苦不斷。",
        "translation": "Because they don't understand the law of cause and effect and that the path is not the path, they're forced by the fire of hunger and suffer continuously.",
        "source": "T17n0728_007:0496c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　醜狀髮髼亂，　　唯筋皮相連，　希求諸飲食，　　暫覩無由得。",
        "translation": "His hair is tangled in an ugly way, and his skin is connected only by sinews, so he seeks food and drink, but he sees nothing that can be obtained for a while.",
        "source": "T17n0728_007:0496c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為眾苦逼迫，　　墮諸惡險難，　曾無有親朋，　　於我暫能捄。",
        "translation": "Being forced by many hardships and suffering, I've fallen into terrible danger and difficulty, and I've had no friends or relatives who could help me for a while.",
        "source": "T17n0728_007:0496c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝昔於人中，　　斷作諸福行，　如至於寶洲，　　空手而獨返。",
        "translation": "In the past, you stopped doing all the good deeds among people, just as you went to a jeweled island and returned home alone with empty hands.",
        "source": "T17n0728_007:0496c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂修勝行，　　常遠彼諸惡，　我觀彼善人，　　躡生天階漸。",
        "translation": "If you enjoyed cultivating excellent practices and always kept far away from evil, I observed that a good person stepped into the gradual stages of birth in heaven.",
        "source": "T17n0728_007:0496c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由彼身語意，　　造作諸不善，　眷屬皆他往，　　獨依苦而住。",
        "translation": "Because of the unwholesome deeds they do in body, speech, and thought, their followers all go away, and they live alone in misery.",
        "source": "T17n0728_007:0497a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為琰摩使者，　　捉縛而驅逐，　入深邃黑暗，　　去處極懸遠。",
        "translation": "They're bound and driven away by Diem's messengers, entering deep darkness and going to places that are extremely remote.",
        "source": "T17n0728_007:0497a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於一切處，　　常受諸苦惱，　乃至須臾頃，　　曾無微少樂。",
        "translation": "I've always experienced suffering and distress in all places, even for a short while, and there was never a tiny bit of happiness.",
        "source": "T17n0728_007:0497a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今受此果報，　　皆由先所作，　何時免斯苦，　　得至於樂處？",
        "translation": "Now, I've experienced this result because of what I did before. When will I be spared this pain and be able to reach a happy place?",
        "source": "T17n0728_007:0497a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為渴所逼故，　　徒陟彼高原，　設見於河池，　　到則皆枯涸。",
        "translation": "Forced by thirst, they ascend to that plateau in vain, and if they see a river or lake, it dries up when they reach it.",
        "source": "T17n0728_007:0497a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於曠野山林，　　周遍而尋覓，　受渴乏艱辛，　　求水不可得。",
        "translation": "They search everywhere in the wild mountains and forests, suffering from thirst and trouble, and seeking water that's unobtainable.",
        "source": "T17n0728_007:0497a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至濕潤處，　　彼亦不能見，　復有大烏鳶，　　利嘴而啄食。",
        "translation": "Even moist places are invisible to them, and there's a large crow kite with a sharp beak that pecks at their food.",
        "source": "T17n0728_007:0497a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為彼飢渴火，　　常逼切其身，　宛轉險道中，　　叫呼求捄護。",
        "translation": "That fire of hunger and thirst always cuts into his body, and he wanders through dangerous paths, calling out for protection.",
        "source": "T17n0728_007:0497a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔近欲境界，　　彼如鏡中像，　虛壞己珍財，　　今獨受此報。",
        "translation": "In the past, when I was near the realm of desire, I was like an image in a mirror; I wasted my valuables and now I'll receive this reward alone.",
        "source": "T17n0728_007:0497a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由造彼業故，　　籠罩難出離，　於四向奔走，　　業盡當解脫。",
        "translation": "Because of the actions I've created, I'm trapped and unable to escape, so I run in four directions and will be liberated when my actions are complete.",
        "source": "T17n0728_007:0497a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從三毒所生，　　極惡猛火聚，　念念常熾然，　　則能燒巨石。",
        "translation": "From the three poisons that arise, a fierce, extremely powerful fire gathers, and when it's constant and blazing, it can burn a huge rock.",
        "source": "T17n0728_007:0497a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又火焚彼石，　　水沃即能止，　我業火如海，　　深廣何能滅？",
        "translation": "Another fire that consumes that rock can be stopped by flooding it with water, but the fire of my karma is like an ocean; how could it be extinguished?",
        "source": "T17n0728_007:0497a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惡業如其薪，　　愛風同發起，　燒彼罪有情，　　周匝無能避。",
        "translation": "Like firewood, bad actions are sparked by the same wind of desire, which sets fire to those sinful beings and surrounds them with nothing to avoid.",
        "source": "T17n0728_007:0497a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我造諸罪咎，　　遠離於善法，　墮彼鬼世間，　　為自心所誑。",
        "translation": "I've created all kinds of misdeeds, strayed far from good qualities, and fallen into the world of ghosts, which my own mind has deceived.",
        "source": "T17n0728_007:0497a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我為彼飢渴，　　二火鎮燒然，　及刀杖傷殘，　　受三種極苦。",
        "translation": "I caused them hunger and thirst, was burned by two fires, and was handicapped by a sword and bludgeon, which caused me three kinds of extreme suffering.",
        "source": "T17n0728_007:0497a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我造諸惡業，　　墮餓鬼趣中，　非眷屬親朋，　　能為作捄濟。",
        "translation": "I created all these bad deeds and fell into the rebirth of hungry ghosts, and no one close to me or my family could rescue me.",
        "source": "T17n0728_007:0497b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯有彼善法，　　與我作依怙，　謂施戒多聞，　　三種為歸捄。",
        "translation": "Only that good Dharma will serve as my refuge, which is generosity, morality, and learning, and the three kinds of refuge.",
        "source": "T17n0728_007:0497b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至我造作，　　諸極惡苦因，　墮愚癡網中，　　長淪於苦海。",
        "translation": "Even if I create the causes of extreme evil suffering, I'll fall into the web of folly and remain submerged in the ocean of suffering.",
        "source": "T17n0728_007:0497b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受極重熱惱，　　實難堪難忍，　我若得出離，　　少罪不復造。",
        "translation": "Being subjected to extremely intense suffering, which is truly unbearable and difficult to endure, if I were to escape, I'd create no more minor sins.",
        "source": "T17n0728_007:0497b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼餓鬼趣中，　　常生大愁怖，　於此不善因，　　是故當遠離。",
        "translation": "In the destinies of those hungry ghosts, great sorrow and fear always arises, and because it's an unwholesome cause, I must avoid it.",
        "source": "T17n0728_007:0497b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畜生品第十八",
        "translation": "The Eighteenth Chapter of the Animal Life Sutra",
        "source": "T17n0728_007:0497b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼畜生苦報，　　為牽縛捶打，　不斷殺因緣，　　則更生食噉。",
        "translation": "\"That animal's painful reward is to be bound and beaten, and if you don't stop the causes and conditions for killing, then you'll be fed and gnawed on.",
        "source": "T17n0728_007:0497b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫愛惑心，　　樂行於損害，　不修施戒因，　　後受畜生報。",
        "translation": "A foolish man's mind is deluded by craving, and he's attracted to harming and not cultivating the causes of generosity and discipline, which brings the subsequent results of being born in an animal.",
        "source": "T17n0728_007:0497b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為愛索所縛，　　五根如癡瘂，　懷忿恨憎嫉，　　後受畜生報；　應作不應作，　　可食不可食，　於善不善法，　　皆不能了知。",
        "translation": "Bound by the cords of desire, their five faculties are dull, and they become hateful and resentful, which brings the results of being born in an animal; they do what should be done and don't do it, don't eat what's edible, and don't understand good and unskillful qualities.",
        "source": "T17n0728_007:0497b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人趣多追求，　　諸天著放逸，　餓鬼受飢渴，　　地獄唯極苦。",
        "translation": "Human rebirths are often pursued, gods are addicted to dissipation, hungry ghosts suffer hunger and thirst, and hell is only extremely painful.",
        "source": "T17n0728_007:0497b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人於有情，　　樂行於殺戮，　招種種危苦，　　當互相殘害。",
        "translation": "If humans in sentient beings enjoy killing, it brings various kinds of danger and suffering, and they will harm each other.",
        "source": "T17n0728_007:0497b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復諸眾生，　　多慳復散亂，　以是因緣故，　　當墮鬼畜趣。",
        "translation": "Also, because of these causes and conditions, sentient beings who are stingy and disorganized will fall into the rebirths of ghosts and animals.",
        "source": "T17n0728_007:0497b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼三毒過患，　　沒溺諸有情，　受生死輪迴，　　深險難出離。",
        "translation": "Those three poisons and their faults, which submerge sentient beings, bring about the cycle of birth-and-death, which is too deep and difficult to escape from.",
        "source": "T17n0728_007:0497b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若樂求正法，　　則生諸善果，　具足彼明慧，　　為人所恭敬。",
        "translation": "If someone enjoys seeking the right teaching, they'll produce good results, perfect their insight, and be respected by others.",
        "source": "T17n0728_007:0497b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故具智者，　　樂修清淨業，　如理而作意，　　躋解脫正道。",
        "translation": "Therefore, those who have knowledge enjoy cultivating pure activities and correctly contemplate them, and they include the right path to liberation.",
        "source": "T17n0728_007:0497c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飢乏業報品第十九",
        "translation": "The Nineteenth Chapter of the Retribution of Hunger and Despair",
        "source": "T17n0728_007:0497c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂作不饒益，　　驅役諸眾生，　招下劣苦因，　　無與飢相似。",
        "translation": "Delighting in doing no good, they drive sentient beings into bondage, bringing about a poor and painful cause that's not unlike hunger.",
        "source": "T17n0728_007:0497c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　叫呼求飲食，　　從自身起火，　燒彼罪眾生，　　如然於槁木。",
        "translation": "Calling out for food and drink, it starts a fire from itself that burns those sentient beings as if they were dry wood.",
        "source": "T17n0728_007:0497c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是火遍方處，　　所至即隨逐，　設經百劫中，　　匪食無能濟。",
        "translation": "This fire goes everywhere, following them wherever it reaches, and even if it goes on for a hundred eons, there's nothing to eat that can't be saved.",
        "source": "T17n0728_007:0497c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世火雖炎熱，　　飢火復過是，　奔馳三有中，　　於食求無得。",
        "translation": "Although the fires of the world are hot, the fires of hunger are even worse, and they scurry through the three realms, seeking food that's unobtainable.",
        "source": "T17n0728_007:0497c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又世間有情，　　常生種種過，　為飲食因緣，　　沈淪三有海。",
        "translation": "Also, worldly beings are constantly producing various faults, and for the sake of food and drink, they're submerged in the ocean of the three existences.",
        "source": "T17n0728_007:0497c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　住彼三有中，　　隨業而牽去，　長時受楚毒，　　此苦說無盡。",
        "translation": "Abiding in those three existences, they are pulled away by karma and subjected to pain and suffering for a long time, which is said to be inexhaustible.",
        "source": "T17n0728_007:0497c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　處於胎藏中，　　為糞穢所溺，　受逼迫熱惱，　　此苦說無盡。",
        "translation": "Being in the womb, submerged in filth, and subject to oppressive heat, this suffering is said to be inexhaustible.",
        "source": "T17n0728_007:0497c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　耽著於欲境，　　樂殊妙嚴飾，　貪求受艱辛，　　此苦說無盡。",
        "translation": "They become addicted to objects of desire, enjoy marvelous adornment, and experience hardship in their desire, which is described as inexhaustible.",
        "source": "T17n0728_007:0497c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常詣他舍宅，　　求丐於衣食，　為彼所輕賤，　　此苦說無盡。",
        "translation": "He often visits other people's homes, seeking begging for food and clothing, and is despised by them, which is described as inexhaustible suffering.",
        "source": "T17n0728_007:0497c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由愛毒所使，　　勞己而求覓，　乃至身未終，　　此苦說無盡。",
        "translation": "Being forced by the poison of desire, they toil themselves in search of food, even before their bodies end, and this suffering is said to be inexhaustible.",
        "source": "T17n0728_007:0497c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自貪其欲境，　　眾冤伺其便，　心常生惶怖，　　此苦說無盡。",
        "translation": "They themselves crave objects of desire, and many enemies look for their convenience, always terrified, and this suffering is said to be inexhaustible.",
        "source": "T17n0728_007:0497c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由為彼妻孥，　　多生於憂慼，　斯為第一冤，　　此苦說無盡。",
        "translation": "Because of their wives and children, much grief arises, which is the greatest grievance, and this suffering is said to be inexhaustible.",
        "source": "T17n0728_007:0497c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　枉費諸珍財，　　為親朋訶毀，　由斯起愁惱，　　此苦說無盡。",
        "translation": "Wasting precious treasures and being disparaged by friends and relatives gives rise to grief and distress, and this suffering is said to be inexhaustible.",
        "source": "T17n0728_007:0497c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　變異身衰老，　　策杖而徐行，　色力頓疲羸，　　此苦說無盡。",
        "translation": "He changes his body and grows old, walks slowly with a staff, and his physical strength suddenly weakens, which is explained as inexhaustible suffering.",
        "source": "T17n0728_007:0498a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生平所愛寵，　　臨終皆棄捨，　獨往無所依，　　此苦說無盡。",
        "translation": "He discards all the things he loved in life and discards them at the end of his life, going alone with no support, and this suffering is explained ad infinitum.",
        "source": "T17n0728_007:0498a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫造諸罪，　　墮於惡趣中，　皆由飲食因，　　智者之所誡；　了知是業報，　　心當生怖畏，　樂修於施戒，　　以眾善莊嚴。",
        "translation": "Foolish men commit sins and fall into a bad destiny, which are all caused by eating and drinking and are admonished by wise men; knowing the results of such actions, they must become frightened at heart and delight in cultivating generosity and morality, adorned by goodness.",
        "source": "T17n0728_007:0498a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法集要經卷第七",
        "translation": "Collected Essentials of the Dharma Sutra, Volume 7",
        "source": "T17n0728_007:0498a10_0",
        "is_bad_quality": false
    }
]