[
    {
        "source_sentence": "佛說大乘不思議神通境界經卷",
        "translation": "Foshuo dasheng busshiyi shentong jiejie jing roll",
        "source": "T17n0843_001:0922b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上",
        "translation": "above",
        "source": "T17n0843_001:0922b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Minister of Light for the Tripiṭaka Translation of the Sutra of the Western Paradise, the Grand Master of the Chaofeng",
        "source": "T17n0843_001:0922b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳法大師賜紫臣施護奉　詔譯",
        "translation": "Master Chuanfa Zhichen Shihuofeng 詔譯",
        "source": "T17n0843_001:0922b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時世尊住法界光明菩薩宮，與大苾芻眾五十萬人俱，皆阿羅漢，諸漏已盡無餘煩惱，安住寂靜，心善解脫、慧善解脫，如大龍王所作已辦，捨諸重擔得大善利，諸有結縛皆悉已盡，正智無礙，諸心善寂神通具足。",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at the bodhisattva's palace of light in the Dharma realm with a large congregation of 500,000 people, all arhats, whose contaminants had ended and who had no remaining afflictions, abiding in tranquility, whose minds were well liberated and whose wisdom was well liberated, like a great dragon king who has accomplished his task, who has freed himself from heavy burdens and attained great good benefits, whose bonds have all been ended, whose right knowledge is unimpeded, and whose minds are fully endowed with the transcendent abilities of good tranquility.",
        "source": "T17n0843_001:0922b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有菩薩摩訶薩眾，皆得不退轉地、一生補處，當得成就阿耨多羅三藐三菩提者，而悉安住無邊如來神通變化，菩提加持無著妙行。",
        "translation": "Furthermore, there are all bodhisattvas, mahāsattvas, and sentient beings who have attained the stage of nonretrogression and the remedial position in their lifetime and will achieve unsurpassed, perfect enlightenment, and all abide in the limitless transformations of the Tathāgata's supernormal powers and the unsurpassed marvelous practice of the empowerment of bodhisattvas.",
        "source": "T17n0843_001:0922b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生廣大愛樂，住正念慧入普遍智，具平等行，成就無量眾功德聚，現證如來平等法門，轉妙法輪，能善教授無邊學眾，已獲一切白法功德。",
        "translation": "He has a vast love for all sentient beings, abides in right mindfulness and wisdom, enters into universal knowledge, possesses the practice of equality, has accomplished measureless clusters of merit, now realizes the Tathāgata's equal teaching, turns the wonderful Dharma wheel, can skillfully teach measureless multitudes of students, and has attained the merit of all the white dharmas.",
        "source": "T17n0843_001:0922b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知一切眾生心意，了別眾生諸根利鈍，已到彼岸最上自在，成就圓滿一切善法，諸佛事業皆悉成辦，從他方界來集此會。",
        "translation": "He well knows the thoughts of all sentient beings, discerns the sharpness and dullness of their faculties, has reached the other shore with supreme mastery, has accomplished the consummation of all good qualities, and has accomplished all of the Buddha's works, and has come from other realms to assemble here.",
        "source": "T17n0843_001:0922b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰：普賢菩薩摩訶薩、普幢菩薩摩訶薩、普步菩薩摩訶薩、普信菩薩摩訶薩、普眼菩薩摩訶薩、普寤菩薩摩訶薩、普光菩薩摩訶薩、普香菩薩摩訶薩、普意音菩薩摩訶薩、普照菩薩摩訶薩、普念菩薩摩訶薩、普智幢菩薩摩訶薩、普緣觀菩薩摩訶薩、法界普光菩薩摩訶薩，如是等萬二千人俱。",
        "translation": "Their names are: Samantabhadra, Samantabhadra, Samantabhadra, Samantabhadra, Samantabhadra of Universal Faith, Samantabhadra of Universal Vision, Samantabhadra of Universal Awakening, Samantabhadra of Universal Light, Samantabhadra of Universal Fragrance, Samantabhadra of Universal Mindfulness, Samantabhadra of Universal Illumination, Samantabhadra of Universal Mindfulness, Samantabhadra of Universal Wisdom, Samantabhadra of Universal Contemplation, Samantabhadra of Universal Illumination of the Dharma Realm, and so forth, all together, in a group of twelve thousand people.",
        "source": "T17n0843_001:0922b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有諸天子眾，所謂：智幢天子、普華幢天子、普光天子、珠髻天子、寶積摩尼峯天子，如是等一萬天子眾俱。",
        "translation": "There were also a multitude of celestials known as the celestials of the banner of wisdom, the celestials of the banner of universal flowers, the celestials of universal illumination, the celestials of the bejeweled topknot, and the celestials of the jeweled maṇi peak, and so forth, along with 10,000 celestials.",
        "source": "T17n0843_001:0922b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸天子，皆悉已於過去佛所種諸善根者，來集此會。",
        "translation": "All of these sons of gods had planted good roots in the past with the Buddha and had gathered here for the ritual.",
        "source": "T17n0843_001:0922c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即入普遍光明三摩地，從是三摩地出已，即放廣大光明，普照三千大千世界，乃至十方一切佛剎普皆照曜。",
        "translation": "The Bhagavān then entered the samādhi of universal illumination, and after emerging from this samādhi, he radiated a vast radiance that shone universally throughout the 3,000 great thousand worlds and even shone universally in all the buddha bases in the ten directions.",
        "source": "T17n0843_001:0922c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時此諸世界所有一切眾生，蒙光照者皆發阿耨多羅三藐三菩提心，已發心者皆悉安住不退轉地。",
        "translation": "All the sentient beings in this world who were illuminated by that light then aroused the mind of unsurpassed, correct, and complete enlightenment, and those who had aroused that mind were all placed in the stage of nonretrogression.",
        "source": "T17n0843_001:0922c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時十方世界一切佛剎，彼彼剎中諸佛世尊，所有近侍諸菩薩眾見此光已，各各白其佛言：「世尊！",
        "translation": "At the time, all the buddha-temples in the world in the ten directions, the buddha-honored ones in those temples, and all the bodhisattvas in their immediate vicinity saw this light and each said to the Buddha, \"Bhagavān!",
        "source": "T17n0843_001:0922c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此光明普照世界，有何因緣，是何神力？」",
        "translation": "What are the causes and conditions for this light shining universally in the world now, and what is its miraculous power?\"",
        "source": "T17n0843_001:0922c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時彼彼佛言：「諸善男子！",
        "translation": "Immediately, the buddhas said, \"Good sons!",
        "source": "T17n0843_001:0922c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知，有世界名娑婆，佛號釋迦牟尼如來、應供、正等正覺，與諸大菩薩眾而共集會，欲說不思議境界正法，以是因緣光明普照。」",
        "translation": "You should know that there's a world called Sāva where the Buddha, known as Śākyamuni the Tathāgata, Worthy of Offerings, Perfectly Enlightened, and Assembled with a multitude of great bodhisattvas, wants to teach the true Dharma of the inconceivable realm and because of this cause his light shines universally.\"",
        "source": "T17n0843_001:0922c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼諸近侍佛者各各白其佛言：「世尊！",
        "translation": "Each of those attendants then said to the Buddha, \"Bhagavān!",
        "source": "T17n0843_001:0922c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者樂欲往彼娑婆世界，瞻禮恭敬釋迦牟尼如來，隨喜聽受不思議境界正法，及欲見彼諸菩薩眾。」",
        "translation": "Now, we would like to go to that Saṃbha world, pay homage to and respect the Tathāgata Śākyamuni, listen with joy to the inconceivable realm of the true teaching, and meet the bodhisattva congregation there.\"",
        "source": "T17n0843_001:0922c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼如來即各告諸近侍者言：「汝等可往，今正是時，隨其所欲。」",
        "translation": "The Tathāgata then addressed each of his attendants, saying, \"You may go; now is the right time to do as you like.\"",
        "source": "T17n0843_001:0922c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時十方諸佛剎中所有一切近侍佛者，即各以其菩薩神通，現諸變化，各與無數天、龍、夜叉、乾闥婆等恭敬圍繞，來詣釋迦牟尼佛所。",
        "translation": "At that point, all of the people who were close to the Buddha in the buddha bases of the ten directions then used their bodhisattva powers to manifest various transformations, and each was surrounded by countless gods, dragons, yakṣas, and gandharvas who respected them and came to visit Śākyamuni Buddha.",
        "source": "T17n0843_001:0922c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩到佛會已，頭面慇懃禮世尊足，咸作是言：「世尊釋迦牟尼如來！",
        "translation": "When they arrived at the Buddha's meeting, the bodhisattvas bowed their heads and faces at the feet of the Bhagavān and said, \"Bhagavān, the Śākyamuni Tathāgata!",
        "source": "T17n0843_001:0922c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等聞其不思議境界正法名字，樂欲隨喜聽受宣說，及欲見佛世尊瞻禮恭敬，并見此諸菩薩大眾，以是因緣，我等到此娑婆世界。」",
        "translation": "We heard the name of the true teaching in its inconceivable realm, wanted to follow it with joy, listened to its explanation, wanted to meet the Buddha, venerate the Bhagavān, and meet this great assembly of bodhisattvas, and for this reason we arrived in this Saha world.\"",
        "source": "T17n0843_001:0922c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時東方大寶世界，寶幢佛剎中，所住妙吉祥菩薩摩訶薩即起是念：「今彼西方娑婆世界，釋迦牟尼佛剎中，有十方世界如殑伽沙數諸大菩薩摩訶薩眾，皆悉集會，聽彼佛說不思議境界正法。",
        "translation": "It was then that the Marvelously Auspicious Bodhisattva Mahāsattva living in the Baobabuddha's buddha-temple in the great jeweled world of the east had this thought, \"Now, in the Śākyamuni Buddha's buddha-temple in the western Saha world, there are a great multitude of bodhisattvas and mahāsattvas in ten directions like the sands of Ganges, all gathered to hear that Buddha teach the true teaching of the inconceivable realm.",
        "source": "T17n0843_001:0923a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今亦宜往彼會中，禮近世尊釋迦牟尼如來！",
        "translation": "Now, it would be appropriate for me to go to that congregation and pay homage to the Bhagavān, the Śākyamuni Tathāgata!",
        "source": "T17n0843_001:0923a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨喜聽受彼正法門，及見彼諸菩薩大士。",
        "translation": "They delight in hearing and accepting their correct teaching and seeing their great bodhisattvas.",
        "source": "T17n0843_001:0923a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0923a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方一切諸佛剎中，隨其所有集會利益，我皆往彼無不往者；又復我常所見諸佛菩薩集會說法無如今日，彼佛剎中有如是等無量無邊菩薩大士廣大集會，我觀是相甚為難有，若見若聞轉復甚難，是故我今亦宜往彼。」",
        "translation": "I've always seen buddhas and bodhisattvas assembling and teaching in the buddha bases of the ten directions, and there are such measureless and limitless bodhisattvas and mahāsattvas assembling in those buddha bases, and it's very difficult for me to observe this, and it's even more difficult for me to see and hear them; therefore, it would be appropriate for me to go there now.\"",
        "source": "T17n0843_001:0923a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙吉祥菩薩作是念已，即謂慈氏菩薩摩訶薩言：「慈氏當知，今世尊釋迦牟尼佛剎中，有無數百千俱胝那庾多菩薩摩訶薩眾廣大集會，聽受宣說不思議境界正法，我等今者宜共往彼瞻禮世尊，并見彼諸菩薩大士！",
        "translation": "After that thought, the Marvelous Auspicious Triumph Bodhisattva addressed the Tsimshian Bodhisattva Mahāsattva, saying, \"Tsimshian, you should know that in the Bhagavān Śākyamuni's buddha-hall there are measureless hundreds of thousands of corti-nayutus of bodhisattvas and great assemblies of bodhisattvas who hear and expound the true teaching of the inconceivable realm, so it would be appropriate for us to go there together to pay homage to the Bhagavān and see those bodhisattva mahāsattvas!",
        "source": "T17n0843_001:0923a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0923a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方世界諸大菩薩普集一處甚為難事。」",
        "translation": "It's a very difficult thing for all the great bodhisattvas of the worlds in the ten directions to gather in one place.\"",
        "source": "T17n0843_001:0923a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時慈氏菩薩摩訶薩告妙吉祥菩薩言：「汝今自詣彼佛會中，非我所往。",
        "translation": "It was then that the Maitreya Bodhisattva Mahāsattva addressed the Mañjuśrī Bodhisattva, \"Now, you're going to that Buddha's meeting by yourself, not by me.",
        "source": "T17n0843_001:0923a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0923a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此甚難故。",
        "translation": "This is very difficult.",
        "source": "T17n0843_001:0923a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛會中諸大菩薩，皆悉已得陀羅尼門，住無著智具諸善法，雖彼集會若見若聞，諸有相者我皆不能。",
        "translation": "All the great bodhisattvas in that Buddha assembly have attained the dhāraṇī teaching and abide in unattached knowledge fully endowed with good qualities, even though I wouldn't be able to see or hear anything that has characteristics if I were assembled there.",
        "source": "T17n0843_001:0923a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T17n0843_001:0923a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當知，若以如來色身有所見者，實無可見，是故我今所不能見；若以如來法身有所見者，法身即是法性，於法性中無見無聞、無所供養、無所瞻禮、無所了知。」",
        "translation": "Now, you should know that if there's a view of the Tathāgata's form body, there's really nothing to see, which is why I can't see it now; if there's a view of the Tathāgata's Dharma body, the Dharma body is the Dharma nature, and in the Dharma nature there's nothing to see, nothing to hear, nothing to offer, nothing to venerate, and nothing to comprehend.\"",
        "source": "T17n0843_001:0923a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥菩薩言：「汝今隨順往彼供養如來。」",
        "translation": "Miaojixiang Pusa said, \"Now, follow him and go there to make offerings to the Tathāgata.\"",
        "source": "T17n0843_001:0923a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏菩薩言：「不也。",
        "translation": "The Mercy Sutra said, \"No.",
        "source": "T17n0843_001:0923a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T17n0843_001:0923a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非我所供養如來。",
        "translation": "\"It's not me who makes offerings to the Tathāgata.",
        "source": "T17n0843_001:0923a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0923a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有如來能供養者。",
        "translation": "There's no Tathāgata who can make offerings.",
        "source": "T17n0843_001:0923a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來即是真如法，真如法中無有二相，真如法者即是如來。」",
        "translation": "The Tathāgata is the truly existent Dharma, there are no two characteristics in the truly existent Dharma, and the truly existent Dharma is the Tathāgata.\"",
        "source": "T17n0843_001:0923a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥菩薩問言：「即此無二相，汝當云何說？」",
        "translation": "The wonderfully auspicious bodhisattva asked, \"What would you say about this lack of two characteristics?\"",
        "source": "T17n0843_001:0923b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏答言：「妙吉祥！",
        "translation": "Maitreya replied, \"Excellent and auspicious!",
        "source": "T17n0843_001:0923b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "煩惱一性及種種性，此說為二；若了一性即種種，是無二法；若起分別此是煩惱、此出世間，作是見者即為二相。",
        "translation": "\"The oneness of afflictions and their various natures are said to be two; if one understands that the oneness is various, there are no two dharmas; if one discerns that this is an affliction and this is supramundane, and thinks that way, that's two characteristics.",
        "source": "T17n0843_001:0923b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若分別此是持戒、此非持戒；此聲聞法、此緣覺法；此是布施、此非布施；此是正道、此是邪道；此是須陀洹、斯陀含、阿那含、阿羅漢，此是緣覺、此是菩薩、此是如來、應供、正等正覺；此法斷滅、此法有想；此法決定、此不決定；此法是智所知、此法為識所識；此證覺道、此涅盤道。",
        "translation": "Also, if someone discerns that this is the observance of precepts and this is not the observance of precepts, this is the śrāvaka teaching and this is the pratyekabuddha teaching, this is generosity and this is not generosity, this is the right path and this is the wrong path, this is stream-winner, sakṛdhāgāmin, non-returner, arhat, pratyekabuddha, bodhisattva, tathāgata, worshipful, and perfectly enlightened, this is cessation and this is conception, this is certainty and this is not certainty, this is knowledge and this is consciousness, and this is the path to awakening and the path to nirvāṇa, then they'll discriminate between them.",
        "source": "T17n0843_001:0923b06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是等有分別者，皆為二相，於二相中隨識所轉；若能不起如是等相，是無二法。",
        "translation": "Anyone who makes such a distinction is acting in two ways, and in those two ways they are transformed by consciousness; if they can abstain from such signs, there are no two things.",
        "source": "T17n0843_001:0923b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Excellent and auspicious!",
        "source": "T17n0843_001:0923b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我以劫或以劫盡說是無二法，假使辯才智慧說不能盡，亦復不能知其邊際。",
        "translation": "If I were to say this is the nondual dharma either by an eon or by the end of an eon, even if the eloquent wisdom of the explanation doesn't exhaust it, it still wouldn't be able to know its limits.",
        "source": "T17n0843_001:0923b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0923b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一切法離種種性，若中若邊皆不可見亦不可得。」",
        "translation": "All those things that are free of their various seed natures, whether middle or border, are invisible and unobtainable.\"",
        "source": "T17n0843_001:0923b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥菩薩言：「大哉慈氏！",
        "translation": "The wonderfully auspicious bodhisattva said, \"Great, Maitreya!",
        "source": "T17n0843_001:0923b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已證得無生法忍，故作是說。",
        "translation": "You've realized the forbearance of the nonarising of all phenomena, and so you've said.",
        "source": "T17n0843_001:0923b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是！",
        "translation": "Thus and thus!",
        "source": "T17n0843_001:0923b18_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使若我以劫或以劫盡，說是無二法，亦非辯才智慧說所能盡。」",
        "translation": "Suppose I were to say that these are the nondual dharmas by the end of an eon or an eon, and it wouldn't be possible to exhaust them with eloquent and wise explanations.\"",
        "source": "T17n0843_001:0923b19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈氏菩薩言：「妙吉祥！",
        "translation": "The Maitreya bodhisattva said, \"Wonderful and auspicious!",
        "source": "T17n0843_001:0923b20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫於文字而生有想，彼一切法離諸文字，是無生相亦無所動。」",
        "translation": "Don't give rise to conceptualizations based on words; all those things are free of words, which are unproduced and unmoving.\"",
        "source": "T17n0843_001:0923b21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙吉祥菩薩普告彼佛剎中諸菩薩言：「善男子！",
        "translation": "At that point, the wonderfully auspicious bodhisattva addressed the bodhisattvas in that buddha's temple, saying, \"Good sons!",
        "source": "T17n0843_001:0923b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今者宜共往彼世尊釋迦牟尼佛剎中瞻禮彼佛，及見百千俱胝那庾多諸菩薩眾，隨喜聽受不思議境界正法。」",
        "translation": "Now, it would be appropriate for all of you to go together to that Bhagavān Śakyamuni's buddha temple to pay homage to him and see the hundreds of thousands of koṭīnayutas of bodhisattvas who are delighted to hear and accept the true teaching of the inconceivable realm.\"",
        "source": "T17n0843_001:0923b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有菩薩名辯積幢王，白妙吉祥菩薩言：「如來無有可能見者，何故今言令我等往見佛如來？",
        "translation": "It was then that a bodhisattva named Dharmakṣema Bhagavān addressed the wonderfully auspicious bodhisattva, saying, \"There's no possible way to see the Tathāgata, so why do you say now that you want us to go and see the Buddha as Tathāgata?",
        "source": "T17n0843_001:0923b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等如來是可見者？",
        "translation": "\"What kind of tathāgata is visible?",
        "source": "T17n0843_001:0923b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以何義說名如來？",
        "translation": "What furthermore does it mean to say that it is called a tathāgata?",
        "source": "T17n0843_001:0923b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0923c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來非過去、未來、現在可得。",
        "translation": "\"The Tathāgata is not something that can be obtained in the past, future, or present.",
        "source": "T17n0843_001:0923c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼一切法亦非三世，皆悉空故，於空法中無能見者。",
        "translation": "Nor are all of those things in the three times, which are all empty, so there's no one who can see those things in their emptiness.",
        "source": "T17n0843_001:0923c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如妙吉祥菩薩所言：『如來有所見』者，今云何見彼佛如來？",
        "translation": "As the wonderfully auspicious bodhisattva said, 'The Tathāgata has views,' how can we now see that Buddha-Tathāgata?",
        "source": "T17n0843_001:0923c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為以何眼可觀察耶？",
        "translation": "Why is it observable with what kind of eye?",
        "source": "T17n0843_001:0923c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以肉眼而能觀者，肉眼即空，於空性中而無所見；若以天眼觀如來者，天眼亦復是有得想；若非眼所觀，何名為見？",
        "translation": "If someone can observe the Tathāgata with the physical eye, the physical eye is emptiness, and there is nothing to see in emptiness; if someone observes the Tathāgata with the divine eye, the divine eye is also a perception of attainment; if it's not something the eye observes, what is it called seeing?",
        "source": "T17n0843_001:0923c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我等今不能往。」",
        "translation": "That's why we can't go now.\"",
        "source": "T17n0843_001:0923c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥菩薩言：「善男子！",
        "translation": "The wonderfully auspicious bodhisattva said, \"Good sons!",
        "source": "T17n0843_001:0923c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今若住不平等法作是說者，於佛如來即不能見亦非供養；汝今若住無所著相如實說者，於佛如來即有所見，亦有所往亦可供養，不著一切文字相故，亦復不離諸文字相。",
        "translation": "If you now abide in an unequal teaching and say this, you won't be able to see or make offerings to the Buddha-tathāgata; if you now abide in a true teaching that's free of attachment to marks, you'll see something, go somewhere, and make offerings to the Buddha-tathāgata, so you won't be attached to all literal marks and won't be free of literal marks either.",
        "source": "T17n0843_001:0923c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼自性空，是故我於平等法中作如是說：『諸佛如來本清淨故！",
        "translation": "Their own nature is empty; therefore, I say this about equal dharmas, 'Because the buddha-tathāgatas are originally pure!'",
        "source": "T17n0843_001:0923c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦復無所動轉！』",
        "translation": "The Tathāgata is also unmoving!'",
        "source": "T17n0843_001:0923c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今者若住忍意，應當往彼；若住非忍意，亦當往彼。」",
        "translation": "If you now abide with patience, you should go there; if you don't abide with patience, you should also go there.\"",
        "source": "T17n0843_001:0923c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時妙吉祥菩薩如是重復為諸菩薩方便宣說，彼菩薩眾以佛威神力故，即於諸法得無所住。",
        "translation": "Thus did the Mañjuśrī Bodhisattva repeatedly explain for the benefit of the bodhisattvas that because of the Buddha's authoritative power, they had attained no place to abide in regard to the various dharmas.",
        "source": "T17n0843_001:0923c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙吉祥菩薩復作是念：「我今不應而獨往彼娑婆世界。",
        "translation": "At that point, the Mañjuśrī Bodhisattva again thought, \"Now, I shouldn't go to that sahā world alone.",
        "source": "T17n0843_001:0923c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0923c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼世界中，所有眾生造不善業，少見少聞不生淨信；我今當現種種色相及希有事而可往彼，令諸眾生見已生信得未曾有，使其獲得廣大善利。」",
        "translation": "Now, I will show various forms and rare things that will allow sentient beings to go there, so that after seeing them, they'll have faith that has never existed before and will obtain vast good benefits for them.\"",
        "source": "T17n0843_001:0923c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時妙吉祥菩薩作是念已，入於無垢普光三摩地，於是三摩地中見無數百千菩薩摩訶薩而共圍繞，所有大梵天王、帝釋天主，各執寶拂侍立左右。",
        "translation": "After he had this thought, the Mañjuśrī Bodhisattva entered the samādhi of immaculate universal illumination, and in that samādhi he saw hundreds of thousands of bodhisattvas and mahāsattvas surrounded by them, with the king of the Brahmā gods and the lord of the Indra gods each holding a jeweled whisk and standing to his left and right.",
        "source": "T17n0843_001:0923c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時妙吉祥菩薩於一一毛孔中出天蓮華大如車輪，一一華中有佛世尊結加趺坐，一一世尊執寶蓮華。",
        "translation": "From each of their pores, the Marvelous Auspicious Triumph Bodhisattva produces a divine lotus flower as large as a chariot wheel, and in each of those flowers there's a Buddha sitting cross-legged, with each world-honored one holding a jeweled lotus flower.",
        "source": "T17n0843_001:0923c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時三千大千世界所有眾生得大快樂。",
        "translation": "At that point, all the sentient beings in the 3,000 great one-thousand worlds attain great happiness.",
        "source": "T17n0843_001:0923c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙吉祥菩薩即時普見一切眾生，彼諸眾生亦同得見妙吉祥菩薩，皆悉不退轉於阿耨多羅三藐三菩提心。",
        "translation": "The Mañjuśrī Bodhisattva then saw all sentient beings in general, and all of those sentient beings also saw the Mañjuśrī Bodhisattva, and they all did not retrogress in the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0843_001:0923c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙吉祥菩薩見是相已，出三摩地，從彼東方大寶佛剎來此娑婆世界，隨所經歷諸佛剎土，悉現如是神通變化，普令一切獲大利益。",
        "translation": "After seeing this, the Marvelous Auspicious Bodhisattva emerged from his samādhi, came from that great jeweled buddha temple in the east to this Saha world, and according to the buddha-lands he experienced, he always showed such supernormal powers and transformations that universally caused all of them to obtain great benefit.",
        "source": "T17n0843_001:0924a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其種種佛剎，皆見如來執寶蓮華，各各為彼眾生說法或見佛剎；地獄眾生現受苦者，佛為救度皆得離苦；及彼畜生、餓鬼等趣互相食噉、極苦惱者亦皆離苦；乃至閻魔界中現受一切苦惱眾生，見佛各為如應說法。",
        "translation": "In each of those buddha-temples, they all see the Tathāgata holding the jeweled lotus and each teaching or seeing a buddha-temple for a sentient being; sentient beings in hell who are suffering are saved by the Buddha, and they are all freed from suffering; animals, hungry ghosts, and other destinies that eat each other and are extremely afflicted are also freed from suffering; and even sentient beings in the Yama realm who are suffering from all afflictions see the Buddha teaching them accordingly.",
        "source": "T17n0843_001:0924a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生，一一皆得遠離苦惱，各各發趣阿耨多羅三藐三菩提心。",
        "translation": "Each of these sentient beings is freed from suffering and affliction, and each arouses the resolve to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0843_001:0924a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛剎中，或見如來廣為一切阿修羅眾如應說法，各各得轉阿修羅身。",
        "translation": "In some Buddha-temple, the Tathāgata may be seen to explain the Dharma as it should to all the asuras, and each one attains transformation into an asura body.",
        "source": "T17n0843_001:0924a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛剎中，或見如來住妙吉祥神通境界，為諸剎帝利大族、婆羅門大族、長者大族，如應說法各獲利益，或為四大王天諸天子眾如應說法，謂諸天子言：「汝等當知，彼一切行皆悉無常，勿起意念謂究竟法。」",
        "translation": "In some Buddha's buddha-stage, the Tathāgata may be seen abiding in the realm of marvelously auspicious superknowledges, teaching as he should to the great family of bhadras, the great family of brāhmaṇas, and the great family of elders, and teaching as he should to a multitude of gods and sons of the four great king heavens, saying to the gods and sons, \"You should know that all their conditioned phenomena are impermanent, so don't give attention to what's called the ultimate dharma.\"",
        "source": "T17n0843_001:0924a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是法者皆獲利益。",
        "translation": "Those who hear this teaching will all receive benefit.",
        "source": "T17n0843_001:0924a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛剎中，或見如來住妙吉祥神通境界，為三十三天帝釋天主等諸天子眾如應說法。",
        "translation": "In some buddha blazas, the Tathāgata may be seen standing in the realm of marvelously auspicious superknowledges, speaking as he should to a multitude of gods including the Trāyastriṃśa gods and other celestials.",
        "source": "T17n0843_001:0924a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦復謂言：「諸行無常非究竟法，諸有智者當如實知，不應於中作究竟想。」",
        "translation": "They also say, \"Actions that are impermanent are not ultimate dharmas, and those who have knowledge of them should really know better than to conceptualize them as ultimate.\"",
        "source": "T17n0843_001:0924a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是法者皆獲利益。",
        "translation": "Those who hear this teaching will all receive benefit.",
        "source": "T17n0843_001:0924a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛剎中，或見如來住妙吉祥神通境界，為夜摩天諸天子眾、知足天中諸天子眾、化樂天中諸天子眾、他化自在天中諸天子眾、梵眾天中諸天子眾、梵輔天中諸天子眾、大梵王天諸天子眾，如是乃至色究竟天諸天子眾，各各如應為其說法，聞所說法皆獲利益。",
        "translation": "In some buddha buddha, the Tathāgata may be seen abiding in the realm of marvelously auspicious superknowledge, speaking to each of the sons of the Yama Heaven, the sons of the Nirmāṇarati Heaven, the sons of the Nirmāṇarati Heaven, the sons of the Paranirmitavaśavartin Heaven, the sons of the Brahmakāyika Heaven, the sons of the Brahma King Heaven, and the sons of the Mahābrahma King Heaven, up to the sons of the Nirmāṇarati Heaven, as they should be, and they all receive benefit from hearing what's taught.",
        "source": "T17n0843_001:0924a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或見如來住妙吉祥神通境界，為諸初地菩薩摩訶薩眾如應說法。",
        "translation": "Perhaps they see the Tathāgata abiding in the realm of marvelous and auspicious supernormal powers, teaching as he should to a multitude of first-stage bodhisattvas and mahāsattvas.",
        "source": "T17n0843_001:0924b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或為二地、或為三地、或為四地、或為五地、或為六地、或為七地、或為八地、或為九地、或為十地諸大菩薩摩訶薩眾、或為一生補處當得成就阿耨多羅三藐三菩提者，各各如應說法要，使令增進住不退轉，乃至普令圓滿安住大涅盤界。",
        "translation": "Whether it's for the second ground, third ground, fourth ground, fifth ground, sixth ground, seventh ground, eighth ground, ninth ground, or tenth ground, or for a great multitude of bodhisattvas, mahāsattvas, or those who will attain unsurpassed, corrected, and complete enlightenment in their lifetime, each explains the essentials of the Dharma, causing them to advance, abide, and not turn back, and universally cause them to fully abide in the great nirvāṇa realm.",
        "source": "T17n0843_001:0924b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙吉祥菩薩現如是等種種神變，隨所經歷諸佛剎土，一切眾生見是相者，皆悉發於阿耨多羅三藐三菩提心，五百苾芻得諸漏盡心善解脫，八千菩薩得無生法忍，十千天子遠離塵垢得法眼淨。",
        "translation": "At the time, the wonderfully auspicious bodhisattva performed such a variety of miraculous transformations that followed him through the buddha-lands, and all sentient beings who saw this transformation were all inspired to undertake the unsurpassed, correct, and complete enlightenment, 500 monks attained the mind's wholesome liberation that ends the contaminants, 8,000 bodhisattvas attained the forbearance of the nonarising of the Dharma, and 10,000 celestials became free of the defilement and attained purification of the Dharma eye.",
        "source": "T17n0843_001:0924b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時所得利益諸菩薩等，異口同音說伽陀曰：「見是神通變化事，　　一切具足未曾有；　妙吉祥尊境界中，　　一切眾生得利益。」",
        "translation": "The bodhisattvas who immediately attained their benefits spoke with one voice, saying, \"Seeing these miraculous powers and transformations, they are fully present in a way that's unprecedented, and in the realm of the wonderfully auspicious honored one, all sentient beings attain their benefits.\"",
        "source": "T17n0843_001:0924b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時十方諸佛剎中已來集會諸菩薩眾，各各以神通力見如是等大希有事，俱白世尊釋迦牟尼佛言：「今此三千大千世界光明普照及希有事，是何神力所變化故？",
        "translation": "It was then that a multitude of bodhisattvas who had come together in buddha bases in the ten directions each saw such a great and rare thing with their supernormal powers, and they each said to the Bhagavān, Śakyamuni Buddha, \"Now, what is this rare thing and bright universal illumination of the 3,000 great thousand worlds that's the result of a transformation by supernormal powers?",
        "source": "T17n0843_001:0924b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛世尊為我等說。」",
        "translation": "May the Bhagavān explain this for us.\"",
        "source": "T17n0843_001:0924b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸菩薩摩訶薩言：「善男子！",
        "translation": "The Buddha addressed the bodhisattvas and mahāsattvas, saying, \"Good sons!",
        "source": "T17n0843_001:0924b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知，有菩薩大士名妙吉祥，住不退轉、已得灌頂，從東方來欲入此會，是彼神通現斯瑞應。",
        "translation": "All of you should know that there's a bodhisattva-mahāsattva named Sumati, who lives irreversibly and has been consecrated, and who comes from the east wanting to enter this assembly, and this is an auspicious response from his supernormal powers.",
        "source": "T17n0843_001:0924b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又善男子！",
        "translation": "And good sons!",
        "source": "T17n0843_001:0924b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人得聞彼妙吉祥名字者，皆悉住於不退轉心，況復得見甚為難事。」",
        "translation": "If anyone hears that marvelously auspicious name, they'll all abide in a mind that doesn't regress, so how could it be so difficult to see?\"",
        "source": "T17n0843_001:0924b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊釋迦牟尼佛為諸菩薩摩訶薩作是說時，彼妙吉祥菩薩即以神通來入佛會，到佛會已頭面著地禮世尊足，前前白佛：「世尊釋迦牟尼佛！",
        "translation": "When the Bhagavān Śakyamuni Buddha said this for the bodhisattvas and mahāsattvas, that wonderfully auspicious bodhisattva then entered the Buddha's assembly with his supernormal powers, bowed his head to the ground at the Bhagavān's feet when he arrived, and went forward to say to the Buddha, \"Bhagavān Śakyamuni Buddha!",
        "source": "T17n0843_001:0924b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少病少惱、輕利調適得快樂不？",
        "translation": "Do you attain happiness with few illnesses and fewer afflictions, and with mild benefits and adjustments?",
        "source": "T17n0843_001:0924c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從東方大寶世界寶幢佛剎來此會中，禮近世尊聽說正法。」",
        "translation": "I've come from the Ratnaketu Buddha Temple in the great jeweled world of the east to pay homage to the Bhagavān and listen to him teach the right Dharma.\"",
        "source": "T17n0843_001:0924c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時普華幢天子在大會中，從座而起前白佛言：「世尊！",
        "translation": "It was then that the Prabhūtaratna godson rose from his seat in the assembly and said to the Buddha, \"Bhagavān!",
        "source": "T17n0843_001:0924c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩當修何法，即得成就如妙吉祥神通事業最勝甚深辯才智慧？」",
        "translation": "What teaching should bodhisattvas and mahāsattvas cultivate to attain the most excellent and profound eloquence and wisdom in the cause of marvelous and auspicious supernormal powers?\"",
        "source": "T17n0843_001:0924c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告普華幢天子言：「若菩薩摩訶薩樂欲成就如是神通勝事業者，應當具足四種法門。",
        "translation": "The Buddha told Prabhūtaratna, \"If a bodhisattva Mahāsattva wishes to accomplish such a remarkable feat of supernormal powers, he or she should fulfill four kinds of teaching.",
        "source": "T17n0843_001:0924c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0843_001:0924c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、於甚深法隨喜聽受。",
        "translation": "1. he follows the joyful hearing and acceptance of the very profound Dharma.",
        "source": "T17n0843_001:0924c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、廣為他人說甚深法。",
        "translation": "2. He explains the very profound Dharma in detail for others.",
        "source": "T17n0843_001:0924c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、隨所聞法請問其義。",
        "translation": "3. asks questions about the meaning of the teaching he's heard.",
        "source": "T17n0843_001:0924c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、聞已信解如理修行。",
        "translation": "4. After hearing it, he believes and understands it and correctly cultivates it.",
        "source": "T17n0843_001:0924c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四種。",
        "translation": "These are the four kinds.",
        "source": "T17n0843_001:0924c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四法，應當具足。",
        "translation": "There are another four things that should be fulfilled.",
        "source": "T17n0843_001:0924c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0843_001:0924c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、於佛如來所說經法總持決定。",
        "translation": "1. He is certain that the sūtras and dharmas taught by the Buddha Tathāgata are of general maintenance.",
        "source": "T17n0843_001:0924c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、於諸經法愛樂修習。",
        "translation": "2. He takes delight in cultivating the teachings of the sutras.",
        "source": "T17n0843_001:0924c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、於諸經法記念不忘。",
        "translation": "3. He remembers the teachings of the sūtras and doesn't forget them.",
        "source": "T17n0843_001:0924c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、於諸經法廣說流通。",
        "translation": "4. He teaches and circulates the teachings of the scriptures in detail.",
        "source": "T17n0843_001:0924c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四種。",
        "translation": "These are the four kinds.",
        "source": "T17n0843_001:0924c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四法，應當具足。",
        "translation": "There are another four things that should be fulfilled.",
        "source": "T17n0843_001:0924c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0843_001:0924c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、於正法門諦實聽受。",
        "translation": "1. He truly listens to and accepts the correct teaching.",
        "source": "T17n0843_001:0924c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、於說法師生尊重想。",
        "translation": "2: Gives rise to the idea of respect for the teacher who explains the teaching.",
        "source": "T17n0843_001:0924c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、於持法人恭敬承事不生懈退。",
        "translation": "3. He respects and serves the Dharma preacher and doesn't become lazy.",
        "source": "T17n0843_001:0924c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、於說法師常所稱讚長時無倦。",
        "translation": "4. He always praises the teacher of the teaching and doesn't tire of it for a long time.",
        "source": "T17n0843_001:0924c18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四種。",
        "translation": "These are the four kinds.",
        "source": "T17n0843_001:0924c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四法，應當具足。",
        "translation": "\"There are another four things that should be fulfilled.",
        "source": "T17n0843_001:0924c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0843_001:0924c19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：四心常當發起。",
        "translation": "There are four kinds of mind that should always arise.",
        "source": "T17n0843_001:0924c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、平等心。",
        "translation": "1. an equal mind ...",
        "source": "T17n0843_001:0924c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、柔軟心。",
        "translation": "2. a gentle mind ...",
        "source": "T17n0843_001:0924c20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、無懈心。",
        "translation": "3. a mind free of laziness ...",
        "source": "T17n0843_001:0924c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、無毒心。",
        "translation": "4. a mind that's not poisonous.",
        "source": "T17n0843_001:0924c21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為四種。",
        "translation": "These are the four kinds.",
        "source": "T17n0843_001:0924c21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩於如是等四種法門，隨所修習，即得如是神通變化最勝事業，復能成就智慧辯才。」",
        "translation": "If bodhisattvas, mahāsattvas, and followers of these four kinds of teaching cultivate them, they'll attain the most remarkable work of such supernormal powers and changes, and they'll also achieve wisdom and eloquence.\"",
        "source": "T17n0843_001:0924c21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說是四種法門時，五千菩薩得無生法忍，四千天子遠離塵垢得法眼淨。",
        "translation": "When the Bhagavān explained these four kinds of Dharma entries, 5,000 bodhisattvas attained the patient acceptance of the nonarising Dharma, and 4,000 celestials became free of the defilement and attained purification of the Dharma eye.",
        "source": "T17n0843_001:0924c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩及天子眾得所利已，咸作是言：「普願眾生皆得安住諸佛境界，於正法門深生信解，所聞正法記念受持，於未來世得大神通如妙吉祥，於諸佛剎變化自在。」",
        "translation": "After they had attained their benefits, the bodhisattvas and celestials all said, \"May all sentient beings attain stability in the realms of the buddhas, deeply believe in and understand the right teaching, remember and uphold what they've heard, attain great supernormal powers like marvelous good fortune in future lives, and change freely in the buddha-blocs.\"",
        "source": "T17n0843_001:0924c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時普華幢天子白妙吉祥菩薩言：「菩薩從何所來至此佛會？",
        "translation": "It was then that the divine son of the Universal Flower Banner said to the Mañjuśrī Bodhisattva, \"Where did the bodhisattva come from to come to this Buddha-assembly?",
        "source": "T17n0843_001:0925a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所住佛剎其名何等？",
        "translation": "What is the name of the buddha-stage where it resides?",
        "source": "T17n0843_001:0925a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化主如來復何名字？」",
        "translation": "What is the name of the transformation master, the Tathāgata?\"",
        "source": "T17n0843_001:0925a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時妙吉祥菩薩告普華幢天子言：「莫作是說：『有所從來』。",
        "translation": "The wonderfully auspicious Bodhisattva then addressed the Prabhūtaratna Tathāgata, \"Don't say this, 'There's something from which it comes.'",
        "source": "T17n0843_001:0925a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0843_001:0925a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子當知，法界無來亦無所去，復無所行而無所住，一切無著。",
        "translation": "\"Son of gods, you should know that the Dharma realm has no coming or going, yet it has nothing to do and nothing to abide in, and all are free of attachment.",
        "source": "T17n0843_001:0925a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼法界性，無所疑惑離諸戲論。",
        "translation": "Its nature as the Dharma realm is free of doubt and free of conceptual elaboration.",
        "source": "T17n0843_001:0925a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子！",
        "translation": "Sons of God!",
        "source": "T17n0843_001:0925a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言有來、有去、有所住者，是戲論法。」",
        "translation": "If someone says there's a coming, going, and staying, that's conceptual conceptualization.\"",
        "source": "T17n0843_001:0925a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時普華幢天子及諸大眾，聞妙吉祥菩薩說是法已，即時各各歎未曾有，異口同音說伽陀曰：「最上希有妙吉祥！",
        "translation": "After the Prabhūtaratna gods and the great assembly heard the Marvelous Auspicious Bodhisattva teach this Dharma, they each immediately praised it as unprecedented and spoke with one voice, saying, \"Most excellent, rare, and wonderful Auspicious!",
        "source": "T17n0843_001:0925a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　從佛世尊所出生；　具足神通諸法門，　　聞者見者得利益。",
        "translation": "\"Born from the Buddha, the Bhagavān has perfected the teachings of supernormal powers, and those who hear and see them will reap benefits.",
        "source": "T17n0843_001:0925a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大士今現此諸相，　　宣說甚深微妙法；　我皆隨喜得見聞，　　咸於今日獲大利。",
        "translation": "Now, the great man shows these forms and explains the profound and subtle Dharma, and we're all delighted to see and hear it, so today we'll all attain great rewards.",
        "source": "T17n0843_001:0925a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等昔聞大名士，　　今見神通妙色相；　菩薩是大法光明，　　出現一切諸佛法。",
        "translation": "We once heard of a great celebrity, and now we see the marvelous appearance of his superknowledge; this bodhisattva is a great Dharma light who produces all the Buddha's teachings.",
        "source": "T17n0843_001:0925a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已能圓滿一切行，　　慚愧上服所莊嚴；　自利利他妙吉祥，　　最勝功德難思議。",
        "translation": "They've accomplished all their deeds, adorned by their superior garments of shame, and are wonderfully auspicious for their own benefit and for the benefit of others, with inconceivable supreme qualities.",
        "source": "T17n0843_001:0925a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩猶如世間父，　　普攝一切為所歸；　開示涅盤方便門，　　咸令眾生到彼岸。",
        "translation": "Like a worldly father, the bodhisattva universally includes all things as refuge, revealing the convenient gate to nirvāṇa and bringing sentient beings to the other shore.",
        "source": "T17n0843_001:0925a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩猶如大師子，　　一音能破諸外論；　正法功德悉已圓，　　一切染法皆清淨。",
        "translation": "Like the great teacher's son, the bodhisattva's single voice refutes external theories; the merits of the right Dharma are all fully accomplished, and all defiled dharmas are purified.",
        "source": "T17n0843_001:0925a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩猶如世間地，　　普能出生諸善法；　復為最上大醫王，　　能救眾生諸病苦。",
        "translation": "Like the ground of the world, the bodhisattva is able to produce all good qualities, and he's the supreme great king of doctors, able to save sentient beings from illness and pain.",
        "source": "T17n0843_001:0925a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩如月大清涼，　　令諸熱惱皆清淨；　復如日光大熾盛，　　廣照一切三摩地。",
        "translation": "Like the moon, which is perfectly cool and causes all the heat and distress to be purified, the bodhisattva is like a sun that's perfectly blazing and shines broadly in all the samādhis.",
        "source": "T17n0843_001:0925a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩大利大導師，　　引示眾生菩提道；　常生廣大慈愍心，　　救度惡趣眾生苦。",
        "translation": "The bodhisattva is a great teacher who guides sentient beings on the path to enlightenment and always produces a mind of vast compassion, saving sentient beings in the evil destinies from suffering.",
        "source": "T17n0843_001:0925a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩常為所依怙，　　了別一切眾生心；　一切智智妙法門，　　普施眾生令解脫。」",
        "translation": "The bodhisattva is always the refuge, discerns the minds of all sentient beings, and universally bestows the wondrous Dharma of omniscience and wisdom on sentient beings to bring about their liberation.\"",
        "source": "T17n0843_001:0925a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告普華幢天子及諸大眾言：「如是如是。",
        "translation": "It was then that the Bhagavān addressed the Prabhūtaratna gods and the general public, \"Thus and so it is.",
        "source": "T17n0843_001:0925b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言，妙吉祥菩薩有是功德。」",
        "translation": "As you say, the Marvelous Auspicious Bodhisattva has this merit.\"",
        "source": "T17n0843_001:0925b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎佛說大乘不思議神通境界經卷上",
        "translation": "．The Buddha Explained the Realm of Inconceivable Superknowledges in the Mahāyāna Sutra, Volume 1",
        "source": "T17n0843_001:0925b03_2",
        "is_bad_quality": false
    }
]