[
    {
        "source_sentence": "正法念處經卷第三十七",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 37",
        "source": "T17n0721_037:0215a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏婆羅門瞿曇般若流支譯",
        "translation": "Yuan Wei Bhramun Gautama Prajñāruci Translation",
        "source": "T17n0721_037:0215a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀天品之十六(夜摩天之二)",
        "translation": "Sixteenth Chapter of the Avalokitêśvara Sutra (Yama Heaven No. 2)",
        "source": "T17n0721_037:0215a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「爾時，世尊知彼調伏心淳熟已，即令聲聞以天眼力而調伏之。",
        "translation": "\"'At the time, the Bhagavān knew that their minds were well-prepared for submission, so he told the śrāvakas to use the power of the divine eye to submit them.",
        "source": "T17n0721_037:0215a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時聲聞告樂見言：『樂見當知！",
        "translation": "The śrāvakas then addressed Lakṣmī, saying, 'Lakṣmī, you must know!",
        "source": "T17n0721_037:0215a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此佛世尊，并諸天、人、魔及沙門、若婆羅門，一切世間諸天及人、阿修羅師。",
        "translation": "\"This is the Bhagavān, along with gods, humans, Māra, ascetics, and Brahmans, all the world's gods, humans, and asuras.",
        "source": "T17n0721_037:0215b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此佛世尊一切悉知、一切悉見，常為一切世間說法，初中後善，義善語善，獨法具足鮮白清淨，說出世法寂靜，乃至到於涅槃。",
        "translation": "This Bhagavān knows everything and sees everything, always teaches the Dharma for the whole world, teaching it well in the beginning and in the end, making its meaning good and its words good, making its solitary dharma complete, pure, and white, and teaching the tranquility of supramundane dharmas up to the point of reaching nirvāṇa.",
        "source": "T17n0721_037:0215b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：「此色，此色集，此色滅，此色滅道。」",
        "translation": "They say, \"This form, this form collects, this form ceases, and this form ceases to be the path.\"",
        "source": "T17n0721_037:0215b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者為汝夜摩天眾說法故來，利益安樂饒益故來。』",
        "translation": "Now, I've come to preach for you Yama gods, and I've come to bring benefit and comfort and enrichment.'",
        "source": "T17n0721_037:0215b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「時，彼樂見夜摩天王於聲聞所，如是聞已，喚言：『大仙！",
        "translation": "\"'At the time, that god Yama was delighted to see the śrāvaka king, and after thus hearing him, he called out, 'Great man!",
        "source": "T17n0721_037:0215b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今往至佛世尊所，不知云何供養世尊？",
        "translation": "Now, when I go to the Bhagavān, I wonder what offerings I can make to the Bhagavān.",
        "source": "T17n0721_037:0215b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者，不解儀式，云何供養？』",
        "translation": "Now, I don't understand the ritual, so how can I make offerings?'",
        "source": "T17n0721_037:0215b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼聲聞聞已答言：『樂見天王來近世尊。』",
        "translation": "The śrāvakas then heard this and answered, 'Lokêśvararāja comes near the Bhagavān.'",
        "source": "T17n0721_037:0215b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂見聞已，捨冠莊嚴，心善調伏，寂靜諸根，一心正念，整服左肩，右膝著地，頭面敬禮，合掌向佛。",
        "translation": "After hearing this, Lokêśvararāja dismounted from his regalia, composed his mind, tranquilized his faculties, concentrated his mind, adjusted his left shoulder, knelt on his right knee, saluted with his head and face, and bowed his palms together to the Buddha.",
        "source": "T17n0721_037:0215b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切天眾皆從聲聞如是聞已，捨莊嚴具，一心正念，寂靜諸根，一切皆詣坐蓮花臺。",
        "translation": "After the śrāvakas heard this, all the celestials dismounted from their adornments, composed their minds with right concentration, and quieted their faculties, and they all retired to sit on the lotus flower dais.",
        "source": "T17n0721_037:0215b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來世尊諸聲聞眾之所圍遶，如月悉為眾星所遶，又亦如彼須彌山王眾山圍遶，又亦如海為諸大河之所圍遶。",
        "translation": "The Bhagavān was surrounded by a multitude of śrāvakas, just as the moon is surrounded by the stars, just as that Sumeru mountain king is surrounded by mountains, and just as the ocean is surrounded by large rivers.",
        "source": "T17n0721_037:0215b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如轉輪王八萬四千小王圍遶，又亦如日光明圍遶，諸聲聞眾如是圍遶。",
        "translation": "As the 84,000 junior wheel-turning kings are encircled by 84,000 minor kings, and as the sun's brightness encircles them, so are the śrāvakas encircled by them.",
        "source": "T17n0721_037:0215b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來世尊，第一勝妙不可稱量威德光明，於大蓮花臺上而坐。",
        "translation": "The Bhagavān, the most excellent, marvelous, and immeasurably powerful light, was sitting on a great lotus-flower dais.",
        "source": "T17n0721_037:0215b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「爾時，樂見夜摩天王身著法衣，整服一廂，合掌向佛，正住一面。",
        "translation": "\"'At the time, Mahākauṣṭhila saw Yama, the king of gods, dressed in his Dharma robes, fully attired in one compartment, with his palms together, facing the Buddha, and correctly positioned at one side.",
        "source": "T17n0721_037:0215b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告言：『令汝今者捨離放逸。』",
        "translation": "The Bhagavān told him, 'Let's ask you now to abandon your carelessness.'",
        "source": "T17n0721_037:0215b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，樂見一處坐已，彼迦那迦牟尼世尊即出勇勝不畏音聲——一切夜摩皆悉遍滿——告言：『樂見！",
        "translation": "After Rakṣa had sat down in one place, the Bhagavān Kanakamuni then made a brave and fearless sound - one that filled all the yamas - and told him, 'Rakṣa!",
        "source": "T17n0721_037:0215b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今說法，初中後善，義善語善，獨法具足鮮白梵行，如是而說。",
        "translation": "'Now, I've explained the teaching, teaching that's good in the beginning and good at the end, good in meaning and good in speech, and complete in the distinctive qualities of pure and white religious practice.",
        "source": "T17n0721_037:0215b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今諦聽，正念善思，我於今者，善為汝說。』",
        "translation": "Now, listen closely, correctly consider it well, and I will explain it well for you now.'",
        "source": "T17n0721_037:0215b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，樂見言：『如是，世尊！",
        "translation": "Then, Lakṣmī said, 'So it is, Bhagavān!",
        "source": "T17n0721_037:0215b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。』",
        "translation": "May I wish to hear about it.'",
        "source": "T17n0721_037:0215b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「爾時，世尊為樂見等天眾說言：『有九種因能生放逸，於彼放逸樂行多作，能壞世間愚癡凡夫，身壞命終墮於惡道——地獄、餓鬼、畜生之中。",
        "translation": "\"'It was then that the Bhagavān addressed the Lakṣmī celestials, saying, 'There are nine causes that give rise to carelessness, and their careless and indulged-in actions can ruin the world's foolish worldlings and cause them to fall into a bad destiny - hell, hungry ghosts, or animals - when their bodies break up and their lives end.",
        "source": "T17n0721_037:0215b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以生因緣，受大苦惱，生死繫縛，不得涅槃安隱之樂，不得利益。",
        "translation": "Because of these causes, they'll experience great suffering and distress, be bound by birth and death, and won't attain the peaceful pleasures of nirvāṇa or obtain any benefit.",
        "source": "T17n0721_037:0215c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等九因？",
        "translation": "What are these nine causes?",
        "source": "T17n0721_037:0215c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者所謂樂於放逸，行於放逸，常行放逸，不近聖人，不能調攝身口意業，不攝根行，不能自正身口意等，而令行於不善境界，常喜樂聞不善之法，而不樂於佛之正法。",
        "translation": "One is called enjoying carelessness, acting carelessly, always acting carelessly, not approaching noble people, not regulating physical, verbal, and mental actions, not regulating faculties and practices, not being able to correct physical, verbal, and mental actions, and so forth, but causing them to act in unwholesome ways, always delighting in hearing unwholesome things, and not delighting in the Buddha's right teaching.",
        "source": "T17n0721_037:0215c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是放逸行之初因，能生放逸。",
        "translation": "This is the first cause of careless behavior, which can lead to carelessness.",
        "source": "T17n0721_037:0215c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若放逸行，愚癡眾生身不善行、口不善行、意不善行，以身口意不善行故，身口意等不善之業和集。",
        "translation": "If someone engages in careless behavior, foolish sentient beings will engage in unskillful physical actions, unskillful verbal actions, and unskillful mental actions, and because their physical, verbal, and mental actions are unskillful, unskillful actions such as physical, verbal, and mental actions will be collected together.",
        "source": "T17n0721_037:0215c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人放逸所誑，身壞命終墮於惡道，生在地獄、餓鬼、畜生。",
        "translation": "When a foolish man's carelessness prevents him from doing so, his body breaks up and his life ends, and he falls into a bad destiny, being born in hell, a hungry ghost, or an animal.",
        "source": "T17n0721_037:0215c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若捨放逸，是善丈夫，常捨放逸。",
        "translation": "If they abandon carelessness, this is a good man who always abandons carelessness.",
        "source": "T17n0721_037:0215c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若求善者，應捨放逸。",
        "translation": "If someone seeks to be good, they should abandon carelessness.",
        "source": "T17n0721_037:0215c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是初因能生放逸。",
        "translation": "This is the first cause that produces dissipation.",
        "source": "T17n0721_037:0215c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『復次，樂見！",
        "translation": "\"'Furthermore, Lakṣmī!",
        "source": "T17n0721_037:0215c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有第二放逸行因，能生放逸，起放逸已，能壞善根，所謂舉動心不審諦。",
        "translation": "\"Furthermore, there's a second cause of careless behavior that produces carelessness and, after producing carelessness, can damage good roots, which is to say that the mind is agitated and doesn't discriminate.",
        "source": "T17n0721_037:0215c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼眼見已，則生分別，數數如是憶念思惟，樂於彼色，更不異緣。",
        "translation": "After the eye sees it, it discriminates, repeatedly recollects and reflects on it in this way, and is pleased with that form, not with any other object.",
        "source": "T17n0721_037:0215c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常如是作不善之行，非是善念，心意錯亂。",
        "translation": "They often thus behave unwholesomely, not in a good way, and their mind is distorted.",
        "source": "T17n0721_037:0215c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼放逸者以放逸故，身壞命終墮於惡道，生地獄中。",
        "translation": "As a result of that carelessness, that person's body breaks up and his life ends, and he falls into a bad destiny or is born in hell.",
        "source": "T17n0721_037:0215c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第二放逸行因，能生放逸。",
        "translation": "This is the second cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0215c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『復有第三放逸行因，能生放逸，所謂不實未見未聞，本未曾有，唯有心念，心生分別，或依止欲或依止癡。",
        "translation": "\"'\"Furthermore, there's a third cause of careless behavior that produces carelessness that's not really seen or heard and never existed in the past but only mental thoughts that give rise to mental discriminations, either based on desire or on delusion.",
        "source": "T17n0721_037:0215c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼如是念、如是思惟，心常緣彼、心常念彼，第一之法不善思惟，以自亂心。",
        "translation": "They thus think and contemplate them, always focusing their mind on them and always being mindful of them, and the first thing they don't contemplate well, which disturbs their own mind.",
        "source": "T17n0721_037:0215c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第三放逸行因，能生放逸，縛諸眾生，能誑眾生，令身口意行不善行，身壞命終墮於惡道，生地獄中。",
        "translation": "This is the third cause of careless behavior that produces carelessness, binds sentient beings, and leads them to behave unskillfully in body, speech, and thought, and to fall into a bad destiny or be born in hell when their body breaks up and their life ends.",
        "source": "T17n0721_037:0215c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『復有第四放逸行因，能生放逸，能令一切放逸眾生，身壞命終墮於惡道，生地獄中。",
        "translation": "\"'\"Furthermore, there's a fourth cause of careless behavior that produces carelessness and can cause all careless sentient beings to fall into a bad destiny and be born in hell when their bodies break up and their lives end.",
        "source": "T17n0721_037:0215c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，樂見！",
        "translation": "Thus, Lakṣmī!",
        "source": "T17n0721_037:0216a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者第四放逸之因？",
        "translation": "What is the fourth cause of dissipation?",
        "source": "T17n0721_037:0216a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂恒常樂見婦女，樂見莊嚴不實之色，於不實色，心生愛樂；見其歌舞，心生分別，彼則心歡。",
        "translation": "It's called a constant delight in seeing women, a delight in seeing ornate, unreal forms, a delight in their minds when they see unreal forms, and a delight in their minds when they see them singing and dancing, and a delight in their minds when they see them.",
        "source": "T17n0721_037:0216a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是分別身口意等，非作善業。",
        "translation": "Such discrimination of body, speech, mind, and so forth is not the performance of good actions.",
        "source": "T17n0721_037:0216a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼放逸者，身壞命終墮於惡道，生地獄中。",
        "translation": "When they are careless, their body breaks up and their life ends, and they fall into a bad destiny and are born in hell.",
        "source": "T17n0721_037:0216a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第四放逸行因，能生放逸。",
        "translation": "This is the fourth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有第四放逸行因，能生放逸，所謂憙樂種種園林，樂蓮花池或樂種種諸花樹林，見已心樂，在中戲樂、在中遊行，不念善事、不正心意。",
        "translation": "There's another fourth cause of careless behavior that produces carelessness, which is called being proud of the various parks and groves, the lotus-flower pond, or the various flowering trees, and being happy in one's mind after seeing them, playing in them, and marching in them, not thinking of good deeds or incorrect thoughts.",
        "source": "T17n0721_037:0216a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行放逸，放逸所誑，身壞命終墮於惡道，生地獄中。",
        "translation": "They engage in careless behavior, and when that carelessness leads to destruction of their body and death, they fall into a bad destiny and are born in hell.",
        "source": "T17n0721_037:0216a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第四放逸行因，能生放逸。",
        "translation": "This is the fourth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『復有第五放逸行因，能生放逸。",
        "translation": "\"'Again, there's a fifth cause of careless behavior that produces carelessness.'",
        "source": "T17n0721_037:0216a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，樂見！",
        "translation": "Thus, Lakṣmī!",
        "source": "T17n0721_037:0216a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近惡知識，與共和合，毀破淨戒，行於惡行，不善思惟，造作惡行。",
        "translation": "They approach bad associates, join with friends, violate the pure precepts, engage in bad behavior, contemplate unskillfully, and create bad deeds.",
        "source": "T17n0721_037:0216a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生近惡知識，行放逸行，身壞命終墮於惡道，生地獄中。",
        "translation": "Thus, a sentient being who approaches a bad friend and engages in careless behavior will fall into a bad destiny and be born in hell when their body breaks up and their life ends.",
        "source": "T17n0721_037:0216a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第五放逸行因，能生放逸。",
        "translation": "This is the fifth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，樂見！",
        "translation": "\"Furthermore, Lakṣmī!",
        "source": "T17n0721_037:0216a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有第五放逸行因，能生放逸。",
        "translation": "\"There's another fifth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂眾生無量種行、無量種意，無決定意造作善業。",
        "translation": "It means that sentient beings have measureless kinds of actions and measureless kinds of intentions, and they have no determined intention to create good actions.",
        "source": "T17n0721_037:0216a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生無一定業，如是眾生不定作業，一切作業悉皆散失。",
        "translation": "Such sentient beings have no definite actions, such sentient beings do indeterminate actions, and all their actions are lost.",
        "source": "T17n0721_037:0216a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於世間業、出世間業，彼一切業不究竟作，不能布施、不作福業，非善思惟，以放逸過，是故犯戒。",
        "translation": "They don't completely perform all their worldly and transmundane actions, aren't able to give or perform good actions, don't contemplate them well, and are remiss because of their dissipation; this is why they violate the precepts.",
        "source": "T17n0721_037:0216a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身壞命終墮於惡道，生地獄中。",
        "translation": "They are destined to fall into a bad destiny or be born in hell when their body breaks up and their life ends.",
        "source": "T17n0721_037:0216a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第五放逸行因，能生放逸。",
        "translation": "This is the fifth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『復有第六放逸行因，能生放逸。",
        "translation": "\"'\"Again, there's a sixth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂眾生捨離正法、捨離聖諦，乃至捨離八聖道分，有所行作，不善觀察。",
        "translation": "It refers to the fact that sentient beings abandon the right teaching, abandon the noble truths, and abandon the eightfold noble path, performing actions that are not well observed.",
        "source": "T17n0721_037:0216a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，樂見！",
        "translation": "Thus, Lakṣmī!",
        "source": "T17n0721_037:0216a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生以放逸行亂其心故，身壞命終墮於惡道，生地獄中。",
        "translation": "Because such sentient beings distract their minds with careless actions, they are destined to fall into a bad destiny and be born in hell when their bodies break up and their lives end.",
        "source": "T17n0721_037:0216a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第六放逸行因，能生放逸。",
        "translation": "This is the sixth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『復有第七放逸行因，能生放逸，所謂貪味。",
        "translation": "\"'\"Furthermore, there's the seventh cause of careless behavior that produces carelessness, which is craving for taste.",
        "source": "T17n0721_037:0216a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何處何處著彼諸味，彼處彼處心樂常念，隨彼心作。",
        "translation": "They are attached to those tastes wherever and whenever they are, and their mind is always mindful of their pleasure in that place or another place, and they act according to that mind.",
        "source": "T17n0721_037:0216a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生更無異念，不作善業、不持正戒，心常樂他請喚與食，常貪味故，為味所誑。",
        "translation": "Such a sentient being has no different thoughts, doesn't do good actions and doesn't observe proper precepts, and his mind is always delighted to be summoned by others for food, always craving taste, and being deceived by taste.",
        "source": "T17n0721_037:0216b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作善業，於苦、無常、空、無我等，此四種中一亦不念，唯念不善顛倒之法，一切所作非自利益。",
        "translation": "Not doing good actions, they don't think of any of these four things - suffering, impermanence, emptiness, and selflessness - but only think of unskillful and mistaken things, and what they do is not for their own benefit.",
        "source": "T17n0721_037:0216b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生身壞命終墮於惡道，生地獄中。",
        "translation": "Such a sentient being's body breaks up and his life ends, and he falls into a bad destiny and is born in hell.",
        "source": "T17n0721_037:0216b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第七放逸行因，能生放逸。",
        "translation": "This is the seventh cause of careless behavior, which produces carelessness.",
        "source": "T17n0721_037:0216b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『如是，樂見！",
        "translation": "\"'Thus, Lakṣmī!'",
        "source": "T17n0721_037:0216b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有第八放逸行因，能生放逸。",
        "translation": "\"There's also an eighth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂眾生若得種種無量樂已，於彼樂事喜樂貪著，謂常不動、謂常安隱、謂不破壞。",
        "translation": "It means that if sentient beings attain various immeasurable pleasures and then delight in and cling to those pleasures, they're said to be always unmoving, always at ease, and not destroyed.",
        "source": "T17n0721_037:0216b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼常憶念如是之樂，身口意業常行不善，不知應作及不應作，不知是法、不知非法，不覺不知破壞苦惱，不念地獄、餓鬼、畜生無量百千分別苦惱。",
        "translation": "They are always mindful of such pleasures, always behaving badly in body, speech, and thought, not knowing what should be done and what shouldn't be done, not knowing what's right and not knowing what's wrong, not perceiving and not knowing the suffering and distress that destroys them, and not being mindful of the measureless hundreds of thousands of discriminating sufferings and distress of hell, hungry ghosts, and animals.",
        "source": "T17n0721_037:0216b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切不念，不應念者而便念之。",
        "translation": "They don't think of anything, and they think of what shouldn't be thought.",
        "source": "T17n0721_037:0216b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是不念死滅之法，一切世間生死之中，死能作亂而不知念。",
        "translation": "Thus, they aren't mindful of the law of death's cessation, and in all the world's births and deaths, death can cause disruptions without knowing how to think about it.",
        "source": "T17n0721_037:0216b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生為樂所誑，如是惡貪著樂眾生，後時死至，爾乃生悔，悔火自燒，身壞命終墮於惡道，生地獄中。",
        "translation": "Thus, sentient beings are deceived by pleasure, and sentient beings who are thus unwholesomely attached to pleasure then come to regret when death occurs, and the fires of regret burn themselves out, destroying their bodies and ending their lives fall into a bad destiny and are born in hell.",
        "source": "T17n0721_037:0216b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第八放逸行因，能生放逸。",
        "translation": "This is the eighth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『如是，樂見！",
        "translation": "\"'Thus, Lakṣmī!'",
        "source": "T17n0721_037:0216b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有第九放逸行因，能生放逸。",
        "translation": "\"There's also a ninth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂種種樂樂之心。",
        "translation": "It's called a mind that's happy in various ways.",
        "source": "T17n0721_037:0216b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天人之中為愛所誑，不知歸依佛法眾僧，不持禁戒、不聽佛法、不住聖律；所應作法而不知作，而常憙聞不應作法；不入正法，而心不畏未來世罪，不見後世死後之苦，失自利益，怨心所誑。",
        "translation": "Being deceived by craving among gods and humans, they don't know the reliance on the Buddha, Dharma, and Saṅgha, don't observe the precepts, don't listen to the Buddha's teaching, and don't abide by the sacred precepts; they don't know the things they should do and are always jealous of hearing the things they shouldn't do; they don't enter the right Dharma, but their minds aren't afraid of future worldly sins, don't see the suffering of the afterlife, lose their own benefits, and are deceived by resentment.",
        "source": "T17n0721_037:0216b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身壞命終墮於惡道，生地獄中。",
        "translation": "They lose their own benefits and are deceived by resentments. They are destined to fall into a bad destiny or be born in hell when their body breaks up and their life ends.",
        "source": "T17n0721_037:0216b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第九放逸行因，能生放逸。",
        "translation": "This is the ninth cause of careless behavior that produces carelessness.",
        "source": "T17n0721_037:0216b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「『樂見當知！",
        "translation": "\"'You should know this from a happy perspective!'\"",
        "source": "T17n0721_037:0216b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之富樂，非常、非恒、非不破壞。",
        "translation": "This rich pleasure is neither permanent nor indestructible.",
        "source": "T17n0721_037:0216b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，樂見！",
        "translation": "Thus, Happy View!",
        "source": "T17n0721_037:0216b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜摩天王過去無量於此已退，彼何處去？",
        "translation": "After he retired here, where did the god Yama go?",
        "source": "T17n0721_037:0216b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼自業果成就故爾，彼以善業、不善業羂所繫縛故，輪轉生死。",
        "translation": "Because they've accomplished the result of their own actions, they're bound by the karmic bonds of good and bad actions as they transmigrate through birth and death.",
        "source": "T17n0721_037:0216b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以善業故，生天人中；不善業故，生於地獄、餓鬼、畜生。",
        "translation": "Because of good actions, they're born among gods and humans, and because of unwholesome actions, they're born in hell, hungry ghosts, or animals.",
        "source": "T17n0721_037:0216c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，樂見！",
        "translation": "Therefore, Lakṣmī!",
        "source": "T17n0721_037:0216c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有欲得人身之者，莫行放逸。",
        "translation": "\"If there's someone who wants to attain a human body, don't act carelessly.",
        "source": "T17n0721_037:0216c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_037:0216c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身命無常，富樂亦爾，當如是念，勿放逸行。",
        "translation": "\"Since body and life are impermanent, so are wealth and pleasure, so be mindful and don't act carelessly.",
        "source": "T17n0721_037:0216c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_037:0216c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多有無量百千天眾以放逸行，是故退墮。",
        "translation": "There are measureless hundreds of thousands of gods who engage in careless behavior and therefore fall back.",
        "source": "T17n0721_037:0216c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勿行放逸之道。",
        "translation": "Don't practice carelessness in this way.",
        "source": "T17n0721_037:0216c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡之者行於此道，非善男子。",
        "translation": "A foolish man who practices this path is not a good man.",
        "source": "T17n0721_037:0216c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切生者，必定歸死，死在現前，老亦如是，病亦如是，愛離亦爾，善不善業、富樂亦爾。",
        "translation": "All birth is certain to lead to death, which is presently manifested, as is old age and illness, as is craving and separation, and as are good and unskillful actions, wealth, and pleasure.",
        "source": "T17n0721_037:0216c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切不饒益過，常隨不離一切眾生。』",
        "translation": "Thus, these are all unbeneficial faults that are always followed and never separated from all sentient beings.'",
        "source": "T17n0721_037:0216c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「爾時，世尊而說偈言：「『「『放逸之毒樹，　　三枝住在上，　　　　謂老病死物，　　常在其上住。",
        "translation": "\"'It was then that the Bhagavān spoke this verse, saying, \"'The poison tree of carelessness has three branches standing on top, which are the things of old age, illness, and death, and they always stand on top of it.",
        "source": "T17n0721_037:0216c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　老等不能惱，　　丈夫善行者，　　　　若不放逸行，　　彼行涅槃道。",
        "translation": "Old age and so forth can't be bothered, but a husband who does good actions, if he doesn't engage in careless behavior, will practice the path to nirvāṇa.",
        "source": "T17n0721_037:0216c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　不放逸大斧，　　常能斫諸過，　　　　彼解脫過故，　　得無上之樂。",
        "translation": "With the great axe of non-carelessness, he's always able to chop away at faults, and because he's freed from faults, he attains unsurpassed happiness.",
        "source": "T17n0721_037:0216c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　若放逸受樂，　　彼樂常怖畏，　　　　若離彼放逸，　　彼樂常不退。",
        "translation": "If they enjoy carelessness, their happiness is always frightening, and if they part with that carelessness, their happiness is always nonretrogression.",
        "source": "T17n0721_037:0216c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　如是百百倒，　　放逸之所誑，　　　　以未覺知故，　　今猶有不離。",
        "translation": "Thus, these hundred errors, which are the results of carelessness, are still present because they haven't yet been perceived, and they don't part with them.",
        "source": "T17n0721_037:0216c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　四種顛倒見，　　住在放逸上，　　　　捨離放逸故，　　則失世間怨。",
        "translation": "The four mistaken views are based on carelessness, and because they abandon carelessness, they lose their worldly enmity.",
        "source": "T17n0721_037:0216c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　此無量分別，　　無量怖畏逼，　　　　生死轉行苦，　　皆由彼放逸。",
        "translation": "These immeasurable discriminations, immeasurable fears, and the pain of the transmigration through birth and death are all caused by that carelessness.",
        "source": "T17n0721_037:0216c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　若離一放逸，　　則得樂不退，　　　　一切無漏法，　　放逸故能失。",
        "translation": "If they part with a single instance of carelessness, then they'll attain happiness and never retrogress, and all uncontaminated dharmas can be lost because of carelessness.",
        "source": "T17n0721_037:0216c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　天中不放逸，　　上上而轉行。",
        "translation": "Among the gods, there's no carelessness, and they move upward and upward.",
        "source": "T17n0721_037:0216c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　何放逸癡天，　　不能得解脫？",
        "translation": "Why is there a careless, deluded heaven where liberation isn't possible?",
        "source": "T17n0721_037:0216c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　彼此善思惟，　　種種分別已，　　　　如自利益作，　　後時則不悔。",
        "translation": "\"After well considering one another and discriminating various things, they will act according to their own interests and then not regret it.",
        "source": "T17n0721_037:0216c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　若天若受樂，　　若其餘少法，　　　　此有為相法，　　應知皆無常。",
        "translation": "Whether it's a god, whether it's enjoyed by gods, or whether it's some other thing, these things that have characteristics should be known to be impermanent.",
        "source": "T17n0721_037:0217a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　若法有為數，　　彼畢竟失滅，　　　　後時必破壞，　　常受諸苦惱。",
        "translation": "If these things are numerous, they will eventually disappear, and later they will be destroyed and always subject to suffering and distress.",
        "source": "T17n0721_037:0217a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　　若有憶念樂，　　放逸所壞者，　　　　彼於離散時，　　則多受苦惱。』",
        "translation": "If there's contemplation of pleasure that's destroyed by negligence, then when they're scattered, they'll often suffer suffering and distress.'",
        "source": "T17n0721_037:0217a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「彼佛世尊如是如是無量分別種種調御樂見天王。",
        "translation": "\"'The Bhagavān thus and so infinitely discerns the various ways to tame the gods and see the king of delights.",
        "source": "T17n0721_037:0217a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是因緣，於一切法皆不障礙。",
        "translation": "Such are the causes and conditions that don't obstruct any dharmas.",
        "source": "T17n0721_037:0217a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切知見天眾圍遶，種種調御，令彼諸天捨離放逸。",
        "translation": "Surrounded by a multitude of gods who know and see everything, he regulates them in various ways, causing them to abandon their carelessness.",
        "source": "T17n0721_037:0217a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有諸天被放逸縛，不得自在乃至退時。",
        "translation": "If there are gods bound by dissipation, they can't be at ease until they retreat.",
        "source": "T17n0721_037:0217a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜摩天王二萬天眾，從佛世尊聞正法已，一切皆得須陀洹果。",
        "translation": "After hearing the right teaching from the Bhagavān, all 20,000 of the Yama Heavenly Kings' celestials attained the fruit of stream entry.",
        "source": "T17n0721_037:0217a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「爾時，世尊如是思念：『我所應作，如是作已，更何所作而利益他？』",
        "translation": "\"'At the time, the Bhagavān thus considered, 'What else should I do that would benefit others after I've done it this way?'",
        "source": "T17n0721_037:0217a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊見未來世，如是思量更何所作，如未來世利益安樂苦惱眾生。",
        "translation": "Seeing the future, the Bhagavān then considered what else he could do to improve the well-being of suffering and pained sentient beings in the future.",
        "source": "T17n0721_037:0217a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊如是又復於彼大蓮花內——神通所化，更作如是天妙神通與天一種住而不滅，令有飛鳥，復為說偈。",
        "translation": "Again, the Bhagavān thus created these heavenly marvelous powers within that great lotus flower that was transformed by his supernormal powers, and he created these heavenly beings of a single type that would abide and not cease, causing flying birds to again speak a verse for him.",
        "source": "T17n0721_037:0217a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以彼如是天神通力調伏天已，作如是言：『如未來世，樂見天王於彼退已，復有天王，其王名曰牟修樓陀夜摩天王，未來當生，行放逸行。",
        "translation": "After he had subdued the gods with the power of his supernormal abilities, he said, 'In a future life, after the god King Lakṣmī has retreated, there will again be a god King whose name is Muxiu Lutra, King of the Yama gods, who will be born in the future and will engage in careless behavior.",
        "source": "T17n0721_037:0217a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於彼時有善眾生，彼於一時出遊戲處滑高山中。",
        "translation": "At that time, there will be a good sentient being who goes out to play one time and slides into a high mountain.",
        "source": "T17n0721_037:0217a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "徐上彼山，上彼山已，次復上彼大蓮花已，亦坐如是蓮花臺上。",
        "translation": "He slowly ascends that mountain, and after ascending that mountain, he next ascends that large lotus flower and sits on a lotus flower dais like this.",
        "source": "T17n0721_037:0217a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大蓮花是我所化。",
        "translation": "That large lotus flower was created by me.",
        "source": "T17n0721_037:0217a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天見已，生希有心而入其中，入彼種種甚可愛樂大蓮花中。",
        "translation": "When that god saw that, he became desirous and entered it, going into one of those large, very desirable lotus flowers.",
        "source": "T17n0721_037:0217a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復從彼出，向他天說。",
        "translation": "He then emerged from there and told the other gods.",
        "source": "T17n0721_037:0217a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時舊天於前次第先曾聞來，亦復向彼牟修樓陀夜摩天王如是而說。",
        "translation": "The old gods had heard it before in turn, and they also spoke to that king of the god Mucilinda and Yama in this way.",
        "source": "T17n0721_037:0217a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於爾時，牟修樓陀夜摩天王既得聞已，信佛世尊，信彼佛法——善根種子，於是乃至得到涅槃。",
        "translation": "After hearing it, that king of gods Mucilinda and Yama then believed in the Bhagavān, believed in that Buddha's teaching-the seeds of good roots-and thus attained nirvāṇa.",
        "source": "T17n0721_037:0217a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天如是信心生已，不久時聞釋迦牟尼如來出世。",
        "translation": "Soon after such faith arose in that god, he heard that the Tathāgata Śākyamuni had appeared in the world.",
        "source": "T17n0721_037:0217b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是彼處牟修樓陀夜摩天王及於釋迦牟尼佛所，得聞正法。",
        "translation": "Thus, Muxiu Lutra Yama, the king of the gods, and Śakyamuni Buddha attained hearing of the right teaching.",
        "source": "T17n0721_037:0217b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀夜摩天王次第傳聞，於舊天邊如是傳聞，如是一切如所聞事，如是一切皆悉具有。』",
        "translation": "Mucilinda Yama, the king of gods, heard it in order, and it was thus heard at the edge of the old heavens, and all of these things were thus heard, and all of them were thus possessed.'",
        "source": "T17n0721_037:0217b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝今見大蓮花中希有之事，我於今者如是為說。",
        "translation": "Just as you've now seen something rare in the great lotus flower, I've explained it this way.",
        "source": "T17n0721_037:0217b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復釋迦牟尼世尊於今出在閻浮提中，為眾說法，汝今應當到彼聽法。",
        "translation": "Furthermore, now that the Bhagavān Śakyamuni has emerged from Jambudvīpa to preach to the crowd, you should go there now and listen to the teaching.",
        "source": "T17n0721_037:0217b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼過去名迦那迦牟尼如來世尊所說，汝如是得，必定無疑，必得解脫。」』",
        "translation": "As the Bhagavān Kanakamuni Tathāgata taught in the past, you will surely attain, without doubt, liberation.\"",
        "source": "T17n0721_037:0217b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼名牟修樓陀夜摩天王從宿舊天如是聞已，心生歡喜，生敬重心。",
        "translation": "\"After hearing this from that celestial king named Mucilinda Yama from the Old Ones, his heart rejoiced and he became venerable.",
        "source": "T17n0721_037:0217b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『過去久遠名迦那迦牟尼佛說，次第傳來，我今得聞。",
        "translation": "'Long ago, the Buddha Kanakamuni spoke this teaching, which was transmitted in order, and now I've heard it.",
        "source": "T17n0721_037:0217b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如是故，我心歡喜，心得清淨。",
        "translation": "Because of this, my heart rejoices, and my mind is purified.",
        "source": "T17n0721_037:0217b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以於舊天得傳聞已，故生歡喜心得清淨，何況現見釋迦牟尼如來世尊，從佛聞法。』",
        "translation": "After hearing about it from the old gods, I became happy and my mind was purified, so why wouldn't I see the Bhagavān, the Tathāgata, and hear the Dharma from the Buddha now?'",
        "source": "T17n0721_037:0217b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼天如是念已，八萬天子相與共向波羅柰國，見佛世尊無比之色，以三十七菩提分法莊嚴其身，猶如金山，威德焰然。",
        "translation": "After the gods thus thought, 80,000 sons of gods went together to the country of Vārāṇasī and saw the Bhagavān's peerless appearance, adorned with the thirty-seven factors of enlightenment, like a gold mountain, and his majesty blazing with power.",
        "source": "T17n0721_037:0217b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生皆蒙利益，一切皆見無量百千眷屬圍遶而為說法，四諦相應。",
        "translation": "All sentient beings were benefited, and all of them saw measureless hundreds of thousands of followers surrounding them as they taught the Dharma, in accord with the four truths.",
        "source": "T17n0721_037:0217b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼名牟修樓陀夜摩天王、八萬天眾共至佛所。",
        "translation": "\"At the time, that god king named Muxiu Lutra Yama and 80,000 gods arrived at the Buddha's place.",
        "source": "T17n0721_037:0217b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到佛所已，頭頂禮足，爾時佛告牟修樓陀夜摩天王喚言：『善來！",
        "translation": "When they arrived, they bowed their heads at their feet, and the Buddha addressed the god king musolutra and called out to them, 'Good boy!",
        "source": "T17n0721_037:0217b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Muxuludha!",
        "source": "T17n0721_037:0217b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已曾聞名迦那迦牟尼佛法修多羅說，如是聞已，來到此處。』",
        "translation": "You have heard the name Kanakamuni Buddha teach the Dharma sūtra, and after hearing it this way, you came to this place.'",
        "source": "T17n0721_037:0217b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼名牟修樓陀夜摩天王如是念曰：『佛一切智、極微細智、無障礙智，如我過去天中之事盡皆解知。』",
        "translation": "\"It was then that that god king named Mucilinda Yama thought, 'The Buddha has omniscience, extremely subtle knowledge, and unobstructed knowledge, such as that which I used to have in the heavens, which I fully understand.'",
        "source": "T17n0721_037:0217b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀念已心喜，八萬天眾一切皆共更禮世尊。",
        "translation": "After Mucilinda's thought, his heart rejoiced, and all 80,000 gods paid homage to the Bhagavān.",
        "source": "T17n0721_037:0217b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "禮世尊已，住在一面。",
        "translation": "After paying homage to the Bhagavān, they stayed to one side.",
        "source": "T17n0721_037:0217b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時世尊如是告言：『牟修樓陀！",
        "translation": "\"It was then that the Bhagavān addressed them like this, 'Muxiu Lutuo!",
        "source": "T17n0721_037:0217c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今者，為汝說法，初中後善，義善語善，獨法具足鮮白清淨。",
        "translation": "'Now, I've explained the teaching for you, which is good in the beginning and good in the end, good in meaning and good in speech, and complete in its own way, pure and white.",
        "source": "T17n0721_037:0217c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法門者，名天乘樂，汝當諦聽，善思念之，我為汝說。』",
        "translation": "This is the teaching called the joy of the celestial vehicle, so listen closely and consider it well as I explain it for you.'",
        "source": "T17n0721_037:0217c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀夜摩天王受教而言：『如是，世尊！",
        "translation": "Mucilinda, the king of the god Yama, was instructed and said, 'So it is, Bhagavān!",
        "source": "T17n0721_037:0217c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今樂聞。』",
        "translation": "Now, I'm delighted to hear about it.'",
        "source": "T17n0721_037:0217c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊如是說言：『何者法門名天乘樂？",
        "translation": "\"It was then that the Bhagavān spoke thus, 'What's the dharma-gate called the bliss of the heavenly vehicle?'",
        "source": "T17n0721_037:0217c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有十二。",
        "translation": "There are twelve of these.",
        "source": "T17n0721_037:0217c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Mucilinda!",
        "source": "T17n0721_037:0217c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為十二天道？",
        "translation": "What is known as the twelve heavenly destinies?",
        "source": "T17n0721_037:0217c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子住彼道者，彼正丈夫能上天道，猶如世間著官道者，則得入城，離於怖畏、離於疑慮。",
        "translation": "If a good man abides in that path, that rightful man can ascend to the heavenly realm like an earthly person who's attached to the government path, and then he can enter the city, free of fear and free of doubt.",
        "source": "T17n0721_037:0217c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是不壞身口意等，行十二道，則得至天，如是丈夫入於天中。",
        "translation": "Thus, he doesn't destroy body, speech, mind, and so forth, and when he practices the 12 paths, he'll reach the heavens, and such a man will enter the heavens.",
        "source": "T17n0721_037:0217c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are the twelve?",
        "source": "T17n0721_037:0217c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一名實道。",
        "translation": "One is the true path.",
        "source": "T17n0721_037:0217c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若著彼道，得到天上。",
        "translation": "If someone adheres to that path, they'll attain heaven.",
        "source": "T17n0721_037:0217c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Mucilinda!",
        "source": "T17n0721_037:0217c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼實道者有五功德。",
        "translation": "\"Those on the true path have five virtues.",
        "source": "T17n0721_037:0217c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T17n0721_037:0217c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者實語，實說丈夫一切人信。",
        "translation": "One is true speech, which truly explains the faith of all people as a husband.",
        "source": "T17n0721_037:0217c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者不壞，常一切時無人能壞。",
        "translation": "Two, it's indestructible, and there's no one who can destroy it at all times.",
        "source": "T17n0721_037:0217c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者清淨，常一切時名色清淨。",
        "translation": "Three, it's pure, always and for all time fame and form are pure.",
        "source": "T17n0721_037:0217c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者可重，常一切時天所貴重。",
        "translation": "Four, respectable, always valuable to gods for all time.",
        "source": "T17n0721_037:0217c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者上生，身壞命終生於天上。",
        "translation": "Five, he'll be born above, and when his body breaks up and his life ends, he'll be born up in heaven.",
        "source": "T17n0721_037:0217c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「實語常調御，　　恒為天供養，　　　一切世間愛，　　後時得生天。」",
        "translation": "Here's a verse that says, \"'True words are always disciplined, always offered up to the gods, and all worldly attachments are later given birth in the heavens.'\"",
        "source": "T17n0721_037:0217c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0217c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初天道。",
        "translation": "\"This is the first heavenly path.",
        "source": "T17n0721_037:0217c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Muxuludha!",
        "source": "T17n0721_037:0217c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復為第二天道，而著彼道得到天上？",
        "translation": "What is it again, the second day of the path, and will one attain heaven while adhering to that path?",
        "source": "T17n0721_037:0217c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂布施清淨無垢，不破、不壞、不悕果報。",
        "translation": "This is called giving that's pure and undefiled, which doesn't break or break down and doesn't expect results.",
        "source": "T17n0721_037:0217c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是熏思，此則名為第二天道，此善業人得至天中。",
        "translation": "When thus perfumed, this is called the second path, and this person of good actions attains entry into the heavens.",
        "source": "T17n0721_037:0217c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此第二道有三功德。",
        "translation": "This second path has three virtues.",
        "source": "T17n0721_037:0217c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂三者：一切人愛；常自熏思，心生歡喜；身壞命終生於天上。",
        "translation": "These three are loved by all people, constant perception that produces joy in the mind, and birth in the heavens when the body breaks up and the life ends.",
        "source": "T17n0721_037:0217c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此第二道至天世間。",
        "translation": "This second path takes a person to the heavenly realm.",
        "source": "T17n0721_037:0217c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「布施人所愛，　　亦復增長恩，　　　後時生天富，　　布施果如是。」",
        "translation": "Here's a verse that says, \"'Giving what's loved by people also increases kindness, and later it produces wealth in the heavens, which is the result of generosity.'\"",
        "source": "T17n0721_037:0217c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第三天道，而著彼道得到天上？",
        "translation": "What is the third heavenly path, and what is the third path to which one adheres and attains heaven?",
        "source": "T17n0721_037:0218a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂忍辱。",
        "translation": "\"It's called patience.",
        "source": "T17n0721_037:0218a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能忍之人有五功德，所謂五者：不諍、不懟，此初功德；一切無能偷盜其物，此二功德；一切人愛，此三功德；多有悲心，此四功德；身壞命終得生善道天世界中，此五功德。",
        "translation": "Those who can tolerate it have five virtues, which are called the following five virtues: the first virtue of not being able to steal property, which is two virtues; the third virtue of being loved by all people, which is three virtues; the fourth virtue of having much compassion; and the fifth virtue of being born in a heavenly realm of good courses when his body breaks up and his life ends.",
        "source": "T17n0721_037:0218a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「忍辱相應行，　　悲心亦不怖，　　　一切人所愛，　　身壞得生天。」",
        "translation": "Here's a verse that says, \"'Acting with patience and humility, being compassionate and not afraid, and being loved by all people, I'll be born in the heavenly realm when my body breaks up.'\"",
        "source": "T17n0721_037:0218a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第四天道，而著彼道得到天上？",
        "translation": "What is the fourth heavenly path, and what is the fourth path to which one adheres and attains heaven?",
        "source": "T17n0721_037:0218a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂美語。",
        "translation": "\"It's called beautiful speech.",
        "source": "T17n0721_037:0218a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Mucilinda!",
        "source": "T17n0721_037:0218a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是美語有六功德：一者一切人愛；二者無怖畏處；三者面常清淨；四者得善名稱；五者行則不慮；六者身壞命終生於天上。",
        "translation": "Such beautiful words have six virtues: first, they're loved by all people; second, they have no place of fear; third, their faces are always pure; fourth, they acquire a good reputation; fifth, their actions are free from worry; and sixth, they're born up in heaven when their body breaks up and their life ends.",
        "source": "T17n0721_037:0218a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Mucilinda!",
        "source": "T17n0721_037:0218a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是美語六種功德。",
        "translation": "These are the six virtues of beautiful speech.",
        "source": "T17n0721_037:0218a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「一切人所愛，　　增長善名稱，　　　普面甚端嚴，　　身壞則生天。」",
        "translation": "Here's a verse that says, \"'Beloved by all people, it enhances good reputation, has a very dignified countenance, and is born in the heavens when its body breaks up.'\"",
        "source": "T17n0721_037:0218a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第五天道，而著彼道得到天上？",
        "translation": "What is the fifth heavenly path again, and what is the fifth path to which one adheres and attains heaven?",
        "source": "T17n0721_037:0218a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂憐愍一切眾生。",
        "translation": "\"There's the expression 'pity for all sentient beings.'",
        "source": "T17n0721_037:0218a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子乃至終得到於涅槃，我說彼人無等功德。",
        "translation": "This good man, up to his final attainment of nirvāṇa, has what I'd call unsurpassed virtue.",
        "source": "T17n0721_037:0218a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「於一切眾生，　　悲心如父母，　　　彼人憐愍寶，　　常在心中住。」",
        "translation": "Here's a verse that says, \"'He's compassionate toward all sentient beings like a father and mother, and that person's treasure of kindness always abides in his mind.'\"",
        "source": "T17n0721_037:0218a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第六天道，而著彼道得到天上？",
        "translation": "What is the sixth heavenly path again, and what is the sixth path to which one adheres and attains heaven?",
        "source": "T17n0721_037:0218a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂正心。",
        "translation": "\"It's called a right mind.",
        "source": "T17n0721_037:0218a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正心之者，能作善業；善思惟者，善語言說。",
        "translation": "That right mind is capable of doing good actions, and it's well-considered and well-spoken.",
        "source": "T17n0721_037:0218a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總略說此正心功德。",
        "translation": "This is a general outline of the virtues of right mind.",
        "source": "T17n0721_037:0218a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「若善正心者，　　常順法觀察，　　　不為過所使，　　如日光除闇。」",
        "translation": "Here's a verse that says, \"'If someone is good at right mind, they'll always observe the teaching in accordance with it and won't be subject to error, like sunlight removing darkness.'\"",
        "source": "T17n0721_037:0218a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡為一切法之根本，謂善正心。",
        "translation": "Whatever is the root of all dharmas is called a good and correct mind.",
        "source": "T17n0721_037:0218a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Mucilinda!",
        "source": "T17n0721_037:0218a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第七天道，而著彼道得到天上？",
        "translation": "What is the seventh heavenly path again, and what is the seventh path to which one adheres and attains heaven?",
        "source": "T17n0721_037:0218b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂正見。",
        "translation": "This is called right view.",
        "source": "T17n0721_037:0218b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正見丈夫能到涅槃，何況於天。",
        "translation": "A husband with right view can reach nirvāṇa, so why wouldn't he go to heaven?",
        "source": "T17n0721_037:0218b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼若少有身口意業，一切如是利益眾生，得生天中乃至涅槃。",
        "translation": "If he has little physical, verbal, or mental activity and does everything this way to benefit sentient beings, he'll be born in heaven and reach nirvāṇa.",
        "source": "T17n0721_037:0218b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「唯正見為勝，　　隨何人有心，　　　俗人亦如是，　　得脫生死縛。」",
        "translation": "Here's a verse that says, \"'Only right view is superior; whatever person has mind, even ordinary people are thus freed from the bondage of birth-and-death.'\"",
        "source": "T17n0721_037:0218b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第八天道，而著彼道得到天上？",
        "translation": "What is the eighth heavenly path again, and will he attain heaven while attached to that path?",
        "source": "T17n0721_037:0218b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂遠離不善知識，無三種過，善人不捨，為同戒故。",
        "translation": "It's called avoiding unskillful associates and having no three faults that a good person doesn't abandon because they share the precepts.",
        "source": "T17n0721_037:0218b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸惡因緣一切不生，餘勝大過亦更不得。",
        "translation": "None of the bad causes or conditions will arise, and the other great faults will not be tolerated.",
        "source": "T17n0721_037:0218b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「近惡知識者，　　彼則不得樂；　　　近惡知識已，　　廣得不饒益。」",
        "translation": "Here's a verse that says, \"'If someone approaches a bad friend, they won't be able to enjoy themselves; after approaching a bad friend, they'll attain extensive unbeneficial results.'\"",
        "source": "T17n0721_037:0218b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第九天道，而著彼道得到天上？",
        "translation": "What is the ninth heavenly path again, and what is the ninth heavenly path to which one adheres and attains heaven?",
        "source": "T17n0721_037:0218b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂聞正法。",
        "translation": "\"It's hearing the right teaching.",
        "source": "T17n0721_037:0218b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略說聞法攝七功德：一者得聞未聞異法；二者所聞堅固不失；三者捨離一切惡業；四者諸聖之所樂見；五者深心信敬如來；六者則得增長壽命；七者身壞命終生天。",
        "translation": "It's briefly described as the seven virtues that result from hearing the teaching: first, they hear what's unheard; second, what they hear is resolute and isn't lost; third, they abandon all bad actions; fourth, they are pleasing to the views of the sages; fifth, they deeply believe in and revere the Tathāgata; sixth, they increase their life expectancy; and seventh, they are born in heaven when their body breaks up and their life ends.",
        "source": "T17n0721_037:0218b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「未聞者得聞，　　已聞者堅固，　　　捨離諸惡業，　　身壞得生天。」",
        "translation": "Here's a verse that says, \"'Those who have yet to hear will hear, those who have heard will stand firm, abandon bad karma, and be born in heaven when their bodies break up.'\"",
        "source": "T17n0721_037:0218b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是第十天道，而著彼道得到天上？",
        "translation": "What is the tenth heavenly path again, and will he attain heaven while attached to that path?",
        "source": "T17n0721_037:0218b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂柔軟心。",
        "translation": "It's called a tender heart.",
        "source": "T17n0721_037:0218b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀！",
        "translation": "Mucilinda!",
        "source": "T17n0721_037:0218b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼柔軟心有四功德：一者於他不生怨嫌；二者雖作而不堅固；三者不為瞋恚所惱；四者身壞命終生天。",
        "translation": "That gentle mind has four virtues: first, it doesn't become hostile toward others; second, it doesn't become resolute despite its actions; third, it isn't tormented by anger; and fourth, it's born in heaven when its body breaks up and its life ends.",
        "source": "T17n0721_037:0218b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「若善淨無垢，　　諸過不著心，　　　瞋垢不能污，　　死後得生天。」",
        "translation": "Here's a verse that says, \"'If you're good and pure and undefiled, your faults don't attach to your mind, and the stain of anger can't defile it, you'll be born in heaven after death.'\"",
        "source": "T17n0721_037:0218b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是十一天道，而著彼道得到天上？",
        "translation": "\"How are these the eleven sunny days and the paths to which they are attached and which lead to heaven?",
        "source": "T17n0721_037:0218b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂信業果。",
        "translation": "\"It's the fruit of faith in actions.",
        "source": "T17n0721_037:0218b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信業果者，一切惡業皆悉捨離，乃至不起微塵等惡，唯於惡業見則怖畏。",
        "translation": "When someone believes in the fruit of karma, all bad actions are abandoned, even when they don't undertake such evils as the least particle, and only when they see bad actions do they become frightened.",
        "source": "T17n0721_037:0218b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人善業、不善業果，一切皆知。",
        "translation": "That person knows the results of all good and bad actions.",
        "source": "T17n0721_037:0218c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人知已，造作善業，捨不善業。",
        "translation": "After knowing this, he creates good actions and abandons unskillful actions.",
        "source": "T17n0721_037:0218c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人恒常習作善業，身壞命終得生天上。",
        "translation": "That person always cultivates good actions, and when his body breaks up and his life ends, he'll be born up in heaven.",
        "source": "T17n0721_037:0218c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「若知業果者，　　常見微細義，　　　彼惡所不染，　　如空泥不污。」",
        "translation": "Here's a verse that says, \"'If someone knows the results of actions, they often have subtle meanings that are undefiled by evil, like empty mud that isn't defiled.'\"",
        "source": "T17n0721_037:0218c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『牟修樓陀！",
        "translation": "\"'Mucilinda!",
        "source": "T17n0721_037:0218c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者復是十二天道，而著彼道得到天上？",
        "translation": "What are the twelve heavenly paths again, and what are the twelve paths to which one adheres and attains heaven?",
        "source": "T17n0721_037:0218c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於三寶深心信敬，不顛倒信。",
        "translation": "It's a deep-rooted, whole-hearted faith in the Three Treasures that isn't mistaken.",
        "source": "T17n0721_037:0218c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於三寶深心信敬，不顛倒故，無量功德。",
        "translation": "Because they deeply believe in and revere the Three Treasures and aren't mistaken, their merits are measureless.",
        "source": "T17n0721_037:0218c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多有無量百百功德，此一功德，則勝一切諸餘功德。",
        "translation": "There are measureless hundreds of virtues, and this one virtue is superior to all the others.",
        "source": "T17n0721_037:0218c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此丈夫先受人樂，終到涅槃；謂天、天女不放逸行，若放逸天，非世間樂、非出世樂。",
        "translation": "It means that this man first experiences human happiness and eventually reaches nirvāṇa, and it means that gods and goddesses don't engage in careless behavior, and if they did, those gods would have neither worldly nor transmundane happiness.",
        "source": "T17n0721_037:0218c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，牟修樓陀！",
        "translation": "For this reason, Mucilinda!",
        "source": "T17n0721_037:0218c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼大仙名迦那迦牟尼世尊，如是為彼夜摩天王樂見說法。",
        "translation": "Thus, that great sage called the World Honored One Kanakamuni thus explains the teaching to that Yama Heavenly King with joy and insight.",
        "source": "T17n0721_037:0218c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼如是法，一切如來法皆如是，更不異法，如汝於前舊天所聞。",
        "translation": "Thus is his teaching, and so are all the Tathāgatas' teachings, and there's no different teaching than the one you heard in the old heavens.",
        "source": "T17n0721_037:0218c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有偈言：「『「深心信三寶，　　無量數勤修，　　　於先得生天，　　終得涅槃果。」",
        "translation": "Here's a verse that says, \"'Deeply believing in the Three Treasures and diligently cultivating them for measureless times, I was first born in heaven and eventually attained the fruit of nirvāṇa.'\"",
        "source": "T17n0721_037:0218c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『此等則是十二天道，恒常修行，如是必定得果不疑。』",
        "translation": "\"'These are the twelve heavenly paths that are constantly cultivated, and there's no doubt that they'll surely be realized this way.'",
        "source": "T17n0721_037:0218c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天王牟修樓陀并八萬天，從佛世尊聞此法門，聞已皆得須陀洹果。",
        "translation": "It was then that the god king Mucilinda and 80,000 gods heard this teaching from the Bhagavān, and after hearing it, they all attained the fruit of stream entry.",
        "source": "T17n0721_037:0218c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，天王牟修樓陀禮世尊足，而說偈言：「『我得脫惡道，　　依於佛世尊，　　一切天孤獨，　　如來法救度。",
        "translation": "\"King Mucilinda then bowed his head to the Bhagavān's feet and spoke in verse, saying, \"I got rid of the bad destinies because of the Bhagavān, and all the gods were alone, saved by the Tathāgata's teaching.",
        "source": "T17n0721_037:0218c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我朝日得果，　　入於佛法中，　　共天如是入，　　過生死畏處。』",
        "translation": "Someday I'll attain fruition, enter the Buddha's teaching, and share with the gods such an entry, passing through the fearful place of birth-and-death.'",
        "source": "T17n0721_037:0218c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「牟修樓陀如是說已，飛昇虛空，并諸天眾向夜摩天所居地處。",
        "translation": "\"After Mucilinda said this, he soared into the sky and the gods headed for the Yama gods' dwelling place.",
        "source": "T17n0721_037:0218c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天一切如是皆到，既到天中，猶故受樂，遊行嬉戲。",
        "translation": "All of the gods there thus reached them, and once they arrived, they still enjoyed themselves and paraded around.",
        "source": "T17n0721_037:0218c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一生命業盡已則退，惡道閉塞。",
        "translation": "Once a person's life's work is done, they regress, and the evil destinies are closed off.",
        "source": "T17n0721_037:0218c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生於人中，第一富樂、第一端正，有勝大心，一切國土於中皆勝。",
        "translation": "Being born among humans, they're the most prosperous and correct, and they have a superior, great mind, and all their lands are superior to them.",
        "source": "T17n0721_037:0219a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有非是須陀洹者，彼天退已，如其業行，或生地獄、餓鬼、畜生。",
        "translation": "If there's someone who isn't a stream entrant, then after they retire from that heaven, they'll be born in hell, a hungry ghost, or an animal, depending on their actions.",
        "source": "T17n0721_037:0219a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若餘業故，得生人中，彼亦如是得大富樂，種種莊嚴。",
        "translation": "If they are born among men because of other actions, they too will thus attain great wealth and happiness and various kinds of adornment.",
        "source": "T17n0721_037:0219a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以餘業故。",
        "translation": "It's because of other actions.",
        "source": "T17n0721_037:0219a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察夜摩天中所有地處。",
        "translation": "\"Knowing the results of his actions, that monk then observes all the places on the ground in the Yama Heaven.",
        "source": "T17n0721_037:0219a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：夜摩天中復有地處，彼處名為乘處遊行。",
        "translation": "He sees and hears and knows: 'There's another ground in the Yama Heaven, which is called the vehicle-field procession.",
        "source": "T17n0721_037:0219a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生彼地處？",
        "translation": "What actions of sentient beings give rise to that ground?",
        "source": "T17n0721_037:0219a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：若人善心，善深直心，不殺盜婬。",
        "translation": "They see and hear and know, \"Suppose someone has a good heart, a good, deep, and straight mind, and doesn't kill, steal, or commit sexual misconduct.",
        "source": "T17n0721_037:0219a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人善業，身壞命終生彼地處。",
        "translation": "That person's good actions cause them to be born in that place when their body breaks up and their life ends.",
        "source": "T17n0721_037:0219a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始生彼時，即見天中種種樹林、清流水河、蓮花池等，勝妙殊異甚可愛樂。",
        "translation": "When they are first born there, they immediately see a heaven with a variety of trees, clear-flowing rivers, and lotus-flower ponds that are marvelous, wonderful, and highly desirable.",
        "source": "T17n0721_037:0219a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾鳥音聲，聞香知味觸等皆勝，可愛可樂。",
        "translation": "The sounds of birds and the smells, tastes, and tactile objects are all excellent, lovely, and enjoyable.",
        "source": "T17n0721_037:0219a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「見彼妙色、聞妙聲等，作如是言：『今此所見種種樹林，種種可愛清流水河、蓮花池等，種種妙色昔所未有，甚為可愛、甚為可樂，有無量種，更無相似，心叵厭足。",
        "translation": "\"Seeing those wonderful forms and hearing those wonderful sounds, they say, 'Now, what they see here are various groves of trees, rivers of lovely clear water, and ponds of lotus blossoms, and various wonderful forms that weren't there in the past, which are very desirable and very pleasant, and there are measureless kinds that have nothing like them, so their minds aren't satisfied.'",
        "source": "T17n0721_037:0219a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此所聞種種歌聲、眾鳥音等，悉皆勝妙昔所未有，甚為可愛、甚為可樂，有無量種，更無相似，心叵厭足。",
        "translation": "The various songs and bird sounds that I've heard here are all wonderful, unprecedented, and very desirable, very pleasant, and have measureless kinds, and there's nothing like them, which doesn't make my mind weary.",
        "source": "T17n0721_037:0219a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今所聞香昔所未有亦甚可愛，亦甚可樂，有無量種，更無相似，心叵厭足。",
        "translation": "The fragrance I hear now is also unprecedented in the past, very desirable and pleasant, with measureless varieties, and there's nothing like it, which makes my mind unappetizing.",
        "source": "T17n0721_037:0219a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此味亦爾，昔所未有，亦甚可愛，亦甚可樂，有無量種，更無相似，心叵厭足。",
        "translation": "This taste, too, was unprecedented in the past, was also very desirable and pleasant, had measureless varieties, and had no resemblance, which the mind dislikes and is satisfied with.",
        "source": "T17n0721_037:0219a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此觸亦爾，昔未曾有，亦甚可愛，亦甚可樂，有無量種，更無相似，心叵厭足。』",
        "translation": "So is this tactile sensation, which never existed before, is also very desirable and pleasant, has measureless varieties, and has no resemblance, which the mind doesn't find disagreeable.'",
        "source": "T17n0721_037:0219a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天如是內心思惟五欲境界，念欲常得。",
        "translation": "Thus, the gods' minds contemplate the five objects of desire internally, remembering that desire is always attainable.",
        "source": "T17n0721_037:0219a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勝妙五境界樂，嬉戲遊行，心不厭足。",
        "translation": "Thus, they enjoy the five wonderful objects, playfully promenade about, and don't tire of being satisfied with them.",
        "source": "T17n0721_037:0219a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼處所有一切天女聞已語言：『此天世間，法常如是，一切境界一切常爾，無不樂處、無不樂時。",
        "translation": "\"When all the goddesses in that place hear this, they say, 'This celestial world is a world in which things are always like this, and all realms are always like this, with no place or time that's unpleasant.'",
        "source": "T17n0721_037:0219a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此勝相，處處普遍，具足皆有五欲功德，有無量種隨念皆得，常受天樂，更無與等。",
        "translation": "Such excellent features are prevalent everywhere, fully endowed with the five desirable qualities, and there are measureless ways to attain them at will and always experience the pleasures of the gods, with nothing beyond them.",
        "source": "T17n0721_037:0219a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天見此林已，生如是希有之心，何況入中。",
        "translation": "After seeing this forest, the gods will have such a rare state of mind, much less enter it.",
        "source": "T17n0721_037:0219b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀天王之前，復過於是。",
        "translation": "King Mucilinda was once again surpassed by this.",
        "source": "T17n0721_037:0219b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處九億那由他千種種莊嚴少色天女，歌舞具足，歡喜心面，五欲功德而為供養。",
        "translation": "There were 900 million nayutas of thousand kinds of adorned, little-colored goddesses there, singing and dancing in abundance, rejoicing in their hearts and faces, and making offerings with the five desirable qualities.",
        "source": "T17n0721_037:0219b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牟修樓陀夜摩天王如是受樂，夜摩天王牟修樓陀天子必見。",
        "translation": "When Yama King Mucilinda thus receives pleasure, Yama King Mucilinda must be seen by the god Son.",
        "source": "T17n0721_037:0219b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_037:0219b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此處境界，牟修樓陀夜摩天王則是其主，此一切天皆屬彼王，我等依之猶如父母，在此一切夜摩天中所有地處。』",
        "translation": "Here in this realm, Mucilinda, the king of the Yama heavens, is the lord, and all the gods belong to him, and we rely on him as if he were our father and mother, who occupy all the stages in the Yama heavens.'",
        "source": "T17n0721_037:0219b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼始生天，既聞此已，諸天女等而為圍遶，入彼林中。",
        "translation": "\"After they heard this, the first-born gods were surrounded by goddesses who went into the forest.",
        "source": "T17n0721_037:0219b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既入林已，見下中色種種形服莊嚴諸天，一切皆受五欲功德。",
        "translation": "Once they entered the forest, they saw the gods in the lower regions adorned with various forms and clothing, all of which are endowed with the five desirable qualities.",
        "source": "T17n0721_037:0219b10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行食俱樂，一切皆有五功德食。",
        "translation": "At their eating clubs, they all had food with the five virtues.",
        "source": "T17n0721_037:0219b11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見彼遊戲，多有無量諸天女眾共餘諸天美聲語說，無量百千種種功德而為莊嚴。",
        "translation": "Seeing them play, there are measureless goddesses who speak with the other gods in beautiful voices, adorned by measureless hundreds of thousands of various virtues.",
        "source": "T17n0721_037:0219b12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有七寶妙樹莊嚴，復有種種行樹莊嚴。",
        "translation": "They're also adorned by a marvelous tree of seven treasures, and they're adorned by various trees of practice.",
        "source": "T17n0721_037:0219b14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處多有隨憶念樹，天有所念，從彼樹得，如是具足功德寶樹。",
        "translation": "There are many trees of recollection in that place, and whatever the gods think of, they get from that tree, which is a jeweled tree replete with such virtues.",
        "source": "T17n0721_037:0219b15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼始生天，有無量種勝妙功德皆悉具足，五境界樂亦皆具足。",
        "translation": "When they are first born in that heaven, they are fully endowed with measureless kinds of wonderful qualities, and they are fully endowed with the five objects and pleasures.",
        "source": "T17n0721_037:0219b16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天見已，眼著甚樂，生勝愛樂，處處遍見。",
        "translation": "When that god sees that, his eyes are focused on something very pleasant, which gives rise to feelings of superior delight, and he sees it everywhere.",
        "source": "T17n0721_037:0219b18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見已，共諸天女入彼大林，入大林已，豐飲食河百千莊嚴，種種色鳥、種種音聲。",
        "translation": "After seeing this, they and the goddesses enter that great forest, and when they do, they are rewarded with food and drink, a hundred thousand adornments, various colors, and birds, and various sounds.",
        "source": "T17n0721_037:0219b19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女歌聲普遍，耳聞其樂，與鳥合聲。",
        "translation": "The goddesses' songs were so loud and universal that their ears heard their music, and they combined their voices with those of the birds.",
        "source": "T17n0721_037:0219b21_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼始生天，復於異處見蓮華林，希有殊妙，長三由旬，廣二由旬。",
        "translation": "\"Once again, they were first born in a heaven and saw a lotus forest in a different place that was rare and marvelous, three leagues long and two leagues wide.",
        "source": "T17n0721_037:0219b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見彼大林有金蓮花，無量形相，有無量色以為莊嚴。",
        "translation": "They see that large forest with golden lotus flowers of measureless shape and form, adorned with measureless colors.",
        "source": "T17n0721_037:0219b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如秋時，虛空之中諸曜莊嚴，如是如是。",
        "translation": "It's like in autumn when the sky is adorned with brilliant lights, such as this and that.",
        "source": "T17n0721_037:0219b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百千天女多饒具足，歌舞遊戲，五樂音聲，受諸快樂，迭相心念，迭相附近，一念不離，恒常一心，迭相愛樂。",
        "translation": "One hundred thousand goddesses are abundantly supplied with songs, dances, games, and the five musical sounds, and they experience pleasure, repeated mindfulness, repeated proximity, single-mindedness, constancy, and single-mindedness, and repeated delight.",
        "source": "T17n0721_037:0219b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見園林中處處多有歡喜天眾，亦見多有種種鳥群，迭共戲樂，迭相愛念，迭相附近，一念不離，恒常一心，迭相愛樂。",
        "translation": "They see a garden full of joyful gods and a multitude of birds playing together, loving each other's company, being near each other, united in thought, and constantly unified in their desire for each other.",
        "source": "T17n0721_037:0219b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是天等遊戲受樂，鳥亦如是。",
        "translation": "As the gods and others play and enjoy themselves, so do the birds.",
        "source": "T17n0721_037:0219c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鵝鴨鴛鴦如是等鳥有無量種，無量群眾在蓮華林清淨水中，處處遊戲於彼河岸。",
        "translation": "There are measureless species of geese, ducks, pearls, and such birds, and measureless flocks of them are playing everywhere on the bank of that river in the pure waters of the lotus grove.",
        "source": "T17n0721_037:0219c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其處有天摘取金葉用飲天酒，共天女眾歌舞遊戲，受種種樂。",
        "translation": "There, a god plucks gold leaves and drinks the celestial wine, and they sing, dance, and play with the goddesses, enjoying various pleasures.",
        "source": "T17n0721_037:0219c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復摘銀葉用飲赤酒，酒色猶如蓮花寶色，香味清冷一切具足，共諸天女歌戲受樂。",
        "translation": "They also pick silver leaves and use them to drink red wine the color of a lotus flower's jeweled wine, which has a crisp, cool, and refreshing aroma, and they sing, dance, and play with the goddesses, enjoying a variety of pleasures.",
        "source": "T17n0721_037:0219c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自善業力之所感致。",
        "translation": "It's the result of their own good karma.",
        "source": "T17n0721_037:0219c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有異天亦在彼處蓮花林中極可愛處，如是諸天五欲境界受諸快樂，摘青寶色蓮花之葉，共諸天女用飲天酒。",
        "translation": "There's another different god who's also in that very desirable place in the lotus-flower grove, so those gods experience the pleasures of the five realms of desire, pick leaves of the blue-brown lotus, and drink the celestial wine with the goddesses.",
        "source": "T17n0721_037:0219c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有異天入彼樹下，天華所覆，既飲天酒，怡然快樂，於園林中共諸天女遊行放逸，飲色香味天果美汁，歡喜歌笑。",
        "translation": "Another god enters that tree, covered by flowers, and is delighted and happy as he drinks the celestial wine, parades through the grove with the goddesses, and drinks the delicious juice of celestial fruits of color and odor, rejoicing and laughing.",
        "source": "T17n0721_037:0219c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有異天金銀玻瓈、青寶樹枝覆蔭為舍，共諸天女歌笑嬉戲，受天快樂。",
        "translation": "Another different god, covered by branches of a gold, silver, and blue-jeweled tree, makes a shelter, and they sing, laugh, and play with the goddesses, enjoying the gods' happiness.",
        "source": "T17n0721_037:0219c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有異天依止河岸鳥音聲處，在柔軟地、妙觸之地其處生華，摘取彼華。",
        "translation": "Another god relies on the sound of birds on the river bank, where flowers are produced on the soft ground and on the ground of delicate touch, and he picks those flowers.",
        "source": "T17n0721_037:0219c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其華五色，有別、有合。",
        "translation": "Those flowers are five colors, and there's a distinction between them and a combination.",
        "source": "T17n0721_037:0219c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共諸天女取已嗅之，彼諸天女近於天子歌舞戲笑。",
        "translation": "After picking them up with the goddesses and smelling them, the goddesses approach the sons of gods to sing, dance, and laugh.",
        "source": "T17n0721_037:0219c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有異天在種種寶石地之上，所謂青寶、玻瓈金銀，如是地處嬉戲遊行受諸快樂。",
        "translation": "There's another god on top of a ground of various precious stones called emerald or gold and silver, where they play and promenade around and enjoy such pleasures.",
        "source": "T17n0721_037:0219c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至集作愛善業盡，善業盡已，於彼處退。",
        "translation": "It's until the collection of craving for good actions is ended, and after those good actions are ended, they retreat from that place.",
        "source": "T17n0721_037:0219c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處退已，墮於惡道，生在地獄、餓鬼、畜生。",
        "translation": "After retreating from that place, they fall into a bad destiny and are born in hell, a hungry ghost, or an animal.",
        "source": "T17n0721_037:0219c22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有餘業，得生人中，常生樂處，則有第一端正之色，大心大富，得為國主。",
        "translation": "If someone with other actions attains birth among humans and is always born in a happy place, they'll have the best good looks, a great heart, and great wealth, and they'll become the head of their country.",
        "source": "T17n0721_037:0219c23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以餘業故。",
        "translation": "It's because of the remaining karma.",
        "source": "T17n0721_037:0219c24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察夜摩天中所有地處。",
        "translation": "\"Knowing the results of his actions, that monk then observes all the places on the ground in Yama Heaven.",
        "source": "T17n0721_037:0219c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有地處，彼處名為雲處遊行。",
        "translation": "He sees and hears and knows that there's another ground, which is called the cloud procession.",
        "source": "T17n0721_037:0219c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生彼地處？",
        "translation": "What actions of sentient beings produce that ground?",
        "source": "T17n0721_037:0219c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：若人直心，本性正直，信於三寶，不殺不盜，不行一切不善邪行——不樂、不行亦不多作。",
        "translation": "\"They see and hear and know: 'Suppose a person's mind is straight, their nature is correct, they believe in the Three Treasures, don't kill or steal, and don't engage in all unskillful and wrongful actions-that they don't enjoy or do, and don't do any more.",
        "source": "T17n0721_037:0219c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸婦女，乃至不生欲意之心，不念婬欲，捨婬欲心，亦不分別，猶如捨毒。",
        "translation": "He sees women, doesn't even give rise to thoughts of desire, doesn't think about lust, and doesn't abandon lustful thoughts or discriminate them, just as he would abandon poison.",
        "source": "T17n0721_037:0220a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善男子身壞命終生夜摩天，在彼雲處遊行之處。",
        "translation": "That good man's body breaks up and his life ends, and he's born in the Yama Heaven, where he travels around in clouds.",
        "source": "T17n0721_037:0220a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生彼處已，身之光明與日不異，受善業樂、受無比樂，無量境界受諸快樂。",
        "translation": "After being born there, his body's light isn't different from the sun's, and he experiences the happiness of good actions, the incomparable happiness, and the pleasure of measureless realms.",
        "source": "T17n0721_037:0220a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即初生時，甚大歡喜，心生思惟：『我今云何獨在此處？』",
        "translation": "When he was first born, he was overjoyed and thought, 'How could I be alone in this place?'",
        "source": "T17n0721_037:0220a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即生念時，見諸天女在樹林中。",
        "translation": "When he immediately gives rise to that thought, he sees goddesses in a forest of trees.",
        "source": "T17n0721_037:0220a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹種種枝，具足寶鈴，鈴有妙聲。",
        "translation": "There are trees of various species and branches, replete with jeweled bells, and the bells have a wonderful sound.",
        "source": "T17n0721_037:0220a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地色猶如火洋真金，地處有如銀玻瓈色，多有百千妙蓮花池以為莊嚴。",
        "translation": "The ground is colored like fiery seas and true gold, and its surface is colored like silver and decorated with pools of a hundred thousand wonderful lotus flowers.",
        "source": "T17n0721_037:0220a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地分處林樹柔軟，有百千鳥出美妙聲。",
        "translation": "There's a part of the ground where the trees are soft and gentle, and there are a hundred thousand beautiful sounds coming from birds.",
        "source": "T17n0721_037:0220a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸天女如是林中遊戲受樂，即彼天子心生念時，林間速出妙莊嚴具而自莊嚴。",
        "translation": "When those goddesses thus play in the forest and experience pleasure, the gods quickly produce marvelous adornments in the forest to adorn themselves when their minds are made up.",
        "source": "T17n0721_037:0220a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以蓮花鬘莊嚴其頭，其身皆著種種色衣，到天子所。",
        "translation": "They adorn their heads with lotus garlands, and their bodies are covered in robes of various colors as they approach the celestial son.",
        "source": "T17n0721_037:0220a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既到近已，種種莊嚴而圍遶之，詠種種歌，微妙音聲心極愛染，娛樂天子。",
        "translation": "When he arrived, he was surrounded by various adornments, sang various songs, and entertained the celestial with the subtle sounds of his heart's desire.",
        "source": "T17n0721_037:0220a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量樂具，具足而有，彼諸天女如是種種娛樂天子。",
        "translation": "With measureless instruments of pleasure in abundance, those goddesses entertain the gods' sons in this way.",
        "source": "T17n0721_037:0220a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是天子於彼天女本未曾見，既得見已，如是思惟：『此是何人？",
        "translation": "Having never seen such a goddess before, the godson then sees her and thus considers, 'Who is this?'",
        "source": "T17n0721_037:0220a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從何處來？",
        "translation": "Where did it come from?",
        "source": "T17n0721_037:0220a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫屬於誰？",
        "translation": "To whom are they bound?",
        "source": "T17n0721_037:0220a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為誰而來？』",
        "translation": "For whom have you come?'",
        "source": "T17n0721_037:0220a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「既來見已，見其具有種種色衣，有種種寶莊嚴其身，其手執持無量樂器，且少分喻。",
        "translation": "\"After he came to see them, he saw that they had robes of various colors, were adorned with various treasures, and were holding measureless musical instruments in their hands, and they spoke little metaphors.",
        "source": "T17n0721_037:0220a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何處何處三十三天所有天女歌樂之聲，不得為比，何況三種功德具足，無量善業所得之果。",
        "translation": "There's no comparison to the sound of the music of the Trāyastriṃśa goddesses wherever or by whom they sing, let alone the three virtues they possess and the result of measureless good actions.",
        "source": "T17n0721_037:0220a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜摩天女於彼三十三天天女歌詠音聲甚為殊勝，色少勢力、身之形量、歌聲樂受、園林諸樹、流水河池、須陀之食、勝妙堂舍、戲樂之處一切皆勝。",
        "translation": "The divine goddess Yama's song and voice of the Trāyastriṃśa goddesses is so extraordinary that it's superior in appearance, small size, strength, physical appearance, the enjoyment of song, gardens and trees, flowing rivers and ponds, food from the god Sudhas, excellent and wonderful halls, and places of play and pleasure.",
        "source": "T17n0721_037:0220a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上上次第乃至他化自在天中，色少勢力、身之形量、歌聲受樂如是等事，一切皆勝。",
        "translation": "In the higher order up to the paranirmita-vaśavartin Heaven, such things as small form and strength, physical appearance, song and sound, and sensation are all superior.",
        "source": "T17n0721_037:0220a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_037:0220a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "業果重故。",
        "translation": "The results of their actions are heavy.",
        "source": "T17n0721_037:0220a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心戒清淨，無垢染故。",
        "translation": "Their minds are purified of morality, and they're unsullied by defilement.",
        "source": "T17n0721_037:0220a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此夜摩天如是天女不可比類，一切具足。",
        "translation": "This Yama goddess is incomparable to such a goddess and is fully endowed with everything.",
        "source": "T17n0721_037:0220b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼如是處有二種過，謂無常、欲，唯有少分微樂可說。",
        "translation": "\"In such a place as this, there are two kinds of faults, namely, impermanence and desire, and only a small measure of subtle pleasure that can be described.",
        "source": "T17n0721_037:0220b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若愚癡人受持禁戒，悕望於有，作如是心：『願我持戒得生天中。』",
        "translation": "If a foolish person observes the prohibited precepts and hopes for existence, they think, 'May I observe the precepts and be born among the gods.'",
        "source": "T17n0721_037:0220b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為迴彼心，我說：無常、退及愛離，如是等過。",
        "translation": "To convert that mind, I say, 'Such are the faults of impermanence, retrogression, and separation from what's loved.'",
        "source": "T17n0721_037:0220b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_037:0220b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若起少心悕望於有，一切善法皆悉散失。",
        "translation": "If they give rise to a small amount of mind desiring existence, all the good qualities will be lost.",
        "source": "T17n0721_037:0220b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切有中，無處常者。",
        "translation": "Among all existences, there's no place for permanence.",
        "source": "T17n0721_037:0220b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下上傍廂，若常不動、不破壞者，無有是處。",
        "translation": "If the lower, upper, and lower compartments are permanent and unmoving, and they don't break down, there's no place for them.",
        "source": "T17n0721_037:0220b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切分別無不分別，以此因緣，說彼天報非可愛處。",
        "translation": "All discrimination is without nondiscrimination, and for this reason, it's said that the reward of those gods is not a desirable position.",
        "source": "T17n0721_037:0220b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼處諸天女等圍遶如是始生天子，歌舞遊戲種種娛樂。",
        "translation": "\"At the time, the goddesses there surrounded the firstborn god as he did, singing, dancing, and playing various entertainments.",
        "source": "T17n0721_037:0220b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天子本未曾見，心自思惟：『此屬於誰，而來近我？』",
        "translation": "At the time, the prince, who had never seen it before, thought to himself, 'Who does this belong to that's come near me?'",
        "source": "T17n0721_037:0220b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨彼天子心之所念，即心念時，以善業故，彼天女言：『天為我主，何以不共我等語說？",
        "translation": "When he is mindful, that is, when he is mindful, because of good actions, the goddess says, 'Why doesn't the gods speak with us, since they are my lords?'",
        "source": "T17n0721_037:0220b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天是我夫，隨天所須，我為給使，令天受樂。』",
        "translation": "'The gods are my husband, and I will be their messenger as they need me to cause them to experience pleasure.'",
        "source": "T17n0721_037:0220b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼天子既得聞已，作如是言：『汝若屬我，今可來近在此林中，何以故？",
        "translation": "After he heard this, the god heard him say, 'If you belong to me, you could come near here in the forest now; why is that?'",
        "source": "T17n0721_037:0220b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之天處是受樂地。",
        "translation": "'This heavenly abode is a ground of enjoyment.",
        "source": "T17n0721_037:0220b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生此天者，此處受樂。』",
        "translation": "Being born in this heaven, this place is pleasant.'",
        "source": "T17n0721_037:0220b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼天女即抱天子，無量種種受快樂已。",
        "translation": "The goddess then embraced the son of the gods and gave him measureless ways to experience happiness.",
        "source": "T17n0721_037:0220b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天女復起作如是言：『我共天子在園林中處處遊行。",
        "translation": "The goddess then got up and said, 'I've been parading around in the grove with the son of god.",
        "source": "T17n0721_037:0220b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此園林中多饒無量種種天眾，隨眼所見種種可愛種種諸鳥音聲可樂，多有種種流水河池、蓮花莊嚴，多有百千種種山峯。",
        "translation": "In this grove there are measureless multitudes of gods, as many lovely things as the eye can see, many birds with pleasant sounds, many flowing streams and ponds, lotus-flower adornments, and a hundred thousand different kinds of mountains and peaks.",
        "source": "T17n0721_037:0220b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其峯高峻，種種七寶，多有光明莊嚴山峯。",
        "translation": "Their peaks are high and high, and they are filled with a variety of seven treasures and many mountains and peaks adorned with light.",
        "source": "T17n0721_037:0220b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種山谷處處嚴好，多有種種諸鳥音聲。",
        "translation": "The various valleys are beautiful in every place, and there are lots of various bird sounds.",
        "source": "T17n0721_037:0220b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在地處處有池莊嚴，如是功德悉皆具足。",
        "translation": "Everywhere on the ground there are pools of water adorned with such attributes.",
        "source": "T17n0721_037:0220b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我共天子俱行遊戲，受諸欲樂。』",
        "translation": "Together with the sons of gods, we engage in play and experience desires and pleasures.'",
        "source": "T17n0721_037:0220b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，如是始生天子從彼天女聞是語已，語天女言：『我隨汝意，皆如是作。』",
        "translation": "After hearing this from the goddess, the firstborn god heard her say, and he said to her, 'I will do as you wish.'",
        "source": "T17n0721_037:0220b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是說已，起彼坐處，為受樂故。",
        "translation": "After speaking thus, he got up from his seat and sat there for the purpose of experiencing pleasure.",
        "source": "T17n0721_037:0220b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切天女共彼天子園林中行，種種音聲天寶樂器在手執持，共彼天子遊行放逸。",
        "translation": "All the goddesses walked with the godson in the grove, holding in their hands various musical instruments and treasures, and they paraded with him in dissipation.",
        "source": "T17n0721_037:0220b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，天子共彼天女遊行放逸，復有其餘天子、天女共行遊戲合會相逢。",
        "translation": "\"At the time, the gods' sons and goddesses were marching and dissipating together, and there were other gods' sons and goddesses walking and playing together, and they met each other in a joint venture.",
        "source": "T17n0721_037:0220c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二天子見則相愛迭共語說，彼此天女亦復如是，心迭相愛，一切和合，復向異林。",
        "translation": "When the two gods saw them, they loved each other and spoke together, and so did the other goddess, so their minds loved each other, and they all merged, again heading for a different forest.",
        "source": "T17n0721_037:0220c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是林者，名戲樂林，彼林之量三千由旬，彼林無量有百千億那由他數。",
        "translation": "Such a forest is called a pleasure forest, and its size is 3,000 leagues, and there are measureless hundreds of billions of nayutas in that forest.",
        "source": "T17n0721_037:0220c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天子眾滿彼林中，如歡喜林曠野無異，如是具足種種功德，名戲樂林。",
        "translation": "The multitude of celestials filling that forest is like a joyful forest in the wilderness, and it's called a forest of pleasure because it's thus replete with various attributes.",
        "source": "T17n0721_037:0220c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天遊行處種種具足。",
        "translation": "The gods' processional site is replete with all kinds of things.",
        "source": "T17n0721_037:0220c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼兩朋天，共見彼處皆悉本來未如是見亦未曾聞，不可譬喻。",
        "translation": "Those two friends of the gods see together a place there that's all originally unseen and unheard of, which cannot be described.",
        "source": "T17n0721_037:0220c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見彼林已，生歡喜心，面眼目等皆有喜狀。",
        "translation": "After seeing that forest, they become joyous, and their faces, eyes, and eyebrows all have the appearance of joy.",
        "source": "T17n0721_037:0220c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時始生天及其天女即語彼天，作如是言：『此如是等，昔來未見。』",
        "translation": "The first-born god and his goddess then said to those gods, 'Such is the case, which has never been seen before.'",
        "source": "T17n0721_037:0220c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是說已，兩朋天子、兩朋天女頭著天鬘，身塗栴檀坐天堂殿，上昇虛空，歌舞喜笑迭共遊戲，相與共詣牟修樓陀夜摩天王。",
        "translation": "After they said this, the two fellow gods and the two fellow goddesses sat with their heads covered in divine garlands and their bodies coated with sandalwood in the heavenly palace, ascended into the sky, singing, dancing, laughing, and playing together, and they both went up to King Muxiu Lutra of Yama.",
        "source": "T17n0721_037:0220c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是上去，復有餘天并其天女，手執蓮花坐天之處，上昇虛空，歌舞喜笑迭共戲樂，相與共詣牟修樓陀夜摩天王。",
        "translation": "Up there, another goddess and another goddess holding a lotus flower in their hands sat in a celestial palace, ascended into the sky, danced, laughed, and played together, and they all went to King Muxiu Lutra of Yama Heaven.",
        "source": "T17n0721_037:0220c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦爾上去，復有餘天能微細行，手執箜篌，能穿無量百千山過，行不障礙。",
        "translation": "Also up there, another god was able to walk delicately, carrying a harp in his hand, and penetrating measureless hundreds of thousands of mountains without obstructing his path.",
        "source": "T17n0721_037:0220c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共諸天女歌舞嬉戲，亦復向彼牟修樓陀夜摩天王所住殿舍，心生歡喜。",
        "translation": "They were accompanied by goddesses who sang, danced, and played, and they also rejoiced in their hearts as they went to the palace where King Muxiu Lutra Yama was staying.",
        "source": "T17n0721_037:0220c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦爾上去，復有餘天於虛空中雨諸天花，共諸天女歌舞嬉戲，亦復向彼牟修樓陀夜摩天王所住殿舍。",
        "translation": "Up there, some other gods rained smallpoxes in the sky, and they partied and danced with the goddesses while they went to the palace where King Mucilinda-deva was staying.",
        "source": "T17n0721_037:0220c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦爾上去，彼始生天如是無量種種差別，無量遊戲皆悉具見，亦共同行，在天女前如是而行。",
        "translation": "Going up there, the first-born gods with their measureless variety and innumerable games were all seen together, and they also traveled together, walking in front of the goddesses like this.",
        "source": "T17n0721_037:0220c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼無量天皆以美語共其言說。",
        "translation": "Those measureless gods all spoke together with them in beautiful words.",
        "source": "T17n0721_037:0220c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，如是始生天子遙見遠處有勝光明，過百千日，自餘凡夫眼不能觀。",
        "translation": "\"At the time, the firstborn celestial then saw from afar a brilliant light in a distant place that lasted a hundred thousand days and couldn't be seen by the eyes of ordinary people.",
        "source": "T17n0721_037:0220c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復聞彼處無量音聲，聲有四種：一者相應；二者真正；三者和合；四者平等。",
        "translation": "He also hears measureless sounds from that place, which have four kinds: one that's associated, two that's genuine, three that's combined, and four that's equal.",
        "source": "T17n0721_037:0221a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是音聲彼天聞已，心生歡喜問天女言：『今見彼處勝妙可愛，有大光明在於彼處，如是遙見。",
        "translation": "After hearing such sounds, the goddess rejoiced and asked the goddess, 'Now, I've seen something wonderful and lovely there, and there's a great radiance in that place that I can see from afar like this.",
        "source": "T17n0721_037:0221a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處如是勝上音聲，美妙平等和合歌聲，復有舞戲，云何如是？』",
        "translation": "How is it that there's such a superior sound, such a beautiful, equal, harmonious singing, and such dancing?'",
        "source": "T17n0721_037:0221a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天女即便語彼始生天子作如是言：『夜摩天王彼處受樂，多有無量百千天眾，復有無量諸天女眾，一切天眾之所讚歎。",
        "translation": "Even then, the goddess said to the firstborn god child, 'The Yama god king is delighted there, where there are measureless hundreds of thousands of gods and measureless multitudes of goddesses, and all the gods praise him.",
        "source": "T17n0721_037:0221a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如兜率寂靜天王，受天之樂。』",
        "translation": "It's like Tuṣita, the king of the quiescent gods, who receives the pleasure of the gods.'",
        "source": "T17n0721_037:0221a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，如是始生天子既聞是語，則生第一希有之心，如是念言：『除寂靜王，如是受樂，更有何處如是受樂？』",
        "translation": "\"At the time, when the firstborn god heard those words, he had the first rarefied thought and said, 'Besides the king of quiescence, where else does he thus experience bliss?'",
        "source": "T17n0721_037:0221a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼如是始生天子既思念已，語天女言：『誰名寂靜？",
        "translation": "After he had reflected on this, the first-born celestial said to the goddess, 'Who is called quiescent?'",
        "source": "T17n0721_037:0221a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於何處住？",
        "translation": "Where should I stay?",
        "source": "T17n0721_037:0221a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見此已，當往見之。』",
        "translation": "'After I see this, I will go and see it.'",
        "source": "T17n0721_037:0221a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼天女聞其語已，心則思惟作如是念：『此始生故，不知更有大勢力，故作如是言：「我見寂靜。」』",
        "translation": "When the goddess heard what she said, she reflected on it and thought, 'Because of this first birth, I don't know that there's more great power, so I said, 'I see tranquility.'",
        "source": "T17n0721_037:0221a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼天女復語之言：『兜率陀天在我之上，於我為勝，過百千倍。",
        "translation": "The goddess then again said, 'The Tuṣita Heaven is higher than me, and it's a hundred thousand times better than me.",
        "source": "T17n0721_037:0221a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之所有受用之樂，一切業果皆悉殊勝。",
        "translation": "All the pleasures I experience and the results of all my actions are superior.'",
        "source": "T17n0721_037:0221a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於此處夜摩天王威德勢力及餘一切，種種皆勝，在我上住。",
        "translation": "Here, Yama, the king of gods, with his authority, virtue, strength, and all the rest, is superior in every way, and he's staying above me.",
        "source": "T17n0721_037:0221a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡天皆不能往，非其境界。",
        "translation": "All ordinary gods can't go there, and it's not their realm.",
        "source": "T17n0721_037:0221a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天一切於我皆勝，若天具有福德之力、大神通力則能往到，非一切天皆能到彼。』",
        "translation": "All of the gods there are superior to me, but if they have the power of virtue and great supernormal powers, they'll be able to go there, not all of them.'",
        "source": "T17n0721_037:0221a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法念處經卷第三十七",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 37",
        "source": "T17n0721_037:0221a25_0",
        "is_bad_quality": false
    }
]