[
    {
        "source_sentence": "佛說四願經",
        "translation": "Sutra on the Four Vows Spoken by the Buddha",
        "source": "T17n0735_001:0536b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吳月支國居士支謙譯",
        "translation": "Translated by Zhi Qian, a householder of Wu Yuezhi country",
        "source": "T17n0735_001:0536b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在拘夷那竭國，與五百比丘僧，坐於尼延樹下，為數千萬人說法。",
        "translation": "Thus I have heard: One time, the Buddha was in the country of Kuśinagara, sitting under the Nirgrantha tree with 500 monks and was preaching to tens of millions of people.",
        "source": "T17n0735_001:0536b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是城中有豪長者，財富無數，名曰純陀。",
        "translation": "Then there was a wealthy man in that city with incalculable possessions named Cunda.",
        "source": "T17n0735_001:0536b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀有子，厥年十四，時得重病，不免所疾，遂便喪亡。",
        "translation": "Cunda had a son who was 14 years old when he became seriously ill and was unable to avoid his illness, so he died.",
        "source": "T17n0735_001:0536b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母、兄弟、宗親中外莫不愛重，啼哭憂愁，安可言乎！",
        "translation": "He was loved by his parents, brothers, clansmen, and everyone outside, and he lamented and grieved.",
        "source": "T17n0735_001:0536b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時純陀聞佛來化，心大歡喜，便告其妻言：「今佛在此，宜當往見。",
        "translation": "When he heard that the Buddha had come to convert him, Cunda was overjoyed and told his wife, \"Now that the Buddha is here, you should go see him.",
        "source": "T17n0735_001:0536b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞佛說經法者，莫不解悅，忘憂除患！」",
        "translation": "Anyone who hears the Buddha teach the Dharma will be relieved and forget about sorrow and trouble!\"",
        "source": "T17n0735_001:0536b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即與其妻、親族、僕使俱到佛所，為佛作禮，却坐一面。",
        "translation": "He went to the Buddha with his wife, his relatives, and his servant, paid homage to him, and withdrew to sit to one side.",
        "source": "T17n0735_001:0536b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者純陀長跪叉手，前白佛言：「人在世間，積聚錢財，思慮勤苦，不敢衣食，不知布施、奉持經戒，無尊無卑。",
        "translation": "The elder Cunda knelt down with his palms together and said to the Buddha, \"Here in the world, people accumulate money and possessions, contemplate hard work, don't dare to clothe themselves, don't know how to give alms, uphold the sūtras and precepts, and have no respect or humility.",
        "source": "T17n0735_001:0536b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獲得如願者，或時命盡。",
        "translation": "If they obtain what they wish, their life may end.",
        "source": "T17n0735_001:0536b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母、兄弟、妻子、親屬啼哭愁毒，為其棺殮，遣送財寶、衣被、飲食，寧有益於死者不？」",
        "translation": "Would it be better for parents, brothers, wives, and relatives to lament and grieve over their coffins and send them treasure, clothing, and food, rather than for the deceased?\"",
        "source": "T17n0735_001:0536c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告純陀及諸會弟子：「聽我所說，善思念之！」",
        "translation": "The Buddha told Cunda and the assembled disciples, \"Listen to what I've taught you and consider it well!\"",
        "source": "T17n0735_001:0536c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "純陀眷屬、諸會弟子皆各叉手，一心受教而聽。",
        "translation": "The members of Cunda's retinue and the assembled disciples all folded their arms, unified their minds, accepted the teaching, and listened.",
        "source": "T17n0735_001:0536c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人有四願，不可常保。",
        "translation": "The Buddha said, \"There are four vows a person makes that can't be permanently preserved.",
        "source": "T17n0735_001:0536c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T17n0735_001:0536c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第一願者，是人身。",
        "translation": "\"The person who has the highest vow is that person.",
        "source": "T17n0735_001:0536c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沐浴、莊飾、飯食、五樂常先與之，疾病卒至，不能止之。",
        "translation": "Bathing, adornment, food, and the five pleasures are always given to him first, and when illness strikes, it can't be stopped.",
        "source": "T17n0735_001:0536c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命盡，軀強在地，不隨人魂神去。",
        "translation": "When his life is up, his body is strong and remains on the ground, not following his soul and spirit.",
        "source": "T17n0735_001:0536c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空愛重之，復何益也！",
        "translation": "What good will it do to revere them as empty and desirable?",
        "source": "T17n0735_001:0536c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第二願者，謂有財產、官爵、俸祿。",
        "translation": "\"The second vow is to have possessions, an official title, and a salary.",
        "source": "T17n0735_001:0536c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得之者喜，不得愁憂。",
        "translation": "Those who obtain them rejoice, but those who don't obtain them are sad and troubled.",
        "source": "T17n0735_001:0536c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疾病，死至命盡，所有財物、官爵、俸祿，故在世間，不隨人魂神去，空為愁苦。",
        "translation": "When he's sick and dies and reaches the end of his life, his possessions, titles, and emoluments will remain in the world and won't go with his soul, leaving him empty of sorrow and suffering.",
        "source": "T17n0735_001:0536c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第三願者，謂有父母、兄弟、妻子、中外、親屬、朋友、知識、恩愛榮樂。",
        "translation": "\"The third vow is to have parents, brothers, wives, relatives at home and abroad, friends, friends, kindness, love, and prosperity.",
        "source": "T17n0735_001:0536c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疾病，至死命盡，復不能救我命，亦不能隨我魂神去。",
        "translation": "When I'm sick, it won't save my life until my life ends, and it won't follow my soul and spirit away.",
        "source": "T17n0735_001:0536c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空啼哭，送我到城外深塚間，以棄我去，各疾還歸。",
        "translation": "They wept and sent me away to a deep cemetery outside the city, abandoning me and returning home with their illnesses.",
        "source": "T17n0735_001:0536c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖追念我，愁苦憂思，不過十日，諸家宗族、男女聚會，相向歌舞，快共飲食，相對談笑，捐忘死人。",
        "translation": "Although I was missed and I was sad and troubled, it was only for ten days that my clan and my men and women gathered together, singing and dancing, eating and drinking together, laughing and talking, and forgetting about my dead body.",
        "source": "T17n0735_001:0536c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖有父母、兄弟、妻子、中外、親屬、朋友、知識，不能共追我命，空悲之，復何益也！",
        "translation": "Even though my parents, brothers, wife, relatives, friends, and friends can't share in the pursuit of my life, what good would it be to grieve for them in vain?",
        "source": "T17n0735_001:0536c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第四願者，是人意。",
        "translation": "\"The fourth vow is human aspiration.",
        "source": "T17n0735_001:0536c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天下人少有能守護其意者，皆放心恣意，婬於五樂，貪利疾妬，忿怒鬪諍，不信道德。",
        "translation": "Few people in the world can guard their intentions, but they are all at ease and wanton, lusting after the five pleasures, greedy for profit and hate, angry and quarrelsome, and unfaithful to morality.",
        "source": "T17n0735_001:0536c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於身死壽盡，魂神去矣，三者相追逐，不得相離。",
        "translation": "When their bodies die and their lives are up, their souls and spirits depart, and these three things pursue each other and can't be separated from each other.",
        "source": "T17n0735_001:0536c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如雀飛，意隨其兩翅，意為身神，兩翅為魂魄，人不能守護其意，皆從惡念所為，殺、盜、貪、婬，以生時所為罪，死入太山地獄中，為飢餓鬼。",
        "translation": "Like a sparrow flying, its mind follows its two wings, and its mind is its body and spirit, while its two wings are its soul.",
        "source": "T17n0735_001:0536c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪竟，乃出為畜生，當為人所屠割。",
        "translation": "After completing their crimes, they'll be released as an animal that will be slaughtered by humans.",
        "source": "T17n0735_001:0537a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作人放心快意故，入三惡道。」",
        "translation": "Because they acted with reassurance and pleasure, they'll enter the three evil destinies.\"",
        "source": "T17n0735_001:0537a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告純陀及諸弟子：「當端汝心，守護汝意！",
        "translation": "The Buddha told Cunda and his disciples, \"Train your mind and guard your thoughts!",
        "source": "T17n0735_001:0537a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦自思惟：知身非我身，所有財物，亦非我許。",
        "translation": "\"Truly consider yourself, knowing that your body is not your own body and that your possessions are not yours.",
        "source": "T17n0735_001:0537a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當諦計校所有，父母、兄弟、妻子、五種親屬、朋友、知識，官爵、俸祿，念欲得之，無有厭足，謂有益於我身，老、病、死來，皆不能益於我身，亦不能為我却之。",
        "translation": "They should carefully consider what they possess, such as parents, brothers, wives, five kinds of relatives, friends, friends, acquaintances, and official titles and salaries, and be mindful of the desire to obtain them without getting tired of them, thinking that they are good for my body but that old age, illness, and death will not benefit my body, nor will they be able to save it for me.",
        "source": "T17n0735_001:0537a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人不能自拔為道，如鸚鵡鳥愛其毛尾，為射獵者所得。",
        "translation": "A person can't extricate himself from the path, like a parrot that loves its fur and tail and gets it for a shooter.",
        "source": "T17n0735_001:0537a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者諦知，是四願不隨人魂神去，空為之困苦。",
        "translation": "Good men, you well know that these four vows don't follow the soul and spirit of a person, but leave them empty and suffering.",
        "source": "T17n0735_001:0537a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因拔恩愛之根，絕三惡之道，得三善道：一者、不復老；二者、不復病；三者、不復死。",
        "translation": "By uprooting the root of craving, they cut off the three bad paths and attain the three good paths: one, not to grow old again; two, not to become ill again; and three, not to die again.",
        "source": "T17n0735_001:0537a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堅守護其意，乃可得度！」",
        "translation": "Only by firmly guarding their intentions can they be saved!\"",
        "source": "T17n0735_001:0537a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸弟子聞經歡喜，為佛作禮。",
        "translation": "The disciples rejoiced when they heard the sūtras and paid homage to the Buddha.",
        "source": "T17n0735_001:0537a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎佛說四願經◎佛念天地八方之外，萬物受性皆懷憂苦，常傷人民，含血蠕動，不得自在。",
        "translation": "◎The Buddha spoke the Four Vows Sutra ◎The Buddha was mindful that beyond the eight directions of heaven and earth, all things that receive nature are grievous and painful, always hurting people, writhing with blood, and not able to be at ease.",
        "source": "T17n0735_001:0537a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與天爭命，皆當歸死。",
        "translation": "They are always hurt, writhing with blood, and unable to be free.",
        "source": "T17n0735_001:0537a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "骸骨銷爛，下入于土；精神飛翔，展轉五道，為善上天，為惡入淵。",
        "translation": "Their bones will be pulverized and they will descend into the earth; their spirits will fly and they will spread out over the five destinies, going up to heaven for good and into the abyss for evil.",
        "source": "T17n0735_001:0537a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡人生時，所為善惡，精神魂魄，隨其殃福。",
        "translation": "When we're born, what we do for good or evil, our spirit and soul follow their misfortune and fortune.",
        "source": "T17n0735_001:0537a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生時為人，孝順父母、忠信事君，死得上天。",
        "translation": "When they're born, they're human beings who are dutiful to their parents and faithful to their ruler, and they'll go up to heaven when they die.",
        "source": "T17n0735_001:0537a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如世間人，積德為善，仕宦求官位，至公侯豪貴。",
        "translation": "Like people in the world, they accumulate virtue for good, become officials, and seek official positions, reaching the level of princes and nobles.",
        "source": "T17n0735_001:0537a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富樂貧賤困厄，皆由宿命。",
        "translation": "Their wealth, happiness, poverty, lowliness, and hardship are all determined by their past lives.",
        "source": "T17n0735_001:0537a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行伐殺酷虐，生為惡人，死受重酬。",
        "translation": "They commit acts of violence and cruelty, are born evil, and receive a heavy reward in death.",
        "source": "T17n0735_001:0537a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自為心侯主招百凶，快心之歡必有後患。",
        "translation": "A self-made man of mind invites a hundred evils, and the pleasure of his heart will surely bring trouble in the future.",
        "source": "T17n0735_001:0537a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝王人民，俱惑於道，寄託父母。",
        "translation": "Emperors, kings, and people are all confused by the path and entrust it to their parents.",
        "source": "T17n0735_001:0537a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作善福壽，為惡貧苦。",
        "translation": "They create good fortune and longevity, and they become poor and unhappy.",
        "source": "T17n0735_001:0537a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盜竊欺人、負債不償、借貸不歸，死後當為奴婢牛馬，或作大猪，屠割剝其軀，稱賣償人。",
        "translation": "They steal from others, deceive others, default on debts, and fail to repay debts; after death, they'll be made into slaves, servants, cattle, horses, or large pigs that are butchered, cut off, and stripped of their bodies and sold to pay people.",
        "source": "T17n0735_001:0537a27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作人慳貪，不肯布施，死為餓鬼，不得衣食。",
        "translation": "If someone is stingy and greedy and refuses to give, they'll die a hungry ghost and won't be able to get food or clothing.",
        "source": "T17n0735_001:0537a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如乞匃人，以刀截肉，叩頭求食。",
        "translation": "They'll be like a beggar who cuts off meat with a knife and bows his head to ask for food.",
        "source": "T17n0735_001:0537b01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此皆先時，為人貪殘悖逆，不信為善。",
        "translation": "These are all people who, at one time or another, were greedy, cruel, and disobedient, and didn't believe in goodness.",
        "source": "T17n0735_001:0537b02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傷殺盜竊、受人婦女、讒言兩舌、飲酒鬪亂，死入地獄，掠笞燒煮，身更蠆毒，苦痛無極。",
        "translation": "They killed, stole, accepted women, spoke slanderously, drank alcohol, and fought, and were sent to hell where they died, were flogged, burned, and had their bodies corroded, with pain and suffering that knows no bounds.",
        "source": "T17n0735_001:0537b03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有六憂、三苦、四痛，佛戢轉化，生死不絕。",
        "translation": "Humans have six grieves, three sufferings, and four pains, but the Buddha's transformation will never end birth and death.",
        "source": "T17n0735_001:0537b05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棄國捐王，求自然道，積德累歲，乃得道真。",
        "translation": "Abandoning his country and renouncing the king, he seeks the natural path and accumulates years of virtue before attaining the truth of the path.",
        "source": "T17n0735_001:0537b06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "神明徹照，悉見天地絕洞之外，知人鳥獸蟲豸所言、心所趣向。",
        "translation": "With penetrating spiritual insight, he sees clearly beyond the cutoff cave of heaven and earth and knows what humans, birds, animals, insects, and creatures say and where their minds are headed.",
        "source": "T17n0735_001:0537b07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛念人死，如大風卒至無期。",
        "translation": "The Buddha is mindful that human death is like a great wind that arrives without a date.",
        "source": "T17n0735_001:0537b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人死至無時，當與心爭諍，為善勿疑。",
        "translation": "When a person's death reaches no time, they should argue with their mind and do not doubt what's good.",
        "source": "T17n0735_001:0537b09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以經道勸勵，賢者目所不見、耳所不聞。",
        "translation": "The Buddha encourages this good man with the path of the sutras, which he doesn't see with his eyes and doesn't hear with his ears.",
        "source": "T17n0735_001:0537b10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "崛奇珍寶，何益於己？",
        "translation": "What good will the rare and precious treasures do for you?",
        "source": "T17n0735_001:0537b11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸為道者，當信經戒守善以死，不犯惡生，道不可失，德不可離。",
        "translation": "Those who are on the path should believe the sūtras and precepts, observe goodness until death, and refrain from committing bad birth; the path can't be lost, and virtue can't be separated from it.",
        "source": "T17n0735_001:0537b11_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠道失德，如兒生無母、魚脫於淵。",
        "translation": "To distance oneself from the path and lose virtue is like a child born without a mother, or a fish that has escaped from an abyss.",
        "source": "T17n0735_001:0537b13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人死復生，如蠶渾沌繭中、穿絲出飛。",
        "translation": "When a person dies and is reborn, it's like a silkworm wrapped in a chaotic cocoon that flies off through thread.",
        "source": "T17n0735_001:0537b14_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其神故一，變形易殼。",
        "translation": "Their spirits are therefore one, and they change shape and shell.",
        "source": "T17n0735_001:0537b15_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道成於微，五戒得根。",
        "translation": "The path is accomplished in a subtle way, and the five precepts attain their root.",
        "source": "T17n0735_001:0537b15_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子聞經歡喜，前受教，是為痛痒要識如諦知也。",
        "translation": "The disciple who hears the sūtras rejoices and goes forward to receive the teaching, which is to know the essence of pain and itchiness as they really are.",
        "source": "T17n0735_001:0537b16_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為思想識？",
        "translation": "What's thinking consciousness?",
        "source": "T17n0735_001:0537b17_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為身六思想。",
        "translation": "\"They are the six bodily thoughts.",
        "source": "T17n0735_001:0537b17_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼裁思想，耳鼻口身意裁思想。",
        "translation": "The eye discriminates thought, and the ear, nose, mouth, and body discriminate thought.",
        "source": "T17n0735_001:0537b18_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是六思想。",
        "translation": "These are the six kinds of thought.",
        "source": "T17n0735_001:0537b18_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為思想習識？",
        "translation": "What's the consciousness of thought and accumulation?",
        "source": "T17n0735_001:0537b19_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "裁習為思想習，如是為思想習識。",
        "translation": "This is the consciousness of accumulating thoughts and thus accumulating thoughts.",
        "source": "T17n0735_001:0537b19_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為思想盡識？",
        "translation": "What's the consciousness of exhausting thought?",
        "source": "T17n0735_001:0537b20_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "裁盡為思想盡識，如是為思想盡識。",
        "translation": "\"Ending retribution is the consciousness of ending thought, and this is the consciousness of ending thought.",
        "source": "T17n0735_001:0537b20_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為思想盡受行識？",
        "translation": "What's the consciousness of the exhaustion of thought and feeling and volition?",
        "source": "T17n0735_001:0537b21_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為八行識識。",
        "translation": "\"This is the consciousness of the eightfold formative consciousness.",
        "source": "T17n0735_001:0537b22_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識識諦見到諦定意為八，如是盡思想受行識。",
        "translation": "The consciousnesses that see with care and concentrate with care are eight, and they thus exhaust the consciousnesses of feeling, sensation, and volition.",
        "source": "T17n0735_001:0537b22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為思想味識？",
        "translation": "What's the consciousness of ideation and taste?",
        "source": "T17n0735_001:0537b23_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所為思想因緣生樂得意喜，如是為思想味識。",
        "translation": "This is the thinking consciousness that gives rise to the joy and satisfaction that are the causes and conditions of thought.",
        "source": "T17n0735_001:0537b24_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為思想腦識？",
        "translation": "What's the thinking mind consciousness?",
        "source": "T17n0735_001:0537b25_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所為思想不常盡苦轉法，如是為思想腦識。",
        "translation": "This is thought, impermanent, painful, and transformative, and this is thought as the mental consciousness.",
        "source": "T17n0735_001:0537b25_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為思想要識？",
        "translation": "What's the essential consciousness of thought?",
        "source": "T17n0735_001:0537b26_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所思想欲貪能解、欲貪能斷、欲貪能自度，如是為思想要識。",
        "translation": "Thinking about desires and greed that can be understood, desires and greed that can be stopped, and desires and greed that can be self-restrained is thus the essential consciousness of thought.",
        "source": "T17n0735_001:0537b27_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生死識？",
        "translation": "What's the consciousness of birth-and-death?",
        "source": "T17n0735_001:0537b28_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為六身生死識，眼裁生死識、耳鼻口身意裁行，如是為生死識。",
        "translation": "The six bodies are the birth-and-death consciousness, the eyes are the consciousnesses that deliberate birth-and-death, and the ears, nose, mouth, body, and mind deliberate formations, and these are the birth-and-death consciousnesses.",
        "source": "T17n0735_001:0537b29_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生死習、裁習、生死習識？",
        "translation": "What are birth-and-death accumulation, cutback accumulation, and birth-and-death accumulation consciousnesses?",
        "source": "T17n0735_001:0537c01_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生死盡識？",
        "translation": "What is the consciousness of the end of birth and death?",
        "source": "T17n0735_001:0537c02_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "裁盡為生死盡識。",
        "translation": "\"Ending retribution is the consciousness of ending birth-and-death.",
        "source": "T17n0735_001:0537c02_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生死欲盡受行識？",
        "translation": "What's the consciousness of wanting to end birth-and-death and feeling and acting?",
        "source": "T17n0735_001:0537c03_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是八行識，諦見至諦定為八，如是為生死欲滅受行識。",
        "translation": "These are the eight formative consciousnesses, which are the eight when they are truly seen and ultimately determined, and these are the formative consciousnesses of birth-and-death desires and cessation feelings.",
        "source": "T17n0735_001:0537c03_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生死味識？",
        "translation": "What's the consciousness of the taste of birth-and-death?",
        "source": "T17n0735_001:0537c05_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所為生死因緣生樂喜意，如是為生死味識。",
        "translation": "This is the consciousness of taste of birth-and-death that gives rise to happiness and joy as the cause and condition of birth-and-death.",
        "source": "T17n0735_001:0537c05_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生死腦識？",
        "translation": "What's the mind consciousness that arises from birth-and-death?",
        "source": "T17n0735_001:0537c06_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有生死不常盡苦轉法，如是為生死腦識。",
        "translation": "\"All birth-and-death is impermanent, painful, and transformative, and this is the consciousness that's the brains of birth-and-death.",
        "source": "T17n0735_001:0537c07_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等生死要識？",
        "translation": "What's the essential consciousness of birth-and-death?",
        "source": "T17n0735_001:0537c08_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所為生死欲貪、隨欲貪，能斷、欲能度，如是為生死要識。",
        "translation": "This is the consciousness that's essential to birth-and-death desires and cravings, which can be stopped and the desires can be smoothed over.",
        "source": "T17n0735_001:0537c08_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為識身六衰識？",
        "translation": "What are the six decaying consciousnesses of the consciousness body?",
        "source": "T17n0735_001:0537c09_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼裁識、耳鼻口身意裁識，如是為識識。",
        "translation": "The eyes tailor consciousness, the ears, nose, mouth, body, and mind tailor consciousness, and so forth are consciousnesses.",
        "source": "T17n0735_001:0537c10_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為識習？",
        "translation": "What's consciousness formation?",
        "source": "T17n0735_001:0537c11_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命字習為識習，如是習為識。",
        "translation": "\"The word 'life' is accumulated as consciousness, and such accumulation is consciousness.",
        "source": "T17n0735_001:0537c11_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為識盡為識？",
        "translation": "What's the end of consciousness as consciousness?",
        "source": "T17n0735_001:0537c12_70",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命字盡為盡識，如是為盡識。",
        "translation": "\"The end of life is the consciousness of ending, and this is the consciousness of ending.",
        "source": "T17n0735_001:0537c12_71",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為識盡受行為識？",
        "translation": "What is consciousness that ends feeling and volition as consciousness?",
        "source": "T17n0735_001:0537c13_72",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八行，諦見至諦定為八，如是為識盡欲受行如諦識。",
        "translation": "The eight practices, which are seen with care and reach the concentration of care, are eight, and thus are consciousnesses that exhaust desire, experience, and perform as consciousnesses in truth.",
        "source": "T17n0735_001:0537c14_73",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為識味知所識？",
        "translation": "What's consciousness that tastes and knows what's conscious?",
        "source": "T17n0735_001:0537c15_74",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣故生樂生喜意，如是為味生為味識知。",
        "translation": "As a result of these causes, happiness arises, and the joyful thoughts that arise from them are thus tasted and known by the tasting consciousness.",
        "source": "T17n0735_001:0537c15_75",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為識腦識所識？",
        "translation": "What's consciousness that's produced by the brain and consciousness?",
        "source": "T17n0735_001:0537c16_76",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為盡為苦為轉，如是為識腦識。",
        "translation": "For the sake of exhaustion and suffering and transformation, this is consciousness and mental consciousness.",
        "source": "T17n0735_001:0537c17_77",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為要識所識？",
        "translation": "What's the essential consciousness and the consciousness?",
        "source": "T17n0735_001:0537c18_78",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲貪能活、欲貪能斷能度，如是為要識。",
        "translation": "This is the essential consciousness of being able to live with desire and being able to stop desire and free oneself from it.",
        "source": "T17n0735_001:0537c18_79",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，比丘！",
        "translation": "Monks, it's like this!",
        "source": "T17n0735_001:0537c19_80",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七處為覺知。",
        "translation": "\"Seven places are perceived.",
        "source": "T17n0735_001:0537c19_81",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為七？",
        "translation": "What are the seven?",
        "source": "T17n0735_001:0537c20_82",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色、習、盡、道、味、苦、要。",
        "translation": "Form, accumulation, exhaustion, the path, taste, suffering, and essentials.",
        "source": "T17n0735_001:0537c20_83",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是五陰各有七事。",
        "translation": "These are the seven things that are associated with each of the five aggregates.",
        "source": "T17n0735_001:0537c20_84",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三觀識？",
        "translation": "What are the three contemplative consciousnesses?",
        "source": "T17n0735_001:0537c21_85",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦有七事，得五陰成六衰。",
        "translation": "There are also seven things that give rise to the five aggregates and the six decayers.",
        "source": "T17n0735_001:0537c21_86",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀身為色一，觀五陰為二，觀六衰為三，故言三觀。",
        "translation": "Observing the body as form (1), observing the five aggregates (2), and observing the six decayers (3), he therefore speaks of three contemplations.",
        "source": "T17n0735_001:0537c22_87",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘能曉七處，亦能三觀，不久行墮道斷結，無有結，意脫黠活，見道見要，一證受止，已斷生死，意行所作意，不復來還生死，得道。",
        "translation": "A monk who understands the seven abodes and can also observe them three times won't soon be practicing falling into the bonds of the path, becoming free of them, liberating his mind from intelligence and activity, seeing the essentials of the path, realizing once and accepting calm, having ended birth-and-death, and doing what he intends to do, he won't return to birth-and-death again and attain the path.",
        "source": "T17n0735_001:0537c23_88",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha spoke thus.",
        "source": "T17n0735_001:0537c26_89",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘歡欣受行。",
        "translation": "That monk joyfully accepts the practice.",
        "source": "T17n0735_001:0537c27_0",
        "is_bad_quality": false
    }
]