[
    {
        "source_sentence": "正法念處經卷第七",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 7",
        "source": "T17n0721_007:0035a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏婆羅門瞿曇般若流支譯",
        "translation": "Yuan Wei Bhramun Gautama Prajñāruci Translation",
        "source": "T17n0721_007:0035a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄品之三",
        "translation": "three of the infernal categories",
        "source": "T17n0721_007:0035a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「◎又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Śāriputra then knew the results of his actions, and he then examined the confluence of the great hells, and where else was there?",
        "source": "T17n0721_007:0035a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處，彼處名為朱誅朱誅，是合地獄第八別處；殺生、偷盜、邪行，樂行多作，墮合地獄朱誅朱誅。",
        "translation": "They see and hear and know that there's another place, which is called Jubilee and Jubilee, which is the eighth distinct place in combined hell; killing, stealing, wrongdoing, and indulging in many pleasurable activities lead to falling into the same hell as Jubilee and Jubilee.",
        "source": "T17n0721_007:0035a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions do sentient beings take that give rise to that place?",
        "source": "T17n0721_007:0035a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：若人殺生、偷盜、邪行，樂行多作，墮合地獄，朱誅朱誅地獄處生。",
        "translation": "\"They see and hear that if a person kills, steals, commits wrong actions, and has many pleasurable deeds, they'll fall into the combined hells and be born in the hells of Jubilee and Jubilee.",
        "source": "T17n0721_007:0035a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing, stealing, and the results of those actions are as explained above.",
        "source": "T17n0721_007:0035a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What's wrongdoing?",
        "source": "T17n0721_007:0035a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：有人不善觀察，若羊若驢，以無人女，是故婬之，彼人於佛不生敬重，或在浮圖、或近浮圖。",
        "translation": "\"Suppose someone doesn't well observe, like a sheep or a donkey, and because there's no human female, they have sexual intercourse with him. That person doesn't respect the Buddha and might be in or near a floating image.",
        "source": "T17n0721_007:0035a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處合大地獄，朱誅朱誅地獄處生，受大苦惱，所謂：鐵蟻常所唼食，一切身分受大苦惱。",
        "translation": "As a result of that bad action, that person's body breaks up and his life ends, and he falls into a great hell that combines bad places, where he'll be born in the hells of Jubilee and Jubilee, and experience great suffering and distress, which is called: \"Iron ants always gobble food, and all of his bodies experience great suffering and distress.",
        "source": "T17n0721_007:0035b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄火滿其腹內，彼地獄人內外燒煮，自種惡業，得此惡報。",
        "translation": "That hell fire fills their bellies, and that hell-dweller is burned inside and out, creating his own bad karma and getting this bad result.",
        "source": "T17n0721_007:0035b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量百千年歲，常有惡虫朱誅朱誅，在地獄中噉食其肉，復飲其血；既飲血已，次斷其筋；既斷筋已，次破其骨；既破骨已，次飲其髓；既飲髓已，食大小腸。",
        "translation": "Thus, for measureless hundreds of thousands of years, there's always this evil insect, Jubilant Jubilant, that eats his flesh and drinks his blood in hell; after drinking his blood, it then cuts his tendons; after cutting his tendons, it then breaks his bones; after breaking his bones, it then drinks his marrow; after drinking his marrow, it then eats his large and small intestines.",
        "source": "T17n0721_007:0035b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人如是燒已、如是炙已、如是食已，唱喚號哭種種浪語，悲號大哭，如是乃至不可愛樂不善惡業，食受未盡，如是無量百千年歲，常被燒煮炙熟食之，乃至惡業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "After they've been burned, roasted, and fed, those people in hell shout and cry with various violent words and lamentations, such as this and even unpleasant, unskillful, and bad actions, which are unpleasant, unpleasant, and whose sensations of food have yet to be ended, are constantly burned, boiled, roasted, and cooked, even when their bad actions have yet to be destroyed or rotted and their karmic energy has yet to be exhausted, and they experience more suffering than ever; if their bad actions have ended, then they'll be freed from that place of hell.",
        "source": "T17n0721_007:0035b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，多有怨對，雖在王舍而不得力，生常貧窮、資生乏少又不長命。",
        "translation": "If someone in a past life had matured good actions long ago, they wouldn't be born in the path of hungry ghosts or animals; if they were born among peers and had many enemies, they wouldn't gain strength even though they were in the king's household, and they'd be born always poor, with few assets and no long life.",
        "source": "T17n0721_007:0035b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是彼邪行惡業勢力，在於人中受餘殘果報。",
        "translation": "Such are the forces of bad karma from wrong actions that bring the results of the rest of their lives among humans.",
        "source": "T17n0721_007:0035b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報。",
        "translation": "\"That monk also knows the results of actions.",
        "source": "T17n0721_007:0035b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次復觀察合大地獄，復有何處？",
        "translation": "Next, he observes what place there is in the combined great hells.",
        "source": "T17n0721_007:0035b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處名何何奚，是合地獄第九別處。",
        "translation": "They see and hear and know, \"Again, there's a different place called Ho-Ho-Hi, which is the ninth distinct place in combined hell.",
        "source": "T17n0721_007:0035b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是何業報作集之業，普遍究竟，墮合地獄何何奚處？",
        "translation": "What is this place of confluence with hell that is the universal finality of the actions that result from the formation of karma?",
        "source": "T17n0721_007:0035b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：若人殺生、偷盜、邪行，樂行多作，墮合地獄何何奚處。",
        "translation": "\"They see and hear and know: 'Where will a person go who kills, steals, commits wrong acts, and has many pleasurable actions that lead to falling into a combined hell?'",
        "source": "T17n0721_007:0035b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing, stealing, and the results of those actions are as explained above.",
        "source": "T17n0721_007:0035b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What's wrongdoing?",
        "source": "T17n0721_007:0035b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邊地夷人於姊妹等不應行處，而行婬欲；彼國法爾，生處過惡。",
        "translation": "\"On the borderlands, barbarians engage in sexual misconduct in places where sisters and others shouldn't go, and this is the way it is in that country, where they are born in a bad place.",
        "source": "T17n0721_007:0035b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終生合地獄何何奚處，受大苦惱，所謂：彼處地獄之中常被燒煮，閻魔羅人之所撾打，苦毒吼喚，其聲遍滿五千由旬。",
        "translation": "As a result of that bad action, he'll be born in hell or some other place where his body breaks up and his life ends, and he'll experience great suffering and distress, which is described as being burnt and boiled in hell, beaten by Jāmbūla, and having a painful roar that fills 5,000 leagues.",
        "source": "T17n0721_007:0035b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人未到地獄，在中有中聞彼吼聲。",
        "translation": "Before they reach hell, those hell-goers hear their roar in the intermediate state.",
        "source": "T17n0721_007:0035c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吼聲極惡，不可得聞。",
        "translation": "The sound of that roar is so terrible that it can't be heard.",
        "source": "T17n0721_007:0035c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼顛倒故，聞彼啼哭則是歌聲、拍手等聲，種種話聲，惡業力故，聞之愛樂，生如是心：『令我到彼如是聲處。』",
        "translation": "Because of their delusion, when they hear their lamentation, it's like singing, clapping their hands, or various other sounds, and because of the power of bad karma, they enjoy hearing it and become like this: 'Let me go to that place with that sound.'",
        "source": "T17n0721_007:0035c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是念已，速生彼處。",
        "translation": "After thinking this, he'll quickly be born there.",
        "source": "T17n0721_007:0035c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因緣有？",
        "translation": "What are the causes and conditions for that?",
        "source": "T17n0721_007:0035c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取因緣有。",
        "translation": "\"The causes and conditions for grasping exist.",
        "source": "T17n0721_007:0035c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼中有中，何處何處發心悕取，則生彼。",
        "translation": "Of these, there's one, and where and what place he arouse his mind to desire, then he'll be born there.",
        "source": "T17n0721_007:0035c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心取彼心已，則生彼處；既生彼處，即於生時得地獄苦，即聞地獄自體惡聲，急惡苦惱無異相似，不可譬喻，受大苦惱。",
        "translation": "After the mind apprehends that mind, it'll be born there; once it's born there, that's when it's born and attains the pain of hell, which is hearing the bad sound of hell's own body, which is nothing like the sharp pain and suffering that can't be described, and which brings great suffering and distress.",
        "source": "T17n0721_007:0035c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既聞惡聲，心重破壞，受大苦惱，所謂：鐵山名烏丘山，其山炎燃，其炎極高五千由旬在虛空界。",
        "translation": "After hearing that bad sound, their minds are severely damaged, and they experience great suffering and distress, which is called the iron mountain called Ucchu, which is scorching hot and whose heat is 5,000 leagues high in the sky realm.",
        "source": "T17n0721_007:0035c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有鐵樹，樹有鐵烏，烏身炎然滿彼樹上。",
        "translation": "There's an iron tree there, and in that tree there's an iron crow, and the crow's body is scorching hot all over the tree.",
        "source": "T17n0721_007:0035c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼山火然，間無空處，惡業力故，常有炎火熾燃不滅。",
        "translation": "That mountain is on fire, and there's no empty space between it and the power of bad karma, so it's always blazing and doesn't go out.",
        "source": "T17n0721_007:0035c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以惡業故，見蓮花林遍滿彼山，彼地獄人既見蓮花，迭互相喚，作如是言：『汝來，汝來！",
        "translation": "As a result of bad karma, they see a forest of lotus flowers filling that mountain, and when they see the lotus flowers, the hell-dwellers repeatedly call out to each other, saying, 'Come here, come here!'",
        "source": "T17n0721_007:0035c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是山上多有冷林潤膩之林，今可共往。』",
        "translation": "On such mountains there are many cold and dense forests, so now you can go with them.'",
        "source": "T17n0721_007:0035c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻魔羅人打地獄人，上雨刀石，罪人畏故，走赴彼山，望得救免，望主望歸。",
        "translation": "When the Yama people strike a hell-being and rain swords and stones on him, the sinner is afraid and goes to that mountain, hoping to be saved and hoping that his lord will return.",
        "source": "T17n0721_007:0035c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是罪人既到彼山，而彼山上熱炎遍滿，多有炎烏，鐵嘴甚利，彼地獄人如是見已，彼烏疾來向地獄人。",
        "translation": "After he reached that mountain, the heat on that mountain was intense, and there were many crows with sharp iron mouths.",
        "source": "T17n0721_007:0035c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人有炎烏來破其頭者，復有烏來取其腦者，復有烏來取其眼者，復有烏來取其鼻者，復有烏來取其頰者，復有烏來取其皮者，復有烏來取其脇者，復有烏來取其足者，復有烏來取其舌者，復有烏來取其項者，復有烏來取頭皮者，復有烏來取其喉者，復有烏來取其心者，復有烏來取其肺者，復有烏來取小大腸者，復有烏來取其腹皮，復有烏來取其臍下陰密處者，復有烏來取其髀者，復有烏來取其踹者，復有烏來取足跟皮，復有烏來取足下皮，復有烏來取其足指，復有烏來分分食之，復有烏來分分取肋，復有烏來取脇骨者，復有烏來唯取其手一廂之骨，復有烏來一切身分具足取者，復有烏來取其髓者，如是眾烏食地獄人，分分皆食，罪業力故，食已還生。",
        "translation": "彼地獄人有炎烏來破其頭者，復有烏來取其腦者，復有烏來取其眼者，復有烏來取其鼻者，復有烏來取其頰者，復有烏來取其皮者，復有烏來取其脇者，復有烏來取其足者，復有烏來取其舌者，復有烏來取其項者，復有烏來取頭皮者，復有烏來取其喉者，復有烏來取其心者，復有烏來取其肺者，復有烏來取小大腸者，復有烏來取其腹皮，復有烏來取其臍下陰密處者，復有烏來取其髀者，復有烏來取其踹者，復有烏來取足跟皮，復有烏來取足下皮，復有烏來取其足指，復有烏來分分食之，復有烏來分分取肋，復有烏來取脇骨者，復有烏來唯取其手一廂之骨，復有烏來一切身分具足取者，復有烏來取其髓者，如是眾烏食地獄人，分分皆食，罪業力故，食已還生。",
        "source": "T17n0721_007:0035c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼炎烏、閻魔羅人生怖畏故，烏丘山中處處馳走，望救望歸，上烏丘山；上彼山已，以惡業故，炎火遍滿來覆其身，如是無量百千年歲燒而復生，是彼作集惡業力故，受大苦惱。",
        "translation": "As a result of the fear of those crows and Jāmbūḍa people, they scurry from place to place on Crow Hill, hoping for help and returning, and go up to Crow Hill; once they reach that hill, a fire will completely cover their bodies as a result of bad karma, and they'll be burned and reborn after an immeasurable amount of hundreds of thousands of years.",
        "source": "T17n0721_007:0036a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復上到烏丘山頂，山頭復有火炎極高五千由旬，彼炎吹舉在空而燒，如燒飛虫。",
        "translation": "If they then go up to the top of Mount Wuqiu, there's another fire at the top of the mountain that's 5,000 leagues high, and it blows up in the air and burns like a flying insect.",
        "source": "T17n0721_007:0036a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量百千年歲受大苦惱，而常不死，乃至惡業未壞未爛、業氣未盡，於一切時與苦不止；若彼殺生、偷盜、邪行，樂行多作，惡業受盡，彼地獄處爾乃得脫。",
        "translation": "Thus, they experience great suffering and distress for measureless hundreds of thousands of years and never die, even when their bad karma has yet to break down or rot and their karmic energy has yet to be exhausted, and their suffering doesn't end at all times; if they kill, steal, commit wrong acts, engage in many delightful deeds, and experience the end of their bad karma, then they'll be freed from that place of hell.",
        "source": "T17n0721_007:0036a16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，一切身分皆悉爛臭，得惡癩病，若得癡病，多有怨對，恒常貧窮，生惡國土；彼作集業，餘殘果報。",
        "translation": "If he had ripened good karma in a past life long ago, he won't be born in the path of hungry ghosts or animals; if he lives among humans, his whole body will rot and smell, he'll get a bad scabies, get a delusional disease, have many enemies, be constantly poor, and be born in a bad land; these are the remaining residual results of the actions he's taken.",
        "source": "T17n0721_007:0036a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Furthermore, knowing the results of actions, that monk then investigates what place there is in the combined great hells.",
        "source": "T17n0721_007:0036a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處名淚火出，是合地獄第十別處。",
        "translation": "They see and hear and know that there's another place called the fire of tears that comes out, which is the tenth distinct place in the combined hells.",
        "source": "T17n0721_007:0036a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions do sentient beings take to be born in that place?",
        "source": "T17n0721_007:0036a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺、盜、邪行，樂行多作，墮合地獄淚火出處。",
        "translation": "They see: \"A person who kills, steals, commits wrong acts, and has many pleasurable actions falls into the confluence of hell and the place where fire and tears come out.",
        "source": "T17n0721_007:0036a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing and stealing and their consequences are as explained above.",
        "source": "T17n0721_007:0036a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What are wrong actions?",
        "source": "T17n0721_007:0036a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘尼先共餘人行不淨行，毀破禁戒，若人重犯彼比丘尼，彼人以是惡業因緣，身壞命終墮於惡處——合大地獄淚火出處，受大苦惱，所謂彼處相似受苦，彼苦堅[革*卬]不愛業作，所謂：大火普炎所燒，眼出火淚，彼淚是火即燒其身，彼地獄人受如是等種種苦惱。",
        "translation": "If a monk or nun first practices an impure act with another person and breaks a prohibited precept, and if that person repeatedly violates that monk or nun, then as a result of that bad action, that person's body breaks up and his life ends up in a bad place - a place where tears and fire from the great hells come out - and he experiences great suffering and distress, which is called similar suffering in that place, resolute [g*ang] suffering, unattractive actions, and what's called a great fire that burns everywhere and produces fiery tears from the eyes, and those tears are fire that burns his body, and that person in hell experiences all kinds of suffering and distress like this.",
        "source": "T17n0721_007:0036a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復更受餘諸苦惱：閻魔羅人劈其眼眶，佉陀羅炭置眼令滿，劈其眼骨猶如劈竹。",
        "translation": "They also experience other kinds of suffering: the Yama people chop their eyes' sockets, put charcoal in their eyes to fill them, and chop their bones like splitting bamboo.",
        "source": "T17n0721_007:0036b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄處如是惡畏。",
        "translation": "Their hell realm is thus terribly frightening.",
        "source": "T17n0721_007:0036b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以鐵鉤、鐵杵、鐵枷鉤割打築，令身分散；以熱鐵鉗劈其糞門，洋熱白鑞內之令滿，如是內燒；復有大火外燒其身，內外二種如是極燒，受第一苦，急惡苦惱，受如是等無量種種眾苦具足。",
        "translation": "He also chops his body with an iron hook, pounder, or shackle, cutting and beating it, causing it to disperse; he cleaves his faecal sockets with hot iron forceps and fills them with hot pewter, which burns them internally; he also has a huge fire that burns his body externally and burns it both internally and externally like this, which brings about the first pain, sharp and severe suffering, and an endless variety of such various sufferings.",
        "source": "T17n0721_007:0036b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「閻魔羅人說偈責言：「『內滿熱白鑞，　　外以大火燒，　　極燒受大苦，　　地獄惡業人。",
        "translation": "\"The Yama-ra man spoke a verse that rebuked him, saying, 'He's filled with hot pewter on the inside and burned by a great fire on the outside, which burns him to a crisp and causes him great suffering as a person with bad karma in hell.",
        "source": "T17n0721_007:0036b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若業生苦果，　　受惡苦惱報，　　彼於三界中，　　不可得譬喻。",
        "translation": "If actions produce painful results and bring the results of bad suffering, there's no way to compare them to the three realms.",
        "source": "T17n0721_007:0036b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　三種業三果，　　於三界中生，　　三過三心起，　　三處苦報熟。",
        "translation": "The three fruits of three kinds of actions are produced in the three realms, the three faults and three minds arise, and the three places of painful retribution ripen.",
        "source": "T17n0721_007:0036b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼如是業報，　　於三界中生，　　因緣和合作，　　如是異法起。",
        "translation": "The results of those actions are produced in the three realms, and they are caused by the cooperation of causes and conditions, thus producing different things.",
        "source": "T17n0721_007:0036b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如心如是行，　　如是如是轉，　　善人行善行，　　惡人造惡業。",
        "translation": "As mind thus acts and thus is transformed, a good person does good actions, and a bad person creates bad actions.",
        "source": "T17n0721_007:0036b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　心自在作業，　　業自在復有，　　此心業所起，　　如是愛所誑。",
        "translation": "The mind naturally works, karma naturally repeats, and this mental action arises, as such, from craving.",
        "source": "T17n0721_007:0036b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　惡心作業惡，　　彼人來至此，　　若在地獄煮，　　彼人愛所誑。",
        "translation": "When a bad person does bad actions, they come here, and if they were boiled in hell, they'd be deceived by their craving.",
        "source": "T17n0721_007:0036b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　非異人作惡，　　異人受苦報，　　自業自得果，　　眾生皆如是。",
        "translation": "Not someone else does evil, but someone else receives the painful consequences of their own actions, and sentient beings are all like that.",
        "source": "T17n0721_007:0036b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝自心所作，　　一切如是誑，　　今為大火燒，　　何故爾呻喚？』",
        "translation": "All that you do in your own mind is thus deceiving, and now you're burned by a great fire; why do you groan?'",
        "source": "T17n0721_007:0036c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「閻魔羅人如是責疏地獄人言：『汝自作業，今者自受不可得脫，如是一切業果所縛，彼一切業此中受報。』",
        "translation": "\"Thus does the Yama-ra man rebuke that hell-being, saying, 'You did your own work, and now you'll be bound by the results of all actions, and here's the result of all those actions.'",
        "source": "T17n0721_007:0036c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻魔羅人如是責之彼地獄人。",
        "translation": "The Yama-ra man thus rebukes that hell-being.",
        "source": "T17n0721_007:0036c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻魔羅人如是無量百千年中，如是燒煮地獄罪人，乃至作集惡不善業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "For measureless hundreds of millennia, the Yama-ra thus burns sinners in hell, even when they've collected bad and unskillful actions that haven't yet broken down or rotted and whose karmic energy hasn't yet ended, and they suffer more than once at all times; if those bad actions are ended, then they'll be freed from that place in hell.",
        "source": "T17n0721_007:0036c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，常有癖病在其腹中，若身焦枯，形貌醜陋，若守門戶，身體狀貌如燒樹林；作集業力餘殘果報。",
        "translation": "If there was good activity ripened long ago in a past life, he won't be born in the path of hungry ghosts or animals; if he lives among humans, he'll always have fetters and illnesses in his belly, his body will be charred and ugly, and if he guards his door, his body will look like a burning forest; that's the residual result of the effort to collect karma.",
        "source": "T17n0721_007:0036c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Furthermore, knowing the results of actions, that monk then investigates what place there is in the great hells combined.",
        "source": "T17n0721_007:0036c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處，彼處名為一切根滅，是合地獄第十一處。",
        "translation": "They see and hear and know that there's another place, which is called the cessation of all faculties and which is the eleventh place in the combined hells.",
        "source": "T17n0721_007:0036c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What activities of sentient beings are produced there?",
        "source": "T17n0721_007:0036c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺、盜、邪行，樂行多作，墮合地獄一切根滅地獄處生。",
        "translation": "\"They see that a person who kills, steals, commits wrong actions, and has many pleasant deeds falls into the hells where all their faculties cease and the hells where they are born are closed.",
        "source": "T17n0721_007:0036c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說；今說邪行，樂行多作。",
        "translation": "The actions and rewards of killing and stealing are as explained above, but now I'll talk about wrong actions and the many pleasures of doing them.",
        "source": "T17n0721_007:0036c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人多欲，或於口中、若糞門中——非婦女根——婬彼婦女。",
        "translation": "If a person has many desires, or if they have lust in their mouth or through the door of their stool - which is not the faculty of women - they will lust after their women.",
        "source": "T17n0721_007:0036c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——合大地獄一切根滅別異處生，受大苦惱，所謂：以火置口令滿，以熱鐵鉢盛赤銅汁。",
        "translation": "As a result of this bad action, he'll be destined to fall into a bad place when his body breaks up and his life ends - a place where all the faculties of the great hells cease to exist in a different place - and experience great suffering and distress, which is called putting fire in your mouth to fill it up or using a hot iron bowl filled with red copper juice.",
        "source": "T17n0721_007:0036c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鐵叉擘口，打刺令寬置熱銅汁；彼處復有熱鐵黑虫，虫體炎燃，彼十一處皆悉火燃，以為炎鬘，在中燒之，雖燒猶活，如是常燒；熱炎鐵蟻唼食其眼，熱白鑞汁置耳令滿，炎熱利刀割截其鼻，復以利刀次割其舌，雨熱利刀燒割其身。",
        "translation": "An iron fork breaks his mouth and pricks it to make it wide enough to put hot copper juice in it; there's also a hot iron worm with a black body that's glowing, and all 11 of those places are set on fire and burned as a fiery garland in which it remains alive even though it's burned, and it's always burning like this; a hot iron ant gobbles his eyes, hot pewter juice is placed in his ear to fill it, a hot, sharp knife cuts off his nose, another sharp knife cuts his tongue, and a hot, rainy knife burns his body.",
        "source": "T17n0721_007:0036c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸根受大苦惱、受極苦惱，得不樂報，彼地獄人無異相似，不可譬類，今說少分，譬如以燈取況於日，如是地獄受苦亦爾，非有比類。",
        "translation": "All of their faculties experience great suffering and extreme suffering, which brings unpleasant results, and they're no different from those in hell, which are not comparable.",
        "source": "T17n0721_007:0036c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天上樂勝亦無譬喻，彼地獄人受地獄苦亦復如是，無有譬喻。",
        "translation": "Even though there's no analogy for the happiness that prevails up in heaven, that person in hell also experiences the suffering of hell similarly, with no analogy.",
        "source": "T17n0721_007:0037a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_007:0037a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天上樂勝，地獄苦重，如是苦樂，今說少分。",
        "translation": "The pleasures of heaven are superior, while the pains of hell are severe; I'll now explain a small part of such pains and pleasures.",
        "source": "T17n0721_007:0037a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄處所受苦惱，堅[革*卬]尤重，乃至作集惡不善業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "The suffering and distress experienced in that hell realm are especially hard [ge*ang], even when the bad and unskillful actions they've collected haven't been destroyed or rotted, and their karmic energy hasn't ended, so their suffering doesn't end at all times; if their bad actions are ended, then they'll be freed from that hell realm.",
        "source": "T17n0721_007:0037a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道。",
        "translation": "If good actions matured in a past life long ago, they won't be born in the path of hungry ghosts or animals.",
        "source": "T17n0721_007:0037a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中同業之處，妻不貞良，他人共通，喚謀他人而共殺之：若告官人，誣枉令殺；若以惡毒和藥而殺；若待其睡以刀等殺。",
        "translation": "If a person lives among peers, has a wife who's unchaste and good, consorts with another person, and summons another person to kill them together, or if they tell an official and falsely accuse him of killing them, or if they kill him with bad poison and medicine, or if they wait until he's asleep and kill him with a knife, etc., then they'll be able to collect the power of bad karma and suffer.",
        "source": "T17n0721_007:0037a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是彼作集惡業勢力餘殘果報，作集業力果報未盡，不可得脫，會必受之。",
        "translation": "These are the residual results of the momentum of the bad actions they've collected, and the results of the actions they've collected are not yet complete; they can't be freed, and they will surely be subject to them.",
        "source": "T17n0721_007:0037a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Furthermore, knowing the results of actions, that monk then investigates what place there is in the great hells combined.",
        "source": "T17n0721_007:0037a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處名無彼岸受苦惱處，是合地獄第十二處。",
        "translation": "They see and hear and know that there's another place called the absence of another shore of suffering and distress, which is collectively the twelfth place in hell.",
        "source": "T17n0721_007:0037a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions of sentient beings are born in that place?",
        "source": "T17n0721_007:0037a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺、盜、邪行，樂行多作，墮合地獄生無彼岸受苦惱處。",
        "translation": "They see that a person who kills, steals, commits wrong actions, and has many pleasurable deeds falls into a combined hell, is born on the shore of nowhere, and experiences a place of suffering and distress.",
        "source": "T17n0721_007:0037a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing and stealing and their consequences are as explained above.",
        "source": "T17n0721_007:0037a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What's wrongdoing?",
        "source": "T17n0721_007:0037a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：有人起婬欲心，憶念自妻，婬他婦女。",
        "translation": "It means that a person becomes lustful, remembering their own wife and lusting after other women.",
        "source": "T17n0721_007:0037a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處合大地獄，生無彼岸受苦惱處，受大苦惱，作集業力，受如是苦，所謂：彼處受火燒苦、受刀割苦、受熱灰苦、受諸病苦，如是彼岸則不可得、無安慰者。",
        "translation": "As a result of this bad action, that person's body breaks up and his life ends and he falls into a great hell that combines bad places, is born in a place without another shore, experiences great suffering and distress, creates the power of karma, and experiences such suffering as being burned by fire, suffering from being cut by a knife, suffering from hot ashes, and suffering from illness, so that the other shore is unobtainable and has no comfort.",
        "source": "T17n0721_007:0037a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是所說，受諸苦惱不可譬喻，如說受苦。",
        "translation": "Thus explained, the suffering and distress that they experience cannot be likened to the suffering that's described.",
        "source": "T17n0721_007:0037a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人自心所誑，如是受苦。",
        "translation": "Those people in hell are deceived by their own minds and thus experience suffering.",
        "source": "T17n0721_007:0037a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量百千年中常被燒炙、若煮若打，乃至集作惡不善業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "Thus, for measureless hundreds of millennia, they've been burned, boiled, and beaten constantly, even when they've collected bad and unskillful actions that haven't yet broken down or rotted, and when their karmic energy hasn't yet ended, and they've suffered more than once at all times; if their bad actions have ended, then they'll be freed from that place of hell.",
        "source": "T17n0721_007:0037a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，則常貧窮，曠野惡處、山中嶮處為夷人奴，常有病苦。",
        "translation": "If good actions matured in a past life long ago, he won't be born in the path of hungry ghosts or animals; if he lives among humans, he'll always be poor, in a wild and unpleasant place or in a dangerous place in the mountains, as a slave to barbarians, and he'll always suffer from illness.",
        "source": "T17n0721_007:0037b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Furthermore, knowing the results of actions, that monk then investigates what place there is in the great hells combined.",
        "source": "T17n0721_007:0037b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處名鉢頭摩，是合地獄第十三處。",
        "translation": "They see and hear and know that there's another place called padma, which is the thirteenth place in the combined hells.",
        "source": "T17n0721_007:0037b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions do sentient beings take to be born in that place?",
        "source": "T17n0721_007:0037b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺生、偷盜、邪行作集，墮合地獄鉢頭摩處。",
        "translation": "\"They see that a person who kills, steals, and engages in wrong practices falls into the hellish place of Padma.",
        "source": "T17n0721_007:0037b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing and stealing and their consequences are as explained above.",
        "source": "T17n0721_007:0037b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What's wrong action?",
        "source": "T17n0721_007:0037b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：沙門自知，沙門本在俗時，先共婦女曾行欲來，得欲滋味，雖為比丘，心猶憶念，夜臥夢中見彼婦女，於婬欲味不善觀察，即共行欲。",
        "translation": "It means that a monk knows that when he was a layman, he and his wife once engaged in sexual desire and obtained the taste of desire, and even though he's a monk, he still recollects it in his mind.",
        "source": "T17n0721_007:0037b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人覺已，心即味著非梵行事，思量憶念心生隨喜，向他讚說婬欲功德，喜笑心樂，樂行多作彼彼喜樂。",
        "translation": "After that person perceives this, his mind immediately tastes what's not pure, and he considers and recollects it with a mind that's pleased with it, praising to others the merits of sexual desire, smiling with joy, and delighting in the joyful actions that result from those actions.",
        "source": "T17n0721_007:0037b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——合大地獄鉢頭摩處，受大苦惱，所謂苦者：彼地獄處一切皆作鉢頭摩色，與鉢頭摩色相相似，彼處如是普皆赤色，有赤光明；閻魔羅人取地獄人鑊中煮之，若置鐵函鐵杵搗之。",
        "translation": "As a result of this bad action, that person's body breaks up and his life ends and he falls into a bad place - the place that combines with the great hell of padma - and experiences great suffering and distress, which is called suffering because everything in that place of hell is padma-colored and resembles the color of padma, and it's like this place that's completely red in color and has red light.",
        "source": "T17n0721_007:0037b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若脫彼處，彼人遠見鉢頭摩花在清池中。",
        "translation": "If they escape from there, they'll see a flower of padma in a clear lake from afar.",
        "source": "T17n0721_007:0037b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人若於函鑊二苦得脫，於彼清池鉢頭摩花，望救望歸，疾走往赴，生如是心：『我往彼處，應得安樂。』",
        "translation": "If that hell-being is freed from the two kinds of suffering in the metal box and wok, he looks for help and hopes to return to the bowl and flower in that clear lake, and rushes off to go there, thinking, 'I'll go there and be comfortable.'",
        "source": "T17n0721_007:0037b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人飢渴苦惱，望鉢頭摩，彼人如是若百過走、若千過走，所走之道多饒鐵鉤傷破其足；既破足已，敷心在地，彼地鐵鉤傷破其心，若背著地鐵鉤破背，若傍著地鐵鉤破脇，若其坐者鐵鉤上入，彼人如是迭相唱喚，若燒若煮、飢渴身乾，迭相唱喚、號哭懊惱；一切罪人如是齊心看鉢頭摩，閻魔羅人在其背後，執大利刀，若斧若枷，割斫打之。",
        "translation": "彼地獄人飢渴苦惱，望鉢頭摩，彼人如是若百過走、若千過走，所走之道多饒鐵鉤傷破其足；既破足已，敷心在地，彼地鐵鉤傷破其心，若背著地鐵鉤破背，若傍著地鐵鉤破脇，若其坐者鐵鉤上入，彼人如是迭相唱喚，若燒若煮、飢渴身乾，迭相唱喚、號哭懊惱；一切罪人如是齊心看鉢頭摩，閻魔羅人在其背後，執大利刀，若斧若枷，割斫打之。",
        "source": "T17n0721_007:0037b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人種種方便求救求歸，到鉢頭摩；到已即上望涼冷故，彼鉢頭摩如佉陀羅，大火遍滿、金剛堅葉，罪人既上，樹葉鉤卷。",
        "translation": "Those hell-dwellers seek help and refuge in various ways and arrive at the padma; once they arrive, they go up and look at the cool, cold Padma, which is like a khadira, filled with a great fire and adamantine leaves, and once the offender gets up there, the leaves of the tree hook and roll.",
        "source": "T17n0721_007:0037c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼惡業人以惡業故，在合地獄鉢頭摩處，如是無量百千億歲，以惡業故，煮而不死，乃至作集惡不善業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "That person of evil karma remains in that place of the combined hellish padma for measureless, hundreds of billions of years as a result of evil karma, boiling and not dying, even when he's created bad and unskillful karma that's not yet broken or rotted and whose karmic energy hasn't yet ended, and he suffers more than once at all times; if his evil karma is ended, then he'll be freed from that place of hell.",
        "source": "T17n0721_007:0037c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，彼人則得雄雌等眼看視不正，無戒貧窮，壽命短促，作集業力之所致也。",
        "translation": "If good actions matured in a past life long ago, they won't be born in the path of hungry ghosts or animals; if someone is born among their peers, they'll get eyes like male and female that don't see correctly, lack discipline and poverty, and have a short life span, which is the result of the power of the actions they've collected.",
        "source": "T17n0721_007:0037c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Furthermore, knowing the results of his actions, that monk then investigates what place there is in the great hells combined.",
        "source": "T17n0721_007:0037c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處名為摩訶鉢頭摩處，是合地獄第十四處。",
        "translation": "They see and hear and know that there's another place called the place of mahāpadma, which is the fourteenth place combined with hell.",
        "source": "T17n0721_007:0037c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What activities of sentient beings are born in that place?",
        "source": "T17n0721_007:0037c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺、盜、邪行，樂行多作，墮合地獄，生於摩訶鉢頭摩處。",
        "translation": "They see: \"A person who kills, steals, commits wrong acts, and has many pleasurable actions falls into a shared hell and is born in the place of Mahāpadma.",
        "source": "T17n0721_007:0037c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing and stealing and their consequences are as explained above.",
        "source": "T17n0721_007:0037c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What's wrongdoing?",
        "source": "T17n0721_007:0037c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實非沙門，自謂沙門，而戒有缺。",
        "translation": "They really aren't ascetics, but they call themselves ascetics, and there are deficiencies in their precepts.",
        "source": "T17n0721_007:0037c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_007:0037c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖行梵行，不求涅槃。",
        "translation": "Although they practice the religious life, they don't seek nirvāṇa.",
        "source": "T17n0721_007:0037c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如貝聲行、笑涅槃行，如是念言：『我此梵行，願生天中，若生餘處，天相似處，令我生彼天世界中、天女眾中。』",
        "translation": "Like the practice of conch music and the practice of laughing at nirvāṇa, he thus thinks, 'In this religious practice, I wish to be born in a heaven, or if I were born elsewhere, in a place similar to a heaven, that I might be born in that heavenly realm among gods and goddesses.'",
        "source": "T17n0721_007:0037c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是沙門如是梵行，非梵行願，乃是愛行、生死因行、愛因緣行、是垢染行。",
        "translation": "Such an ascetic who thus engages in the religious practice is not vowing for the religious practice, but rather engaging in the practice of craving, the practice of the causes of birth and death, the practice of the causes and conditions of craving, and the practice of defilement.",
        "source": "T17n0721_007:0037c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是梵行，於病老死憂悲啼哭，椎胸拍頭憂苦懊惱，如是等惡，不得解脫。",
        "translation": "Such a religious practitioner laments and wails with sorrow over illness, old age, and death, beats their chests and heads with grief and distress, and such evils don't lead to liberation.",
        "source": "T17n0721_007:0037c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——合大地獄大鉢頭摩地獄處生，受大苦惱，所謂：有河名曰灰波，廣五由旬、長百由旬，常流不息，無針孔處灰不遍滿。",
        "translation": "As a result of this bad action, that person's body breaks up and his life ends, and he falls into a bad place-the great hell of Bodhidharma, where he's born and experiences great suffering and distress, which is called the river called the ash-wave, which is five leagues wide and a hundred leagues long and always flows without stopping, and there's no pinhole where ash doesn't fill it.",
        "source": "T17n0721_007:0037c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人在彼河中，受極堅[革*卬]第一苦惱，既墮彼河，身則分散、骨則為石、髮為水衣、肉則為泥，河中水者熱白鑞汁，地獄罪人身散還合為河中魚，彼河所漂；漂已則熟，右廂左廂，有炎嘴烏而噉食之，若望歸救走離彼河。",
        "translation": "When they fall into that river, their bodies are scattered, their bones are turned into stone, their hair into watery clothes, and their flesh into mud, and the water in the river is hot white pewter, so their hellish sins are scattered and merged into fish in the river, which floats along.",
        "source": "T17n0721_007:0037c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻魔羅人以鐵炎[矛*(替-曰+貝)]，[矛*(替-曰+貝)]置河中。",
        "translation": "The Yama people use an iron [spear*(ti-ya+pui)] and [spear*(ti-ya+pui)] to put in the river.",
        "source": "T17n0721_007:0038a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼若欲出，足則爛熟，筋熟、髀熟、腨熟、髖熟，髖骨亦熟、髖皮亦熟、髖肉亦熟，背肉墮落背肉亦熟，頭肉墮落頭肉亦熟，頭骨墮落頭骨亦熟，髑髏墮落髑髏亦熟。",
        "translation": "If they want to get out, their feet will rot, their tendons will ripen, their thighs will ripen, their jaws will ripen, their hips will ripen, their bones will ripen, their skin will ripen, their flesh will ripen, the flesh on their backs will ripen, the flesh on their heads will ripen, the bones on their skulls will ripen, and the calves on their skulls will ripen.",
        "source": "T17n0721_007:0038a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人如是河中，如是如是燒煮炙等，如是無量百千年歲，彼地獄人彼惡河中受極苦惱，爾乃得脫。",
        "translation": "That hell-being is liberated after he's been burned, boiled, roasted, and so forth in that river for measureless hundreds of thousands of years, and he's been subjected to extreme suffering in that awful river.",
        "source": "T17n0721_007:0038a10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖脫彼處而復更見有清陂池，池有開敷鉢頭摩花，彼地獄人望救望歸求安隱樂，走向彼處鉢頭摩林。",
        "translation": "Even though he's escaped from that place, he sees another clear, unpolluted lake with blossoming padma flowers, and that hell-being looks for rescue and returns to seek peace and happiness as he walks toward that padma grove.",
        "source": "T17n0721_007:0038a12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼鐵蓮花觸如利刀，彼地獄人身若觸之，彼鐵蓮花削割斬斫，身體碎壞，稍墮漸落；閻魔羅人多與苦惱，逼令速上蓮花林上，彼蓮花林滿中熾火，其花鐵葉，罪人既上葉則卷合，彼地獄人在其葉內熾火燒然，如是無量百千年歲，以惡業故。",
        "translation": "That iron lotus flower touches like a sharp sword, and if that hell-being touches it, that iron lotus flower cuts and chops him, breaking his body apart and causing it to fall down gradually; the Yama people often inflict suffering on him and force him to quickly ascend to the lotus flower grove, which is filled with blazing fire and has iron leaves, and once he ascends to those leaves, the leaves roll up and close around him, and that hell-being is engulfed in flames inside those leaves for measureless hundreds of thousands of years as a result of bad karma.",
        "source": "T17n0721_007:0038a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼中有烏而食其眼、拔其舌根、割截其耳、分散其身；如是烏者，自業果報。",
        "translation": "A crow in that place eats his eyes, plucks out his tongue, cuts off his ear, and scatters his body; such a crow is the result of its own actions.",
        "source": "T17n0721_007:0038a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人於彼摩訶鉢頭摩處地獄之中，常被燒煮，乃至作集惡不善業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "That hell-being is always burned and boiled in that mahāpadma hell, even when he's accumulated bad and unskillful actions that haven't broken down or rotted and whose karmic energy hasn't ended, and he suffers more than once at all times; if his bad actions are ended, then he'll be freed from that hellish place.",
        "source": "T17n0721_007:0038a22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，則患疾病、常飢常渴，復多瞋恚，是彼惡業餘殘果報。",
        "translation": "If good actions matured in a past life long ago, he won't be born in the path of hungry ghosts or animals; if he were born among humans, he'd suffer from illness, constant hunger and thirst, and much anger, which are the residual results of his bad actions.",
        "source": "T17n0721_007:0038a25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Knowing the results of actions, that monk then examines what place there is in the great hells combined.",
        "source": "T17n0721_007:0038a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處名火盆處，是合地獄第十五處。",
        "translation": "They see and hear and know that there's another place called the fire-pit, which is the fifteenth place in the combined hells.",
        "source": "T17n0721_007:0038a29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions of sentient beings are born in that place?",
        "source": "T17n0721_007:0038b02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺、盜、邪行，樂行多作，墮合地獄生火盆處。",
        "translation": "They see: A person who kills, steals, commits wrong acts, and enjoys doing many of them falls into the hells together and is born in a fire-pit.",
        "source": "T17n0721_007:0038b02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing and stealing and their consequences are as explained above.",
        "source": "T17n0721_007:0038b03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What's wrongdoing?",
        "source": "T17n0721_007:0038b04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實非沙門，自謂沙門。",
        "translation": "He's really not an ascetic but calls himself an ascetic.",
        "source": "T17n0721_007:0038b04_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作沙門已，憶念在家白衣身時，習近婦女喜笑舞戲。",
        "translation": "After becoming an ascetic, he recalls a time when he was at home in white clothing and used to get close to women who liked to laugh and dance.",
        "source": "T17n0721_007:0038b05_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是不善觀察，憶念喜樂，心生分別，數數如是思惟分別：非善思惟，非是正念證法思惟，非滅苦集正法思惟，非學思惟——於學思惟不作不行，非正憶念調心思惟，非念佛法眾僧思惟，非念死相，非於生死離欲思惟，非見少罪如微塵許怖畏思惟；不應多取敷具醫藥、看病飲食、資具因緣，彼如是人而便多取敷具醫藥、隨病飲食、資具因緣。",
        "translation": "Thus, that person doesn't well observe, remember, enjoy, and discriminate in their mind, and they repeatedly think and discriminate in this way: \"Not good reflection, not correctly mindful reflection on the realization of the teaching, not reflection on the right teaching to cease suffering and accumulate, not training reflection - not training reflection that doesn't work, not correctly recollecting and adjusting mind reflection, not mindful of the reflection of the Buddha, Dharma, and Saṃgha, not mindful of the marks of death, not free of desire for birth and death, not fearful reflection that sees a trifling sin like a tiny speck of dust; they shouldn't take much in the way of dressing medicine, food and drink for illness, or the requisites for their causes, but such a person takes much in the way of dressing medicine, food and drink for illness, or the requisites for their causes.",
        "source": "T17n0721_007:0038b06_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是多取臥具病藥飲食資具因緣，彼人以是惡業因緣，身壞命終墮於惡處——合大地獄生火盆處，受大苦惱，所謂苦者：彼火盆處熱炎遍滿，無毛頭處無炎無熱而不遍者，彼地獄處地獄人身狀如燈樹，彼燈熱炎合為一炎。",
        "translation": "As a result of that person's often taking the causes and conditions for laying cloth, medicines for illness, food, and provisions, that person's body breaks up and his life ends, and he falls into a bad place-combined with the burning pot of hell-to experience great suffering and distress, which is called suffering: the burning pot is filled with heat, and there's no hair-headed place that's without heat or heat that doesn't reach it; that place of hell where hell-bound people resemble a lamp tree, and the lamp's heat and heat are combined into a single heat.",
        "source": "T17n0721_007:0038b14_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人呻號吼喚，吼喚口開，滿口熱炎。",
        "translation": "That hell-being moans and cries, and his mouth opens with a cry that fills his mouth with hot flames.",
        "source": "T17n0721_007:0038b19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人極受大苦，轉復唱喚、呻號啼哭，火炎入耳；既入耳故，轉復呻號、唱聲吼喚，炎復入眼；既入眼故，轉復呻號、唱聲吼喚。",
        "translation": "That hell-being experiences extreme suffering and keeps calling and moaning and wailing, and the fire enters his ears; as it enters his ears, he moans and sings and roars again, and the heat enters his eyes; as it enters his eyes, he moans and sings and roars again.",
        "source": "T17n0721_007:0038b20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是普身炎燃，熱炎鐵衣復燒其舌。",
        "translation": "Thus, that person's whole body is set on fire, and his hot iron robe also burns his tongue.",
        "source": "T17n0721_007:0038b23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既破戒已，食他飲食，故燒其舌；以犯禁戒不善觀察，看他婦女，故燒其眼；以不護戒，共他婦女歌笑相喚，以愛染心聽其聲故，熱白鑞汁滿其耳中；以犯禁戒取僧香熏，故割其鼻，以火燒之。",
        "translation": "After violating the precepts, he eats another person's food and drink, which burns his tongue; because he violated the precepts by not observing well and looking at other women, it burns his eyes; because he didn't guard the precepts, he sings and laughs with other women and calls to them, and because he listens to their voices with a mind tainted by emotion, hot white pewter juice fills his ears; because he violated the precepts by taking the fragrance of the saṃgha, he cuts his nose and burns it with fire.",
        "source": "T17n0721_007:0038b24_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是五根犯戒墮地獄中，本業相似，受苦果報，惡業行故。",
        "translation": "That person thus violates the precepts with the five faculties and falls into hell, where their previous actions are similar and they experience the results of suffering and bad actions.",
        "source": "T17n0721_007:0038b29_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄中如是無量百千年歲，常被燒煮，多有炎鬘處處普遍滿合地獄，名火盆處。",
        "translation": "For an immeasurably long time, he'll be burned and boiled, and there will be lots of hot garlands everywhere that universally fill that hell, which is called the fiery abode.",
        "source": "T17n0721_007:0038c01_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至集作惡不善業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "Even when the accumulation of bad and unskillful actions that haven't been destroyed or rotted and the karmic energy hasn't ended, it's not only painful at all times; if bad actions are ended, that place of hell will then be liberated.",
        "source": "T17n0721_007:0038c03_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，得侏儒身，目盲耳聾，貧窮少死，常患飢渴，是彼惡業餘殘果報。",
        "translation": "If good actions matured in a past life long ago, and he isn't born in the path of hungry ghosts or animals, or if he lives among humans, he'll attain the body of a dwarf, become blind and deaf, become poor and die young, and always suffer from hunger and thirst, which are the residual results of his bad actions.",
        "source": "T17n0721_007:0038c05_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，次復觀察合大地獄，復有何處？",
        "translation": "\"Knowing the results of actions, that monk then examines what place there is in the great hells combined.",
        "source": "T17n0721_007:0038c08_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：復有異處，彼處名為鐵末火處，是合地獄第十六處。",
        "translation": "They see and hear and know: \"There's another place, which is called the place of iron dust and fire, which is the sixteenth place in the combined hells.",
        "source": "T17n0721_007:0038c10_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions of sentient beings are born in that place?",
        "source": "T17n0721_007:0038c11_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：若人殺生、偷盜、邪行，樂行多作，墮合地獄鐵末火處。",
        "translation": "\"They see and hear that if a person kills, steals, commits wrong actions, and enjoys many deeds, they'll fall into the fire place of iron that binds them to hell.",
        "source": "T17n0721_007:0038c12_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生、偷盜業及果報，如前所說。",
        "translation": "The actions of killing life and stealing and their consequences are as explained above.",
        "source": "T17n0721_007:0038c13_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者邪行？",
        "translation": "What are wrong actions?",
        "source": "T17n0721_007:0038c14_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：有人實非沙門，自謂沙門，若聞婦女歌舞戲笑莊嚴具聲，既聞聲已，不善觀察，心生愛染，聞彼歌笑舞戲等聲，漏失不淨，心適味著。",
        "translation": "It means that a person who really isn't an ascetic and calls themselves an ascetic hears the ornate sounds of women singing, dancing, playing, and laughing, and then after hearing those sounds, they don't observe them well, become defiled in their mind, lose the impurity of contaminants when they hear those sounds of singing, dancing, and playing, and become appropriately attached to them in their mind.",
        "source": "T17n0721_007:0038c14_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——合大地獄鐵末火處，受大苦惱，所謂：熱鐵四角地獄，周圍鐵壁五百由旬，常有鐵火熾燃不息燒地獄人，自業所作，從上雨火不曾暫停，如是雨鐵、如是雨火。",
        "translation": "As a result of this bad karma, he'll be destined to fall into a bad place at the end of his life - a place that combines the great hell of iron and terminal fire - and experience great suffering and distress, which is called a four-cornered hell of hot iron surrounded by an iron wall for 500 leagues, with an iron fire that's always glowing and doesn't stop burning the heller, which is the result of his own actions and which rains fire from above without pause, thus raining iron and thus raining fire.",
        "source": "T17n0721_007:0038c17_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以雨鐵故，彼地獄人一切身分分散為末；以雨火故，常煮常燒；常受如是二種雨苦。",
        "translation": "As a result of the rain of iron, all of that hell-being's bodies are scattered to the ends, and as a result of the rain of fire, he's always boiling and burning, and he's always subject to the two kinds of rain and suffering.",
        "source": "T17n0721_007:0038c22_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人如是受苦，唯地獄人受如是苦，除是以外無可譬喻。",
        "translation": "That hell-being thus suffers, and there's no way to compare it to the suffering that only hell-beings suffer.",
        "source": "T17n0721_007:0038c24_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是所受苦惱，堅[革*卬]急惡，如是惡苦一切皆畏，不愛不樂，自業所作。",
        "translation": "The suffering and distress they thus experience are resolute [ge*ang] and severe, and such severe suffering is feared by all, not loved or enjoyed, and produced by one's own actions.",
        "source": "T17n0721_007:0038c25_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是受苦乃至作集惡不善業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "Thus experiencing suffering up to the point where he creates bad and unwholesome actions that haven't yet broken down or rotted, and whose karmic energy hasn't yet ended, he'll continue to suffer for all time; if that bad action is ended, then he'll be freed from that place of hell.",
        "source": "T17n0721_007:0038c27_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，常在大河渡人之處，常生怖畏，若身常病，若當象等，雖有惡命而常畏死，是彼惡業餘殘果報。",
        "translation": "If good actions matured in a past life long ago, and they aren't born in the path of hungry ghosts or animals, or if they live among humans or are always in a place where a large river crosses a human being, and they're always afraid, or if they're always sick, or if they're like an elephant, or even though they have a bad life, they're always afraid of death, this is the residual result of their bad actions.",
        "source": "T17n0721_007:0038c29_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘觀察如是合大地獄一一別處，唯十六處，更不見有第十七處。",
        "translation": "\"That monk also observes that thus there are only 16 distinct places in the combined great hells, and he doesn't see a 17th place.",
        "source": "T17n0721_007:0039a04_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合大地獄十六別處，多眾常滿，如是觀察實業法報。",
        "translation": "Of the 16 specific places in the combined great hells, many are always filled, so he thus observes the results of the actions.",
        "source": "T17n0721_007:0039a06_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘如是觀察彼諸眾生種種惡業自在果報，厭離生死。",
        "translation": "That monk thus observes the unimpeded results of the various bad actions of those sentient beings, and he becomes disillusioned with birth-and-death.",
        "source": "T17n0721_007:0039a07_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行，如此比丘諦觀察已，通達業果，如是諦知三大地獄并別處所及業果報。",
        "translation": "\"Also, as a practitioner who reflects internally - following the right teaching and observing the practice of the teaching - after truly observing this, the monk comprehends the results of actions and thus truly knows the three great hells and their distinctive locations and the results of actions.",
        "source": "T17n0721_007:0039a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀察知已，攀緣通達，不樂有中住魔境界。",
        "translation": "After observing and knowing this, he climbs to the level of perception and doesn't enjoy the demonic realm of intermediate abode.",
        "source": "T17n0721_007:0039a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地夜叉見彼比丘如是精進，即復上聞虛空夜叉，虛空夜叉聞四大王，如前所說，次第乃至無量光天，乃至說言：『閻浮提中某國某村，如是次第剃除鬚髮被服法衣，正信出家，彼比丘如是乃至得第九地。』",
        "translation": "Seeing that monk's effort, that earthly yakṣa then went up and heard from the sky yakṣa, who heard from the four great kings as described above, and went up in turn to the heaven of infinite light, even saying, 'Thus, in turn, in a certain village in a certain country in Jambudvīpa, they shaved off their hair, put on the Dharma robe, and left home with correct faith; that monk thus went on to attain the ninth ground.'",
        "source": "T17n0721_007:0039a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量光天聞已歡喜，迭相告言：『天等當知！",
        "translation": "Rejoicing when they heard that, the Amitâbha gods repeatedly told him, 'Gods, you must know!'",
        "source": "T17n0721_007:0039a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔分損減，正法朋長。』",
        "translation": "The demonic side is diminished, and the right teaching grows in popularity.'",
        "source": "T17n0721_007:0039a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘如是觀察三地獄已，次復觀察第四叫喚之大地獄。",
        "translation": "\"After he thus observes the three hells, that monk then observes the fourth great hell of wailing.",
        "source": "T17n0721_007:0039a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼中？",
        "translation": "What activity do sentient beings undergo in that place?",
        "source": "T17n0721_007:0039a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：所謂有人殺生、偷盜、邪行、飲酒，樂行多作，如是四業普遍究竟，作而復集，身壞命終則生如是叫喚大地獄。",
        "translation": "\"They see and hear that there's a person who kills, steals, commits wrongful acts, drinks alcohol, and has many pleasurable actions, and that these four actions are completely universal, are created and collected again, and when their body breaks up and their life ends, they're born in the great hell of wailing like this.",
        "source": "T17n0721_007:0039a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺、盜、邪行業及果報如前所說，今說飲酒樂行多作，則生叫喚大地獄中。",
        "translation": "The actions and consequences of killing, stealing, and wrongdoing are as described previously, but now I'll talk about the many pleasures of drinking alcohol, which will lead to birth in the great hell of wailing.",
        "source": "T17n0721_007:0039a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人以酒與會僧眾，若與戒人——出家比丘、若寂靜人、寂滅心人、禪定樂者，與其酒故，心則濁亂。",
        "translation": "If a person gives alcohol to a congregation of monks, or if they give it to a person who follows the precepts - a renunciant monk, a tranquil person, a person of tranquil mind, or a person who enjoys meditation - that person's mind becomes turbid because of the alcohol they give.",
        "source": "T17n0721_007:0039a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——叫喚大地獄，彼中惡熱，受大苦惱。",
        "translation": "As a result of this bad action, he'll be destined to fall into a bad place at the end of his life - the great hell of wailing, where he'll suffer great pain and suffering from the intense heat.",
        "source": "T17n0721_007:0039a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受何等苦？",
        "translation": "What kind of suffering does he experience?",
        "source": "T17n0721_007:0039a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂：以鐵鉗強擘其口，洋赤銅汁灌口令飲，初燒其脣；既燒脣已，次燒其齒；既燒齒已，次燒其舌；既燒舌已，次燒其咽；如是燒咽，次燒其肚，如是次第燒其小腸；燒小腸已，復燒大腸，如是生藏，次燒熟藏；燒熟藏已，從下而出。",
        "translation": "That is, they forcefully break his mouth with iron forceps, pour red copper juice into it, and make him drink it; first, they burn his lips; after burning his lips, they then burn his teeth; after burning his teeth, they then burn his tongue; after burning his tongue, they then burn his throat; after thus burning his throat, they then burn his belly; after thus burning his small intestines; after burning his small intestines, they then burn his large intestines; after thus burning the raw store, they then burn the cooked store; after burning the cooked store, it comes out from underneath.",
        "source": "T17n0721_007:0039a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是彼人酒不善業，得如是報，號啼吼喚，呼嗟大哭。",
        "translation": "Thus, that person's unwholesome alcoholic activity brings such results, and he cries and wails, shouting and wailing.",
        "source": "T17n0721_007:0039b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼人如是唱喚吼已，閻魔羅人為責疏之，而說偈言：「『已作不善業，　　今受苦惱果，　　自癡心所作，　　後則被燒煮；　　如是不善業，　　已惡心所作，　　今受莫呻喚，　　何用呼嗟為？",
        "translation": "\"After that person thus cries and wails, the Yama-ra people reprimand them and say, 'That person has done unskillful actions that will now bring the results of suffering and distress, which were produced by their own deluded mind and will then be burned and boiled; thus, they've done unskillful actions with a bad mind and won't be able to moan and groan, so why do they need to cry out in contempt?'",
        "source": "T17n0721_007:0039b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人作惡業，　　皆得惡果報，　　若欲自樂者，　　如是莫近惡。",
        "translation": "If a person does bad actions, they'll all obtain the results of bad actions, and if they want to be comfortable, they mustn't approach badness like this.",
        "source": "T17n0721_007:0039b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若作少惡業，　　地獄多受苦，　　癡心自在故，　　得脫猶作惡。",
        "translation": "If someone does a little bad action, hell will be a painful place, and because of their deluded mind's freedom, they'll still do evil when they attain liberation.",
        "source": "T17n0721_007:0039b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　惡業不可信，　　令人到地獄，　　少火能燒山，　　及一切林樹。",
        "translation": "You can't believe in bad actions that lead to hell, where a little fire can burn mountains and all forests and trees.",
        "source": "T17n0721_007:0039b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　癡人念作惡，　　不喜樂善法，　　見惡行果報，　　皆從因緣生。",
        "translation": "A deluded person is mindful of doing evil, doesn't delight in good qualities, and sees that the results of bad actions are all produced from causes and conditions.",
        "source": "T17n0721_007:0039b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何不樂法？",
        "translation": "Why doesn't he delight in the Dharma?",
        "source": "T17n0721_007:0039b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何故不捨惡？",
        "translation": "Why don't you abandon evil?",
        "source": "T17n0721_007:0039b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人離惡業，　　則不見地獄；　　若人自心癡，　　不知惡業果，　　彼人受此惡，　　汝今如是受。",
        "translation": "If a person parts with bad karma, then they won't see hell; if they're deluded in their own mind and don't know the results of bad karma, they'll experience this evil, and so you'll experience it now.",
        "source": "T17n0721_007:0039b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　惡業生地獄，　　為惡業所燒，　　惡不到涅槃，　　怨不過惡業。",
        "translation": "Their evil actions give rise to hell, and they're burned by their evil actions; they won't reach nirvāṇa because of their evil actions, but they resent their evil actions.",
        "source": "T17n0721_007:0039b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　本惡業所誑，　　今為惡業燒，　　若不作惡業，　　終不受苦惱。",
        "translation": "They are burned by bad karma in the past, but if they don't do bad karma, they'll never experience suffering.",
        "source": "T17n0721_007:0039b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人能制愛，　　此道寂靜勝，　　如是捨愛人，　　則近涅槃住。",
        "translation": "If someone can control craving, the path of quiescence is superior, and if they thus abandon craving, they'll come close to living in nirvāṇa.",
        "source": "T17n0721_007:0039b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　已造惡業竟，　　不曾修行善，　　如是惡業燒，　　心勿行惡業。",
        "translation": "After creating bad actions and never cultivating goodness, his mind won't do bad actions when bad actions are burned up.",
        "source": "T17n0721_007:0039c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　行惡業之人，　　無處得安樂，　　若欲自樂者，　　應當喜樂法。",
        "translation": "There's nowhere that a person who does bad actions can be comfortable, and if he wants to be happy himself, he should delight in the Dharma.",
        "source": "T17n0721_007:0039c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人喜樂惡，　　受苦中之苦，　　若不能忍苦，　　不應作惡業。",
        "translation": "If someone takes delight in evil, they'll experience the worst of suffering, and if they can't tolerate suffering, they shouldn't do evil actions.",
        "source": "T17n0721_007:0039c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　善人行善易，　　惡人行善難；　　惡人造惡易，　　善人作惡難。』",
        "translation": "It's easier for a good person to do good, and harder for a bad person to do good; it's easier for a bad person to do evil, and harder for a good person to do evil.'",
        "source": "T17n0721_007:0039c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼地獄中閻魔羅人，如是責疏地獄人已，設種種苦，所謂二山：山甚堅[革*卬]，鐵炎火燃，兩相作勢，一時俱來，拶(嗟末反)地獄人，拶已磨之，其身散盡，無物可見；如是磨已，而復還生，復以二山如前拶磨，如是如是，生已復拶、生已復磨。",
        "translation": "\"After they thus reprimand a person from Yama in hell, they imagine various kinds of suffering, which are called two mountains: a very hard [gha*ang] mountain that's glowing with iron and burning with fire, and two forces that come together at once to squeeze (Gomal) the person from hell, and after squeezing and grinding him, his body is scattered, and nothing can be seen; after grinding him like this, he's born again, and he's squeezed and ground again with the two mountains as before, and so on and so forth, being squeezed again after birth and ground again after birth.",
        "source": "T17n0721_007:0039c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量百千年歲惡業未盡，彼地獄處若得脫已，走向餘處望救望歸，思得解脫。",
        "translation": "Thus, for measureless hundreds of thousands of years, if he's yet to end his bad karma, then after he's been freed from that place of hell, he'll go to another place, hoping for rescue and returning, thinking about gaining liberation.",
        "source": "T17n0721_007:0039c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻魔羅人即復執之，令頭在下，置鐵鑊中，彼人如是在鐵鑊中頭面在下，經百千年湯火煮之，如是惡業猶故不盡。",
        "translation": "That person is then again held by a Yama-ra man, made to put his head down in an iron cauldron, and while he's in the iron cauldron with his head and face down, he's boiled in the fire for a hundred thousand years, but his bad karma still hasn't ended.",
        "source": "T17n0721_007:0039c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼鑊湯處若得脫已，走向餘處望救望歸，欲求安樂。",
        "translation": "After he's freed from that place in the cauldron, he goes to another place, hoping to be saved and hoping to return, desiring peace and happiness.",
        "source": "T17n0721_007:0039c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人面前有大鐵烏，其身炎燃，即執其身，攫斲分散，脈脈節節為百千分，分散食之，分分分散，如是無量百千年歲，而彼惡業猶故不盡。",
        "translation": "That person has a large iron crow in front of them, and when its body is burning, they grab it, carve it up, and scatter it, disperse it in a hundred thousand parts by the vein, scatter it, and disperse it bit by bit for a hundred thousand years, yet their bad karma still hasn't ended.",
        "source": "T17n0721_007:0039c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼鐵烏處若得脫已，望救望歸，走向餘處，飢渴苦惱，遠見清水若陂池等，疾走往赴。",
        "translation": "After he attains liberation, he looks for help and returns, goes to another place, becomes hungry and thirsty, and sees clear water or a pond in the distance, and rushes off to go there.",
        "source": "T17n0721_007:0039c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處唯有熱白鑞汁滿彼池等，彼欲澡洗，即便入中；既入彼處，以惡業故，即有大黿取而沈之，熱白鑞汁煮令極熟，如是無量百千年歲，乃至不善惡業破壞無氣盡已，如是大黿爾乃放之。",
        "translation": "There's only hot pewter juice filling that pond or so, and they want to wash themselves, so they enter it. Once they enter that place, a large iguana takes it, sinks it because of bad karma, and boils the hot pewter juice until it's thoroughly cooked, which is uncountable for a hundred thousand years, up to the point where unwholesome bad karma is destroyed without stamina, and then such a large iguana releases it.",
        "source": "T17n0721_007:0039c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得脫已，彼人苦惱，望救望歸，走向餘處，面前現見閻魔羅人手執鐵[矛*(替-曰+貝)]，其[矛*(替-曰+貝)]炎燃，以如是[矛*(替-曰+貝)]而[矛*(替-曰+貝)]其頭，即便穿徹，或有被刺破背出者，或有被刺破脇出者，或有被刺破頭出者，彼地獄人受大苦惱，唱聲吼喚，餘地獄人罪業力故，聞其吼喚謂是歌聲，皆共走趣望救望歸。",
        "translation": "After they've been freed, that person is distressed and looks for help and returns, and they walk toward another place where they see Yama's hand holding an iron [spear*(ti-i-j+shell)] that's [spear*(ti-i-j+shell)] glowing, and they use such a [spear*(ti-i-j+shell)] to [spear*(ti-i-j+shell)] their head, even though it's pierced, and some are pierced through the back and come out, some are pierced through the back and come out, and some are pierced through the head and come out.",
        "source": "T17n0721_007:0040a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻魔羅人即復執之，鐵[矛*(替-曰+貝)]刀斧皆悉炎燃穿刺割斫。",
        "translation": "The Yama-ra people then take hold of them again, and their iron [spears*(ti-ya+pui)] swords and axes are all glowing, piercing, and cutting.",
        "source": "T17n0721_007:0040a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量百千年歲，乃至作集惡業破壞無氣爛盡，彼地獄處爾乃得脫。",
        "translation": "After doing so for measureless hundreds of thousands of years, until the bad karma they've collected destroys and rots away without energy, that place of hell is then freed.",
        "source": "T17n0721_007:0040a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "望救望歸，走向餘處，遠見有村，屋舍具足，多有河池，專心直進疾走往赴，欲入彼村；彼村一切皆悉炎燃，有金剛口利牙黑虫，身皆炎燃處處遍滿。",
        "translation": "Looking for help and hoping to return, he walks toward another place and sees a village with an abundance of houses and many rivers and pools, so he focuses his mind and walks quickly and directly toward it, wanting to enter that village; everything in that village is on fire, and there are vajra-mouthed, sharp-toothed black bugs whose bodies are on fire everywhere.",
        "source": "T17n0721_007:0040a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既入村已，門即密閉，彼地獄人為金剛口利牙黑虫之所噉食。",
        "translation": "Once they entered the village, the door was closed, and the people of that hell were eaten by those black bugs with vajra mouths and sharp teeth.",
        "source": "T17n0721_007:0040a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量百千年歲，乃至作集惡業破壞、無氣爛盡，得出如是苦惱大海。",
        "translation": "Thus, for measureless hundreds of thousands of years, they'll collect bad karma that destroys and rots away without energy, and they'll reach such an ocean of suffering and distress.",
        "source": "T17n0721_007:0040a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，心則忽忘，貧窮無物，常在道巷、四出巷中賣鄙惡物，治生求利。",
        "translation": "If there was good karma ripened long ago in a past life, they won't be born in the path of hungry ghosts or animals; if they live among humans, their minds suddenly forget about it, they become poor and have nothing, and they often sell vile and unwholesome goods in the alleys and lanes of the road to cure themselves and seek profit.",
        "source": "T17n0721_007:0040a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸小兒佯笑戲弄，口齒色惡，脚足劈裂，常患飢渴之所逼切，無有妻子，無父無母兄弟姊妹，此是飲酒與酒惡業，餘殘果報。",
        "translation": "Being teased by children, having a bad mouth and teeth, splitting their feet, being forced by hunger and thirst, and having no wife, father, mother, brothers, and sisters are the other cruel rewards of the bad actions of drinking alcohol and wine.",
        "source": "T17n0721_007:0040a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是戒人與酒罪業則墮如是叫喚大地獄，受苦果報，應如是知。",
        "translation": "Such a religious practitioner who commits the sin of drinking alcohol then falls into the great hell of wailing and experiences the results of suffering, which should be known like this.",
        "source": "T17n0721_007:0040a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，復觀叫喚之大地獄，有何別處？",
        "translation": "\"Furthermore, what's the difference between a monk who knows the results of his actions and one who observes the great hell of wailing?",
        "source": "T17n0721_007:0040a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：叫喚地獄有別異處，名大吼處。",
        "translation": "They see and hear and know that there's a different place in the hell of wailing that's called the place of great wailing.",
        "source": "T17n0721_007:0040a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions do sentient beings take that give rise to that place?",
        "source": "T17n0721_007:0040a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺生、偷盜、邪行、飲酒樂行多作，墮彼地獄生大吼處。",
        "translation": "They see that a person who kills, steals, commits wrongful acts, drinks alcohol, and engages in many pleasurable activities falls into that hell and is born in a place of great roar.",
        "source": "T17n0721_007:0040a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺、盜、邪行業及果報，如前所說。",
        "translation": "The actions and rewards of killing, stealing, and wrongdoing are as explained above.",
        "source": "T17n0721_007:0040b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者飲酒？",
        "translation": "\"What's drinking alcohol?",
        "source": "T17n0721_007:0040b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂：以酒與齋戒人、清淨之人。",
        "translation": "\"It's called giving alcohol to a person who observes the precepts or is pure.",
        "source": "T17n0721_007:0040b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——叫喚地獄大吼處生，受大苦惱，所謂苦者：熱白鑞汁先置口中，以本持酒與齋戒人、與清淨人惡業所致故，以炎燃鐵鉢盛之置其口中，大苦逼惱，發聲大吼。",
        "translation": "As a result of that bad action, he'll be destined to fall into a bad place at the end of his life - a place that wails and roars in hell - and experience great suffering and distress, which is called suffering when hot pewter juice is first put in his mouth as a result of bad actions taken with a purifier or a purified person, and a fiery iron bowl is placed in his mouth, which causes great suffering and distress, and he produces a loud roar.",
        "source": "T17n0721_007:0040b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是吼聲，餘地獄中則不如是。",
        "translation": "Such a roar isn't like that in other hells.",
        "source": "T17n0721_007:0040b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸罪人生大悲苦，唱聲吼喚，大吼之聲遍滿虛空。",
        "translation": "Those sinners become very compassionate and pained, and they shout and roar, filling the sky with the sound of their loud roar.",
        "source": "T17n0721_007:0040b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻魔羅人本性自瞋，彼地獄人罪業力故，閻魔羅人聞其吼聲，倍更瞋怒。",
        "translation": "Yama's own nature is anger, but because of the sinful actions of those people in hell, Yama's anger is intensified when he hears his roar.",
        "source": "T17n0721_007:0040b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸飲酒人不護諸惡，一切不善不生慚愧。",
        "translation": "Those who drink alcohol don't guard the bad, and they don't become conscience about all the unwholesome things they do.",
        "source": "T17n0721_007:0040b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若與酒者，是則與人一切不善，以飲酒故，心不專正、不護善法，心則錯亂；彼亂心人不識好惡，一切不善不生慚愧；若人與酒則與其因，以有因故，能為不善。",
        "translation": "If someone gives alcohol, then they give people everything unwholesome because, after drinking alcohol, their minds aren't focused and correct, they don't protect what's good, and their minds are disturbed; those disturbed people don't recognize good and evil, and all that's unwholesome doesn't give rise to a sense of shame; if someone gives alcohol, then they give it as a cause, and it's because there's a cause that it's capable of being unwholesome.",
        "source": "T17n0721_007:0040b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如相似因，相似得果。",
        "translation": "As similar causes, they similarly attain results.",
        "source": "T17n0721_007:0040b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此因緣，久受大苦，種種苦惱、無量苦惱。",
        "translation": "As a result of these causes, they'll experience great suffering for a long time, with various kinds of suffering and immeasurable suffering and distress.",
        "source": "T17n0721_007:0040b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名曰大吼地獄？",
        "translation": "Why is it called the great roaring hell?",
        "source": "T17n0721_007:0040b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以受無量種種苦惱，發聲大吼，是故名曰大吼地獄。",
        "translation": "Because they experience measureless kinds of suffering and distress, they make a loud noise and roar, which is why it's called the hell of great roaring.",
        "source": "T17n0721_007:0040b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生在如是處，乃至不善惡業破壞、無氣爛盡，彼地獄處爾乃得脫。",
        "translation": "Thus, when sentient beings are in such a place, even when their unwholesome bad actions are destroyed and their lack of energy rots away, then they'll be freed from that place of hell.",
        "source": "T17n0721_007:0040b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，生則愚鈍，心不黠慧，則多忘失，少時不憶。",
        "translation": "If they had good actions ripened long ago in a past life, they won't be born in the path of hungry ghosts or animals; if they were born among humans, they'd be born dull and unsophisticated, and they'd often forget and not remember for a few moments.",
        "source": "T17n0721_007:0040b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是闇鈍愚癡之人，無有資財，人不敬愛，貧窮無物，雖復求財而不可得，若得微病即便命終，是彼惡業餘殘果報。",
        "translation": "Such a dull and foolish man has no possessions, isn't respected by others, is poor and lacks possessions, and even though he seeks possessions, he can't obtain them, and if he gets a slight illness, he'll die, which is the remaining result of the residue of his bad actions.",
        "source": "T17n0721_007:0040b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，復觀叫喚之大地獄，復有何處？",
        "translation": "\"Furthermore, knowing the results of actions, that monk also observes the great hell of wailing, so where is it?",
        "source": "T17n0721_007:0040b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：如是叫喚地獄有十六處，何等十六？",
        "translation": "They see: \"There are 16 places in the hell of such wailing; what are the 16?",
        "source": "T17n0721_007:0040b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一名大吼；二名普聲；三名髮火流；四名火末虫；五名熱鐵火杵；六名雨炎火石；七名殺殺；八名鐵林曠野；九名普闇；十名閻魔羅遮約曠野；十一名劍林；十二名大劍林；十三名芭蕉烟林；十四名有煙火林；十五名火雲霧；十六名分別苦。",
        "translation": "One is called the great roar; two are called the universal voice; three are called the streams of hair and fire; four are called the fire worms; five are called the fiery iron pounder; six are called the rain-flaming flint; seven are called killing; eight are called the iron forest wilderness; nine are called the universal darkness; ten are called the Yama Rājagṛha wilderness; eleven are called the sword forest; twelve are called the great sword forest; thirteen are called the plantain smoke forest; fourteen are called the smoky fire forest; fifteen are called the fire clouds and fog; and sixteen are called the discriminating pain.",
        "source": "T17n0721_007:0040b27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此十六處叫喚地獄所有別處。",
        "translation": "These 16 places call out to all the other places in hell.",
        "source": "T17n0721_007:0040c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業報生彼處？",
        "translation": "What are the results of sentient beings' actions that give rise to those places?",
        "source": "T17n0721_007:0040c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘如是已觀叫喚地獄大吼處已，次觀第二，名普聲處。",
        "translation": "After he thus observes the place of the great roar of the hell of wailing, that monk next observes the second place, which is called the place of universal voice.",
        "source": "T17n0721_007:0040c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺生、偷盜、邪行、飲酒樂行多作，彼人則墮叫喚地獄，生普聲處。",
        "translation": "He sees that when a person kills, steals, commits wrongful acts, drinks alcohol, and engages in many pleasurable behaviors, that person falls into the hell of wailing and is born in the place of universal sound.",
        "source": "T17n0721_007:0040c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺、盜、邪行業及果報，如前所說。",
        "translation": "The actions and rewards of killing, stealing, and wrongdoing are as explained above.",
        "source": "T17n0721_007:0040c08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者飲酒？",
        "translation": "\"What's drinking alcohol?",
        "source": "T17n0721_007:0040c09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人飲酒樂行多作，若於他人初受戒者與酒令飲。",
        "translation": "\"Suppose a person drinks alcohol and engages in many pleasurable practices, or suppose they give alcohol to another person who's just received the precepts and make them drink.",
        "source": "T17n0721_007:0040c09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——叫喚地獄普聲處生，受大苦惱，所謂杵築：彼地獄人發聲吼喚，其聲遍滿彼地獄處、若鐵圍山、一切諸河、四天下處、閻浮提等，在彼處者彼吼聲出，一切消盡，彼人啼哭悲號吼聲自業相似。",
        "translation": "As a result of that bad action, he'll fall into a bad place when his body breaks up and his life ends - a place where people shout about the universal sound of hell and experience great suffering, which is called the pounder: that hell-being's voice roars, and its sound fills that place of hell, such as the iron mountains, all the rivers, the four lower realms, and Jambudvīpa, etc., where his roar goes out and everything dies out, and that person's lamentation and roar resemble their own actions.",
        "source": "T17n0721_007:0040c10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼地獄人如是吼喚，乃至惡業未壞未爛、業氣未盡，於一切時與苦不止；若惡業盡，彼地獄處爾乃得脫。",
        "translation": "When a person in that hell thus roars, even when his bad actions haven't broken down or rotted away and his karmic energy hasn't ended, his suffering doesn't end at all times; if his bad actions have ended, then he'll be freed from that place in hell.",
        "source": "T17n0721_007:0040c15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，則生曠野少水國土。",
        "translation": "If good actions matured in a past life long ago, he won't be born in the path of hungry ghosts or animals; if he lives among humans, he'll be born in a wilderness land with little water.",
        "source": "T17n0721_007:0040c18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼比丘知業果報，復觀叫喚之大地獄，復有何處？",
        "translation": "\"Furthermore, knowing the results of actions, that monk observes the great hell of wailing, where is it again?",
        "source": "T17n0721_007:0040c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知：喚大地獄復有異處，名髮火流，是彼地獄第三別處。",
        "translation": "They see and hear and know that there's another place in the great hell of awakening called the burning stream of hair, which is the third distinct place in that hell.",
        "source": "T17n0721_007:0040c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生何業生於彼處？",
        "translation": "What actions do sentient beings take that give rise to that place?",
        "source": "T17n0721_007:0040c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見：有人殺生、偷盜、邪行、飲酒樂行多作，彼人則墮叫喚地獄髮火流處。",
        "translation": "\"They see: If someone kills, steals, commits wrongful acts, and engages in drinking and pleasure activities often, they'll fall into the hell of wailing and the place where their hair burns.",
        "source": "T17n0721_007:0040c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺、盜、邪行業及果報，如前所說。",
        "translation": "The actions and consequences of killing, stealing, and wrongdoing are as explained above.",
        "source": "T17n0721_007:0040c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者飲酒？",
        "translation": "\"What's drinking alcohol?",
        "source": "T17n0721_007:0040c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於優婆塞五戒人邊說酒功德，作如是言：『酒亦是戒？』",
        "translation": "Speaking of the merits of alcohol among the five lay practitioners of the Upāsaka precepts, he said, 'Is alcohol also a precept?'",
        "source": "T17n0721_007:0040c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令其飲酒。",
        "translation": "He's made to drink alcohol.",
        "source": "T17n0721_007:0040c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人以是惡業因緣，身壞命終墮於惡處——叫喚地獄髮火流處，受大苦惱，所謂雨火，彼地獄人常被燒煮，炎燃頭髮，乃至脚足有熱鐵狗噉食其足，炎嘴鐵鷲破其髑髏而飲其腦，熱鐵野干食其身中，如是常燒、如是常食。",
        "translation": "As a result of that bad action, he'll be destined to fall into a bad place at the end of his life - a place called hell where hair is on fire and he'll experience great suffering, which is called rain and fire. That person in hell is always burned, and his hair is scorched hot, and his feet are devoured by hot iron dogs, hot-jawed iron eagles break his skull and drink his brains, and hot iron wild animals eat his body, and he's always burned and fed like this.",
        "source": "T17n0721_007:0040c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼人自作不善惡業，悲苦號哭，說偈傷恨，向閻羅人而作是言：「『汝何無悲心？",
        "translation": "\"That person creates unwholesome bad karma on their own, laments and wails, speaks a verse, and hurts the person, saying to the Yama, 'Why don't you have compassion?'",
        "source": "T17n0721_007:0041a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　復何不寂靜？",
        "translation": "Why isn't it quiescent again?",
        "source": "T17n0721_007:0041a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我是悲心器，　　於我何無悲？』",
        "translation": "'Am I a vessel of compassionate thought, and why is there no compassion in me?'",
        "source": "T17n0721_007:0041a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「閻魔羅人答罪人曰：「『汝為癡所覆，　　自作多惡業，　　今受極重苦，　　非我造此因。",
        "translation": "\"Yama replied to the sinner, 'You were hindered by delusion, created many bad actions yourself, and now you're suffering terribly, but I didn't cause this.",
        "source": "T17n0721_007:0041a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　癡人不學戒，　　作集多惡業，　　既有多惡業，　　今得如是果。",
        "translation": "A deluded person who doesn't train in morality creates and collects lots of bad actions, and since he's done lots of bad actions, he's now attained this result.",
        "source": "T17n0721_007:0041a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是汝之所作，　　非是我因緣，　　若人作惡業，　　彼業則是因。",
        "translation": "You did this, not as a cause or condition of mine, and if someone does bad actions, those actions are the cause.",
        "source": "T17n0721_007:0041a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　已為愛羂誑，　　作惡不善業，　　今受惡業報，　　何故瞋恨我？",
        "translation": "Having done bad and unskillful actions for the sake of lust and deceit, and now suffering the results of bad actions, why does he hate me?",
        "source": "T17n0721_007:0041a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不作不受殃，　　非謂惡無因，　　若人意作惡，　　彼人則自受。",
        "translation": "It's not evil without a cause if you don't do it and don't receive evil, but if someone intends to do evil, they'll receive it themselves.",
        "source": "T17n0721_007:0041a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　莫喜樂飲酒，　　酒為毒中毒；　　常喜樂飲酒，　　能殺害善法。",
        "translation": "Don't drink alcohol with pleasure; it's poisonous and poison-infused, and drinking alcohol with constant pleasure can kill good qualities.",
        "source": "T17n0721_007:0041a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若常樂飲酒，　　彼人非正意，　　意動法叵得，　　故應常捨酒。",
        "translation": "If someone always enjoys drinking wine, their intention is not right, and the mental dharma is unobtainable, so they should always abstain from alcohol.",
        "source": "T17n0721_007:0041a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　酒為失中失，　　是智者所說，　　如是莫樂酒，　　自失令他失。",
        "translation": "Wine is a loss within a loss, which is explained by wise people, so don't enjoy wine, for it will cause others to lose it.",
        "source": "T17n0721_007:0041a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　常喜樂飲酒，　　得不愛惡法，　　如是得言惡，　　故應捨飲酒。",
        "translation": "Always delighting in alcohol, one attains a dislike for bad qualities, and thus attains what's called bad, so one should always abstain from drinking alcohol.",
        "source": "T17n0721_007:0041a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　財盡人中鄙，　　第一懈怠本，　　飲酒則有過，　　如是應捨酒。",
        "translation": "When wealth is exhausted, it's despicable among humans, the root of the greatest laziness, and drinking alcohol is a fault; therefore, you should abandon alcohol.",
        "source": "T17n0721_007:0041a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　酒能熾燃欲，　　瞋心亦如是，　　癡亦因酒盛，　　是故應捨酒。』",
        "translation": "Wine burns desire, so does anger, and delusion flourishes because of wine; therefore, one should abstain from drinking wine.'",
        "source": "T17n0721_007:0041a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是地獄髮火流處，是地獄人自業所得，乃至作集惡業破壞、無氣爛盡，彼地獄處爾乃得脫。",
        "translation": "\"Thus, the place where the hair of hell burns off is the result of a person's own actions in hell, up to the point where he creates bad karma that destroys it and rots away without energy, and then he'll be freed from that place of hell.",
        "source": "T17n0721_007:0041b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於前世過去久遠有善業熟，不生餓鬼、畜生之道；若生人中同業之處，彼人則生一種國土無酒之處，一切資具無色無味，不知色味，是本惡業餘殘果報。",
        "translation": "If there was good activity ripened long ago in a past life, he won't be born in the path of hungry ghosts or animals; if he were born among humans, he'd be born in a land where there's no alcohol, and all his necessities would be formless and tasteless, without knowing form or taste, which are the residual results of his bad actions.",
        "source": "T17n0721_007:0041b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法念處經卷第七",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 7",
        "source": "T17n0721_007:0041b08_0",
        "is_bad_quality": false
    }
]