[
    {
        "source_sentence": "妙法聖念處經卷第三",
        "translation": "Sutra of the Sacred Mindfulness of the Wonderful Dharma, Volume 3",
        "source": "T17n0722_003:0424c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大宋西天中印度摩伽陀國那爛陀寺",
        "translation": "Nālandā Temple, Magadha, Central India, Western India, Tāsang",
        "source": "T17n0722_003:0424c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏傳教大師賜紫沙門臣法天",
        "translation": "Tripiṭaka Missionary Master Granted to the Purple Monk Minister Dharma Heaven",
        "source": "T17n0722_003:0424c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translation of the imperial edict",
        "source": "T17n0722_003:0424c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「若復有人於未來世，求生人天、厭離苦果，應當遠離諸業煩惱，暴惡淫逸及離妄語，破壞損惱一切有情，修諸善業，漸令增長，相續恒時，獲報安樂，捨離苦惱。」",
        "translation": "It was then that the Buddha addressed the monks, \"If another person in a future life seeks to be born among humans and gods and is disillusioned with the results of suffering, they should avoid the afflictions of actions, violent sexual excesses, and false speech that damage and harm all sentient beings, cultivate good actions that gradually increase, and continuously and constantly attain the rewards of well-being and freedom from suffering and distress.\"",
        "source": "T17n0722_003:0424c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「暴惡能遠離，　　苦澁果非有，　輕毀妄語無，　　聞名皆歡喜。",
        "translation": "It was then that the Bhagavān spoke this verse, \"A violent evil can be abandoned, the fruit of suffering is not present, disparaging false speech is absent, and those who hear its name rejoice.",
        "source": "T17n0722_003:0424c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　邪執宿冤賊，　　伏除令不起，　覺悟煩惱染，　　恒修諸對治。」",
        "translation": "He quells long-standing enemies and thieves with wrong attachments, causes them to cease, awakens to the defilement of afflictions, and constantly cultivates antidotes.\"",
        "source": "T17n0722_003:0424c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「若復有人值遇違緣，於自及他應當覺悟；破壞遠離虛妄計執，想諸聖賢，修於忍行，又於財物，離貪妄想；人及非人，世及出世，正道、非道，若男、若女，善惡業果，真實虛妄，宮殿房室，恭敬供養，乃至一切諸染淨境，勿起妄執，亦非憎嫉。",
        "translation": "It was then that the Buddha addressed the monks, \"If another person encounters a disagreeable situation, they should awaken to it for themselves and others; they should avoid false attachments, conceive of sages and virtuous persons, cultivate the practice of forbearance, avoid craving for possessions and false notions, whether human or not, worldly or transmundane, right path or wrong path, male or female, the results of good and bad actions, real or false, palaces and rooms, respect and offerings, and even all defiled and pure objects; don't give rise to false attachments; don't hate or resent them.",
        "source": "T17n0722_003:0424c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真實離妄，悲愍有情，入聖階漸，遠離地獄，損壞琰魔，除滅黑暗，修習智慧。",
        "translation": "Truly free of delusion, they have compassion for sentient beings, enter the gradual stages of holiness, leave hell, damage Diadem, remove darkness, and cultivate wisdom.",
        "source": "T17n0722_003:0424c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪、忿染因，猶如火毒，悉應捨離；業報艱辛，懺悔發露，不應覆藏。",
        "translation": "The defiling causes of greed and anger are like fire and poison, which should all be abandoned; the results of actions are painful, repentant, and revealed, and shouldn't be hidden.",
        "source": "T17n0722_003:0424c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文字曉了，宣說苦因，咸應遠離。」",
        "translation": "They should all be avoided because they understand the words and explain the causes of suffering.\"",
        "source": "T17n0722_003:0424c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「若復有人於諸惡友及他眷屬，勿生憎嫉，應起是念：『我從無始多劫已來，輪轉諸趣，父母親族，善友知識，輪轉生死往來不定；於諸有情，應當悲愍起親愛想。』",
        "translation": "The Buddha told the monks, \"Suppose another person doesn't become hateful and resentful of bad friends and their retinues, but instead thinks, 'Since beginningless time, I've been in transmigration through many destinies, and my parents, relatives, and good friends and acquaintances have been in transmigration through birth-and-death and come and go indefinitely; I should have compassionate thoughts of affection for all sentient beings.'",
        "source": "T17n0722_003:0425a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪、瞋等惑，由此遠離。」",
        "translation": "As a result, the afflictions of craving and ill-will are freed from.\"",
        "source": "T17n0722_003:0425a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘白世尊言：「若復有人虛妄兩舌，離間彼此，當感何果？",
        "translation": "The monks then said to the Bhagavān, \"If another person speaks falsely and contradictorily to one another, what result will that bring?",
        "source": "T17n0722_003:0425a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛演說，我等樂聞利益未來一切有情。」",
        "translation": "May the Buddha explain this, and we'll gladly hear it for the benefit of all sentient beings in the future.\"",
        "source": "T17n0722_003:0425a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「應知兩舌獲報差別，略有十種。",
        "translation": "The Buddha told the monks, \"You should know that there are slightly more than ten kinds of distinctions in the rewards that two tongues receive.",
        "source": "T17n0722_003:0425a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T17n0722_003:0425a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、種族卑賤，眷屬乖離；二、遠離善友，惡友增多；三、愚癡暗鈍，增長過非；四、毀謗聖賢，不信因果；五、藏護己失，樂說他非；六、虛妄轉增，忠實行寡；七、死墮地獄，受苦無窮；八、恣縱貪、瞋，惡名流布；九、財貨散失，恒時憂苦；十、遠離正法，恒生邊地。",
        "translation": "1. their race is inferior, and their dependents are estranged; 2. they avoid good friends and increase the number of bad ones; 3. their folly and ignorance increase their faults; 4. they denigrate noble and virtuous people and don't believe in the law of cause and effect; 5. they guard their faults and delight in speaking ill of others; 6. they become more false and less faithful; 7. they fall into hell at death and experience endless suffering; 8. they indulge in greed and anger, and their bad reputation spreads; 9. they lose their possessions and goods and are constantly sad and distressed; 10. they are removed from the right teaching and are constantly born in a marginal land.",
        "source": "T17n0722_003:0425a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應知，兩舌之業獲報如是，不應執著，皆當棄捨。」",
        "translation": "A monk should know that this is the result of the action of duplicity, so he shouldn't cling to it; he should discard it.\"",
        "source": "T17n0722_003:0425a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是比丘復白佛言：「若有眾生發麁惡語，感於何果？」",
        "translation": "The monk then again said to the Buddha, \"If a sentient being speaks harshly, what will be the result?\"",
        "source": "T17n0722_003:0425a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「應知語業，獲報有十。",
        "translation": "The Buddha told the monks, \"You should know that there are ten rewards that result from verbal action.",
        "source": "T17n0722_003:0425a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T17n0722_003:0425a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、口出刃焰，焚燒自身；二者、邪見熾盛，無惡不作；三者、遠離聖賢，日增惡友；四者、眾皆厭棄，猶如諸毒；五者、外器險隘，高下不等；六者、煩惱熾盛，壞散財物；七者、焚燒眾善，非法轉增；八者、身體臭穢，聞皆嫌厭；九者、支節枯乾，恒時病苦；十者、死墮險趣，輪轉生死。",
        "translation": "1. a. a flaming sword that comes out of your mouth and burns you; 2. wrong views that are so blazing that you can't do anything bad; 3. avoiding noble people and good men, they increase their bad friends day by day; 4. being disliked by everyone, just like poison; 5. external objects that are narrow and dangerous and have unequal heights; 6. afflictions that are so blazing that they scatter possessions; 7. burning all goodness, which increases illegitimacy; 8. a body that smells bad and is disliked by everyone who hears it; 9. a limb that withers, which causes constant illness; 10. falling into a dangerous destiny of death, which is a cycle of birth and death.",
        "source": "T17n0722_003:0425a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應知，麁惡語業，招如斯報，汝應遠離。」",
        "translation": "Monks should know that this is the result of harsh speech, and you should avoid it.\"",
        "source": "T17n0722_003:0425a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊乃說頌言：「眾善應可愛，　　如父復如母，　美善體安然，　　能離於喧諍；　美善人天喜，　　美善增勤勇；　美善眷屬多，　　美善三塗離；　美善息諸惡，　　美善離煩惱，　能棄語過非，　　應修諸眾善。」",
        "translation": "It was then that the Bhagavān spoke this verse, \"They are good and desirable, like father and mother, good in body and peaceful, able to avoid strife, good in the joy of humans and gods, good in increasing diligence and courage, good in having many dependents, good in avoiding the three destinies, good in calming evil, good in being free of affliction, good in discarding errors in speech, and good in cultivating good qualities.\"",
        "source": "T17n0722_003:0425a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，告諸比丘：「如是所發麁惡之語，悉應遠離，伏除不起勿令增長，墮於地獄受飢渴苦，種種痛惱。",
        "translation": "After speaking this verse, the Bhagavān addressed the monks, \"Such harsh speech should all be avoided, suppressed, and prevented from growing, so that they'll fall into hell and experience hunger, thirst, pain, and various kinds of suffering.",
        "source": "T17n0722_003:0425b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼惡趣，恒時飢渴如火焚燒，常思飲食，量如芥子，終不能得，何況多食！",
        "translation": "In that bad destiny, constant hunger and thirst are like burning fire, and I always think about food and drink, the amount of which is like a mustard seed, but I'll never be able to get it, so why should I eat much?",
        "source": "T17n0722_003:0425b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘應知，彼諸有情，由此惡業極苦纏縛，飢渴焰火，相續逼迫時無暫息。",
        "translation": "\"Monks should know that these sentient beings are tied up in extreme suffering by this bad action, and the fires of hunger and thirst continue to oppress them for a long time without respite.",
        "source": "T17n0722_003:0425b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是苦果，皆由虛妄、麁惡語業之所招感。",
        "translation": "Such painful results are all brought about by false and harsh verbal actions.",
        "source": "T17n0722_003:0425b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應知，虛妄惡業及諸功德、人天勝善，皆由心造。",
        "translation": "Monks should know that false and bad actions, merits, and superior human and divine goodness are all created by the mind.",
        "source": "T17n0722_003:0425b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若癡增上，輕毀賢善，起惡意業，遠離平等，樂說彼此長短是非，如油欲盡燈光漸暗，智慧損減，過犯轉增。",
        "translation": "If delusion increases, goodness is despised, bad mental activity arises, and equality is avoided, and it's pleasant to talk about each other's length and shortcomings, that's like when the desire for oil runs out and the lamp's light gradually goes dim, wisdom decreases, and transgressions increase.",
        "source": "T17n0722_003:0425b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，比丘恒應遠離虛妄惡業，勿令侵害；於他名利，若生嫉妬及諸忿等，惱亂身心，時無暫息。",
        "translation": "Therefore, monks should always avoid false and bad actions that would harm them, and if they become jealous of the fame and profit of others, such as jealousy and anger, they'll be disturbed in body and mind for a long time without respite.",
        "source": "T17n0722_003:0425b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應知，此等惡因，焚燒自善，於當來世，必招苦果輪迴不息，應當棄捨。」",
        "translation": "A monk should know that these bad causes burn up his own goodness and will bring about a cycle of painful results that won't end in a future life, so he should abandon them.\"",
        "source": "T17n0722_003:0425b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「若有眾生於情、非情，恒起瞋忿，獲於何報？」",
        "translation": "The monks then again said to the Buddha, \"If a sentient being is constantly angry with both sentient and insentient beings, what will be the result?\"",
        "source": "T17n0722_003:0425b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「應知瞋忿，於當來世，得十衰損。",
        "translation": "The Buddha told the monks, \"You should know that anger will cause ten kinds of decrease in a future life.",
        "source": "T17n0722_003:0425b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T17n0722_003:0425b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、冤家增盛，人皆嫌厭；二者、生於邊地，遠離正法。",
        "translation": "1. enemies prosper, and people dislike them; 2. they're born in a marginal land, far removed from the right teaching. 3.",
        "source": "T17n0722_003:0425b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、縈纏諸病，貧乏困苦；四者、死墮豺狼，巇險暴惡；五者，或處毒蛇，恒時瞋恚；六者、諸根醜陋，眷屬乖離；七者、死墮黑繩，受苦相續；八者、肢體乾焦，眾苦燒然；九者、增於邪執，毀謗聖賢；十者、恒處三塗，輪轉不息。",
        "translation": "3. lingering illnesses, poverty, and hardship; 4. death by wolf, a ravine, and violence; 5. being exposed to poisonous snakes and constant anger; 6. ugly faculties and estranged retinues; 7. death by black bonds, which brings continual suffering; 8. parched limbs and burning pain; 9. increased mistaken attachment, which denigrates noble and virtuous people; 10. constantly living in the three destinies, with no break in cyclic existence.",
        "source": "T17n0722_003:0425b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十種，皆由瞋恚。",
        "translation": "These ten things are all caused by anger.",
        "source": "T17n0722_003:0425b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當知，悉應遠離。」",
        "translation": "Monks, you should know that you should all avoid it.\"",
        "source": "T17n0722_003:0425b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，比丘復白佛言：「若有眾生恒修無瞋，獲於何報？」",
        "translation": "At that point, the monk again said to the Buddha, \"If sentient beings constantly cultivate the absence of anger, what reward will they receive?\"",
        "source": "T17n0722_003:0425c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「得十勝利。",
        "translation": "The Buddha told the monks, \"Attain ten excellent benefits.",
        "source": "T17n0722_003:0425c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T17n0722_003:0425c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、善美流布；二者、遠離慢輕；三者、能伏瞋恚；四者、三塗捨離；五者、冤敵不侵；六者、恒生人天；七者、眷屬圓滿；八者、諸根無缺；九者、色相具足；十者、成就解脫。",
        "translation": "One, they spread goodness; two, they're free of conceit; three, they subdue anger; four, they abandon the three afflictions; five, they're not attacked by enemies; six, they're always born among humans and gods; seven, their retinue is complete; eight, their faculties are not deficient; nine, their appearance is complete; and ten, they achieve liberation.",
        "source": "T17n0722_003:0425c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應知，如是勝利，汝當修習。」",
        "translation": "You should know, monks, that this is an excellent benefit that you should cultivate.\"",
        "source": "T17n0722_003:0425c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊乃說頌言：「衰損由瞋業，　　沈淪苦海深，　諸根多缺陋，　　逼迫事難任。",
        "translation": "It was then that the Bhagavān spoke this verse, saying, \"It's the karma of anger that's debilitating, sinking deep into the ocean of suffering, with many deficiencies in the faculties, and making things difficult to handle.",
        "source": "T17n0722_003:0425c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善因生善道，　　非法入埿梨，　傍生并鬼趣，　　善惡業恒隨。」",
        "translation": "Good causes give rise to good destinies, while immoral beings enter the śarīpa, and rebirths as an animal or ghost are constant followers of good and bad actions.\"",
        "source": "T17n0722_003:0425c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，告諸比丘：「善、惡之業，損、益不同，互相增減，隨業勢力，受報非虛。」",
        "translation": "After speaking this verse, the Bhagavān addressed the monks, \"Good and bad actions are different, harming and benefiting each other, and increasing and decreasing each other, and depending on the strength of actions, the rewards are not in vain.\"",
        "source": "T17n0722_003:0425c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「有情慳貪，不行惠施，自無依託，迷暗愚癡，不信因果，毀謗聖賢，獲報云何？」",
        "translation": "The monks then again said to the Buddha, \"What's the reward for sentient beings who are stingy and greedy, who don't practice generosity, who have no support of their own, who are deluded and foolish, who don't believe in cause and effect, and who denigrate noble and virtuous people?\"",
        "source": "T17n0722_003:0425c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「若諸有情，慳貪不信；於諸財物，自不受用，何況施他？",
        "translation": "The Buddha told the monks, \"If sentient beings are stingy, greedy, and unbelieving, how could they give to others when they won't use their own possessions?",
        "source": "T17n0722_003:0425c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知，比丘！",
        "translation": "You should know, monks!",
        "source": "T17n0722_003:0425c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無智愚人，遠離善友，復造諸非。",
        "translation": "An unwise foolish man who turns away from good friends often creates wrongdoings.",
        "source": "T17n0722_003:0425c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣，墮諸地獄受苦無窮。」",
        "translation": "As a result, they'll fall into hell and experience endless suffering.\"",
        "source": "T17n0722_003:0425c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸比丘聞是語已，憂愁悲惱，哽咽號泣。",
        "translation": "After hearing these words, those monks were sad and troubled, choking back sobs and lamentations.",
        "source": "T17n0722_003:0425c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白佛言：「此諸有情，復於何時，當捨此苦？",
        "translation": "They also said to the Buddha, \"When will these sentient beings again abandon this suffering?",
        "source": "T17n0722_003:0425c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛演說，利益未來。」",
        "translation": "May the Buddha expound it for the benefit of the future.\"",
        "source": "T17n0722_003:0425c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘，乃說頌曰：「人間六萬歲，　　阿部陀晝夜，　積彼年及月，　　初三萬六千；　承斯餘壽命，　　後後二萬增，　八寒大地獄，　　相續苦無盡。」",
        "translation": "It was then that the Bhagavān addressed the monks and spoke this verse, \"Sixty thousand years pass between humans, the days and nights of Abbot, and they accumulate years and months, the first 36,000; they carry on for the rest of their lives, and the next 20,000 increase, the eight great cold hells, and continuous suffering knows no end.\"",
        "source": "T17n0722_003:0425c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，告諸比丘：「此大地獄受苦有情，由身、語、意，輕慢賢善，毀謗正法，造作非法，破壞佛形，焚燒經典，謗真實法，言無義味。",
        "translation": "After speaking this verse, the Bhagavān addressed the monks, \"The suffering of sentient beings in this great hell is caused by their body, speech, and mind, which belittle the good, denigrate the right Dharma, create unlawfulness, destroy the Buddha's form, burn scriptures, denigrate the true Dharma, and speak without meaningful flavor.",
        "source": "T17n0722_003:0426a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此業因，牽引有情墮險惡處，種種治罰相續受苦而無窮盡。」",
        "translation": "As a result of these actions, sentient beings are led to fall into dangerous and unwholesome places, and they are subject to a never-ending stream of punishments and continuous suffering.\"",
        "source": "T17n0722_003:0426a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「若復有人於佛正法，甚深經典讀誦演說，令他信受，發菩提心，獲何勝利？」",
        "translation": "The monks then again said to the Buddha, \"If another person reads, recites, and expounds the Buddha's right teaching and the profound sūtras, causing others to believe and accept them and arouse the mind of enlightenment, what excellent benefit will they obtain?\"",
        "source": "T17n0722_003:0426a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「功德無量，微妙最勝！",
        "translation": "At that point, the Buddha addressed the monks, saying, \"The merits are immeasurable, subtle, and most excellent!",
        "source": "T17n0722_003:0426a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸有情，受持讀誦如是深法，敷演解說依法修行，起於正信；伏除障染，遠離惡趣，恒處人天，安隱快樂，一切聖賢護助稱讚。",
        "translation": "These sentient beings memorize, read, and recite such profound teachings, expound, explain, and practice them according to the rules, developing right faith, subduing the hindrances and defilements, escaping from bad destinies, remaining in humans and gods, peaceful and happy, and praised by all the noble and wise ones who protect and assist them.",
        "source": "T17n0722_003:0426a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於當來世獲得最上，多聞、總持、福德、智慧；憶念不忘；宮殿珍寶，悉皆具足；乃至圓寂，速得成就；恒離老、病，慳貪、嫉妬，迷惑醉亂，毀謗正法，虛妄、邪執；八難艱險及諸非法，悉能遠離。」",
        "translation": "In a future life, he'll attain the highest, most learned, commander, merit, and wisdom; he won't forget them; he'll have all the treasures of his palace; he'll quickly attain accomplishment even after passing away; he'll always be free of old age and illness, stinginess and greed, jealousy, delusion and drunkenness, denigrating the true teaching, falsehood and mistaken attachment, the eight difficulties and dangers, and all other unlawful things.\"",
        "source": "T17n0722_003:0426a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「若復有人愚迷邪執，於諸世間虛妄愛樂，廣造諸非；於其所作，亦無悔恨，其心增盛，諸惡相續，不怖險處遠離善友。",
        "translation": "It was then that the Buddha addressed the monks, \"Suppose someone is deluded and wrongly attached, has false attachments to worldly pleasures, and creates numerous wrongdoings; they don't regret what they've done, their mind grows stronger, bad things continue, and they don't fear dangerous places and avoid good friends.",
        "source": "T17n0722_003:0426a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此業因，輪轉地獄受苦澁果，決定非虛。",
        "translation": "It's certainly not false that as a result of these actions, transmigration to hell is subject to painful and painful results.",
        "source": "T17n0722_003:0426a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘應知，諸有智者，悉皆捨離諸不善業，發起正信修習對治。",
        "translation": "\"Monks, you should know that all intelligent people abandon unskillful actions and cultivate correct faith to counteract them.",
        "source": "T17n0722_003:0426a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘當知，由心造罪，獲果亦然；解脫生死，流轉諸趣，亦由於心；能行諂誑，又能調伏，亦能暴惡，能趣三塗，得大怖畏，亦由於心；又能捨離，修諸善法；而能棄背，真實安樂；及能遠離虛妄、顛倒，種種因緣、果報差別；若假、若實，獲報決定及不決定，有益、無益，若善、非善，皆能遠離。",
        "translation": "\"Monks should know that it's from the mind that sins are created and the results are likewise obtained; it's from the mind that one is liberated from birth-and-death and the transmigration to various destinies; it's from the mind that one is able to practice deceit, subdue, commit violence, go to the three destinies, and become greatly afraid; it's from the mind that one is able to abandon and cultivate good qualities; it's from the mind that one can abandon depravity and attain true happiness; and it's from the mind that one is able to avoid falsity and mistakenness, various differences in causes and conditions and in the results, whether nominal or real, determinate or indeterminate in their rewards, beneficial or not beneficial, and good or not good.",
        "source": "T17n0722_003:0426a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦能顯於二空之理，譬如明燈能破黑暗，復能顯現諸物像等，心亦如是。",
        "translation": "It also reveals the principle of emptiness in two ways, like a bright lamp that refutes darkness and reveals images of things, so does the mind.",
        "source": "T17n0722_003:0426b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如善惡，因果差別，互相隨逐，恒不捨離，輪轉諸趣，亦由於心；又如染、淨、隱、顯雖殊，互相增減，假、實理事，亦非即離。",
        "translation": "Also, just as good and evil, with their distinctions in cause and effect, are mutually pursued and never abandoned, so the transmigration of rebirths and destinies also comes from the mind, so defilement, purity, concealment, and disclosure, though distinct, mutually increase and decrease, and the principle of the provisional and the real are not immediately separate.",
        "source": "T17n0722_003:0426b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正見、邪執，愛、非愛業，出離、沈淪，理非即離，皆由心造。",
        "translation": "Right view and wrong attachment, craving and non-craving actions, and emancipation and sinking are not in their own right immediate separations, but are all created by the mind.",
        "source": "T17n0722_003:0426b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘應知，諸業繫縛，往來生死猶如羂索，繫縛有情，恒不自在。",
        "translation": "\"Monks should know that the bonds of karma and past birth and death are like nooses that bind sentient beings and constantly prevent them from being free.",
        "source": "T17n0722_003:0426b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚迷虛妄，煩惱纏縛，障覆真理，令智不起，於法、非法不能了達；亦非修習趣證之行，二空真理，無由顯證。",
        "translation": "Foolishly, deludedly, and tethered by afflictions, they obstruct the truth, cause cognition to fail, and prevent comprehension of what's true and what's not true; unless they cultivate the practice of aiming for realization, there's no way to reveal the truth of the two kinds of emptiness.",
        "source": "T17n0722_003:0426b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘當知，此由無明，迷於正理，於佛教法曾無所悟，障礙留難；自不依修，復障他學，妄說過非，深增厭離。",
        "translation": "\"Monks, you should know that this is the result of ignorance, confusion about the right principle, the lack of understanding of the Buddhist teaching, and the obstacles and difficulties that remain.",
        "source": "T17n0722_003:0426b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此業因，毀謗正法，諸佛冤賊，世世愚昧，恒墮黑暗地獄之中，備受眾苦而無窮盡；從彼出已，復墮餓鬼，愚迷暴惡，互相殘害，恒時受苦，飢渴逼迫而無暫息，受種種苦；復從彼出，墮畜生中，疲乏飢困，眾苦纏縛，恒無止息，瞋心增猛，互相食噉，極惡意樂，相續不斷。",
        "translation": "As a result of this action, they denigrate the right teaching, and the enemies and thieves of the Buddhas, who are ignorant from generation to generation, are constantly plunged into the darkness of hell, where they experience endless suffering; after emerging from that, they are again plunged into the hungry ghosts, which are deluded, violent, and harmful to each other, suffering constantly, being forced by hunger and thirst without respite, and undergoing various kinds of suffering; and after emerging from that, they are plunged into the animals, which are tiring, hungry, and tethered by numerous sufferings that never end, and their anger increases, feeding on each other and creating extremely bad intentions that go on and on.",
        "source": "T17n0722_003:0426b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦如世火能燒林野，此業亦爾，能燒眾善，損害有情。」",
        "translation": "Just as a worldly fire can burn down a forest or a wilderness, so too can this activity burn up all goodness and harm sentient beings.\"",
        "source": "T17n0722_003:0426b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊乃說頌曰：「迷惑諸有情，　　謗佛毀正法，　墮落於三塗，　　窮劫不能出；　恒處地獄苦，　　黑暗絕光明，　餓鬼及傍生，　　飢虛無窮盡；　有情由業縛，　　智慧煩惱覆，　險惡海沈淪，　　劫壞不能免。」",
        "translation": "It was then that the Bhagavān spoke this verse, \"Deluded sentient beings denigrate the Buddha and disparage the right teaching, falling into the three destinies, unable to escape for an entire eon; constantly trapped in the misery of hell, darkness and cut off light; hungry ghosts and unenlightened creatures, whose hunger knows no limit; sentient beings bound by karma, covered by the afflictions of wisdom, sinking into the sea of misfortune, and unable to escape destruction through the eons.\"",
        "source": "T17n0722_003:0426b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，告諸比丘：「由前謗法惡業之因，輪轉三塗受苦無量，從彼出已，若生人中，貧窮困苦，諸根不具，飢渴所逼，煩惱增盛，其性暴惡，猶如象馬，[怡-台+龍]悷不調，愚迷邪執，恒時相應，病苦纏縛而無間斷，其心放逸，虛妄攀緣，時無止息；聾、盲、瘖、瘂，不值正法，恒處邊地，智慧乏少，愚癡邪執，受種種苦而無窮盡。",
        "translation": "After speaking this verse, the Bhagavān addressed the monks, \"As a result of the bad actions of the previous denigration of the Dharma, their transmigration through the three destinies is characterized by innumerable sufferings, and after emerging from them, if someone is born among humans, they're poor and destitute, their faculties aren't equipped, they're overcome by hunger and thirst, their afflictions increase, their nature is violent and evil, like an elephant and horse, [yi-tai+dragon] sorrowful and uncontrolled, deluded and mistaken, constantly associated, bound by illness and pain without break, their minds are careless, their false attachments never end, they're deaf, blind, tranquil, and serene, don't meet the right Dharma, are constantly at the edge, their wisdom is scarce, and they're foolishly mistaken, they experience various kinds of suffering that never end.",
        "source": "T17n0722_003:0426b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應知，謗法之罪，獲報無量，說不能盡。」",
        "translation": "Monks should know that the rewards for the sin of denigrating the Dharma are too immeasurable to explain.\"",
        "source": "T17n0722_003:0426c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「若復有人修諸靜慮，趣求解脫，於佛、法、僧不生毀謗，恒時尊重，稱讚信受，猶如父母，亦如善友，恒時愛護，尊敬信受，不起邪謗，令心歡喜。」",
        "translation": "The Buddha told the monks, \"Suppose another person cultivates meditation, aims for liberation, doesn't denigrate the Buddha, Dharma, or Saṃgha, always honors and praises them, and accepts them as parents and good friends who are always loved, respected, and accepted, don't misrepresent them, and make their hearts rejoice.\"",
        "source": "T17n0722_003:0426c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「有情云何捨離過非，修習勝行？",
        "translation": "The monks then again said to the Buddha, \"How do sentient beings abandon wrongdoing and cultivate excellent practices?",
        "source": "T17n0722_003:0426c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛演說，利益未來。」",
        "translation": "May the Buddha expound it for the benefit of the future.\"",
        "source": "T17n0722_003:0426c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「諦聽，諦聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"Listen closely, listen closely!",
        "source": "T17n0722_003:0426c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今為汝說。",
        "translation": "Now, I'll explain it for you.",
        "source": "T17n0722_003:0426c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人捨離身、語諸不善業，恒修善業；又於三世安住觀察，伏諸邪慢，尊重三寶，策勤三業，趣證菩提；復於三時，遠離諸執及貪瞋等。",
        "translation": "\"Suppose there's another person who parts with unskillful actions of body and speech and constantly cultivates good actions, abides calmly in observation in the three times, subdues false pride, honors the Three Treasures, makes effort in the three actions, and aims to realize enlightenment, and at three times is free of attachment, craving, and so forth.",
        "source": "T17n0722_003:0426c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T17n0722_003:0426c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由於三業離諸過患，安住愛樂三聚淨戒，趣三菩提及三真如，遠離煩惱，安住思惟，令心平等，觀察最勝；復離慢、疑，三業清淨，伏除障染。",
        "translation": "Because they are free of the faults of the three activities, they abide in the love of the three groups of pure precepts, head for the three bodhisattvas and the three true forms, are free of affliction, stabilize their contemplation, make their minds equal, and observe the most excellent, and are free of conceit and doubt, their three activities are purified, and they subdue hindrances and defilements.",
        "source": "T17n0722_003:0426c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切處能離繫縛，修習正行，憶念苦、空，樂趣解脫，微妙甚深，遠離諸惡發起方便，破壞愚暗及諸貪欲。",
        "translation": "He's able to part with fetters in all places, cultivate right practice, remember suffering and emptiness, enjoy liberation that's subtle and profound, part with evils and initiate skillful means, and destroy ignorance and craving.",
        "source": "T17n0722_003:0426c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，比丘！",
        "translation": "Therefore, monks!",
        "source": "T17n0722_003:0426c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應修善行，棄捨諸非，及能遠離飢渴、寒熱，顏容憔悴，愚暗破裂，憂惱悔恨，種種諸苦皆悉捨離；獲於人天，富饒安樂，聰慧廣聞，恒修捨行，及諸香、燈、花鬘、瓔珞諸供養具。",
        "translation": "They should cultivate good practices, forsake what's wrong, and be able to part with hunger, thirst, cold, and heat, wither their faces, break darkness, grieve, and regret, and all the various kinds of suffering they experience; they'll attain prosperity and well-being among humans and gods, intelligence and extensive learning, constant cultivation of equanimity, and the making of offerings of incense, lamps, flowers, and jewelry.",
        "source": "T17n0722_003:0426c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T17n0722_003:0427a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若起邪執、慳貪、嫉妬、虛妄、諂誑，墮於餓鬼受諸苦惱，逼迫殘害，相續無斷，飢渴焚燒。",
        "translation": "If someone gives rise to mistaken attachment, stinginess, greed, jealousy, falsehood, and flattery, they'll be cast into the category of hungry ghosts and subject to suffering and torment, persecution and cruelty, and continuous, burning hunger and thirst.",
        "source": "T17n0722_003:0427a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "業因熟時，纖毫難免；憂苦纏縛，遠離解脫。」",
        "translation": "When the causes of karma mature, it's difficult to escape even the slightest bit, and they're bound by sorrow and pain and far from being liberated.\"",
        "source": "T17n0722_003:0427a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘白世尊言：「此諸有情，云何得脫如是眾苦？",
        "translation": "The monks then said to the Bhagavān, \"How did these sentient beings attain liberation from such suffering?",
        "source": "T17n0722_003:0427a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於何時而得解脫，獲於正信？",
        "translation": "When will he again attain liberation and attain right faith?",
        "source": "T17n0722_003:0427a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今思惟，不能了達。",
        "translation": "\"Now, I've been thinking about it, but I can't comprehend it.",
        "source": "T17n0722_003:0427a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此有情於鬼趣中，日夜長時，恒受飢渴、寒熱憂苦，身首乾枯，癡暗迷覆，恒無暫捨。",
        "translation": "Furthermore, this sentient being is constantly hungry, thirsty, cold, hot, and miserable in the destiny of ghosts day and night for a long time, their body and head are withered, and they're constantly deluded and in delusion, with no respite.",
        "source": "T17n0722_003:0427a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛演說，利益未來。」",
        "translation": "May the Buddha explain this for the benefit of the future.\"",
        "source": "T17n0722_003:0427a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「此諸有情，於過去世造諸惡業，不修福慧，慳嫉虛誑，煩惱熾盛，恣縱貪、瞋，不能伏除。",
        "translation": "The Buddha told the monks, \"These sentient beings created bad karma in a past life, didn't cultivate goodness and wisdom, were stingy and jealous, were deceitful, had raging afflictions, and indulged in craving and anger that couldn't be stifled.",
        "source": "T17n0722_003:0427a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命終之後，墮於地獄受苦無量；從彼出已，復墮餓鬼，眾苦逼迫，飢渴纏縛，於一切處恒時受苦，無救、無依，思念飲食，終無所得，悔恨號哭，念我何時當捨此苦？",
        "translation": "After their lives end, they fall into hell and experience immeasurable suffering; after emerging from there, they're again cast into the category of hungry ghosts, beset by numerous sufferings, tethered by hunger and thirst, subject to constant suffering in all places, without help or support, longing for food and drink that they'll never obtain, and lamenting with regret, thinking, \"When will I abandon this suffering?",
        "source": "T17n0722_003:0427a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘應知，愚癡有情，煩惱纏縛，由惡三業輪轉三塗，受如斯苦。",
        "translation": "\"Monks, you should know that foolish sentient beings bound by affliction are subject to this kind of suffering as a result of the three negative activities that lead to the three destinies.",
        "source": "T17n0722_003:0427a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘當知，若復有人近事男、女諸天、魔、梵。",
        "translation": "\"Monks, you should know that if another person comes close to working with men and women, gods, Māra, and Brahmā.",
        "source": "T17n0722_003:0427a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破彼惡業，修習善法，愛樂真諦，審觀自身四大、五蘊，苦、空無常；亦如水泡、芭蕉、夢、電，皆悉虛幻。",
        "translation": "He destroys their bad actions, cultivates good qualities, takes delight in the true truth, and examines his own four elements and five aggregates, which are painful and impermanent, and are like a water bubble, a plantain, a dream, or lightning, all of which are illusory.",
        "source": "T17n0722_003:0427a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，比丘於諸善法，修令增長；於一切惡，對治不起；安住人天，最勝可愛，皆得自在。",
        "translation": "Therefore, a monk cultivates the growth of good qualities, counteracts all evil and doesn't abide in the most beautiful and desirable of human beings and gods, and attains mastery over them all.",
        "source": "T17n0722_003:0427a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身、語、意業，遠離諸非，虛妄、欺詐及諸驚怖，決定棄捨。",
        "translation": "His bodily, verbal, and mental actions are free of wrongdoing, and he is certain to abandon falsity, deceit, and fear.",
        "source": "T17n0722_003:0427a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛樂最勝，寂靜思惟，離諸散亂，造作眾善，初、中及後，令無間斷，降伏諸根，捨離繫縛及諸惡趣。",
        "translation": "Their desires and pleasures are paramount, and they calmly contemplate them, part with distractions, create goodness, make no break in the beginning, middle, or end, subdue their faculties, and abandon fetters and bad destinies.",
        "source": "T17n0722_003:0427a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡黑暗，不了果因，廣作不善，輪迴三塗，被受眾苦。」",
        "translation": "Being foolish and dark, they don't understand the causes of fruition, do extensive unskillful deeds, are reborn in the three destinies, and are subject to numerous sufferings.\"",
        "source": "T17n0722_003:0427a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說頌曰：「若樂於住處，　　應觀胎藏苦，　遠離顛倒貪，　　破壞令不起；　纏縛於業繩，　　三途苦無盡，　來往似蟻環，　　沈淪難出離。」",
        "translation": "It was then that the Bhagavān spoke this verse, \"If you're happy where you live, you should observe the suffering of the womb, part with mistaken greed, and despoil it so it doesn't arise; tethered by the bonds of karma, the three paths of suffering are endless, and you come and go like the ring of ants, sinking into a state that's difficult to escape from.\"",
        "source": "T17n0722_003:0427a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，告諸比丘：「老、病、死苦，纏繞有情，恒不捨離。",
        "translation": "After speaking this verse, the Bhagavān addressed the monks, \"The suffering of old age, illness, and death constantly encumbers sentient beings and won't be abandoned.",
        "source": "T17n0722_003:0427b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如魚、鹿，網、箭纏縛，亦復如是。",
        "translation": "Like a fish or deer tethered by a net or arrow, it's likewise.",
        "source": "T17n0722_003:0427b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T17n0722_003:0427b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪愛如毒，瞋忿似火，虛妄諂誑，迷覆淨心，熾然煩惱，恒相隨逐，令不出離。",
        "translation": "Craving is like poison, anger is like fire, falsehood and flattery delude the pure mind, and blazing afflictions are constantly pursued, preventing them from escaping.",
        "source": "T17n0722_003:0427b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人貪求財物，廣行虛誑，養活身命，妄執纏縛，輪轉諸有。",
        "translation": "If another person covets possessions, does extensive deception to support their body and life, and is falsely attached to bondage, they'll be reborn into various existences.",
        "source": "T17n0722_003:0427b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如魚吞鉤，因貪所起；如焰中水，從愛心生。」",
        "translation": "They're like a fish swallowing a hook that arises from greed, or like water in a flame that arises from craving.\"",
        "source": "T17n0722_003:0427b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊乃說頌言：「迷執虛妄見，　　業緣有幻身，　果因恒離倒，　　離因果非真。",
        "translation": "It was then that the Bhagavān spoke this verse, saying, \"Misconstruing false views, karmic conditions have illusory bodies, and the effects are always free of error; apart from the causes, the effects aren't real.",
        "source": "T17n0722_003:0427b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　輪轉因煩惱，　　了達證真空，　解脫煩惱離，　　真實理非無。",
        "translation": "Their causes of transmigration are afflictions, their comprehension realizes the vacuum, their liberation is free of afflictions, and the true principle is not nonexistent.",
        "source": "T17n0722_003:0427b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最上妙覺位，　　二障悉皆亡，　湛然恒不動，　　利樂諸有情。」",
        "translation": "At the stage of supreme marvelous enlightenment, the two hindrances all perish, and they remain motionless, benefiting and delighting sentient beings.\"",
        "source": "T17n0722_003:0427b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說此偈已，告諸比丘：「若復有人起謗不信，損壞三寶，花卉、果實貨易活命。",
        "translation": "After speaking this verse, the Bhagavān addressed the monks, \"Suppose another person denigrates the Three Treasures and damages their flowers and fruits, making it easy to live.",
        "source": "T17n0722_003:0427b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此因緣，墮於惡趣；彼有獯狐及諸鷲鳥，其嘴鋒利，猶如金剛，形貌醜惡，嬈亂驚怖，來集食噉身肉、手足、眼目、骨髓，周遍無遺，受苦無量。",
        "translation": "As a result, they fall into a bad destiny; there are an army of foxes and eagles with sharp beaks like adamant, ugly forms, and agitation and fear that come to collect and eat flesh, hands, feet, eyes, eyes, and marrow, leaving nothing behind and undergo immeasurable suffering.",
        "source": "T17n0722_003:0427b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "業繩纏縛，隨逐不捨而無依怙，亦非救濟，輪轉如是，三惡往來，恒不捨離；從彼出已，復墮餓鬼，飢渴所逼，增長眾苦，口吐火焰，如山相續而無間斷。",
        "translation": "Bound by the bonds of karma, they follow and don't let go of them, have no support, and aren't rescued; they go round and round like this, never abandoning the three evils that come and go; after emerging from them, they fall back into the category of hungry ghosts, are forced by hunger and thirst, develop numerous sufferings, and spit fire from their mouths like mountains that continue without break.",
        "source": "T17n0722_003:0427b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設降大雨遍一切處，此惡業火終不能滅。",
        "translation": "Even if a great rain were to fall over all places, the fires of this bad karma would never go out.",
        "source": "T17n0722_003:0427b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘應知，若復有人修習施戒，乃至智慧，而能解脫種種眾苦。",
        "translation": "\"Monks, you should know that if another person cultivates the precepts of generosity and even wisdom, they'll be able to liberate themselves from various kinds of suffering.",
        "source": "T17n0722_003:0427b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T17n0722_003:0427c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡業為因，招三塗果，有情迷執，不能伏除，分別俱生煩惱一百二十八使。",
        "translation": "Bad actions are the cause that brings about the results of the three destinies, and sentient beings who are deluded and attached can't subdue them discern the one hundred and twenty-eight causes of the co-produced afflictions.",
        "source": "T17n0722_003:0427c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於三界內，欲四諦行，乃有十二，上二合論，二十四行，約三界說。",
        "translation": "Within the three realms, there are 12 practices of the four truths of desire, and the two above are discussed together as 24 practices, which are discussed with respect to the three realms.",
        "source": "T17n0722_003:0427c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T17n0722_003:0427c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四諦、四智乃有十六，及二見道；修四念處、八正道支、五根、五力，解脫暴惡，遠離焚燒。",
        "translation": "\"There are 16 of the four truths and four kinds of wisdom, and two paths of seeing; cultivating the four abodes of mindfulness, the eightfold correct path branch, the five faculties, and the five powers, they liberate themselves from violence and escape burning.",
        "source": "T17n0722_003:0427c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T17n0722_003:0427c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最上二諦，智應修習，及三念住；遠離眾魔及諸餓鬼，飢渴困苦，增長白法。」",
        "translation": "They should cultivate knowledge of the two highest truths and the three abodes of mindfulness; they'll be free of Māra, hungry ghosts, hunger, thirst, and distress, and they'll develop the white dharma.\"",
        "source": "T17n0722_003:0427c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊乃說頌曰：「十惡因心造，　　沈淪路嶮巇，　執貪癡境縛，　　果感必相隨；　極苦泥梨趣，　　堪嗟無所依！",
        "translation": "It was then that the Bhagavān spoke a verse, \"The ten evils are caused by the mind, sinking into a precipitous path, clinging to craving and delusion, bound by objects, and the results will surely follow; the destiny of extreme suffering and nirvāṇa is contested, and there's no refuge!",
        "source": "T17n0722_003:0427c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　緣熟如影嚮，　　壞劫報難移；　三業勤精進，　　多聞習總持，　二嚴修六度，　　圓滿證菩提。」",
        "translation": "Ripe with conditions like shadows and wandering forms, the effects of a bad eon are difficult to remove; diligently exerting the three activities, cultivating the mastery of learning, and cultivating the six perfections in two adornments, they completely realize bodhi.\"",
        "source": "T17n0722_003:0427c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說是偈已，告諸比丘：「若復有人修三善業：施、戒、多聞，捨離暴惡愚迷貪愛，解脫眾苦及離不善地獄、餓鬼。",
        "translation": "After speaking this verse, the Bhagavān addressed the monks, \"Suppose another person cultivates the three good actions: generosity, discipline, and learning, abandons violent, foolish craving, and frees themselves from numerous sufferings and unwholesome hells and hungry ghosts.",
        "source": "T17n0722_003:0427c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應知，諸餓鬼界受種種苦：寒熱飢渴，痛惱逼迫，不能遠離。",
        "translation": "Monks, you should know that the realm of hungry ghosts experiences various kinds of suffering: cold, heat, hunger, thirst, pain, and oppression, from which they can't escape.",
        "source": "T17n0722_003:0427c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此惡業——我慢、虛詐——墮落三塗。",
        "translation": "As a result of this bad action-self-importance and deceit-they fall into the three destinies.",
        "source": "T17n0722_003:0427c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼趣中，互相殘害，貪、瞋纏縛，恒時不捨。",
        "translation": "In those destinies, they are mutually harmful, bound by greed and anger, and they never abandon them.",
        "source": "T17n0722_003:0427c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由昔遠離布施、持戒及於多聞，造作諸非，不能了知法、非法等，及於正信亦皆迷闇，而非省悟。",
        "translation": "Because they were previously detached from generosity, observance of precepts, and learning much, they created all kinds of wrongdoings, weren't able to understand what's legal and what's not, and were deluded in their right faith rather than realizing it.",
        "source": "T17n0722_003:0427c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此障礙人天善趣，不能修習，亦非觀察得失等事。」",
        "translation": "This hinders the good destinies of humans and gods, makes it impossible to cultivate them, and doesn't lead to the observation of such things as gain and loss.\"",
        "source": "T17n0722_003:0427c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「阿素囉趣，何業所招？」",
        "translation": "The monks then again said to the Buddha, \"Asura's destiny, what's the result of that activity?\"",
        "source": "T17n0722_003:0427c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「應當諦聽，今為汝說。",
        "translation": "It was then that the Buddha addressed the monks, \"You should listen closely, and I'll explain it for you now.",
        "source": "T17n0722_003:0427c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼阿素囉，由昔虛詐，恒時諂曲業及諸惑，纏縛不捨，墮於彼趣。",
        "translation": "That asura, because of his past deceit, was constantly flattered by actions and afflictions, bound up in them and didn't abandon them, and fell into that destiny.",
        "source": "T17n0722_003:0427c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦由不信，謗毀賢善，於正因果，不能了悟，墮於彼趣，而無智慧；愚迷妄執，怖畏怯懼，恒非安隱。」",
        "translation": "Also because of their unbelief and denigration of goodness, they were unable to understand right cause and effect and fell into that destiny without wisdom; foolish, deluded, and attached, they were fearful and intimidated, and they were never at ease.\"",
        "source": "T17n0722_003:0428a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，帝釋、忉利諸天，聞佛所說，歡喜踊躍，即於佛前以偈頌曰：「平坦三乘路，　　牟尼親所宣，　真空無漏理，　　本體離諸纏。",
        "translation": "At the time, Indra and the Dhṛtarāṣṭra gods rejoiced and jumped for joy when they heard what the Buddha had taught, and they then spoke in verse before the Buddha, saying, \"The level path of the three vehicles is taught by Muni himself, the uncontaminated principle of vacuum is uncontaminated, and the essence is free of all attachments.",
        "source": "T17n0722_003:0428a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應物興慈廣，　　懷悲愍苦深，　光明恒照耀，　　不捨利他心。」",
        "translation": "He responds to living beings with compassion and breadth, harbors compassion for suffering, shines brightly and consistently, and doesn't abandon his mind to benefit others.\"",
        "source": "T17n0722_003:0428a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，帝釋說此偈已，合掌恭敬在一面立。",
        "translation": "After he spoke this verse, Indra joined his palms in respect and stood to one side.",
        "source": "T17n0722_003:0428a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告天帝：「三乘淨法，汝應修習，離諸繫縛，平等清白；能離險隘，絕諸黑暗，光明無染；猶如珍寶，體性清淨，諸天歡喜，愛樂最勝，寂靜修習，奉持不捨。",
        "translation": "The Buddha addressed the emperor, \"You should cultivate the pure Dharma of the three vehicles, which is free of fetters and equally pure, free of danger and defilement, free of darkness, and whose light is unsullied, like a precious jewel that's pure in essence, pleasing to the gods, and most loved, cultivated quietly, maintained, and not abandoned.",
        "source": "T17n0722_003:0428a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於戒、施及三摩地，觀察愛樂。",
        "translation": "They also observe and delight in precepts, generosity, and samādhi.",
        "source": "T17n0722_003:0428a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦如諸天，敬事天主，遠離過非，尊仰瞻奉；及諸有情，柔軟和美。",
        "translation": "Like the gods, they revere the lord of the gods, avoid wrongdoing, and venerate and respect him, and all sentient beings are gentle and beautiful.",
        "source": "T17n0722_003:0428a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生天上，獲身淨妙，遠離貪、恚，息除塵垢及諸境界，貪、忿因緣，解脫沈溺，破壞諸有，親族朋寮互相憎嫉，五欲淤泥，悉皆遠離。",
        "translation": "If they're born in the heavens, they'll attain a pure and wonderful body, be free of craving and ill-will, quell defilements and objects, liberate themselves from drowning due to craving and ill-will, destroy all existence, become enemies among their kin and friends, and avoid the muck of the five desires.",
        "source": "T17n0722_003:0428a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "處諸有情，謙敬和順，安住恒時。",
        "translation": "They are humble, respectful, and compliant with sentient beings, and they abide in stability for a constant period of time.",
        "source": "T17n0722_003:0428a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善離諸染，威儀有軌，抖擻煩惱，降伏魔羅。",
        "translation": "Well freed from defilements and with proper deportment, they shake off affliction and subdue māras.",
        "source": "T17n0722_003:0428a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧安住，最勝清淨，善護三業，恒習靜慮。",
        "translation": "They abide in wisdom that's most excellent and pure, guard the three activities well, and constantly cultivate meditation.",
        "source": "T17n0722_003:0428a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棄捨惡友及非梵行，永離繫縛，恒處諸天。",
        "translation": "Abandoning bad friends and unchaste behavior, they are permanently freed from bondage and remain in the heavens.",
        "source": "T17n0722_003:0428a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "良友知識，勸發大心，速登彼岸。」",
        "translation": "Good friends and acquaintances encourage great intentions, and they quickly reach the other shore.\"",
        "source": "T17n0722_003:0428a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法聖念處經卷第三",
        "translation": "Miaofa shengniannianqi jing, vol. 3",
        "source": "T17n0722_003:0428a25_0",
        "is_bad_quality": false
    }
]