[
    {
        "source_sentence": "正法念處經敘",
        "translation": "Commentary on the Sutra of the Mindfulness of the True Dharma",
        "source": "T17n0721_001:0001a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫域中之名四等，道之所生萬殊，名蓋眾名之假，生非有生之實。",
        "translation": "\"Regarding the four categories of names in the realm and the myriad differences in what's produced by the path, names cover the nominal aspects of many names, and birth is not the real aspect of being born.",
        "source": "T17n0721_001:0001a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然則修促共盡，小大同期，而金字絲編、緗交素篆，分途列道、門張戶設，既昧斷惑之境，未接息言之路，詎能探神測妙，苞總無邊？",
        "translation": "However, while cultivation and promotion are shared, the lesser and greater are the same, and gold letters are woven with thread, yellow crosses with plain seals, separate paths are laid out, and doors are opened, how can they detect the subtle and gather the infinite when they're ignorant of the state of ending mental disturbances and haven't connected to the path of calming speech?",
        "source": "T17n0721_001:0001a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有聖將應，靈因曠遠，志遺髮膚，施單城國。",
        "translation": "\"When a sage responds, his spiritual cause is far and wide, and he wishes to leave his hair and skin on, he gives his single city and country.",
        "source": "T17n0721_001:0001a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及繁星駐彩，夕馬騰空，出四門以結念，處三夜而圓果，十力在己、八解俱照，智兼一切、慈洽萬方，既而法吼傍震，甘露降灑：鷲山、祗樹之下，鹿苑、連河之地。",
        "translation": "When the stars were in full color and the horses in the evening sky, he emerged from the four gates to form his mind, spent three nights in the perfection of his mindfulness, had all ten powers in himself and all eight understandings illuminated, had wisdom that encompassed all, and had compassion that reached myriad directions, then the Dharma roar vibrated nearby and sweet dew descended to sprinkle Vulture Peak and Geylang, Deer Park, and the land of Lianhe.",
        "source": "T17n0721_001:0001a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾出恒沙，徒繁林竹，反窮迷于升極，啟重昏于鐙炬。",
        "translation": "The multitude of people who emerge from the Ganges and the numerous trees and bamboos that flourish in the forest counteract the delusion of the ascending pole and reveal the heavy darkness of the stirrup torch.",
        "source": "T17n0721_001:0001a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖鵠林興慕，檀薪已然，教義不忘，風聲逾被。",
        "translation": "Although the Śākyamuni forest is admired and the firewood is burned, the doctrine isn't forgotten and the sound of the wind is heard far and wide.",
        "source": "T17n0721_001:0001a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽陵仰丹素之工，清臺寫金玉之質，水骨流暉，園閭加等，遺契餘旨，薄傳前載，幽宗絕唱，方備茲辰。",
        "translation": "Shouling revered the work of Dansu, Qingtai wrote the quality of gold and jade, the bones of the water flowed radiant, the park and the tower were equal, the remainder of the legacy was thinly transmitted from previous records, and the absolute song of the Youzong school was prepared for this occasion.",
        "source": "T17n0721_001:0001a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使持節大將軍領中書監攝吏部尚書京畿大都督渤海王世子高公，道風虛邁，神衿峻遠，負日月于中衢，擊雷霆于上路，德表生民，作舟梁于夷夏，器含群物，制天淵于廟堂，殊流共委，酌而不竭，異軫同騖，仰以知歸。",
        "translation": "He was a man of open-minded style and far-reaching spirit who carried the sun and moon in the middle of the road, struck thunder in the upper road, showed his virtue to the people, built boats and beams in Yixia, contained a multitude of things, and made the abyss of heaven in the temple, entrusted different streams together, drank without exhausting them, had different summonses and shared the same destination, and was revered for his knowledge.",
        "source": "T17n0721_001:0001a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "黃扉南闢，鈴閤東啟，則有高士通才、幽人偉器，懱其漢爵之重，鄙其南岳之游，曳裾高步，自得門下，俱申前趣之禮，竝應却行之眷。",
        "translation": "When the yellow door is opened to the south and the bell house is opened to the east, then there will be men of high caliber and high caliber, men of noble intelligence and great abilities who count their Han titles dear and despise their Nanyue excursions, who trail their trains and stride up and get themselves under the door, who will both acknowledge the courtesy of their former position and respond to the favor of their former practice.",
        "source": "T17n0721_001:0001a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓋以書奏多方，術呈異等，或披卷而止，或一貫獨得，每留神釋典、洞叩玄門，以夫照壁瀉瓶，遺文必舉，非徒九部，寧止十二。",
        "translation": "Whenever he studied the scriptures and drew the profound gate, he would illuminate the walls and pour out the bottles, and the remaining texts would be cited, not just the nine divisions, but only the twelve.",
        "source": "T17n0721_001:0001a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逷矣西方，路超百宿，精力苦心，不憚重繭，故能法藏流行，異聞俱湊。",
        "translation": "His distance to the West was far, his path exceeded a hundred nights, and his energy and painstaking mind were not heavily cocooned, so he could popularize the Dharma collection and gather together different scholars.",
        "source": "T17n0721_001:0001a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爰有舍城妙說時將感通，法螺良藥響授斯在。",
        "translation": "It's because of this that the wonderful teaching from Śrāvastī is sometimes shared, and the good medicine from the conch of the Dharma is sounded and given here.",
        "source": "T17n0721_001:0001b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從善業之本，極身念之際，標品有七、明義者五，至如違俗絕世，託想菩提，眷彼天人，深嗟鬼畜，鑒茲因果，冥心是緣，篤誠修行，又悟前旨，載懷依仰，形殊理一，大覺下臨，昭然獨曉，四攝六通，網羅群智，贊揚妙德，事屬斯文。",
        "translation": "From the root of good actions, up to the limit of mindfulness of the body, there are seven categories and five categories of clarification, up to the point where it's contrary to conventionality and transcendence of the world, where one hopes for enlightenment, takes care of those gods and humans, deeply contemplates ghosts and animals, recognizes this as cause and effect, meditates on this as a condition, sincerely cultivates it, further awakens the former intention, carries reliance in mind, differs in form and principle, is one, and is clearly distinguished by the arrival of the greatly enlightened one, who clearly understands the four collections and six supernormal powers, nets together a multitude of wisdoms, praises marvelous virtues, and submits matters to this text.",
        "source": "T17n0721_001:0001b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直以風殊俗舛，詞翰乖絕，傾耳注目，隔若山河，將恐靈教有虧，玄旨多墜。",
        "translation": "It was because the style was so different from the layman's, the words were so misleading, and the ears were so attentive, separated by mountains and rivers, that they feared the spiritual teaching would be deficient and the profound meaning would often fall through.",
        "source": "T17n0721_001:0001b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有婆羅門人瞿曇流支，比丘曇林、僧昉等，竝鉤深索隱，言通理接，延居第館，四事無違，乃譯明茲典，名「正法念處」。",
        "translation": "A Brahmin named Gautama Ruche, a monk named Tanlin, and a monk named Fang all together sought out the profound, spoke with understanding and connected with principle, stayed at the temple, and did not contradict the four things, so they translated and clarified this text, which is called \"The Mindfulness of the True Dharma.\"",
        "source": "T17n0721_001:0001b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起自興和歲陽玄默，終于武定淵獻之季，條流積廣，合七十卷。",
        "translation": "It began with Xuanmo in the year of Xinghe and ended with Yanxian in the season of Wuding, and its length and breadth were accumulated in a total of seventy volumes.",
        "source": "T17n0721_001:0001b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "微言不昧，弘之在我，大崇覺典，尅宣靈迹。",
        "translation": "Its subtle words were not obscured, and it was disseminated to us, greatly exalting the canon of enlightenment and resolutely proclaiming its spiritual traces.",
        "source": "T17n0721_001:0001b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此乃濟四部于法橋，刷六塵于定水，心殷業重，無德而言。",
        "translation": "These are the four divisions that were saved at the Dharma bridge, the six dust motes that were brushed from the waters of meditation, and the mind that was heavy with activity and lacking virtue.",
        "source": "T17n0721_001:0001b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖龍樹不追、馬鳴日遠，申法尊道，夫豈異昔？",
        "translation": "Although nāgas don't pursue them and horses sound off into the sun, isn't the Shinto path honored by the Dharma different from the past?",
        "source": "T17n0721_001:0001b15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以緇素擊節，雅俗傾首，義有存焉，永法三界。",
        "translation": "\"That's why vegetarians strike the right note, the elegant and the mundane incline their heads, and the meaning is preserved, perpetuating the three realms.",
        "source": "T17n0721_001:0001b16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云爾。",
        "translation": "So it is.",
        "source": "T17n0721_001:0001b17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法念處經卷第一",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 1",
        "source": "T17n0721_001:0001b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏婆羅門瞿曇般若流支譯",
        "translation": "Yuan Wei Bhramun Gautama Prajñāruci Translation",
        "source": "T17n0721_001:0001b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十善業道品第一",
        "translation": "The First of the Ten Levels of Good Conduct",
        "source": "T17n0721_001:0001b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歸命一切諸佛菩薩",
        "translation": "homage to all buddhas and bodhisattvas",
        "source": "T17n0721_001:0001b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時，婆伽婆在王舍城遊那羅陀婆羅門村。",
        "translation": "Thus I have heard: One time, the Bhagavān traveled to the Brahminical village of Nārada in the city of Rājagṛha.",
        "source": "T17n0721_001:0001b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，慧命舍利弗於晨朝時，共眾多比丘入王舍城，各各行乞。",
        "translation": "At the time, when it was morning, Wisdom Life Śāriputra and a large number of monks went into Rājagṛha with him, each begging for food.",
        "source": "T17n0721_001:0001b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾多比丘離慧命舍利弗而行乞食，遂爾往到遮羅迦波離婆闍迦外道所已，共相問訊，彼此歡喜說法語論，迭互相問。",
        "translation": "After they left Śāriputra and went begging for food, the large group of monks went to the layman Cālaka-pārājaka, exchanged greetings with each other, spoke joyfully, and repeatedly questioned each other.",
        "source": "T17n0721_001:0001b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼遮羅迦波離婆闍迦外道問諸比丘言：「汝之釋迦沙門瞿曇說如是法：『欲為不善，是不可愛，非是可樂，非是可意，於他欲者，亦不隨喜。』",
        "translation": "That layman from Cārāḍapālīvājaka asked the monks, \"You Śākyamuni Gautama taught this Dharma, 'Desire is unwholesome, undesirable, not pleasant, not agreeable, and it doesn't please those who desire others.'",
        "source": "T17n0721_001:0001b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是說：『彼身業是不可愛，非是可樂，非是可意，於他欲者，亦不隨喜。』",
        "translation": "I also say this, 'That physical action is undesirable, not pleasant, and not agreeable, and it doesn't please those who desire it.'",
        "source": "T17n0721_001:0001c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之釋迦沙門瞿曇說：『彼口業是不可愛，非是可樂，非是可意，不隨喜他。』",
        "translation": "Your Śākyamuni Gautama says, 'That verbal action is undesirable, not pleasant, not agreeable, and doesn't please others.'",
        "source": "T17n0721_001:0001c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是說：『彼口業是不可愛，非是可樂，非是可意，不隨喜他。』",
        "translation": "So I say, 'That verbal action is undesirable, not pleasant, not agreeable, and doesn't please others.'",
        "source": "T17n0721_001:0001c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之釋迦沙門瞿曇說：『彼意業是不可愛，非是可樂，非是可意，不隨喜他。』",
        "translation": "Your Śākyamuni Gautama says, 'That mental action is undesirable, not pleasant, not agreeable, and not pleasing to others.'",
        "source": "T17n0721_001:0001c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是說：『彼意業是不可愛，非是可樂，非是可意，不隨喜他。』",
        "translation": "I also say, 'That mental activity is undesirable, not pleasant, not agreeable, and doesn't please others.'",
        "source": "T17n0721_001:0001c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之釋迦沙門瞿曇如是法律，為有何異？",
        "translation": "Śākyamuni Gautama, what's the difference between such a law and yours?",
        "source": "T17n0721_001:0001c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何意？",
        "translation": "What does it mean?",
        "source": "T17n0721_001:0001c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何勝？",
        "translation": "What is it?",
        "source": "T17n0721_001:0001c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若汝釋迦沙門瞿曇如是法律，與我何異，而汝釋迦沙門瞿曇自說：『我是一切智人。』」",
        "translation": "'If you Śākyamuni Gautama thus define the Dharma, how are you different from me, while you Śākyamuni Gautama say to yourself, 'I am a person of omniscience.'\"",
        "source": "T17n0721_001:0001c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼遮羅迦波離婆闍迦外道如是問已，彼諸比丘新出家故，於比丘法未能善解，心不隨喜，是故不答。",
        "translation": "After the layman Cālaka Pāliwajaka asked this question, the monks who were newly leaving home didn't answer because they didn't understand the monks' teaching well and didn't rejoice in their hearts.",
        "source": "T17n0721_001:0001c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾多比丘既乞食已，離慧命舍利弗，各各皆到那羅陀村，食訖已住。",
        "translation": "At the time, after they had begged for food, the large group of monks left Śāriputra and went to the village of Nārādika, where they stayed after finishing their meal.",
        "source": "T17n0721_001:0001c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，慧命舍利弗亦乞食已，同共往到那羅陀村。",
        "translation": "At the time, Wisdom Life Śāriputra had also begged for food and went with him to the village of Nārādika.",
        "source": "T17n0721_001:0001c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾多比丘往到慧命舍利弗所，具說如上。",
        "translation": "At the time, a large group of monks went to Śāriputra and explained everything as above.",
        "source": "T17n0721_001:0001c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，慧命舍利弗語眾多比丘言：「若我，慧命！",
        "translation": "At the time, Wisdom Life Śāriputra said to those monks, \"Suppose I, Wisdom Life!",
        "source": "T17n0721_001:0001c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共汝相隨王舍城內，同四出巷、同三角巷，即共汝等到遮羅迦波離婆闍迦外道所者，我則能以正法破之。",
        "translation": "If I were to follow you with you into the city of Rājagṛha, down the same four exit alleyways and down the same three-cornered alleyway, that is, if I were to wait with you until you reached the heretical house of Cāḷāraka Parivrājaka, then I would be able to refute them with the right teaching.",
        "source": "T17n0721_001:0001c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我在於異四出巷、異三角巷而行乞食，故我如是不聞彼難。",
        "translation": "However, I was begging for food in a different four-way street or a different three-cornered street, so I didn't hear about their difficulties.",
        "source": "T17n0721_001:0001c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼遮羅迦波離婆闍迦外道前所問難，世尊普眼——諸業果報一切現知，今在此處最為尊勝，一切外道見則降伏，為諸聲聞、諸優婆塞、諸天人等，善說一切業果報法——去此不遠，汝可往問。",
        "translation": "The Bhagavān, who has the universal eye to see all the questions and problems asked by the non-Buddhist Cālaka Bālaka, is the most honored, the most subdued of all the non-Buddhists who see him, and he well explains the law of the results of all actions for śrāvakas, laymen, gods, and others-it's not far from here, so you can go there and ask questions.",
        "source": "T17n0721_001:0001c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼當為汝善說一切業果報法，若天、魔、梵，世間、沙門、婆羅門等所不能說，唯有如來能為汝說。",
        "translation": "He will well explain for you all the principles of the effects of actions that gods, Māra, Brahmā, worldlings, ascetics, priests, and so forth can't explain, but only the Tathāgata can explain them for you.",
        "source": "T17n0721_001:0002a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼法未善通達，唯有世尊第一善解業果報法能為汝說。」",
        "translation": "I haven't well understood that teaching, but only the Bhagavān, who is the best at understanding the law of the results of actions, can explain it for you.\"",
        "source": "T17n0721_001:0002a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾多比丘向世尊所。",
        "translation": "At the time, a large group of monks approached the Bhagavān.",
        "source": "T17n0721_001:0002a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊依晝時法，如須彌山，自光網焰如晝日明；如夜中月，如月清涼；如陂池清，甚深如海，安住不動如須彌山，心無所畏如師子王，一切眾生之所歸依。",
        "translation": "At the time, the Bhagavān relied on the daytime Dharma like Mount Sumeru, whose own net of light blazes like the brightness of the daytime sun, like the moon in the middle of the night, cool like the moon, like a clear, unpolluted pond, and as deep as the ocean, standing motionless like Mount Sumeru, his mind fearless like the lion king, and to whom all sentient beings rely.",
        "source": "T17n0721_001:0002a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如父母，大悲熏心，一切眾生唯一上親。",
        "translation": "He's like a father and mother, perfumed by great compassion, the only superior relative for all sentient beings.",
        "source": "T17n0721_001:0002a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈、悲、喜、捨為依止處，以三十七大菩提分勝妙之法莊嚴其身，一切眾生清淨眼觀無有厭足，勝日月光。",
        "translation": "With kindness, pity, joy, and equanimity as their bases and the thirty-seven elements of enlightenment as their surpassing and marvelous dharmas that adorn their bodies, the pure eyes of all sentient beings are unclouded, and they are superior to the light of the sun and moon.",
        "source": "T17n0721_001:0002a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦王子偈言：「世尊廣普眼，　　無三垢淨眼，　能巧說二諦，　　善知三種苦。",
        "translation": "Prince Śākyamuni spoke in verse, \"The Bhagavān has a wide-ranging, universal eye, an eye that's free of the three defilements and pure, one that skillfully explains the two truths and well understands the three kinds of suffering.",
        "source": "T17n0721_001:0002a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是佛世尊，　　已修二種修，　現證於道果，　　滅諦智具足。",
        "translation": "Thus, the Bhagavān has cultivated the two kinds of cultivation, and now he's realized the fruit of the path, complete with knowledge of the truth of cessation.",
        "source": "T17n0721_001:0002a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離三界眼，　　而說異三界，　知十八界諦，　　觀知解脫諦。",
        "translation": "He's far removed from the eye of the three realms, explains the different three realms, knows the eighteen truths, and observes and knows the truth of liberation.",
        "source": "T17n0721_001:0002a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十八功德眾，　　自功德相應，　解脫九繫縛，　　具足十種力。",
        "translation": "They are a multitude of the eighteen virtues, are associated with their own virtues, are freed from the nine fetters, and possess the ten powers.",
        "source": "T17n0721_001:0002a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　成就四無畏，　　亦成就大悲，　大悲心深潤，　　成就三念處。」",
        "translation": "They accomplish the four fearlessnesses, achieve great compassion, and deeply nourish their minds with great compassion, accomplishing the three abodes of mindfulness.\"",
        "source": "T17n0721_001:0002a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾多比丘既見世尊，整服一肩，如法叉跪，右膝著地禮世尊足，退在一面，正威儀住，低頭斂容。",
        "translation": "Upon seeing the Bhagavān, the large group of monks adjusted their robes to one shoulder, knelt down with their arms folded in accordance with the teaching, bowed their right knee to the ground at the Bhagavān's feet, withdrew to one side, stood with proper deportment, and bowed their heads with a modest bow.",
        "source": "T17n0721_001:0002a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾多比丘推一比丘往近世尊，復更頂禮世尊足已，白言：「世尊！",
        "translation": "At that point, the large group of monks pushed one monk closer to the Bhagavān, paid homage to the Bhagavān's feet, and said, \"Bhagavān!",
        "source": "T17n0721_001:0002a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於晨朝著衣持鉢，入王舍城而行乞食。",
        "translation": "In the early morning, I put on my robe and took my bowl into Rājagṛha and went there to solicit alms.",
        "source": "T17n0721_001:0002a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如上所說，次第乃至共彼外道遮羅迦波離婆闍迦問難語說，彼問身業、口業、意業，皆如上說。」",
        "translation": "I explained it as above, and then I went on to speak with that outsider Cārāḍika Parivrājaka, who asked about difficult questions about physical actions, verbal actions, and mental actions, all as explained above.\"",
        "source": "T17n0721_001:0002a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊先觀察已，然後為說。",
        "translation": "After first observing this, the Bhagavān then explained it for them.",
        "source": "T17n0721_001:0002b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為彼比丘、那羅陀村諸婆羅門而說法言：「汝諸比丘！",
        "translation": "At that point, the Bhagavān explained the teaching to those monks and the Brāhmaṇas of Nārādika, saying, \"You monks!",
        "source": "T17n0721_001:0002b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我所說法，初、中、後善，義善、語善，法應具足清淨鮮白，梵行開顯，所謂正法念處法門。",
        "translation": "My teaching, which is good in the beginning, middle, and end, good in meaning and good in speech, should be replete with pure, clear, and white things, and the religious practice should be revealed, which is called the dharma-gate of the mindfulness of the true teaching.",
        "source": "T17n0721_001:0002b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen closely, listen closely!",
        "source": "T17n0721_001:0002b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之，我為汝說。」",
        "translation": "Consider it well, and I'll explain it for you.\"",
        "source": "T17n0721_001:0002b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「如是。",
        "translation": "The monks said, \"So it is.",
        "source": "T17n0721_001:0002b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T17n0721_001:0002b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸比丘於世尊所，至心諦聽。",
        "translation": "Those monks went to the Bhagavān and listened attentively.",
        "source": "T17n0721_001:0002b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為諸比丘，如是說言：「諸比丘！",
        "translation": "At the time, the Bhagavān spoke to the monks in this way, saying, \"Monks!",
        "source": "T17n0721_001:0002b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者正法念處法門？",
        "translation": "What is the dharma-gate of mindfulness of the true dharma?",
        "source": "T17n0721_001:0002b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂法見法、非法見非法，常念彼處心不生疑，憙樂聞法，供養長宿。",
        "translation": "They see what's true and see what's not true, always mindful of that place, and their mind doesn't entertain doubt, gladly hears the teaching, and makes offerings over the long haul.",
        "source": "T17n0721_001:0002b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼知身業、口業、意業，業果生滅，不顛倒見，不行異法。",
        "translation": "They know the actions of body, speech, and thought, and the effects of actions that arise and cease, don't mistakenly see them, and don't practice different things.",
        "source": "T17n0721_001:0002b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T17n0721_001:0002b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身業三種，所謂殺生、偷盜、邪婬。",
        "translation": "There are three kinds of physical activity, which are called killing, stealing, and sexual misconduct.",
        "source": "T17n0721_001:0002b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何殺生？",
        "translation": "What's killing life?",
        "source": "T17n0721_001:0002b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於他眾生，生眾生想，起殺害心，斷其命根，得成殺生。",
        "translation": "They give rise to the conception of other sentient beings as sentient beings, give rise to the intention to kill and injure them, and cut off their life root, which results in killing.",
        "source": "T17n0721_001:0002b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有三種，謂上、中、下。",
        "translation": "There are three kinds of such beings, which are superior, middling, and inferior.",
        "source": "T17n0721_001:0002b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言上者，殺羅漢等，墮阿鼻獄；所言中者，殺住道人；所言下者，殺不善人及殺畜生。",
        "translation": "The higher one is killing arhats and so forth and falling into the avīci hell; the middle one is killing someone who abides in the path; and the lower one is killing unwholesome people and animals.",
        "source": "T17n0721_001:0002b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復三種，所謂過去、未來、現在。",
        "translation": "There are three more kinds, which are called past, future, and present.",
        "source": "T17n0721_001:0002b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復三種，所謂貪作、瞋作、癡作。",
        "translation": "There are three more kinds, which are called the works of greed, the works of anger, and the works of delusion.",
        "source": "T17n0721_001:0002b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼貪作者，所謂獵等；彼瞋作者，所謂下性；彼癡作者，外道齋等。",
        "translation": "Those who act greedily are called hunters, those who act angrily are called low-lifes, and those who act foolishly are non-Buddhist ascetics.",
        "source": "T17n0721_001:0002b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復三種，所謂自作、他教、二作。",
        "translation": "There are three more kinds, which are self-creation, other-culture, and two-creation.",
        "source": "T17n0721_001:0002b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五因緣，雖是殺生，無殺罪業，所謂道行無心傷殺蠕、蟻等命；若擲鐵等，無心殺生而斷物命；醫師治病為利益故，與病者藥，因藥命斷，醫無惡心；父母慈心為治故打，因打命終；燃火虫入，無心殺虫，虫入火死。",
        "translation": "There are five causes and conditions that make it a sin to kill even though it's killing life, namely, when a practitioner of the Way doesn't have the intention to harm or kill the lives of worms and ants, when he tosses iron or other things, he doesn't have the intention to kill life and cut off the lives of things, when a doctor gives medicine to a patient for the purpose of healing, but his life is cut off because of the medicine, and the doctor doesn't have bad intentions, when a parent beats a person with kindness for the purpose of healing, but his life ends because of the beating, and when a fire-burning insect enters, he doesn't have the intention to kill the insect and it enters the fire and dies.",
        "source": "T17n0721_001:0002b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是五種，雖斷生命，不得殺罪。",
        "translation": "Although these five things cut off life, they can't commit the sin of killing.",
        "source": "T17n0721_001:0002b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復更有三種殺生，所謂教他、自作、二作。",
        "translation": "There are another three kinds of killing, which are called teaching others, doing it yourself, and doing it twice.",
        "source": "T17n0721_001:0002b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何偷盜成就滿足？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - how does stealing accomplish its fulfillment?",
        "source": "T17n0721_001:0002c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何偷盜得果報少？",
        "translation": "How does stealing obtain little retribution?",
        "source": "T17n0721_001:0002c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：他物他攝、自意盜取，如是偷盜成就滿足。",
        "translation": "They see and hear and know, or the divine eye sees, that they're taking other's property from others and stealing it with their own thoughts, and they thus achieve satisfaction by stealing.",
        "source": "T17n0721_001:0002c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是王法，為饒益尊父母、病人、緣覺、羅漢、阿那含人、斯陀含人、須陀洹等，若為病急，若為飢急；彼為饒益，如是偷盜，得果報少，盜業不具。",
        "translation": "If this is the king's teaching that it's for the benefit of venerable parents, the sick, the solitary realizers, arhats, non-returners, sakṛdhas, and so forth, and if they are desperately ill or hungry, then such stealing for their benefit will yield little result, and their actions of stealing won't be complete.",
        "source": "T17n0721_001:0002c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復偷盜得果報少，謂偷盜已，專心懺悔；既懺悔已，後更不作；遮他偷盜，教不盜戒，示其善道，令住善法遠離偷盜。",
        "translation": "Again, stealing obtains little result, which is to concentrate on repentance after stealing, refrain from doing it later after repenting, restrain others from stealing, teach the precepts against stealing, and show them the good way, so that they will abide in the good Dharma and avoid stealing.",
        "source": "T17n0721_001:0002c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是盜業不具足滿。",
        "translation": "Such actions of stealing aren't complete and fulfilled.",
        "source": "T17n0721_001:0002c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何業具足？",
        "translation": "What karma is complete?",
        "source": "T17n0721_001:0002c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人偷盜，彼偷盜人若誑惑他，屏處思量作欺誑事，斗秤治物作惡業行，如是種種，此業具足。",
        "translation": "If someone steals, and that thief deceives others, sulks about deception, weighs and controls things, and commits bad actions, such-and-such are the fulfillment of this action.",
        "source": "T17n0721_001:0002c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何成業？",
        "translation": "How is this activity accomplished?",
        "source": "T17n0721_001:0002c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若他攝物，知已盜取，如是成業。",
        "translation": "If someone takes in another's things and knows they've been stolen, it's thus formed into an action.",
        "source": "T17n0721_001:0002c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何業具足？",
        "translation": "What karma is complete?",
        "source": "T17n0721_001:0002c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已隨喜，樂行多作，向他讚說，又復教他善戒者盜，此業具足。",
        "translation": "They are pleased with what they've done, enjoy doing it often, praise it to others, and teach others the good precepts of stealing, which are complete.",
        "source": "T17n0721_001:0002c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三業具足不減，餘偷盜業，得果報少而不決定。",
        "translation": "Thus, these three actions are complete and don't decrease, and the results of the other actions of stealing are small and uncertain.",
        "source": "T17n0721_001:0002c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何邪婬？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what is wrong with sexual misconduct?",
        "source": "T17n0721_001:0002c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此邪婬人，若於自妻，非道而行，或於他妻，道非道行；若於他作，心生隨喜；若設方便，強教他作。",
        "translation": "\"If this wrong kind of person commits sexual misconduct with his own wife that's not the way, or with another wife that's not the way, or if he does it with another person, his mind is pleased, or if he sets up a way to force another person to do it, this is called wrong sexual misconduct.",
        "source": "T17n0721_001:0002c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名邪婬。",
        "translation": "This is called wrong sexual behavior.",
        "source": "T17n0721_001:0002c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何邪婬得果報少？",
        "translation": "How does wrong sexual misconduct get little result?",
        "source": "T17n0721_001:0002c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若邪婬已，專心懺悔，不隨喜他，遮他邪婬，示其善道，彼邪婬業不具足滿。",
        "translation": "If someone who has committed sexual misconduct focuses their mind on repentance, doesn't like others, and shields others from sexual misconduct and shows them the good way, their sexual misconduct isn't complete and fulfilled.",
        "source": "T17n0721_001:0002c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離邪婬意，修行善戒，如是邪婬得果報少，不決定受。",
        "translation": "If someone parts with wrong sexual intentions and cultivates good morality, such wrong sexual behavior will have few rewards, and they won't be able to experience them for certain.",
        "source": "T17n0721_001:0002c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是三種身不善業，得果報少，果報輕軟。",
        "translation": "\"Such three kinds of unwholesome physical actions obtain few rewards and have weak rewards.",
        "source": "T17n0721_001:0002c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是外道遮羅迦波離婆闍迦所不能知，非其境界；并天、世間，若魔、若梵、沙門、婆羅門，一切世間、諸天人等所不能知，除我聲聞，從我聞故，知業果報，更無教者。",
        "translation": "Thus, they can't be known by a non-Buddhist, Cālaka, or by a Brahmin, Māra, Brahmā, ascetic, or Brahmin, or by any worldly being or celestial being, except for me, the śrāvaka, who knows the results of actions because I've heard them, and there's no one else to teach them.",
        "source": "T17n0721_001:0002c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者知業果報，云何口業惡不善行？",
        "translation": "\"Furthermore, when a practitioner knows the results of actions, how does he engage in bad and unskillful verbal actions?",
        "source": "T17n0721_001:0003a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "口業四種，所謂妄語、兩舌、惡口、綺語，如是四種。",
        "translation": "There are four kinds of verbal activity, which are called false speech, duplicity, harsh words, and fancy speech, and these are the four kinds.",
        "source": "T17n0721_001:0003a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者妄語？",
        "translation": "What's false speech?",
        "source": "T17n0721_001:0003a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自思惟已，然後於他作不實語，若作呪誓，若在王前，若王等前，妄語言說，令他衰惱，或打、或縛、或令輸物；彼成妄語如是滿足，成妄語業地獄中受。",
        "translation": "After thinking about it for themselves, they then make an untrue statement to another person, or if they make a curse or vow, or if they speak falsely in front of the king or in front of the king and others, they cause them to be upset, or they may beat, bind, or cause them to lose property; this accomplishes false speech and creates the karma of false speech that's received in hell.",
        "source": "T17n0721_001:0003a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有口業名為兩舌，於和合者、共作業者，破壞語說；如是語者，成就兩舌。",
        "translation": "\"Also, there's the verbal action called duplicity, which is to speak disruptively to those who are in harmony or who are working together; such speech accomplishes duplicity.",
        "source": "T17n0721_001:0003a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此語得果報少？",
        "translation": "How does this speech obtain little result?",
        "source": "T17n0721_001:0003a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破壞語已，心中生悔：『我愚癡故作如是說。』",
        "translation": "After speaking destructively, he repents in his mind, 'Foolishly, I said that.'",
        "source": "T17n0721_001:0003a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "專心懺悔，亦遮他人作破壞語，示其善道，業不具足，此業不重。",
        "translation": "Focusing his mind on repentance and shielding others from speaking destructively and showing them the good way doesn't fulfill that action, and that action isn't heavy.",
        "source": "T17n0721_001:0003a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此業不具足滿？",
        "translation": "How is this action not fully complete?",
        "source": "T17n0721_001:0003a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此破壞語，或以煩惱、或以酒醉，心異分別，向他異說，此業不足。",
        "translation": "This kind of destructive speech, which is based on affliction or drunkenness and which the mind discerns differently and tells others differently, is not sufficient for karma.",
        "source": "T17n0721_001:0003a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為業道相應成破壞語？",
        "translation": "What are these words that are called actions that are associated with the path, which become destructive?",
        "source": "T17n0721_001:0003a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以惡心破壞於他，隨喜讚嘆，如是名為業道相應成破壞語。",
        "translation": "If someone with a bad mind destroys others and praises them with joy, this is called a statement that destroys what's associated with the path of karma.",
        "source": "T17n0721_001:0003a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此業決定成就破壞語說？",
        "translation": "How does this activity definitely result in destructive speech?",
        "source": "T17n0721_001:0003a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已隨喜，復教他作，隨喜讚說；喜樂貪著，不離於心；常懷惡心，他人所避；不可往返，為他毀呰；不生羞恥，無慚、無愧，不能自知。",
        "translation": "They delight in what they've done, teach others to do it, praise it joyfully, don't abandon their mind with joy and greed, always harbor evil intentions that others avoid, don't go back and forth, and disparage others, aren't ashamed, and don't have conscience or modesty, and can't know it for themselves.",
        "source": "T17n0721_001:0003a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為破壞語業。",
        "translation": "Such is called the activity of destructive speech.",
        "source": "T17n0721_001:0003a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者觀察業集，云何名為惡口業行？",
        "translation": "\"Also, when a practitioner examines the collection of actions, what is called the practice of bad speech?",
        "source": "T17n0721_001:0003a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：如是惡口能生熱惱，聞不悅耳，不忍他惡，令異人信，若重、若輕，戲笑、瞋心，得無量報、無量種報。",
        "translation": "They see and hear and know, or the divine eye sees, that such bad speech produces anger, displeases the ear when heard, doesn't tolerate evil from others, causes outsiders to believe, and brings about measureless rewards and countless kinds of retribution whether heavy or light, teasing, or anger.",
        "source": "T17n0721_001:0003a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼重惡口，墮於地獄；彼輕惡口，不決定受。",
        "translation": "Their heavy mouth will land them in hell, and their light mouth will be indeterminate in its retribution.",
        "source": "T17n0721_001:0003a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為第三口業，彼業具足相應之義，如前所說。",
        "translation": "This is called the third form of verbal action, which has all the concomitant meanings as explained above.",
        "source": "T17n0721_001:0003a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者知業報法，云何名為第四口業無義綺語？",
        "translation": "\"Furthermore, when a practitioner knows the law of the retribution of actions, what is called the fourth verbal action, meaningless fancy speech?",
        "source": "T17n0721_001:0003a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前後相違，不相應說。",
        "translation": "The former and latter are contradictory and aren't discussed together.",
        "source": "T17n0721_001:0003a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不決定受，決定如餘，如是名為第四口業。",
        "translation": "Not being certain of feeling and certain as the rest, this is called the fourth verbal action.",
        "source": "T17n0721_001:0003a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者觀業報法，云何意業？",
        "translation": "\"Furthermore, when a practitioner observes the law of the retribution of actions, what are the actions of intention?",
        "source": "T17n0721_001:0003a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意業幾種？",
        "translation": "How many kinds of mental activity are there?",
        "source": "T17n0721_001:0003a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知，意業三種：貪、瞋、邪見。",
        "translation": "They see and hear that there are three kinds of mental activity: craving, anger, and wrong views.",
        "source": "T17n0721_001:0003a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為貪？",
        "translation": "What's greed?",
        "source": "T17n0721_001:0003b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見他人富者財物，心生希望欲得彼物，是意貪業。",
        "translation": "If someone sees another person's wealthy possessions and becomes hopeful about obtaining their possessions, this is the action of mind-craving.",
        "source": "T17n0721_001:0003b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，意業：若見他人富者財物，心生惡嫉，是意嫉業；若生邪見、生顛倒見，是邪見業。",
        "translation": "Furthermore, mental activity: if someone sees another person's wealth and possessions and becomes malevolent and jealous, this is mental jealousy, and if they give rise to wrong views or mistaken views, this is wrong view activity.",
        "source": "T17n0721_001:0003b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有二種，謂失、不信。",
        "translation": "There are two kinds of karma, namely, error and unbelief.",
        "source": "T17n0721_001:0003b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不信？",
        "translation": "How is it not faith?",
        "source": "T17n0721_001:0003b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人心謂：『無施、無祀，無齋、無會，無有善業、無不善業，無業果報。』",
        "translation": "Their minds say, 'There's no generosity, no sacrifice, no observance, no assembly, no good action, no unskillful action, and no result of action.'",
        "source": "T17n0721_001:0003b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣則無量。",
        "translation": "The breadth of that is immeasurable.",
        "source": "T17n0721_001:0003b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為失？",
        "translation": "What's wrong with that?",
        "source": "T17n0721_001:0003b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人心謂一切苦樂皆是天作，非業果報。",
        "translation": "\"Their minds say that all suffering and happiness are created by gods and not the results of actions.",
        "source": "T17n0721_001:0003b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二種，名為邪見。",
        "translation": "These two kinds of people are called wrong viewers.",
        "source": "T17n0721_001:0003b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者觀業報法，云何三種身、口、意業，如是十種，樂行多作，彼決定受？",
        "translation": "\"Furthermore, when a practitioner observes the law of the results of actions, what are the three kinds of physical, verbal, and mental actions, and these 10 kinds of pleasant actions and many actions that they're sure to experience?",
        "source": "T17n0721_001:0003b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此義云何？",
        "translation": "What does this mean?",
        "source": "T17n0721_001:0003b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者業果於現世受？",
        "translation": "What is the result of karma experienced in the present life?",
        "source": "T17n0721_001:0003b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者業果於生世受？",
        "translation": "What is the result of karma experienced in the natural world?",
        "source": "T17n0721_001:0003b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者業果於餘世受？",
        "translation": "What are the results of karma that are experienced in other lives?",
        "source": "T17n0721_001:0003b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於世間何處何生？",
        "translation": "Where in the world will it again arise?",
        "source": "T17n0721_001:0003b12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：身業殺生樂行多作，墮於地獄、畜生、餓鬼。",
        "translation": "They see, hear, and know, or the divine eye sees, that their physical actions kill beings, and their pleasures are numerous, resulting in their falling into hell, the animal kingdom, or the hungry ghost.",
        "source": "T17n0721_001:0003b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，命則短促。",
        "translation": "If a person is born among humans, their life will be short.",
        "source": "T17n0721_001:0003b14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若因貪心獵等殺生，彼人則生猪鹿、雉雞、迦賓闍羅如是等中，獵師圍兵之所殺害，乃至作魚，鈎釣所殺。",
        "translation": "If someone kills life because of their desire to hunt and so forth, they'll be born among pigs, deer, pheasants, kapiñjala, and so forth, killed by hunters and soldiers, or even killed by fishing with hooks.",
        "source": "T17n0721_001:0003b15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼前作業，相似因緣，常在生死；若生人中，命則短促；設得生天，不得好處，多有鐵畏，速為他殺。",
        "translation": "Their previous actions have similar causes and conditions, and they're always in birth-and-death; if they're born among humans, their lives will be short; if they're born in heaven, they won't get a good place, and they'll have many enemies and fears, so they'll quickly be killed by others.",
        "source": "T17n0721_001:0003b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生之報，有下、中、上。",
        "translation": "The consequences of killing a living being are inferior, middling, and superior.",
        "source": "T17n0721_001:0003b19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈言：「『有於藏中死，　　有生已命終，　　有能行則亡，　　有能走便卒。』",
        "translation": "The verse says, 'There's death in the store, life after birth, death if you can walk, and death if you can walk.'",
        "source": "T17n0721_001:0003b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼殺生者，此業成就勢力果報，謂地獄受，若現在受，若餘殘受。",
        "translation": "\"For those who kill beings, the result of the momentum accomplished by this action is retribution in hell, in the present, or in other residual retribution.",
        "source": "T17n0721_001:0003b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者觀業果報，云何偷盜樂行多作，報有三種，謂地獄受、若現在受、若餘殘受？",
        "translation": "\"Also, when a practitioner observes the results of actions, how does stealing, indulging in many pleasures, and committing numerous acts have three kinds of consequences, which are hellish feelings, present feelings, and remaining residual feelings?",
        "source": "T17n0721_001:0003b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼偷盜業樂行多作，墮於地獄、畜生、餓鬼。",
        "translation": "Their delightful actions of stealing often land them in hell, the animal kingdom, or a hungry ghost.",
        "source": "T17n0721_001:0003b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中則常貧窮；若得財物畏王、水、火、劫賊因緣，具足失奪，不曾得樂。",
        "translation": "If they live among humans, they'll always be poor; if they obtain property, fear the king, or the causes and conditions of water, fire, or robbery, they'll completely lose it and never attain happiness.",
        "source": "T17n0721_001:0003b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼偷盜業，得如是等三種果報。",
        "translation": "These three kinds of results of their karma of stealing are thus obtained.",
        "source": "T17n0721_001:0003b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者觀業果報，云何邪婬樂行多作，得三種果？",
        "translation": "\"Furthermore, when a practitioner observes the results of actions, how does engaging in numerous acts of sexual misconduct and pleasure obtain three kinds of results?",
        "source": "T17n0721_001:0003c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：若彼邪婬樂行多作，墮於地獄、畜生、餓鬼。",
        "translation": "They see and hear and know, or the divine eye sees, that if they engage in many evil sexual activities and pleasures, they'll fall into hell, the animal kingdom, or the hungry ghosts.",
        "source": "T17n0721_001:0003c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，餘殘果報，妻不隨順；若得二根，世間所惡。",
        "translation": "If someone is born, their wife won't obey the other cruel rewards, and if they acquire the two faculties, they'll be hated by the world.",
        "source": "T17n0721_001:0003c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼如是等三種身業、三種果報，非彼外道遮羅迦波離婆闍迦之所能解。",
        "translation": "\"These three kinds of physical actions and three kinds of rewards cannot be understood by that non-Buddhist Cārāḍika Parivrājaka.",
        "source": "T17n0721_001:0003c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說身業，則有無量，皆不能解。",
        "translation": "Speaking broadly about physical actions, there are countless others, none of which can be understood.",
        "source": "T17n0721_001:0003c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T17n0721_001:0003c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼以癡法熏其心故，唯我能解。",
        "translation": "Because their minds are perfumed by the law of delusion, I'm the only one who can understand it.",
        "source": "T17n0721_001:0003c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我實不見餘人能解，更無有人能見如是業果報法，如我見者。",
        "translation": "I really don't see how anyone else can understand it, and there's no one else who can see the results of actions like I see them.",
        "source": "T17n0721_001:0003c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我弟子修行法者，以從我聞，是故能解。",
        "translation": "If my disciple cultivates the teaching, it's because he's heard it from me that he can understand it.",
        "source": "T17n0721_001:0003c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何口業？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the correct teaching and observing the practice of the teaching - what is verbal action?",
        "source": "T17n0721_001:0003c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "口業幾種？",
        "translation": "How many kinds of oral activity are there?",
        "source": "T17n0721_001:0003c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：口業四種，所謂妄語、兩舌、惡口、綺語。",
        "translation": "They see and hear and know, or the divine eye sees, the four kinds of verbal action, which are false speech, duplicity, harsh words, and fancy speech.",
        "source": "T17n0721_001:0003c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼妄語樂行多作，墮於地獄、畜生、餓鬼。",
        "translation": "If they engage in many delightful deeds that are false speech, they'll fall into hell, the animal kingdom, or a hungry ghost.",
        "source": "T17n0721_001:0003c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，一切眾生不信其語，諸善眾會、善長者眾、剎利等眾及妻子等，不信其語；口常爛臭，齒亦不好，面皮無色；一切世人妄語枉謗；常生怖畏；親友、兄弟、知識不固；一切所作不得果利，於一切人不得饒益。",
        "translation": "If among humans all sentient beings don't believe their words, the assembly of good people, the community of good elders, the bhūmis, and their wives don't believe their words, their mouths always smell, their teeth are bad, and their skin is colorless, all people speak falsehoods and misrepresentations, they're always afraid, their friends, brothers, and acquaintances aren't strong, and nothing they do will be fruitful or beneficial to all people.",
        "source": "T17n0721_001:0003c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是妄語是不可愛，非是可樂，非是可意，成就如是不善業果。",
        "translation": "Such false speech is unattractive, not pleasant, and not agreeable, and it accomplishes the result of such unwholesome actions.",
        "source": "T17n0721_001:0003c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何名為第二口業樂行多作，成就果報？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what is the second verbal action that's pleasant, often done, and which accomplishes its result?",
        "source": "T17n0721_001:0003c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：如是兩舌樂行多作，墮於地獄、畜生、餓鬼。",
        "translation": "They see, hear, and know, or the divine eye sees, that such a double-tongued person who happily acts and does much will fall into hell, the animal kingdom, or the hungry ghost.",
        "source": "T17n0721_001:0003c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，若聾、若瘂；口常爛臭；無人信語，眾人所笑；面色不好；不住一處，心動不定；常行惡行。",
        "translation": "If someone is born, they'll be deaf or dumb, their mouth will always smell bad, no one will believe their words, they'll be laughed at by everyone, their countenance will be bad, they won't stay in one place, their mind will be agitated, and they'll always engage in bad behavior.",
        "source": "T17n0721_001:0003c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為兩舌業報。",
        "translation": "Such is called the result of duplicitous actions.",
        "source": "T17n0721_001:0003c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何名為第三口業樂行多作，成就業果？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what is the third verbal action that's pleasant, active, and which accomplishes the result of action?",
        "source": "T17n0721_001:0004a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：如是惡口樂行多作，墮於地獄、畜生、餓鬼。",
        "translation": "They have seen and heard, or the divine eye has seen, that such bad speech, happy actions, and many deeds will land them in hell, the animal kingdom, or the hungry ghosts.",
        "source": "T17n0721_001:0004a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，處處皆畏，一切人所皆得衰惱；無人安慰，於自妻子不得愛語，猶如野鹿畏一切人；遠善知識、近惡知識。",
        "translation": "If someone is born, they'll be feared everywhere, and all human places will be tormented; they'll have no one to comfort them, won't be able to speak lovingly to their wives, and will be like a wild deer that fears everyone; they'll distance themselves from good friends and draw near to bad friends.",
        "source": "T17n0721_001:0004a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名惡口三種果報。",
        "translation": "These are called the three rewards of bad speech.",
        "source": "T17n0721_001:0004a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何綺語樂行多作？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - why does he engage in so much fancy speech and delightful behavior?",
        "source": "T17n0721_001:0004a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：若彼綺語樂行多作，墮於地獄、畜生、餓鬼。",
        "translation": "They see, hear, and know, or the divine eye sees, that if they engage in many deeds of fancy speech and pleasure, they'll fall into hell, the animal kingdom, or the hungry ghosts.",
        "source": "T17n0721_001:0004a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，一切不愛，王舍、怨家、兄弟、親家輕弄嫌賤。",
        "translation": "If someone is born among humans, they won't like anything, and their king's household, enemies, brothers, and relatives will despise them.",
        "source": "T17n0721_001:0004a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是綺語口業果報。",
        "translation": "This is the result of the verbal activity of fancy speech.",
        "source": "T17n0721_001:0004a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何意業三種不善，樂行多作意不善業？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what are the three kinds of unwholesome mental actions and the many pleasurable actions that create unwholesome mental actions?",
        "source": "T17n0721_001:0004a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：若彼貪心，樂行多作意不善業，墮於地獄、畜生、餓鬼。",
        "translation": "They see and hear and know, or the divine eye sees, that if they are greedy and delight in doing lots of unwholesome actions with intent, they'll fall into hell, the animal kingdom, or the hungry ghosts.",
        "source": "T17n0721_001:0004a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，雖有財物，則為王、賊及水、火等無理橫失，恒常貧窮。",
        "translation": "If someone among humans has possessions, then they'll be a king, a thief, or someone who loses water or fire for no reason, and they'll always be poor.",
        "source": "T17n0721_001:0004a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何瞋心樂行多作意不善業？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - how does the mind of anger happily act and often create intentions for unwholesome actions?",
        "source": "T17n0721_001:0004a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：瞋心意業樂行多作意不善業，墮於地獄、畜生、餓鬼。",
        "translation": "They see and hear, or the divine eye sees, that their anger, mind, actions, pleasures, and deeds are often intent on unwholesome actions, and they fall into hell, the animals, and hungry ghosts.",
        "source": "T17n0721_001:0004a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，則生邊地夷人之中，常畏鐵處，常怖魄處，墮嶮岸處；彼人之心不曾安隱，常被誹謗，常得如是多種眾惡。",
        "translation": "If someone is born among humans, they'll be born among the barbarians of the borderlands, always fearing the place of iron, always afraid of the place of death, and fall into the precipitous position; their minds are never at ease, they're always denigrated, and they always attain these kinds of numerous evils.",
        "source": "T17n0721_001:0004a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何邪見樂行多作意不善業？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - why do wrong views, happy actions, and many intentions create unwholesome actions?",
        "source": "T17n0721_001:0004a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：邪見意業樂行多作，墮於阿鼻地獄等中受一切苦；若墮畜生，於無量世百千萬億億數轉生；餓鬼境界亦復如是。",
        "translation": "They see, hear, and know, or the divine eye sees, that their wrong views, intentions, actions, pleasures, and deeds are numerous, and they fall into all kinds of suffering in avīci hell and beyond; if they fall into the animal kingdom, they'll be reborn a hundred thousand million billion times over an immeasurable number of lifetimes; so too will the realm of hungry ghosts.",
        "source": "T17n0721_001:0004a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生人中，如法所說自種性業善業道行，不依法行，於上世來父、祖種性千倍下劣。",
        "translation": "If someone in the human race conducts their own lineage activities according to the teaching, but doesn't conduct them according to the teaching, their father's and grandfather's lineage from a prior life is a thousand times lesser.",
        "source": "T17n0721_001:0004b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行，更復思法深細觀察——云何如是十不善法，流轉生死，世間、地獄、餓鬼、畜生？",
        "translation": "\"Furthermore, when a practitioner reflects internally - observing the practice of the Dharma in accordance with the right Dharma, and further reflecting on the Dharma in detail - how are these ten unskillful qualities liable to be reborn in birth-and-death, the world, hell, hungry ghosts, and animals?",
        "source": "T17n0721_001:0004b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：云何殺生？",
        "translation": "They see and hear and know, or the divine eye sees, \"How is life killed?",
        "source": "T17n0721_001:0004b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何樂行？",
        "translation": "How do we practice happily?",
        "source": "T17n0721_001:0004b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何多作？",
        "translation": "How do we do it often?",
        "source": "T17n0721_001:0004b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂殺生者，此殺生人，近惡知識。",
        "translation": "\"It's called killing life, which is killing people and being near bad associates.",
        "source": "T17n0721_001:0004b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若惡知識近住之人，與彼相隨，喜樂彼人相隨遊戲，共行、共宿，於彼生信，謂有功德，隨彼所作亦與同行。",
        "translation": "If a person near a bad friend follows them, enjoys their company, plays along with them, travels and stays with them, and gives rise to faith that they have merit, then they'll go along with them according to their actions.",
        "source": "T17n0721_001:0004b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是近惡知識，彼殺生人、近殺生者，則以種種殺生因緣教令殺生：或外道齋、或屠獵等，如貪味者說殺生事；如怨家者說殺生事；如賊貪物說殺生事；如鬪戰者說殺生事；如貪名者說殺生利。",
        "translation": "If someone thus approaches a bad friend who kills people or is close to killing people, they'll be taught to kill people based on various causes and conditions for killing people: whether it's a non-Buddhist sect, a butcher or a hunter, such as a person who craves taste and talks about killing people, a person who holds a grudge and talks about killing people, a thief who covets things and talks about killing people, a person who fights and talks about killing people, or a person who covets fame and talks about the benefits of killing people.",
        "source": "T17n0721_001:0004b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人聞已，心則生信，亦隨順行，憙樂殺生。",
        "translation": "After hearing this, that person's mind becomes convinced, and they act accordingly, rejoicing in the joy of killing life.",
        "source": "T17n0721_001:0004b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是喜樂，既殺生已，墮於地獄、餓鬼、畜生，不可愛著，心不樂處，一切善人訾毀之處。",
        "translation": "Thus delighted, after killing life, they'll be cast into hell, hungry ghosts, and animals, which are unattractive and unpleasant places in their minds, and places where good people disparage them.",
        "source": "T17n0721_001:0004b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此因故，若生人中，命則短促。",
        "translation": "As a result, if someone is born among humans, their life will be short.",
        "source": "T17n0721_001:0004b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是殺生，近惡知識以為種子。",
        "translation": "Thus, killing beings brings them close to bad associates as seeds.",
        "source": "T17n0721_001:0004b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何樂行？",
        "translation": "\"What are the pleasant practices?",
        "source": "T17n0721_001:0004b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼不善人既殺生已，憙樂歡喜，心意分別，見殺功德。",
        "translation": "After killing a living being, that unwholesome person is delighted and rejoices, and his mind discriminates and sees the merits of killing.",
        "source": "T17n0721_001:0004b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是分別則有多種：斷他命已，不生懊悔，讚說言善；心不放捨，轉復更作，教他人作；既教他已，說彼殺生種種功德，異異因緣，如前所說。",
        "translation": "Such discernment then has various forms: after cutting off another person's life, he doesn't repent and praises it as good; his mind doesn't abandon it; he does it again and teaches others to do it; and after teaching others, he explains the various merits of killing that person, with different causes and conditions, as explained earlier.",
        "source": "T17n0721_001:0004b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為樂行殺生。",
        "translation": "Such is called delighting in the practice of killing life.",
        "source": "T17n0721_001:0004b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何多作？",
        "translation": "\"How do you do it often?",
        "source": "T17n0721_001:0004b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此殺生已，如前行說，近惡知識，習作殺生，多造殺具，作危嶮處，作圍、毒箭，集養狗等，養殺生鳥，近旃陀羅，造鬪戰具——鎧鉀、刀杖及以[矛*(替-曰+貝)]鉾、鬪戰之輪種種器仗——諸殺生具，如是一切皆悉攝取。",
        "translation": "After taking this life, as explained in the previous practice, he approaches a bad friend, engages in taking life, creates many instruments of killing, creates dangerous places, creates pens and poisoned arrows, raises dogs and so forth, raises birds of prey, approaches a chandala, creates weapons for fighting - armor, swords, staves, [spears*(ti-ya+pui)] spears, various weapons for fighting - all these instruments of killing life, and so forth, are all collected.",
        "source": "T17n0721_001:0004b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是惡人多作殺生，以是因緣，墮於地獄、畜生、餓鬼，受極苦惱殺生之業，有下、中、上；受苦報時，亦下、中、上。",
        "translation": "As a result of such a bad person's many acts of killing, he'll be sent to hell, animals, and hungry ghosts, where he'll experience extreme pain and suffering from the act of killing, which has lower, middle, and higher levels; when he experiences the results of suffering, it'll also be lower, middle, and higher.",
        "source": "T17n0721_001:0004c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「既作業已，如是不得不受果報。",
        "translation": "\"After doing so, they're forced to experience the results in this way.",
        "source": "T17n0721_001:0004c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，自作惡業、自得惡報。",
        "translation": "Thus and so, they create their own bad actions and obtain their own bad consequences.",
        "source": "T17n0721_001:0004c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若黠慧人，捨惡行善彼世間中。",
        "translation": "If a wise person renounces bad actions and does good actions, they'll be in the world.",
        "source": "T17n0721_001:0004c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是殺生，樂行、多作。",
        "translation": "Thus, he kills beings, engages in pleasant deeds, and does many of them.",
        "source": "T17n0721_001:0004c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何偷盜樂行多作？",
        "translation": "\"How do you enjoy stealing and do it often?",
        "source": "T17n0721_001:0004c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何樂行多作盜已，墮於地獄？",
        "translation": "How do people fall into hell after indulging in numerous acts of stealing?",
        "source": "T17n0721_001:0004c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此惡戒人，性自偷盜近惡知識。",
        "translation": "This person with bad morals is naturally inclined to steal from people close to bad associates.",
        "source": "T17n0721_001:0004c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若惡知識近住之人，與彼相隨，則行偷盜，有下、中、上。",
        "translation": "If someone living near a bad friend follows them, then they'll commit theft, and there's a lower, middle, and higher level.",
        "source": "T17n0721_001:0004c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為下？",
        "translation": "What's inferior?",
        "source": "T17n0721_001:0004c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂王法等，如前所說。",
        "translation": "These are the king's laws and so forth, as explained earlier.",
        "source": "T17n0721_001:0004c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為中？",
        "translation": "What's the middle?",
        "source": "T17n0721_001:0004c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非福田所，偷盜彼物，此盜為中。",
        "translation": "If someone steals something from another person who doesn't live in a field of merit, this stealing is the middle.",
        "source": "T17n0721_001:0004c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為上？",
        "translation": "What's higher?",
        "source": "T17n0721_001:0004c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛、法、僧物，微少偷盜，是則為上。",
        "translation": "The slightest theft of the things of the Buddha, Dharma, and saṃgha is considered superior.",
        "source": "T17n0721_001:0004c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛、法、僧，若盜僧物，佛、法能淨；盜佛、法物，僧不能淨。",
        "translation": "If they steal the things of the Buddha, Dharma, and saṃgha, the Buddha and Dharma can be purified; stealing the things of the Buddha and Dharma won't purify the saṃgha.",
        "source": "T17n0721_001:0004c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若盜眾僧現食用物，墮大地獄，頭面在下；若取屬僧所常食物，則墮無間阿鼻地獄，寬廣闇等，以重福田，微少偷盜。",
        "translation": "If someone steals the things that the saṃgha eat now, they'll fall into the great hell with their heads at the bottom, and if they take food that's always part of the saṃgha's diet, they'll fall into the unremitting avīci hell, which is wide and dark and so forth, because they respect the field of merit and steal very little.",
        "source": "T17n0721_001:0004c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以有心念，樂行多作，彼少偷盜，墮於地獄、畜生、餓鬼。",
        "translation": "Because they have mindfulness and enjoy doing much, they steal little and fall into hell, the animals, and hungry ghosts.",
        "source": "T17n0721_001:0004c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復懺悔，不生隨喜，心中生悔，彼不定受。",
        "translation": "If they again repent and don't become pleased, and regret arises in their minds, they won't necessarily receive it.",
        "source": "T17n0721_001:0004c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若偷盜人，無量方便而行偷盜，以如是故名為偷盜。",
        "translation": "If a person who steals commits theft with measureless skillful means, it's called stealing because of this.",
        "source": "T17n0721_001:0004c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何樂行偷盜他物？",
        "translation": "\"How does he delight in stealing other's property?",
        "source": "T17n0721_001:0004c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得已歡喜，與賊相隨，心以為樂；既得財物，作衣食已，心生歡喜讚其功德，教他偷盜；教已，讚說。",
        "translation": "They rejoice when they've obtained it, and they follow the thief with joy in their hearts; once they've obtained property and made clothing and food, they rejoice and praise its merits, teaching others to steal; after teaching them, they praise them.",
        "source": "T17n0721_001:0004c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為樂行偷盜。",
        "translation": "This is called stealing with pleasure.",
        "source": "T17n0721_001:0004c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何多作？",
        "translation": "\"How do you do it often?",
        "source": "T17n0721_001:0004c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既偷盜已，多作床敷臥具氈被，食噉餅肉，衣服莊嚴，婬女娛樂，樗蒲博戲，心生喜悅：『我今快樂，一切樂中偷盜為最，以此因緣，我豐床敷、臥具、飲食、衣服莊嚴、婬女、樗蒲，第一勝樂。",
        "translation": "After stealing, they often make beds, bedding, blankets, food, biscuits, adorned clothing, women of sexual interest, and simaroubas, and they rejoice in their hearts, saying, 'Now, I'm happy, for stealing is the greatest of all pleasures, and this is the cause and condition for my having an abundance of beds, bedding, food, adorned clothing, women of sexual interest, and simaroubas, which are the greatest pleasure.",
        "source": "T17n0721_001:0004c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今常當作偷盜行，令我後時增長富樂。』",
        "translation": "Now, I'll always engage in stealing, so that I'll grow rich and happy in the future.'",
        "source": "T17n0721_001:0005a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，如是如是，多行偷盜，決定於彼地獄中受。",
        "translation": "As explained earlier, such and such repeated acts of stealing will surely land you in that hell.",
        "source": "T17n0721_001:0005a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何邪婬樂行多作？",
        "translation": "\"How do you engage in many evil and delightful acts of sexual misconduct?",
        "source": "T17n0721_001:0005a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此邪婬人，心不觀察婬欲覆蔽。",
        "translation": "\"This wrong kind of person's mind doesn't examine the obscurations of sexual desire.",
        "source": "T17n0721_001:0005a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人先世婬欲處來，所謂鴛鴦、迦賓闍羅、孔雀、鸚鵡、魚雉、鷃鳥、阿修羅等，如是處來於此中生，常與多欲不善知識相隨共行。",
        "translation": "If a person came from a place of sexual desire in a prior life, called a mandarin duck, a kapiñjala, a peacock, a parrot, a fish-pheasant, a quail, or an asura, and so forth, such a person would come here and be born, always walking with a desire-rich, unskillful person.",
        "source": "T17n0721_001:0005a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二分喜樂婬欲，心不觀察，心不厭足；不離欲心、不觀察行，隨有欲處往到其所，以欲處來此欲處生，喜行婬欲，故不觀察婬欲所覆。",
        "translation": "Thus, these two kinds of people delight in lust and desire, don't examine their minds, and aren't satisfied with their minds; they don't part with their desiring minds and don't examine their actions, go to places where there's desire, come from a place of desire and are born in this place of desire, delight in practicing lust, and therefore don't examine what's covered by lust.",
        "source": "T17n0721_001:0005a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是邪婬不善之人，觸染勢力，彼彼憙樂；如是邪婬，復更如是，心喜樂行，樂行如是邪婬惡觸。",
        "translation": "Thus, an unwholesome person who commits wrong sexual misconduct has the power of contact and defilement, and they are delighted with it; thus, wrong sexual misconduct and, furthermore, the mind enjoys delightful actions, and delightful actions are thus wrong sexual misconduct and bad contact.",
        "source": "T17n0721_001:0005a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何樂行？",
        "translation": "\"What's delightful activity?",
        "source": "T17n0721_001:0005a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是邪婬雖不常行而常憙樂，心意分別，更於餘處心不憙樂如婬欲者。",
        "translation": "\"Thus, although he doesn't always practice wrong sexual behavior and always enjoys it, his mind discerns it and doesn't relish it in other places like sexual desire.",
        "source": "T17n0721_001:0005a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是樂行邪婬境界。",
        "translation": "Such a person enjoys practicing wrong sexual behavior in the realm of sexual misconduct.",
        "source": "T17n0721_001:0005a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何多作？",
        "translation": "\"How do they often engage in it?",
        "source": "T17n0721_001:0005a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡凡夫，心不觀察，邪婬覆蔽，他復為說邪婬功德第一勝樂，所謂婬欲，言：『為此事非是不善。』",
        "translation": "When foolish mortals don't examine their minds and are hindered by wrong sexual behavior, they again teach that wrong sexual behavior has the greatest merit and the greatest joy, which is called sexual desire, saying, 'This is not unwholesome.'",
        "source": "T17n0721_001:0005a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復教多人憙樂婬欲。",
        "translation": "They also teach many people to be proud of their lustful desires.",
        "source": "T17n0721_001:0005a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是邪婬，愚癡凡夫憙樂多作。",
        "translation": "Such wrong sexual misconduct is enjoyed by foolish mortals who often engage in it.",
        "source": "T17n0721_001:0005a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三種身不善業。",
        "translation": "These are the three kinds of unwholesome physical actions.",
        "source": "T17n0721_001:0005a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「口業四種：妄語、兩舌、惡口、綺語。",
        "translation": "\"There are four kinds of verbal action: false speech, duplicity, harsh words, and fancy speech.",
        "source": "T17n0721_001:0005a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者妄語？",
        "translation": "What's false speech?",
        "source": "T17n0721_001:0005a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂自心先自作誑，然後誑他。",
        "translation": "It means that your own mind first deceives itself, and then it deceives others.",
        "source": "T17n0721_001:0005a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是妄語，自、他成誑。",
        "translation": "Thus, when they speak falsely, their own mind and others are deceived.",
        "source": "T17n0721_001:0005a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼妄語，五因緣發，所謂瞋、貪、邪法所攝、欲心、怖畏。",
        "translation": "Furthermore, that false speech arises from five causes, which are anger, greed, inclusion in wrong dharmas, desire, and fear.",
        "source": "T17n0721_001:0005a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何瞋心而發妄語？",
        "translation": "\"How does anger give rise to false speech?",
        "source": "T17n0721_001:0005a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於王前或大眾中、長者眾中，若善知識、怨家諍鬪，饒益知識，衰惱怨家，是故妄語。",
        "translation": "If a good friend or an enemy fights in front of the king or in a large crowd or among elders, and that fight enriches the friend and discourages the enemy, that's why he speaks falsely.",
        "source": "T17n0721_001:0005a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何貪心而發妄語？",
        "translation": "How does craving give rise to false speech?",
        "source": "T17n0721_001:0005a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見他財物，方便欲取，是故妄語。",
        "translation": "Seeing another's property and wanting to take it conveniently is a false statement.",
        "source": "T17n0721_001:0005a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何邪法所攝妄語？",
        "translation": "What is false speech that's included in wrong qualities?",
        "source": "T17n0721_001:0005a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如婆羅門法中所說：『饒益尊故、饒益牛故、畏自死故、為取婦故，如是妄語，皆不得罪。』",
        "translation": "As it's said in the Brāhmaṇa teachings, 'Such false speech as benefiting a venerable, benefiting a cow, fearing one's own death, or taking a woman for her own sake won't be considered a crime.'",
        "source": "T17n0721_001:0005a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之人，邪法攝語。",
        "translation": "Such a person takes refuge in wrong teachings and speaks them.",
        "source": "T17n0721_001:0005b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是妄語，是愚癡人邪見攝語，此語堅重，於地獄受。",
        "translation": "Such false speech is the speech of a foolish man harboring wrong views, and it's so strong that he'll be sentenced to hell.",
        "source": "T17n0721_001:0005b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故乃至失命因緣，不應妄語。",
        "translation": "Therefore, even if it's the cause of losing one's life, one shouldn't speak falsely.",
        "source": "T17n0721_001:0005b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此妄語者，能為地獄第一種子。",
        "translation": "Such a false statement can be the firstborn in hell.",
        "source": "T17n0721_001:0005b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言：『為取婦，妄語無罪，是欲心發。』",
        "translation": "Saying, 'It's not a sin to speak falsely in order to obtain a wife is the arousal of desire.'",
        "source": "T17n0721_001:0005b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦是邪法。",
        "translation": "That's also a wrong thing.",
        "source": "T17n0721_001:0005b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何怖畏而發妄語？",
        "translation": "How does speaking falsely out of fear give rise to fear?",
        "source": "T17n0721_001:0005b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何處怖畏？",
        "translation": "Where is the fear?",
        "source": "T17n0721_001:0005b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為彼饒益，是故妄語，起如是心：『若不妄語，彼則於我多不饒益。』",
        "translation": "Because they want to benefit him, he therefore speaks falsely and gives rise to this thought, 'If I didn't speak falsely, he wouldn't benefit me much.'",
        "source": "T17n0721_001:0005b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人畏死，是故妄語。",
        "translation": "That person's fear of death causes them to speak falsely.",
        "source": "T17n0721_001:0005b08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼五因緣愚癡之人，作妄語說。",
        "translation": "That foolish man with five causes makes a false statement.",
        "source": "T17n0721_001:0005b08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆住癡法。」",
        "translation": "Thus, all of them abide in the state of delusion.\"",
        "source": "T17n0721_001:0005b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「若有何等人，　　起一妄語法，　則不畏他世，　　無惡不造作。",
        "translation": "It was then that the Bhagavān spoke in verse, saying, \"If such a person were to give rise to a false statement, then they wouldn't fear other worlds and would do nothing bad.",
        "source": "T17n0721_001:0005b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人生世間，　　口中有大斧，　若以斫自他，　　口中惡語出。",
        "translation": "If someone were born into the world with a large axe in their mouth, then they would chop themselves and others with it, and bad words would come out of their mouth.",
        "source": "T17n0721_001:0005b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是應實語，　　不應斫他人，　雖無乞求者，　　應當多少與。",
        "translation": "Thus, he should truly say, 'Don't chop others,' and even though he doesn't ask for it, he should give it in moderation.",
        "source": "T17n0721_001:0005b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此三種行者，　　捨身則生天。",
        "translation": "These three kinds of practitioners abandon their bodies and are then born in heaven.",
        "source": "T17n0721_001:0005b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若如是者，一切因緣，一切所作，莫妄語說。",
        "translation": "\"If someone does this, they mustn't speak falsely about any cause or condition or about anything that they do.",
        "source": "T17n0721_001:0005b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於他妄語心莫隨喜，亦不隨逐妄語者行，莫共同坐。",
        "translation": "Don't rejoice in another person's false speech, don't walk after a false speaker, and don't sit together.",
        "source": "T17n0721_001:0005b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若妄語人共行坐者，他人見之亦謂妄語。",
        "translation": "If someone who speaks falsely walks or sits together, then others who see it will also be called speaking falsely.",
        "source": "T17n0721_001:0005b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是若與垢業之人共相隨者，則樂垢業。",
        "translation": "Thus, if someone with whom defiled activity is associated is present, they'll enjoy defiled activity.",
        "source": "T17n0721_001:0005b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若與彼人共行坐等，雖無垢業，他謂垢業。",
        "translation": "If someone walks and sits with them, even though there's no defiled activity, it's considered defiled activity by others.",
        "source": "T17n0721_001:0005b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是者，應觀察法：惡知識者，勿與相隨。",
        "translation": "If this is the case, you should observe the teaching: \"Don't associate with a bad friend.",
        "source": "T17n0721_001:0005b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此惡知識於生死中，最堅繫縛，則墮地獄、畜生、餓鬼，所謂隨逐惡知識行；若善知識相隨行者，則得解脫。",
        "translation": "That bad friend is the strongest binding in birth-and-death, and he'll fall into hell, the animal kingdom, and the hungry ghosts, which is called following the actions of a bad friend; if a good friend follows him, then he'll be liberated.",
        "source": "T17n0721_001:0005b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣則無量，此中如是略說妄語。",
        "translation": "The list is limitless, but this is a brief explanation of false speech.",
        "source": "T17n0721_001:0005b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何兩舌？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what is duplicity?",
        "source": "T17n0721_001:0005b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩舌幾種？",
        "translation": "How many kinds of tongues are there?",
        "source": "T17n0721_001:0005b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：兩舌者，多於和合人起破壞意，口中語說。",
        "translation": "They see, hear, and know, or the divine eye sees: a duplicitous person often has destructive intentions toward people who are in harmony with them and speaks out of turn.",
        "source": "T17n0721_001:0005b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩舌二種：自作、教他。",
        "translation": "There are two kinds of duplicity: self-created and those who teach others.",
        "source": "T17n0721_001:0005c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教他者，怨家、若似怨家所遣破壞。",
        "translation": "Someone who teaches others is an enemy or someone who seems to be an enemy and sends them to do harm.",
        "source": "T17n0721_001:0005c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝破彼人，是他因緣。",
        "translation": "You contradict that person, which is the cause and condition for others.",
        "source": "T17n0721_001:0005c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有他不遣，自作破壞，令他衰惱。",
        "translation": "If another person doesn't reject it, you yourself will do damage, which will cause others to be upset.",
        "source": "T17n0721_001:0005c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復云何瞋因緣故，於他不愛？",
        "translation": "Again, what are the causes and conditions of anger that make you unattractive to others?",
        "source": "T17n0721_001:0005c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與他人惡口說惡語，聞者不愛。",
        "translation": "Speaking harsh words with another person's harsh mouth is disliked by those who hear them.",
        "source": "T17n0721_001:0005c04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何惡口？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what is bad speech?",
        "source": "T17n0721_001:0005c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：彼惡口者，貪、瞋、癡發，一切愚癡凡夫之人常行不離。",
        "translation": "They see, hear, and know, or the divine eye sees, \"That bad talk, which arouses craving, anger, and delusion, is always practiced by all foolish mortals who don't part with it.",
        "source": "T17n0721_001:0005c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是惡口有無量種，無量攀緣，無量因緣，無量心發，無量果報。",
        "translation": "Thus, there are measureless kinds of bad speech, measureless attachments, measureless causes, measureless mental arousals, and measureless rewards.",
        "source": "T17n0721_001:0005c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此語能破無量善行；此語能與一切人惡。",
        "translation": "This speech can undermine measureless good actions, and it can do evil to all people.",
        "source": "T17n0721_001:0005c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間如怨，善人不近，人所不信，此語如毒。",
        "translation": "The world is like a grudge; a good person won't come near it, and people don't believe it; this speech is like poison.",
        "source": "T17n0721_001:0005c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是惡口，惡道因緣，是垢言語，正梵行人捨離不行。」",
        "translation": "Such bad speech, the cause of a bad path, and this filthy speech are forbidden to right religious practitioners who abandon and don't practice it.\"",
        "source": "T17n0721_001:0005c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「黠慧離惡口，　　正語憙樂行，　如是美語人，　　則近涅槃住。",
        "translation": "It was then that the Bhagavān spoke a verse, saying, \"Being wise and free of harsh words, he speaks rightly and walks joyfully, and thus a person of beautiful speech approaches abiding in nirvāṇa.",
        "source": "T17n0721_001:0005c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常說善妙語，　　捨離垢惡語，　垢惡語污人，　　能令到地獄。",
        "translation": "He always speaks good, subtle words and abandons harsh speech, which can lead a person defiled by harsh speech to hell.",
        "source": "T17n0721_001:0005c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　垢語所污人，　　彼人則無善，　惡如師子蛇，　　彼不得生天。",
        "translation": "A person defiled by filthy speech is no good, and like a lion serpent, he can't be born in heaven.",
        "source": "T17n0721_001:0005c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切善語人，　　能善安慰他，　諸世間所愛，　　後世則生天。",
        "translation": "All men of good speech comfort others well, are loved by the world, and are born in the heavens in the afterlife.",
        "source": "T17n0721_001:0005c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人不惡語，　　捨離於諂曲，　雖人行如天，　　彼人善應禮。",
        "translation": "If a person doesn't speak harshly and abandons flattery, even though their conduct is like that of a god, they'll be well-pleased with courtesy.",
        "source": "T17n0721_001:0005c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　實語常行忍，　　直心不諂曲，　不惱於他人，　　彼建立法幢。",
        "translation": "They always practice forbearance with true speech, straightforwardly abstain from flattery, and don't vex others; they build a Dharma banner.",
        "source": "T17n0721_001:0005c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人命不久住，　　猶如拍手聲，　人身不如法，　　愚癡空過世。",
        "translation": "A person's life is not long-lived, just like the sound of clapping hands, a person's body is not like the Dharma, and foolishness is in vain.",
        "source": "T17n0721_001:0005c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何人不自愛？",
        "translation": "Who doesn't love themselves?",
        "source": "T17n0721_001:0005c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何人不樂樂？",
        "translation": "Who is not delighted?",
        "source": "T17n0721_001:0005c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人作惡業，　　不行自愛因。",
        "translation": "\"If a person does bad actions, they don't practice the cause of self-love.",
        "source": "T17n0721_001:0005c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　妻子及財物，　　知識兄弟等，　皆悉不相隨，　　唯有善惡業。",
        "translation": "Wives, possessions, friends, brothers, and so forth are not followed by each other, but only by good and bad actions.",
        "source": "T17n0721_001:0005c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善業不善業，　　常與相隨行，　如鳥行空中，　　影隨常不離。",
        "translation": "Good and bad actions always go along with each other like a bird walking on air, whose shadow follows and never leaves.",
        "source": "T17n0721_001:0006a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人乏資糧，　　道行則受苦，　不作善業者，　　彼眾生亦然；　如具資糧者，　　道行則安樂，　眾生亦如是，　　作福善處行。",
        "translation": "As a person lacks necessities, their path of practice becomes painful, and so do sentient beings who don't do good actions; as someone with necessities, their path of practice becomes peaceful and enjoyable, so do sentient beings who conduct themselves in a meritorious and good way.",
        "source": "T17n0721_001:0006a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　久時遠行人，　　平安得還歸，　諸親友知識，　　見之皆歡喜；　作福者亦爾，　　此死他處生，　所作諸福德，　　如親等見喜。",
        "translation": "Those who travel far away for a long time return home safely, and their friends and relatives rejoice when they see them; so does he who makes merit, born elsewhere after this death, and the merits he produces are pleasing to such people as his relatives.",
        "source": "T17n0721_001:0006a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是作福德，　　和集資未來，　福德於他世，　　則得善住處。",
        "translation": "Thus creating merit, he amasses accumulation for the future, and when merit is present in other lives, he attains a good dwelling place.",
        "source": "T17n0721_001:0006a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　福德天所讚，　　若人平等行，　此身不可毀，　　未來則生天。",
        "translation": "Praised by the gods for their merits, if a person's actions are equal, this body can't be destroyed, and in the future it will be born in the heavens.",
        "source": "T17n0721_001:0006a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀如是處已，　　黠慧者學戒，　得聖見具足，　　善行得寂靜。",
        "translation": "After observing such a place, a wise person trains in morality, attains a noble view that's complete, and conducts himself well to attain quiescence.",
        "source": "T17n0721_001:0006a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行，觀察第四不善業道綺語口業——云何綺語？",
        "translation": "\"Also, the practitioner reflects internally - following the right teaching and observing the practice of the teaching, observing the fourth unskillful activity, the path of fancy speech and verbal activity - what's fancy speech?",
        "source": "T17n0721_001:0006a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "綺語幾種？",
        "translation": "How many kinds of ornate speech are there?",
        "source": "T17n0721_001:0006a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前後語言不相應說，故名綺語；心輕速轉，前後語言相應而說，亦名綺語。",
        "translation": "When words before and after are not spoken together, it's called fancy speech; when the mind is arrogant and quickly changes, words before and after are spoken together, which is also called fancy speech.",
        "source": "T17n0721_001:0006a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從慢心起，自輕因緣，令人不信，即於現身是惡道生，一切世間輕毀之因，無所饒益。",
        "translation": "When conceit arises, it despises its own causes and conditions and causes people to be unbelieving, which means the present body is born in a bad path, and all the world despises the causes, which bring no benefit.",
        "source": "T17n0721_001:0006a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "垢語綺語，如是第四垢語口業，非善業道，勿作綺語亦莫隨喜，不應受行。",
        "translation": "Such fourth conduct of speaking foul language and fancy speech is not the path of good conduct, so don't make fancy speech, don't be pleased with it, and don't accept its practice.",
        "source": "T17n0721_001:0006a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若綺語者，則非善人。",
        "translation": "If someone speaks fancy words, they're not a good person.",
        "source": "T17n0721_001:0006a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「意不善者：貪、瞋、邪見。",
        "translation": "\"The mind is unwholesome: greed, anger, and wrong views.",
        "source": "T17n0721_001:0006a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為貪？",
        "translation": "What's greed?",
        "source": "T17n0721_001:0006a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他所攝物，自心分別，欲得彼物，非正觀察。",
        "translation": "To discriminate possessions taken in by others and desire to obtain them in one's own mind is not correct observation.",
        "source": "T17n0721_001:0006a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人如是愛樂他物，於他所有，無因、無分而自擾惱，望得彼物，故名意貪不善業道，非是可愛，非是可樂；所得果報，非意相應，非寂靜意，非是安樂。",
        "translation": "That person thus loves other's possessions and disturbs himself by desiring to obtain them without a cause or a part, which is called the unwholesome path of intentional greed, which is neither desirable nor pleasing; the resultant rewards are not associated with intention, not quiet intention, and not well-being.",
        "source": "T17n0721_001:0006a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡之人，虛妄生貪，他物叵得，虛妄分別生貪味著，心意動轉常生悕望，心樂欲取，見他財物，自得苦惱，故名為貪。",
        "translation": "A foolish man falsely becomes greedy, realizing that other things are unobtainable, falsely discriminating between them and creating craving and attachment, and his mind is constantly distracted by desire, delighting in desiring to obtain, seeing the possessions of others, and attaining misery for himself; therefore, it's called greed.",
        "source": "T17n0721_001:0006b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是意地第一貪心不善業道。",
        "translation": "Thus, this is the first stage of mindfulness, the mind of greed, and the path of unwholesome activity.",
        "source": "T17n0721_001:0006b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何名瞋意地第二不善業道？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what is the second unwholesome path of activity in the mind ground of anger?",
        "source": "T17n0721_001:0006b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：於他前人無有因緣，起瞋惡意；又復於他若貧、若富，無有因緣而見他已，意地起發重惡瞋心。",
        "translation": "\"They see, hear, and know or see with the divine eye that there's no cause for them to become angry, and that, after seeing another person who's poor or rich and has no cause, they will intentionally arouse a heavy, ill-will.",
        "source": "T17n0721_001:0006b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以瞋因緣，於地獄受。",
        "translation": "Because of the causes and conditions of that anger, he'll be sentenced to hell.",
        "source": "T17n0721_001:0006b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善法穀等，既成熟已，瞋心如雹，壞善穀等；唯正智眼，對治彼闇。",
        "translation": "After the grain of good qualities and so forth has matured, anger is like a hailstorm that destroys the grain of goodness and so forth; only the eye of right knowledge can counteract that darkness.",
        "source": "T17n0721_001:0006b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋心如火，燒一切戒。",
        "translation": "An angry mind is like fire, which burns all the precepts.",
        "source": "T17n0721_001:0006b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋則色變，是惡色因。",
        "translation": "When anger is present, form changes, which is the cause of bad form.",
        "source": "T17n0721_001:0006b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋如大斧，能斫法橋，住在心中，如怨入舍；此世、他世，心一正行，瞋能壞破。",
        "translation": "Like a great axe that can chop down a bridge of the Dharma, anger abides in the mind like a grudge entering a house; in this or other worlds, when the mind conducts itself correctly, anger can destroy it.",
        "source": "T17n0721_001:0006b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨彼瞋心，慈是對治及四聖諦：苦、集、滅、道。",
        "translation": "Abandoning that anger, kindness is the antidote and the four noble truths: suffering, arising, cessation, and the path.",
        "source": "T17n0721_001:0006b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行地獄行，瞋為上使，唯有善人、聖聲聞人、聞法義人乃能捨離。",
        "translation": "When practicing the practices of hell, anger is the strongest tendency, and only a good person, a noble śrāvaka, or someone who hears the meaning of the teaching can abandon it.",
        "source": "T17n0721_001:0006b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又修行者內心思惟——隨順正法觀察法行——云何邪見正法障礙，一切惡見，心之黑闇？",
        "translation": "\"Furthermore, when a practitioner reflects internally - following the right teaching and observing the practice of the teaching - what are the hindrances of wrong views, right teachings, and all bad views, and the darkness of the mind?",
        "source": "T17n0721_001:0006b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見聞知或天眼見：無始以來行邪見因，墮於地獄、餓鬼、畜生，故名黑闇。",
        "translation": "They see and hear and know or see with the divine eye: since beginningless time, they've practiced wrong views as a cause and have fallen into hell, hungry ghosts, and animals, which is why they're called darkness.",
        "source": "T17n0721_001:0006b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂邪見者，正道障礙，如刀、火、毒、嶮岸惡處，唯有一切愚癡之人，貪著樂行，以顛倒見，故名邪見。",
        "translation": "An evil view of pleasure is an obstruction to the right path, such as a sword, fire, poison, or a dangerous place on a dangerous shore, except for all foolish people who cling to pleasurable actions with a mistaken view, which is called an evil view.",
        "source": "T17n0721_001:0006b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有二種：一、信邪因；二、心不信業果報法。",
        "translation": "There are two kinds of wrong views: those who believe in wrong causes and those who don't believe in the mind as the result of actions and principles.",
        "source": "T17n0721_001:0006b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信邪因者，作如是知：身等樂、苦皆是天作，非業果報。",
        "translation": "Someone who believes in wrong causes will know in this way: 'The pleasures and pains of the body are all created by gods, not the results of actions.'",
        "source": "T17n0721_001:0006b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於業果報心不信者，謂無施等。",
        "translation": "Someone who doesn't believe in the results of actions mentally means there's no generosity and so forth.",
        "source": "T17n0721_001:0006b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名邪見。",
        "translation": "This is called wrong view.",
        "source": "T17n0721_001:0006b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十種不善業道、不饒益業，一切皆以邪見為本。",
        "translation": "These ten kinds of unwholesome actions and unbeneficial actions all have their roots in wrong views.",
        "source": "T17n0721_001:0006b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法念處經卷第一",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 1",
        "source": "T17n0721_001:0006b29_0",
        "is_bad_quality": false
    }
]