[
    {
        "source_sentence": "佛說除恐災患經",
        "translation": "Sutra on the Removal of Fear and Disaster",
        "source": "T17n0744_001:0552a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乞伏秦沙門釋聖堅譯",
        "translation": "Translated by Śrīgarbha Śākyamuni, a Kivuqin monk",
        "source": "T17n0744_001:0552a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛遊王舍城竹林精舍，與四部弟子大眾俱會，說上妙法。",
        "translation": "Thus I have heard: One time, the Buddha traveled to the Bamboo Grove Monastery in Rājagṛha and gathered with a large assembly of four groups of disciples to teach the most wonderful Dharma.",
        "source": "T17n0744_001:0552a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，維耶離國厲氣疫疾，威猛赫赫猶如熾火，死亡無數，無所歸趣，無方療救。",
        "translation": "At the time, the country of Vaiśālī was stricken with a fierce epidemic that was as powerful and powerful as a blazing fire, killing countless people, with no place of refuge and no way to cure it.",
        "source": "T17n0744_001:0552a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王、大臣、長者、居士、婆羅門集會博議：「國遭災患，非邪所摧，疫火所燒，死亡無數。",
        "translation": "The king, his ministers, elders, householders, and priests assembled to discuss the situation, saying, \"The country is beset by a disaster that's not caused by evil, and it's burned by the epidemic fire, which causes countless deaths.",
        "source": "T17n0744_001:0552a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以何義，設何方便，以除災害？」",
        "translation": "What do you think will be the purpose and what methods will be devised to remove the calamity?\"",
        "source": "T17n0744_001:0552a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門議言：「當於諸城門，設祠祀壇。」",
        "translation": "The Brāhmaṇas say, \"Shrines and altars should be erected at the entrances to cities.\"",
        "source": "T17n0744_001:0552a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有議言：「當於城中四衢路頭，立大祠祀，禳却害氣。」",
        "translation": "Some say, \"A great shrine will be erected at the head of the city's four roads to stave off harmful influences.\"",
        "source": "T17n0744_001:0552a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有議言：「當用白馬、白駝、白牛、白羊、白雞、白狗，種種百頭而以祠祀，鎮厭解除，以禳却之。」",
        "translation": "Others say, \"A hundred heads of white horses, white camels, white cattle, white sheep, white chickens, and white dogs should be used as sacrifices to quell disillusionment and avert it.\"",
        "source": "T17n0744_001:0552a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時眾會中，有一長者名曰彈尼(晉言才明)，奉佛五戒，修行十善，為清信士，諦證道迹，時發議曰：「唯聽所言，國遭災患，死亡無數；如仁等議，害生救命，豈得然乎？",
        "translation": "At the time, there was an elder in the assembly named Danni (Jin word cai ming) who had upheld the Buddha's five precepts, cultivated the ten good qualities, was a man of pure faith, and had truly realized the steps of the Way.",
        "source": "T17n0744_001:0552a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以先世時所行不善，今遭斯厄。",
        "translation": "It's because of the unwholesome things they did in previous lives that they've now suffered this misfortune.",
        "source": "T17n0744_001:0552a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當設方便，以善禳惡，永與苦別；如何反倒，行害求安，長夜受苦，無有出期。」",
        "translation": "You must devise a way to avert evil with goodness, so you'll be permanently spared from suffering; how can you go the other way and practice harm and seek safety, suffering for a long time with no hope of escape?\"",
        "source": "T17n0744_001:0552a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸大會，問才明曰：「當設何議？」",
        "translation": "The assembly then asked Cai Ming, \"What advice should he give?\"",
        "source": "T17n0744_001:0552a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "才明對曰：「世有大怙，三千世界、天人之師，一切覆護，慈愍眾生，號名為佛，獨步三界。",
        "translation": "Cai Ming replied, \"There's a great father, teacher of the 3,000 worlds and gods, who protects them all, has compassion for sentient beings, and is called the Buddha, who steps into the three realms alone.",
        "source": "T17n0744_001:0552a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能降致，光臨國者，災害可除。」",
        "translation": "If he could descend and visit his country in his glory, disasters and harm could be removed.\"",
        "source": "T17n0744_001:0552a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大眾聞之，皆然其議，莫不稱善。",
        "translation": "When the multitude heard this, they all approved of his suggestion, and none of them praised it as good.",
        "source": "T17n0744_001:0552a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "才明又曰：「佛無數劫，修治六度，布施無限，國城財寶、象馬車乘、頭目髓腦、肌體妻子，戒忍、精進、一心、智慧，每生自尅，不可計量，以求佛道，不為己身，但為眾生，救濟危厄，消除眾患，生老病死，地獄、鬼神、畜生之苦。",
        "translation": "Cai Ming also said, \"For countless eons, the Buddha has cultivated the six perfections, given generosity without limit, treasures to countries and cities, elephants, horses, chariots, vehicles, heads, eyes, marrow, brains, muscles, wives, moral discipline, patience, effort, single-mindedness, and wisdom, each of which has produced incalculable results, in order to pursue the Buddha Way, not for himself but for sentient beings, to rescue them from danger and trouble, to eliminate the suffering of birth, old age, illness, death, hell, ghosts, and animals.",
        "source": "T17n0744_001:0552a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今成佛道，順其本誓，周行濟救，授甘露藥，消除眾生今世、後世苦毒之患，永令獲安。」",
        "translation": "Now, when he achieves the Buddha Way, he follows his original vow to save and rescue sentient beings from the pain and suffering of this world and the next, so that they can always be at peace.\"",
        "source": "T17n0744_001:0552b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾會咸曰：「如仁所言，甚誠大快。",
        "translation": "Everyone in the assembly said, \"As you say, it's very sincere and very pleasant.",
        "source": "T17n0744_001:0552b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍，阿闍世王與吾國嫌，豈當聽佛來至此耶？」",
        "translation": "While the Buddha is in the king's quarters, how could the king of Ajātaśatru and our country be at odds with each other and not hear the Buddha come here?\"",
        "source": "T17n0744_001:0552b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復有言：「儻聽佛來。」",
        "translation": "Some people also say, \"I've heard of the coming of the Buddha.\"",
        "source": "T17n0744_001:0552b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，才明曰：「佛興出世，救眾生苦，猶如虛空，無所罣礙，誰能制止？",
        "translation": "Cai Ming then said, \"The Buddha arises in the world to save sentient beings from suffering like space, with no obstruction, so who can stop it?",
        "source": "T17n0744_001:0552b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如日光，萬物萌生，莫不蒙育！",
        "translation": "Just like daylight, all things sprout and are not nurtured!",
        "source": "T17n0744_001:0552b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛憐國厄，必來無疑。",
        "translation": "\"The Buddha pitied the country's difficulties and left no doubt that he would come.",
        "source": "T17n0744_001:0552b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但遣重使，貢遺琦珍，溫辭雅謝，詣阿闍世；又別歸佛，委命酸切。",
        "translation": "He simply sent a valuable envoy to the Ajātaśatru with gifts of rare treasures, gave gentle words and elegant thanks, and visited the Ajātaśatru; he also returned to the Buddha separately and entrusted him with his sour instructions.",
        "source": "T17n0744_001:0552b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心雖懷嫌，信使賢重，貢遺妙寶，辭理柔軟，事無不泰。",
        "translation": "Although he harbored resentment in his heart, the messenger was faithful and respectful, offering a gift of marvelous treasures that was gentle in speech and principle and not unpleasant in deed.",
        "source": "T17n0744_001:0552b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自古已來，隣國不恊，還相侵叛，皆由明使，名寶重貢，軟辭遜順，而得和恊。」",
        "translation": "Since ancient times, neighboring states have been at odds and have rebelled against each other, but it was because of wise messengers who paid tribute to famous treasures, were gentle and deferential, and achieved harmony.\"",
        "source": "T17n0744_001:0552b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "展轉相謂，思誰任使。",
        "translation": "They kept talking to each other, considering who would be their envoy.",
        "source": "T17n0744_001:0552b13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大眾、國王、大臣、長者、居士皆同意言：「唯清信士長者才明，是佛弟子，可以為使，往行請佛。",
        "translation": "At the time, the crowd, the king, the ministers, the elders, and the householders all agreed, saying, \"Only that man of clear faith, the elder, is a talented and insightful disciple of the Buddha who can be an envoy to go and invite him to the Buddha.",
        "source": "T17n0744_001:0552b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0744_001:0552b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先眾開建請佛之議。」",
        "translation": "The previous crowd had suggested that we invite the Buddha.\"",
        "source": "T17n0744_001:0552b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便告才明：「唯仁可往，詣王舍國，與王相問，求請佛來。」",
        "translation": "They then told Cai Ming, \"Only you, sir, can go to Rājagṛha and ask the king about inviting the Buddha.\"",
        "source": "T17n0744_001:0552b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時才明，受使欲往。",
        "translation": "Cai Ming was then instructed to go there.",
        "source": "T17n0744_001:0552b18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，大眾皆起退坐，向佛方面，叉手長跪，五體投地，以頂禮佛，跪告才明：「佛天中天，慈悲喜護，加於群生，唯憐鄙國遭遇大患，疾病死亡，猶猛野火焚燒草木，普遭困厄。",
        "translation": "At that point, the whole group rose and withdrew from their seats, knelt down with their palms together, threw their five bodies to the ground, saluted the Buddha with their heads, and knelt down to tell Cai Ming, \"The Buddha, god of gods, is compassionate, joyful, and protective of all living beings, but I pity the great trouble that has befallen my country, which has caused illness and death and is like a fierce wildfire burning grass and trees, and which has caused widespread misery.",
        "source": "T17n0744_001:0552b18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸佛世尊猶冥求曉，寒願朝陽，渴暑陰飲，病追良醫，迷者求導。",
        "translation": "Fortunately, the Bhagavān still seeks dawn in the dark, wishes for the morning sun in cold weather, drinks from the shadows in hot and thirsty weather, seeks a good doctor for the sick, and seeks guidance for the deluded.",
        "source": "T17n0744_001:0552b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願，世尊！",
        "translation": "Long live the Bhagavān!",
        "source": "T17n0744_001:0552b24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "垂降救濟，授甘露法，令得穌息。」",
        "translation": "He will come down to rescue them and give them the nectar Dharma, so that they may come to rest.\"",
        "source": "T17n0744_001:0552b24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，才明受命為使，詣羅閱祇，涉路徑達，到王舍城，詣門求通書命貢遺。",
        "translation": "Cai Ming was then commissioned as an envoy, went to Rājagṛha, waded through the roads, reached the king's castle, and went to the gate to ask for a commemoration of the order.",
        "source": "T17n0744_001:0552b25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王聽見，才明啟言：「奉使詣國，前雖不和，無他重隙，故先致虔，除前不恊，俱綏萬民。",
        "translation": "When the king heard this, Cai Ming revealed, \"Although my mission to the country was not concordant, there was no other serious gap, so I first offered my respects to remove the previous inconsistency and to help all the people.",
        "source": "T17n0744_001:0552b26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛興於世大慈普覆，國有重患，因命請佛。",
        "translation": "The Buddha has arisen in the world to extend great compassion and universal protection, and the country is in serious trouble, so I've been ordered to invite him.",
        "source": "T17n0744_001:0552b28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願大王，勸佛迴光，顧臨鄙國，救濟災患，冀蒙神祐。」",
        "translation": "Please, Your Majesty, encourage the Buddha to shed his light on our country, save it from misfortune, and hope for divine blessing.\"",
        "source": "T17n0744_001:0552b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王默思惟：「適欲留佛，令不出國，無理得爾，非力所制。",
        "translation": "The king silently thought, \"It's appropriate to want to keep the Buddha from leaving the country, but there's no reason why he should be able to do so, and it's not limited by his powers.",
        "source": "T17n0744_001:0552c01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以大慈，普許十方，等視憎愛，救濟為務，以是之故，不可留之。」",
        "translation": "Because of his great kindness, the Buddha universally approves of the ten directions, equally regards what's hated, and makes it his business to rescue and protect.",
        "source": "T17n0744_001:0552c03_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便告才明：「可詣佛所，宣貴國命。」",
        "translation": "He then told Cai Ming, \"You may go to the Buddha and proclaim the mandate of your country.\"",
        "source": "T17n0744_001:0552c04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，才明辭詣竹林，行到精舍。",
        "translation": "Thereupon, Cai Ming left and went to the bamboo grove and made his way to the monastery.",
        "source": "T17n0744_001:0552c05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見佛世尊，盡虔禮敬，五體投地，右遶三匝，長跪叉手，而白佛言：「維耶離國諸王、大臣、長者、居士，遙禮佛足。",
        "translation": "When he saw the Bhagavān, he paid full reverence, threw his five bodies to the ground, circled his right three times, knelt down long with his palms together, and said to the Buddha, \"The kings, ministers, elders, and householders of Vaiśālī pay homage to the Buddha's feet.",
        "source": "T17n0744_001:0552c06_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯天中天，普慈眾生，莫不蒙濟。",
        "translation": "Only the god of gods is universally compassionate toward all sentient beings, and none of them will be saved.",
        "source": "T17n0744_001:0552c08_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄙國遭厄，唯願世尊，垂恩降光，憐愍苦厄，令得穌息。」",
        "translation": "I hope the Bhagavān will extend his blessings and send down his light to pity the suffering and distress of our country and bring relief to it because it's in trouble.\"",
        "source": "T17n0744_001:0552c09_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛默然，許其所請。",
        "translation": "The Buddha then remained silent and granted his request.",
        "source": "T17n0744_001:0552c10_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "才明見佛受請許往，歡喜無量。",
        "translation": "Cai Ming rejoiced immeasurably when he saw that the Buddha had accepted the invitation to go.",
        "source": "T17n0744_001:0552c11_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王舍國境內神祇、天、龍、鬼神，知佛受請，當詣他國，莫不躁動，慘然不悅，便現感應，語其國王阿闍世曰：「大王如何安然無憂？",
        "translation": "When the gods, goddesses, dragons, and demons within the king's household knew that the Buddha had been invited to visit another country, they were all agitated and upset, and then they showed up with a vision and said to the king Ajātaśatru, \"How is the king at peace and without sorrow?",
        "source": "T17n0744_001:0552c11_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於今不久，當違離佛，猶如嬰兒失其二親，喻行曠路斷失水漿，譬如猛寒亡失衣裳。",
        "translation": "Soon, they'll be separated from the Buddha, like a baby who loses its two parents, a metaphor for cutting off water and milk while traveling a long way, or a man who loses his robe in the fierce cold.",
        "source": "T17n0744_001:0552c14_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今佛當行，國失恃怙，其喻如是。」",
        "translation": "Now, when the Buddha is about to leave, the country will lose its father and mother, and this is the metaphor.\"",
        "source": "T17n0744_001:0552c16_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞神祇降應說是，情即愴然，甚懷愁苦，默然思惟：「眾生頑愚，志性鈍濁，今離世尊，安從復得智慧之礪磨瑩鈍心？",
        "translation": "When the king heard that the gods had descended to answer him, he was distressed and greatly distressed, and he silently considered, \"Are sentient beings stubborn and foolish, dull in resolve, and now that we've left the Bhagavān, how could we again attain the lively, polished, and dull mind of wisdom?",
        "source": "T17n0744_001:0552c17_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當濟其塵勞重愆、宿世重責？",
        "translation": "Who will help him with the heavy burden of worldly sufferings and the heavy responsibilities of prior lifetimes?",
        "source": "T17n0744_001:0552c19_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當誨除一切眾生重罪令輕？",
        "translation": "\"Who will instruct all sentient beings to make their serious sins less serious?",
        "source": "T17n0744_001:0552c20_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等久在生死牢獄，重關所閉，誰當復以正法之鑰，開生死獄重關牢閉？",
        "translation": "We've been in the prison of birth and death for a long time, shut off by heavy barriers, so who will again open the heavy barriers of the prison of birth and death with the key of the true Dharma?",
        "source": "T17n0744_001:0552c21_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等普為勞垢，盛陽暑熱所炙，安從復得佛清涼教月精明珠，消除炎熱？」",
        "translation": "We are all scorched by the filth of toil and the heat of the sun, so how could we again obtain the moonlight pearl, the clear and cool teaching of the Buddha, to remove the heat?\"",
        "source": "T17n0744_001:0552c22_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即勅嚴駕，出詣佛所，稽首佛足，右遶三匝，却坐常位。",
        "translation": "The king then commanded Imahyan to drive him out to the Buddha, bowed his head at his feet, circled him three times to his right, and withdrew to sit in his usual position.",
        "source": "T17n0744_001:0552c24_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛為王說正法化，初中竟善，淨身口意，清淨微妙。",
        "translation": "The Buddha then taught the king the correct teaching, which was ultimately good at first, purified his body, speech, and mind, and was pure and subtle.",
        "source": "T17n0744_001:0552c25_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王心歡喜，叉手白佛：「頃維耶離，使請世尊，承已許往，心甚懷慘，無方留尊。",
        "translation": "Rejoicing in his heart, the king saluted the Buddha with his palms together, \"I've been asked by Vaiśālī to go to the Bhagavān, and I've accepted your permission to go.",
        "source": "T17n0744_001:0552c27_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯垂矜愍，特受鄙請，住宮三月。」",
        "translation": "Please have mercy on us and accept our humble invitation to stay at the palace for three months.\"",
        "source": "T17n0744_001:0552c28_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告王言：「眾生可傷，若住三月，何時當周眾苦厄者？",
        "translation": "The Buddha told the king, \"All sentient beings are hurtful; if we stay for three months, when will we be able to help those who suffer and are destitute?",
        "source": "T17n0744_001:0552c29_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾無數劫，苦身求道，為眾生故，願欲成佛，以甘露藥，施於眾生。",
        "translation": "For countless eons, I've suffered physically to pursue the path for the sake of sentient beings, wishing to become a buddha and giving the nectar of medicine to sentient beings.",
        "source": "T17n0744_001:0553a01_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今願已成，猶如有人合和神藥，欲救眾患；值遇病者，違其本誓而不授與，則非良醫。",
        "translation": "Now that that vow has been fulfilled, I'm like a person who combines miraculous medicines to save sentient beings from illness, but when they encounter a sick person and don't give them to them in violation of their original vow, they're not a good doctor.",
        "source": "T17n0744_001:0553a03_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在江側，見漂流人，不往救度，非賢士宜。",
        "translation": "If someone is on the bank of a river and sees a person adrift and doesn't go to their rescue, that's not appropriate for a good man.",
        "source": "T17n0744_001:0553a05_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於曠野，見失路者，不示正道，是則非仁。",
        "translation": "If someone in the wilderness sees a person who's lost the way and doesn't show them the right path, that's not kind.",
        "source": "T17n0744_001:0553a06_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾以大慈，普愍眾生，故遊諸國，縣邑村落，救濟眾苦，賦甘露藥，無恃者恃，無歸者歸。」",
        "translation": "Because of my great kindness and universal pity for sentient beings, I travel to countries, towns, and villages to rescue people from suffering and give them ambrosia as medicine, so that those who lack reliance can rely on it and those who lack refuge can return to it.\"",
        "source": "T17n0744_001:0553a07_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王重白佛：「唯垂慈恩，許受二月。」",
        "translation": "The king repeatedly said to the Buddha, \"Only grant me the kindness of accepting two months' worth of this medicine.\"",
        "source": "T17n0744_001:0553a09_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛故不許。",
        "translation": "The Buddha therefore didn't permit it.",
        "source": "T17n0744_001:0553a09_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王重慇懃，長跪叉手，垂泣白言：「命難可保，猶露然燈，遇無常風，奄忽便滅。",
        "translation": "With great care, the king knelt down with his palms together and said with tears in his eyes, \"My life is difficult to preserve. I'm like a dewy lamp that meets a wind of impermanence and goes out suddenly.",
        "source": "T17n0744_001:0553a10_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今與佛別，何時當復更覩尊顏，幸受二月？」",
        "translation": "Now that I've parted with the Buddha, when will I see his venerable face again and have the pleasure of accepting two months?\"",
        "source": "T17n0744_001:0553a11_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛重不許。",
        "translation": "The Buddha gravely disallowed it.",
        "source": "T17n0744_001:0553a12_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王便投身於佛足下：「唯願世尊特加大慈，與弟子眾，許住一月。」",
        "translation": "The king then threw himself at the Buddha's feet and said, \"Please, Bhagavān, show special compassion and allow my disciples to stay for a month.\"",
        "source": "T17n0744_001:0553a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊不忍，即便許受。",
        "translation": "The Bhagavān couldn't bear it, so he accepted it.",
        "source": "T17n0744_001:0553a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王便還起，心悅懷敬，遶佛三匝，禮辭還宮。",
        "translation": "The king then rose again, was pleased and respectful, circled the Buddha three times, and returned to the palace with prostrations.",
        "source": "T17n0744_001:0553a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勅厨饌具百味之飯，極令精好，鮮甘香潔，宮裏張施，繒綵幡蓋，雜寶床机，綩綖坐具。",
        "translation": "He ordered his cook to prepare a hundred kinds of delicious food, making it very fine, fresh, sweet, and clean, and he spread out decorations inside the palace, decorating it with silken banners and banners, miscellaneous jeweled beds and chairs, and thongs and banners for sitting.",
        "source": "T17n0744_001:0553a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "掃除繕治，香汁灑地，眾事辦畢。",
        "translation": "They were swept and cleaned, and the floor was sprinkled with scented juice, so many things were accomplished.",
        "source": "T17n0744_001:0553a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日時至，王於正路，遙向世尊，燒香長跪：「佛天中天！",
        "translation": "When the sun rises, the king burns incense and kneels down in front of the Bhagavān at a distance on the main road, saying, \"Buddha, god of gods!",
        "source": "T17n0744_001:0553a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖達知時，願與聖眾迴降神光，到宮蔬食。」",
        "translation": "When the noble adept knew this, he vowed to send down a divine light with the holy people to the palace to serve them with food.\"",
        "source": "T17n0744_001:0553a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，世尊勅諸弟子，法服執器，行詣王請。",
        "translation": "The Bhagavān then commanded his disciples to dress themselves in the Dharma robes and carry their vessels to the king's invitation.",
        "source": "T17n0744_001:0553a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與聖眾俱到王宮，王即盡虔，花香伎樂，宮門迎佛，入各就坐。",
        "translation": "When the Buddha and the noble multitude arrived at the palace, the king went out with reverence, flowers, music, and incense to greet the Buddha at the palace gate and enter and sit down.",
        "source": "T17n0744_001:0553a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自行水，周遍聖眾，手自斟酌，百味飯食，鮮潔香甘，一切平等。",
        "translation": "The king poured his own water, surrounded the sages with his own hands, and served a hundred flavors of food that was fresh, clean, and sweet, all of which were equal.",
        "source": "T17n0744_001:0553a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日日供養飯食、臥具、疾藥所須。",
        "translation": "Day by day, he provides food and drink, bedding, and medicines for illnesses.",
        "source": "T17n0744_001:0553a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令勅外宮，治填道路，種植街樹；七行街路乃至江水，頓息帳幔及床座具，嚴飾幡蓋，猶如天街；更新造作五百七寶蓋。",
        "translation": "He ordered his outer palace to fill in the roads, plant street trees, make seven rows of roads down to the river, suspend tents and seat cloth, decorate banners and shrouds like the streets of heaven, and renew and build five hundred and seven jeweled canopies.",
        "source": "T17n0744_001:0553a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維耶離國，聞佛當至，亦復平治七行階路，種植行樹，帳幔床座。",
        "translation": "When the kingdom of Vaiśālī heard that the Buddha was coming, it also pacified seven rows of roads, planted rows of trees, and built tents, curtains, and seats.",
        "source": "T17n0744_001:0553a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王、大臣、長者、居士各從大眾，出國迎佛。",
        "translation": "The king, his ministers, elders, and householders each went out from the masses to welcome the Buddha.",
        "source": "T17n0744_001:0553a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一月期滿，佛與聖眾出宮臨路，王從大眾，以花散佛，周遍覆地。",
        "translation": "When the first month was up, the Buddha and his noble people left the palace and approached the road, and the king followed the crowd and scattered flowers to cover the ground with the Buddha.",
        "source": "T17n0744_001:0553b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大眾來集，猶秋水長投於大海。",
        "translation": "The great multitude that had gathered was like autumn water plunging into the ocean.",
        "source": "T17n0744_001:0553b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白明月珠校七寶蓋，王以恭敬，手執奉上，以覆世尊。",
        "translation": "The king respectfully hand-carried a white moon-bead decorated with a seven-jewel canopy and presented it to the Bhagavān.",
        "source": "T17n0744_001:0553b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與大眾尋路而行，至江水側。",
        "translation": "The Buddha and the whole crowd found their way there and reached the river.",
        "source": "T17n0744_001:0553b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王上佛五百七寶蓋，大海龍王亦復敬奉五百七寶蓋，恒水諸龍亦俱上佛五百七寶蓋。",
        "translation": "The king then presented the Buddha with five hundred and seven jeweled canopies, and the dragon king of the ocean also presented five hundred and seven jeweled canopies with respect, and the dragons of the Gaṅgā River also presented the Buddha with five hundred and seven jeweled canopies.",
        "source": "T17n0744_001:0553b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋將諸天眾亦復獻佛五百七寶蓋。",
        "translation": "The god Indra then sent a multitude of gods to present the Buddha with five hundred and seven jeweled canopies.",
        "source": "T17n0744_001:0553b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維耶離大眾迎者，服飾嚴麗，青馬、青車、青蓋、青幡，服飾皆青；赤馬、赤車，服飾皆赤；黃馬、黃車，服飾皆黃；白馬、白車，服飾皆白；黑馬、黑車，服飾皆黑；色色部別，將從無數。",
        "translation": "The Vaiśālī crowd was greeted by a magnificent array of apparel, including blue horses, blue chariots, blue canopies, and blue banners, all decorated in blue; red horses and red chariots, all decorated in red; yellow horses and yellow chariots, all decorated in yellow; white horses and white chariots, all decorated in white; black horses and black chariots, all decorated in black; and a myriad of different kinds of apparel.",
        "source": "T17n0744_001:0553b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛遙見之，告諸弟子：「欲知天帝出遊觀時威儀，如是。」",
        "translation": "When the Buddha saw them from a distance, he told his disciples, \"This is how you want to know the emperor's demeanor when he travels around and observes them.\"",
        "source": "T17n0744_001:0553b12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維耶離國，奉迎上佛五百七寶蓋，各以其蓋前至佛所，各白佛言：「佛天中天！",
        "translation": "Vaiśālī welcomed the five hundred and seven jeweled canopies of the Buddha, and they each went to the Buddha with their canopies and said to him, \"Buddha, god of gods!",
        "source": "T17n0744_001:0553b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普世覆蓋，願受蓋施。」",
        "translation": "Covered by the whole world, he vowed to accept the lid as an offering.\"",
        "source": "T17n0744_001:0553b15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛受其施，餘留一蓋。",
        "translation": "The Buddha accepted his gift and left the rest as a lid.",
        "source": "T17n0744_001:0553b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸大眾，心各懷疑，不審為是宿世積德行善之報。",
        "translation": "The masses then each doubted it in their minds, not realizing that it was the result of virtue and good deeds accumulated in prior lifetimes.",
        "source": "T17n0744_001:0553b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海龍、恒龍、忉利天帝、維耶離國、羅閱祇王，各各奉上七寶妙蓋，同時俱會，又疑何故不受一蓋？",
        "translation": "The sea dragon, the constant dragon, the goddess of the Dignāga, Vaiśālī, and King Rājagṛha each presented a marvelous lid of seven treasures to the audience at the same time, and they each wondered why they wouldn't accept one lid.",
        "source": "T17n0744_001:0553b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，阿難知眾懷疑，長跪叉手，前白佛言：「惟，天中天！",
        "translation": "Knowing that the crowd suspected it, Ānanda knelt down and saluted the Buddha with his palms together, saying, \"Yes, god of gods!",
        "source": "T17n0744_001:0553b19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大眾普疑，今日何緣，有是二千五百七寶寶蓋，同時俱至，奉上世尊，為是前世善本報乎？",
        "translation": "Everyone wonders, \"Today, what is the reason that these 2,500,700 baby hats have arrived at the same time to present themselves to the Bhagavān as the original result of goodness in prior lives?",
        "source": "T17n0744_001:0553b20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今現福耶？",
        "translation": "Is it presently meritorious?",
        "source": "T17n0744_001:0553b22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊，決一切疑。」",
        "translation": "Please let the Bhagavān resolve all your doubts.\"",
        "source": "T17n0744_001:0553b23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「一心專聽，今當決除汝等所疑。",
        "translation": "The Buddha told Ānanda, \"Concentrate your mind and listen intently; now I will resolve your doubts.",
        "source": "T17n0744_001:0553b23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去無央數劫時，有轉輪聖王，名曰摩調(晉言大天)，典主四域。",
        "translation": "It was a long time ago, in an incalculably long eon, that there was a wheel-turning sage king named Mathis (a Jin term for a great god) who ruled four domains.",
        "source": "T17n0744_001:0553b24_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有千子，七寶導從。",
        "translation": "The king had a thousand sons who were guided by seven treasures.",
        "source": "T17n0744_001:0553b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王末少子，見其父王七寶御蓋，還問母曰：『我當何時得服此蓋，以自光飾？』",
        "translation": "When the king's youngest son saw his father's seven-jewel royal canopy, he also asked his mother, 'When will I be able to wear this canopy to adorn myself?'",
        "source": "T17n0744_001:0553b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母言：『惟子，王千子中汝最末小，若無大王，太子承嗣；若太子崩，以次承繼，展轉千子，汝骨朽腐，未央得蓋。』",
        "translation": "His mother said, 'But son, you're the least of a thousand sons of the king; if there's no great king, the crown prince will inherit; if the crown prince dies, he'll take over in succession, spreading over a thousand sons; your bones will rot, and you may not yet be able to obtain a lid.'",
        "source": "T17n0744_001:0553b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重問母曰：『無蓋望耶？』",
        "translation": "Again, he asked his mother, 'Is there no hope of a lid?'",
        "source": "T17n0744_001:0553c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因聞有死，形骸當朽，宿福追逮，悚然心恐，惟人生世，必當有死。",
        "translation": "When I heard that there would be death, my body would decay, and my past merits would catch up with me, I was frightened and scared, thinking that in this world, there would surely be death.",
        "source": "T17n0744_001:0553c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因報母曰：『唯願見聽，捨家學道。』",
        "translation": "He therefore told his mother, 'I wish I could see and hear you, leave home, and train on the path.'",
        "source": "T17n0744_001:0553c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母甚愍傷，不違其願。",
        "translation": "His mother was very sympathetic, and she didn't disobey his wish.",
        "source": "T17n0744_001:0553c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母告之曰：『聽汝捨家，若卿道成，要還見吾，爾乃相聽。』",
        "translation": "She told him, 'I'll let you leave home, but if you accomplish the path, you must return to see me, and then I'll listen to you.'",
        "source": "T17n0744_001:0553c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『如勅，道成當還。』",
        "translation": "She replied, 'As I've told you, you'll return when your path is accomplished.'",
        "source": "T17n0744_001:0553c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「即詣林藪，除剃鬚髮，被著法服，靜處勤修，精進不懈，竭盡塵勞，成緣覺道。",
        "translation": "\"He then went to the forest, shaved off his hair, put on the Dharma robe, went to a quiet place, cultivated, and worked tirelessly to exhaust his worldly sufferings and achieve the path of the solitary realizer.",
        "source": "T17n0744_001:0553c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊行諸國，縣邑村落，福度眾生。",
        "translation": "He traveled to various countries, towns, and villages, and merited to save sentient beings.",
        "source": "T17n0744_001:0553c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所種善本，忽憶母要，便上昇空，猶如鴈王，還本國宮，與母相見。",
        "translation": "When he suddenly recalls his mother's request, he ascends into the sky like a king in flight and returns to his native palace to meet his mother.",
        "source": "T17n0744_001:0553c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "闔宮大小，見道士神通，莫不歡喜。",
        "translation": "Everyone in his palace, large and small, rejoiced when they saw the Daoist's superb abilities.",
        "source": "T17n0744_001:0553c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王諸婇女八萬四千，共請令住；道士慈仁，不逆一切，便受其請。",
        "translation": "The king's women, numbering 84,000, all invited him to stay, but the Daoist was kind and accepted his invitation without disobeying them.",
        "source": "T17n0744_001:0553c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婇女輩，於宮後園，為設廬窟，止宿其中。",
        "translation": "The women in the retreat set up a cave in the back garden of the palace and stayed there.",
        "source": "T17n0744_001:0553c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉宮供養衣食、床臥、疾藥所須，朝暮禮事。",
        "translation": "They presented the palace with offerings of food and clothing, beds and bedding, and what was needed for illness and medicine, and they paid homage to them morning and evening.",
        "source": "T17n0744_001:0553c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一切世間，壯者皆老，強健必病，生者皆死。",
        "translation": "\"In all the world, the strong become old, the robust become ill, and the living die.",
        "source": "T17n0744_001:0553c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛於其宮園，便捨壽命。",
        "translation": "At the time, Prakaraṇa Buddha abandoned his life in his palace grounds.",
        "source": "T17n0744_001:0553c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉宮婇女，薪油花香，供養以禮，斂骨起塔，朝暮禮拜，燒香然燈。",
        "translation": "He gathered palace maids, paid homage with oil and flowers, gathered bones and raised a stūpa, paid homage to him morning and evening, and burned incense and a lantern.",
        "source": "T17n0744_001:0553c16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時王大天巡四域還，臨幸後園，見有此塔，顧問侍臣：『何故有是？』",
        "translation": "\"When the king returned from his tour of the four regions and visited his backyard, he saw this stūpa and asked his attendants, 'Why is there such a thing?'",
        "source": "T17n0744_001:0553c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婇女對曰：『此是聖王最下少子，離家學道，於此壽終，為立是塔。』",
        "translation": "The female replied, 'This is the lowest of the noble king's sons, who left home to train on the path and had this stūpa erected for him when he reached the end of his life.'",
        "source": "T17n0744_001:0553c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因重發問：『是誰之子？",
        "translation": "He then repeatedly asked, 'Whose son is this?'",
        "source": "T17n0744_001:0553c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣捨家？』",
        "translation": "What are the reasons for leaving home?'",
        "source": "T17n0744_001:0553c21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便召其母而問之曰：『是卿子耶？』",
        "translation": "He summoned his mother and asked her, 'Is this your son?'",
        "source": "T17n0744_001:0553c21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『唯爾。』",
        "translation": "He said, 'Yes, I guess so.'",
        "source": "T17n0744_001:0553c22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復問曰：『何緣學道？』",
        "translation": "Again, he asked, 'What's the reason for training in the path?'",
        "source": "T17n0744_001:0553c22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母白王：『是兒往昔見王出遊，即還見問：「王七寶蓋，不審何時在我上旋？」",
        "translation": "His mother said to the king, 'My son saw the king travel in the past and returned to see him, asking, 'When did the king's seven-jeweled canopy spin above me?'\"",
        "source": "T17n0744_001:0553c22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妾便告言：「太子應繼，承嗣聖王，展轉千子，汝骨朽敗，永無蓋望。」",
        "translation": "I then told him, \"The crown prince will inherit the noble king and carry on the line of a thousand sons; your bones will decay, and you'll never have any hope.\"",
        "source": "T17n0744_001:0553c24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子聞妾言，慘然畏死，求行學道。",
        "translation": "Hearing what I said, my son was terrified of death and sought to train on the path.",
        "source": "T17n0744_001:0553c25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妾輒聽之，勤學道成。",
        "translation": "I readily listened, and I diligently studied to achieve enlightenment.",
        "source": "T17n0744_001:0553c26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妾等請住供養盡壽，建立此塔。』",
        "translation": "I've asked you to stay here and make offerings for my whole life, and I've built this stūpa.'",
        "source": "T17n0744_001:0553c27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復問曰：『子以蓋故，行學道耶！』",
        "translation": "The king then asked, 'Is it because of this lid that you're practicing the path of training?'",
        "source": "T17n0744_001:0553c27_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『如是。』",
        "translation": "He replied, 'So it is.'",
        "source": "T17n0744_001:0553c28_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王愍其子不得蓋故，學道盡壽，生不得蓋，今便以蓋，覆其塔上。",
        "translation": "\"The king pitied his son, who hadn't been able to get a lid, for he had spent his entire life studying the path and had been born without a lid.",
        "source": "T17n0744_001:0553c28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王因發願：『今以此蓋，奉得道塔，緣是福報，願成佛道，濟度眾生生老病死。』",
        "translation": "The king then made a vow, 'Now, with this lid, I will present the stūpa to attain enlightenment, and because of this merit, I hope to achieve the Buddha Way and save sentient beings from birth, old age, illness, and death.'",
        "source": "T17n0744_001:0554a01_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王心悚然，知世非常，無免死者，因立太子，承嗣聖位。",
        "translation": "Frightened, the king knew that the world was extraordinary and that there was no escape from death, so he created a crown prince to inherit the holy position.",
        "source": "T17n0744_001:0554a02_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王捨四域、七寶、千子、八萬四千後宮婇女，除剃鬚髮，行作沙門，靜處學道，修四淨行，慈悲喜護，畢其形壽，上生梵天。」",
        "translation": "The king renounced the four domains, seven treasures, a thousand sons, and 84,000 harem maidens, shaved his hair, became a monk, went into quietude to train on the path, cultivated the four pure practices, was compassionate and joyous, and completed his life span and was born in the Brahma Heaven.'\"",
        "source": "T17n0744_001:0554a04_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大眾：「於卿等意，所志云何？",
        "translation": "The Buddha addressed the crowd, \"What do you all think you're trying to do?",
        "source": "T17n0744_001:0554a06_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王大天者，豈異人乎？",
        "translation": "Is he a different person, the king of gods?",
        "source": "T17n0744_001:0554a07_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫造斯觀，則吾是也。",
        "translation": "\"Don't make such an observation, then I am.",
        "source": "T17n0744_001:0554a08_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時以一蓋，上緣覺塔，緣是福報，於此地上為轉輪王，不可稱數。",
        "translation": "At the time, I took a lid and went up to the Tower of Pratibhāna, and depending on this merit, I became the wheel-turning king up here, which is incalculable.",
        "source": "T17n0744_001:0554a08_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上為天王，天上世間，受福無限。",
        "translation": "Up there, he's the king of the gods, and the blessings he receives in the heavens and in the world are limitless.",
        "source": "T17n0744_001:0554a10_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一蓋餘福，吾應於世二千五百返為轉輪王，主四天下。」",
        "translation": "With the remaining merits of one lid, I should return 2,500 times in the world as a wheel-turning king who presides over the four worlds.\"",
        "source": "T17n0744_001:0554a10_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難又問：「世尊！",
        "translation": "Ānanda then asked, \"Bhagavān!",
        "source": "T17n0744_001:0554a12_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故不受一蓋？」",
        "translation": "Why not accept a single obscuration?\"",
        "source": "T17n0744_001:0554a12_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是吾一世轉輪王福，所以捨置而不受者，以此福報，施後末世受吾法化為弟子者、學士、學女，欲令此等不乏衣食、床臥、疾藥。",
        "translation": "The Buddha said, \"This is the merit of being a wheel-turning king in one life, so I abandoned it rather than accept it because it's the reward of my merit to give to those who will accept my teaching as disciples, bachelors, and trainees in the latter part of time, so that they won't lack clothing, food, beds, and medicine for illnesses.",
        "source": "T17n0744_001:0554a12_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去諸佛，法沒盡時，其有學道，或因恐怖、或因飢窮，不得行道。",
        "translation": "In the past, when the Dharma of the buddhas died out, there were trainees who weren't allowed to practice the path because of fear or because they were hungry and destitute.",
        "source": "T17n0744_001:0554a15_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法沒盡，其有末世，於吾法化，捨家學道，被服法衣，稱佛為師，畜妻養子，此等皆尚得人供養，何況精勤修奉禁戒，守淨行者，至吾法盡不得供養耶？」",
        "translation": "When the true teaching had ended, there were people in the latter part of their lives who were converted by our teaching, left home to train on the path, were clothed in the Dharma robe, called the Buddha their teacher, and had wives and children, and they still had people to support, so why wouldn't someone who diligently cultivates the precepts and observes pure practices not be able to support them until the end of our teaching?\"",
        "source": "T17n0744_001:0554a17_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅閱祇王，勅其部界，令於江上更造新橋，佛與聖眾得乘度江。",
        "translation": "King Rājagṛha ordered his people to build a new bridge across the river so that the Buddha and his noble people could cross it.",
        "source": "T17n0744_001:0554a20_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維耶離國亦復造橋，欲使佛過。",
        "translation": "The country of Vaiśālī also built another bridge to allow the Buddha to cross.",
        "source": "T17n0744_001:0554a22_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒水、諸龍還相交編結龍為橋，請佛乘度。",
        "translation": "The constant water and the dragons also intersected, forming a bridge out of dragons and inviting the Buddha to ride across.",
        "source": "T17n0744_001:0554a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛思惟：「若乘羅閱祇所造橋度，恐維耶離國及諸龍王心懷微恨。",
        "translation": "The Buddha then thought, \"If we crossed the river on the bridge built by Rājagṛha, I'm afraid Vaiśālī and the dragon kings would harbor a deep hatred for us.",
        "source": "T17n0744_001:0554a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乘維耶離所造橋度，恐阿闍世及龍懷恨。",
        "translation": "If I crossed the bridge built by Vaiśālī, I'm afraid the Ajātaśatru and the dragons would bear a grudge.",
        "source": "T17n0744_001:0554a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲乘龍橋，恐二王有恨。」",
        "translation": "If I want to ride the bridge made by the dragons, I'm afraid the two kings might have resentments.\"",
        "source": "T17n0744_001:0554a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛又思惟：「今當分身，令於三橋皆有佛過。」",
        "translation": "The Buddha then thought, \"Now, I'll divide my body so that the three bridges will all have the Buddha crossing them.\"",
        "source": "T17n0744_001:0554a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛垂臨橋，王阿闍世與其將從數億眾生，香花雜寶伎樂，供養佛法聖眾。",
        "translation": "When the Buddha was approaching the bridge, the king Ajātaśatru and his generals were accompanied by hundreds of millions of sentient beings, flowers, jewelry, music, and other offerings to the Buddha and his noble congregation.",
        "source": "T17n0744_001:0554a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王與群臣一切大眾，數億千人，五體投地，自歸悔過，垂泣送佛。",
        "translation": "The king and his ministers and all the hundreds of millions of people threw themselves to the ground, repented of their faults, and wept as they sent the Buddha off.",
        "source": "T17n0744_001:0554a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛現神化，於二王橋及諸龍橋，皆現有佛與聖眾俱，天、龍、鬼神乘橋度江。",
        "translation": "In a miraculous transformation, the Buddha appeared at the bridge of the two kings and the bridge of the dragons, accompanied by the Buddha and the noble multitude, and gods, dragons, and demons rode the bridge across the river.",
        "source": "T17n0744_001:0554b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王舍國王、維耶離王、恒水諸龍，各自見其所作橋上，佛將大眾乘橋度江；各不知見更有佛在餘橋上，獨自見橋，佛登度江。",
        "translation": "The king of Rājagṛha, the king of Vaiśālī, and the dragons of the Gaṅgā River each saw the bridge they had built, and the Buddha led the whole group across the river on it; each didn't know they saw another Buddha on a different bridge, but they saw the bridge alone and the Buddha ascended and crossed the river.",
        "source": "T17n0744_001:0554b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛適度江已竟，見八萬四千餓鬼，身出煙火。",
        "translation": "After he had finished crossing the river, the Buddha saw 84,000 hungry ghosts whose bodies were filled with smoke and fire.",
        "source": "T17n0744_001:0554b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中未得道者，見此火皆恐怖，是何大火？",
        "translation": "Those of them who hadn't yet attained enlightenment were terrified when they saw that fire.",
        "source": "T17n0744_001:0554b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如燒其大山，見此大火，或來近水，或遠於水。",
        "translation": "It's like a great mountain that's being burned and sees this great fire, whether it's near water or far away from water.",
        "source": "T17n0744_001:0554b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難悉知一切人意，長跪叉手，白佛言：「佛天中天！",
        "translation": "Knowing the thoughts of all people, Ānanda knelt down with his palms together and said to the Buddha, \"Buddha, god of gods!",
        "source": "T17n0744_001:0554b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛至尊至重，天上天下最尊，一切眾生見此火者，無不恐怖。",
        "translation": "The Buddha is most honored and respected, the most revered in the heavens and under heaven, and all sentient beings who see this fire are invariably terrified.",
        "source": "T17n0744_001:0554b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此何等火？",
        "translation": "What kind of fire is this?",
        "source": "T17n0744_001:0554b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛為一切眾生，說此何等之火。」",
        "translation": "May the Buddha explain this kind of fire for all sentient beings.\"",
        "source": "T17n0744_001:0554b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「此今餓鬼，先世不逢佛，亦不聞法，亦不見比丘僧，亦不知世間有罪福，生為餓鬼。」",
        "translation": "The Buddha said to Ānanda, \"Now, hungry ghosts didn't meet the Buddha in a previous life, didn't hear the Dharma, didn't see the monks and bhikṣus, and didn't know the world was full of faults and blessings, so they were born as hungry ghosts.\"",
        "source": "T17n0744_001:0554b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如今見佛，奔趣歸向，皆為頭面著地，長跪叉手，白佛言：「佛天中天！",
        "translation": "Now, when they see the Buddha, they run toward him, put their heads on the ground, kneel down long with their palms together, and say to him, 'Buddha, god of gods!'",
        "source": "T17n0744_001:0554b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至尊至重，天上天下憐愍一切眾生、蠉飛、蠕動有形之類，佛為一切眾生之父母。",
        "translation": "Most honored and most revered, the Buddha in heaven and on earth has compassion on all sentient beings, Mr. Sulu, and wriggling, shapely creatures, and he's the father and mother of all sentient beings.",
        "source": "T17n0744_001:0554b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使我墮餓鬼，佛度我，我亦如一切眾生之類。」",
        "translation": "Even if I were to fall into the category of hungry ghosts and the Buddha were to deliver me, I'd be like all sentient beings.\"",
        "source": "T17n0744_001:0554b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦知餓鬼先世所種，佛為一切眾生故，問餓鬼：「前世所種行，今為餓鬼？」",
        "translation": "The Buddha also knew what hungry ghosts had planted in previous lifetimes, so the Buddha asked the hungry ghosts for the sake of all sentient beings, \"What practices did they plant in previous lifetimes that now make them hungry ghosts?\"",
        "source": "T17n0744_001:0554b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼曰：「先身雖見佛，不知有佛；雖見法，不知有法；雖見比丘僧，不知有比丘僧。",
        "translation": "The hungry ghost says, \"Even though I saw the Buddha in the past, I didn't know there was a Buddha; even though I saw the Dharma, I didn't know there was the Dharma; and even though I saw a monk, I didn't know there was a monk.",
        "source": "T17n0744_001:0554b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦不作福，教他人亦不作福，作福有何等福？",
        "translation": "Even though I didn't do merit, I didn't teach others to do merit, so what kind of merit is there in doing merit?",
        "source": "T17n0744_001:0554b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作福有何種罪？",
        "translation": "What is the sin of not doing good?",
        "source": "T17n0744_001:0554b24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見人作福，言恒笑之。",
        "translation": "When I see someone do something good, I always say, 'Laugh!'",
        "source": "T17n0744_001:0554b24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見人作罪，意常歡喜。」",
        "translation": "When they see someone commit a sin, their thoughts are always joyous.\"",
        "source": "T17n0744_001:0554b25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問餓鬼：「生此餓鬼之中以來，至今更歷幾百年歲？」",
        "translation": "The Buddha asked the hungry ghost, \"How many hundred years have passed since you were born among these hungry ghosts?\"",
        "source": "T17n0744_001:0554b25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼報言：「我生中七萬歲。」",
        "translation": "The hungry ghost replied, \"I'll be born for 70,000 years.\"",
        "source": "T17n0744_001:0554b26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問餓鬼：「生中七萬歲，食飲何種？",
        "translation": "The Buddha asked the hungry ghost, \"What kind of food and drink do you eat during the 70,000 years of your life?",
        "source": "T17n0744_001:0554b27_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為得何食？」",
        "translation": "What kind of food will I get?\"",
        "source": "T17n0744_001:0554b28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼報言：「我先世種行至惡，遇值小水，即化不見。",
        "translation": "The hungry ghost reports, \"In a previous life, I was born with seeds of evil, and when I met a small body of water, I was transformed and didn't see it.",
        "source": "T17n0744_001:0554b28_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於大水，便為鬼神、龍、羅剎所逐，言：『汝先世種惡，今何以來近此江海？』",
        "translation": "When I encounter a large body of water, I'm chased by ghosts, dragons, and rāṣas, who say, 'You were bad in a previous life; why have you come near this river and ocean?'",
        "source": "T17n0744_001:0554b29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖值大龍普天放雨，謂呼得雨漬其身，方便礫石熱沙，或值炭火以墮其身。」",
        "translation": "Even though a great dragon releases rain from all over the sky, it's said to call out for rain to wet its body, or it's a convenient way to get hot sand from gravel, or it might fall into its body in a fire.\"",
        "source": "T17n0744_001:0554c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問餓鬼：「生中七萬歲，由來飲食何等？」",
        "translation": "The Buddha asks the hungry ghost, \"What did he eat and drink during the 70,000 years of his life?\"",
        "source": "T17n0744_001:0554c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼報佛言：「或有世間父母、親里，稱其名字，為作追福者，便小得食；不作福者，不得飲食。」",
        "translation": "The hungry ghosts reported to the Buddha, \"Perhaps there are parents or relatives in the world who call them by name and seek their fortune, then they'll get a small meal; those who don't will not get a meal.\"",
        "source": "T17n0744_001:0554c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸餓鬼叉手白佛言：「從來飢渴。",
        "translation": "The hungry ghosts saluted the Buddha with their palms together and said, \"They've always been hungry and thirsty.",
        "source": "T17n0744_001:0554c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛天中天慈愍一切眾生，今賜餓鬼小飲食。」",
        "translation": "The Buddha, a god among gods, has compassion on all sentient beings and now gives the hungry ghosts a small meal.\"",
        "source": "T17n0744_001:0554c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「捉鉢取水，用布施餓鬼。」",
        "translation": "The Buddha said to Ānanda, \"Grab a bowl and get some water, and use it to give to the hungry ghosts.\"",
        "source": "T17n0744_001:0554c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難便捉鉢取水，與餓鬼。",
        "translation": "Ānanda then took a bowl, took some water, and gave it to the hungry ghost.",
        "source": "T17n0744_001:0554c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼白佛言：「今此一鉢水，不飽一人，況乃八萬四千！」",
        "translation": "The hungry ghost said to the Buddha, \"Now, this one bowl of water won't satisfy one person, so why wouldn't 84,000!\"",
        "source": "T17n0744_001:0554c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸餓鬼：「八萬四千捉此鉢水，至心布施佛及諸弟子。」",
        "translation": "The Buddha said to the hungry ghosts, \"Eighty-four thousand of them grabbed this bowl of water and wholeheartedly gave it to the Buddha and his disciples.\"",
        "source": "T17n0744_001:0554c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸八萬四千餓鬼捉此鉢水，長跪布施：「以我先世不布施，今生餓鬼中。",
        "translation": "The 84,000 hungry ghosts grabbed this bowl of water, knelt down, and offered it up, saying, \"Because I didn't give alms in a previous life, I was born among hungry ghosts.",
        "source": "T17n0744_001:0554c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如今無所有，持此鉢水，布施佛及諸弟子，使諸餓鬼緣此功德遠離三惡道，後所生得師如佛無異。」",
        "translation": "Now I have nothing, so I took this bowl of water and gave it to the Buddha and his disciples so that because of this merit, the hungry ghosts would be freed from the three bad destinies and would be born in the future with teachers like the Buddha.\"",
        "source": "T17n0744_001:0554c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼過水與阿難，阿難捉水與佛甞一口，過與千二百五十弟子各甞一口。",
        "translation": "The hungry ghosts gave Ānanda the water, and Ānanda took a mouthful of it and gave it to the Buddha and 1,250 of his disciples.",
        "source": "T17n0744_001:0554c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸餓鬼：「入大江飲水，并可洗浴。」",
        "translation": "The Buddha told the hungry ghosts, \"Enter the large river to drink the water, and you can wash yourself.\"",
        "source": "T17n0744_001:0554c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "江海龍、鬼神遮不得洗浴、飲水。",
        "translation": "The dragons and ghosts of the rivers and seas couldn't bathe or drink the water.",
        "source": "T17n0744_001:0554c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語海龍王及諸鬼神：「無極之水，何以愛惜？」",
        "translation": "The Buddha told the dragon king of the ocean and the demons, \"Why do you cherish the water that has no limit?\"",
        "source": "T17n0744_001:0554c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸龍、鬼神言：「不惜此水，以餓鬼不淨故。」",
        "translation": "The dragons and demons said, \"I don't cherish this water because it's impure for a hungry ghost.\"",
        "source": "T17n0744_001:0554c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語海龍王、鬼神：「卿身自從無數劫以來，亦作此身，愛惜無極之水，卿後還作此身，以慳貪故，生為餓鬼。」",
        "translation": "The Buddha said to the dragon kings and spirit spirits of the ocean, \"Since an incalculably long time, you've also been in this body, cherishing the infinite amount of water, and you'll be in this body again in the future, born as a hungry ghost because of your stinginess and greediness.\"",
        "source": "T17n0744_001:0554c21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸海龍王、鬼神聞佛言，盡還入海，聽諸餓鬼盡得飲水飽滿、洗浴。",
        "translation": "Hearing the Buddha's words, the sea dragon kings and demons all went back into the ocean and listened as the hungry ghosts drank as much water as they could to fill their bellies and bathe themselves.",
        "source": "T17n0744_001:0554c23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還出，遶佛三匝，為佛作禮，叉手白佛言：「佛天中天！",
        "translation": "They went back out, circled the Buddha three times, paid homage to him, saluted him with their palms together, and said to him, \"Buddha, god of gods!",
        "source": "T17n0744_001:0554c25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知當來過去，何時當脫此餓鬼之身？」",
        "translation": "Do you know when you'll be freed from the body of a hungry ghost in the future and in the past?\"",
        "source": "T17n0744_001:0554c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「以一鉢水故，後當彌勒佛出世，人壽八萬四千歲，現諸餓鬼盡得人身，皆得阿羅漢道；其諸眾會，聞此布施功德者，皆得正真道意。」",
        "translation": "The Buddha said, \"Because of this bowl of water, when Maitreya Buddha arises in the future and lives 84,000 years, all the hungry ghosts in the present will attain personal status and will attain the path of the arhat; all the congregations that hear about the merit of this offering will attain the true intention of the path.\"",
        "source": "T17n0744_001:0554c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸一切餓鬼遶佛三匝，作禮而去。",
        "translation": "All the hungry ghosts circled the Buddha three times, paid homage, and departed.",
        "source": "T17n0744_001:0555a01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維耶離國諸王、大臣、長者、居士、國人無數，五體作禮，自投佛足，歸命三寶，香花伎樂，繒蓋幢幡，奉迎世尊華遍覆地，尋路供養，日日不絕，至于國城。",
        "translation": "Countless kings, ministers, elders, householders, and people from Vaiśālī paid homage with five bodies, threw themselves at the Buddha's feet, gave their lives to the Three Treasures, wore flowers, music, silken canopies, banners, and banners, welcomed the Bhagavān with flowers that covered the ground, and looked for ways to make offerings day after day, reaching the country's capital.",
        "source": "T17n0744_001:0555a01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與聖眾、天、龍、鬼神往于城門，以金色臂德相之手，觸城門閫，以梵清淨八種之聲，而說偈言：「諸有眾生類，　　在土界中者，　行住於地上，　　及虛空中者，　慈愛於眾生，　　令各安休息，　晝夜勤專精，　　奉行眾善法。」",
        "translation": "The Buddha went to the city gate with a multitude of sages, gods, dragons, and demons, touched the city gate's perimeter with his golden-armed, virtuous hand, and spoke a verse with the eight pure sounds of Brahmā, saying, \"All living beings in the world, those who walk and dwell on the earth and in space, love sentient beings and make them rest, concentrate their energies day and night, and pursue the cultivation of good qualities.\"",
        "source": "T17n0744_001:0555a05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此偈已，地即為之六返大動，佛便入城。",
        "translation": "After speaking this verse, the earth then stirred six times, and the Buddha entered the city.",
        "source": "T17n0744_001:0555a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空中鬼神，昇空退散；地行鬼神，爭門競出，城門不容，各各奔突，崩城而出。",
        "translation": "The ghosts and spirits in the air rose into the sky and retreated, while the ghosts and spirits on the ground scrambled to get out of the gate, which wouldn't allow them to do so, so they each rushed out and collapsed into the city.",
        "source": "T17n0744_001:0555a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時城中，諸有不淨，廁穢臭惡，下沈入地，高卑相從，溝坑皆平。",
        "translation": "At the time, the city was filled with impurities, filthy toilets, and bad smells that sank into the ground, followed by high and low, and leveled gullies and pits.",
        "source": "T17n0744_001:0555a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盲視聾聽，瘂語躄行，狂者得正，病者除愈。",
        "translation": "Blind and deaf, dumb and dumbfounded, and crippled by speech and action, the crazy are made right, and the sick are healed.",
        "source": "T17n0744_001:0555a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象馬牛畜，悲鳴相和，箜篌樂器，不鼓自鳴，宮商調和。",
        "translation": "Elephants, horses, cattle, and animals lament and harmonize, and harp instruments sound without drumming, harmonizing with the palace and commerce.",
        "source": "T17n0744_001:0555a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦女珠環，相[敲-高+亭]妙響，器物[土*瓦]甖，自然有聲，柔軟和暢，妙法之音。",
        "translation": "A woman's beads and rings [knock-high+ting] together with a wonderful sound, and an object [earthenware] bowl naturally sounds, soft and smooth, the sound of the wonderful Dharma.",
        "source": "T17n0744_001:0555a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地中伏藏，自然發出。",
        "translation": "It's concealed in the earth and naturally gives rise to it.",
        "source": "T17n0744_001:0555a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生如遭熱渴得清涼水，服飲澡浴泰然穌息；舉城眾病，除愈解脫，亦復如是。",
        "translation": "All sentient beings who experience fever and thirst get cool water, drink it, bathe, and calm down; the same goes for the many illnesses in the city that are healed and liberated.",
        "source": "T17n0744_001:0555a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與大眾便還出城，垂大慈哀，欲為眾生施大擁護，遶城周匝，門門呪願，敷演妙法，除凶致祥，普國疾患，災疫悉除，國界盡安。",
        "translation": "The Buddha and the crowd then returned to the city, extended great compassion, wanted to give sentient beings a great shield, circled the city, curated vows from door to door, expounded the wonderful Dharma, removed bad fortune and good fortune, riddled the country with illnesses and plagues, and made the country's borders completely peaceful.",
        "source": "T17n0744_001:0555a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，才明前禮佛足，長跪叉手，白世尊言：「前許垂愍，唯願明日與諸大眾，愍眾生故，迴光顧臨至舍蔬食。」",
        "translation": "Cai Ming then bowed his head at the Buddha's feet, knelt down with his palms together, and said to the Bhagavān, \"Please accept my kindness, and may I ask that tomorrow I return to the house with the members of the crowd and offer them food because of my kindness to sentient beings.\"",
        "source": "T17n0744_001:0555a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛默聽許。",
        "translation": "The Buddha listened silently and gave his approval.",
        "source": "T17n0744_001:0555a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歡喜踊躍，右遶三匝，禮佛而退。",
        "translation": "Rejoicing and jumping for joy, they circled the Buddha three times to his right, paid homage to him, and withdrew.",
        "source": "T17n0744_001:0555a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歸家供辦百味飯食，清淨香潔，色鮮味甘，嚴飾家裏懸繒幡蓋，床坐綩綖，香汁灑地，散花燒香。",
        "translation": "He returned home and prepared a hundred kinds of delicious meals that were pure and clean, fresh in color and sweet in taste, decorated his home with silken banners and banners, draped his bed and seat with cloth, sprinkled the floor with scented juice, and scattered flowers and burned incense.",
        "source": "T17n0744_001:0555a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供設備辦，遙於門中，長跪燒香，遙白佛言：「幸時降神。」",
        "translation": "When the offerings were ready, they knelt down in the distance, burned incense, and said to the Buddha, \"It's fortunate that the spirits have descended at this time.\"",
        "source": "T17n0744_001:0555b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊勅諸弟子，著衣持鉢，行詣長者才明受請。",
        "translation": "The Bhagavān then instructed his disciples to put on their robes and bowls and march over to the elder Cai Ming to accept his invitation.",
        "source": "T17n0744_001:0555b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即到其門，才明肅恭，花香伎樂，請佛入舍，佛與聖眾，以次就位。",
        "translation": "When they arrived at his gate, Saimyō paid respects, invited the Buddha into his abode with flowers, incense, and music, and the Buddha and his noble people took their places in order.",
        "source": "T17n0744_001:0555b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，才明執持金瓶，躬行澡水，手自斟酌，上下平等。",
        "translation": "Cai Ming then took the golden vase, washed the water himself, and drank it with his own hands, making it equal up and down.",
        "source": "T17n0744_001:0555b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飯食畢訖，重行澡水，長跪叉手，前白佛言：「唯願世尊，垂四等心，更受三日如今之請。」",
        "translation": "When he finished eating, he repeatedly drew water, knelt down with his palms together, and said to the Buddha, \"Please, Bhagavān, grant us four equal invitations for three more days.\"",
        "source": "T17n0744_001:0555b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛默便許。",
        "translation": "The Buddha acquiesced.",
        "source": "T17n0744_001:0555b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，才明供佛聖眾，種種香潔，如其初日。",
        "translation": "Cai Ming then made offerings to the Buddha's holy congregation, perfumed and cleansed in various ways just as he had done on the first day.",
        "source": "T17n0744_001:0555b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四日已竟，以金色疊價直十萬，次到上座，九萬價疊，以次轉下，末下坐者萬錢價疊，以為噠嚫。",
        "translation": "When the four days were up, he offered a golden pile of 100,000 coins, followed by a pile of 90,000 coins for the top seat, then a pile of 10,000 coins for the bottom seat, and then a pile of 10,000 coins for the dakṣiṇā.",
        "source": "T17n0744_001:0555b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妻即起，長跪叉手，白世尊曰：「惟天中天，慈加人物，願留神光，受賤妾請，更住四日。」",
        "translation": "His wife then got up, knelt down with her palms together, and said to the Bhagavān, \"May the god of gods, who has mercy on people, grant his divine light and accept my humble servant's invitation to stay another four days.\"",
        "source": "T17n0744_001:0555b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛默然許。",
        "translation": "The Buddha acquiesced.",
        "source": "T17n0744_001:0555b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妻供養，初日後日，至于四日，飯食香潔，等無差異。",
        "translation": "His wife made offerings for the first two days and then for four days, giving meals that were clean and equal.",
        "source": "T17n0744_001:0555b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四日已竟，又以金色十萬價疊，奉上世尊，次九萬疊，最下萬錢。",
        "translation": "When the four days were up, she presented the Bhagavān with a golden offering of 100,000 piles, followed by 90,000 piles and the least of these 10,000 coins.",
        "source": "T17n0744_001:0555b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時才明子，起至佛前，長跪叉手，白世尊言：「惟天中天，已受父母各四日食，幸垂慈哀憐愍，受我四日之請。」",
        "translation": "Cai Mingzi then got up and went to the Buddha, knelt down long with his palms together, and said to the Bhagavān, \"Please have mercy and compassion on me, god of gods, for having accepted four days of food from each of my parents.\"",
        "source": "T17n0744_001:0555b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦默許。",
        "translation": "The Buddha also gave his silent approval.",
        "source": "T17n0744_001:0555b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子恭勤，四日供養，飯食甘美，亦如父母。",
        "translation": "His son made a four-day offering with respect and diligence, and the food was as delicious as that of his parents.",
        "source": "T17n0744_001:0555b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以金色十萬價疊，奉獻世尊，次坐九萬，末下萬錢。",
        "translation": "He then presented the Bhagavān with a gold pile of 100,000 coins, followed by 90,000 at his seat and 10,000 at the end.",
        "source": "T17n0744_001:0555b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子婦又起長跪，白佛：「世尊弘慈，已受公姑及夫供養，幸如前比，復受四日。」",
        "translation": "The couple got up again and knelt down long enough to say to the Buddha, \"Bhagavān, you've accepted the offerings of your father, aunt, and husband.",
        "source": "T17n0744_001:0555b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛又默受。",
        "translation": "The Buddha again accepted them in silence.",
        "source": "T17n0744_001:0555b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所設餚膳，如前無異，亦至四日，亦以金色十萬價疊，次坐九萬，下坐萬錢，以為噠嚫。",
        "translation": "The meal was served just as before, and it lasted four days. They were also offered a golden pile of 100,000 coins, followed by a seat of 90,000, and a seat of 10,000 coins as a dakṣiṇā.",
        "source": "T17n0744_001:0555b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居家大小，於佛前坐，奉受訓誨，佛為頒宣，敷演四諦苦集盡道，八賢聖路，斷除勞意二十二結，證諦溝港。",
        "translation": "The householders and their seniors sat down before the Buddha, received his instructions, and he preached to them, explaining the four truths, the path to the end of suffering and accumulation, the noble path of the eight virtuous ones, ending the twenty-two bonds of labor and thought, and the gulf of realization of the truths.",
        "source": "T17n0744_001:0555b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維耶離國諸王、大臣、長者、居士、合國人民，皆生心念：「佛來至國，為獨以一才明故乎？」",
        "translation": "The king, ministers, elders, householders, and people of Vaiśālī all had the thought, \"Did the Buddha come to the country because he alone understands one talent?\"",
        "source": "T17n0744_001:0555b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意皆懷嫌，象馬車步皆共來集，向才明家，欲壞其舍得見世尊。",
        "translation": "Their minds were all hostile, and elephants, horses, chariots, and footsteps all came together to gather at Caijian's home, hoping to destroy his house and gain a view of the Bhagavān.",
        "source": "T17n0744_001:0555c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大眾震動，響響有聲，佛悉預覩，故問阿難：「外有何聲？」",
        "translation": "The great multitude shook with a resounding noise, which the Buddha had all anticipated, so he asked Ānanda, \"What is that noise outside?\"",
        "source": "T17n0744_001:0555c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛：「維耶離王、大臣、長者、國人巨細，皆懷怨心。",
        "translation": "Ānanda said to the Buddha, \"The king of Vaiśālī, his ministers, his elders, and the country's people, both large and small, all harbor resentments.",
        "source": "T17n0744_001:0555c03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊入國，才明請歸，獨固在家，至十六日，餘不得見。",
        "translation": "When the Bhagavān entered the country, he was invited to return only in the light of the situation, but he stayed home alone until the sixteenth day, but couldn't see the rest of them.",
        "source": "T17n0744_001:0555c05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此為嫌，故集會來，欲見世尊。」",
        "translation": "Because of this dislike, they had gathered here to see the Bhagavān.\"",
        "source": "T17n0744_001:0555c06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「出慰諸人，莫齎恨意，欲見佛者，便聽使入。」",
        "translation": "The Buddha told Ānanda, \"Go out and console them, don't harbor hatred, and allow them to enter if they want to see the Buddha.\"",
        "source": "T17n0744_001:0555c07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難宣命，謂諸大眾：「以啟聽入。」",
        "translation": "Ānanda announced the order and told the crowd, \"Let's inspire them to listen and enter.\"",
        "source": "T17n0744_001:0555c08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王、大臣及一切人，聞佛教告，怒心霍除，無餘微恨，如雨淹塵，便入見佛，五體投地，稽首佛足。",
        "translation": "When the king, his ministers, and all the people who heard what the Buddha told them, their anger was allayed, and they, like rain drowning dust, entered to see the Buddha, threw themselves to the ground with five bodies, and bowed their heads at his feet.",
        "source": "T17n0744_001:0555c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大眾浩浩，其舍不容。",
        "translation": "The great multitude was too vast to allow them to stay.",
        "source": "T17n0744_001:0555c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在外者眾，佛悉慈愍，化才明舍令為琉璃，表裏清徹，悉通相見。",
        "translation": "The Buddha was compassionate toward those who were outside, and he turned Cai Ming's abode into beryl, making it clear and transparent on the outside and on the inside.",
        "source": "T17n0744_001:0555c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，才明為設床座，氍毺毾[登*毛]，種種食具，水精琉璃，金銀雜寶，以為器物，大眾食訖。",
        "translation": "Cai Ming then set up a seat, a coarse [woolen] carpet, and various eating utensils made of water, refined lapis lazuli, and gold and silver jewelry, and the whole crowd ate.",
        "source": "T17n0744_001:0555c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，才明前白世尊及諸貴賓：「居儉蔬食，枉屈顧臨，願以食器及床座具，以相貢遺。」",
        "translation": "Cai Ming then said to the Bhagavān and the distinguished guests, \"I've been frugal with food and vegetables, and I've been bending over backwards to give you a food vessel and a seat as a tribute.\"",
        "source": "T17n0744_001:0555c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時會大眾，莫不愕然，皆共歎咤：「長者才明，立名不妄，與德相副。",
        "translation": "Everyone in the assembly was startled and praised him, saying, \"That man Cai Ming, he establishes a reputation that's not false and is worthy of virtue.",
        "source": "T17n0744_001:0555c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "興設大施，貢遺寶器，莫不周遍。",
        "translation": "He makes great gifts and bequeaths precious things, and they are not failing to reach them.",
        "source": "T17n0744_001:0555c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "家中財寶，豈可訾計四部弟子及與大眾？」",
        "translation": "How could you possibly count the four groups of disciples and the general public for the wealth and treasure in your home?\"",
        "source": "T17n0744_001:0555c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心皆懷疑：「長者才明，有何功德？",
        "translation": "They all doubted, \"What merit does that man possess for his wisdom?",
        "source": "T17n0744_001:0555c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請佛大眾，至十六日，及王臣民，供養貢遺，周遍一國，得服甘露。",
        "translation": "\"Would the Buddha and his subjects be invited to make offerings and tributes to the king's subjects until the sixteenth day, when they would be able to serve the nectar throughout the whole country?",
        "source": "T17n0744_001:0555c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前世福耶？",
        "translation": "What about the merits of previous lives?",
        "source": "T17n0744_001:0555c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世德乎？」",
        "translation": "What are the virtues of this world?\"",
        "source": "T17n0744_001:0555c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難即知眾會心疑，長跪叉手，前白佛言：「大會懷疑長者才明，於何福田，廣植德本？",
        "translation": "Knowing the doubts of the assembly, Ānanda knelt down and saluted the Buddha with his palms together, saying, \"The assembly doubts the elder's ability to understand what field of merit has he cultivated?",
        "source": "T17n0744_001:0555c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遭何明師，受其教誨，今逮影報，財富無限，心明行淨，先服甘露？",
        "translation": "\"What wise teacher did you meet and accept as your teacher, and now you've gained an image, unlimited wealth, and a clear mind and pure practices, having first taken the ambrosia?",
        "source": "T17n0744_001:0555c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願世尊，現說本行，決一切疑。」",
        "translation": "May the Bhagavān now explain this practice and resolve all doubts.\"",
        "source": "T17n0744_001:0555c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難及諸大會：「一心善聽！",
        "translation": "The Buddha told Ānanda and the assembly, \"Listen well with one mind!",
        "source": "T17n0744_001:0555c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當解暢心之所疑。",
        "translation": "\"Now, you will understand the doubts of the open-minded.",
        "source": "T17n0744_001:0555c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往世有城，名波羅奈。",
        "translation": "In a past life, there was a city named Vārāṇasī.",
        "source": "T17n0744_001:0555c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去城不遠，山名仙居，山中池水，林樹花果，快樂無比。",
        "translation": "Not far from the city, there was a mountain named Senju, in which there were pools of water, forests of trees, flowers, and fruits, and happiness beyond compare.",
        "source": "T17n0744_001:0555c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世有佛時，與諸弟子遊處其中；若世無佛，緣覺居中。",
        "translation": "When there were buddhas in the world, they traveled there with their disciples; if there were no buddhas in the world, pratyekabuddhas would live in the middle.",
        "source": "T17n0744_001:0555c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無緣覺，外學神仙則居其中，初無斷絕。",
        "translation": "If there were no pratyekabuddhas, then outside scholars and sages would live in them, without ever being cut off in the first place.",
        "source": "T17n0744_001:0556a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之故，斯名仙居。",
        "translation": "For this reason, it's called the abode of immortals.",
        "source": "T17n0744_001:0556a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時有緣覺，在山中止。",
        "translation": "\"At the time, there were pratyekabuddhas who stayed on the mountain.",
        "source": "T17n0744_001:0556a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "早起澡漱，法服持鉢，出山求食，未至聚落，遇暴風雨。",
        "translation": "He got up early, washed up, put on his bowl in his Dharma robes, and left the mountain to seek food.",
        "source": "T17n0744_001:0556a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去道不遠，有官果園，中有園監。",
        "translation": "Not far from the road, there was an official orchard with a garden supervisor.",
        "source": "T17n0744_001:0556a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見有煙出，道士往詣，報語主人：『行遇風雨，幸聽入舍，向火曝衣。』",
        "translation": "When he saw smoke coming out, the monk went to the monk and reported to the monk's master, 'I'm glad to hear you enter the monk's quarters and expose your clothes to the fire in case of a storm.'",
        "source": "T17n0744_001:0556a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即請令入，取薪然火，為曝衣裳，衣乾體暖。",
        "translation": "He then asked the monk to enter, got firewood and a fire to dry his clothes and keep them warm.",
        "source": "T17n0744_001:0556a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風雨小歇，著衣欲出。",
        "translation": "When the wind and rain stopped, he put on his robe and wanted to leave.",
        "source": "T17n0744_001:0556a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "園監問曰：『惟聖道士！",
        "translation": "The park superintendent asked him, 'We are the noble Daoists!'",
        "source": "T17n0744_001:0556a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？』",
        "translation": "Where do you want to go?'",
        "source": "T17n0744_001:0556a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『賢者！",
        "translation": "He replied, 'Good man!",
        "source": "T17n0744_001:0556a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切有形，衣食為命，吾捨家學乞食自存。",
        "translation": "'For all living things, clothing and food are our livelihood, so I left home to train and beg for food to survive on my own.",
        "source": "T17n0744_001:0556a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不得食，身命不濟，諸根不定，不能思道。』",
        "translation": "If I don't get food, my body and life won't be helped, and my faculties won't be conditioned, so I won't be able to contemplate the path.'",
        "source": "T17n0744_001:0556a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "園監對曰：『貧家蔬食，色麁味酸，若垂甘受，幸住勿行。』",
        "translation": "The park superintendent replied, 'The poor family's vegetarian food is crude in color and sour in taste; if you'd accept it, please don't do it.'",
        "source": "T17n0744_001:0556a11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣覺答曰：『學道求食，不著色味，充軀而已，若相許食，便住不行。』",
        "translation": "The pratyekabuddha replied, 'A student seeking food for the path doesn't attach to form and taste; he simply fills his body, and if he were allowed to eat, then he would stay and not do it.'",
        "source": "T17n0744_001:0556a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於是園監，便歸取飯，至家問婦：『飯食辦未？』",
        "translation": "\"The garden supervisor then returned to get some food and asked the woman at home, 'Has the food been prepared?'",
        "source": "T17n0744_001:0556a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『已辦。』",
        "translation": "They replied, 'It's done.'",
        "source": "T17n0744_001:0556a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國食法，分飯別食。",
        "translation": "In that country, the way they eat is to divide the food into separate portions.",
        "source": "T17n0744_001:0556a15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫語婦曰：『取吾分來，偶有要客，欲以食之。』",
        "translation": "The husband said to the wife, 'Take my share, for I occasionally have an important visitor who wants to eat it.'",
        "source": "T17n0744_001:0556a16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妻即念言：『夫為男子，當執勞役，涉冐寒暑，假令不食，不能執勞。",
        "translation": "The wife then thinks, 'My husband is a man who performs hard labor and goes through cold and heat, so if he doesn't eat, he won't be able to perform his labor.",
        "source": "T17n0744_001:0556a17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妾為女人，在家閑處，可持妾分，以候此客。』",
        "translation": "As a woman, I'm at home in a quiet place, so I can take my share of the food and wait for this visitor.'",
        "source": "T17n0744_001:0556a18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子又言：『父母年老，便可自食，以我分與。』",
        "translation": "The son also said, 'My parents are old, so they can eat for themselves; I'll take my share.'",
        "source": "T17n0744_001:0556a19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子婦曰：『公姑及夫以許食客，妾年幼壯，堪忍飢渴，乞以妾分，持用食客。』",
        "translation": "The son and his wife said, 'Your father and mother have given permission to feed the guest, but I'm young and strong enough to endure hunger and thirst, so I beg you to take my share and use it to feed the guest.'",
        "source": "T17n0744_001:0556a20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大人便言：『汝等各各善心欲施，可共減取眾人之分，足以食客。』",
        "translation": "The man then said, 'Each of you has a good intention to give, so you can collectively reduce the servant's share to enough to feed him.'",
        "source": "T17n0744_001:0556a22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便各減己之飯分。",
        "translation": "Each of you then reduced your share of the food.",
        "source": "T17n0744_001:0556a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「園監又念：『道士衣裳裂壞形露。』",
        "translation": "\"The supervisor then thought, 'The Taoist monk's clothes are torn and tattered, and his form is exposed.'",
        "source": "T17n0744_001:0556a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因問其婦：『家中少有衣裳調無？』",
        "translation": "So he asked his wife, 'Are there any robes at home that are little torn?'",
        "source": "T17n0744_001:0556a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妻對曰：『家中惟有一領疊衣，會賓應門，更共衣之，餘無所有。』",
        "translation": "His wife said to him, 'There's only one pile of clothing in the house, and when guests arrive, they share it with him; the rest he doesn't have.'",
        "source": "T17n0744_001:0556a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫答婦言：『以前世時無所惠施，今守貧賤，不及逮人。",
        "translation": "The husband answered the woman, 'In a previous life, I didn't have anything to give, and now I'm so poor and humble that I haven't caught up with anyone.",
        "source": "T17n0744_001:0556a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者不施，貧窮下賤，何時當竟？",
        "translation": "If you don't give now, how long will it be before you're poor and humble?'",
        "source": "T17n0744_001:0556a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富貴豪尊、衣食自然者，皆是前世惠施之福。",
        "translation": "Wealth, dignity, and natural food and clothing are all the blessings of generosity from previous lives.",
        "source": "T17n0744_001:0556a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今續惠施，無有厭足；我亦不用會客應門、改易服飾。』",
        "translation": "Continuing to give alms now, I have no need to tire of it; nor do I have to meet visitors and change my clothes.'",
        "source": "T17n0744_001:0556b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取疊并飯，家屬皆往，到道士所，澡手奉食。",
        "translation": "They all went to the Daoist's residence, washed their hands, and offered them food.",
        "source": "T17n0744_001:0556b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道士食訖，澡漱滌鉢，四人奉疊，供授緣覺，即便衣之。",
        "translation": "When the Daoist had finished eating, he washed and rinsed his bowl, and the four of them presented it to Enkaku, who then dressed himself.",
        "source": "T17n0744_001:0556b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「緣覺不以說法教化，現通神足悅寤眾生，令發道意，告主人曰：『以能惠施供養道士，堅強汝志，發弘誓願。』",
        "translation": "\"Without teaching by expounding the Dharma, Enkaku showed his supernormal powers to delight and awaken sentient beings, causing them to give rise to the intention to follow the path. He told his host, 'Because you can support the Daoist with generosity, strengthen your resolve and make a great vow.'",
        "source": "T17n0744_001:0556b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語竟昇空，結交趺坐，住立經行，變現緣覺，充滿虛空。",
        "translation": "After he finished speaking, he rose into the sky, sat cross-legged, stood up, and walked around in scriptures, manifesting himself as a pratyekabuddha and filling space.",
        "source": "T17n0744_001:0556b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各現化，身出水出火，水不滅火，火不侵水。",
        "translation": "Each one is transformed, and his body emits water and fire, while water doesn't extinguish fire and fire doesn't attack water.",
        "source": "T17n0744_001:0556b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若干變化，乘空飛行，還仙居山。",
        "translation": "With a number of transformations, they fly through the sky and return to their mountain of immortality.",
        "source": "T17n0744_001:0556b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "園監眷屬，歡喜踊躍，叉手作禮，叩頭求哀，便發誓願：『以今日惠施聖明神聖道士，緣是福報，離三惡道地獄、餓鬼、畜生之趣，所生之處，常共聚會，天上世間，饒富安隱，覺慧道力，服甘露味，如聖明師，若遭明師，神德殊勝。』」",
        "translation": "The garden supervisor's retinue rejoiced and jumped for joy, saluted with folded hands, bowed their heads in supplication, and vowed, 'Because of this meritorious gift, the noble, wise, and holy religious practitioner will be freed from the three evil destinies, the rebirth in hell, hungry ghosts, and the rebirth in animals, and will always gather together in the heavenly realm, where there's prosperity and security, the power of awakening and insight, and the taste of ambrosia, just like a noble, wise teacher, or if he meets a wise teacher, his spiritual virtue will be extraordinary.'",
        "source": "T17n0744_001:0556b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大眾：「時園監者，則才明是；妻、息、子婦皆是本人。",
        "translation": "The Buddha told the crowd, \"The garden supervisor then is Cai Ming, and his wife, his wife's wife, and his children are all himself.",
        "source": "T17n0744_001:0556b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時同心施尊緣覺，自是以來九十一劫，不更三塗，受弘福報，天上世間，室家聚會，不相遠離。",
        "translation": "Since then, the concentrated benefactor, the honored solitary realizer, hasn't left the three destinies for 91 eons, has received great rewards of merit, and has gathered in homes and families up in heaven and in the world, not being separated from one another.",
        "source": "T17n0744_001:0556b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時發願，願服甘露，覺道得解，遭殊勝師。",
        "translation": "At the time, he made the vow to accept the ambrosia, attain understanding of the path, and meet a remarkable teacher.",
        "source": "T17n0744_001:0556b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣是之故，今遭值我，得遇勝覺，無限無喻，今服甘露，如其先師。」",
        "translation": "Because of this, I've now met with a wonderful teacher who's infinite and without metaphors, and I've now taken the nectar, just like my predecessor.\"",
        "source": "T17n0744_001:0556b19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大會聞佛頒宣功德報應，莫不歡喜，心悅意清，自歸三寶，佛法聖眾，嶮結除解，或受五戒，或捨家學。",
        "translation": "At the time, when the assembly heard the Buddha declare the rewards of merit, everyone rejoiced, their hearts were pleased, their minds were clear, they turned to the Three Treasures, and the noble congregation of Buddhists and Dharma peers removed the bonds of liberation, either accepting the five precepts or renouncing home training.",
        "source": "T17n0744_001:0556b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是會中，有四千人皆得道迹、往來、不還、無著之果。",
        "translation": "At that meeting, 4,000 people attained the fruits of the path, past lives, nonreturners, and nonattachment.",
        "source": "T17n0744_001:0556b23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無央數人，發大乘意，心不退轉。",
        "translation": "Countless others had aroused the intention of the great vehicle and had their minds set on not turning back.",
        "source": "T17n0744_001:0556b25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，世尊起出其舍，一切大眾，稽首各退。",
        "translation": "The Bhagavān then rose and left his abode, and the whole crowd bowed their heads and withdrew.",
        "source": "T17n0744_001:0556b25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與大眾遊至柰女林樹精舍，柰女聞佛從大聖眾至其樹園，心喜無量，即便嚴駕，與其僕從詣園見佛。",
        "translation": "When the Buddha and the whole assembly wandered over to the Veṇuvana Grove seminary, the goddess heard that the Buddha had come from a great congregation of sages to her grove and was delighted beyond measure, so she drove with her attendants to the grove to see the Buddha.",
        "source": "T17n0744_001:0556b26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到下寶車，如雲降電，趨翔入園，如吉利天服飾、姿容，殊天玉女。",
        "translation": "When he arrived, he descended from the jeweled chariot like a cloud descending from a flash of lightning and flew into the grove, dressed like an auspicious goddess with the appearance of a heavenly jade woman.",
        "source": "T17n0744_001:0556b29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "園樹諸天，莫不迴目。",
        "translation": "None of the gods in the garden or trees looked back.",
        "source": "T17n0744_001:0556c01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見其然，是魔使來，壞敗淨戒、定、慧、解脫、度知見品，即以梵音告諸沙門：「柰女來至，各撿汝意，各自執持精進刀弓，皆自嚴辦智慧之矢，被定意鎧，乘禁戒車，與塵勞戰。",
        "translation": "Seeing this, the Buddha told the ascetics in a Sanskrit voice that this was a messenger of Māra who had come to destroy the pure precepts, concentration, wisdom, liberation, and the category of the knowledge and vision of salvation, \"Niang Niang has arrived to collect your thoughts, each holds a sword and bow of effort, each decorates her own spear of wisdom, is armed with the armor of concentration, rides the chariot of moral discipline, and fights the dust of toil.",
        "source": "T17n0744_001:0556c02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當計女人所有，欺誑一切如金塗錢，皮薄如蠅翅以覆惡穢，筋骨連綴，血肉之聚，目眵洟唾，身體汗垢，若不洗拭；作是計念，觀女人身，以制迷惑色欲之意。",
        "translation": "Consider what women possess, which deceives them all like gold-coated coins, has thin skin like a fly's wing that covers bad filth, has sinews and bones that are bound together, has a mass of flesh and blood, has eyeballs that are wet and spittle, and has body sweat and dirt that isn't washed; thus, you should contemplate and look at a woman's body to restrain the mind that's deluded by desire for form.",
        "source": "T17n0744_001:0556c05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀骨舍，束縛以筋，塗以血肉，覆以衣服，飾以華綵，猶如畫師立牆，以墼埿塗惡露、畫以綵色，女人之身亦復如是，當諦計知，除滅婬心。",
        "translation": "Looking closely at a boneshelter, bound with sinews, coated with flesh and blood, covered with clothing, and adorned with flowers and jewelry, it's like a painter who erects a wall, smearing it with foul dew and painting it with colored paint, so too is a woman's body, so you should carefully consider it and rid yourself of lustful thoughts.",
        "source": "T17n0744_001:0556c09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫欲學道，先調其心，後可獲安，不先調心，後悔無及。",
        "translation": "Those who want to train on the path must first tame their minds, and then they'll attain peace; if they don't first tame their minds, there'll be no regret later.",
        "source": "T17n0744_001:0556c12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邪行迷旋，譬如櫪馬，臨其壽終，願與意違，終不解脫。",
        "translation": "An errant practice that's misdirected is like a stallion that approaches the end of its life, vows and intentions are opposed, and it's never liberated.",
        "source": "T17n0744_001:0556c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有視色，心隨惑者，無常計常、苦有樂想、無我計我、不淨淨想；慧覺無常、苦、空、不淨，達如是者，即離長途生死患難。」",
        "translation": "When someone looks at form, their mind follows delusion, imagining impermanence as permanent, suffering as pleasant, selflessness as self, and impurity as pure; when wisdom perceives impermanence, suffering, emptiness, and impurity, they attain such realization and are freed from the long and difficult struggle of birth-and-death.\"",
        "source": "T17n0744_001:0556c15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是教，告諸弟子，皆共受持，一心奉行。",
        "translation": "With this teaching, the Buddha addressed his disciples, who all accepted it and wholeheartedly approved of it.",
        "source": "T17n0744_001:0556c17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "柰女見佛，如日出雲，金光照耀，發清淨意，五體投地，稽首佛足，却坐一面。",
        "translation": "When Niangnü saw the Buddha, she looked like a cloud rising from the sky, shining with golden light, aroused a pure intention, threw herself five times to the ground, bowed her head at the Buddha's feet, and withdrew to sit to one side.",
        "source": "T17n0744_001:0556c18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告柰女：「女人情逸惑著五欲，汝能御心迴屈詣佛所，樂妙法化，是汝最利。",
        "translation": "The Buddha told Niangnü, \"A woman's emotions are distracted by the five desires, but you're the most beneficial if you can control your mind, turn away from it, and visit the Buddha's abode, enjoying the teaching of the wonderful Dharma.",
        "source": "T17n0744_001:0556c20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "男子安重，塵勞垢薄，樂受法化，此不為奇。",
        "translation": "It's not surprising that a man is peaceful and dignified, and his defilement of defilement is thin, so he's happy to be taught the Dharma.",
        "source": "T17n0744_001:0556c22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人纏綿，塵勞羅網，盤旋周障，不識出要，一切世間，苦空無常，不可怙恃。",
        "translation": "A woman is entangled in a web of dust and labor, circling around obstacles, not knowing the essentials of escape, and all the world is painfully empty and impermanent, so she can't rely on them.",
        "source": "T17n0744_001:0556c23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "強疾侵壯，老失顏色，死劫壽命，危侵安隱，欲離是患，專精受法，勤修奉行，乃免斯苦。",
        "translation": "Strong illnesses bite their strength, old age robs them of their color, and their life span at death and eon is endangered and compromised, so they want to escape these hardships, concentrate on accepting the teaching, and diligently cultivate its practice to avoid this suffering.",
        "source": "T17n0744_001:0556c24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人怨憎，相遇甚惡，亦甚戀慕，恩愛之別。",
        "translation": "Women who hate each other meet very badly, but they also adore each other, and there's a distinction between affection and love.",
        "source": "T17n0744_001:0556c26_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡為女人，每不遠離於此二事。",
        "translation": "Every woman is not free from these two things.",
        "source": "T17n0744_001:0556c27_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故女人，當勤奉法，可離怨會、恩愛離別，不復遭遇生老病死，眾苦都滅。」",
        "translation": "Therefore, women should diligently devote themselves to the Dharma so that they can part with their enemies and part with their cravings, never again encounter birth, old age, illness, and death, and all suffering ceases.\"",
        "source": "T17n0744_001:0556c28_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "柰女聞佛若干妙化女人之穢，心懷慚愧，即起長跪，叉手白佛：「願垂慈哀，與聖眾俱，至舍受食。」",
        "translation": "Hearing that the Buddha had described the ways in which he had wonderfully transformed the woman's defilement, the Āmrapāli woman felt a sense of shame, got up and knelt down long enough to salute the Buddha with her palms together, saying, \"Please have mercy on us and join the noble people in accepting the meal at the abode.\"",
        "source": "T17n0744_001:0557a01_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即默受。",
        "translation": "The Buddha then accepted it in silence.",
        "source": "T17n0744_001:0557a03_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，柰女稽首而退，還歸辦具百味之食，甘脆精美，張施幡蓋，床座綩綖，香汁灑地，燒香散花，長跪請佛：「日時已到，願與聖眾垂迴臨覆。」",
        "translation": "So, the Āmrapāli woman withdrew with her head bowed, returned, prepared a hundred kinds of delicious foods, sweet and delicious, spread banners and shrouds, decorated seats with cloth, sprinkled the floor with scented juice, burned incense, and scattered flowers, and knelt down long enough to ask the Buddha, \"The time has come, may I ask the noble ones to come back and cover us.\"",
        "source": "T17n0744_001:0557a03_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與弟子著衣持鉢，至柰女家，花香伎樂，請佛入舍。",
        "translation": "The Buddha and his disciples put on their robes and bowls and went to the house of Nana with flowers, incense, and music to invite the Buddha into the monks' quarters.",
        "source": "T17n0744_001:0557a06_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各就坐位，手自斟酌，行水奉食，食訖澡漱。",
        "translation": "They each took a seat, poured their own water, offered it to the monks, and washed themselves after finishing their meal.",
        "source": "T17n0744_001:0557a07_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為廣說布施福報、戒慎之果，天人快樂不得長久，危亡別離不可恃怙，唯四聖諦、八賢聖路，以獲大安，永無憂患。",
        "translation": "The Buddha explained in detail the merits of generosity and the rewards of prudence, how the happiness of gods and humans couldn't last, how distress and separation couldn't be relied upon, and how only the four noble truths and the noble path of the eight virtuous ones could lead to great peace and permanent freedom from sorrow.",
        "source": "T17n0744_001:0557a08_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心皆歡喜，疑除結解，得須陀洹。",
        "translation": "Rejoicing in their hearts, they remove the bonds of doubt and become stream-winners.",
        "source": "T17n0744_001:0557a11_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾坐懷疑：「柰女前世有何功德，從樹花生，端正姝好？」",
        "translation": "The crowd sitting there wondered, \"What merit did Niangnü possess in a previous life that made her grow from a tree and make her handsome and beautiful?\"",
        "source": "T17n0744_001:0557a12_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者阿難，知眾懷疑，長跪叉手，前白佛言：「眾坐悉疑，柰女前世於何福田，植何德本，今遇世尊，服甘露藥？」",
        "translation": "Knowing the people's doubts, the good man Ānanda knelt down with his palms together and said to the Buddha, \"Everyone sitting here wonders, 'What field of merit did Niangnü plant in her past life, and what roots of virtue did she cultivate before she met the Bhagavān and took the elixir of immortality?'\"",
        "source": "T17n0744_001:0557a13_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「乃前過世，迦葉佛時，人壽二萬歲，佛事終竟，復捨壽命。",
        "translation": "The Buddha told Ānanda, \"In a past life, when Kāśyapa Buddha lived for 20,000 years, he ended his Buddha service and then retired from life.",
        "source": "T17n0744_001:0557a15_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有王，名曰善頸，供養舍利，起七寶塔，高一由延。",
        "translation": "At the time, there was a king named Shanjie who made offerings to the relics and built a seven-jewel stūpa that was about a yojana high.",
        "source": "T17n0744_001:0557a17_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生，然燈燒香，花蓋繒綵，供養禮事。",
        "translation": "All the sentient beings burned lamps and incense, covered themselves with flowers and silken ribbons, and made offerings to venerate them.",
        "source": "T17n0744_001:0557a18_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有眾女，欲供養塔，便共相率，掃除塔地。",
        "translation": "When there were women who wanted to make offerings to the stūpa, they all joined together to sweep the stūpa grounds.",
        "source": "T17n0744_001:0557a19_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有狗糞，污穢塔地。",
        "translation": "There was then dog waste that defiled the stūpa's floor.",
        "source": "T17n0744_001:0557a20_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一女人，手撮除棄。",
        "translation": "One woman picked it up with her hand and threw it away.",
        "source": "T17n0744_001:0557a21_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一女，見其以手除地狗糞，便唾笑之曰：『汝手以污，不可復近。』",
        "translation": "Another woman saw her removing the dog's dung with her hand and reviled her, saying, 'Your hand is soiled; you mustn't come near it again.'",
        "source": "T17n0744_001:0557a21_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女逆罵：『汝弊婬物，水洗我手，便可得淨。",
        "translation": "The woman rebuked him, saying, 'You're a dirty, licentious person; wash my hands with water, and they'll be purified.'",
        "source": "T17n0744_001:0557a23_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛天人師敬意無已。』",
        "translation": "There's no end to the respect and admiration of the Buddhas, gods, and teachers.'",
        "source": "T17n0744_001:0557a24_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "手除不淨已，便澡手，遶塔求願：『今掃塔地，污穢得除，令我來世勞垢消滅清淨無穢。』",
        "translation": "After removing the impurity from her hands, she washed her hands, went around the stūpa, and vowed, 'Now, I'll sweep the stūpa grounds, and the defilements will be removed, so that in the next life my laborious defilements will be gone and I'll be clean and unsullied.'",
        "source": "T17n0744_001:0557a24_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時諸女人掃塔地者，今此會中諸女人是。",
        "translation": "\"The women who swept the stūpa floor at the time were the women in this congregation.",
        "source": "T17n0744_001:0557a26_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時掃地，願滅塵勞，服甘露味，爾時以手除狗糞女，今柰女是。",
        "translation": "At the time, they were sweeping the ground, vowing to quell the dust and trouble and to consume the taste of ambrosia, and at the time they were removing dog excrement with their hands, and these are the women of Nandana.",
        "source": "T17n0744_001:0557a27_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時發願，不與污穢會，所生清淨。",
        "translation": "At the time, she gave rise to the vow that she wouldn't associate with defilement and that what she produced would be pure.",
        "source": "T17n0744_001:0557a28_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是福報，不因胞胎臭穢之處，每因花生。",
        "translation": "This merit doesn't result from having to go to a smelly, filthy place; it's the result of each peanut.",
        "source": "T17n0744_001:0557a29_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以其爾時，發一惡聲，罵言婬女，故今受是婬女之名。」",
        "translation": "Because at the time he made a bad sound and called her a woman of debauchery, he now receives the name woman of debauchery.\"",
        "source": "T17n0744_001:0557b01_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為廣說善惡報應，天上世間榮樂歡娛，三惡道苦，更相吞噉愁毒號哭。",
        "translation": "The Buddha explained in detail the rewards of good and evil, the prosperity and happiness of the heavenly world, and the suffering of the three evil destinies, which involve devouring each other and wailing with sorrow and pain.",
        "source": "T17n0744_001:0557b02_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾會，聞佛所說，歸命三尊，佛法聖眾，除身口意，奉行十善。",
        "translation": "At the time, the congregation heard what the Buddha taught, gave their lives to the three honored ones, and the noble members of the Buddha's teaching consecrated themselves to the ten good qualities, except for their physical, verbal, and mental conduct.",
        "source": "T17n0744_001:0557b04_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無央數人，各於三乘，建立道意。",
        "translation": "Countless numbers of people each established their intention for the path in the three vehicles.",
        "source": "T17n0744_001:0557b05_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切歡喜，遶佛三匝，作禮而去。",
        "translation": "Rejoicing, they all circled the Buddha three times, paid homage, and departed.",
        "source": "T17n0744_001:0557b06_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，世尊還至精舍。",
        "translation": "The Bhagavān then returned to the monastery.",
        "source": "T17n0744_001:0557b07_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說除恐災患經",
        "translation": "The Buddha Explained the Sutra on Eliminating Fear and Disaster",
        "source": "T17n0744_001:0557b08_0",
        "is_bad_quality": false
    }
]