[
    {
        "source_sentence": "所欲致患經",
        "translation": "Sutra on the Desired Cause of Illness",
        "source": "T17n0737_001:0539b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月支三藏竺法護譯",
        "translation": "Translated by Dharmarakṣa of the Yuezhi Tripiṭaka of the Western Jìn Dynasty",
        "source": "T17n0737_001:0539b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛遊舍衛國，祇樹給孤獨園，與大比丘眾俱，比丘五百。",
        "translation": "Thus I have heard: One time, the Buddha traveled to the country of Śrāvastī and stayed at Anāthapiṇḍada Park in Jeta Grove with a large assembly of 500 monks.",
        "source": "T17n0737_001:0539b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘明旦著衣持鉢，入舍衛城。",
        "translation": "At the time, the monks put on their robes and bowls at sunrise and entered the city of Śrāvastī.",
        "source": "T17n0737_001:0539b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸外道異學問諸比丘：「沙門！",
        "translation": "The laymen and non-Buddhists asked the monks, \"Ascetic!",
        "source": "T17n0737_001:0539b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇何因處患？",
        "translation": "What are the causes of Gautama's troubles?",
        "source": "T17n0737_001:0539b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何別色、痛痒、思想、生死、識字苦？",
        "translation": "What distinguishes form, pain, itch, thought, birth-and-death, and the suffering of consciousness?",
        "source": "T17n0737_001:0539b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何於此諸法，有何差特？",
        "translation": "How are these things different?",
        "source": "T17n0737_001:0539b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何志願？",
        "translation": "What are your aspirations?",
        "source": "T17n0737_001:0539b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因為成？",
        "translation": "What is the cause for its completion?",
        "source": "T17n0737_001:0539b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門瞿曇現法云何？",
        "translation": "\"What is the present state of the ascetic Gautama?",
        "source": "T17n0737_001:0539b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因開化？",
        "translation": "What causes enlightenment?",
        "source": "T17n0737_001:0539b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所言講？」",
        "translation": "Is there something you want to say?\"",
        "source": "T17n0737_001:0539b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘聞諸外道所言，無以報答，則從坐起，尋捨退去，各心念言：「如此所說，當從世尊啟問諮受，為我分別，尋當奉行。」",
        "translation": "When the monks who heard what the heretics said had no answer, they got up from their seats, looked for refuge, and withdrew, each thinking, \"Thus taught, you must inquire from the Bhagavān about it, discern it for me, and seek to carry it out.\"",
        "source": "T17n0737_001:0539b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘分衛已竟，飯食畢訖，更整衣服，往詣佛所。",
        "translation": "After they had finished their portion of the guard, the monks finished their meal, adjusted their robes, and went to the Buddha.",
        "source": "T17n0737_001:0539b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稽首足下，却坐一面，前白世尊，說諸異道所可難問，悉次第說。",
        "translation": "They bowed their heads at their feet, withdrew to sit at one side, and said to the Bhagavān that they would explain in detail the difficult questions that could be asked of other paths.",
        "source": "T17n0737_001:0539b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，世尊告諸比丘：「外道問汝：『愛欲之事，有何安樂？",
        "translation": "The Bhagavān then addressed the monks, \"The non-Buddhists ask you, 'What's comfortable about things that are desirable?'",
        "source": "T17n0737_001:0539b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "致何憂患？",
        "translation": "What kind of misery does it cause?",
        "source": "T17n0737_001:0539b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何從興致？",
        "translation": "How do they get excited?",
        "source": "T17n0737_001:0539b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因何而滅？』",
        "translation": "For what reason will it cease?'",
        "source": "T17n0737_001:0539b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當答報，諸外道默然，不以言對。」",
        "translation": "You will give them an answer, and the non-Buddhists will be silent and won't respond in words.\"",
        "source": "T17n0737_001:0539b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我不見能解此意，分別上義。",
        "translation": "The Buddha said, \"I don't see how I can understand this meaning and discern the higher meaning.",
        "source": "T17n0737_001:0539b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0737_001:0539b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無能及者，非其境界。",
        "translation": "\"There's no match for it, and it's not its realm.",
        "source": "T17n0737_001:0539b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛察天上、天下，諸魔、梵天、梵志、諸神及人，能發遣此問，令意欣悅，愛其所樂，為欲所染，耳聞好聲，鼻識好香，舌識美味，身識細滑，可意忻悅，志於所樂，為之所染，心貪於法。",
        "translation": "When the Buddha examines the heavens and the earth, the Māras, Brahmā, Brahmā, gods, and humans who can send these questions, he causes his mind to be pleased, loves what he loves, is stained by desire, he hears nice sounds with his ear, smells nice with his nose, tastes good with his tongue, and has a fine, smooth body consciousness that delights his mind, aspires to what he wants, is stained by it, and lusts after the Dharma in his heart.",
        "source": "T17n0737_001:0539b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是五所欲，從因緣起，心以為樂。」",
        "translation": "These five desires arise from causes and conditions, and the mind takes pleasure in them.\"",
        "source": "T17n0737_001:0539c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「何等為所欲之患？",
        "translation": "The Buddha told the monks, \"What's the danger of desiring what you want?",
        "source": "T17n0737_001:0539c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有族姓子隨其巧便，立生活業，多所想念。",
        "translation": "Some of their clansmen take advantage of their skills to build a living, and many of them miss it.",
        "source": "T17n0737_001:0539c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或以伎術，或作長吏，或作畫師，或行算術，或復刻鏤，或以塗度，或說色事；或以寒凍、或逢暑熱飢渴餓死；或觸風雨，或遭蚊虻，諸根變亂。",
        "translation": "Sometimes they use tricks, or they become a superior official, or they work as a painter, or they perform arithmetic, or they carve and chisel, or they use cosmetics, or they talk about things of color; sometimes they freeze, or they experience heat and hunger, thirst, and death; sometimes they come in contact with wind and rain, or they encounter mosquitoes and stinging insects, which causes their faculties to become disturbed.",
        "source": "T17n0737_001:0539c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "趣此諸事，身欲自在，求於財寶，坐起放心，恣意坐於財寶，啼哭愁憂，椎胸欝怫。",
        "translation": "Going along with these things, they want personal freedom, seek possessions, sit up and relax, sit freely with possessions, lament and grieve, and beat their chests with anguish.",
        "source": "T17n0737_001:0539c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾謂是輩，則為癡冥，致無果實，猶是精勤，不離其業，造立屋宅，及諸財賄，以獲財寶。",
        "translation": "I think these people are deluded and deluded, which leads to fruitlessness, but they still work hard and don't part with their activities to build a house and bribe possessions in order to obtain wealth and possessions.",
        "source": "T17n0737_001:0539c10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設不能獲，起無央數憂惱諸患，歌舞將御，得無縣官、水、火、盜賊、怨家債主所見奪取，燒沒搪揬劫害侵暴，壞亂家居，亡失財寶。",
        "translation": "If they can't obtain them, they'll experience incalculable sorrow and trouble, singing, dancing, and defending, as well as seizure by officials, water, fire, thieves, and enemies and creditors, burning, destroying, plundering, and violence, destroying their homes, and losing their treasures.",
        "source": "T17n0737_001:0539c12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼族姓子心懷此憂，卒值水、火、盜賊、怨家，所見侵奪，愁憂啼哭，不能自勝：『吾前治生積聚財業，今者霍空，無所依仰。』",
        "translation": "That clansman's mind is so worried that when he's attacked by water, fire, thieves, or enemies, he's overcome by what he sees, and he's so sad and laments that he can't help himself: 'I've accumulated wealth and property in my previous life, but now I've wasted it away and have nothing to look up to.'",
        "source": "T17n0737_001:0539c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為情欲之憂患也。",
        "translation": "This is the sorrow and danger of passions.",
        "source": "T17n0737_001:0539c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣欲致愛，放心恣意，致此惱恨。」",
        "translation": "Conditioned by desire, craving and assured wantonness cause this kind of anguish.\"",
        "source": "T17n0737_001:0539c18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復次，因欲貪愛，所在放心恣意，父說子惡，子說父惡，母說女惡，女說母惡，兄說弟惡，弟說兄惡，姊說妹惡，妹說姊惡。",
        "translation": "The Buddha addressed the monks, \"Furthermore, when lust and desire cause a person to be at ease and careless, a father says a son is bad, a son says his father is bad, a mother says a daughter is bad, a daughter says her mother is bad, a brother says a brother is bad, a brother says a sister is bad, and a sister says her sister is bad.",
        "source": "T17n0737_001:0539c19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "家室宗族，轉相誹謗。",
        "translation": "Their families and clans constantly denigrate each other.",
        "source": "T17n0737_001:0539c22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為貪欲之患，因致勤苦，皆由多求，放心恣意，為欲所溺。」",
        "translation": "This is the danger of desire, which causes hard work and suffering because of repeated seeking and assured wantonness, and they're drowning in desire.\"",
        "source": "T17n0737_001:0539c22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復次，愛欲之患著愛為本，放心恣意，因貪利故，把持兵仗、引弓捻箭，入軍戰鬪，興四部兵象馬車步，眾兵共鬪。",
        "translation": "The Buddha told the monks, \"Furthermore, the affliction of desire is rooted in craving, assuredness, and wantonness.",
        "source": "T17n0737_001:0539c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是劇羅網，因欲自喪。",
        "translation": "This is a web of tragedy that causes them to want to kill themselves.",
        "source": "T17n0737_001:0539c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親屬與親屬，興起因緣，因貪犯罪，馳走不安，以求財產。",
        "translation": "Their relatives and kin give rise to causes and conditions that cause them to crave crime and run about restlessly, seeking property.",
        "source": "T17n0737_001:0539c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或能獲財、或不能得、或尋失財，愁憂懷惱，拍臏椎胸而以欝怫：『吾本多財，今者殫盡。』",
        "translation": "Sometimes they may be able to obtain property, sometimes they can't, and sometimes they find lost property, and they become sad and troubled, beating their chests and complaining, 'I had a lot of money, but now I've run out.'",
        "source": "T17n0737_001:0539c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為貪欲之患、恩愛之惱，放心恣意，為之所溺。」",
        "translation": "This is the trouble of craving and the worry of kindness, so they are at ease and wanton, and they're sunken by it.\"",
        "source": "T17n0737_001:0540a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復次，因欲之患著愛為本，放心恣意，父子相怨，母女相憎，夫婦相捐，姊妹懷恨，兄弟相憎，親屬家室自相誹謗。",
        "translation": "The Buddha told the monks, \"Furthermore, when the affliction of desire and attachment are the root, their mind is at ease and willful, and fathers and sons come to resent each other, mothers and daughters hate each other, husbands and wives reject each other, sisters harbor hatred, brothers hate each other, and relatives and families denigrate each other.",
        "source": "T17n0737_001:0540a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為貪欲之患恩愛之惱，放心恣意，為之所溺。」",
        "translation": "This is the affliction of desire, the worry of affection, and being at ease and wanton about it, which sucks you in.\"",
        "source": "T17n0737_001:0540a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復次，因欲之患著愛為本，放心恣意，手執利劍，若持刀杖，屏處沙中、若樹木間、破塢間，心中怫欝，轉相奪命，遙擲火輪，沸油相灑。",
        "translation": "The Buddha told the monks, \"Furthermore, when the affliction of desire is based on attachment, their mind is careless and relaxed, and they carry a sharp sword in their hand or a knife and stick in their hand, stand in the sand or among trees or a broken dock, and become angry in their minds, which in turn kills them, toss fireballs from afar, or sprinkle boiling oil on them.",
        "source": "T17n0737_001:0540a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣是興惡，或致困痛、或致死亡。",
        "translation": "As a result of this, evil arises, which may cause pain and suffering or death.",
        "source": "T17n0737_001:0540a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為貪欲之患，恩愛之惱，放心恣意，為之所溺。」",
        "translation": "This is the trouble of desire, the torment of kindness, and assured wantonness, which sucks you in.\"",
        "source": "T17n0737_001:0540a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復次，因欲之患著愛為本，放心恣意，破他門戶，斷人寄餉，鑿人垣牆，夜行作賊，在藏匿處、或復逃亡，鬪爭放火。",
        "translation": "The Buddha told the monks, \"Furthermore, because the affliction of desire is rooted in craving, they become careless and relaxed, break down people's doors, cut off their provisions, bore down their walls, act as thieves by night, hide in hiding places or run away again, and start fights and fires.",
        "source": "T17n0737_001:0540a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國主覺得，或吏縛束，閉著牢獄，或截耳鼻手足考治掠笞，或斷頭首，或時住立壓踝，鹿弶擎、塼兔窟，或甑或鑊湯煮，沸油灑體，是為貪欲之患、恩愛之惱，放心恣意，為之所溺。」",
        "translation": "When the kingdom's lord finds out about it, he may bind them by officials, lock them up in prison, cut off their ears, nose, hands, and feet, treat them with pillorying, cut off their heads, crush their ankles when they stand, cook them in a deer snare or rabbit hole, boil them in a cauldron or wok, or sprinkle their bodies with boiling oil; this is the trouble of craving and the vexation of affection, so they are at ease and wanton, and they are sunken by them.\"",
        "source": "T17n0737_001:0540a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復次，因欲之患著愛為本，放心恣意，身欲眾惡，罵詈衝口，心念毒惡，不護身口，不顧後世。",
        "translation": "The Buddha told the monks, \"Furthermore, because the affliction of desire is rooted in craving, they are at ease and careless, desire numerous bad things in their bodies, ridicule and insult, think harsh thoughts in their minds, don't protect their bodies and speech, and don't look after the afterlife.",
        "source": "T17n0737_001:0540a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽命終沒，魂神一去，墮於惡趣懃苦之處，晝夜考治，無央數歲。",
        "translation": "When their life span ends, their soul departs, and they fall into the miserable places of the negative destinies and suffering, and they are disciplined day and night for measureless years.",
        "source": "T17n0737_001:0540a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為貪欲之患、愛欲之惱，放心恣意，為之所溺。」",
        "translation": "This is the trouble of craving and the torment of desire, and I'm at ease and wanton about it, so I'm drowning in it.\"",
        "source": "T17n0737_001:0540a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「復次，何因捨欲能樂斷惡？",
        "translation": "The Buddha addressed the monks, \"Furthermore, what is the cause for abandoning desire that makes it possible to happily end evil?",
        "source": "T17n0737_001:0540a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切所欲，截諸貪求，刈眾情態，是為捨欲。",
        "translation": "Cutting off desire and craving for everything they desire and cutting down the attitudes of many beings is called abandoning desire.",
        "source": "T17n0737_001:0540a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有沙門梵志，見愛欲之瑕，因興諸患。",
        "translation": "There are ascetics and priests who see the flaws in craving and cause problems.",
        "source": "T17n0737_001:0540a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "審知如有愛欲已，勸助眾人使度於欲。",
        "translation": "After examining whether there are cravings, he encourages and helps people to stop craving.",
        "source": "T17n0737_001:0540a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使勸化，至於解脫。",
        "translation": "If he encourages and teaches them, it will lead to their liberation.",
        "source": "T17n0737_001:0540a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "志於愛欲，欲度彼岸，未之有也。",
        "translation": "It's unlikely that someone would want to pursue cravings and desire to reach the other shore.",
        "source": "T17n0737_001:0540b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有沙門梵志，樂於愛欲、不觀愛欲之瑕穢者，若能審識情欲，如有無貪諸情，開化眾人，度於彼岸，自度濟彼，則獲此事，如意無疑。",
        "translation": "If there are ascetics and priests who delight in craving and don't observe the defilements of craving, and if they can examine the desires of sentient beings, if they have craving-free sentient beings, enlighten others to cross over to the other side, and save themselves from them, then they'll attain this, as they wish, without doubt.",
        "source": "T17n0737_001:0540b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有目覩，於此人所樂，長者家妻，梵志之妻，年十四五、十六二十，不長不短、不麁不細、不白不黑，顏貌姝妙，如樹華茂。」",
        "translation": "Their eyes see this person's delight in an elderly man's wife or a priest's wife, 14 or 15 or 16 or 20 years old, not long or short, not crude or fine, not white or black, and with a beautiful face like a tree with flowers.\"",
        "source": "T17n0737_001:0540b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言比丘：「初始目覩，因緣所興可意歡樂，是欲所樂。",
        "translation": "The Buddha told the monk, \"The first thing that the eyes see and the causes that give rise to agreeable pleasure are desires that are pleasurable.",
        "source": "T17n0737_001:0540b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為色因緣之患？",
        "translation": "What's the problem of form as a causal condition?",
        "source": "T17n0737_001:0540b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是見女人，年尊老極，年八十若九十、百年、若百二十，頭白齒落，面皺皮緩，身重少氣，拄杖僂行，羸極上氣，行步苦難，身體戰恌。",
        "translation": "She then sees a woman who's extremely elderly, perhaps 80, 90, 100, or 120 years old, with a white head and missing teeth, wrinkled skin, a heavy body with little energy, a walking stick, weak and energetic, walking around with difficulty, and a body that's tense and weary.",
        "source": "T17n0737_001:0540b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於比丘意云何？",
        "translation": "What do you monks think?",
        "source": "T17n0737_001:0540b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極不於端正姝好，顏色證患已現？」",
        "translation": "Is it extremely rare that a form is realized and a danger is manifested when it's not correctly beautiful?\"",
        "source": "T17n0737_001:0540b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘對曰：「唯然，是為色之憂患也。」",
        "translation": "The monks replied, \"Yes, this is the misfortune of form.\"",
        "source": "T17n0737_001:0540b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「又見女人終亡之後，一日、二日，至五日六日，身色變青，膖脹爛臭，惡露不淨，從九孔出，身中生蟲，蟲還食其肉。",
        "translation": "The Buddha told the monks, \"Also, when I see a woman die, one, two, five, or six days later, her body turns blue, swells up, rots, and smells bad, and bad dew comes out of nine orifices; worms are born in her body, and they eat her flesh back.",
        "source": "T17n0737_001:0540b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於比丘意云何？",
        "translation": "What do you monks think?",
        "source": "T17n0737_001:0540b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前時端正，顏色姝妙，今失好貌，變證現乎？」",
        "translation": "Was it correct and beautifully colored in the past, but now it's lost its good looks and the realization of its transformation has appeared?\"",
        "source": "T17n0737_001:0540b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「唯然。」",
        "translation": "He replied, \"Yes, it's true.\"",
        "source": "T17n0737_001:0540b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是為色之患證。」",
        "translation": "The Buddha said, \"This is the realization of the danger of form.\"",
        "source": "T17n0737_001:0540b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「若復見女人，臭爛在地，烏鳥所食，雕鷲所啄，虎狼野狐所噉，無央數蟲，從其身出，還食其肉。",
        "translation": "The Buddha told the monks, \"Suppose you also see a woman smelling rotten on the ground, eaten by crows and birds, pecked by eagles and vultures, devoured by tigers, wolves, and foxes, or eaten by countless insects that emerge from her body and return to eat her flesh.",
        "source": "T17n0737_001:0540b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於比丘意云何？",
        "translation": "What do you monks think?",
        "source": "T17n0737_001:0540b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前時端正，顏色姝好，沒不存乎？",
        "translation": "Is it not present in a correct manner and of excellent color?",
        "source": "T17n0737_001:0540b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其患現耶？」",
        "translation": "What is its problem now?\"",
        "source": "T17n0737_001:0540b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「唯然。」",
        "translation": "They replied, \"Yes, I guess so.\"",
        "source": "T17n0737_001:0540b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是為欲之患證也。」",
        "translation": "The Buddha said, \"This is the realization of the danger of desire.\"",
        "source": "T17n0737_001:0540b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「若復見女人，皮肉離體，但見白骨，前時端正，顏貌姝好，沒不復現，其患證乎？」",
        "translation": "The Buddha told the monks, \"If you again see a woman whose skin and flesh are separated from her body and you see only white bones, and she was previously correct and had a beautiful face that doesn't reappear, is that a sign of trouble?\"",
        "source": "T17n0737_001:0540b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「唯然。」",
        "translation": "They replied, \"Yes, it's true.\"",
        "source": "T17n0737_001:0540b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是為愛欲之患證也。」",
        "translation": "\"This is evidence of the danger of craving.\"",
        "source": "T17n0737_001:0540b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「若復見女人，身骨節解，手足膝脛，鼻耳脇背，臂肘頭頸，各在異處。",
        "translation": "The Buddha told the monks, \"Suppose you also see a woman whose bones are untied, whose hands, feet, knees, shins, nose, ears, back of the neck, and arms, elbows, head, and neck are each in a different place.",
        "source": "T17n0737_001:0540b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於比丘意云何？",
        "translation": "What do you monks think?",
        "source": "T17n0737_001:0540b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前時端正姝好，沒不現乎？",
        "translation": "Was the former time correct and attractive, or was it not present?",
        "source": "T17n0737_001:0540b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證患現耶？」",
        "translation": "Is the realization of suffering present?\"",
        "source": "T17n0737_001:0540b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「唯然。」",
        "translation": "They replied, \"Yes, I guess so.\"",
        "source": "T17n0737_001:0540b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是為欲之憂患證也。」",
        "translation": "The Buddha said, \"This is the realization of the sorrow and distress of desire.\"",
        "source": "T17n0737_001:0540c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「見彼女人，捐在塚間無央數歲，骨節糜碎，青白如碧，碎壞如麵。",
        "translation": "The Buddha told the monks, \"They see this woman who's been buried in a tomb for measureless years, and her bones are broken, blue and white like turquoise, and crumbled like flour.",
        "source": "T17n0737_001:0540c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於比丘意云何？",
        "translation": "Monks, what do you think?",
        "source": "T17n0737_001:0540c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前時端正，顏貌姝好，沒不現乎？",
        "translation": "Wasn't it correct in the past, with a handsome face, and isn't it present?",
        "source": "T17n0737_001:0540c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "患證現耶？」",
        "translation": "Is it a case of realizing the manifestation?\"",
        "source": "T17n0737_001:0540c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「唯然。」",
        "translation": "He replied, \"Yes, it's true.\"",
        "source": "T17n0737_001:0540c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是為貪欲憂患證也。」",
        "translation": "The Buddha said, \"This is the realization of the misery of craving.\"",
        "source": "T17n0737_001:0540c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「誰能離欲，能斷色欲，蠲除情色，拔貪不習，乃不著色。",
        "translation": "The Buddha told the monks, \"Who is free of desire, able to stop the desire for form, free from the emotions and form, and remove craving and non-acquisition, so they won't be attached to form?",
        "source": "T17n0737_001:0540c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有沙門梵志，樂色如是，以為歡然，覩其患證，覩見生惱，審知如有，則等於色心無所猗，勸化於人，使度彼岸。",
        "translation": "If there are ascetics and priests who enjoy form as such and think they're happy about it, and they see the realization of its misery and the affliction that arises from seeing it, and they examine and know that it exists, then they'll be equal to those whose minds are not at ease with form and who encourage others to cross over to the other side.",
        "source": "T17n0737_001:0540c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使有人，以色猗色，欲得度者，未之有也。",
        "translation": "Suppose there's someone who wants to be liberated because they're so distracted by form, for there's no such person.",
        "source": "T17n0737_001:0540c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其沙門梵志，歡喜於色，更諸情欲，覩色患證，欲得離色，拔其所情，則覩如有。",
        "translation": "That ascetic or priest who delights in form and creates additional emotions and desires, sees form and its afflictions and realizes that he wants to be free of form and remove those emotions, then he sees things as they are.",
        "source": "T17n0737_001:0540c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等觀諸色，勸化諸人，令度彼岸，知色所猗，捨於諸色，則可得也。」",
        "translation": "He observes form equally, encourages others to cross over to the other side, knows what's involved in form, and abandons form, and then he can attain it.\"",
        "source": "T17n0737_001:0540c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「何等為痛痒所更樂乎捨諸習耶？",
        "translation": "The Buddha told the monks, \"What's the pain and itch that makes you happier to abandon these habits?",
        "source": "T17n0737_001:0540c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是比丘寂於諸欲，離於諸惡不善之法，有念有想，獨處晏然，行第一禪。",
        "translation": "Thus, a monk is still of desires, free of bad and unskillful things, mindful and thoughtful, and alone, calmly practicing the first dhyāna.",
        "source": "T17n0737_001:0540c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使比丘，獲此第一禪者，則不貪己，不著于彼，則無有爭、心不懷恚，是為比丘痛痒樂無瞋怒。",
        "translation": "Suppose a monk attains this first dhyāna, then he doesn't crave himself and doesn't cling to that, so he has no quarrels and his mind doesn't harbor anger; this is a monk who suffers pain and itches and enjoys not being angry.",
        "source": "T17n0737_001:0540c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾無所恨，為樂痛痒，是為樂習所觀、樂彼滅諸想、樂內念寂然，其心為一，無念無行志寂逮安，是為第二禪。",
        "translation": "We have nothing to hate, so we delight in pain and itch, delight in the contemplation of accumulation, delight in the cessation of those thoughts, and delight in the stillness of internal mindfulness, which is unified in mind, without thought or action, and whose resolve is calm and peaceful.",
        "source": "T17n0737_001:0540c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使比丘，行第二禪不貪己，不著彼心增減，彼欲歡喜觀無欲行，常以寂定，業身則安，如聖所演，常觀意定，行第三禪。",
        "translation": "Suppose a monk who practices the second dhyāna doesn't crave himself, doesn't become attached to the increase or decrease of his mind, is delighted with his desires and observes the lack of desire and actions, always remains calm and concentrated, and his mind's activity body is then peaceful, just as the noble ones have taught, always observing concentration of mind, and practices the third dhyāna.",
        "source": "T17n0737_001:0540c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使比丘，行第三禪，是痛痒所樂，彼則除苦、蠲除所安，前所更歷可不可意，無苦無樂，觀其志定，具足清淨。",
        "translation": "Suppose a monk who practices the third dhyāna, which is pleasant in terms of pain and itching, removes that which is painful and peaceful, and observes his concentration of will as completely pure, whether it's pleasant or painful.",
        "source": "T17n0737_001:0540c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使比丘，行第四禪，是為痛痒所樂。",
        "translation": "Suppose a monk practices the fourth dhyāna, which is pleasant in terms of pain and itching.",
        "source": "T17n0737_001:0540c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T17n0737_001:0540c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣痛生樂可意之欲，是為痒所樂。",
        "translation": "The pleasant and desirable desire that arises from pain is what tickles.",
        "source": "T17n0737_001:0540c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為痛之憂患？",
        "translation": "What's the grief of pain?",
        "source": "T17n0737_001:0541a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因痛生患，憂惱之憒，是痛憂患。",
        "translation": "The pain and suffering that arises from pain and the grief and distress that results from it are pain and grief.",
        "source": "T17n0737_001:0541a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又痛痒，無常之苦、別離之法。",
        "translation": "It also causes pain and itching, which are impermanent suffering and the principle of separation.",
        "source": "T17n0737_001:0541a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其法都痛痒，起無常苦，致別離法，是為痛痒之患。",
        "translation": "It's a painful and itchy condition that causes impermanent suffering and results in the condition of separation, which is the painful and itchy affliction.",
        "source": "T17n0737_001:0541a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為離痛？",
        "translation": "What's separation from pain?",
        "source": "T17n0737_001:0541a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其於痛痒，斷諸貪欲，是為離欲。",
        "translation": "This is called freedom from desire, which stops craving for pain and itching.",
        "source": "T17n0737_001:0541a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有沙門梵志，曉了痛痒諸所更樂，都致憂患，不捨諸愛欲，審知如有，而猗痛痒，勸化眾人，度於彼岸，自得成就，濟諸猗著，未之有也。",
        "translation": "There are ascetics and priests who know the further pleasures of pain and itch, which all cause sorrow and trouble, don't abandon craving, examine what exists, and don't mind pain and itch, encourage others to cross over to the other side, and achieve their own success in relieving those who are unattached.",
        "source": "T17n0737_001:0541a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有沙門梵志，覩痛痒所樂，從樂致患，離於愛欲，諦知如有，等觀痛痒，而無所猗，勸化餘人，令度彼岸，自得成就，并化餘人，此事可致，是為捨歡悅。」",
        "translation": "That ascetic or priest who sees what pain and itching like, causes misery from that pleasure, parts with craving, truly knows there's such a thing, observes pain and itching equally, and has nothing to be anxious about, encourages and educates others, causes them to cross over to the other side, attains their own accomplishment, and educates others that this is something to be achieved is happy with equanimity.\"",
        "source": "T17n0737_001:0541a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸比丘，聞經歡喜。",
        "translation": "Thus, the monks who heard the sūtra rejoiced.",
        "source": "T17n0737_001:0541a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所欲致患經",
        "translation": "Sutra on Causing Suffering From Desire",
        "source": "T17n0737_001:0541a13_0",
        "is_bad_quality": false
    }
]