[
    {
        "source_sentence": "摩訶僧祇律卷第十一",
        "translation": "Mahāsāṃghika-vinaya, Vol. 11",
        "source": "T22n1425_011:0318b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東晉天竺三藏佛陀跋陀羅",
        "translation": "Buddhabhadra, the Tripiṭaka of the Eastern Jin dynasty",
        "source": "T22n1425_011:0318b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共法顯譯",
        "translation": "shared translation of the Buddhist teachings",
        "source": "T22n1425_011:0318b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明三十尼薩耆波夜提法之四",
        "translation": "Minisargīva-pratyutpanna-rāja",
        "source": "T22n1425_011:0318b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛住舍衛城，廣說如上。",
        "translation": "The Buddha was staying in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_011:0318b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長老難陀、優波難陀冬盛寒時，著厚納衣，敷煖床褥，頭上著帽、脚著富羅，前然爐火。",
        "translation": "It was then that the elders Nandana and Upananda, in the dead of winter, were dressed in thick undergarments, spread out on a warm bed and seat, and placed a cap on their heads and a pula on their feet, while standing in front of a fireplace.",
        "source": "T22n1425_011:0318b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二外道，黑色碧眼寒顫而來，在前立住，外道見已心生樂著，即語比丘言：「汝等出家得如是樂。」",
        "translation": "Two laymen with black, blue eyes and trembling cold came and stood in front of them, and when they saw them, the laymen became attached to them and said to the monks, \"You renunciant monks have attained this kind of happiness.\"",
        "source": "T22n1425_011:0318c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時外道心樂佛法，便作是言：「我等亦名出家，而值弗蘭迦葉教，我等裸形拔髮投巖赴澗，五熱炙身而行乞食，徒受辛苦而無樂事。」",
        "translation": "Being delighted with the Buddha's teaching, the heretic then said, \"We're also called renunciants, but when Pūraṇa-kāśyapa teaches us, we throw ourselves naked, pull our hair out, throw ourselves into a cliff or into a gorge, burn our bodies with five hots, and go begging for food, suffering nothing but hardship and having no joy.\"",
        "source": "T22n1425_011:0318c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘報言：「汝若樂此法者，便來出家，亦復如我得是樂住。」",
        "translation": "The monk replied, \"If you enjoy this teaching, then come and leave home, and you'll also live like me in this kind of happiness.\"",
        "source": "T22n1425_011:0318c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道答言：「我無沙門僧伽梨。」",
        "translation": "The non-Buddhist replied, \"I don't have a monk's saṃghârī.\"",
        "source": "T22n1425_011:0318c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘報言：「但來，我當與汝。」",
        "translation": "The monk replied, \"Just come, and I'll give it to you.\"",
        "source": "T22n1425_011:0318c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道即來，便與出家受具足已，語言：「我今度汝出家受具足，汝當作如是給事，我晨當早起問訊安眠不？",
        "translation": "The heretic then came, fully ordained as a renunciant, and said, \"Now, I've ordained you to leave home and be fully ordained, so you must do this for me.",
        "source": "T22n1425_011:0318c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出唾壺器及小便器著常處；淨洗手，授澡水齒木，持鉢迎粥，小食已洗鉢令燥，安著常處；若有請處，當迎食；我欲入聚落時，當持入聚落衣授我；取我常著衣，料理卷疊安著常處。",
        "translation": "When I want to enter a village, you must give me the robe I wear to enter the village, take my usual robe, clean it, give it to me, wash the bowl and welcome the gruel, wash the bowl after the meal, make it dry, and put it in its usual place; if there's a place you'd like to go, you must welcome the food; when I want to enter a village, I'll give you the robe I wear to enter the village; take it, fold it, and put it in its usual place.",
        "source": "T22n1425_011:0318c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從聚落還時，汝當敷小床座，與我水并授樹葉食時，以扇扇食已洗鉢令乾，舉著常處。",
        "translation": "When I return from the village, you must make a small bed and seat, give me water and a leaf to eat, fan the food, wash your bowl after eating, and make it dry, then carry it to your usual place.",
        "source": "T22n1425_011:0318c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脫入聚落衣卷舉，復授我常所著衣。",
        "translation": "Take off your robe and roll it up into the village, and then give me the robe I'm always wearing.",
        "source": "T22n1425_011:0318c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝食已，當取薪草浣衣煮染，淨掃房內，巨磨塗地。",
        "translation": "After you eat, take some wood and grass, wash your clothes, boil them, clean your room, and rub a large mill on the ground.",
        "source": "T22n1425_011:0318c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲入林坐禪時，汝當持坐具隨後，還時隨還，當與我水洗手。",
        "translation": "When I want to go into the forest to sit in meditation, you must carry your sitting cloth afterward and return with it when you return, and you must give me water to wash my hands.",
        "source": "T22n1425_011:0318c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "授香花供養訖，當敷床與我洗足水。",
        "translation": "After bestowing incense and flowers as an offering, you'll make a bed and hand me water to wash my feet.",
        "source": "T22n1425_011:0318c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以油摩敷置臥具，內唾壺及小便器然燈，如是種種供給。",
        "translation": "Put oil and grease on your bedding, put in a saliva pitcher and urinal, and then make offerings of this sort.",
        "source": "T22n1425_011:0318c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安隱我已，然後自事。」",
        "translation": "After you've made your peace, then you'll take care of yourself.\"",
        "source": "T22n1425_011:0318c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼比丘答師言：「此非出家法，便是婢作。」",
        "translation": "That monk then answered his teacher, \"This is not the way of the renunciant, which is to work as a servant.\"",
        "source": "T22n1425_011:0318c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師言：「汝若不能作者，當還我僧伽梨。」",
        "translation": "The teacher said, \"If you can't do it, you must return my saṃghârī.\"",
        "source": "T22n1425_011:0318c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即脫衣著地而去。",
        "translation": "He then took off his robe, put it on the ground, and departed.",
        "source": "T22n1425_011:0318c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Again, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_011:0318c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者難陀，是優波難陀兄。",
        "translation": "At the time, the Venerable Nandha was Upananda's brother.",
        "source": "T22n1425_011:0318c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波難陀語兄共行弟子言：「我共汝入聚落，當與汝物。",
        "translation": "Upananda then said to his brother's fellow disciple, \"I'll go with you into the village and give you something.",
        "source": "T22n1425_011:0318c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若作非威儀事，汝勿語他人，我是汝叔父。」",
        "translation": "If I do anything that's not appropriate, don't tell anyone that I'm your uncle.\"",
        "source": "T22n1425_011:0318c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「若我見父作非法，亦當向人說，況復叔父優波難陀。」",
        "translation": "He replied, \"If I saw my father do something unlawful, I would also tell someone, even if it were my uncle Upananda.\"",
        "source": "T22n1425_011:0319a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復言：「若汝如此，當使汝知。」",
        "translation": "Again, he said, \"If you do this, I'll let you know.\"",
        "source": "T22n1425_011:0319a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即將至貴家檀越留食，欲不與彼食，故作是思惟：「相望日時，使此不得乞食，還復失時。」",
        "translation": "He was about to go to your house and ask the donor for food, but he wanted to withhold food from him. He therefore thought, \"When we look forward to the sun, I won't be able to ask for food here, and I'll lose time again.\"",
        "source": "T22n1425_011:0319a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便告言：「汝還精舍。」",
        "translation": "He then told them, \"Return to the monastery.\"",
        "source": "T22n1425_011:0319a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便還，畏失時故，疾疾看日而行。",
        "translation": "Even so, he returned, fearing that he'd lose the time, and quickly looked at the sun and went on his way.",
        "source": "T22n1425_011:0319a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至精舍，見諸比丘皆悉食已，門前經行，遙見疾行疑必有以，即問汝：「今日共多知識比丘處處教化，得何等好食脣膩如是？」",
        "translation": "When he arrived at the monastery, he saw the monks all eating and walking past the entrance. Seeing them walking quickly, he suspected there must be a reason for it and asked, \"Today, we were taught by many knowledgeable monks to go around, what kind of good food and dirt did you get?\"",
        "source": "T22n1425_011:0319a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我今失食，況得好者。」",
        "translation": "He replied, \"Now, I've lost my food, so how could I have gotten a good one?\"",
        "source": "T22n1425_011:0319a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波難陀遣彼還已，於後食種種飲食。",
        "translation": "After Upananda sent him back, he ate various foods later.",
        "source": "T22n1425_011:0319a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食已恐事情露，疾還。",
        "translation": "After he finished eating, he was afraid that things would get out, so he quickly returned.",
        "source": "T22n1425_011:0319a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸比丘叢聚而論，便作是思惟：「眾人集論，必彼比丘向諸梵行人說我過惡。」",
        "translation": "Seeing the monks gathered here, he thought, \"That monk must have told the religious practitioners about my faults.\"",
        "source": "T22n1425_011:0319a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語難陀言：「長老！",
        "translation": "He then said to Nandha, \"Elder!",
        "source": "T22n1425_011:0319a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝弟子向諸梵行人說我過惡。」",
        "translation": "Your disciple told the religious practitioners about my faults.\"",
        "source": "T22n1425_011:0319a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即瞋恚語弟子言：「汝今云何說我弟過？",
        "translation": "He then angrily said to the disciple, \"How did you tell my disciples about their faults?",
        "source": "T22n1425_011:0319a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可還我僧伽梨來。」",
        "translation": "You may return my saṃghârī.\"",
        "source": "T22n1425_011:0319a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘聞已，共相謂言：「此比丘今日遭二苦惱：一者失食，二者失衣。」",
        "translation": "After the monks heard this, they all said to each other, \"This monk has suffered two kinds of hardships today: first, he's lost his food, and second, he's lost his clothing.\"",
        "source": "T22n1425_011:0319a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛聞是已，知而故問諸比丘：「此何比丘高聲大語？」",
        "translation": "After hearing this, the Buddha knew and therefore asked the monks, \"Which monk is raising his voice and speaking loudly?\"",
        "source": "T22n1425_011:0319a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, \"Bhagavān!",
        "source": "T22n1425_011:0319a18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此難陀奪共行弟子衣，是故大聲。」",
        "translation": "This Nanda took away the co-disciple's robe; therefore, it's a loud noise.\"",
        "source": "T22n1425_011:0319a18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「呼難陀來。」",
        "translation": "The Buddha said, \"Call Nandanavana to come.\"",
        "source": "T22n1425_011:0319a19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "來已佛廣問難陀：「汝實為自供給故，度人與衣，令弟子瞋，不能作婢作，乃至奪共行弟子衣耶？」",
        "translation": "After he came, the Buddha asked Nandanavana in detail, \"Is it true that you saved people and gave them robes because you wanted to make offerings for yourself, and that made your disciples angry and unable to work as handmaids, even to the point of taking away the co-disciples' robes?\"",
        "source": "T22n1425_011:0319a19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, \"That's true.\"",
        "source": "T22n1425_011:0319a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語難陀：「汝云何度人出家，不教法律，但令執作供給自己？」",
        "translation": "The Buddha said to Nandana, \"How do you get someone to leave home and not teach them the Dharma but make them attach to making offerings to themselves?\"",
        "source": "T22n1425_011:0319a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種因緣呵已，告諸比丘：「從今日不得立心為供給自己故度人出家，度者，得越毘尼罪。",
        "translation": "After the Buddha had rebuked them for various reasons, he told the monks, \"From now on, you mustn't establish the intention to leave home in order to provide for yourself; if you do, you'll transgress the offense of vini.",
        "source": "T22n1425_011:0319a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是念：『當使彼人因我度故，修諸善法得成道果。』」",
        "translation": "You should think, 'This is how you'll cause that person to cultivate good qualities and attain the fruit of the path because I've saved them.'\"",
        "source": "T22n1425_011:0319a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「依止舍衛城住者盡集，以十利故與諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The Buddha told the monks, \"Relying on the complete collection of those who live in Śrāvastī, he will give the monks the precepts for the sake of the ten benefits, even if they have already heard them, they will hear them again.",
        "source": "T22n1425_011:0319a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘與比丘衣後瞋恚不喜，若自奪、若使人奪，作是言：『比丘！",
        "translation": "If a monk gives a monk a robe and then becomes angry and displeased, and if he takes it away from himself or causes it to be taken away from him, he says, 'Monks!",
        "source": "T22n1425_011:0319a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還我衣來，不與汝。』",
        "translation": "Return my robe, and I won't give it to you.'",
        "source": "T22n1425_011:0319b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得者，尼薩耆波夜提。」",
        "translation": "I'll get it, rules of forfeiture of the robe, rules of forfeiture of the monk's robe.\"",
        "source": "T22n1425_011:0319b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘者，如上說。",
        "translation": "A monk, as explained above.",
        "source": "T22n1425_011:0319b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣者，七種，如上說。",
        "translation": "There are seven kinds of robes, as explained above.",
        "source": "T22n1425_011:0319b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋恚不喜者，九惱，如上說。",
        "translation": "Those who are angry and displeased have nine kinds of anger, as explained above.",
        "source": "T22n1425_011:0319b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奪者，若自奪、若使人奪，作如是言：「還我衣來，不與汝。」",
        "translation": "He takes them himself or causes them to be taken, saying, \"Give me back my robe; I won't give it to you.\"",
        "source": "T22n1425_011:0319b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得者，尼薩耆波夜提。",
        "translation": "He who obtains it is rules of forfeiture of the things that a monk or nun possesses.",
        "source": "T22n1425_011:0319b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼薩耆波夜提者，如上說。",
        "translation": "Nisargipayetī is like the above-explained one.",
        "source": "T22n1425_011:0319b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或自與使人奪、或使人與自奪、或自與自奪、或使與使奪、合與別奪、別與合奪、合與合奪、別與別奪。",
        "translation": "It might be taken by oneself and someone else, by someone else and oneself, by oneself and oneself, by a messenger and a messenger, jointly and separately, separately and together, jointly and together, or separately and separately.",
        "source": "T22n1425_011:0319b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合與別奪者，比丘一時與三衣已，別奪言：「還我僧伽梨、還我欝多羅僧、還我安陀會。」",
        "translation": "A person who is jointly and separately taken away is a monk who, after giving three garments at one time, separately takes them away, saying, \"Give me back my saṃghāṭī, give me back my uttarâsaṅga, and give me back my undergarment.\"",
        "source": "T22n1425_011:0319b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是奪者，得眾多波夜提。",
        "translation": "Such a seizure will result in numerous pāyattika.",
        "source": "T22n1425_011:0319b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名合與別奪。",
        "translation": "This is called combined and distinctive appropriation.",
        "source": "T22n1425_011:0319b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別與合奪者，比丘非一時與僧伽梨、與欝多羅僧、與安陀會，還一時盡奪：「汝還我衣來。」",
        "translation": "When a monk is separately and jointly taken, he doesn't take the saṃghāṭī, the uttarâsaṅga, or the undergarment at one time and then take them all at another time, saying, \"Return my robe!\"",
        "source": "T22n1425_011:0319b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是奪者，得一波夜提罪，是名別與合奪。",
        "translation": "Such a seizure is called a separate and combined seizure, which is a sin of one pāyattika.",
        "source": "T22n1425_011:0319b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合與合奪者，比丘一時與衣，後言：「盡還我衣來。」",
        "translation": "When a monk is jointly and severally robbed, he gives his robe one time and then says, \"Give back my robe as much as you can.\"",
        "source": "T22n1425_011:0319b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是奪者，得一波夜提。",
        "translation": "Such a taking will be punished by one pāyattika.",
        "source": "T22n1425_011:0319b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別與別奪者，比丘非一時與僧伽梨、與欝多羅僧、與安陀會，比丘漸奪：「還我僧伽梨、還我欝多羅僧、還我安陀會。」",
        "translation": "A monk who is separately and individually appropriated gives his saṃghāṭī, his uttarâsaṅga, and his undergarment not at the same time, and then he gradually appropriates them, saying, \"Give back my saṃghāṭī, give back my uttarâsaṅga, and give back my undergarment.\"",
        "source": "T22n1425_011:0319b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是索，得者，眾多波夜提。",
        "translation": "Whoever thus claims it and obtains it, he'll be among the many pratyekbuddhas.",
        "source": "T22n1425_011:0319b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘與比丘衣時，作是言：「汝住我邊者，當與汝衣。」",
        "translation": "If a monk gives a monk his robe, he says, \"If you stay near me, I'll give you my robe.\"",
        "source": "T22n1425_011:0319b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不住者，奪，無罪。",
        "translation": "If he doesn't stop there, he takes it, and it's no offense.",
        "source": "T22n1425_011:0319b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘與比丘衣時，作是言：「汝此處住者，當與。」",
        "translation": "If a monk gives a monk robes, he says, \"This is the place where you'll give them to him if you stay here.\"",
        "source": "T22n1425_011:0319b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不住者，奪，無罪。",
        "translation": "If he doesn't stop there, he'll take it, and it's no offense.",
        "source": "T22n1425_011:0319b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘與比丘衣，汝適我意者與，不適意還奪，無罪。",
        "translation": "If a monk gives a monk's robe and you give it to him as you see fit, and you take it away again if you don't, it's no offense.",
        "source": "T22n1425_011:0319b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為受經者與，不受經者還奪，無罪。",
        "translation": "If you give it to someone who accepts the sūtras and take it back from someone who doesn't accept the sūtras, it's no offense.",
        "source": "T22n1425_011:0319b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘賣衣未取直，若錢直未畢，若還取衣者，無罪。",
        "translation": "If a monk sells robes and doesn't take them directly, and if he takes the robes back before the money is paid, it's no offense.",
        "source": "T22n1425_011:0319b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘與共行弟子、依止弟子衣已，不可教誡，為折伏故奪，後折伏已還與，無罪。",
        "translation": "If a monk takes a robe from a fellow practitioner or a follower who's not admonishable and takes it for the purpose of subduing him and then returns it after subduing him, it's not a sin.",
        "source": "T22n1425_011:0319b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奪比丘衣者，尼薩耆波夜提。",
        "translation": "Someone who takes a monk's robe would be a nisaji pratyutpanna.",
        "source": "T22n1425_011:0319b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奪比丘尼衣者，偷蘭罪。",
        "translation": "Someone who robs a bhikṣuṇī will be guilty of stealing his or her robes.",
        "source": "T22n1425_011:0319b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奪式叉摩尼、沙彌、沙彌尼衣者，越毘尼罪。",
        "translation": "It's a transgression of vinaya to take the robe of a prince, novice, or novice.",
        "source": "T22n1425_011:0319b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至奪俗人衣者，越毘尼心悔，是故說。",
        "translation": "Even someone who takes a layman's robe would transgress the vinaya and repent, which is why it's called that.",
        "source": "T22n1425_011:0319b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛住舍衛城，四方各十二由旬內施僧雨浴衣，如《毘舍佉鹿母因緣》廣說。",
        "translation": "When the Buddha stayed in Śrāvastī, he gave saṃgha bathing robes for 12 leagues in each of the four directions, as explained in detail in the Vaiśākha Deer Mother Sutra.",
        "source": "T22n1425_011:0319c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次佛住憍薩羅國遊行時，有一摩訶羅比丘，下著雨衣上著安陀會，捉長柄掃篲掃地。",
        "translation": "Furthermore, when the Buddha was staying at Kośala and going on a procession, there was a monk named Mahārāja who was wearing a raincoat and an undergarment and had a long-handled broom sweeping the ground.",
        "source": "T22n1425_011:0319c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見已語諸比丘：「汝見是摩訶羅不？",
        "translation": "When the Buddha saw this, he said to the monks, \"Do you see this mahārā?",
        "source": "T22n1425_011:0319c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何顛倒著衣？」",
        "translation": "What is the mistaken attachment of clothing?\"",
        "source": "T22n1425_011:0319c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是摩訶羅見佛已，往到佛所，頭面禮足却住一面。",
        "translation": "After he saw the Buddha, Mahārāja went to him, bowed his head and feet, and withdrew to one side.",
        "source": "T22n1425_011:0319c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知而故問：「摩訶羅，汝下著何衣？」",
        "translation": "Knowing this, the Buddha therefore asked, \"Mahākāla, what are you wearing under your robe?\"",
        "source": "T22n1425_011:0319c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「雨衣。」",
        "translation": "He replied, \"My raincoat.\"",
        "source": "T22n1425_011:0319c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「上著何衣？」",
        "translation": "\"What kind of robe is it?\"",
        "source": "T22n1425_011:0319c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「安陀會。」",
        "translation": "He replied, \"Anda will meet.\"",
        "source": "T22n1425_011:0319c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「比丘！",
        "translation": "The Buddha said, \"Monks!",
        "source": "T22n1425_011:0319c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝云何應在上衣而反在下，下衣在上？",
        "translation": "Why should you put your upper robe on the bottom and your lower robe on the top?",
        "source": "T22n1425_011:0319c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今云何一切時受用雨衣？」",
        "translation": "Now, how do you receive the use of a raincoat at all times?\"",
        "source": "T22n1425_011:0319c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘：「汝等待如來從憍薩羅國遊行還舍衛城時，汝當語我：『當為諸比丘制雨浴衣。』」",
        "translation": "The Buddha said to the monks, \"When you wait for the Tathāgata to return to Śrāvastī from the procession in Kośala, you must say to me, 'Make raincoats for the monks.'\"",
        "source": "T22n1425_011:0319c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛憍薩羅國遊行還已，諸比丘白佛言：「世尊在憍薩羅國遊行時，作是言：『如來從憍薩羅國遊行還舍衛時，汝便語我：「當為諸比丘制雨浴衣。」』",
        "translation": "After the Buddha had returned from the procession in Kośala, the monks said to the Buddha, \"The Bhagavān said this during the procession in Kośala, 'When the Tathāgata returns to Śrāvastī from the procession in Kośala, then you'll say to me, 'Make raincoats for the monks.'",
        "source": "T22n1425_011:0319c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今正是時，願制雨衣。」",
        "translation": "Now is the right time to have raincoats made.\"",
        "source": "T22n1425_011:0319c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「依止舍衛城住者盡集，以十利故為諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The Buddha told the monks, \"Relying on the full gathering of those who live in Śrāvastī, make precepts for the monks because of the ten benefits, even for those who have heard them and will hear them again.",
        "source": "T22n1425_011:0319c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘春殘一月在，比丘當求雨衣，半月當作成受用。",
        "translation": "If a monk is present during the first month of the spring retreat, that monk will ask for a raincoat, and it will be ready for use for half a month.",
        "source": "T22n1425_011:0319c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘未至春殘一月求雨衣，半月作成受用者，尼薩耆波夜提。」",
        "translation": "If a monk asks for a raincoat before the first day of the spring retreat and makes it fit for use in the first half of the month, that monk will become a nisaji prāyaṇḍite.\"",
        "source": "T22n1425_011:0319c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "春殘一月者，三月後十五日、四月初十五日，是名春殘一月。",
        "translation": "The first day of spring, which is the fifteenth day after March and the fifteenth day after the beginning of April, is called the first day of spring.",
        "source": "T22n1425_011:0319c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雨衣者，如世尊所聽。",
        "translation": "\"Raincoat, as the Bhagavān has heard, is a garment.",
        "source": "T22n1425_011:0319c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣者，有十種，如上說。",
        "translation": "There are 10 kinds of robes, as explained above.",
        "source": "T22n1425_011:0319c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求者，乞索勸化。",
        "translation": "Those who ask for it are encouraged to solicit it.",
        "source": "T22n1425_011:0319c23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求時不應從小家處處求一尺二尺，應從殷有大家中求，若一人邊、若眾多人邊得，是名求。",
        "translation": "When they ask for them, they shouldn't ask for one foot or two feet from each place in a small household; they should ask for them from among the great and powerful, and if they can get them from one person or from many people, this is called asking for them.",
        "source": "T22n1425_011:0319c23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殘半月者，從三月十六日，應作浣染縫，至四月一日應受用。",
        "translation": "From the 16th day of March, he should make a sewing cloth that's dyed, and he should receive it by the first day of April.",
        "source": "T22n1425_011:0319c25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘未至求者，未至三月十六日前求，作成受用者，尼薩耆波夜提。",
        "translation": "If a monk who has yet to seek it does so before the 16th of March and makes it fit for use, that's rules for rules of forfeiture of the things that a monk seeks.",
        "source": "T22n1425_011:0319c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼薩耆波夜提者，如上說。",
        "translation": "This is called rules of forfeiture of the things that a monk wants to receive, as explained above.",
        "source": "T22n1425_011:0319c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘有五法成就僧應羯磨，作分雨衣人。",
        "translation": "There are five things a monk should do to accomplish the saṃgha's karman, making him a partaker of the raincoat.",
        "source": "T22n1425_011:0319c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T22n1425_011:0320a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不隨愛、不隨瞋、不隨怖、不隨癡、得不得知，是名五。",
        "translation": "Not following craving, not following anger, not following fear, not following delusion, and attaining unknowing are called the five.",
        "source": "T22n1425_011:0320a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羯磨人應作是說：「大德僧聽！",
        "translation": "The karman should say, \"Listen, great monks!",
        "source": "T22n1425_011:0320a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某甲比丘五法成就，若僧時到，僧拜某甲比丘作分雨衣人，白如是。」",
        "translation": "When the five qualities of a certain monk are accomplished, if the saṃgha's time comes, the saṃgha pays homage to that certain monk as the one who distributes the raincoat, saying, \"So it is.\"",
        "source": "T22n1425_011:0320a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德僧聽！",
        "translation": "\"Listen, great virtuous monks!",
        "source": "T22n1425_011:0320a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某甲比丘五法成就，僧今拜某甲比丘作分雨衣人。",
        "translation": "Now, the saṃgha pays homage to a certain monk who has accomplished five things, and he's made a partaker of the raincoat.",
        "source": "T22n1425_011:0320a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大德忍某甲比丘作分雨衣人，忍者僧默然，若不忍便說。」",
        "translation": "The great men tolerated that certain monk's role as a part-raincoat bearer, so the saṃgha was silent, and if they didn't tolerate it, then they said.\"",
        "source": "T22n1425_011:0320a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「僧已忍，拜某甲比丘作分雨衣人竟，僧忍默然故，是事如是持。」",
        "translation": "\"After tolerating it, the saṃgha paid homage to that certain monk as a partaker of the raincoat, and the saṃgha tolerated it and remained silent. This was thus maintained.\"",
        "source": "T22n1425_011:0320a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作羯磨已，應眾中唱言：「大德僧聽！",
        "translation": "After giving the ritual, he responded to the crowd by saying, \"Listen, great virtuous monks!",
        "source": "T22n1425_011:0320a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若衣有大小，降四指、八指不等不計者，我當分。」",
        "translation": "If there's a large or small garment, I'll share it with you if you lower it four or eight fingers, regardless of whether it's large or small.\"",
        "source": "T22n1425_011:0320a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不唱者，得越毘尼罪。",
        "translation": "If someone doesn't say this, they'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_011:0320a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人作羯磨已，當為僧求，求時不應從小家處處求一尺二尺，應從殷有大家中，若一人邊得、若眾多人邊得，下至得一雨衣是名求。",
        "translation": "After he makes the karma, that person should ask for it for the saṃgha. When they ask for it, they shouldn't ask for a foot or two from each place in a small family; they should ask for it from among the large and numerous families, whether it's obtained from one person or from many people, down to a single raincoat.",
        "source": "T22n1425_011:0320a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三月十六日已後送衣來者，應分。",
        "translation": "If someone brings in a robe after the 16th day of the third month, they should share it.",
        "source": "T22n1425_011:0320a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應語僧上座言：「為欲今取、為欲待後？",
        "translation": "You should say to the superior saṃgha, \"Do you want to get it now, or do you want to wait until later?",
        "source": "T22n1425_011:0320a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後或有勝者。」",
        "translation": "There may be someone who's better later.\"",
        "source": "T22n1425_011:0320a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上座若言：「今取。」",
        "translation": "If the superior seat says, \"Take it now!\"",
        "source": "T22n1425_011:0320a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便與。",
        "translation": "then he gives it to them.",
        "source": "T22n1425_011:0320a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「後取。」",
        "translation": "If he says, \"Take it later.\"",
        "source": "T22n1425_011:0320a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "待後應與。",
        "translation": "He'll give it to them later.",
        "source": "T22n1425_011:0320a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有客比丘者，應問：「汝欲何處夏安居？」",
        "translation": "If there's a visiting monk, he should ask, \"Where do you want to spend the summer retreat?\"",
        "source": "T22n1425_011:0320a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「此處。」",
        "translation": "If he says, \"Here.\"",
        "source": "T22n1425_011:0320a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應與。",
        "translation": "you should give it to him.",
        "source": "T22n1425_011:0320a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「我欲餘處安居，欲此處取雨衣。」",
        "translation": "If you say, \"I want to live somewhere else, and I want to get my raincoat here,\" you should also give it to him.",
        "source": "T22n1425_011:0320a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，亦應與。",
        "translation": "then you should also give it to him.",
        "source": "T22n1425_011:0320a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語言：「汝於餘處更莫取。」",
        "translation": "He said, \"Don't take it from another place.\"",
        "source": "T22n1425_011:0320a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「我不此間取，待安居處當取。」",
        "translation": "If he says, \"I won't take it here; I'll take it later at my place of refuge.\"",
        "source": "T22n1425_011:0320a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其意。",
        "translation": "Do as he wishes.",
        "source": "T22n1425_011:0320a20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若多得雨衣者，一人應與兩，沙彌，應與一。",
        "translation": "If he gets many raincoats, one person should give two, and a novice should give one.",
        "source": "T22n1425_011:0320a21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若少不周接者，安居訖分衣時，應偏與雨衣直，此衣不得受，當三衣不得作淨施。",
        "translation": "If he doesn't accept a small amount, then when he finishes laying out his robe, he should give his raincoat to one person, and he mustn't accept this robe; he mustn't make a pure gift when he's finished with the three garments.",
        "source": "T22n1425_011:0320a22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不得著雨衣入河中池中浴，不得小小雨時著。",
        "translation": "He mustn't wear the raincoat into a river or pond to bathe, or he mustn't wear it during a light rain.",
        "source": "T22n1425_011:0320a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "浴亦不得裸身，浴當著舍勒。",
        "translation": "He mustn't bathe naked either; he must wear a she-leaf when bathing.",
        "source": "T22n1425_011:0320a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若餘故衣，不得著雨衣種種作事，當須大雨時被浴。",
        "translation": "If there are other kinds of clothing, he mustn't do anything while wearing a raincoat, but he must bathe when it's raining heavily.",
        "source": "T22n1425_011:0320a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若雨卒止，垢液者，得著入餘水中浴，無罪。",
        "translation": "If the rain stops and the soiled liquid remains, he may wash while wearing it in other water, but it's not a sin.",
        "source": "T22n1425_011:0320a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘食時，欲以油塗身；若病時，若多人行處，得繫兩頭作障。",
        "translation": "If a monk wants to rub oil on his body when he's eating, or if he's ill or if there are many people walking around, he can bind his two heads together to make a barrier.",
        "source": "T22n1425_011:0320a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此雨浴衣得四月半受用，至八月十五日應當捨。",
        "translation": "This bathing robe may be used for the fourth and a half month, but it should be dispossessed by the eighth and fifteenth days.",
        "source": "T22n1425_011:0320a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨法者，一比丘應眾中作是唱：「大德僧聽！",
        "translation": "When he gives up the robe, a monk responds to the crowd by saying, \"Listen, great monks!",
        "source": "T22n1425_011:0320b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日僧捨雨浴衣。」",
        "translation": "Today, the saṃgha gave up their bathing suits in the rain.\"",
        "source": "T22n1425_011:0320b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三說。",
        "translation": "These three things are explained like this.",
        "source": "T22n1425_011:0320b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若至十六日捨者，得越毘尼罪。",
        "translation": "If someone does so until the 16th day, they'll be caught in the transgression of vinaya.",
        "source": "T22n1425_011:0320b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨已，得用作三衣，亦得知識比丘邊作淨，亦得入餘水中浴，種種著作，無罪。",
        "translation": "After he does so, he'll be able to use it as three robes, and he'll be able to purify himself by learning to know the monks, and he'll be able to bathe in other waters and perform various works, which are not a sin.",
        "source": "T22n1425_011:0320b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說。",
        "translation": "Therefore, it's said.",
        "source": "T22n1425_011:0320b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛住舍衛城，廣說如上。",
        "translation": "The Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_011:0320b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者難陀、優波難陀持縷入居士家，語優婆夷言：「施我縷。」",
        "translation": "It was then that Venerable Nanda and Upananda entered the house of a householder with thread and said to the upāsikā, \"Give me thread.\"",
        "source": "T22n1425_011:0320b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士婦女作是念：「此比丘欲買縷。」",
        "translation": "The householder women thought, 'That monk wants to buy thread.'",
        "source": "T22n1425_011:0320b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各持縷出。",
        "translation": "Each took the thread and left.",
        "source": "T22n1425_011:0320b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘見已，即取比己縷而作是言：「我正欲求此縷比，今得相似。」",
        "translation": "When the monk sees this, he takes the thread and says, \"I was hoping to find this thread, but now I've gotten a likeness.\"",
        "source": "T22n1425_011:0320b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見好者，便作是言：「我欲求此比而更得勝者。」",
        "translation": "If he sees something nice, he then says, \"I want to seek this ratio and get more of it.\"",
        "source": "T22n1425_011:0320b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見麁者便作是言：「此縷雖麁可作好者。」",
        "translation": "If he sees something crude, then he says, 'This thread, though crude, will make a good one.'",
        "source": "T22n1425_011:0320b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因如是齎縷來者，都無得脫。",
        "translation": "Because of this, no one who carries threads here will ever be freed.",
        "source": "T22n1425_011:0320b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重擔而來，去祇洹精舍不遠有一窮巷，在中起織坊，度織師出家，使織衣。",
        "translation": "They come bearing a heavy load, and not far from the Jetavana monastery there's a poor alleyway where they build a weaving mill and send a weaver home to weave clothes.",
        "source": "T22n1425_011:0320b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者阿難到時，著入聚落衣，持鉢次行乞食，到其門前。",
        "translation": "When Venerable Ānanda arrived, he put on the robe of a village, took his bowl and went begging for food, and reached his door.",
        "source": "T22n1425_011:0320b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見難陀、優波難陀，捉線丸共張[疊*毛]經，見已共相問訊，阿難問言：「長老作何等？」",
        "translation": "When he saw Nanda and Upananda holding a ball of thread and spreading [a pile of *hair] sūtra together, they exchanged greetings, and Ānanda asked, \"Elder, what's going on?\"",
        "source": "T22n1425_011:0320b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「欲織衣。」",
        "translation": "He replied, \"I want to weave a garment.\"",
        "source": "T22n1425_011:0320b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即念言：「我今日見侍者阿難，必語世尊，當作方便。」",
        "translation": "They then thought, \"Today, when I see Venerable Ānanda, I'll tell the Bhagavān that I'll make it a convenience.\"",
        "source": "T22n1425_011:0320b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即持線丸與尊者阿難：「可持縫衣。」",
        "translation": "He then took the ball of thread and gave it to Venerable Ānanda, \"You may take it and sew your robe.\"",
        "source": "T22n1425_011:0320b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難不取。",
        "translation": "Ānanda didn't take them.",
        "source": "T22n1425_011:0320b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食後以上因緣，廣白世尊。",
        "translation": "After he ate them, he explained the above cause and conditions to the Bhagavān.",
        "source": "T22n1425_011:0320b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「呼難陀、優波難陀來。」",
        "translation": "The Buddha said, \"Call Nanda and Upananda to come.\"",
        "source": "T22n1425_011:0320b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "來已，佛問優波難陀：「如上事，乃至阿難不受汝線，汝實爾不？」",
        "translation": "After he came, the Buddha asked Upananda, \"Is it true that you did the above, even though Ānanda didn't accept your thread?\"",
        "source": "T22n1425_011:0320b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, \"It's true.\"",
        "source": "T22n1425_011:0320b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此是惡事。",
        "translation": "The Buddha said, \"This is a bad thing.",
        "source": "T22n1425_011:0320b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝不聞，我無數方便讚歎少欲、毀呰多欲？",
        "translation": "Haven't you heard that I have countless ways to praise few desires and disparage many desires?",
        "source": "T22n1425_011:0320b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此非法、非律、不如佛教，不可以是長養善法。」",
        "translation": "This is not legal, not legal, and not Buddhist, and it can't be a good way to nurture good qualities.\"",
        "source": "T22n1425_011:0320b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「依止舍衛城住者盡集，以十利故與諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The Buddha told the monks, \"Those who rely on the city of Śrāvastī to gather as many as possible will be given the precepts for the sake of the ten benefits, even if those who have heard them will hear them again.",
        "source": "T22n1425_011:0320b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘自行乞縷，使織師織作衣者，尼薩耆波夜提。」",
        "translation": "If a monk begs for thread on his own and has a weaver weave it into a garment, that's rules for Nisajṃpati.\"",
        "source": "T22n1425_011:0320b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘者，如上說。",
        "translation": "A monk, as explained above.",
        "source": "T22n1425_011:0320b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自乞者，勸化索，或一兩、二兩。",
        "translation": "A monk who begs for it himself is encouraged to ask for one or two taels of thread.",
        "source": "T22n1425_011:0320b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縷者，七種縷。",
        "translation": "A thread is seven kinds of thread.",
        "source": "T22n1425_011:0320b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師者，今毘提波晝俱利織師。",
        "translation": "A weaver is the present-day Vaidehīputrīya weaver.",
        "source": "T22n1425_011:0320c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織作衣者，尼薩耆波夜提。",
        "translation": "That person who weaves robes is rules of forfeiture for rules of forfeiture for nisajipāyatti.",
        "source": "T22n1425_011:0320c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼薩耆波夜提者，如上說。",
        "translation": "Nisargipāyati is as explained above.",
        "source": "T22n1425_011:0320c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘自行乞縷，越毘尼心悔。",
        "translation": "If a monk begs for thread on his own, he transgresses the vinaya and repents.",
        "source": "T22n1425_011:0320c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得者，越毘尼罪。",
        "translation": "If he does, it's a transgression of the vinaya.",
        "source": "T22n1425_011:0320c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織成者，尼薩耆波夜提。",
        "translation": "When the fabric is complete, it's rules of forfeiture of the things that a monk buys.",
        "source": "T22n1425_011:0320c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦尸國土法，比丘安居竟，與縷與織直。",
        "translation": "According to the rules of the land of Kāsi, after a monk settles down, he gives it to them to weave thread and straighten it.",
        "source": "T22n1425_011:0320c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘欲織[疊*毛]時，應語織師，作是言：「與汝此縷，為我知織[疊*毛]。」",
        "translation": "When a monk wants to weave [pile*hair], he should say to the weaver, \"Give you this thread, for I know how to weave [pile*hair].\"",
        "source": "T22n1425_011:0320c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師答言：「尊者！",
        "translation": "The weaver replies, \"Venerable!",
        "source": "T22n1425_011:0320c06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不解此語？」",
        "translation": "Do I not understand this statement?\"",
        "source": "T22n1425_011:0320c07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：「汝家作何等業？」",
        "translation": "You should ask, \"What kind of activity does your family do?\"",
        "source": "T22n1425_011:0320c07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「織[疊*毛]。」",
        "translation": "He replied, \"Weave [a bundle of] wool.\"",
        "source": "T22n1425_011:0320c08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便語言：「汝可為我知織[疊*毛]？」",
        "translation": "Then he said, \"Can you know how to weave [a pile of *hair] for me?\"",
        "source": "T22n1425_011:0320c08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不解此語者，應持線與淨人，令知織，一切不得作雇織語。",
        "translation": "If he doesn't understand this statement, he should take a thread and give it to a clean person who knows how to weave it; he mustn't say anything to hire someone to weave it.",
        "source": "T22n1425_011:0320c08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘知織腰帶，欲使比丘織者，應持線與，作是言：「長老！",
        "translation": "If a monk knows how to weave a belt and wants to make a monk weave it, he should take the thread and give it to him, saying, \"Elder!",
        "source": "T22n1425_011:0320c10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我作帶。」",
        "translation": "Make a belt for me.\"",
        "source": "T22n1425_011:0320c11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說。",
        "translation": "Therefore, it's said.",
        "source": "T22n1425_011:0320c11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛住舍衛城祇洹精舍，爾時毘舍佉鹿母常日日眾僧中請食。",
        "translation": "When the Buddha was staying at the Jetavana monastery in Śrāvastī, the mother of the Vaiśākha deer used to invite the saṃgha to eat every day.",
        "source": "T22n1425_011:0320c12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有比丘次到其家食，見毘舍佉鹿母持縷與織師，語言：「汝為我織[疊*毛]，欲施尊者難陀、優波難陀。",
        "translation": "When a monk next came to his house to eat, he saw the mother of the Vaiśākha deer carrying thread to the weaver and said, \"Weave [a pile of *wool] for me that I want to give to Venerable Nandana and Upananda.",
        "source": "T22n1425_011:0320c13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人難可，汝當為好織。」",
        "translation": "It's difficult for them to do so; you must weave it well for them.\"",
        "source": "T22n1425_011:0320c15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘食已，還精舍，語難陀言：「長老！",
        "translation": "After he had eaten, the monk returned to the monastery and said to Nandananda, \"Elder!",
        "source": "T22n1425_011:0320c16_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲語汝好事。」",
        "translation": "I want to tell you something good.\"",
        "source": "T22n1425_011:0320c17_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：「有何好事？」",
        "translation": "He asked, \"What's good?\"",
        "source": "T22n1425_011:0320c17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我見毘舍佉鹿母欲施汝衣。」",
        "translation": "He replied, \"I saw the mother of the Vaiśākha deer and wanted to give you clothing.\"",
        "source": "T22n1425_011:0320c17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「此不施我衣。",
        "translation": "He replied, \"She won't give me clothing.",
        "source": "T22n1425_011:0320c18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T22n1425_011:0320c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此優婆夷當施賢聖。」",
        "translation": "This Upāsikā will give alms to the noble ones.\"",
        "source": "T22n1425_011:0320c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復言：「不爾，我眼見毘佉舍鹿母，以縷與織師，作是言：『與汝此縷，為我好織作[疊*毛]，欲施難陀，彼人難可。』」",
        "translation": "Again, he said, \"No, I've seen the deer mother Vikāśāsana give thread to a weaver and say, 'Here, I want to give you this thread to make [piles of *hair] for me, but it's difficult for that person to give it to Nandāna.'\"",
        "source": "T22n1425_011:0320c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：「汝知織師家處不？」",
        "translation": "He asked, \"Do you know where the weaver lives?\"",
        "source": "T22n1425_011:0320c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「知處。」",
        "translation": "He replied, \"I know where it is.\"",
        "source": "T22n1425_011:0320c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即復問言：「彼家在何處？",
        "translation": "He then asked again, \"Where is his home?",
        "source": "T22n1425_011:0320c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何巷陌？",
        "translation": "what street?",
        "source": "T22n1425_011:0320c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門戶那向？",
        "translation": "the door facing that way?",
        "source": "T22n1425_011:0320c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示我標相。」",
        "translation": "Show me my mark.\"",
        "source": "T22n1425_011:0320c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具問知處已，明日著入聚落衣，往到其家。",
        "translation": "After he had fully inquired about his place, he put on his robe and went to his house tomorrow.",
        "source": "T22n1425_011:0320c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見織師張經，見已問織師言：「長壽！",
        "translation": "He saw a weaver who was spreading sūtras, and when he saw him, he asked the weaver, \"Long life!",
        "source": "T22n1425_011:0320c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為誰張經？」",
        "translation": "For whom does the scripture open?\"",
        "source": "T22n1425_011:0320c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我為鹿母毘舍佉張經。」",
        "translation": "He answered, \"I'll read the Vaiśākha-sūtra for the deer mother.\"",
        "source": "T22n1425_011:0320c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問言：「汝知不？",
        "translation": "Again, he asked, \"Do you know it?",
        "source": "T22n1425_011:0320c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此為誰作？」",
        "translation": "Who made this?\"",
        "source": "T22n1425_011:0320c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我知為難陀、優波難陀。」",
        "translation": "He answered, \"I know him as Nandha or Upananda.\"",
        "source": "T22n1425_011:0320c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問：「汝識難陀不？」",
        "translation": "Again, he asked, \"Do you know Nandananda?\"",
        "source": "T22n1425_011:0320c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我不識。」",
        "translation": "He replied, \"I don't know.\"",
        "source": "T22n1425_011:0320c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便語言：「難陀、優波難陀正我等是，汝當好作長廣細緻織。」",
        "translation": "Even then, he said, \"Nanda, Upananda, this is really us, so you must skillfully weave a long, wide, and delicate fabric.\"",
        "source": "T22n1425_011:0320c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師答言：「縷自有限、量亦已定，我能無緯織耶？」",
        "translation": "The weaver replied, \"The threads themselves are limited, and their amount has been determined; can I weave without weft?\"",
        "source": "T22n1425_011:0321a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即復言：「汝但如我語好作，彼家大富，自當更與汝縷。」",
        "translation": "He then replied, \"If you do as I say and work well, that family will become very wealthy and will give you more thread.\"",
        "source": "T22n1425_011:0321a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師復言：「彼家與我縷，作直誰當與我？」",
        "translation": "The weaver then replied, \"If that family gives me thread, who will give it to me if I work it straight?\"",
        "source": "T22n1425_011:0321a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即言：「汝但好織，織作直我當與汝。」",
        "translation": "He said, \"Just knit well, and I'll give it to you if you make it straight.\"",
        "source": "T22n1425_011:0321a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師言：「若尊者與我織作直，彼復足我縷者，當如教織。」",
        "translation": "The weaver said, \"If the venerable gives me a straight weave, then he'll teach me to weave like this.\"",
        "source": "T22n1425_011:0321a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師即為好織。",
        "translation": "The weaver then did a good job of weaving.",
        "source": "T22n1425_011:0321a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縷盡復往索，如是三索。",
        "translation": "When the threads are finished, he then proceeds to weave them, and so on for three times.",
        "source": "T22n1425_011:0321a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍佉鹿母念言：「此人但來索縷、不求作直，我何以不足與縷？」",
        "translation": "The Vaiśākha deer mother thought, \"This person only came to ask for thread and didn't seek to make it straight, so why wouldn't I have enough thread?\"",
        "source": "T22n1425_011:0321a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與縷織成，廣長細好，送與鹿母。",
        "translation": "He wove it together with thread, making it long and wide, and fine, and gave it to the mother of deer.",
        "source": "T22n1425_011:0321a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹿母取已作是言：「此是好[疊*毛]，不應與彼是重供養；雖然，本為其作。」",
        "translation": "After she took it, the deer mother said, \"This is a good [pile*of hair]; I shouldn't have given it to them as a heavy offering, even though it was originally made for them.\"",
        "source": "T22n1425_011:0321a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便送與。",
        "translation": "He even gave it to her.",
        "source": "T22n1425_011:0321a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀[疊*毛]未成時，日日到織師家。",
        "translation": "Every day, Nanda went to the weaver's house before [the pile of hair] was made.",
        "source": "T22n1425_011:0321a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得[疊*毛]已，遠離其舍異巷而行，譬如老烏遠離射方。",
        "translation": "After he got [pile*hair], he left his house and traveled down a different road, like an old crow far from a shooting range.",
        "source": "T22n1425_011:0321a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師作務多，不得來索作直。",
        "translation": "The weaver had a lot of work to do, so he couldn't come to ask for a straight [pile of hair].",
        "source": "T22n1425_011:0321a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後織師營署率會來到舍衛城，織師爾時便作是念：「眾人未集，我今可往索織直。」",
        "translation": "When the weaver's office led an assembly to Śrāvastī, the weaver then thought, \"Now, before the crowd gathers, I can go and get something straight to weave.\"",
        "source": "T22n1425_011:0321a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故往祇洹，到已問諸比丘：「難陀、優波難陀在何處住？」",
        "translation": "He therefore went to Giphan and asked the monks when he arrived, \"Where are Nanda and Upananda staying?\"",
        "source": "T22n1425_011:0321a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘語言：「是處房中。」",
        "translation": "The monk said, \"This is the place in the monk's room.\"",
        "source": "T22n1425_011:0321a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即入房中，見已禮足問訊。",
        "translation": "He went into the monk's room, saluted his feet when he saw him, and exchanged greetings.",
        "source": "T22n1425_011:0321a17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佯不識，如未曾相見。",
        "translation": "He pretends not to recognize them, as if they've never met before.",
        "source": "T22n1425_011:0321a17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即問言：「尊者得[疊*毛]未？」",
        "translation": "He then asked, \"Has the venerable obtained [a tuft of *hair] yet?\"",
        "source": "T22n1425_011:0321a18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "反問言：「何等[疊*毛]？」",
        "translation": "He asked in return, \"What kind of [tuft of *hair]?\"",
        "source": "T22n1425_011:0321a18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我為鹿母織者。」",
        "translation": "He answered, \"I'm a deer weaver, Mother of Deer.\"",
        "source": "T22n1425_011:0321a19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「得。」",
        "translation": "He answered, \"Yes.\"",
        "source": "T22n1425_011:0321a19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：「[疊*毛]為稱尊者意不？」",
        "translation": "He asked, \"[Pile*hair] is that what the venerable wants to be called?\"",
        "source": "T22n1425_011:0321a19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「為復可耳。」",
        "translation": "He replied, \"That's quite alright.\"",
        "source": "T22n1425_011:0321a20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便言：「阿闍梨當與我織價。」",
        "translation": "He then said, \"The Ajari will give me a price to weave.\"",
        "source": "T22n1425_011:0321a20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：「何等織價？」",
        "translation": "He asked, \"What's the price of weaving?\"",
        "source": "T22n1425_011:0321a21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「乃至優婆夷足縷，許與我織作直。」",
        "translation": "He replied, \"Even Upāsikā Prabhūtā allowed me to weave it straight.\"",
        "source": "T22n1425_011:0321a21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即瞋恚言：「如是，如是！",
        "translation": "They then angrily said, \"So it is, so it is!",
        "source": "T22n1425_011:0321a22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子賜穀物，汝識難陀、優波難陀不？",
        "translation": "Do you know Nanda or Upananda, whom your son has given grain?",
        "source": "T22n1425_011:0321a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲拔汝眼睫取虛空中烟，我欲五指撮取淨。",
        "translation": "I want to pluck your eyelashes and obtain smoke from the sky, and I want to pick them up with my five fingers to purify them.",
        "source": "T22n1425_011:0321a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "洗釜已欲望故得多食，裸形外道猶欲剝取兩張[疊*毛]，於死老烏足上望剝取五百兩肉。",
        "translation": "After washing the cauldron, I want to get more food because of my desire, while a naked non-Buddhist still wants to strip off two [stacks*of hair], and I want to strip off five hundred taels of flesh from the feet of a dead old crow.",
        "source": "T22n1425_011:0321a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一把糠散恒水漩淵中，欲收歛取如是等處求物，況復汝望得我物！」",
        "translation": "With a handful of chaff scattered in a swirling abyss of constant water, I want to gather up and seek goods from such a place, so why would you want to obtain my goods?\"",
        "source": "T22n1425_011:0321a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語弟子言：「汝取我僧伽梨來，我欲著詣王家，呼人來縛取此人付官。」",
        "translation": "He then said to his disciple, \"Bring me my saṃghāṭī, for I want to put it on and go to the king's house, call someone to come and bind him and take him to the officer.\"",
        "source": "T22n1425_011:0321a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師作是念：「此沙門有大身力，又出入王家，必能為我作不饒益事。",
        "translation": "The master of the cloth thought, \"This ascetic has great physical strength and goes to and from the king's house; he surely will be able to do something unbeneficial for me.",
        "source": "T22n1425_011:0321b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用是作直為？",
        "translation": "How can he do this for me?",
        "source": "T22n1425_011:0321b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但得活命去。」",
        "translation": "Only to go away alive.\"",
        "source": "T22n1425_011:0321b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "怖畏却行出戶。",
        "translation": "They were afraid, but they left their homes.",
        "source": "T22n1425_011:0321b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "走到率會人中，彼眾人嫌言：「我等各各廢家事，到此間共料理官事。",
        "translation": "When they reached the assembly, they disliked him, saying, \"We each abandoned our family business and came here to take care of official business together.",
        "source": "T22n1425_011:0321b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今云何妨廢眾人？」",
        "translation": "What's the harm you're doing to all of us?\"",
        "source": "T22n1425_011:0321b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即答言：「汝聽鹿母與我縷織[疊*毛]。",
        "translation": "He then answered, \"You've heard the mother of deer weave [pile*hair] with me.",
        "source": "T22n1425_011:0321b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀、優波難陀，乃至[疊*毛]未成時日日來。",
        "translation": "Nanda, Upananda, even [that pile of hair] comes day by day before it's complete.",
        "source": "T22n1425_011:0321b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得[疊*毛]已，猶如老烏遠於射方，乃至思惟但得活命，廣說上事，是故來晚耳。」",
        "translation": "After they obtain [the pile of hair], they're like an old crow that's far away from the archery range and even thinks about just getting a living, explaining the above things in detail; that's why they're late.\"",
        "source": "T22n1425_011:0321b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾人即瞋恚言：「此比丘輕易我等不與作直，而反欲使王力縛人，我等今日當作制限，後更不復為沙門織[疊*毛]。」",
        "translation": "The crowd then became angry and said, \"This monk makes it easy for us not to work straight with him, but instead he wants to bind people by the king's power; today, we'll set a limit, and then we won't work for the ascetics again to weave [piles of hair].\"",
        "source": "T22n1425_011:0321b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「我等當在隱處共作制限，莫使人知。",
        "translation": "Some people said, \"We'll work together to set a limit in a secluded place so that no one knows about it.",
        "source": "T22n1425_011:0321b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我知沙門衣量，長五肘、廣三肘，長五肘、廣二肘，如是衣量不得織。",
        "translation": "I know the monk's robe is five elbows long and three elbows wide, and five elbows long and two elbows wide, and such a measure of robe can't be woven.",
        "source": "T22n1425_011:0321b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼人知者，此沙門有力，能使王家以力使人，乃至能為人作不饒益事，莫使人知。」",
        "translation": "If someone knows that, that ascetic is powerful and can cause a king's household to use its power to subjugate others, even to the point of doing unbeneficial things for others, so don't let them know.\"",
        "source": "T22n1425_011:0321b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到受歲時，眾人擔縷來詣織師所，欲雇織師織。",
        "translation": "When it was time to receive the year, a crowd of people carrying threads came to the weaver's office, wanting to hire a weaver to weave them.",
        "source": "T22n1425_011:0321b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師問言：「汝欲作何等量衣？」",
        "translation": "The weaver asked, \"What sort of garment do you want to make?\"",
        "source": "T22n1425_011:0321b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「長五肘、廣三肘，長五肘。",
        "translation": "He replied, \"It's five elbows long and three elbows wide.",
        "source": "T22n1425_011:0321b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣二肘。」",
        "translation": "It's two elbows wide.\"",
        "source": "T22n1425_011:0321b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師念言：「此是沙門衣量。」",
        "translation": "The weaver thought, \"This is the monk's measure of clothing.\"",
        "source": "T22n1425_011:0321b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即答言：「我已為人織，不復得作。」",
        "translation": "He then replied, \"I've already knitted it for someone, and I won't be able to make it again.\"",
        "source": "T22n1425_011:0321b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是遍問，都無織者。",
        "translation": "He asked them all about it, but there was no knitter.",
        "source": "T22n1425_011:0321b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸富貴家即取家中成織[疊*毛]施僧，諸貧人等先無成織者無衣施僧，爾時僧得布施衣少。",
        "translation": "The wealthy families then took the [pile*hair] of fabric they had at home and gave it to the saṃgha, but the poor people who hadn't done any weaving before had no clothes to give to the saṃgha, and the saṃgha then had few robes to give.",
        "source": "T22n1425_011:0321b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知而故問：「阿難！",
        "translation": "Knowing this, the Buddha therefore asked, \"Ānanda!",
        "source": "T22n1425_011:0321b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧何以得布施衣少？」",
        "translation": "How did the saṃgha come to have so few robes to give?\"",
        "source": "T22n1425_011:0321b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難即以上事，乃至織師發不喜心，共作要命，具白世尊。",
        "translation": "Ānanda then did the above, and even the weaver became unhappy and shared his important instructions with the Bhagavān.",
        "source": "T22n1425_011:0321b23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「呼難陀來。」",
        "translation": "The Buddha said, \"Call Nanda to come.\"",
        "source": "T22n1425_011:0321b24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "來已，佛具問難陀、優波難陀：「汝等實爾不？」",
        "translation": "After he came, the Buddha specifically asked Nandha and Upananda, \"Is that true, you two?\"",
        "source": "T22n1425_011:0321b24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "They replied, \"That's true.",
        "source": "T22n1425_011:0321b25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T22n1425_011:0321b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此是惡事。",
        "translation": "The Buddha said, \"This is a bad thing.",
        "source": "T22n1425_011:0321b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝常不聞我讚歎少欲、毀呰多欲耶？」",
        "translation": "Don't you always hear me praise few desires and disparage many desires?\"",
        "source": "T22n1425_011:0321b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「依止舍衛城者皆悉令集，以十利故與諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The Buddha told the monks, \"He asked them to gather all those who rely on Śrāvastī and to give the monks the precepts for the sake of the ten benefits, even to the point that those who have heard them will hear them again.",
        "source": "T22n1425_011:0321b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若居士、居士婦使織師為比丘織作衣。",
        "translation": "Suppose a householder or householder's wife asks a weaver to weave a monk's robe.",
        "source": "T22n1425_011:0321c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘先不請，便往勸織師言：『汝知不？",
        "translation": "That monk doesn't ask them to do so, but then he goes to the weaver and encourages him, saying, 'Do you know that?'",
        "source": "T22n1425_011:0321c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此衣為我作，汝當好織，令緻長廣，當與汝錢、錢直，食、食直。』",
        "translation": "'This robe was made for me; you must weave it well and make it long and wide, and I will give you money, money straight, and food straight.'",
        "source": "T22n1425_011:0321c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘如是勸與錢、錢直，食、食直，得衣者，尼薩耆波夜提。」",
        "translation": "A monk who thus encourages the giving of money, straight money, and straight food and drink and who obtains the robe is a nisaji-vātyādin.\"",
        "source": "T22n1425_011:0321c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士者，家主。",
        "translation": "A householder is the head of the household.",
        "source": "T22n1425_011:0321c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦者，家主婦。",
        "translation": "A woman is the head of the household.",
        "source": "T22n1425_011:0321c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為比丘者，若僧、若眾多人、若一人。",
        "translation": "He's a monk, if it's a saṃgha, if it's a multitude of people, or if it's just one person.",
        "source": "T22n1425_011:0321c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師者，如上說。",
        "translation": "A weaver, as explained above.",
        "source": "T22n1425_011:0321c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣者，十種，如上說。",
        "translation": "For robes, there are ten kinds, as explained above.",
        "source": "T22n1425_011:0321c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先不請者，本不請謂請想，請餘人謂己想，請與餘物謂衣想。",
        "translation": "Those who don't ask for it first are called those who think of asking for it, those who ask others are called their own thoughts, and those who ask for and give other things are called thoughts of clothing.",
        "source": "T22n1425_011:0321c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便往者，往田中、家中。",
        "translation": "Those who go there directly are those who go to their fields or homes.",
        "source": "T22n1425_011:0321c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸者，語令細緻、若長廣。",
        "translation": "He encourages them, telling them to be subtle and to think long and wide.",
        "source": "T22n1425_011:0321c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "錢者，種種錢。",
        "translation": "Money\" refers to various kinds of money.",
        "source": "T22n1425_011:0321c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "錢直者，餘物。",
        "translation": "Money that's straight is other things.",
        "source": "T22n1425_011:0321c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食者，麨飯、麥飯、魚肉食。",
        "translation": "Food is rice, wheat, and fish.",
        "source": "T22n1425_011:0321c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直者，錢物。",
        "translation": "This is straight, monetary goods.",
        "source": "T22n1425_011:0321c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得衣者，尼薩耆波夜提。",
        "translation": "Someone who has obtained clothing will be called a nisaji-prāyatti.",
        "source": "T22n1425_011:0321c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼薩耆波夜提者，如上說。",
        "translation": "Nisajipāyati is as explained above.",
        "source": "T22n1425_011:0321c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘語織師言：「與我好織堅織緻打。」",
        "translation": "Suppose a monk says to a weaver, \"Give me a good, strong weave that's made of tough fabric.\"",
        "source": "T22n1425_011:0321c12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語時，越毘尼罪。",
        "translation": "When he says that, it's a transgression of the vinaya.",
        "source": "T22n1425_011:0321c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "織師下手打織時，下下，波夜提。",
        "translation": "When the weaver lays hands on the fabric, it's a lower-down pāyattika.",
        "source": "T22n1425_011:0321c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作成得者，尼薩耆波夜提。",
        "translation": "When he completes it, it's a nisaji pāyattika.",
        "source": "T22n1425_011:0321c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘與織師說法，織師手支頤住聽，比丘語織師言：「此應耳聽，不應手聽，手可並作。」",
        "translation": "If a monk and a weaver are speaking, and the weaver stands with his hands hunched over and listens, the monk says to the weaver, \"This should be heard with the ears, not with the hands; the hands can work together.\"",
        "source": "T22n1425_011:0321c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語時，得越毘尼罪。",
        "translation": "When he says that, he commits the transgression of vinaya.",
        "source": "T22n1425_011:0321c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘聞為作衣，往勸不許價，得衣，越比尼罪。",
        "translation": "If a monk hears about the making of a garment and goes to the weaver to persuade him not to accept the price, he obtains the garment, which is a transgression of the vinaya.",
        "source": "T22n1425_011:0321c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞而往勸，亦許直，得衣者，尼薩耆波夜提。",
        "translation": "If he hears about it and goes to the suggestion and agrees to pay for it, he'll be considered a nisaji-prātimokṣa.",
        "source": "T22n1425_011:0321c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不聞而往勸，自與，得衣者，越毘尼罪。",
        "translation": "If he doesn't hear about it and goes to the suggestion and gives it to himself, he's transgressing the vinaya offense.",
        "source": "T22n1425_011:0321c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不聞不勸亦不與直，得衣者，無罪。",
        "translation": "If someone doesn't hear it, doesn't encourage it, and doesn't give it directly, they'll be blameless if they obtain the robe.",
        "source": "T22n1425_011:0321c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若寡婦施眾僧衣，比丘若僧中次第應得此衣，婦人語比丘言：「我家無人，尊者可到織師所經營此衣。",
        "translation": "If a widow gives clothing to the saṃgha and a monk takes his place among the saṃgha, the woman says to the monk, \"There's no one in my house, so you can go to the weaver's shop and fix this clothing.",
        "source": "T22n1425_011:0321c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者若自能往料理者，可得疾成，亦可得好。」",
        "translation": "If you yourself can go to the weaver and take care of it, it will be finished quickly and will be good.\"",
        "source": "T22n1425_011:0321c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘爾時得往織師所，作如是言：「長壽！",
        "translation": "The monk then was able to go to the weaver's shop and said, \"Long life!",
        "source": "T22n1425_011:0321c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝知疾織、知緻織。」",
        "translation": "You know how to weave quickly and how to weave delicately.\"",
        "source": "T22n1425_011:0321c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語者無罪。",
        "translation": "Anyone who says that is not guilty.",
        "source": "T22n1425_011:0321c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說。",
        "translation": "That's why it's said.",
        "source": "T22n1425_011:0321c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛住舍衛城，廣說如上。",
        "translation": "The Buddha was staying in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_011:0321c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘在一聚落夏安居，初安居時，晨朝著入聚落衣，捉紙筆入聚落中，語諸優婆塞言：「汝等和義與我夏安居衣。」",
        "translation": "When six groups of monks were first settled in a village for the summer retreat, they put on their retreat robes in the early morning, grabbed a paper pencil, and went into the village, saying to the upāsaka, \"You monks, you're giving me summer retreat robes.\"",
        "source": "T22n1425_011:0321c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸優婆塞言：「非索安居衣時，待至秋穀熟。",
        "translation": "The upāsaka said, 'When I don't gather my summer retreat robes, I'll wait until the autumn harvest is ripe.'",
        "source": "T22n1425_011:0322a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸人多有歡欣心，當施衣。」",
        "translation": "At that point, many of you will be happy and will give the robe.\"",
        "source": "T22n1425_011:0322a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘言：「汝不知世間多有諸難，若王、水、火、盜賊難，或為汝父母所遮，不得布施。",
        "translation": "The six groups of monks said, \"Don't you know that there are many difficulties in the world, such as those of the king, water, fire, thieves, or the obstruction of your parents, which prevents you from giving alms?",
        "source": "T22n1425_011:0322a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝便不成功德，我則失利。」",
        "translation": "You then won't succeed in your virtue, and I'll lose out.\"",
        "source": "T22n1425_011:0322a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優婆塞言：「尊者！",
        "translation": "The upāsaka said, \"Venerable!",
        "source": "T22n1425_011:0322a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但示我諸難，而自不見諸難。",
        "translation": "He simply shows me the difficulties, but he doesn't see them himself.",
        "source": "T22n1425_011:0322a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者得安居錢已，欲罷道、欲餘行去耶？",
        "translation": "Having obtained the money to live in peace, does your Holiness want to stop the path and go on to other practices?",
        "source": "T22n1425_011:0322a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以多欲貪求？",
        "translation": "Why do you have so many desires and cravings?",
        "source": "T22n1425_011:0322a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是何道之有？」",
        "translation": "What path is there in this?\"",
        "source": "T22n1425_011:0322a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘聞已，即以上事具白世尊。",
        "translation": "After the monks heard this, they all told the Bhagavān about the above.",
        "source": "T22n1425_011:0322a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「呼六群比丘來。」",
        "translation": "The Buddha said, \"Call the six groups of monks to come.\"",
        "source": "T22n1425_011:0322a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "來已，佛問六群比丘：「汝實初安居時，從諸優婆塞索安居衣，為諸優婆塞呵責耶？」",
        "translation": "When he arrived, the Buddha asked the six groups of monks, \"Did you really ask the laymen for their robes when you first settled down and were rebuked by the laymen?\"",
        "source": "T22n1425_011:0322a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, \"That's true.\"",
        "source": "T22n1425_011:0322a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「此是惡事，安居未訖，而先求衣。",
        "translation": "The Buddha told the monk, \"This is a bad thing, asking for clothing before finishing your retreat.",
        "source": "T22n1425_011:0322a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今日安居未訖，不得先求安居衣。」",
        "translation": "From now on, you mustn't first ask for clothing for settling down before finishing your retreat.\"",
        "source": "T22n1425_011:0322a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次佛住舍衛城，爾時波斯匿王大臣名彌尼剎利叛逆，王遣一大臣名仙人達多往討伐之。",
        "translation": "Again, while the Buddha was staying in Śrāvastī, a minister of King Prasenajit named Minisari rebelled, and the king sent a minister named Sāgaradatta to crush him.",
        "source": "T22n1425_011:0322a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此大臣臨欲行時，往到尊者阿難所，白言尊者：「波斯匿王大臣叛逆，王今遣我往伐，方向強敵身命難保。",
        "translation": "When he was about to leave, this minister went to Venerable Ānanda and said, \"Venerable Ānanda, the king has sent me to crush this rebellious minister of King Prasenajit, but I'm headed toward a strong opponent whose life is difficult to protect.",
        "source": "T22n1425_011:0322a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常年年安居竟飯僧施衣，我今為官所使、不得待時，欲先施衣；得安隱還者，後當施食。」",
        "translation": "I've always lived in peace for years, but I've been asked by the officials to give clothes first when I can't wait, and I'll give food later if I'm able to return in peace.\"",
        "source": "T22n1425_011:0322a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者阿難即以上事具白世尊，佛知而故問阿難：「汝安居餘有幾日在？」",
        "translation": "Venerable Ānanda then reported all of the above to the Bhagavān, and the Buddha knew and therefore asked Ānanda, \"How many more days have you been living in peace?\"",
        "source": "T22n1425_011:0322a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「十日。」",
        "translation": "He answered, \"Ten days.\"",
        "source": "T22n1425_011:0322a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今日聽未到自恣十日得受急施衣。」",
        "translation": "The Buddha said, \"From this day on, I'll hear that I can accept the robe of emergency alms for the ten days before the ceremony.\"",
        "source": "T22n1425_011:0322a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「依止舍衛城住者皆悉令集，以十利故與諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The Buddha told the monks, \"Those who live in the city of Śrāvastī will all be gathered together, and the monks will be given the precepts because of the ten benefits, even if they have already heard them.",
        "source": "T22n1425_011:0322a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若十日未滿夏三月得急施衣，比丘須者得自手取，畜至衣時。",
        "translation": "If ten days have passed since the summer solstice, a monk who needs it may take it from his own hand and store it until the time when he puts it on.",
        "source": "T22n1425_011:0322a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過時畜者，尼薩耆波夜提。」",
        "translation": "If he stores it after that time, it's up to rules of conduct for rules of the rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for rules of the rules of conduct for monks.\"",
        "source": "T22n1425_011:0322a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十日者，從七月六日至七月十五日，是名十日。",
        "translation": "Ten days, from the sixth day of the seventh month to the fifteenth day of the seventh month, is called ten days.",
        "source": "T22n1425_011:0322a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得急施衣者，若女、若男、若大、若小、若在家、出家。",
        "translation": "Those who can give clothing urgently should be women, men, adults, children, householders, and renunciant monks.",
        "source": "T22n1425_011:0322a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲軍征行時與、征還時與、死時與、女人還歸時與、商人去時與，施主語比丘言：「若今日不取，明日無。」",
        "translation": "If he wants to give it to an army when it travels, when it returns from conquest, when it dies, when a woman returns, or when a merchant leaves, the donor says to the monk, \"If I don't take it today, it won't be there tomorrow.\"",
        "source": "T22n1425_011:0322a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名急施衣。",
        "translation": "This is called giving clothing urgently.",
        "source": "T22n1425_011:0322b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣者，七種，如上說。",
        "translation": "There are seven kinds of robes, as explained above.",
        "source": "T22n1425_011:0322b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲取者，若須此物應取，畜至衣時。",
        "translation": "Those who want to take them should take them if they need them, and they should store them until the time of clothing.",
        "source": "T22n1425_011:0322b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣時者，若無迦絺那衣，得至八月十五日；有迦絺那衣，得至臘月十五日。",
        "translation": "If there are no kaṭhina robes, it's possible to store them until the fifteenth day of the eighth month, or if there are kaṭhina robes, it's possible to store them until the fifteenth day of the ninth month.",
        "source": "T22n1425_011:0322b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過時畜者，尼薩耆波夜提。",
        "translation": "If he stores it after that time, it's rules of forfeiture of the things he owns.",
        "source": "T22n1425_011:0322b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼薩耆波夜提者，如上說。",
        "translation": "Nisargipañjana is as explained above.",
        "source": "T22n1425_011:0322b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘者有五法成就，僧應拜作勸化分衣人。",
        "translation": "That monk has accomplished five things, and the saṃgha should venerate him as someone who encourages and trains people to share their robes.",
        "source": "T22n1425_011:0322b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T22n1425_011:0322b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不隨愛、不隨瞋、不隨怖、不隨癡、得不得知，是名五法。",
        "translation": "Not following craving, not following anger, not following fear, not following delusion, and attaining unknowing are called the five dharmas.",
        "source": "T22n1425_011:0322b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作羯磨法者應作是說：「大德僧聽！",
        "translation": "Those who perform the ritual of karman should say, \"Listen, great monks!",
        "source": "T22n1425_011:0322b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某甲比丘五法成就，若僧時到，僧拜某甲比丘作勸化分衣人。",
        "translation": "If the five qualities of a certain monk are accomplished, the saṃgha will pay homage to that certain monk as someone who encourages him to share his robes when the saṃgha arrives.",
        "source": "T22n1425_011:0322b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白如是。」",
        "translation": "He said, 'So it is.'\"",
        "source": "T22n1425_011:0322b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德僧聽！",
        "translation": "\"Listen, great virtuous monks!",
        "source": "T22n1425_011:0322b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某甲比丘五法成就，僧今拜某甲比丘為勸化分衣人。",
        "translation": "Now, the saṃgha has worshipped a certain monk as a person who encourages and trains others to share their robes with him because he's accomplished five things.",
        "source": "T22n1425_011:0322b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大德忍某甲比丘為僧作勸化分衣人者僧默然，若不忍便說。」",
        "translation": "If the great men tolerate that certain monk's being the donor of robes for the saṃgha's edification, the saṃgha will be silent, but if they don't tolerate it, then they'll say so.\"",
        "source": "T22n1425_011:0322b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「僧已忍拜某甲比丘作勸化分衣人竟，僧忍默然故，是事如是持。」",
        "translation": "\"After the saṃgha tolerated the monk's veneration of that certain monk as a person who distributes robes for the monk's edification, the saṃgha tolerated it and remained silent. This is how he maintained it.\"",
        "source": "T22n1425_011:0322b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受羯磨已，應白僧作是言：「諸大德！",
        "translation": "After he receives the karma, he should say to the saṃgha, \"Great masters!",
        "source": "T22n1425_011:0322b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣相降四指八指不等，若通此者我當分。」",
        "translation": "The appearance of the robe descends four fingers and eight fingers, but if it's shared with this, I will divide it.\"",
        "source": "T22n1425_011:0322b17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不白而分，越毘尼罪。",
        "translation": "If someone doesn't explain this and then parts it, they're transgressing the vinaya.",
        "source": "T22n1425_011:0322b18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如上白已當分。",
        "translation": "After he explains it as above, he'll distribute it.",
        "source": "T22n1425_011:0322b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘從三月十六日，應語諸檀越：「捉紙筆條，房舍、講堂溫室、禪坊門屋、食厨淨水屋、廁屋薪屋浴室、樹下坐處、經行處盡疏名。」",
        "translation": "From March 16, that monk should tell the patrons, \"Grab a slip of paper and a pencil, and name all the rooms, lecture halls and greenhouses, meditation halls and entryways, kitchen and water purification halls, toilet and fireplace halls and bathhouses, places to sit under trees, and places to practice sūtra.\"",
        "source": "T22n1425_011:0322b19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應僧中唱：「大德僧聽！",
        "translation": "You should call out to the saṃgha, \"Listen, great virtuous saṃgha!",
        "source": "T22n1425_011:0322b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某甲住處有爾許床褥、爾許安居衣、爾許食、爾許齋日飲食、爾許呪願物。",
        "translation": "\"At a certain residence, there are as many beds and mats as there are seats, as many comfort cloths as there are seats, as many meals as there are days of observance, and as many things that are the subject of a spell.",
        "source": "T22n1425_011:0322b22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某住處有爾許阿練若住處，若左右諸精舍遠者，十二日十三日時應分房舍。",
        "translation": "At a certain dwelling, there are certain araṇya dwellings, and if the right and left monasteries are far away, they should share their dwellings on the twelfth and thirteenth days.",
        "source": "T22n1425_011:0322b24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是住處不相容受者，得餘處去。」",
        "translation": "If these dwelling places are incompatible, you'll have to leave them somewhere else.\"",
        "source": "T22n1425_011:0322b26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若近聚落中有精舍者，十四日十五日當分條疏，此房舍床褥與上座，當白僧：「某甲住處，有爾許房舍床褥，與上座隨意取。」",
        "translation": "If there's a monastery in a nearby village, on the 14th and 15th days, he'll share a slip of paper with the elder monk, saying, \"There's a certain monk's dwelling place that has a certain number of monks' dormitories and seats, so he'll take them as he wishes.\"",
        "source": "T22n1425_011:0322b26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取已次與第二、第三，乃至無歲比丘。",
        "translation": "After taking it, he'll then give it to the second, third, or even ageless monk.",
        "source": "T22n1425_011:0322b29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上座應作是言：「房舍次第住，布施物應平等與。」",
        "translation": "The superior monk then should say, \"Stand in order in your dwelling, and give your alms equally.\"",
        "source": "T22n1425_011:0322c01_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時應隨上座處分。",
        "translation": "The superior monk then should dispose of them as he sees fit.",
        "source": "T22n1425_011:0322c02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上座取已，應次第與第二、第三亦如是，乃至無歲比丘。",
        "translation": "After the head monk takes it, he should give it to the second and third in order, and so on, up to a monk of no age.",
        "source": "T22n1425_011:0322c03_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若房多者應一人與二房，與二房時若不肯取者，應語言：「此為治事故與，不為受用故與。」",
        "translation": "If he has many rooms, he should give two rooms to one person, and if he refuses to take the second room, he should say, \"This is for the purpose of healing, not for enjoyment.\"",
        "source": "T22n1425_011:0322c04_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不得與沙彌二房。",
        "translation": "You mustn't give a house to a monk with two rooms.",
        "source": "T22n1425_011:0322c06_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若房舍少者，二人共房。",
        "translation": "If there are few living quarters, two people may share a room.",
        "source": "T22n1425_011:0322c06_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是房猶不足者，當三人共、若四人共、五人乃至十人共與一房。",
        "translation": "If this is still not enough room, three people will share it, or four people will share it, or five or even ten people will share one room.",
        "source": "T22n1425_011:0322c07_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有大堂、若溫室、若禪坊、若講堂，一切共入中。",
        "translation": "If there's a large hall, a greenhouse, a meditation hall, or a lecture hall, they'll all enter it together.",
        "source": "T22n1425_011:0322c08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不受者，上座與臥床，年少與坐床。",
        "translation": "If someone doesn't accept them, the elder will share the bed with the elder, and the younger will share the seat with the sitter.",
        "source": "T22n1425_011:0322c09_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不受者，上座與坐床，年少敷地床。",
        "translation": "If he also doesn't accept it, the elder will share his seat with his sitting mat, and the younger will share his floor bed.",
        "source": "T22n1425_011:0322c10_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不受者，與上座草褥，年少結跏趺坐。",
        "translation": "If he doesn't accept it again, he'll be given a straw mattress by the ascending throne and a lotus position by the young man.",
        "source": "T22n1425_011:0322c11_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不受，諸上座應坐，年少應立住。",
        "translation": "If they don't accept it again, the higher seat will sit, and the younger person will stand.",
        "source": "T22n1425_011:0322c12_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不受者，上座當立，年少出去，若樹下、若餘處。",
        "translation": "If he doesn't accept it again, the higher seat should stand, and the younger person should go out, whether under a tree or elsewhere.",
        "source": "T22n1425_011:0322c13_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘六月十六日已後，應當語諸檀越：「長壽！",
        "translation": "After June 16, that monk should say to the patrons, \"Long life!",
        "source": "T22n1425_011:0322c14_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各辦衣。」",
        "translation": "Each of you should prepare a robe.\"",
        "source": "T22n1425_011:0322c15_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時檀越若與者，應語言：「且著汝邊，須待時與。」",
        "translation": "If a donor then gives them, he should say, \"Put them near you, and wait until a later time to give them to you.\"",
        "source": "T22n1425_011:0322c15_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲軍征去與、若征還與、若死時與、商人去時與、女人歸家時與，若今日不取、明日無，爾時應取。",
        "translation": "If he wants to give it to an army when it leaves, to a conscript when it returns, to a merchant when he dies, or to a woman when she returns home, then he should take it if he doesn't take it today or if it won't be there tomorrow.",
        "source": "T22n1425_011:0322c16_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七月五日已後有此衣來，取著一處，若樹葉、樹皮當取數記，爾許時衣、爾許非時衣、爾許急施衣。",
        "translation": "When this garment comes after the fifth day of the seventh month, take it and put it on a spot; if there's a leaf or bark from a tree, take several notes about it, and then you may accept timely clothing, sometimes you may accept non-timely clothing, and sometimes you may give clothing in a hurry.",
        "source": "T22n1425_011:0322c19_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時衣時分、非時衣非時分、急施衣時分。",
        "translation": "There's a time for timely clothing, a time for non-timely clothing, and a time for urgently given clothing.",
        "source": "T22n1425_011:0322c21_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若分衣人，若罷道、若死，不得分衣。",
        "translation": "If he parts with his robe, then he won't part with it if he goes off the path or dies.",
        "source": "T22n1425_011:0322c22_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時過，應如是貿衣分：比丘尼衣應與比丘，比丘衣應與比丘尼。",
        "translation": "If the time is too short, he should thus divide his robe according to trade: the monk's robe should go to the monk, and the monk's robe should go to the monk's nun.",
        "source": "T22n1425_011:0322c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是不得者，沙彌衣應與比丘，比丘衣應與沙彌。",
        "translation": "If that's not possible, the novice's robe should go to the monks, and the monk's robe should go to the novices.",
        "source": "T22n1425_011:0322c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不得者，應眾僧中白言：「諸大德！",
        "translation": "If that's not possible, he should say among the saṃgha, \"Great masters!",
        "source": "T22n1425_011:0322c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣時已過，眾僧和合，作四方僧臥具，若聽者得作四方僧臥具。」",
        "translation": "After the robe time passed, the saṃgha combined it to make bedding for the four directions, and if someone listens, they can make bedding for the four directions.\"",
        "source": "T22n1425_011:0322c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人言：「我等夏安居住，得此衣分，何以作四方僧用？」",
        "translation": "If someone says, \"We lived in summer retreat and got a share of these robes, why did we make them for the four directions of the saṃgha?\"",
        "source": "T22n1425_011:0322c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應語此人：「待來年衣時，當與汝。」",
        "translation": "You should say to this person, \"I'll give you the robe in a future year.\"",
        "source": "T22n1425_011:0322c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說。",
        "translation": "Therefore, he said.",
        "source": "T22n1425_011:0322c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛住舍衛城，爾時諸比丘阿練若處夏安居。",
        "translation": "When the Buddha was staying in Śrāvastī, the monks stayed at the summer retreat in Araṇyavatī.",
        "source": "T22n1425_011:0323a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘時到入聚落乞食，後放牛羊人、取薪草人，持戶鉤來開諸比丘房戶偷衣物。",
        "translation": "When the monks arrived, they went into the village to solicit alms, and then some cowherd or goat herder who was collecting wood and grass came with a hook and opened the monks' door to steal their clothing.",
        "source": "T22n1425_011:0323a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘畏偷故，盡持衣物入聚落。",
        "translation": "Fearing the theft, the monks then took all their clothing into the village.",
        "source": "T22n1425_011:0323a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知而故問：「此何等比丘運致來此？」",
        "translation": "Knowing this, the Buddha asked, \"What kind of monks brought this here?\"",
        "source": "T22n1425_011:0323a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, \"Bhagavān!",
        "source": "T22n1425_011:0323a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸比丘在阿練若處安居乞食去，後有人持戶鉤，於後開戶偷諸衣物，是以運致來此。」",
        "translation": "Those monks were staying at the araṇya temple begging for food when someone with a hook in the door opened it later and stole some clothes, which is why they brought them here.\"",
        "source": "T22n1425_011:0323a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今日後恐畏時，聽三衣中若一一衣，得寄著聚落內。」",
        "translation": "The Buddha said, \"From now on, when you're afraid, you'll hear that if you have one of the three garments, you can put it inside the colony.\"",
        "source": "T22n1425_011:0323a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次佛住舍衛城祇洹精舍，沙祇國夏安居中眾僧有諍事起，如法滅。",
        "translation": "Again, while the Buddha was staying at the Jetavana monastery in Śrāvastī, a dispute arose among the saṃgha during their summer retreat in Śāketa and was ended according to the teaching.",
        "source": "T22n1425_011:0323a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語優波離：「汝往沙祇國，與眾僧如法滅此諍事。」",
        "translation": "The Buddha said to Upāli, \"Go to Śākyamuni and end this dispute with the monks according to the Dharma.\"",
        "source": "T22n1425_011:0323a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長老優波離辭不去，佛問優波離：「汝何以不去？」",
        "translation": "When Upāli, the elder, refused to go, the Buddha asked Upāli, \"Why aren't you going?\"",
        "source": "T22n1425_011:0323a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T22n1425_011:0323a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我僧伽梨重，若被雨者不可勝；而今半安居中，若留衣者，尼薩耆。」",
        "translation": "My saṃghârī is so heavy that it would be invincible if it were rained on; now, in the middle of my half-abode, it would be a nisaji if he were to leave his robe on.\"",
        "source": "T22n1425_011:0323a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問優波離：「汝幾日可得往還？」",
        "translation": "The Buddha asked Upāli, \"How many days will it take for you to return?\"",
        "source": "T22n1425_011:0323a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離白佛言：「世尊！",
        "translation": "Upāli said to the Buddha, \"Bhagavān!",
        "source": "T22n1425_011:0323a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "計去二日、停二日、來二日，都計六宿，可得往返。」",
        "translation": "Counting two days gone, two days stopped, and two days coming, they all count as six nights, and it's possible to get back and forth.\"",
        "source": "T22n1425_011:0323a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今日後留衣得齊六宿。」",
        "translation": "The Buddha said, \"From this day forward, I'll be able to keep my robe for six nights.\"",
        "source": "T22n1425_011:0323a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離到彼已，見此諍事難可卒滅，即便來還。",
        "translation": "When Upāli arrived there, he saw how difficult it was to end this dispute and returned.",
        "source": "T22n1425_011:0323a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還已禮世尊足，却住一面，佛知而故問：「優波離！",
        "translation": "When he returned, he bowed his head at the Bhagavān's feet and withdrew to one side, where the Buddha knew and therefore asked, \"Upāli!",
        "source": "T22n1425_011:0323a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝來還何故速，僧中諍事竟得滅不？」",
        "translation": "Why did you come so quickly, and did you manage to end the dispute within the saṃgha?\"",
        "source": "T22n1425_011:0323a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「未滅。",
        "translation": "They replied, \"It hasn't died yet.",
        "source": "T22n1425_011:0323a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T22n1425_011:0323a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「何以故？」",
        "translation": "The Buddha said, \"Why is that?\"",
        "source": "T22n1425_011:0323a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「諍事難滅非可卒斷，復畏日過失衣犯尼薩耆，是故來還。」",
        "translation": "He replied, \"It's difficult to end a dispute that can't be stopped quickly, and I'm afraid that I'll lose my robe and violate rules of conduct for the Nisajis if the sun goes down.",
        "source": "T22n1425_011:0323a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今日聽一月不失衣宿。",
        "translation": "The Buddha said, \"From today, we'll hear that for one month there'll be no loss of clothing and lodging.",
        "source": "T22n1425_011:0323a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作羯磨僧應與求聽作一月不失衣宿羯磨。」",
        "translation": "The saṃgha who performs the karma should give him the request to perform the karma for one month without losing his robe and lodging.\"",
        "source": "T22n1425_011:0323a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羯磨者應作是說：「大德僧聽！",
        "translation": "The karmācārya should say, \"Listen, Mañjuśrī!",
        "source": "T22n1425_011:0323a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離今向沙祇國，為僧滅諍事。",
        "translation": "The elder Upāli now went to Śākyamuni to settle a dispute for the saṃgha.",
        "source": "T22n1425_011:0323a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到，優波離欲從僧乞一月不失衣宿羯磨。」",
        "translation": "If the saṃgha's time comes, Upāli wants to beg a month's worth of lodging karma from the saṃgha without losing his robes.\"",
        "source": "T22n1425_011:0323a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸大德聽！",
        "translation": "\"Listen, great masters!",
        "source": "T22n1425_011:0323a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離欲從僧乞一月不失衣宿羯磨，僧忍默然故，是事如是持。」",
        "translation": "Upāli wanted to ask the saṃgha for a month's worth of lodging without losing his robes, but the saṃgha tolerated it and remained silent, thus maintaining the situation.\"",
        "source": "T22n1425_011:0323a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應從僧中乞，作是言：「大德僧聽！",
        "translation": "He should ask for alms from the saṃgha and say, \"Listen, Mañjuśrī!",
        "source": "T22n1425_011:0323b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我優波離比丘，欲向沙祇國為僧滅諍事。",
        "translation": "I, Upāli Bhikṣu, would like to go to Śākyamuni to settle a dispute for the saṃgha.",
        "source": "T22n1425_011:0323b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願大德僧與我一月不失衣宿羯磨。」",
        "translation": "Please let the great virtuous saṃgha give me a month's stay in karma without losing my robes.\"",
        "source": "T22n1425_011:0323b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第二、第三乞。",
        "translation": "This is the second and third requests.",
        "source": "T22n1425_011:0323b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羯磨人當作是說：「大德僧聽！",
        "translation": "The karmācārya should say, \"Listen, great monks!",
        "source": "T22n1425_011:0323b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離，欲往沙祇國為僧滅諍事，已從僧中乞一月不失衣宿羯磨。",
        "translation": "The elder Upāli wanted to go to Śākyamuni to settle a dispute for the saṃgha, but he had asked the saṃgha for a month of lodging and clothing without losing it.",
        "source": "T22n1425_011:0323b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到，僧與優波離一月不失衣宿羯磨。",
        "translation": "If the saṃgha's time arrived, the saṃgha gave Upāli a month's worth of karman without loss of clothing and lodging.",
        "source": "T22n1425_011:0323b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白如是。」",
        "translation": "I said, 'So it is.'\"",
        "source": "T22n1425_011:0323b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德僧聽！",
        "translation": "\"Listen, great virtuous monks!",
        "source": "T22n1425_011:0323b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離，欲向沙祇國為僧滅諍事，已從僧乞一月不失衣宿。",
        "translation": "The elder Upāli wanted to go to Śākyamuni to settle a dispute for the saṃgha, but he had asked the saṃgha for a month without losing his robe and lodging.",
        "source": "T22n1425_011:0323b07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧今已與長老優波離一月不失衣宿羯磨。",
        "translation": "Now, the saṃgha has given Upāli the elder a month's worth of karman without loss of clothing and lodging.",
        "source": "T22n1425_011:0323b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大德忍與優波離一月不失衣宿羯磨者默然，若不忍便說，是初羯磨。」",
        "translation": "If the great men tolerate giving Upāli a month's kalpa without loss of clothing and lodging, they'll be silent; if they don't tolerate it, then they'll say it's the first kalpa.\"",
        "source": "T22n1425_011:0323b10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二、第三亦如是說。",
        "translation": "The second and third are also explained in this way.",
        "source": "T22n1425_011:0323b11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「僧已與優波離一月不失衣宿竟，僧忍默然故，是事如是持。」",
        "translation": "\"After the saṃgha has given Upāli one month without losing his robe and lodging, the saṃgha tolerates silence, and this is how it's maintained.\"",
        "source": "T22n1425_011:0323b12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問諸比丘：「已與優波離一月不失衣宿羯磨未？」",
        "translation": "The Buddha asked the monks, \"Has the monk given Upāli one month without losing his robe for lodging yet?\"",
        "source": "T22n1425_011:0323b13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「已與。」",
        "translation": "He replied, \"I've given them.\"",
        "source": "T22n1425_011:0323b14_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「依止舍衛城住者盡集，以十利故與諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The Buddha told the monks, \"Relying on the exhaustive collection of those who live in Śrāvastī, he will give the monks the precepts because of the ten benefits, even if those who have heard them will hear them again.",
        "source": "T22n1425_011:0323b15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夏三月未滿，比丘在阿練若處住，有恐怖疑，比丘三衣中若一一衣，得寄著家內。",
        "translation": "When a monk lives in a forest in the summer before the third month is up and has doubts about terror, he may be allowed to put each of his three robes in his home.",
        "source": "T22n1425_011:0323b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘有因緣事，得齊六宿。",
        "translation": "A monk with a causal situation may be allowed to stay six nights in the same place.",
        "source": "T22n1425_011:0323b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過者，除僧羯磨，尼薩耆波夜提。」",
        "translation": "If he goes beyond that, he'll be removed from the saṃgha's retreat and from the rules of the rules of forfeiture of the things that a monk wears.\"",
        "source": "T22n1425_011:0323b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安居三月者，從四月十六日至七月十五日。",
        "translation": "A monk who has stayed in his home for three months will do so from April 16 to July 15.",
        "source": "T22n1425_011:0323b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未滿者，未至八月十五日。",
        "translation": "If it's not yet completed, it's not yet up to the 15th of August.",
        "source": "T22n1425_011:0323b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘未至末月中，在阿練若處住。",
        "translation": "A monk abides in an araṇya place until the middle of the last month.",
        "source": "T22n1425_011:0323b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿練若處者，長五肘弓五百弓中間無有放牧人屋，是名阿練若處。",
        "translation": "This is called the forested place, where there's no grazer's hut between a five-armed bow and a five-hundred-armed bow.",
        "source": "T22n1425_011:0323b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐怖者，若殺劫奪。",
        "translation": "He's afraid if he's killed, robbed, or plundered.",
        "source": "T22n1425_011:0323b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疑者，雖無殺劫奪，有疑心畏須臾間當殺人奪人衣。",
        "translation": "Doubtful people, even though there's no killing or robbery and plunder, if they have doubt and fear, they'll kill someone and plunder their clothing in a moment.",
        "source": "T22n1425_011:0323b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘知如是恐怖處。",
        "translation": "If a monk knows this place of fear, then he'll be afraid.",
        "source": "T22n1425_011:0323b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三衣中若一一衣者，僧伽梨、欝多羅僧、安陀會。",
        "translation": "If there's one of the three garments, it's the saṃghârī, the uttarâsaṅga, and the undergarment.",
        "source": "T22n1425_011:0323b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不得寄僧伽梨、安陀會，得寄欝多羅僧著聚落中家。",
        "translation": "He mustn't send it to the saṃghârī or the undergarment, but he can send it to a house in a village where Uttarakuru monks are staying.",
        "source": "T22n1425_011:0323b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內者，俗人家不得寄，可信人家當還寄，可疑家疑家作是念：「諸比丘等皆不可復得皆悉防備。」",
        "translation": "Those inside their homes can't send them to secular homes, but trustworthy homes will send them back, and doubtful homes will think, \"None of the monks can be regained; they're all prepared.\"",
        "source": "T22n1425_011:0323b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘等若有因緣，為塔、為僧事得齊六夜。",
        "translation": "If there are reasons for monks and nuns to serve as stūpas and saṃgha, they may be allowed to stay for six nights.",
        "source": "T22n1425_011:0323c01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六夜者，限齊六宿。",
        "translation": "Six nights is the maximum number of nights that a monk can spend.",
        "source": "T22n1425_011:0323c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除僧羯磨者，世尊說無罪。",
        "translation": "The Bhagavān says it's no offense to remove the monk's karma.",
        "source": "T22n1425_011:0323c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧羯磨不成就，不名羯磨。",
        "translation": "If the monks' ritual isn't accomplished, it's not called ritual.",
        "source": "T22n1425_011:0323c03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羯磨不成就者，眾不成就、白不成就、羯磨不成就。",
        "translation": "When karma is not accomplished, it's not accomplished by the congregation, not accomplished by the announcement, and not accomplished by the karma.",
        "source": "T22n1425_011:0323c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若白成就、羯磨成就、眾成就，是名僧作羯磨。",
        "translation": "If the announcement is accomplished, the karma is accomplished, and the congregation is accomplished, this is called the saṃgha's undertaking of the karma.",
        "source": "T22n1425_011:0323c05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧中受羯磨已，不得為待供養故住，應當疾去。",
        "translation": "If someone in the saṃgha receives the karma, he mustn't stay there just to wait for offerings, but he must leave quickly.",
        "source": "T22n1425_011:0323c06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若食前作羯磨，食後應去。",
        "translation": "If he performed the ritual before eating, he should leave after eating.",
        "source": "T22n1425_011:0323c07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食後受羯磨者，明日晨朝應去。",
        "translation": "Those who received the karma after eating should leave tomorrow morning in the morning.",
        "source": "T22n1425_011:0323c08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去時不得迴道逐檀越，當直道去。",
        "translation": "When they leave, they mustn't turn back and chase the donor; they must go straight ahead.",
        "source": "T22n1425_011:0323c08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若直道有難者，若師子難、虎狼難、毒虫難、失命難，爾時迴道去無罪。",
        "translation": "If there's a problem going straight ahead, such as a difficulty with a lion, a tiger, a wolf, a venomous insect, or a loss of life, then it's no offense to turn back and go.",
        "source": "T22n1425_011:0323c09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到彼已不得停待供養客比丘飲食。",
        "translation": "After arriving there, he mustn't stop to provide food or drink for the guest monk.",
        "source": "T22n1425_011:0323c11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若食前到，食後便集僧滅諍事。",
        "translation": "If he arrives before the meal, he'll gather the saṃgha after the meal to end the dispute.",
        "source": "T22n1425_011:0323c12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若食後到，清旦便集僧滅諍事。",
        "translation": "If he arrives after eating, he'll gather the saṃgha on sunrise to end the dispute.",
        "source": "T22n1425_011:0323c12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若食後斷事訖，便清旦還。",
        "translation": "If he finishes his business after the meal, he'll return early in the morning.",
        "source": "T22n1425_011:0323c13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若食前斷事訖，食後便還，不得住待客比丘供養。",
        "translation": "If he finishes his business before the meal and returns after the meal, he mustn't stay to receive offerings from guest monks.",
        "source": "T22n1425_011:0323c14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還時不得從迴道來，當從直道還。",
        "translation": "When he returns, he mustn't come from a circuitous path; he must return from a direct path.",
        "source": "T22n1425_011:0323c15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有難者，如上說。",
        "translation": "If there's any difficulty, it's as explained above.",
        "source": "T22n1425_011:0323c15_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初往到彼時，不得誦經、熏鉢、染衣。",
        "translation": "When he first goes there, he mustn't recite sūtras, perfume his bowl, or dye his robes.",
        "source": "T22n1425_011:0323c16_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若斷事訖，有長功夫得誦經作餘事。",
        "translation": "If he finishes the task, then he'll have a long period of time to recite the sūtras and do other tasks.",
        "source": "T22n1425_011:0323c17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若事難斷者，中間得誦經、熏鉢，亦得受客比丘供養飲食，無罪。",
        "translation": "If it's difficult to end the situation, it's okay to recite the sūtras and smoke the bowls in between, and it's okay to accept offerings of food and drink from guest monks, which is no offense.",
        "source": "T22n1425_011:0323c17_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅諍事時不得輒爾取人，當於眾中若堪能、有威德力勢者，若阿練若住處寄衣，得著家內，六夜。",
        "translation": "When ending a dispute, he mustn't take someone lightly; if he's capable and has the authority and strength to do so, he may be allowed to stay home for six nights if he's sent clothing to an araṇya residence.",
        "source": "T22n1425_011:0323c19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過六夜者，尼薩耆波夜提。",
        "translation": "If it's longer than six nights, that's rules for rules of forfeiture of the things that a monk wants to do.",
        "source": "T22n1425_011:0323c21_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘欲捨衣，法當請持律，如上第一戒中說，是故說。",
        "translation": "If this monk wants to give up his robe, he must ask to uphold the precepts, as explained in the first precept above; therefore, he says.",
        "source": "T22n1425_011:0323c22_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛城，有一乞食比丘，時到著入聚落衣，持鉢入城，次行乞食。",
        "translation": "When the Buddha was in Śrāvastī, there was a monk who was begging for alms when he arrived, put on his robe for entering the village, took his bowl into the city, and went begging for alms.",
        "source": "T22n1425_011:0323c23_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到一家，有一女人語比丘言：「尊者！",
        "translation": "When he arrived at a house, a woman said to the monk, \"Venerable!",
        "source": "T22n1425_011:0323c25_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某日我當供養僧并施僧衣。」",
        "translation": "One day, I'll make offerings to the saṃgha and give them robes.\"",
        "source": "T22n1425_011:0323c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘言：「善哉姊妹！",
        "translation": "The monk said, \"Good, sister!",
        "source": "T22n1425_011:0323c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以三不堅法，易三堅法身命財也，應疾為之，財物無常多有諸難。」",
        "translation": "It's easier to exchange the three insubstantial qualities for the three insubstantial qualities of body, life, and property, which should be done quickly because property is impermanent and has many difficulties.\"",
        "source": "T22n1425_011:0323c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，便還精舍，語諸比丘言：「我欲語汝好事。」",
        "translation": "After saying this, he returned to the monastery and said to the monks, \"I want to tell you about good things.\"",
        "source": "T22n1425_011:0323c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「有何等好事？」",
        "translation": "The monks said, \"What's good about it?\"",
        "source": "T22n1425_011:0323c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我聞某甲優婆夷欲供僧飯食、布施僧衣。」",
        "translation": "He replied, \"I've heard that a certain Upāsikā wants to serve food to the saṃgha and give it to the saṃgha as clothing.\"",
        "source": "T22n1425_011:0324a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘聞此語已，更問言：「汝說何等？」",
        "translation": "After the six groups of monks heard this, they also asked, \"What do you mean by that?\"",
        "source": "T22n1425_011:0324a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我聞某甲優婆夷欲供僧飯食并布施衣。」",
        "translation": "He replied, \"I heard that a certain Upāsikā wanted to offer food to the saṃgha and give alms for clothing.\"",
        "source": "T22n1425_011:0324a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：「汝知其家處不？",
        "translation": "He asked, \"Do you know where his family lives?",
        "source": "T22n1425_011:0324a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為在何巷？",
        "translation": "Why is it in what alley?",
        "source": "T22n1425_011:0324a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門戶那向？」",
        "translation": "Do you face the gate?\"",
        "source": "T22n1425_011:0324a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具問已，晨朝著入聚落衣，往到其家見已，問言：「長壽！",
        "translation": "After making these inquiries, he put on his robe and went to his house in the morning and asked, \"Long life!",
        "source": "T22n1425_011:0324a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安隱不？」",
        "translation": "Anon no?\"",
        "source": "T22n1425_011:0324a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「安隱。」",
        "translation": "He replied, \"Peaceful!\"",
        "source": "T22n1425_011:0324a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語優婆夷言：「我聞汝欲供僧飯食、布施僧衣，為實爾不？」",
        "translation": "He said to Upāsikā, \"I've heard that you want to offer food to the saṃgha and give clothing to the saṃgha.",
        "source": "T22n1425_011:0324a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「尊者！",
        "translation": "He replied, \"Venerable!",
        "source": "T22n1425_011:0324a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我有是心，但恐中間多有難事，知得成不？」",
        "translation": "I have this intention, but I'm afraid there are many difficulties in between. Do you know if it's possible?\"",
        "source": "T22n1425_011:0324a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語言：「如我先出家長宿比丘，汝若施衣者，我當著入王家，禮敬世尊、若貴勝家。",
        "translation": "He then said, \"Suppose I were a monk who left home long ago and stayed there, and if you give me a robe, I'll put it on and enter the king's household and venerate the Bhagavān or some noble and distinguished family.",
        "source": "T22n1425_011:0324a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人問我：『汝何處得？』",
        "translation": "If someone asks me, 'Where did you get it?'",
        "source": "T22n1425_011:0324a11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當答：『某信心優婆夷邊得。』",
        "translation": "I will answer, 'A certain faith is obtained by the side of Upāsikā.'",
        "source": "T22n1425_011:0324a11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是汝得好名稱，為眾所識。」",
        "translation": "Thus, you've attained a good name that's known to all.\"",
        "source": "T22n1425_011:0324a12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優婆夷言：「我家更無有物，我正欲與僧者若與阿闍梨，我已許僧；我若有者，亦當別與阿闍梨亦與僧。」",
        "translation": "Upāsikā said, \"There's nothing else in my house that I want to give to the saṃgha, and if I were to give it to a priest, I would have given it to the saṃgha; if I had one, I would have given it to a priest and to the saṃgha separately.\"",
        "source": "T22n1425_011:0324a12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘言：「與以不與，自從汝意。」",
        "translation": "The monk said, \"Give or withhold it, as you wish.\"",
        "source": "T22n1425_011:0324a15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，便出去。",
        "translation": "After saying this, he left.",
        "source": "T22n1425_011:0324a15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去已優婆夷作是思惟：「我若當與是比丘，不與僧者，僧是良福田。",
        "translation": "After he left, the Upāsikā thought, \"If I give this monk and don't give it to the saṃgha, the saṃgha will be a good field of merit.",
        "source": "T22n1425_011:0324a16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不與是比丘者，是比丘於王邊有力，能為我作不饒益事。",
        "translation": "If I don't give it to that monk, that monk is powerful enough to work for the king's side and do things for me that aren't beneficial.",
        "source": "T22n1425_011:0324a17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故不與僧，瞋比丘故，亦復不與。」",
        "translation": "Therefore, I won't give it to the saṃgha, and I won't give it to an angry monk.\"",
        "source": "T22n1425_011:0324a19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘聞已，以是事往白世尊。",
        "translation": "After the monks heard this, they went to the Bhagavān with this story.",
        "source": "T22n1425_011:0324a20_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「呼難陀、優波難陀來。」",
        "translation": "The Buddha said, \"Summon Nanda and Upananda to come.\"",
        "source": "T22n1425_011:0324a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "來已，佛廣問上事：「汝實爾不？」",
        "translation": "When they arrived, the Buddha asked them in detail about the above matter, \"Is that true?\"",
        "source": "T22n1425_011:0324a21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, \"Indeed.\"",
        "source": "T22n1425_011:0324a22_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此是惡事，有二不可，令施者失福，受者失衣。」",
        "translation": "The Buddha said, \"This is a bad deed, and there are two things it mustn't do, causing the giver to lose his good fortune and the recipient to lose his clothing.\"",
        "source": "T22n1425_011:0324a22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語難陀、優波難陀：「汝常不聞我以無數方便，讚歎少欲、毀呰多欲？",
        "translation": "The Buddha said to Nandana and Upananda, \"Have you never heard that I praise few desires and disparage many desires with countless skillful means?",
        "source": "T22n1425_011:0324a23_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此非法、非律、非如佛教，不可以是長養善法。」",
        "translation": "This is not the Dharma, not the precepts, and not Buddhism as such, and it can't be a good way to nurture good qualities.\"",
        "source": "T22n1425_011:0324a25_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「依止舍衛城住者，皆悉令集以十利故，與諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The Buddha told the monks, \"Suppose he lives in Śrāvastī and causes all of them to gather the ten benefits and give the monks the precepts, even if they've already heard them; they'll hear them again.",
        "source": "T22n1425_011:0324a26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘知物向僧，自迴向己，尼薩耆波夜提。」",
        "translation": "If monks know that they're giving things to the saṃgha and are turning back to themselves, rules of conduct will be given, rules of conduct will be given, and the monks will be given back.\"",
        "source": "T22n1425_011:0324a28_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘者，如上說。",
        "translation": "A monk knows, as explained above.",
        "source": "T22n1425_011:0324a29_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知者，若自知、若從他聞。",
        "translation": "'Knowing' means knowing for oneself or hearing from others.",
        "source": "T22n1425_011:0324a29_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "物者，八種物，時分、夜分、七日、終身、隨物、重物、不淨物、淨物、淨不淨物。",
        "translation": "'Things' are eight kinds of things, including time divisions, night divisions, seven days, the final body, suitable things, heavy things, impure things, pure things, and pure and impure things.",
        "source": "T22n1425_011:0324b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "向者，意趣選物向僧。",
        "translation": "He points them toward the saṃgha with the intention of choosing something to give.",
        "source": "T22n1425_011:0324b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧者，八種：比丘僧、比丘尼僧、客僧、去僧、舊住僧、安居僧、和合僧、不和合僧。",
        "translation": "There are eight kinds of monks: bhikṣu monks, bhikṣuṇī monks, visiting monks, departing monks, formerly resident monks, resident monks, reconciled monks, and non-combined monks.",
        "source": "T22n1425_011:0324b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自向者，自畜、自用、自入，尼薩耆波夜提。",
        "translation": "Those who are self-directed are those who store, use, and enter on their own, rules of conduct for nuns and senior monks.",
        "source": "T22n1425_011:0324b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此物應僧中捨，波夜提罪應悔過。",
        "translation": "These things should be given up among the saṃgha, and the offense of pāyatti should be repented of.",
        "source": "T22n1425_011:0324b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不捨而悔者，得越毘尼罪。",
        "translation": "If someone doesn't abandon it and repent, they'll transgress the offense of vinaya.",
        "source": "T22n1425_011:0324b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波夜提者，如上說。",
        "translation": "\"Pāyatti\" is as explained above.",
        "source": "T22n1425_011:0324b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人來欲有布施，問比丘言：「尊者！",
        "translation": "Suppose someone comes along who wants to make a donation and asks a monk, \"Venerable!",
        "source": "T22n1425_011:0324b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲布施，應施何處耶？」",
        "translation": "Where do I want to give, and where should I give it?\"",
        "source": "T22n1425_011:0324b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應答言：「隨汝心所敬處便與。」",
        "translation": "The monk answered, \"Give as your heart desires.\"",
        "source": "T22n1425_011:0324b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施主復問：「何處果報多？」",
        "translation": "The donor then asked, \"Where will the rewards be great?\"",
        "source": "T22n1425_011:0324b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「施僧果報多。」",
        "translation": "He replied, \"The rewards of giving to the saṃgha are numerous.\"",
        "source": "T22n1425_011:0324b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施主復言：「何等清淨持戒，有功德僧？」",
        "translation": "The donor then asked, \"What's a pure and well-maintained precept that has merit for a monk?\"",
        "source": "T22n1425_011:0324b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應答言：「僧無有犯戒不清淨。」",
        "translation": "A monk should reply, \"A saṃgha has never violated the precepts in a way that wasn't clear.\"",
        "source": "T22n1425_011:0324b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人持物來施，比丘應語言：「施僧者得大果報。」",
        "translation": "If someone brings something to give, the monk should say, \"Giving to the saṃgha will have great rewards.\"",
        "source": "T22n1425_011:0324b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「我已曾施僧，今正欲施尊者。」",
        "translation": "If he says, \"I've already given to the saṃgha, and now I'm about to give to the venerable.\"",
        "source": "T22n1425_011:0324b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘受者無罪。",
        "translation": "It's no offense for a monk to accept it.",
        "source": "T22n1425_011:0324b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人問比丘言：「我欲以此物布施，為置何處，使我此物長見受用？」",
        "translation": "Suppose someone asks the monk, \"Where would I put this thing I want to give as an offering, so that I can see and enjoy it for a long time?\"",
        "source": "T22n1425_011:0324b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時應語：「某甲比丘是坐禪、誦經、持戒，若施彼者長見受用。」",
        "translation": "At that point, he should say, \"A certain monk who sits in meditation, recites sūtras, and observes the precepts will see and accept them if he gives them to others.\"",
        "source": "T22n1425_011:0324b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知物向僧，迴向己，尼薩耆波夜提。",
        "translation": "If he knows that he's given something to the saṃgha and has given it back to himself, that nisaji may well be mentioned.",
        "source": "T22n1425_011:0324b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迴與餘人，波夜提。",
        "translation": "Turn it back to the others, prāyaṇṭi.",
        "source": "T22n1425_011:0324b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知物向此僧，迴與餘僧者，越毘尼罪。",
        "translation": "If someone knows they're giving something to this saṃgha and returns it to another saṃgha, they've transgressed the vinaya.",
        "source": "T22n1425_011:0324b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知向此眾多人，迴與彼眾多人，越毘尼罪。",
        "translation": "He knows that when he directs it to this multitude of people, he'll turn it back to that multitude of people, which is a transgression of the vinaya.",
        "source": "T22n1425_011:0324b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知物向此畜生，迴與餘畜生，越毘尼心悔。",
        "translation": "He knows that when he directs something to this animal, he'll turn it back to the other animals, which is a transgression of vinaya.",
        "source": "T22n1425_011:0324b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知物向僧，自迴向己者，尼薩耆波夜提。",
        "translation": "He who knows that he's directed something to the saṃgha and turns it back to himself is a nisaji pratyutpanna.",
        "source": "T22n1425_011:0324b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是物眾僧應不與，眾僧應受用，是故說。",
        "translation": "This is something that the saṃgha shouldn't give away and that the saṃgha should accept; therefore, it's explained.",
        "source": "T22n1425_011:0324b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(三十事竟)摩訶僧祇律卷第十一",
        "translation": "(After Thirty Things), Mahāsāṃghika-vinaya, Vol. 11",
        "source": "T22n1425_011:0324b23_10",
        "is_bad_quality": false
    }
]