[
    {
        "source_sentence": "五分律卷第二十一(彌沙塞)",
        "translation": "Five Part Vinaya, Volume XXI (Mishraśāsaka)",
        "source": "T22n1421_021:0140c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋罽賓三藏佛陀什",
        "translation": "Song Dynasty Tripiṭaka of Kāśmīra Buddhasiṃha",
        "source": "T22n1421_021:0140c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共竺道生等譯",
        "translation": "Shared with Zhu Daosheng and others",
        "source": "T22n1421_021:0140c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三分之五衣法下",
        "translation": "third part of the five garment dharmas",
        "source": "T22n1421_021:0140c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍夷國猶遵舊典，不與一切異姓婚姻。",
        "translation": "At the time, Śākya still followed the old custom of not marrying anyone from another clan.",
        "source": "T22n1421_021:0140c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿王貪其氏族，自恃兵強，遣使告言：「若不與我婚，當滅汝國。」",
        "translation": "King Prasenajit, desiring his clan and conceited in the strength of his army, sent an envoy to tell him, \"If you don't marry me, your country will be annihilated.\"",
        "source": "T22n1421_021:0141a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋共議：「當設何方，免彼兇虐，而不違我國之舊典？」",
        "translation": "The scholars all discussed, \"What method will be found to prevent their fierce acts and not violate our country's old ways?\"",
        "source": "T22n1421_021:0141a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僉曰：「正當簡一好婢，有姿色者，極世莊嚴，號曰釋種，而以與之。」",
        "translation": "The council said, \"It's time to find a good maid of excellent beauty and worldly splendor named Śākya, and give her to him.\"",
        "source": "T22n1421_021:0141a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如議，即與波斯匿王備禮娉迎。",
        "translation": "As suggested, he went to King Prasenajit to pay homage to him and welcome him.",
        "source": "T22n1421_021:0141a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後生一男，顏貌殊絕，勅諸相師依相立字。",
        "translation": "He then gave birth to a boy with an extraordinary face and ordered the masters to create a name based on his features.",
        "source": "T22n1421_021:0141a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸相師言：「王本以威，而得其母，依義應當字曰琉璃。」",
        "translation": "The masters said, \"The king originally had a dignified mother; according to its meaning, he should name it Lurie.\"",
        "source": "T22n1421_021:0141a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至年八歲，王欲教學，作是念：「諸藝之中射為最勝，閻浮提界唯有釋種。",
        "translation": "When he was eight years old, the king wanted to train and had this thought, \"Of all the arts, archery is the most superior, and there's only the Śākyamuni variety in the world of Jambudvīpa.",
        "source": "T22n1421_021:0141a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為菩薩時射一由旬又一拘樓舍，釋摩南射一由旬，最下手者不減一拘樓舍。",
        "translation": "When the Buddha was a bodhisattva, he shot for a yojana and a kuruśa, and Śāmāṇan shot for a yojana, but the most skillful shot is not less than a kuruśa.",
        "source": "T22n1421_021:0141a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當令吾子就外氏學！」",
        "translation": "We will have our son learn from a non-Buddhist!\"",
        "source": "T22n1421_021:0141a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即勅大臣子弟侍從太子，就釋摩南請受射法。",
        "translation": "He commanded his ministers and their disciples to attend on the prince and ask him to accept the archery teaching at Śrāmaṇerī.",
        "source": "T22n1421_021:0141a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸釋新造大堂，共作重要：「先供養佛及諸弟子，然後我等乃處其中。」",
        "translation": "The Śākyas had then newly built a large hall, and they all made an important announcement, \"First, we'll make offerings to the Buddha and his disciples, and then we'll go inside.\"",
        "source": "T22n1421_021:0141a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "琉璃太子與其眷屬輒入遊戲，諸釋見之，瞋忿罵言：「下賤婢子，我不以汝為良福田！",
        "translation": "When the lapis lazuli prince and his retinue quickly entered the game hall, the Śākyas saw them and angrily rebuked them, saying, \"You lowly maidservant, I won't consider you a good field of merit!",
        "source": "T22n1421_021:0141a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何世尊未入中坐，而敢在先？」",
        "translation": "How did the Bhagavān dare to precede you before you entered the middle seat?\"",
        "source": "T22n1421_021:0141a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "琉璃太子即大忿恨，勅一人言：「汝憶在心，我為王時便以白我！」",
        "translation": "The prince then became very angry and commanded one person to say, \"Remember this in your mind, and tell me about it when I'm king!\"",
        "source": "T22n1421_021:0141a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便出去。",
        "translation": "They then went out.",
        "source": "T22n1421_021:0141a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋於後掘去堂土，更為新地，然後請佛及僧於中設食，演說妙法。",
        "translation": "The Śākyas then dug up the earth of the hall and made a new site, where they invited the Buddha and the saṃgha to serve a meal and expound the wonderful Dharma.",
        "source": "T22n1421_021:0141a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "琉璃太子知射法已，還舍衛城，少年之中便紹王位，先共學人皆居要職。",
        "translation": "After he learned about the archery teaching, Prince Rājagṛha returned to Śrāvastī and installed himself as king among the youths, with his former fellow trainees in key positions.",
        "source": "T22n1421_021:0141a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔受教臣便白王言：「王憶某時諸釋罵不？」",
        "translation": "The ministers who had been taught in the past then said to the king, \"Does the king remember a time when the Śākyas rebuked him?\"",
        "source": "T22n1421_021:0141a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我憶！」",
        "translation": "Wang Yan: \"I recall!\"",
        "source": "T22n1421_021:0141a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣復白言：「今不報之，復欲何待？」",
        "translation": "Again, I said, \"If I don't retaliate now, what else do I want to do?\"",
        "source": "T22n1421_021:0141a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞其語，即嚴四種兵，往伐諸釋。",
        "translation": "When the king heard what he said, he decorated four kinds of troops and went to attack the Śākyas.",
        "source": "T22n1421_021:0141a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊聞之，即於路側，坐無蔭舍夷樹下。",
        "translation": "When the Bhagavān heard this, he sat down on the side of the road under the shadeless Śākya tree.",
        "source": "T22n1421_021:0141a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王遙見佛，下車步進，頭面禮足，白佛言：「世尊！",
        "translation": "Seeing the Buddha from a distance, the king stepped down, saluted him with his head and feet, and said to him, \"Bhagavān!",
        "source": "T22n1421_021:0141a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "好樹甚多，何故乃坐此無蔭樹下？」",
        "translation": "There are so many beautiful trees, why are you sitting under this shadeless tree?\"",
        "source": "T22n1421_021:0141a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊答言：「親族蔭樂。」",
        "translation": "The Bhagavān answered, \"The family is overwhelmed with joy.\"",
        "source": "T22n1421_021:0141a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知佛意愍念諸釋，即迴軍還，如是再反。",
        "translation": "Knowing that the Buddha's intention was to take pity on the Śākyas, the king returned with his army and did so again.",
        "source": "T22n1421_021:0141a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼臣又復如前白王，王便嚴駕往伐諸釋。",
        "translation": "The minister again told the king as before, and the king then drove his car in full force to attack the Śākyas.",
        "source": "T22n1421_021:0141a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知諸釋宿對叵避，便止不出。",
        "translation": "Knowing that the Śākyas couldn't avoid their past confrontations, the Buddha stopped them and didn't come back.",
        "source": "T22n1421_021:0141a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋聞琉璃王來伐其國，亦嚴四兵出相御逆，去一由旬以箭射之，或從耳穿中過，或斷其髮，鏟髮令盡，鬚眉無餘，及諸戰具一時斷壞，而不傷肉。",
        "translation": "When the Śākyas heard that King Lüzhi had come to invade their country, he also sent out four soldiers to defend it against them. They went away for a leap of a second and shot them with arrows, either piercing their ears or cutting their hair, shaving their heads so that it was gone, leaving their beards and eyebrows untouched, and cutting off their battle gear without harming their flesh.",
        "source": "T22n1421_021:0141b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "琉璃王問左右言：「諸釋去此近遠？」",
        "translation": "The king of lapis lazuli asked his entourage, \"How close or distant are the noble ones from here?\"",
        "source": "T22n1421_021:0141b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「去此一由旬。」",
        "translation": "He replied, \"It's a leap of faith from here.\"",
        "source": "T22n1421_021:0141b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王大怖言：「軍鋒未交，已尚如此，若當相接吾軍敗矣！",
        "translation": "The king was terrified, saying, \"Even before the armies meet, they're already like this; if they were to meet, our army would be defeated!",
        "source": "T22n1421_021:0141b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不如反國，圖全為幸！」",
        "translation": "Why don't we turn against our country and try to make a success of it all?\"",
        "source": "T22n1421_021:0141b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼一臣白言：「釋種皆持五戒，寧失身命，終不害物。",
        "translation": "One of his ministers then said, \"The Śākyas all observe the five precepts, so they would rather lose their lives than harm property.",
        "source": "T22n1421_021:0141b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王但進軍，勿憂喪敗！」",
        "translation": "The king can simply advance his army and not worry about losing it!\"",
        "source": "T22n1421_021:0141b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即從之，勅軍進前。",
        "translation": "The king then complied and ordered his army to advance.",
        "source": "T22n1421_021:0141b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋種還城，閉門自守，琉璃王遣使語言：「若即開門，當有免者；若吾攻得，不赦一人。」",
        "translation": "When Śākya returned to the city and closed his gates to defend himself, the king sent an envoy to say, \"If you open the gates now, there will be those who are spared; if I succeed in attacking them, I won't pardon a single person.\"",
        "source": "T22n1421_021:0141b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時目連聞琉璃王欲攻舍夷，白佛言：「願佛聽我化作鐵籠，籠彼大城！」",
        "translation": "When Maudgalyāyana heard that the king of Lapis was about to attack Śākyamuni, he said to the Buddha, \"May the Buddha hear me transform myself into an iron cage to trap that great city!\"",
        "source": "T22n1421_021:0141b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「汝雖有神力，何能改此定報因緣？」",
        "translation": "The Buddha told Maudgalyāyana, \"Even though you have supernormal powers, how could you change the causes and conditions of this definite retribution?\"",
        "source": "T22n1421_021:0141b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以此義，即說偈言：「夫業若黑白，　　終不有腐敗，　雖久要當至，　　還在現前受；　非空非海中，　　非入山石間，　莫能於是處，　　得免宿命殃；　報應之所牽，　　無近遠幽深，　自然趣其中，　　隨處無不定。」",
        "translation": "With this in mind, the Buddha spoke in verse, saying, \"Suppose a man's karma is black and white and never corrupts, though it will eventually come to pass in the future, he'll still experience it in the present; it's not empty, not in the ocean, not among rocks and mountains; there's no place where he can escape the perils of past lives; there's no nearness or remoteness, nor depth or distance, and he naturally goes therein, following no uncertainty about where he goes.\"",
        "source": "T22n1421_021:0141b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸釋見彼軍盛，或言開門取全、或言以死固守，紛紜不定，便共行籌，以少從眾。",
        "translation": "Seeing that army in full force, the ascetics either said they'd open the gate and take them all or said they'd die trying to hold on to them, and there was a wide variety of opinions, so they all worked together to find a way to follow the few.",
        "source": "T22n1421_021:0141b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬在開門眾中，七反取籌，開門籌多，即便開之。",
        "translation": "When Māra Pāpīyān was among those who opened the gate, he took seven counter-checks and opened the gate when there were many.",
        "source": "T22n1421_021:0141b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "琉璃王得城已，宣令三軍：「一切釋種皆悉殺之，若非釋種慎勿有害！」",
        "translation": "After he gained possession of the city, King Lazuli ordered his three armies, \"Kill all the noble ones; if they aren't noble, don't harm them!\"",
        "source": "T22n1421_021:0141b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三億釋聞，皆捉蘆出言：「我是持蘆釋。」",
        "translation": "When the 300,000,000 Śākyamunis heard this, they all grabbed a reed and said, \"I'm Śākyamuni, the holder of the reed.\"",
        "source": "T22n1421_021:0141b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "屯門者信，放令得去。",
        "translation": "Believing this, the monk released them and allowed them to go.",
        "source": "T22n1421_021:0141b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是釋摩南到琉璃王所，琉璃王以為外家公，白言：「阿公！",
        "translation": "Shamanan then went to King Lüri and, thinking he was a layman, he said, \"Ah Gong!",
        "source": "T22n1421_021:0141b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲求何願？」",
        "translation": "What vows do you desire?\"",
        "source": "T22n1421_021:0141b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「願莫復殺我諸親！」",
        "translation": "He replied, \"I hope you won't kill my relatives again!\"",
        "source": "T22n1421_021:0141b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「此不可得，更求餘願！」",
        "translation": "The king said, \"This is unobtainable; seek another vow!\"",
        "source": "T22n1421_021:0141b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言：「願從我沒水至出，於其中間聽諸釋出，凡得出者不復殺之。」",
        "translation": "He also said, \"May I submerge myself in water until I emerge, and then I'll listen to the releases that emerge from it, and whoever emerges won't be killed again.\"",
        "source": "T22n1421_021:0141b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "琉璃王作是念：「水底須臾，何為不可？」",
        "translation": "The king of lapis lazuli then thought, \"Why wouldn't it be possible if it were just a moment underwater?\"",
        "source": "T22n1421_021:0141c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便許之。",
        "translation": "Even so, he agreed.",
        "source": "T22n1421_021:0141c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋摩南便解頭沐沒，以髮繫水中樹根，遂不復出。",
        "translation": "Śāmāṇan then took off his head and threw it away, tying his hair to the root of a tree in the water, and it wouldn't come back out.",
        "source": "T22n1421_021:0141c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王怪其久，使人入水看之，見其已死，髮繫樹根，以此白王。",
        "translation": "The king wondered about him for a long time, so he had someone go into the water to look at him and see him dead with his hair tied to the root of a tree and tell the king about it.",
        "source": "T22n1421_021:0141c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王便歎言：「乃能為親不惜身命！」",
        "translation": "The king then praised him, saying, \"How could you spare your life for your relatives?\"",
        "source": "T22n1421_021:0141c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即宣令三軍：「若復有殺釋種者，軍法罪之。」",
        "translation": "He then ordered the three armies, \"If anyone else kills a member of the Śākya clan, the army will be punished.\"",
        "source": "T22n1421_021:0141c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘聞琉璃王誅殺舍夷國人，以是白佛。",
        "translation": "The monks then heard that King Lüri had killed the people of Śākyamuni and told the Buddha so.",
        "source": "T22n1421_021:0141c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「琉璃王愚癡！",
        "translation": "The Buddha told the monks, \"The king of Lapis was foolish!",
        "source": "T22n1421_021:0141c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "却後七日，當受害學人罪，其眷屬大小亦俱併命。」",
        "translation": "Seven days after they retire, they'll be victimized by the sins of the trainees, and their dependents will be killed along with them.\"",
        "source": "T22n1421_021:0141c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "琉璃王聞佛此教，心念：「佛無空言，餘苦尚可，唯畏火燒！」",
        "translation": "Hearing this teaching from the Buddha, the king of Lapis thought, \"The Buddha doesn't say anything in vain; the rest of the suffering is still tolerable, except for the fear of being burned by fire!\"",
        "source": "T22n1421_021:0141c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即與眷屬乘船入阿夷河，七日期至，水忽暴漲，於是覆沒，一時死盡。",
        "translation": "He entered the Ajita River in a boat with his retinue, and when the water suddenly rose seven days later, he was overtaken by a sudden surge, and he died instantly.",
        "source": "T22n1421_021:0141c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋破滅之餘，被剝赤肉，到諸比丘所語言：「我是釋種，世尊親族。",
        "translation": "After they perished, the Śākyas were stripped of their red flesh and went to the monks and said, \"I'm a member of the Śākyas, a relative of the Bhagavān.",
        "source": "T22n1421_021:0141c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願乞少衣！」",
        "translation": "I'd like to beg for a small amount of clothing!\"",
        "source": "T22n1421_021:0141c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不敢與，作是念：「佛未聽我等與諸釋衣。」",
        "translation": "The monks didn't dare to give them, but they thought, \"The Buddha hasn't heard us give the robes of the Śākyas.\"",
        "source": "T22n1421_021:0141c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽與。」",
        "translation": "They therefore said to the Buddha, \"Grant it!\"",
        "source": "T22n1421_021:0141c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五戒優婆塞被剝，來至諸比丘所借衣。",
        "translation": "Another five-ordered layman was stripped of his robes and came to the monks to borrow them.",
        "source": "T22n1421_021:0141c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不敢借，語言：「佛未聽我等借優婆塞衣。」",
        "translation": "The monks didn't dare borrow them, but they said, \"The Buddha hasn't heard of our borrowing the upāsaka's robes.\"",
        "source": "T22n1421_021:0141c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽借。",
        "translation": "They therefore said to the Buddha, \"We'll borrow it.",
        "source": "T22n1421_021:0141c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若還，應取；若不還，則與。」",
        "translation": "If you return it, you should take it; if you don't return it, then give it to him.\"",
        "source": "T22n1421_021:0141c18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時跋難陀為安居施故，二處結安居。",
        "translation": "It was then that Pūrṇa Maitrāyaniputra formed a retreat in two places for the purpose of giving a retreat.",
        "source": "T22n1421_021:0141c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「二處皆應各與半分。」",
        "translation": "The monks therefore told the Buddha, and he said, \"Each of these two places should be given half.\"",
        "source": "T22n1421_021:0141c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘在路行，不收攝衣，曳地污裂。",
        "translation": "The monks were walking along the road when they didn't put away their robes, and they were torn to pieces as they fell to the ground.",
        "source": "T22n1421_021:0141c21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾，犯者突吉羅！",
        "translation": "They therefore said to the Buddha, \"No, that's a violation, Turkila!",
        "source": "T22n1421_021:0141c22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作囊盛。」",
        "translation": "You should make a bag to carry it in.\"",
        "source": "T22n1421_021:0141c23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘作囊太長，以是白佛，佛言：「不應爾！",
        "translation": "The monks made the bag too long and told the Buddha so, and he said, \"No!",
        "source": "T22n1421_021:0141c23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極長使前至臍，後至腰。」",
        "translation": "It's extremely long, reaching from the front to the navel and from the back to the waist.\"",
        "source": "T22n1421_021:0141c24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以貴價物作衣囊，以是白佛，佛言：「不應爾！",
        "translation": "The monks made a valuable object into a robe bag and told the Buddha so, but he said, \"That shouldn't be!",
        "source": "T22n1421_021:0141c24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應用麁物作。」",
        "translation": "You should use debilitating substances to make them.\"",
        "source": "T22n1421_021:0141c26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘在路行，趣倩人擔衣，亦趣為人擔，或自失衣、或失他衣。",
        "translation": "There are monks walking along the road who are interested in taking someone's robe and carrying it for someone else, or who lose their own robe or the robe of another.",
        "source": "T22n1421_021:0141c26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！",
        "translation": "They therefore said to the Buddha, \"That shouldn't be the case!",
        "source": "T22n1421_021:0141c27_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若倩人擔衣，應先出示；若為人擔衣，應出看之。」",
        "translation": "If you accept a person's robe, you must first show it to them; if you carry a person's robe, you must let them see it.\"",
        "source": "T22n1421_021:0141c28_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘盛衣囊中，縫合其口，欲取艱難。",
        "translation": "The monks put their robes in a bag, sewed the mouth shut, and wanted to make it difficult for them to retrieve them.",
        "source": "T22n1421_021:0141c29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！",
        "translation": "They therefore said to the Buddha, \"No!",
        "source": "T22n1421_021:0142a01_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作帶繫。",
        "translation": "It should be fastened with a belt.",
        "source": "T22n1421_021:0142a01_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非常須，亦聽縫之。」",
        "translation": "If it's not essential, you can sew it up.\"",
        "source": "T22n1421_021:0142a02_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘舉欽婆羅、劫貝衣各著一處，生虫咬壞。",
        "translation": "The monks held up the kambala and the karpāsa in one place, and insects bit and damaged them.",
        "source": "T22n1421_021:0142a02_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應以劫貝間欽婆羅，然後用屈尸羅香、那毘羅香、青木香，如是諸香辟虫者著中。」",
        "translation": "They therefore said to the Buddha, \"You should put kambala between the karpāras, and then use kuśīla, nabira, and green wood scents, such as these, to ward off insects.\"",
        "source": "T22n1421_021:0142a03_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘後取衣不復識，以是白佛，佛言：「應題名，作幟。",
        "translation": "The monks who later took the robe and didn't recognize it again said to the Buddha, \"The Buddha said, 'You should name it and make it a banner.'",
        "source": "T22n1421_021:0142a05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘舉衣經十二年，不還取者，應集僧平價，作四方僧用。",
        "translation": "If a monk has held up his robe for 12 years and doesn't take it back, he should gather the monks' fair price and make it available to the four monks.",
        "source": "T22n1421_021:0142a07_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼比丘後還，以四方僧物償，若不受者善！」",
        "translation": "If that monk later returns it, he'll pay the four directions with the property of the saṃgha, but if he doesn't accept it, good for him!\"",
        "source": "T22n1421_021:0142a08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難得施衣不須，為舍利弗受，即使一比丘持衣與之。",
        "translation": "Ānanda then obtained an offering of clothing that he didn't need and accepted it for Śāriputra, even though a monk had taken it and given it to him.",
        "source": "T22n1421_021:0142a09_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘作是念：「舍利弗幸多供養，而我無衣。",
        "translation": "That monk thought, \"Śāriputra is fortunate enough to make many offerings, but I have no robe.",
        "source": "T22n1421_021:0142a10_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當作同意取！」",
        "translation": "Now, I'll take it as an agreement!\"",
        "source": "T22n1421_021:0142a11_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便著之。",
        "translation": "They then attached themselves to it.",
        "source": "T22n1421_021:0142a12_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後生疑，以是白佛，佛言：「彼雖為受，而未是已捨。",
        "translation": "He then had doubts and told the Buddha this, and he said, \"Even though he's accepting it, he hasn't yet given it up.",
        "source": "T22n1421_021:0142a12_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於所與比丘，作同意取受持，非善取受持；若於所受比丘，作同意取受持，是善取受持。」",
        "translation": "If he takes and retains what he's given to a monk, it's not a good taking and retaining; if he takes and retains what he's given to a monk, it's a good taking and retaining.\"",
        "source": "T22n1421_021:0142a13_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難復得腰繩不須，為阿那律受，亦使一比丘持往，語言：「此繩已屬阿那律。」",
        "translation": "Ānanda then obtained a waistband without necessity, accepted it for Aniruddha, and had a monk carry it to him, saying, \"This cord already belongs to Aniruddha.\"",
        "source": "T22n1421_021:0142a15_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘亦如上念，取後生疑。",
        "translation": "That monk also had the same thought, and doubts arose after he took it.",
        "source": "T22n1421_021:0142a17_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「彼言已屬阿那律，是為已捨。",
        "translation": "He then said to the Buddha, \"He said it belongs to Aniruddha, and this is considered having abandoned it.",
        "source": "T22n1421_021:0142a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於所與比丘，作同意取受持，是善取受持；若於能使比丘，作同意取受持，非善取受持。」",
        "translation": "If he takes and retains what he's given to a monk, it's a good taking and retaining; if he takes and retains what he can get to a monk, it's not a good taking and retaining.\"",
        "source": "T22n1421_021:0142a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘不著襯身衣披僧被，污泥不淨，為鼠咬壞。",
        "translation": "The monks then wore monk's blankets without their undergarments, and their filth was impure and damaged by the bite of a rat.",
        "source": "T22n1421_021:0142a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾，犯者突吉羅！」",
        "translation": "They therefore said to the Buddha, \"Don't do that, you violator!",
        "source": "T22n1421_021:0142a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘作襯身衣，大小如僧祇支，或如泥洹僧。",
        "translation": "Six groups of monks then made robes to match the body, either the size of a saṃgha or the size of a nun.",
        "source": "T22n1421_021:0142a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！",
        "translation": "They therefore said to the Buddha, \"No!",
        "source": "T22n1421_021:0142a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應三種作：上者，從覆頭下至踝，舒覆左手掩令等沒；中者，從覆頭下至半脛，舒覆左臂掩等至腕；下者，從覆頭下至膝，舒覆左臂掩等半肘。」",
        "translation": "There are three ways to do this: up, from covering the head down to the ankles, stretching the left arm to cover it equally; in the middle, from covering the head down to half a shin, stretching the left arm to cover it equally up to the wrist; and down, from covering the head down to the knees, stretching the left arm to cover it equally up to half an elbow.\"",
        "source": "T22n1421_021:0142a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不以襯身衣通覆右肩，而通披僧被，污泥不淨，為鼠所咬。",
        "translation": "The monks did not cover their right shoulder with the full-body robe but instead covered it with the monks' quilt, which was so dirty and impure that it was bitten by rats.",
        "source": "T22n1421_021:0142a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！」",
        "translation": "They therefore told the Buddha, and he said, \"No!\"",
        "source": "T22n1421_021:0142b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘受經時、問訊和尚、阿闍梨時，披僧被，偏袒垂地；或夜起行，不能收攝，亦委於地，泥土污之。",
        "translation": "When accepting a sūtra or inquiring about a monk or ācārya, some monks put on their monks' blankets and bare their sides to the ground; sometimes they get up at night and walk around, and when they can't put them away, they put them on the ground and stain them with dirt.",
        "source": "T22n1421_021:0142b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「受經、問訊，應偏袒，舉使離地。",
        "translation": "He therefore said to the Buddha, \"When you receive a sūtra or an audience with a monk or a priest, you must bare your bosom and lift it off the ground.",
        "source": "T22n1421_021:0142b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜起時，應收攝通披，勿令污泥。」",
        "translation": "When you get up at night, you must put away your robe and keep it off the dirt.\"",
        "source": "T22n1421_021:0142b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘著僧被，裂，不補治。",
        "translation": "The monks put on the monks' blankets, which were torn and not mended.",
        "source": "T22n1421_021:0142b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應補治。」",
        "translation": "They then said to the Buddha, \"It should be patched.\"",
        "source": "T22n1421_021:0142b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知誰應補治，佛言：「若冬四月、夏三月，用者應治。」",
        "translation": "Not knowing who should mend it, the Buddha said, \"If you use it in the fourth month of winter or the third month of summer, you should mend it.\"",
        "source": "T22n1421_021:0142b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘於阿練若處住，去時不舉僧臥具，致使爛壞。",
        "translation": "There were monks living in Araṇya who didn't lift their monks' bedding when they left, which caused it to rot.",
        "source": "T22n1421_021:0142b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應寄聚落中。",
        "translation": "They therefore said to the Buddha, \"They should put them in a village.",
        "source": "T22n1421_021:0142b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無寄處，應還作房主。",
        "translation": "If there's no place to put them, you should return to being the householder.",
        "source": "T22n1421_021:0142b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有疑畏，聚落人民皆悉移去，亦應運持至安隱處。」",
        "translation": "If there's any doubt, the people of the village will all remove it, and it should be carried to a place of comfort.\"",
        "source": "T22n1421_021:0142b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不隨後視臥具，致有零落。",
        "translation": "The monks didn't look after the bedding, which had fallen apart.",
        "source": "T22n1421_021:0142b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應隨後看。」",
        "translation": "They therefore said to the Buddha, \"You should take a look at them afterward.\"",
        "source": "T22n1421_021:0142b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既到安隱處，彼諸比丘不與房住，亦不與房安諸衣物。",
        "translation": "Once they arrived at the hermitage, the monks didn't stay in their rooms or put their clothes there.",
        "source": "T22n1421_021:0142b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「皆應與之。",
        "translation": "They therefore told the Buddha, and he said, \"You should give them all to them.",
        "source": "T22n1421_021:0142b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若先處不復立，應即在住處用之；若後還立，應持餘者還；若已盡無餘，彼處比丘應少多分與。」",
        "translation": "If it wasn't re-established in the first place, you should use it right there where you live; if it was re-established later, you should take the rest and return it; if there's nothing left after that, the monks there should share it with a little more.\"",
        "source": "T22n1421_021:0142b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘以此房臥具，於彼房用。",
        "translation": "Some monks took this bedding from their living quarters and used it in their living quarters.",
        "source": "T22n1421_021:0142b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸房主譏呵言：「云何以我房物，於餘房用？",
        "translation": "The monks in charge of the monks' quarters ridiculed them, saying, \"Why are you using the things in my quarters in another quarters?",
        "source": "T22n1421_021:0142b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此則不與取也！」",
        "translation": "This, then, is not to be taken!\"",
        "source": "T22n1421_021:0142b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！」",
        "translation": "He therefore said to the Buddha, \"No!\"",
        "source": "T22n1421_021:0142b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸客比丘欲問訊師及受經，著住房臥具至彼房，房主比丘不聽。",
        "translation": "Some visiting monks wanted to ask about the master and the sūtras they'd received, so they took their bedding into their room, but the monks in charge of the room wouldn't listen.",
        "source": "T22n1421_021:0142b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應先語本房比丘，若聽者善；若不聽，亦著持去。",
        "translation": "They then said to the Buddha, \"You should first tell the monk in the monk's room that it's good if he listens; if he doesn't listen, he should also take them with him and leave.",
        "source": "T22n1421_021:0142b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於彼遠行，應送還本房。」",
        "translation": "If you travel far away from there, you should return him to his house.\"",
        "source": "T22n1421_021:0142b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘著僧衣，入溫室及作食處，入僧中食及左右便利，烟熏污泥。",
        "translation": "Some monks dressed in monk's robes went into the monk's greenhouse and into the food preparation area, where they ate in the monk's living quarters and smoked the sludge around them.",
        "source": "T22n1421_021:0142b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！」",
        "translation": "They said to the Buddha, \"That's not right!\"",
        "source": "T22n1421_021:0142b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸病比丘須著至諸處，不敢，以是白佛。",
        "translation": "Those monks who were sick and needed to go to various places didn't dare, so they said to the Buddha.",
        "source": "T22n1421_021:0142b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有病聽著至餘處，但愛護之。",
        "translation": "The Buddha said, \"If you're sick, listen to them as they go to other places, but take care of them.",
        "source": "T22n1421_021:0142b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯不得著大小便利！」",
        "translation": "Only don't attach yourself to small or large conveniences!\"",
        "source": "T22n1421_021:0142b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘著上下衣，持廣五指衣片，當三衣而入聚落。",
        "translation": "Six groups of monks then put on their upper and lower garments, took a wide five-finger patch of clothing, and entered the colony while wearing the three garments.",
        "source": "T22n1421_021:0142c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘見，問言：「世尊不制，不著三衣，不得入聚落耶？」",
        "translation": "When the monks saw this, they asked, \"Doesn't the Bhagavān regulate that if you don't wear the three robes, you won't be allowed to enter the colony?\"",
        "source": "T22n1421_021:0142c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘即以衣片示言：「此是我三衣。」",
        "translation": "The six groups of monks then showed them pieces of their robes, saying, \"These are my three robes.\"",
        "source": "T22n1421_021:0142c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸長老比丘種種呵責，以是白佛。",
        "translation": "The elder monks rebuked them in various ways and told the Buddha so.",
        "source": "T22n1421_021:0142c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，問六群比丘：「汝實爾不？」",
        "translation": "In response, the Buddha gathered the monks and asked the six groups of monks, \"Is that true?\"",
        "source": "T22n1421_021:0142c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "They replied, \"That's true.",
        "source": "T22n1421_021:0142c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T22n1421_021:0142c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種呵責已，告諸比丘：「不應爾，犯者突吉羅！",
        "translation": "After the Buddha had rebuked them in various ways, he told the monks, \"You shouldn't have done that, you violator!",
        "source": "T22n1421_021:0142c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今聽作上中下三衣，如襯身衣量。」",
        "translation": "From now on, you'll hear the three upper, middle, and lower garments made according to the amount of clothing worn by the buddha.\"",
        "source": "T22n1421_021:0142c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一住處僧得可分衣，一比丘持至戒壇上獨取受持。",
        "translation": "A monk from one abode was given a share of the robes, and a monk took them to the ordination platform and accepted them alone.",
        "source": "T22n1421_021:0142c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾，犯者突吉羅！",
        "translation": "He then said to the Buddha, \"Don't do that, you violator!",
        "source": "T22n1421_021:0142c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在僧應分。」",
        "translation": "Now the saṃgha should share it.\"",
        "source": "T22n1421_021:0142c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一上座比丘與諸比丘遊行人間，其中有客、有舊，得可分衣少，不足分。",
        "translation": "There was a superior monk who traveled with other monks among the people, some of whom were guests and some of whom were old, and who had obtained a share of acceptable clothing that was too small to be shared.",
        "source": "T22n1421_021:0142c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「舊比丘應語客比丘言：『長老！",
        "translation": "He therefore told the Buddha, who said, \"The old monk should say to the guest monk, 'Elder!",
        "source": "T22n1421_021:0142c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此衣少，不可分。』",
        "translation": "This robe is too small to be shared.'",
        "source": "T22n1421_021:0142c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客比丘若言：『并持相與。』",
        "translation": "If a visiting monk says, 'Give it to him as a hand-me-down.'",
        "source": "T22n1421_021:0142c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應取；若言：『乃至一縷亦不相與。』",
        "translation": "you should take it; if you say, 'Not even a single thread of it should be given to each other.'",
        "source": "T22n1421_021:0142c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便應共分。」",
        "translation": "Then they should share it.\"",
        "source": "T22n1421_021:0142c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客比丘語舊比丘亦如是。",
        "translation": "A guest monk says to an old monk, 'So it is.'",
        "source": "T22n1421_021:0142c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘取覆塚衣，塚主失衣，借問：「誰取我覆塚衣？」",
        "translation": "A monk who had taken a robe to cover his grave lost it and asked, 'Who took my robe to cover the grave?'\"",
        "source": "T22n1421_021:0142c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人答言：「諸比丘取！」",
        "translation": "Someone replied, \"Monks, take it!\"",
        "source": "T22n1421_021:0142c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便瞋呵言：「諸比丘偷我先人衣！」",
        "translation": "He then angrily rebuked them, saying, \"Monks, you stole my ancestors' robes!\"",
        "source": "T22n1421_021:0142c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸長老比丘聞，以是白佛，佛言：「不應取！",
        "translation": "When the elder monks heard this, they said to the Buddha, \"Don't take it!",
        "source": "T22n1421_021:0142c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聚落移去，於後有者，聽作糞掃衣意取。」",
        "translation": "If the village removes it and there's one after it, listen and take it with the intention of making it a sweeping robe.\"",
        "source": "T22n1421_021:0142c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘取神廟中幡蓋亦如是。",
        "translation": "It's likewise when monks take banners and shrines.",
        "source": "T22n1421_021:0142c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘往鬪戰處取死人衣，軍人譏呵言：「此諸比丘欲令我等多殺人！」",
        "translation": "When some monks go to a place where there's a fight to get robes for the dead, the soldiers ridicule them, saying, 'These monks want to make us kill more people!'\"",
        "source": "T22n1421_021:0142c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸長老比丘聞，以是白佛，佛言：「不應爾！」",
        "translation": "When the elder monks heard this, they said to the Buddha, \"No!\"",
        "source": "T22n1421_021:0142c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘少知識，欲鬪戰處取死人衣，不敢往。",
        "translation": "There were monks with few friends who wanted to fight in a place where they could obtain clothing for the dead but didn't dare to go.",
        "source": "T22n1421_021:0142c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽軍人去後取。」",
        "translation": "They then said to the Buddha, \"Listen, take them after the soldiers have left.\"",
        "source": "T22n1421_021:0142c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸白衣，軍人去後，收斂骨肉尸喪，見諸死尸悉被剝脫，不可復識，便譏呵言：「云何比丘剝我親里衣？",
        "translation": "When some white monks gathered up the bones and corpses of the dead after the soldiers had left and saw that the dead bodies had all been stripped off and could no longer be recognized, they ridiculed them, saying, \"How did that monk strip off my intimate robes?",
        "source": "T22n1421_021:0142c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有衣者，便應可識。」",
        "translation": "If there's a robe, then you should be able to recognize it.\"",
        "source": "T22n1421_021:0142c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「聽無人見時取。」",
        "translation": "The monks thus told the Buddha, who said, \"Listen, no one takes them when they see them.\"",
        "source": "T22n1421_021:0142c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至殺人處取衣亦如是。",
        "translation": "So it is when you go to a place where a person has been killed and take his robes.",
        "source": "T22n1421_021:0142c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘取死人衣，不壞作比丘衣畜。",
        "translation": "Some monks take the robes of a dead person and make them into a monk's robe without breaking them.",
        "source": "T22n1421_021:0143a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸白衣見言：「此是我親里衣！」",
        "translation": "When the white monks see this, they say, \"This is my relative's robe!\"",
        "source": "T22n1421_021:0143a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便向啼泣。",
        "translation": "They then turned to the Buddha and wept.",
        "source": "T22n1421_021:0143a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「應速壞作比丘衣畜；若鐵器，應速用作大小鉢、戶鉤諸所須物。」",
        "translation": "The monks told the Buddha this, and he said, \"They should quickly make monks' robes and animals, and if they have iron utensils, they should quickly use them as large and small bowls, household hooks, and other necessary items.\"",
        "source": "T22n1421_021:0143a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一家大富，賊劫之不能盡持去，留藏糞掃。",
        "translation": "There was a rich family that thieves robbed and couldn't take all of it away, leaving it hidden in a sweeping dustbin.",
        "source": "T22n1421_021:0143a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中後還欲取，晝日未敢進，遙伺望之。",
        "translation": "When he returned, he wanted to take it, but he didn't dare to enter it for a few days, waiting for it from a distance.",
        "source": "T22n1421_021:0143a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘拾糞掃衣，到彼藏物處，見衣角出便取之。",
        "translation": "A monk picked up the sweepings and went to where he had hidden them, saw the corner of the robe coming out, and took it.",
        "source": "T22n1421_021:0143a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊遙語言：「大德！",
        "translation": "The thief said from a distance, \"Mañjuśrī!",
        "source": "T22n1421_021:0143a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫取我物。」",
        "translation": "Don't take my things.\"",
        "source": "T22n1421_021:0143a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遭劫家聞，識是賊，縛送官中，官即殺之。",
        "translation": "When the robber's family hears about this, they recognize him as a thief, bind him, and send him to the officer, who then kills him.",
        "source": "T22n1421_021:0143a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊被縛時，作是語：「若比丘不取我衣，彼何由識我？",
        "translation": "When he was bound, the thief said, \"If that monk didn't take my clothing, how could he know me?",
        "source": "T22n1421_021:0143a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為比丘殺我，非是彼人！」",
        "translation": "This is the monk who killed me, not that other person!\"",
        "source": "T22n1421_021:0143a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「若舉時重，不應取。」",
        "translation": "The monks said this to the Buddha, who said, \"If you're heavy when you lift something, you shouldn't take it.\"",
        "source": "T22n1421_021:0143a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘於街巷中視地而行，諸白衣見，或言覓錢、或言覓糞掃衣。",
        "translation": "There were monks walking in a street, looking at the ground, who were met by white robes and said, 'Look for money,' or 'Look for a sweeping robe.'",
        "source": "T22n1421_021:0143a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一外道弟子以衣裹錢著道中，比丘見拾取，便語眾人言：「諸比丘果是覓錢。」",
        "translation": "A lay disciple wrapped a monk's robe in money and put it in the road. When the monk saw it being picked up, he said to the crowd, \"Monks, this is really looking for money.\"",
        "source": "T22n1421_021:0143a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「不應取街巷中裹物。」",
        "translation": "The monks then said to the Buddha, \"The monks said, 'You shouldn't take what's wrapped up in the streets.'\"",
        "source": "T22n1421_021:0143a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一比丘為衣故至塚間，見一新死女人頭前有函。",
        "translation": "A monk went into a tomb for clothing and saw a new dead woman with a letter in front of her head.",
        "source": "T22n1421_021:0143a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘謂是空函，便取持歸，到所住處開視，見有諸嚴身具，不知云何？",
        "translation": "Supposing he thought it was an empty letter, he took it, returned it, opened it where he was staying, and saw that there were ornamental body parts.",
        "source": "T22n1421_021:0143a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「取時應先開視，若不視取，突吉羅。」",
        "translation": "He therefore said to the Buddha, \"You must first open your eyes when you take it; if you don't take it with your eyes open, it's a tukhāra.\"",
        "source": "T22n1421_021:0143a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘與外道共道行，為賊所殺。",
        "translation": "A monk traveling with a non-Buddhist on the path is killed by a thief.",
        "source": "T22n1421_021:0143a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘便取其衣，不壞色作比丘衣。",
        "translation": "The monk then took his robe and made it into a monk's robe without destroying its color.",
        "source": "T22n1421_021:0143a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘外道見之，言：「此是我親里衣，諸比丘必殺而取！」",
        "translation": "When the other heretics see this, they say, \"This is my personal undergarment, which the monks will surely kill and take!\"",
        "source": "T22n1421_021:0143a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「不應取！",
        "translation": "The monks said this to the Buddha, who said, \"Don't take it!",
        "source": "T22n1421_021:0143a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若已取，即應壞色作比丘衣。」",
        "translation": "If he had taken it, he would have destroyed its color and made it into a monk's robe.\"",
        "source": "T22n1421_021:0143a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘少欲知足，不受他家施衣。",
        "translation": "Some monks have few desires and are satisfied, and they won't accept a gift of clothing from another family.",
        "source": "T22n1421_021:0143a24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士作是議：「我等何方令彼比丘受我施衣？",
        "translation": "The householders say, \"How can we get that monk to accept my clothing as alms?",
        "source": "T22n1421_021:0143a25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正當裂破、火燒，處處著街巷中，伺其入聚落時，語言：『汝看左右，若有所見取之。』」",
        "translation": "When they are about to be torn apart and burned, they put their heads everywhere in the streets and alleys, and when they enter a village, they say, 'Look to your right and left, and if you see anything, take it.'\"",
        "source": "T22n1421_021:0143a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即如議作。",
        "translation": "He did just that.",
        "source": "T22n1421_021:0143a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘見，作是念：「我等不受家施衣，必是諸居士為我等作此。」",
        "translation": "When that monk saw that, he thought, \"We wouldn't accept a gift of clothing from a householder, but those householders must have made this for us.\"",
        "source": "T22n1421_021:0143a28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應作糞掃想取。」",
        "translation": "He then said to the Buddha, \"You should take it with the contemplation of a sweeping rag.\"",
        "source": "T22n1421_021:0143a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一比丘命過，諸比丘仰著中庭，不以衣覆，露其身體，男根脹起。",
        "translation": "When the life of one monk passed away, the monks stood up in the courtyard, uncovered by their robes, with their bodies exposed and their male faculties swollen.",
        "source": "T22n1421_021:0143b01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士見，譏呵言：「沙門釋子不修梵行，乃使男根如此之大。」",
        "translation": "When the householders saw this, they ridiculed him, saying, \"The ascetic and the monk didn't cultivate the religious practice, so he made his male faculties grow so large.\"",
        "source": "T22n1421_021:0143b03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「不應仰露，應以衣覆，犯者突吉羅！」",
        "translation": "The monks said this to the Buddha, who said, \"He shouldn't have exposed himself, but should have covered himself with his robe; a transgressor would be a tukhila!\"",
        "source": "T22n1421_021:0143b04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一肥大比丘命過，諸比丘舉著生草上，脂出流漫，殺諸生草。",
        "translation": "When the life of a large, fat monk passed away, the monks held him up on the growing grass, and the fat flowed out, killing the growing grass.",
        "source": "T22n1421_021:0143b05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸外道見，譏呵言：「沙門釋子自云慈念，而今云何傷殺生命？」",
        "translation": "When the non-Buddhists saw this, they ridiculed him, saying, \"The ascetic Śākyamuni used to say he was compassionate and mindful, but why did he now harm and kill people?\"",
        "source": "T22n1421_021:0143b07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「不應著生物上，應埋、若火燒、若著石上。」",
        "translation": "The monks therefore told the Buddha, who said, \"You shouldn't put it on a living thing; you should bury it, burn it, or put it on a rock.\"",
        "source": "T22n1421_021:0143b08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一比丘水所漂殺，衣鉢挂著界內樹枝。",
        "translation": "One monk was killed by water and his robe and bowl were hanging on a branch inside the monk's community.",
        "source": "T22n1421_021:0143b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘見，謂入僧界內，應屬僧不敢取。",
        "translation": "When the monks saw it, they said it had gone inside the monks' boundary and that the monks didn't dare to take it.",
        "source": "T22n1421_021:0143b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽作糞掃衣取。」",
        "translation": "They therefore told the Buddha, who said, \"Listen, make that a sweeping robe and take it.\"",
        "source": "T22n1421_021:0143b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知有幾種糞掃衣，以是白佛，佛言：「糞掃衣有十種：王受位時所棄故衣、塚間衣、覆塚衣、巷中衣、新嫁女所棄故衣、女嫁時顯節操衣、產婦衣、牛嚼衣、鼠咬衣、火燒衣。」",
        "translation": "The monks didn't know how many kinds of robes of excrement there were, so they said to the Buddha, \"There are ten kinds of robes of excrement: the old robe that the king discarded when he assumed the throne, the robe between the tumuli, the robe covering the tumuli, the robe in the alley, the old robe that the newly married woman discarded, the robe that showed modesty when the woman was married, the maternity robe, the robe chewed by cattle, the robe bitten by rats, and the robe burned by fire.\"",
        "source": "T22n1421_021:0143b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘著光色衣，白衣譏呵，以是白佛，佛言：「不應著光色衣，犯者突吉羅！」",
        "translation": "The monks then wore robes of a shiny color, and the white robe ridiculed them and brought them to the Buddha, who said, \"Don't wear robes of a shiny color; offenders are out of line!\"",
        "source": "T22n1421_021:0143b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘畜不滿五肘雨浴衣，以是白佛，佛言：「雨浴衣不應減五肘，犯者波逸提！」",
        "translation": "A monk who was dissatisfied with the five elbows of his bathing suit reported this to the Buddha, who said, \"The bathing suit should not be reduced by five elbows; the offender is pratyekabuddha!\"",
        "source": "T22n1421_021:0143b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸居士於安居內為兒女剃頭故，以衣施僧。",
        "translation": "Those householders then gave robes to the saṃgha in their retreat because they were shaving their children's heads.",
        "source": "T22n1421_021:0143b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘受已，欲迴為安居施。",
        "translation": "After accepting it, the monks wanted to give it back to the monks in their retreat.",
        "source": "T22n1421_021:0143b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！",
        "translation": "They therefore said to the Buddha, \"No!",
        "source": "T22n1421_021:0143b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此名隨事施，現在僧應分，犯者突吉羅！」",
        "translation": "This is called giving according to circumstances, which is now the saṃgha's proper portion, and whoever violates it is a tukhila!\"",
        "source": "T22n1421_021:0143b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘先所受三衣不捨，更受餘衣；以先所受衣淨施及施人。",
        "translation": "\"Suppose there's a monk who doesn't abandon the three garments he's received before and accepts another one, using the garment he's received before to give it as a pure gift and to a donor.",
        "source": "T22n1421_021:0143b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後憶白佛，佛言：「得名更受，亦名淨施、施人；但不捨，得突吉羅。」",
        "translation": "Later, he recalled and told the Buddha, who said, \"It's called further acceptance, and it's also called pure giving and giving to others; but when you don't abandon them, you get a surpassing gift.\"",
        "source": "T22n1421_021:0143b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘有尼薩耆衣，未捨、未悔過，而為火所燒、水所漂、賊所奪、失壞，不知云何？",
        "translation": "Do you know monks who have a Nepalese noble robe that's been burned by fire, drowned in water, or plundered by thieves and has been destroyed before they abandon it and repent?",
        "source": "T22n1421_021:0143b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「此即名捨，但應作波逸提悔過。」",
        "translation": "He therefore said to the Buddha, \"This is called giving, but you should repent as a pratyekabuddha.\"",
        "source": "T22n1421_021:0143b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘畜衣不以淨施，以是白佛，佛言：「不應爾，犯者突吉羅！」",
        "translation": "The monks then gathered their robes and didn't give them in a pure way, and they said to the Buddha, \"No, that's a violation, duṣkṛ!\"",
        "source": "T22n1421_021:0143c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一住處眾僧得錦，施諸比丘。",
        "translation": "There's an abode where the monks get silk brocade and give it to the monks.",
        "source": "T22n1421_021:0143c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知云何？",
        "translation": "I wonder what that was?",
        "source": "T22n1421_021:0143c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應受！",
        "translation": "He therefore said to the Buddha, \"Accept it!",
        "source": "T22n1421_021:0143c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迴莊嚴塔、若作塔用、若僧用。」",
        "translation": "It's for use as a stūpa or for use by the saṃgha.\"",
        "source": "T22n1421_021:0143c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一住處僧欲分衣，有少欲比丘不受分，而須腰繩、禪帶、帽、漉水囊。",
        "translation": "There was a monk in one dwelling who wanted to distribute his robes, but a monk with few desires didn't accept the distribution and needed a waistband, a meditation belt, a hat, and a water filter.",
        "source": "T22n1421_021:0143c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「應與！」",
        "translation": "The monks said this to the Buddha, and he said, \"Yes!\"",
        "source": "T22n1421_021:0143c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既與復索，以是白佛，佛言：「分物時，應先問：『汝受分不？』",
        "translation": "Having given and asked for more, he said to the Buddha, \"When you divide something, you should first ask, 'Will you accept a share?'",
        "source": "T22n1421_021:0143c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言受，應等與。",
        "translation": "If you say, 'I'll accept it,' you should give it equally.",
        "source": "T22n1421_021:0143c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言須腰繩等，應三分與一；若復索，不應與。」",
        "translation": "If he says he needs a cord or so forth, he should give three parts to one; if he asks for more, he shouldn't give it.\"",
        "source": "T22n1421_021:0143c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一比丘有拘攝，四方僧有僧伽梨，欲貿易之，諸比丘不敢與。",
        "translation": "There was a monk who had a saṃgāli that the four saṃgha had and wanted to trade it, but the monks didn't dare to give it to him.",
        "source": "T22n1421_021:0143c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽易！",
        "translation": "They then said to the Buddha, \"Listen, it's easy!",
        "source": "T22n1421_021:0143c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若拘攝價多，僧應倍與比丘。",
        "translation": "If the price of a koṭī is too much, the saṃgha should give it to the monk twice as much.",
        "source": "T22n1421_021:0143c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧伽梨價多，比丘應倍與僧；若貧無物可倍與僧，而必是少欲知足，亦聽與之。」",
        "translation": "If the price of a monk's robe is too much, the monk should give it to the monk twice as much; if he's poor and doesn't have anything to give to the monk twice as much, and he must have few desires and be satisfied, he'll also give it to him.\"",
        "source": "T22n1421_021:0143c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘衣亦如是。",
        "translation": "So it was with the rest of the monks' robes.",
        "source": "T22n1421_021:0143c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時離婆多比丘苦脚冷，從一婆羅門乞裹脚欽婆羅衣，既乞生疑：「世尊制戒，不聽我等從非親里乞衣。」",
        "translation": "The monk Revata was suffering from cold feet and went to a brāhmaṇa to ask for a foot-binding kambala robe. After asking for one, he had this doubt, \"The Bhagavān has established a precept against allowing us to ask for robes from people we don't know.\"",
        "source": "T22n1421_021:0143c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知云何？",
        "translation": "I wonder what that means?",
        "source": "T22n1421_021:0143c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「如是因緣聽乞，所應受持衣，若護[蹲-酋+(十/田/ㄙ)]衣、護髀衣、護頭衣、拭手面身體巾等。」",
        "translation": "He therefore said to the Buddha, \"The Buddha said, 'Such are the causes and conditions for listening to a request for a robe that should be accepted, such as a [squatting- sheikh+(ten/field/nymph)] robe, a thigh protector, a head protector, and a towel to wipe your hands and face and body.'\"",
        "source": "T22n1421_021:0143c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘於僧、四方僧，及塔、不同意人邊，皆作同意取衣。",
        "translation": "The monks then agreed to take robes from the saṃgha, the four directions of the saṃgha, and the side of the stūpa or person who didn't agree with them.",
        "source": "T22n1421_021:0143c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！",
        "translation": "They then said to the Buddha, \"That shouldn't be the case!",
        "source": "T22n1421_021:0143c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於和尚阿闍梨、同和尚阿闍梨、若弟子及諸同意人邊，乃得作同意取。」",
        "translation": "If a monk or a fellow monk or a priest, a disciple, or a consenter, then he can agree to take them.\"",
        "source": "T22n1421_021:0143c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘未命過處分衣物，言：「我死後以此衣物施某甲，以此衣物作如是如是用。」",
        "translation": "Some monks who have yet to part with their clothing after their lives say, \"After I die, I'll give this clothing to a certain person, and this clothing will be used for such and such a purpose.\"",
        "source": "T22n1421_021:0143c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應爾！",
        "translation": "He then said to the Buddha, \"That shouldn't be the case!",
        "source": "T22n1421_021:0143c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "犯者突吉羅。",
        "translation": "A violator is a duṣkṛta.",
        "source": "T22n1421_021:0143c24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與不成與，用不成用。」",
        "translation": "What's given is not given, and what's used is not used.\"",
        "source": "T22n1421_021:0143c25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難常出入蘆夷力士家，後往不在，作同意取貴價劫貝，尋生疑悔，作是念：「佛未聽我等於白衣，作同意取衣。」",
        "translation": "Ānanda often went to and from Rāṣṭrapāla's house, but when he was gone, he agreed to take a valuable kalpa, and he had doubts and regrets.",
        "source": "T22n1421_021:0143c25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「亦聽於白衣作同意取衣。」",
        "translation": "He therefore said to the Buddha, \"He's also heard us make consent to take robes from the white robes.\"",
        "source": "T22n1421_021:0143c28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘離雨浴衣，不知浴時應著何衣。",
        "translation": "The monks then left their bathing robes in the rain and didn't know what robes they should wear when they bathed.",
        "source": "T22n1421_021:0143c29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「有五因緣得離雨浴衣：不雨、不疑雨、不渡水、食病時、作未成。",
        "translation": "They therefore said to the Buddha, \"The Buddha said, 'There are five reasons to part with the bathing robes in the rain: it doesn't rain, you don't doubt the rain, you don't cross the water, you eat when you're sick, and you do it before it's finished.'",
        "source": "T22n1421_021:0144a01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五因緣得留僧伽梨：雨時、疑雨、渡水、食病時、作未成。」",
        "translation": "There are five reasons to keep the saṃgha's robe: when it rains, when there's doubt about the rain, when it wades through water, when it's sick from eating, and when it's not finished.\"",
        "source": "T22n1421_021:0144a02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一住處僧欲分衣，有客比丘來，諸比丘得分少，不欲分。",
        "translation": "There was a monk in one dwelling who wanted to share his robe, but when a visiting monk came, the monks didn't want to share it because they had so little.",
        "source": "T22n1421_021:0144a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛。",
        "translation": "They then said to the Buddha.",
        "source": "T22n1421_021:0144a05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「乃至得一腰繩直應分，若少不足分，應白二羯磨與一無衣比丘。」",
        "translation": "The Buddha said, \"Even if he gets a waistband that's straight, he should share it; if it's less than that, he should tell the two karmas and the monk who has no clothes.\"",
        "source": "T22n1421_021:0144a05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一比丘唱言：「大德僧聽！",
        "translation": "One of the monks called out, \"Listen, Venerable monks!",
        "source": "T22n1421_021:0144a07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此僧得衣、若非衣，今併與某甲比丘。",
        "translation": "Now, this monk obtains a robe, and if it's not a robe, he gives it to a certain monk.",
        "source": "T22n1421_021:0144a07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽。",
        "translation": "If the saṃgha arrives at the right time, the saṃgha will tolerate hearing it.",
        "source": "T22n1421_021:0144a08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白如是。」",
        "translation": "He said, 'So it is.'\"",
        "source": "T22n1421_021:0144a09_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德僧聽！",
        "translation": "\"Listen, great virtuous monks!",
        "source": "T22n1421_021:0144a09_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此僧得衣、若非衣，乃至若不忍者，說。",
        "translation": "\"If this monk obtains clothing, or if it's not clothing, or if he doesn't tolerate it, he says.",
        "source": "T22n1421_021:0144a09_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧已與某甲比丘衣竟；僧忍，默然故。",
        "translation": "'The saṃgha has finished giving a certain monk robes; the saṃgha tolerates it and remains silent.",
        "source": "T22n1421_021:0144a10_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事如是持。」",
        "translation": "This is maintained in this way.\"",
        "source": "T22n1421_021:0144a11_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五分律第三分之六皮革法",
        "translation": "Six Leather Dharmas of the Third Part of the Five Part Vinaya",
        "source": "T22n1421_021:0144a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was staying in the city of Śrāvastī.",
        "source": "T22n1421_021:0144a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時摩訶迦旃延，在阿濕波阿雲頭國波樓多山中住。",
        "translation": "At the time, Mahākātyāyana was staying at Aśvajit, in the country of Aśvajit, on Mount Pārūta.",
        "source": "T22n1421_021:0144a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國有長者名沙門億耳，信樂佛法常供給諸比丘，見法得果，受三歸五戒，恒入僧坊聽受法教。",
        "translation": "In that country, there was an elder named Śrāmaṇer who believed in and enjoyed the Buddha's teaching, always made offerings to the monks, saw the Dharma come to fruition, received the three refuges and five precepts, and always entered the monastery to listen to the teaching of the Dharma.",
        "source": "T22n1421_021:0144a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時沙門億耳屏處自念：「如佛所說，在家染著，不能廣修梵行；出家無著，猶如虛空。",
        "translation": "At the time, the ascetic Eil was standing in a state of calmness, thinking to himself, \"As the Buddha taught, a householder with defiled attachment can't thoroughly cultivate the religious practice; a renunciant without attachment is like space.",
        "source": "T22n1421_021:0144a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今何不於無為法中，剃除鬚髮，出家學道。」",
        "translation": "Now, why don't I shave off my hair, leave home, and train on the path in the midst of the teaching on nonproductivity?\"",
        "source": "T22n1421_021:0144a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念已，晨旦到迦旃延所，頭面禮足，具宣所念，欲求出家受具足戒。",
        "translation": "After he had finished that thought, he went to Kātyāyana in the morning, paid homage with his head and feet, explained exactly what he was thinking, and wanted to leave home and receive the full set of precepts.",
        "source": "T22n1421_021:0144a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦旃延言：「在家染著，誠如汝言；但出家苦節，淨修梵行，獨坐樹下，常應一食。",
        "translation": "Kātyāyana said, \"The defiled attachments at home are just as you say; but leave home to asceticism, cultivate pure religious practice, sit alone under a tree, and always take one meal.",
        "source": "T22n1421_021:0144a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝本富樂，此事甚難。」",
        "translation": "You were originally wealthy and happy, but this is a very difficult thing to do.\"",
        "source": "T22n1421_021:0144a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "億耳聞已，便歸其家。",
        "translation": "After hearing this, Ekṣipa returned to his home.",
        "source": "T22n1421_021:0144a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是至三，見其意至，便與出家。",
        "translation": "He did so up to the third time, and when he saw his intention, he renounced the world.",
        "source": "T22n1421_021:0144a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國無有十眾，作沙彌經歷六年，迦旃延乃以神通力，於餘國集十眾授具足戒。",
        "translation": "There were no ten congregations in that country, and they had been ascetics for six years when Kātyāyana, through his supernormal powers, gathered ten congregations in another country and conferred full ordination.",
        "source": "T22n1421_021:0144a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "億耳受戒已念言：「我聞如來、應供、等正覺，而未奉見，今當往詣問訊世尊。」",
        "translation": "After receiving the precepts, Yi-er thought, \"I've heard about the Tathāgata, Worthy of Offerings, and Completely Enlightened, but I haven't yet met him, so now I'll go and ask the Bhagavān about it.\"",
        "source": "T22n1421_021:0144a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念已，到迦旃延所，頭面禮足，白求詣佛。",
        "translation": "After he had finished that thought, he went to Kātyāyana, bowed his head and feet, and said, \"I'd like to go to the Buddha.",
        "source": "T22n1421_021:0144a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦旃延言：「甚善，吾隨汝喜！",
        "translation": "Kātyāyana said, \"Very good, I'll follow your lead!",
        "source": "T22n1421_021:0144a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜知是時，可以吾名問訊世尊。",
        "translation": "You should know that at that point, you can ask the Bhagavān about this in my name.",
        "source": "T22n1421_021:0144a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以五法白佛：一、阿濕波阿雲頭國無有十眾，億耳作沙彌經歷六年，不得受具足戒，迦旃延以神通力於餘國集僧，然後得受，願世尊聽此國不滿十眾得受具足戒！",
        "translation": "Again, he said to the Buddha in five ways: 1. In the country of Aśvajit, there are no ten congregations, and even though Ekṣaprāpta had been a novice for six years, he hadn't been able to receive the full precepts, but Kātyāyana had gathered monks from other countries with his supernormal powers, and then he was able to receive them.",
        "source": "T22n1421_021:0144b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此國多有沙石棘刺，願聽此國比丘畜重底革屣！",
        "translation": "Since this country is full of sandstone and thorns, may I ask the monks of this country to put on heavy leather sandals!",
        "source": "T22n1421_021:0144b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此國皆以皮敷地，作坐臥具，願聽此國比丘以皮敷地！",
        "translation": "Furthermore, since this country spreads leather on the ground for sitting and bedding, may I ask the monks of this country to spread leather on the ground!",
        "source": "T22n1421_021:0144b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此國人日日洗浴，願聽此國比丘日日洗浴！",
        "translation": "\"Furthermore, since the people of this country bathe themselves every day, may I hear the monks of this country bathe themselves every day!",
        "source": "T22n1421_021:0144b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有比丘寄衣與餘方比丘，衣未至有比丘語所與比丘，比丘生疑恐犯長衣，願為除其此疑！」",
        "translation": "Another monk sends a robe to a monk in another place, and before the robe arrives, some monk says to the monk that it's for him, and the monk becomes suspicious lest he violate the long robe, so let's remove that suspicion!\"",
        "source": "T22n1421_021:0144b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是億耳受教而去。",
        "translation": "Yi-er then accepted the teaching and departed.",
        "source": "T22n1421_021:0144b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既到佛所，稽首佛足，宣和尚問訊。",
        "translation": "When he arrived at the Buddha's place, he bowed his head at his feet and announced the monk's greetings.",
        "source": "T22n1421_021:0144b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「汝為此客比丘敷臥具！」",
        "translation": "The Buddha said to Ānanda, \"Prepare the bed for this guest monk!\"",
        "source": "T22n1421_021:0144b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難念言：「佛欲與此比丘共宿故，令我為敷臥具。」",
        "translation": "Ānanda thought, \"The Buddha wanted to share his bed with this monk, so he asked me to make a bedclothes for him.\"",
        "source": "T22n1421_021:0144b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於佛房而為敷之，佛與億耳共一房宿，初夜、中夜默然無言。",
        "translation": "He then spread out the cloth in the Buddha's room, and the Buddha and 100,000,000 ears stayed in the same room together for the first and middle nights, being silent.",
        "source": "T22n1421_021:0144b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至後夜時，佛作是念：「此族姓子威儀調伏，當令說法。」",
        "translation": "During the latter part of the night, the Buddha had this thought, \"This clansman is so well-behaved that he will teach the Dharma.\"",
        "source": "T22n1421_021:0144b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便語言：「汝可說法。」",
        "translation": "He then said, \"You may preach the Dharma.\"",
        "source": "T22n1421_021:0144b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "億耳受教，即說十六義品經，說已默然而住。",
        "translation": "Yi Yi'er accepted the teaching and then spoke the sixteen categories of meaning, and after speaking, he waited silently.",
        "source": "T22n1421_021:0144b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, \"Good!",
        "source": "T22n1421_021:0144b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國人語，皆如此不？」",
        "translation": "Is that what the people of that country say?\"",
        "source": "T22n1421_021:0144b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「有勝我者。」",
        "translation": "He answered, \"There's someone better than me.\"",
        "source": "T22n1421_021:0144b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「汝何以久住彼國不來見我？」",
        "translation": "Again, he asked, \"Why did you stay there so long and not come to see me?\"",
        "source": "T22n1421_021:0144b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我早知欲之過患，有因緣故不得早來。」",
        "translation": "He replied, \"I've known the faults of desire for a long time, and there were reasons why I couldn't come earlier.\"",
        "source": "T22n1421_021:0144b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊因說偈言：「見世之過患，　　身自依法行；　賢者不樂惡，　　為惡不樂善。」",
        "translation": "The Bhagavān then spoke this verse, \"Seeing the faults of the world, he conducts himself according to the law; a good person doesn't delight in evil, and he does evil and doesn't delight in good.\"",
        "source": "T22n1421_021:0144b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是億耳作是念：「和尚勅我以五法白佛，今正是時。」",
        "translation": "Then Ekṣipa thought, \"The monk asked me to tell the Buddha about five principles, and now is the right time.\"",
        "source": "T22n1421_021:0144b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便以白佛。",
        "translation": "He then reported them to the Buddha.",
        "source": "T22n1421_021:0144b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛過夜已集比丘僧，告億耳：「汝可更說迦旃延所白五法。」",
        "translation": "After the Buddha had passed the night, he gathered the monks and told Erei, \"You may further explain the five things that Kātyāyana has confessed.\"",
        "source": "T22n1421_021:0144b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "億耳即更說之。",
        "translation": "Eriṣṭa then explained them further.",
        "source": "T22n1421_021:0144b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種讚歎少欲知足、讚戒、讚持戒已，告諸比丘：「從今聽阿濕波阿雲頭國及一切邊地少比丘處，持律五人授具足戒；亦聽有沙石棘刺之處，著重底革屣；亦聽有皮革處，作皮敷臥具；亦聽有須浴處，日日洗浴；若比丘寄衣與餘處比丘，比丘雖先聞知，衣未入手不犯長衣。」",
        "translation": "After the Buddha had sowed praise for having few desires and being satisfied, for morality, and for upholding the precepts, he addressed the monks, \"From now on, I'll listen to the five vinaya-holders in Aśvajit and in all the borderlands where there are few monks who are given the full precepts; I'll also listen to those who wear heavy leather sandals where there are sandstone and thorns; I'll also listen to those who make leather bedding where there's leather; I'll also listen to those who wash daily where there's a need for bathing; and if a monk sends robes to a monk elsewhere, even though the monk has heard about it before, he won't be guilty of wearing long robes before they go into his hand.\"",
        "source": "T22n1421_021:0144b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘作種種形、種種色革屣。",
        "translation": "It was then that the monks made leather sandals of various shapes and colors.",
        "source": "T22n1421_021:0144c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不聽作異形、異色革屣，犯者突吉羅！」",
        "translation": "They then said to the Buddha, \"I won't listen to anyone who makes leather sandals of a different shape or color; that offender is a tukhila!\"",
        "source": "T22n1421_021:0144c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘作馬皮、象皮、人皮革屣。",
        "translation": "Some monks make leather sandals made from the skins of horses, elephants, or humans.",
        "source": "T22n1421_021:0144c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不聽作！",
        "translation": "They therefore said to the Buddha, \"Don't listen to them!",
        "source": "T22n1421_021:0144c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若用人皮，偷蘭遮；若馬、象皮，突吉羅。」",
        "translation": "If you use human skins, it's Pāraṇḍa; if you use horse or elephant skins, it's duṣkṛta.\"",
        "source": "T22n1421_021:0144c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時跋難陀常出入一牧牛家，著衣持鉢往到其舍。",
        "translation": "Up to that time, Vārāṇasī used to go to a cowherd's house, dressing himself in robes and carrying a bowl.",
        "source": "T22n1421_021:0144c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有斑色犢子，跋難陀諦視生念，欲得此皮作敷具。",
        "translation": "There was a spotted calf there, and as he looked at it, Vārāṇasī became mindful that he wanted to obtain its skin to make a dressing cloth.",
        "source": "T22n1421_021:0144c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主人問言：「何故諦視此犢？」",
        "translation": "The owner asked, \"Why do you look at this calf with respect?\"",
        "source": "T22n1421_021:0144c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「此犢斑色可愛，耐可作敷具。」",
        "translation": "He replied, \"This calf has lovely patches and is durable enough to put on a mat.\"",
        "source": "T22n1421_021:0144c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即白言：「大德常料理我家，豈惜一犢而不相與！」",
        "translation": "They then said, \"Sir, you've always taken care of my home, so why wouldn't you take care of a calf and not share it with someone else?\"",
        "source": "T22n1421_021:0144c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於犢母前殺而與之。",
        "translation": "He then killed her and gave her to the mother of calves.",
        "source": "T22n1421_021:0144c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "跋難陀得已持還僧坊，犢母隨後悲鳴逐之。",
        "translation": "After he got it, Vārāṇasī took it back to the monastery, where the calf's mother then roared with lamentation and chased it away.",
        "source": "T22n1421_021:0144c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘問言：「此牛何故悲鳴逐汝？」",
        "translation": "The monks asked, \"Why did this cow cry out in pity and chase you away?\"",
        "source": "T22n1421_021:0144c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不知！」",
        "translation": "replied, \"I don't know!\"",
        "source": "T22n1421_021:0144c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「此牛逐汝，不逐餘人，云何不知？」",
        "translation": "Again, he asked, \"This ox chases you and not the others, so why don't you know?\"",
        "source": "T22n1421_021:0144c15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃具以事答。",
        "translation": "He then answered with a detailed explanation of the matter.",
        "source": "T22n1421_021:0144c16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘種種呵責，以是白佛。",
        "translation": "The monks were rebuked in various ways and reported this to the Buddha.",
        "source": "T22n1421_021:0144c17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，問跋難陀：「汝實爾不？」",
        "translation": "Based on this, the Buddha gathered the monks and asked Varanta, \"Is that true?\"",
        "source": "T22n1421_021:0144c17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "They replied, \"That's true.",
        "source": "T22n1421_021:0144c18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T22n1421_021:0144c19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種呵責已，告諸比丘：「從今不聽畜一切皮！」",
        "translation": "After the Buddha had rebuked them in various ways, he told the monks, \"From now on, you mustn't listen to him when he's storing all the skins!\"",
        "source": "T22n1421_021:0144c19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘後須小片皮而不敢用，以是白佛，佛言：「聽用小片皮作物。」",
        "translation": "The monks then needed a small piece of skin but didn't dare to use it, so they said to the Buddha, \"Let's use a small crop of skin.\"",
        "source": "T22n1421_021:0144c20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘從外還，徒跣上僧臥具，污泥不淨。",
        "translation": "Some monks returned from abroad and barefooted their way into the monks' bedding, which was dirty and impure.",
        "source": "T22n1421_021:0144c21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽著出入革屣。」",
        "translation": "They then said to the Buddha, \"Listen, put on leather sandals for entering and leaving.\"",
        "source": "T22n1421_021:0144c22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有老病比丘於恐怖處共伴道行，遲不相及，諸伴語：「大德速行，勿使被剝！」",
        "translation": "When a monk who was elderly and sick was walking with companions in a frightening place on the path and was too late to make it, the companions said, \"Great man, go quickly! Don't let yourself be stripped!\"",
        "source": "T22n1421_021:0144c23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我等老病不能行！」",
        "translation": "They replied, \"We're too old and sick to do it!\"",
        "source": "T22n1421_021:0144c25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伴言：「此有象、馬、驢騾、駱駝、車、牛，可騎乘。」",
        "translation": "The companion said, \"Here are elephants, horses, asses, camels, chariots, and oxen that can be ridden.\"",
        "source": "T22n1421_021:0144c25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不敢，以是白佛，佛言：「從今聽老病比丘騎乘，但不得乘騎雌畜生。」",
        "translation": "The monks didn't dare and said to the Buddha, \"The Buddha said, 'From now on, we'll allow elderly and sick monks to ride, but we mustn't ride female animals.'\"",
        "source": "T22n1421_021:0144c26_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸白衣以皮輿施僧，諸比丘不敢受。",
        "translation": "The monks didn't dare to accept a gift of a leather mantle from one of the white clothed monks.",
        "source": "T22n1421_021:0144c28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽受。",
        "translation": "They therefore said to the Buddha, \"Accept it!",
        "source": "T22n1421_021:0144c29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去皮，以餘衣代。」",
        "translation": "Remove the skins and replace them with the rest of the robes.\"",
        "source": "T22n1421_021:0144c29_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸白衣以皮輿別施上座，不敢受。",
        "translation": "Some white robes offered a leather mop separately to the elder monk, but they didn't dare to accept it.",
        "source": "T22n1421_021:0145a01_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「亦聽私受，去皮如上法。」",
        "translation": "They then said to the Buddha, \"Accept it privately, and remove the skin as above.\"",
        "source": "T22n1421_021:0145a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸上座老病比丘，欲乘輿入聚落，不敢乘。",
        "translation": "The ascended masters, elderly and sick monks, wanted to ride into the village on a moped, but didn't dare to do so.",
        "source": "T22n1421_021:0145a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽。」",
        "translation": "They then said to the Buddha, \"Listen!\"",
        "source": "T22n1421_021:0145a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知使誰輿之，以是白佛，佛言：「使淨人輿。」",
        "translation": "Not knowing whom to use to carry it, he said to the Buddha, \"Use a pure person to carry it.\"",
        "source": "T22n1421_021:0145a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘於恐怖處，欲渡水無船。",
        "translation": "There were monks in a place of fear who wanted to cross the water but didn't have a boat.",
        "source": "T22n1421_021:0145a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有牧牛人驅牛渡水，語言：「可捉牛尾。」",
        "translation": "A cowherd drove a cow across the water and said, \"You can grab its tail.\"",
        "source": "T22n1421_021:0145a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不敢，以是白佛。",
        "translation": "The monks didn't dare, so they said to the Buddha.",
        "source": "T22n1421_021:0145a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽捉。」",
        "translation": "The Buddha said, \"Heard, seized!\"",
        "source": "T22n1421_021:0145a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘捉牸牛尾渡水，以手刺其瘡中。",
        "translation": "Six groups of monks then grabbed the tail of a cow as it crossed the water and pricked it in its sores with their hands.",
        "source": "T22n1421_021:0145a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不聽捉雌畜生尾渡水。」",
        "translation": "They then said to the Buddha, \"I won't listen to you when you grab a female animal by the tail to cross the water.\"",
        "source": "T22n1421_021:0145a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘欲渡水，亦無畜生可捉，不知云何？",
        "translation": "Some monks want to cross the water, but there's no animal to catch, so I don't know what to do.",
        "source": "T22n1421_021:0145a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽縛草木作栰。",
        "translation": "He therefore said to the Buddha, \"Listen, bind straw and wood to make a raft.",
        "source": "T22n1421_021:0145a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今聽諸比丘畜浮囊，若羊皮、若牛皮作。",
        "translation": "From now on, listen to the monks who bring in a flotation bag, whether made of sheepskin or cowhide.",
        "source": "T22n1421_021:0145a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧及四方僧，皆應畜。」",
        "translation": "The saṃgha and the saṃgha of the four directions should all store them.\"",
        "source": "T22n1421_021:0145a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城。",
        "translation": "The Buddha was in the city of Rājagṛha.",
        "source": "T22n1421_021:0145a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時瓶沙王摩竭、鴦伽二國，有四萬二千聚落，彼諸豪傑無有不信佛法僧者；唯除瞻婆城中，有長者子名首樓那，其人大富有二十億錢，時人號曰首樓那二十億，是人生便受樂，手脚柔軟，足下生毛。",
        "translation": "At the time, there were 42,000 villages in the kingdoms of Maghā and Aṅga, and none of those wealthy people didn't believe in the Buddha, Dharma, and Saṃgha, except for an elder son named Śrūṇa in the city of Campā, who was very wealthy and had two billion coins.",
        "source": "T22n1421_021:0145a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瓶沙王作是念：「我界內唯有二十億未信佛法，我當云何令彼信樂？",
        "translation": "King Bimbisāra thought, \"There are only two billion people in my realm who haven't believed in the Buddha's teaching; how will I make them believe in and be happy?",
        "source": "T22n1421_021:0145a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若自往，當大驚怖；若呼召之，必生疑畏。",
        "translation": "If I go there myself, I'll be terrified; if I summon them, they'll become suspicious and fearful.",
        "source": "T22n1421_021:0145a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正當通命瞻婆城中六十家諸豪傑，觀王子婚，因此相見，誨以道法。」",
        "translation": "I'm about to order 60 distinguished men from the city of Campā to meet the prince's wife, so I can explain the teaching to him.\"",
        "source": "T22n1421_021:0145a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念已，即便呼之。",
        "translation": "After he thought this, he even called out to them.",
        "source": "T22n1421_021:0145a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸親族皆白王言：「二十億未曾履地，足下生毛如人頂髮，不堪恭到。",
        "translation": "The clansmen then said to the king, \"Two billion of them have never touched the ground before, and the hair on their feet looks like human hair, so they can't respectfully approach them.",
        "source": "T22n1421_021:0145a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願王特賜停此一人！」",
        "translation": "May the king grant a special stop to this one person!\"",
        "source": "T22n1421_021:0145a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「可乘象馬車輿。」",
        "translation": "The king said, \"You could ride an elephant horse chariot or a mule.\"",
        "source": "T22n1421_021:0145a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「其身極軟，亦不堪之。」",
        "translation": "He replied, \"Their bodies are too weak for them, and they can't bear it.\"",
        "source": "T22n1421_021:0145a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「今王子婚，必宜相見，聽汝親族盡自致方！」",
        "translation": "The king said, \"Now that the prince is married, it would be appropriate to meet him and listen to your relatives as they go about their business!\"",
        "source": "T22n1421_021:0145a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親族共議：「唯當鑿渠通船，日行數里，乃可不勞，恭王命耳！」",
        "translation": "The kinsmen agreed, \"Only if we dig a canal and open it to boats that travel several miles a day will we be able to obey the king's order without any trouble!\"",
        "source": "T22n1421_021:0145a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便共以此致之，到王舍城，親族白王：「二十億今始得至，願聽如家法！」",
        "translation": "They all took this as their message, and when they arrived in Rājagṛha, their relatives said to the king, \"Now, two billion people have just arrived, and I wish to hear the Dharma of the Dharma of the Dharma family!\"",
        "source": "T22n1421_021:0145a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「家法云何？」",
        "translation": "The king said, \"What is the family dharma?\"",
        "source": "T22n1421_021:0145a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「以衣敷地，行上舁之。」",
        "translation": "He replied, \"Put your robe on the ground and carry it on your back.\"",
        "source": "T22n1421_021:0145b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「可爾！」",
        "translation": "The king said, \"Yes!\"",
        "source": "T22n1421_021:0145b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即勅為敷；又為敷細軟衣為座，令坐其上。",
        "translation": "I commanded him to spread it out, and he spread out a fine, soft cloth for a seat and made it sit on it.",
        "source": "T22n1421_021:0145b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問言：「汝足下實生毛不？」",
        "translation": "The king asked, \"Do you really have hair on your bottom?\"",
        "source": "T22n1421_021:0145b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, \"It's true.",
        "source": "T22n1421_021:0145b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！」",
        "translation": "Great King!\"",
        "source": "T22n1421_021:0145b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我欲見之。」",
        "translation": "The king said, \"I want to see that.\"",
        "source": "T22n1421_021:0145b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「願使可信人看！」",
        "translation": "He replied, \"May I be trusted to look at it!\"",
        "source": "T22n1421_021:0145b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我欲自見。」",
        "translation": "The king said, \"I want to see for myself.\"",
        "source": "T22n1421_021:0145b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「願聽舒脚！」",
        "translation": "He replied, \"May I hear your legs stretch out!\"",
        "source": "T22n1421_021:0145b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「可爾！」",
        "translation": "The king said, \"Yes!\"",
        "source": "T22n1421_021:0145b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即舒脚示王。",
        "translation": "He then spread his legs and showed the king.",
        "source": "T22n1421_021:0145b05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "果如所聞，光曜王目不得熟視，生希有心，念言：「我國乃生如此大福德人！」",
        "translation": "As he had heard, King Guang Yao couldn't get his eyes to look at him, and he had a rare moment when he thought, \"My country has produced such a man of great merit!\"",
        "source": "T22n1421_021:0145b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顧視左右，先有三大居士，并二十億為四。",
        "translation": "Looking around, he saw the three eldest gentlemen and two billion of them as four.",
        "source": "T22n1421_021:0145b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：「汝各有幾財，得為居士？」",
        "translation": "He asked, \"How much do you each have that qualifies you to be a householder?\"",
        "source": "T22n1421_021:0145b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一人言：「我錢有十三億。」",
        "translation": "The first man said, \"I have 1.3 billion in money.\"",
        "source": "T22n1421_021:0145b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二人言：「我有十四億。」",
        "translation": "The second person said, \"I have 1.4 billion.\"",
        "source": "T22n1421_021:0145b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三人言：「我有十四億，又有一無價摩尼珠。」",
        "translation": "The third man says, \"I have 1.4 billion, and I have a priceless maṇi jewel.\"",
        "source": "T22n1421_021:0145b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十億言：「我有二十億，復有五百摩尼珠，一摩尼寶床。」",
        "translation": "Two billion said, \"I have two billion, and I also have five hundred maṇi beads and a maṇi-jeweled bed.\"",
        "source": "T22n1421_021:0145b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問二十億：「汝所從得此？」",
        "translation": "The king asked 2,000,000,000, \"Where did you get this?\"",
        "source": "T22n1421_021:0145b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「此寶非父餘財，亦不營得。",
        "translation": "He replied, \"This treasure isn't my father's other possessions, and I won't manage to get it.",
        "source": "T22n1421_021:0145b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於高樓上眠，眠覺便在我前。」",
        "translation": "I slept on a high building, and my sleep and awakening were right in front of me.\"",
        "source": "T22n1421_021:0145b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞此語，倍生希有。",
        "translation": "Hearing this, the king was doubly impressed.",
        "source": "T22n1421_021:0145b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「此人福德，唯佛當知，餘無能了。」",
        "translation": "Again, he thought, \"This person's merit is known only to the Buddha; no one else can understand it.\"",
        "source": "T22n1421_021:0145b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便嚴駕，出詣佛所，頭面禮足，白佛言：「世尊！",
        "translation": "He then escorted him out to the Buddha, bowed his head and feet, and said to him, \"Bhagavān!",
        "source": "T22n1421_021:0145b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十億有五百摩尼珠、一摩尼寶床，從何而來？」",
        "translation": "Where did the two billion, five hundred maṇi beads and one maṇi-jeweled bed come from?\"",
        "source": "T22n1421_021:0145b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此人先在忉利天，有五百天女，極相愛樂。",
        "translation": "The Buddha said, \"This person was first in the Heaven of Truthfulness, where there were 500 goddesses who were extremely delighted with him.",
        "source": "T22n1421_021:0145b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從彼來生，天女皆念：『我等天子今於何生？』",
        "translation": "When he came back from there, the goddesses all thought, 'Where did our sons of gods come from?'",
        "source": "T22n1421_021:0145b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以天眼觀，見生在此，各持一摩尼珠及先所臥寶床，化令稱其今身，著前而去。」",
        "translation": "He looked with the divine eye and saw them being born here, each holding a maṇi pearl and the jeweled bed on which they had previously lain, and he made them claim their present bodies, put them in front of him, and departed.\"",
        "source": "T22n1421_021:0145b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞佛說，禮畢退還，集瞻婆城六十豪傑，語言：「我今令二十億為彼城中最大居士，汝等宗之。」",
        "translation": "After hearing what the Buddha taught, the king retired after paying homage and gathered 60 prominent men from the city of Campā and said, \"Now, I've made 2 billion of them the largest householder in that city, and you are to be taught by them.\"",
        "source": "T22n1421_021:0145b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復語二十億及六十人等：「我為汝王，以法治化，已與汝等作現世利益。",
        "translation": "He also told the 2 billion and 60 people, \"As your king, I've disciplined you and created worldly benefits for you.",
        "source": "T22n1421_021:0145b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今佛世尊在耆闍崛山，各可往彼求後世利。」",
        "translation": "Now that the Bhagavān is on Mount Gṛdhrakūṭa, each of you may go there to seek benefit in the afterlife.\"",
        "source": "T22n1421_021:0145b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受勅皆往。",
        "translation": "They were all instructed to go there.",
        "source": "T22n1421_021:0145b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長老婆竭陀，於山中盤石上經行，諸居士到其所語言：「大德！",
        "translation": "The eldest wife, Kakuda, was walking on a rock on the mountain when the monks approached him and said, \"Mañjuśrī!",
        "source": "T22n1421_021:0145b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我白佛，瞻婆城二十億及六十居士欲問訊世尊。」",
        "translation": "I want to tell the Buddha that 2 billion people and 60 householders in Jambudvīpa want to question the Bhagavān.\"",
        "source": "T22n1421_021:0145b28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑竭陀於盤石上、居士前沒，踊出佛前，具以白佛。",
        "translation": "Sugata got up on the pagoda and went down in front of the householders, rushed out to the Buddha, and explained everything to him.",
        "source": "T22n1421_021:0145b29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「汝可先去，於盤石上敷座，吾尋後往。」",
        "translation": "The Buddha said, \"You may go ahead and prepare a seat on the pagoda, and I'll look for you later.\"",
        "source": "T22n1421_021:0145c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受教，於佛前沒，踊出盤石、眾居士前，為佛敷座；佛以常威儀，步行後至。",
        "translation": "Accepting his teaching, he disappeared in front of the Buddha, rushed out to lay out a seat for him on a rock in front of the householders, and the Buddha arrived on foot with his usual demeanor.",
        "source": "T22n1421_021:0145c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士念言：「此比丘有大神力，出沒盤石，猶如入水。」",
        "translation": "The householders remembered, \"This monk has great supernormal powers, and he emerges from the tray and rocks like he's entering water.\"",
        "source": "T22n1421_021:0145c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸共恭敬而慢世尊。",
        "translation": "They all paid respect to the Bhagavān and looked down on him.",
        "source": "T22n1421_021:0145c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊既至，就座而坐。",
        "translation": "When the Bhagavān arrived, he took his seat and sat down.",
        "source": "T22n1421_021:0145c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛常法，先使發歡喜心，然後說法。",
        "translation": "It's always the Buddha's practice to first make people rejoice and then teach the Dharma.",
        "source": "T22n1421_021:0145c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語娑竭陀：「汝起扇佛！」",
        "translation": "The Buddha said to Sāgata, \"Get up and fan the Buddha!\"",
        "source": "T22n1421_021:0145c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受教起扇，須臾現種種神變，如優為迦葉。",
        "translation": "Accepting the teaching, he got up his fan and in a moment appeared in various miraculous powers, just like Utsukeya Kāśyapa.",
        "source": "T22n1421_021:0145c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還在佛前，稽首禮足，白佛言：「佛是我大師，我是佛弟子。」",
        "translation": "He returned to the Buddha, bowed his head at his feet, and said to him, \"The Buddha is my great teacher, and I'm a disciple of the Buddha.\"",
        "source": "T22n1421_021:0145c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三返已，復坐本位。",
        "translation": "After returning three times like this, he resumed his original seat.",
        "source": "T22n1421_021:0145c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是諸居士作是念：「弟子神力猶尚如是，況於如來、應供、等正覺！」",
        "translation": "The householders then thought, \"This is how the disciple's powers are like, so why wouldn't it be like this for the Tathāgata, the Worthy Offerer, and the Completely Enlightened One?\"",
        "source": "T22n1421_021:0145c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便迴心注仰。",
        "translation": "They then turned their minds around and looked up.",
        "source": "T22n1421_021:0145c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為說種種妙法，示教利喜，乃至苦集盡道，皆於坐上得法眼淨，受三歸五戒。",
        "translation": "The Buddha taught various wonderful things, showed them how to bring benefit and joy, and even ended the path of suffering and accumulation, so they all attained purification of the Dharma eye while sitting there and received the three refuges and five precepts.",
        "source": "T22n1421_021:0145c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十億從坐起，跣足至佛前稽首作禮，佛便微笑。",
        "translation": "Two billion people got up from their seats, barefooted, and bowed their heads before the Buddha, and he smiled.",
        "source": "T22n1421_021:0145c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑竭陀作是念：「佛何因緣笑？」",
        "translation": "Sugata thought, \"What is the reason the Buddha smiles?\"",
        "source": "T22n1421_021:0145c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念已，從坐起，偏袒右肩，[跍*月]跪白佛：「今何因緣而發微笑？」",
        "translation": "After he had finished remembering this, he rose from his seat, bared his right shoulder, [kaṭhaka*moon] knelt down, and said to the Buddha, \"What was the cause for this smile?\"",
        "source": "T22n1421_021:0145c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語娑竭陀：「此二十億九十一劫來，始今足蹈於地。」",
        "translation": "The Buddha said to Sāgata, \"These 2 billion, 91 eons have passed since my feet first stepped on the ground.\"",
        "source": "T22n1421_021:0145c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「二十億何因緣，九十一劫足不蹈地？」",
        "translation": "He also asked, \"What were the causes for the 2 billion and 91 eons when their feet didn't touch the ground?\"",
        "source": "T22n1421_021:0145c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「過去世時，有佛世尊出現於世，名毘婆尸；父王治城，長十二由旬，廣七由旬，多諸人眾安隱豐樂。",
        "translation": "The Buddha said, \"Once upon a time, there was a Bhagavān who appeared in the world named Vipaśyin; his father ruled a city 12 yojanas long and seven yojanas wide, and it was full of people who were peaceful and prosperous.",
        "source": "T22n1421_021:0145c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛與大比丘僧六萬八千人俱，皆是阿羅漢於彼止住，其王日日請佛及僧於宮中食。",
        "translation": "The Buddha and 68,000 great monks and nuns, all arhats, stayed there, and the king invited the Buddha and the monks to eat in his palace every day.",
        "source": "T22n1421_021:0145c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大眾中有一人名修毘賒，共眾人往詣王所，白言：『王今作諸功德，願聽我等亦得豫之！』",
        "translation": "Then, a man named Xubixian from the crowd went with the others to the king and said, 'Now, the king has done all this meritorious work, may we be allowed to partake of it!'",
        "source": "T22n1421_021:0145c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『今佛僧眾有六萬八千人，恐汝等不辦，或更惱僧。』",
        "translation": "The king said, 'Now, there are 68,000 members of the Buddha's community, but I'm afraid you won't manage it, or you might trouble the saṃgha even more.'",
        "source": "T22n1421_021:0145c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白王言：『我自堪辦，願必聽許！』",
        "translation": "Again, he said to the king, 'I'm capable of handling it myself, so I hope you'll accept it!'",
        "source": "T22n1421_021:0145c27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『大善！』",
        "translation": "The king said, 'Very good!'",
        "source": "T22n1421_021:0145c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶恐不辦，勅作食如常：『彼若不周，當以足之。』",
        "translation": "Still afraid that it wouldn't be done, he ordered them to prepare food as usual, saying, 'If that's not enough, I'll give them enough.'",
        "source": "T22n1421_021:0145c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是諸人設供，過於王食；如是多日，王所作食竟不復設。",
        "translation": "The people then made offerings that were superior to the king's food, and after many days of this, the food the king made was no longer offered.",
        "source": "T22n1421_021:0145c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修毘賒次應設供，使人掘路，更以細軟土填，香泥泥之；兩邊竪八十寶柱，以雜色摩尼珠置於柱頭，懸雜色幡，張雜色幔，彌覆路上處處，路上安種種漿。",
        "translation": "When he next makes an offering, he has the road dug, filled with fine, soft earth, and muddied with incense; he erects eighty-jeweled pillars on either side, places multi-colored maṇi beads at their heads, hangs multi-colored streamers, spreads multi-colored curtains, covers every part of the road, and places various kinds of syrup on the road.",
        "source": "T22n1421_021:0146a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於家敷六萬八千座，一比丘坐一座，各以五百釜羹而供養之；一一比丘施劫貝二張，革屣一緉。",
        "translation": "At home, he spread out 68,000 seats, and a monk sat on one, offering each 500 kettles and spoons to his family; each monk gave two packs of scallops and a pair of leather sandals.",
        "source": "T22n1421_021:0146a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復為四方僧作一房，地敷臥具，皆悉妙好。",
        "translation": "He also made a room for the monks in each direction, and the floor was covered with bedding, all of which was marvelous.",
        "source": "T22n1421_021:0146a07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時修毘賒者，今二十億是。",
        "translation": "At the time, these were the two billion people who cultivated vaiśālā.",
        "source": "T22n1421_021:0146a08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是已後，受天上人中福等無有異。",
        "translation": "From then on, there's no difference between the merits of those in heaven and those among humans.",
        "source": "T22n1421_021:0146a09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若今不見我者，足猶不蹈地。」",
        "translation": "If someone didn't see me now, their feet wouldn't even touch the ground.\"",
        "source": "T22n1421_021:0146a09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二十億[跍*月]跪白佛：「願聽出家受具足戒！」",
        "translation": "Two billion [kaṭhas*moons] then knelt down and said to the Buddha, \"May I hear you leave home and accept the full set of precepts!\"",
        "source": "T22n1421_021:0146a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「父母聽汝未？」",
        "translation": "The Buddha said, \"Have your parents heard you?\"",
        "source": "T22n1421_021:0146a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「未！」",
        "translation": "replied, \"No!\"",
        "source": "T22n1421_021:0146a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「父母不聽，不得出家。」",
        "translation": "The Buddha said, \"If your parents don't listen, you mustn't leave home.\"",
        "source": "T22n1421_021:0146a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我當還家啟白父母。」",
        "translation": "He replied, \"I'll return home and reveal it to my parents.\"",
        "source": "T22n1421_021:0146a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大善！",
        "translation": "The Buddha said, \"That's very good!",
        "source": "T22n1421_021:0146a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今正是時。」",
        "translation": "Now is the right time.\"",
        "source": "T22n1421_021:0146a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是二十億禮佛足，右遶，還瞻婆城，白其母言：「我今欲出家學道。」",
        "translation": "The two billion bowed their heads at the Buddha's feet, circled to his right, returned to Campā, and said to their mother, \"Now, I want to leave home and train on the path.\"",
        "source": "T22n1421_021:0146a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母言：「止，止！",
        "translation": "His mother said, \"Stop, stop!",
        "source": "T22n1421_021:0146a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣出家？",
        "translation": "What are the conditions for leaving home?",
        "source": "T22n1421_021:0146a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯有汝，死尚不欲相離，如何生離？",
        "translation": "I only have you, and I don't want to be separated from you in death, so how can I be separated in birth?",
        "source": "T22n1421_021:0146a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我財物、珍寶、奴婢、田宅無有限數，可恣意作福，受五欲樂。」",
        "translation": "Now, there's no limit to the number of my possessions, treasures, servants, and land that I can freely create for their benefit and enjoy the five desires.\"",
        "source": "T22n1421_021:0146a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦請至三，然後聽許。",
        "translation": "He asked for up to three times of suffering, and then he was granted permission.",
        "source": "T22n1421_021:0146a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前禮母足，右遶三匝，還詣佛所，頭面禮足，[跍*月]跪白佛：「母已聽許，願便與我出家受具足戒！」",
        "translation": "He bowed at his mother's feet, circled her three times to her right, returned to the Buddha, bowed his head and feet, [Khaśa*moon] knelt down, and said to the Buddha, \"Mother, I've received your permission, so please let me leave home and receive the full set of precepts!\"",
        "source": "T22n1421_021:0146a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「比丘來！",
        "translation": "The Buddha said, \"Come, monks!",
        "source": "T22n1421_021:0146a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家受具足戒，廣修梵行；我善說法，能盡苦源！」",
        "translation": "I left home, received the full precepts, and extensively cultivated the religious practice; I'm a good preacher and can end the source of suffering!\"",
        "source": "T22n1421_021:0146a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，二十億鬚髮自墮，僧伽梨著身，鉢盂在手。",
        "translation": "When he said those words, two billion bearded hairs fell on their own, the saṃghârī was placed on their bodies, and a bowl was placed in their hands.",
        "source": "T22n1421_021:0146a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家不久，於尸陀林精進經行，足傷血流，烏隨啄吞。",
        "translation": "Soon after leaving home, he was walking intensely through the Śītā Forest when his foot was wounded and bled, and a crow pecked and swallowed it.",
        "source": "T22n1421_021:0146a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十億作是念：「佛弟子中精進無勝我者，而今未得盡諸苦源。",
        "translation": "Two billion of them thought, \"There's no one among Buddha's disciples who makes more effort than I do, but now I haven't yet ended the sources of suffering.",
        "source": "T22n1421_021:0146a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我家幸多財寶，亦可反俗快作功德。」",
        "translation": "Luckily, my family has a lot of wealth and treasure, so I could turn away from the world and quickly make merit.\"",
        "source": "T22n1421_021:0146a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知其念，從耆闍崛山來下，見烏啄吞其血。",
        "translation": "Knowing his thought, the Buddha came down from Mount Gṛdhrakūṭa and saw a crow pecking at his blood.",
        "source": "T22n1421_021:0146a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問阿難：「何故有此血，烏競啄之？」",
        "translation": "He asked Ānanda, \"Why is there this blood that the crow is pecking at?\"",
        "source": "T22n1421_021:0146a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「二十億於此經行，足傷血出。」",
        "translation": "He replied, \"Two billion [koṭīs] were walking through this sutra, and their feet bled out.\"",
        "source": "T22n1421_021:0146a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊便往到其所，問二十億：「汝實作是念不？」",
        "translation": "The Bhagavān then went to him and asked 2,000,000,000, \"Is that really what you're thinking?\"",
        "source": "T22n1421_021:0146a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "They replied, \"That's true.",
        "source": "T22n1421_021:0146b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T22n1421_021:0146b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復語言：「我今問汝，隨意答我。",
        "translation": "The Buddha again said, \"Now, I'm going to ask you, so answer me as you like.",
        "source": "T22n1421_021:0146b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝在家時善彈琴不？」",
        "translation": "Were you good at playing the lute when you were at home?\"",
        "source": "T22n1421_021:0146b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「善！」",
        "translation": "He replied, \"Good!\"",
        "source": "T22n1421_021:0146b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「琴弦急時，聲調好不？」",
        "translation": "He also asked, \"When the strings of the lute are sharp, does it sound good?\"",
        "source": "T22n1421_021:0146b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不好！」",
        "translation": "replied, \"No!\"",
        "source": "T22n1421_021:0146b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「琴弦緩時聲調好不？」",
        "translation": "He also asked, \"Does the lute sound good when the strings are relaxed?\"",
        "source": "T22n1421_021:0146b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不好！」",
        "translation": "replied, \"No!\"",
        "source": "T22n1421_021:0146b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問云：「何得好？」",
        "translation": "Again, he asked, \"How can it be good?\"",
        "source": "T22n1421_021:0146b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「不急、不緩，然後乃好。」",
        "translation": "He answered, \"Not being hasty and not being slow, then it's good.\"",
        "source": "T22n1421_021:0146b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「於我法中亦復如是，太緩、太急，何緣得道？",
        "translation": "The Buddha said, \"So it is with my teaching; how can one attain the way if one is too slow and too hasty?",
        "source": "T22n1421_021:0146b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若精進處中，不久盡苦。」",
        "translation": "If someone makes effort, they won't soon end suffering.\"",
        "source": "T22n1421_021:0146b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十億聞佛說已，即於經行處，漏盡無餘。",
        "translation": "After hearing the Buddha's teaching, the contaminants ended without remainder in the place where the sūtras were practiced.",
        "source": "T22n1421_021:0146b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊以二十億足下傷破，告諸比丘：「今聽二十億著一重革屣。」",
        "translation": "With his feet broken, the Bhagavān addressed the monks, \"Now, listen, 2 billion people are wearing a heavy leather sandal.\"",
        "source": "T22n1421_021:0146b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十億白佛言：「世尊！",
        "translation": "Two billion said to the Buddha, \"Bhagavān!",
        "source": "T22n1421_021:0146b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我捨二十億錢，五百摩尼寶珠，一摩尼寶床，二十夫人，無量婇女。",
        "translation": "I've given up two billion pieces of money, 500 precious maṇi beads, a precious maṇi bed, 20 wives, and measureless women.",
        "source": "T22n1421_021:0146b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若著一重革屣，人當譏我：『捨如此財寶，而猶貪受一重革屣。』",
        "translation": "If I were to put on a pair of leather sandals, people would ridicule me, saying, 'I'd abandon such wealth and treasure and still crave a pair of leather sandals.'",
        "source": "T22n1421_021:0146b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊若聽一切比丘著者，我當著之。」",
        "translation": "Bhagavān, if you listen to all the monks who are wearing them, I will wear them.\"",
        "source": "T22n1421_021:0146b13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛便讚歎少欲知足、讚戒、讚持戒已，告諸比丘：「從今聽諸比丘著一重革屣。」",
        "translation": "After praising having few desires and being satisfied, praising morality, and praising the observance of precepts, the Buddha then addressed the monks, \"From now on, listen to the monks who are wearing one pair of leather sandals.\"",
        "source": "T22n1421_021:0146b13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘著兩重革屣，以是白佛，佛言：「不聽，犯者突吉羅！」",
        "translation": "Some monks who were wearing two pairs of leather sandals thus approached the Buddha, and he said, \"No, I won't listen to you, you violator!\"",
        "source": "T22n1421_021:0146b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘著革屣在和尚、阿闍梨前後經行，有餘比丘亦皆效之。",
        "translation": "Six groups of monks then wore leather sandals while walking in front of and behind the monks and ācāryas, and some of the other monks followed suit.",
        "source": "T22n1421_021:0146b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「不應和尚、阿闍梨前著革屣，犯者突吉羅！",
        "translation": "The monks said to the Buddha, \"The Buddha said, 'Don't wear leather sandals in front of the monks and ācāryas; it's a violation, my lord!'",
        "source": "T22n1421_021:0146b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有因緣於和尚、阿闍梨前著革屣無犯。",
        "translation": "It's not a violation to wear leather sandals in front of a monk or a priest for any reason.",
        "source": "T22n1421_021:0146b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若地有棘刺、若地有刺脚草、若地有沙石、若病時、若闇時。」",
        "translation": "If there are thorns in the ground, thorny-footed grass in the ground, sand and gravel in the ground, when sick, or in the dark,\"",
        "source": "T22n1421_021:0146b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘著金、銀、象牙、石屐。",
        "translation": "The monks then were wearing gold, silver, ivory, and stone sandals.",
        "source": "T22n1421_021:0146b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士見，譏呵言：「此諸比丘如王大臣，常說少欲知足，而今奢費無度！",
        "translation": "When the householders saw them, they ridiculed them, saying, \"These monks are like the king's ministers who always say they have few desires and are satisfied with what they have, but now they spend extravagantly without limit!",
        "source": "T22n1421_021:0146b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無沙門行！",
        "translation": "no monastic practices!",
        "source": "T22n1421_021:0146b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破沙門法！」",
        "translation": "destroy the teachings of the ascetics!\"",
        "source": "T22n1421_021:0146b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸長老比丘聞，種種呵責，以是白佛。",
        "translation": "When the elder monks heard this, they were rebuked in various ways and reported it to the Buddha.",
        "source": "T22n1421_021:0146b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，告諸比丘：「從今不聽著如上屐，犯者突吉羅！」",
        "translation": "In light of this, the Buddha gathered the monks and told them, \"From now on, you mustn't listen to this kind of clogging, or you'll be caught off guard!\"",
        "source": "T22n1421_021:0146b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在毘舍離。",
        "translation": "The Buddha was at Vaiśālī.",
        "source": "T22n1421_021:0146b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一住處下濕，著皮革屣，臭爛虫生。",
        "translation": "There was a damp dwelling place where leather sandals were worn, and smelly, rotten insects grew.",
        "source": "T22n1421_021:0146b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「聽諸比丘作婆婆草、迦尸草、文柔草、鳩尸草等屧。」",
        "translation": "The monks told the Buddha this, and he said, \"Listen, monks, let's make shoes of Bāṣpa grass, Kāśī grass, Manoj grass, and Kusi grass.\"",
        "source": "T22n1421_021:0146b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘著，水從下出漬脚。",
        "translation": "When the monks put them on, water comes out from below and wets their feet.",
        "source": "T22n1421_021:0146c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽用生皮底下。」",
        "translation": "They therefore told the Buddha, and he said, \"Listen, use rawhide underneath.\"",
        "source": "T22n1421_021:0146c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘畜著木屐、木屧，於僧坊內行作聲，亂諸比丘坐禪。",
        "translation": "Some monks were wearing wooden clogs and wooden shoes, and they were walking around the monastery making noises that disturbed the monks' sitting meditation.",
        "source": "T22n1421_021:0146c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一比丘著木屐下利，夜踏殺蛇。",
        "translation": "Another monk put on wooden clogs and shoes and killed a snake by stepping on it at night.",
        "source": "T22n1421_021:0146c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛以是事集比丘僧，告諸比丘：「從今不聽著木屐、木屧，犯者突吉羅！",
        "translation": "He therefore told the Buddha, and the Buddha gathered the monks and told them, \"From now on, you mustn't wear wooden clogs or wooden shoes; if you do, you'll be surprised!",
        "source": "T22n1421_021:0146c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽於三處著非行來屐：大便處、小便處、洗手脚處。」",
        "translation": "Listen to the monks who wear rags that don't belong to the practice in three places: where they defecate, where they urinate, and where they wash their hands and feet.\"",
        "source": "T22n1421_021:0146c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘著兜羅貯革屣，以是白佛，佛言：「不應爾，犯者突吉羅！」",
        "translation": "Some monks wearing leather sandals made a complaint to the Buddha, who said, \"No, that's a violation, duṣkṛ!\"",
        "source": "T22n1421_021:0146c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘革屣鼻破脚指，以是白佛，佛言：「聽以軟物貯鼻。」",
        "translation": "Some monks broke their noses and toes with leather sandals and said to the Buddha, \"Listen, let's put something soft on your nose.\"",
        "source": "T22n1421_021:0146c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘脚跟劈裂，以是白佛，佛言：「聽以熊膏塗，熊皮裹。」",
        "translation": "Some monks who had their heels split said to the Buddha, \"Listen, put bear paste on them and wrap them in bear skin.\"",
        "source": "T22n1421_021:0146c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時畢陵伽婆蹉常一心行，不覺蹴脚指破。",
        "translation": "Pilinda-vatsa was always walking with one mind and didn't realize that his toes were cracked.",
        "source": "T22n1421_021:0146c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見之，告諸比丘：「從今聽諸比丘著富羅。」",
        "translation": "When the Buddha saw this, he told the monks, \"From now on, listen to the monks as they put on the pula.\"",
        "source": "T22n1421_021:0146c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘作[革*雍]大深，諸居士譏呵言：「此比丘所著富羅，如我等鞾。」",
        "translation": "The monks made a [geya]great deep noise, and the householders criticized them, saying, \"This monk is wearing a pula like we are.\"",
        "source": "T22n1421_021:0146c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應深作[革*雍]，聽至踝上。」",
        "translation": "They then said to the Buddha, \"You shouldn't make [a leather * yon] so deep that you hear it go up to your ankles.\"",
        "source": "T22n1421_021:0146c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘作[革*雍]如鞾，諸居士譏呵如上。",
        "translation": "Some monks made [geysers] like robes, and the householders criticized them as above.",
        "source": "T22n1421_021:0146c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應開前。」",
        "translation": "They then said to the Buddha, \"You should turn it on.\"",
        "source": "T22n1421_021:0146c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘著畫革屣。",
        "translation": "There were monks who were wearing painted leather sandals.",
        "source": "T22n1421_021:0146c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「不應著，犯者突吉羅！",
        "translation": "They then said to the Buddha, \"Don't put them on, for it's a violation,\" and he said, \"You're a tukhāra!",
        "source": "T22n1421_021:0146c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得，聽壞色著。」",
        "translation": "If you do, listen to him as he destroys his attachment to form.\"",
        "source": "T22n1421_021:0146c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時離婆多在陀婆國人間遊行，遇寒雪脚凍壞，還到祇洹，頭面禮佛足，却坐一面。",
        "translation": "When Revata was traveling among the people of the country of Dravya and his feet froze in the snow and cold, he returned to Gipan, bowed his head to the Buddha's feet, and withdrew to sit to one side.",
        "source": "T22n1421_021:0146c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問言：「脚何故爾？」",
        "translation": "The Buddha asked, \"Why are your feet so cold?\"",
        "source": "T22n1421_021:0146c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具以事答。",
        "translation": "He answered with a detailed explanation of the matter.",
        "source": "T22n1421_021:0146c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問：「彼國人頗有所著不？」",
        "translation": "The Buddha asked, \"Do the people of that country have any attachments?\"",
        "source": "T22n1421_021:0146c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「彼國人著富羅、著革屣。」",
        "translation": "He replied, \"The people of that country are wearing pula and leather sandals.\"",
        "source": "T22n1421_021:0146c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種讚歎少欲知足、讚戒、讚持戒已，告諸比丘：「從今聽雪寒國，著富羅、著革屣。",
        "translation": "After the Buddha had given various praises for having few desires and being satisfied, for morality, and for upholding the precepts, he told the monks, \"From now on, I'll listen to those in the country of Xuecan who are wearing pula and leather sandals.",
        "source": "T22n1421_021:0146c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼國更有所著，聽隨意著之。」",
        "translation": "If there's anything else to wear in that country, you may wear it as you like.\"",
        "source": "T22n1421_021:0146c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘雪寒中行，脚凍壞。",
        "translation": "Some monks were walking in the snow and cold, and their feet froze.",
        "source": "T22n1421_021:0146c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽用酥、鹽、熊膏塗，以熊皮作鞾。」",
        "translation": "He therefore said to the Buddha, \"You may rub them with ghee, salt, and bear paste, and use bearskin to make leather slippers.\"",
        "source": "T22n1421_021:0146c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘在道行，不知用何物盛糧。",
        "translation": "There were monks walking on the path who didn't know what to use for provisions.",
        "source": "T22n1421_021:0146c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽用羊皮、牛皮、鹿皮及劫貝作囊。」",
        "translation": "They therefore said to the Buddha, \"Listen, use sheepskin, cowhide, deerskin, and karpāsa to make a bladder.\"",
        "source": "T22n1421_021:0147a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘以盛食污泥，白佛，佛言：「應淨浣。」",
        "translation": "Some monks declared to the Buddha that they had soiled their food, and he said, \"You must cleanly wash it.\"",
        "source": "T22n1421_021:0147a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘便浣皮囊，爛壞虫生，白佛。",
        "translation": "The monks then rinsed the leather bags, but worms and rotten things grew in them, and they reported it to the Buddha.",
        "source": "T22n1421_021:0147a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應浣皮囊，應反揩拭，若淨善；若不淨，勿復畜。」",
        "translation": "The Buddha said, \"You shouldn't wash the skin and bags, but rather wipe them clean and wholesome if they're not clean; if they're not clean, don't store them again.\"",
        "source": "T22n1421_021:0147a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸阿練若住處比丘畜皮敷具，諸惡獸聞氣來殺諸比丘。",
        "translation": "When monks from the forest dwelling of Araṇya stored leather implements, bad animals heard about it and came to kill the monks.",
        "source": "T22n1421_021:0147a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是白佛，佛言：「於阿練若處，不應畜皮敷具。",
        "translation": "The monks said to the Buddha, \"The monks said, 'You shouldn't store leather bedding in a forested place.",
        "source": "T22n1421_021:0147a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應持與聚落住處，以藉函梯道。」",
        "translation": "You should take it to a village dwelling and use it as a means to carry the ladder up the road.\"",
        "source": "T22n1421_021:0147a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘在佛後，刺刺脚，不能行。",
        "translation": "A monk who was behind the Buddha pricked his foot and couldn't walk.",
        "source": "T22n1421_021:0147a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士見，語言：「大德！",
        "translation": "When the householders saw this, they said, \"Mañjuśrī!",
        "source": "T22n1421_021:0147a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛去已遠，何不駛行？」",
        "translation": "The Buddha has left, so why don't you take up the practice?\"",
        "source": "T22n1421_021:0147a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「刺刺我脚，不能行。」",
        "translation": "He replied, \"That thorn pricked my foot, so I can't walk.\"",
        "source": "T22n1421_021:0147a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士言：「能著靺不？」",
        "translation": "The monks said, \"Can you put a cloth on your back?\"",
        "source": "T22n1421_021:0147a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘不敢著，前至佛所，白佛。",
        "translation": "The monk didn't dare to get attached, so he went to the Buddha and told him.",
        "source": "T22n1421_021:0147a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽著。」",
        "translation": "The Buddha said, \"Listen to him.\"",
        "source": "T22n1421_021:0147a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘於塚間得革屣，復不敢取。",
        "translation": "A monk who had found a leather slipper in a tomb didn't dare to take it.",
        "source": "T22n1421_021:0147a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽取。」",
        "translation": "He then said to the Buddha, \"Listen!\"",
        "source": "T22n1421_021:0147a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘得種種形色、種種皮革屣，不敢取。",
        "translation": "Some monks who had obtained leather sandals of various shapes and sizes didn't dare to take them.",
        "source": "T22n1421_021:0147a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「除人、馬、象皮，餘聽取；壞本形色，若形色不可壞，於僧坊內著，不得出外。」",
        "translation": "They then said to the Buddha, \"Except for the skins of humans, horses, and elephants, listen; destroy the original form and color, or if the form and color are indestructible, put them inside the monastery and don't let them go out.\"",
        "source": "T22n1421_021:0147a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘得新革屣不敢受，以是白佛，佛言：「聽受。",
        "translation": "Some monks who had obtained new leather sandals didn't dare to accept them and therefore said to the Buddha, \"Accept them!",
        "source": "T22n1421_021:0147a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應令淨人著行七步，然後著之。」",
        "translation": "You should make a clean person walk seven steps in wearing them, and then you should wear them.\"",
        "source": "T22n1421_021:0147a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘革屣、富羅及履破壞，不知令誰補治。",
        "translation": "Some monks had their leather sandals, furoshiki, and footwear damaged, and didn't know who to ask to repair them.",
        "source": "T22n1421_021:0147a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「應借人補治；若無人，比丘能自補，亦聽畜大小錐、大小刀、縫皮綖。」",
        "translation": "They therefore said to the Buddha, \"You should borrow someone to mend them; if there's no one, a monk who can mend them himself will also accept the use of large and small awls, large and small knives, and threads for sewing leather.\"",
        "source": "T22n1421_021:0147a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘為破見比丘補治革屣等物，以是白佛，佛言：「不應為如此人作，應為慚愧欲學戒者作。」",
        "translation": "Some monks who were patching leather sandals and other things for the monks who had broken their views said to the Buddha, \"It shouldn't be done for such a person; it should be done for someone who conscientiously desires to train in the precepts.\"",
        "source": "T22n1421_021:0147a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知用何物安皮作具？",
        "translation": "The monks didn't know what to use to put leather on as a cloth.",
        "source": "T22n1421_021:0147a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是白佛，佛言：「聽皮囊盛之。」",
        "translation": "He therefore said to the Buddha, \"Listen to this leather bag.\"",
        "source": "T22n1421_021:0147a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五分律卷第二十一",
        "translation": "Five Part Vinaya, Volume 21",
        "source": "T22n1421_021:0147a25_0",
        "is_bad_quality": false
    }
]