[
    {
        "source_sentence": "四分律卷第四十六(三分之十)",
        "translation": "Four Part Vinaya, Volume 46 (Ten of Three)",
        "source": "T22n1428_046:0904a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姚秦罽賓三藏佛陀耶舍",
        "translation": "Yaoqin's Tripiṭaka of the Kāśyapa Buddha Yeshe",
        "source": "T22n1428_046:0904a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共竺佛念等譯",
        "translation": "shared with Zhu Fonian and other translators",
        "source": "T22n1428_046:0904a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覆藏揵度第十三",
        "translation": "The Thirteenth Closing of the Canon of Gandhāra",
        "source": "T22n1428_046:0904a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊在舍衛國。",
        "translation": "The Bhagavān was then in the country of Śrāvastī.",
        "source": "T22n1428_046:0904a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘自行覆藏，更互與覆藏羯磨、本日治、摩那埵、出罪羯磨。",
        "translation": "At the time, six groups of monks covered their own treasures and also gave each other the karmas for covering their treasures, the karmas for the present day's correction, the karmas for manas, and the karmas for expulsion from sins.",
        "source": "T22n1428_046:0904a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「不應自行覆藏與他覆藏羯磨、本日治、摩那埵、出罪。」",
        "translation": "The monks said to the Buddha, \"The Buddha said, 'Don't cover your own hide and give others the karmas for covering your hide, for the present day's correction, for manasattva, and for expulsion from the sin.'\"",
        "source": "T22n1428_046:0904a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行本日治比丘，更互作覆藏、本日治、摩那埵、出罪，佛言：「不應自行本日治，更互作覆藏、本日治、摩那埵、出罪。」",
        "translation": "When he practiced the monk's daily discipline and also performed the mutual covering, daily discipline, manasattva, and excommunication, the Buddha said, \"You shouldn't perform your own daily discipline and also perform the mutual covering, daily discipline, manasattva, and excommunication.\"",
        "source": "T22n1428_046:0904a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼自行摩那埵比丘，更互作覆藏，佛言：「不應自行摩那埵、與他作覆藏羯磨乃至出罪。」",
        "translation": "When he himself, a monk of manasattva, furthermore, makes mutual coverings, the Buddha says, \"You shouldn't make a kalpa of coverings with another monk of manasattva by yourself, even to the point of releasing him from his crimes.\"",
        "source": "T22n1428_046:0904a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼自出罪，更互作覆藏羯磨乃至出罪，佛言：「不應自出罪、與他覆藏羯磨乃至出罪。」",
        "translation": "When he excommunicates himself and then mutually makes a kalpa of covering up and excommunication, the Buddha says, \"You shouldn't excommunicate yourself and make a kalpa of covering up and excommunication with another person.\"",
        "source": "T22n1428_046:0904a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏，更互作覆藏羯磨、本日治、摩那埵、足滿二十人出罪，佛言：「不應爾。",
        "translation": "When he practices concealingment and also mutually makes concealing karma, the present day's purification, and the excommunication of twenty people, the Buddha says, \"That shouldn't be the case.",
        "source": "T22n1428_046:0904a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行覆藏、本日治亦如是，自行摩那埵亦如是，自行出罪亦如是。」",
        "translation": "So is your own covering up, and so is your own daily discipline, and so is your own manasattva, and so is your own excommunication.\"",
        "source": "T22n1428_046:0904a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，與他受大戒、與他依止、畜沙彌、受僧差、差已教授比丘尼，佛言：「行覆藏者不應爾。」",
        "translation": "When someone who practices concealment receives the great precepts with others, takes refuge with others, corrals novices, takes orders from the saṃgha, and teaches monks and nuns after taking orders, the Buddha says, \"That shouldn't be the case for someone who practices concealment.\"",
        "source": "T22n1428_046:0904a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，知有餘比丘能說戒者而為他說戒、於僧中或問毘尼義或答、在眾僧作羯磨人數中、受僧羯磨差平斷事、受眾僧差使，佛言：「行覆藏者不應爾。」",
        "translation": "When a practitioner of concealment knows that there are other monks who can preach the precepts and preach them for others, asks or answers questions about the meaning of the Vinaya in the saṃgha, is present when the saṃgha is engaged in a karmic duty, is sent by the saṃgha for a karmic duty, and makes eventual decisions, and is sent by the saṃgha, the Buddha says, \"That practitioner of concealment shouldn't do that.\"",
        "source": "T22n1428_046:0904a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，或早入聚落逼暮還、或不親附沙門親近外道、不隨順比丘說異教，佛言：「不應爾。」",
        "translation": "If he practices concealment, or if he enters a village early and is forced to return late, or if he doesn't associate with ascetics and become close to non-Buddhists, or if he doesn't follow a monk who teaches a different doctrine, the Buddha says, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0904a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，若犯此罪、若相似、若從此生、若重於彼、呵他羯磨及作羯磨者，佛言：「不應爾。」",
        "translation": "If he practices concealment, commits this sin, resembles it, arises from it, or is greater than that, or ridicules others in karman and makes karman, the Buddha says, \"That shouldn't be.\"",
        "source": "T22n1428_046:0904a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，受清淨比丘敷座、洗脚、拭革屣、揩摩身，佛言：「不應爾。」",
        "translation": "If he practices concealment and accepts a pure monk's dressing his seat, washing his feet, wiping his sandals, or rubbing his body, the Buddha says, 'That shouldn't be.'\"",
        "source": "T22n1428_046:0904b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，受清淨比丘起迎逆、禮拜、執手、恭敬問訊、為持衣鉢，佛言：「不應爾。」",
        "translation": "He whose practice is covered up receives a pure monk who rises to greet him, venerates him, holds his hand, respectfully greets him, and carries his robe and bowl for him, and the Buddha says, \"That shouldn't be.\"",
        "source": "T22n1428_046:0904b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，舉清淨比丘、作憶念、作自言、為他作證、遮說戒、遮自恣、與清淨比丘共鬪，佛言：「不應爾。」",
        "translation": "He practices concealment and lifts up a pure monk, recollects, speaks for himself, testifies for others, refuses to preach the precepts, refuses to perform self-conditions, and has a fight with a pure monk, the Buddha says, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0904b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，共清淨比丘行入白衣家、或隨他比丘行、或將他比丘行、或受他供養、或受清淨比丘剃髮、或受清淨比丘作使，佛言：「不應爾。」",
        "translation": "When he practices concealing himself and enters a house of white clothing with a pure monk, follows the practices of another monk, follows the practices of another monk, accepts offerings from another monk, shaves his hair for a pure monk, or accepts a pure monk as his messenger, the Buddha says, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0904b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏比丘，共清淨比丘行、至前食後食上在前行、或竝語竝行、或反抄衣、或通肩披衣、或裹頭、或覆兩肩、或著革屣，佛言：「不應爾。",
        "translation": "When a monk who practices concealing himself walks with a pure monk, goes up to the front of the meal, goes up after the meal, walks in front of the meal, speaks together, walks together, wears a reverse robe, drapes his robe over his shoulders, wraps his head, covers his shoulders, or puts on leather sandals, the Buddha says, \"That shouldn't be the case.",
        "source": "T22n1428_046:0904b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今已去聽偏露右肩、脫革屣隨從後行。」",
        "translation": "From now on, you must bare your right shoulder, take off your leather sandals, and follow behind.\"",
        "source": "T22n1428_046:0904b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，作如是意：「不往食上，恐餘比丘知我行覆藏。」",
        "translation": "That person who practices concealment thinks this, \"I won't go to the food, for fear that the other monks will know that I'm practicing concealment.\"",
        "source": "T22n1428_046:0904b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應爾。」",
        "translation": "The Buddha said, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0904b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者作如是意：「至食上不坐，恐餘比丘知我行覆藏。」",
        "translation": "He who practices concealment thinks thus, \"Go to the food and don't sit there, lest the other monks might know that I'm practicing concealment.\"",
        "source": "T22n1428_046:0904b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏比丘，作如是意：「請取食食，恐餘比丘知我行覆藏。」",
        "translation": "That practicing hermit monk did this, \"Please take some food to eat, lest the other monks might know that I'm practicing hermitage.\"",
        "source": "T22n1428_046:0904b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應爾。」",
        "translation": "The Buddha said, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0904b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，與清淨比丘隨次坐，佛言：「不應爾。",
        "translation": "That practicing cover-up monk sat down with the pure monks in turn, and the Buddha said, \"That shouldn't be the case.",
        "source": "T22n1428_046:0904b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽在末行坐。」",
        "translation": "Listen to him as he sits at the end of his practice.\"",
        "source": "T22n1428_046:0904b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有如是教，犯罪人應在下行坐。",
        "translation": "The Bhagavān had thus taught that offenders should sit at the bottom of the line.",
        "source": "T22n1428_046:0904b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼在白衣下坐，佛言：「不應爾。」",
        "translation": "He was sitting under the white robes, and the Buddha said, \"That shouldn't be.\"",
        "source": "T22n1428_046:0904b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼在沙彌下坐，佛言：「不應爾。",
        "translation": "He was sitting under a novice monk, and the Buddha said, 'That shouldn't be the case.",
        "source": "T22n1428_046:0904b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應在大比丘末行坐。」",
        "translation": "You should sit at the end of the great monks' rows.\"",
        "source": "T22n1428_046:0904b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，與清淨比丘共經行處行，彼在下經行處，己在高經行處，或在前行、或竝語、或共行、反抄衣、通肩披衣、或裹頭覆兩肩、著革屣，佛言：「不應爾。」",
        "translation": "When a monk who's practicing covering his hide shares a place of sūtra practice with a pure monk, or when he's in a lower place of sūtra practice and he's in a higher place of sūtra practice, or when he's walking in front of him or speaking together or walking together, or when he's wearing robes with his back turned, wearing robes over his shoulders, or wrapping his head around his shoulders or wearing leather sandals, the Buddha says, \"That shouldn't be.\"",
        "source": "T22n1428_046:0904b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽偏露右肩、脫革屣在後行。」",
        "translation": "The Buddha said, \"Listen, bare your right shoulder and take off your leather sandals while walking behind you.\"",
        "source": "T22n1428_046:0904b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，道路行作如是意：「不在正道行，恐餘比丘知我行覆藏。」",
        "translation": "That person who practices concealment and travels along the road does so with the intention, \"I'm not walking on the right path, for fear that other monks will know that I'm practicing concealment.\"",
        "source": "T22n1428_046:0904b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應爾。」",
        "translation": "The Buddha said, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0904c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，在道行作如是意：「在後行，恐餘比丘知我行覆藏。」",
        "translation": "He whose practice is concealed does this when he's walking on the path, \"I'm afraid the other monks will know that my practice is concealed when I walk behind them.\"",
        "source": "T22n1428_046:0904c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應爾。」",
        "translation": "The Buddha said, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0904c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，共清淨比丘共一座一床一板，佛言：「不應爾。」",
        "translation": "If he practices concealment and shares a bed and a board with a pure monk, the Buddha says, 'That shouldn't be the case.'\"",
        "source": "T22n1428_046:0904c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若長床板，佛言：「聽作隔斷然後坐，若取餘床在後坐。",
        "translation": "If it's a long bed and board, the Buddha says, 'Listen, make a break and then sit down, or if you take another bed and sit behind it.'",
        "source": "T22n1428_046:0904c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，若在小食大食上，應掃灑敷坐具、水瓶、洗瓶、具盛殘食器，應為清淨比丘敷坐具，乃至洗足器物、拭足巾、盛水器。",
        "translation": "Those who practice concealing should, if they're serving a small meal or a large meal, sweep and dress sitting cloths, water bottles, washing bottles, and utensils for leftover food, and they should dress sitting cloths for the pure monks, down to utensils for washing feet, towels for wiping feet, and water containers.",
        "source": "T22n1428_046:0904c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨比丘來，應出遠迎為持衣鉢。",
        "translation": "When a pure monk comes, he should go out to meet him and carry his robe and bowl.",
        "source": "T22n1428_046:0904c09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有鉢、床鉢支應安置上。",
        "translation": "If he has a bowl or a bed, he should place it on top of the bowl.",
        "source": "T22n1428_046:0904c10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧伽梨在頭上肩上，應取看之，無垢穢污不？",
        "translation": "If the bowl or bed bowl is on your head and shoulders, should you pick it up and look at it, seeing that it's not defiled?",
        "source": "T22n1428_046:0904c11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有塵垢穢污，應却便却，應浣當浣。",
        "translation": "\"If there's dirt and grime, clean it as you go, and rinse it as you should.",
        "source": "T22n1428_046:0904c12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "浣已曬著繩床上、木床上，應與清淨比丘具洗足器、拭足巾、水器，拭革屣已著左面看之，不令泥水污不？",
        "translation": "After rinsing them, he should put them on a rope bed or a wooden bed in the sun, share with a clean monk a footwasher, a foot towel, and a water vessel, and look at them from his left side after wiping his sandals, so that they won't be soiled by mud and water, right?",
        "source": "T22n1428_046:0904c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有泥水污者，當移避之，為清淨比丘洗足已除去石水器安置本處。",
        "translation": "If there's any mud or water that's soiled, you must remove it and put away the stoneware container for the pure monk after washing his feet.",
        "source": "T22n1428_046:0904c15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼應淨洗手，與清淨比丘過食。",
        "translation": "He should wash his hands cleanly and give the pure monk a past meal.",
        "source": "T22n1428_046:0904c17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨比丘食時，應供給所須，若酪漿、若蔓[少/兔]苦酒、鹽菜應與，若熱當扇，須水應與水。",
        "translation": "When the pure monk eats, he must provide what's needed, such as milk and butter, bitter wine and salt food, and if it's hot, he must fan it, and if he needs water, he must give it to him.",
        "source": "T22n1428_046:0904c18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若恐時過當俱食。",
        "translation": "If he's afraid the time will pass, he must eat together.",
        "source": "T22n1428_046:0904c20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨比丘食已，當為取鉢與洗手。",
        "translation": "After he eats, a pure monk will take his bowl and wash his hands.",
        "source": "T22n1428_046:0904c20_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若自食已有殘食，應與人若非人，若著無蟲水中若無草處，洗食器還復本處，應掃灑食堂除去糞土。」",
        "translation": "If he has leftover food, he should give it to someone or someone else, or if he puts it in water that's free of worms or grass, wash the food container and return it to its original place, and sweep the food hall to remove the dung and dirt.\"",
        "source": "T22n1428_046:0904c21_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘便用已，常食鉢盛糞掃棄，餘比丘見惡之，佛言：「不應用鉢棄糞掃，聽以瓫若澡盤若掃箒。",
        "translation": "After he then used it, that monk used his regular food bowl to sweep up the dung. When the other monks saw this, the Buddha said, \"You shouldn't use your bowl to throw up the dung and sweep it up.",
        "source": "T22n1428_046:0904c23_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鉢應淨潔畜。",
        "translation": "The almsbowl should be clean and stored in a bowl.",
        "source": "T22n1428_046:0904c26_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼行覆藏比丘，若僧洗浴，應至清淨比丘所問言：『大德洗不？』",
        "translation": "\"If that monk who practices covering the saṃgha washes, he should go to a pure monk and ask, 'Does the great man wash?'",
        "source": "T22n1428_046:0904c26_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼答言：『當洗。』",
        "translation": "If he answers, 'You will wash it,' then that monk should first look into the bathroom.",
        "source": "T22n1428_046:0904c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此比丘便應先看浴室，無塵穢不？",
        "translation": "Should that monk then first look in the bathroom, seeing that it's spotless?'",
        "source": "T22n1428_046:0904c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有塵穢，應掃便掃，應水灑便灑，應取薪便取，應破便破，應然火便然火，應著薪便著，應與清淨比丘具洗浴瓶、若浴床、若刮汗刀、若水器、若泥器、若樹皮、若細末藥、若泥。",
        "translation": "If there's dust, sweep it up as you should, sprinkle it with water as you should, take firewood as you should, break it as you should, make fire as you should, put firewood on it as you should, and give a pure monk a bathing pot, a bathing bed, a sweat scraper, a water vessel, a clay vessel, tree bark, finely powdered medicine, or mud.",
        "source": "T22n1428_046:0904c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問上座已燃火。",
        "translation": "You should ask the superior monk if he has kindled a fire.",
        "source": "T22n1428_046:0905a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若清淨比丘病若老羸，應扶將至浴室所。",
        "translation": "If a pure monk is sick or elderly, he should help him go to the bathhouse.",
        "source": "T22n1428_046:0905a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不能行者，以繩床、木床、若衣舁至浴室所，應取清淨比丘衣安著衣架上、若龍牙杙上。",
        "translation": "If he can't walk, he should take a rope bed, a wooden bed, or a robe and carry it to the bathhouse, where he should put the pure monk's robe on a hanger or on a nylon tooth tether.",
        "source": "T22n1428_046:0905a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有油應為塗身，彼油器無安處不堅牢。」",
        "translation": "If there's oil, you should rub it on your body; there's no place for it to rest that won't hold.\"",
        "source": "T22n1428_046:0905a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「安著龍牙杙上、若懸著壁上。",
        "translation": "The Buddha said, \"Put it on a naginata stand or hang it on a wall.",
        "source": "T22n1428_046:0905a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若清淨比丘病老羸，應扶將入浴室中，與繩床、木床、浴瓶、刮汗刀、水器、泥器，與樹皮細末藥泥。",
        "translation": "If a pure monk is sick and old and weak, he should help him enter a bathhouse with a rope bed, a wooden bed, a bathing flask, a sweat scraper, a water vessel, a mud bowl, and finely powdered medicinal mud from a tree bark.",
        "source": "T22n1428_046:0905a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若烟來熏眼，當為安障。",
        "translation": "If smoke comes to smother your eyes, it will be a comforting obstruction.",
        "source": "T22n1428_046:0905a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若頭熱背熱應為覆，若欲洗浴入浴室，應白清淨比丘。",
        "translation": "If your head is burning and your back is hot, you must cover it, and if you want to take a bath and enter the bath, you must tell a monk who's pure.",
        "source": "T22n1428_046:0905a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作如是意：『欲白清淨比丘，恐煩亂共相逼迮。』",
        "translation": "If you think, 'I want to tell the pure monks that I'm afraid I'll be troubled by the mutual oppression of the afflictions,' then you go straight into the bath.",
        "source": "T22n1428_046:0905a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，直爾入浴室，在清淨比丘後揩摩身，彼即入浴室，至清淨比丘後住，應為餘比丘揩摩身，不應受他揩摩身。",
        "translation": "then he goes directly into the bathhouse and wipes his body after the pure monk, and he then goes into the bathhouse, goes to stay behind the pure monk, and wipes the bodies of the other monks, not accepting the wiping of bodies by others.",
        "source": "T22n1428_046:0905a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為清淨比丘洗浴已，然後自浴。",
        "translation": "After bathing the pure monk, he then bathes himself.",
        "source": "T22n1428_046:0905a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若清淨比丘老，應扶將出，若病以繩床、若木床，舁出浴室。",
        "translation": "If the pure monk is elderly, he should help him out, or if he's ill, he should carry him out to the bath on a rope bed or a wooden bed.",
        "source": "T22n1428_046:0905a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應與清淨比丘敷座、與洗脚器、拭巾、洗脚革屣，應取清淨比丘衣舒看抖擻，勿令有蛇蝎諸毒蟲，然後授與。",
        "translation": "He should give the pure monk a seat, a footwashing cloth, a towel, and leather sandals, and he should take the pure monk's robe, loosen it up, and shake it so that there aren't snakes, scorpions, or other venomous insects, and then give it to him.",
        "source": "T22n1428_046:0905a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眼藥丸香應與，若有甜蒱桃漿、蜜、石蜜，淨洗手受，授與清淨比丘。",
        "translation": "If there are eye-medicine pills and incense, give them to the pure monk, and if there's sweet peach juice, honey, or rock honey, receive it with clean hands, and give it to the pure monk.",
        "source": "T22n1428_046:0905a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若清淨比丘老病乏氣力者，應扶若以繩床、木床、若衣舁還房。",
        "translation": "If the pure monk is elderly and sick and lacks energy, he should be helped to return to his room on a rope bed, a wooden bed, or a load of clothing.",
        "source": "T22n1428_046:0905a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應先入清淨比丘房內敷臥具，若氈手捫摸看，扶清淨比丘臥，以襯體衣著內被覆上。",
        "translation": "He should first go into the pure monk's room, lay out his bedding, feel it with his bare hands, help the pure monk lay down, and put on an inner quilt with a bodysuit.",
        "source": "T22n1428_046:0905a25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若出房應閉戶，至浴室中看，若有繩床、木床、若浴瓶、若刮汗刀、水器、泥器、樹皮、細末藥泥，還復本處。",
        "translation": "If he leaves his room, he should close the door and go into the bathhouse to see if there's a rope bed, a wooden bed, a bathing pot, a sweat scraper, a water vessel, a clay vessel, tree bark, or finely powdered medicinal mud, and return it to its original place.",
        "source": "T22n1428_046:0905a27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應洗浴室便洗，有不淨水應出便出，有火應滅便滅、應覆便覆。",
        "translation": "He'll wash the bathhouse as he needs to wash it, emit impure water as he needs to emit it, and extinguish a fire as it needs to be extinguished or cover it as it needs to be covered.",
        "source": "T22n1428_046:0905b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若浴室戶應閉便閉應脫舉便舉。",
        "translation": "If there's a fire that should be put out, it should be put out, and a fire that should be covered should be covered up. If the bathroom door should be closed, it should be closed, and if it should be taken off, it should be taken up.",
        "source": "T22n1428_046:0905b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應日三時見清淨比丘，彼應作者一切應如法作。",
        "translation": "You should see a pure monk three times a day, and he should do everything according to the teaching that should be done.",
        "source": "T22n1428_046:0905b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若清淨比丘有所作不應違逆，若違逆應如法治。",
        "translation": "If a pure monk does anything, he shouldn't act contrary to it, and if he acts contrary to it, he should rule it according to the rules.",
        "source": "T22n1428_046:0905b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼行覆藏者至布薩日應掃灑布薩處、敷坐具、水瓶、洗脚瓶、然燈、具舍羅。",
        "translation": "\"When he goes about concealing himself, he should sweep his place of prostration, spread out his sitting cloth, prepare a water bottle, wash his feet, and wash the vase, then he should use a lamp and a censer.",
        "source": "T22n1428_046:0905b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者布薩竟應還復床座、水瓶、洗脚瓶、舍羅著本處。」",
        "translation": "When he's finished deploying, he should return the seat, water bottle, footwashing flask, and śāla to their original place.\"",
        "source": "T22n1428_046:0905b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏比丘，在上好房中住，餘客比丘無住處。",
        "translation": "The monk who was practicing obscuration stayed in the best room, but the other guest monks had no place to stay.",
        "source": "T22n1428_046:0905b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「行覆藏比丘，不應在上好房中住，聽在小房中住。」",
        "translation": "The monks said to the Buddha, \"The practicing monk said, 'The practicing monk should not stay in the best room but should stay in the small room.'\"",
        "source": "T22n1428_046:0905b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客比丘來遣行覆藏者出，佛言：「不應遣亦不應去，聽作如是語：『大德！",
        "translation": "When the guest monks came to send the practicing monk out, the Buddha said, \"You shouldn't send him out and you shouldn't leave him, so listen and say, 'Mañjuśrī!",
        "source": "T22n1428_046:0905b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我曹不得二三人共宿。』」",
        "translation": "We mustn't share our lodging with two or three people.'\"",
        "source": "T22n1428_046:0905b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行覆藏比丘作如是念：「眾僧衣物為隨次取、應坐處取耶？」",
        "translation": "The monk Saṃyuktâgama had this thought, \"Should we take the monks' clothing in order or should we take it where we sit?\"",
        "source": "T22n1428_046:0905b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應隨次取已在下行坐。」",
        "translation": "The Buddha said, \"You should take it from there and sit down after walking.\"",
        "source": "T22n1428_046:0905b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏比丘作如是念：「我曹得更互作使不？」",
        "translation": "The practicing monk thought, \"Could I make another messenger for you?\"",
        "source": "T22n1428_046:0905b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽。」",
        "translation": "The Buddha said, \"Listen!\"",
        "source": "T22n1428_046:0905b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我曹得自相恭敬禮拜迎逆執手問訊不？」",
        "translation": "\"May I, Cao, respectfully venerate myself, welcome him, and greet him with my hand?\"",
        "source": "T22n1428_046:0905b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽。」",
        "translation": "The Buddha said, \"Listen!\"",
        "source": "T22n1428_046:0905b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼如是念：「我曹得使僧伽藍人沙彌不？」",
        "translation": "He thus thought, \"Could I ever make the Saṃghârāma śrāmaṇeras?\"",
        "source": "T22n1428_046:0905b18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽。」",
        "translation": "The Buddha said, \"Listen!\"",
        "source": "T22n1428_046:0905b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我曹得受僧伽藍人、沙彌禮拜迎逆執手問訊不？」",
        "translation": "\"May we accept the vows of the Saṃghârāma and śrāmaṇeras to greet them and greet them with their hands?\"",
        "source": "T22n1428_046:0905b19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「得受。」",
        "translation": "The Buddha said, \"It's acceptable.\"",
        "source": "T22n1428_046:0905b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，不白清淨比丘，佛言：「聽白。",
        "translation": "He who practices concealment and doesn't explain it to the pure monks, and the Buddha says, \"Listen and explain it.",
        "source": "T22n1428_046:0905b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是白。",
        "translation": "He should thus explain it.",
        "source": "T22n1428_046:0905b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布薩日彼比丘應至僧中，偏露右肩、脫革屣、右膝著地，作如是白：『大德僧聽！",
        "translation": "On the day of the purification, that monk should go to the saṃgha, bare his right shoulder, take off his leather sandals, touch his right knee to the ground, and make this confession: 'Venerable monks, listen!'",
        "source": "T22n1428_046:0905b22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我某甲比丘犯僧殘罪，隨覆藏日從僧乞覆藏羯磨，僧已與我隨覆藏日羯磨。",
        "translation": "A certain monk of mine committed the offense of crimes against the saṃgha and asked the saṃgha to perform a karman on the day he covered his house, and the saṃgha gave me a karman on the day he covered his house.",
        "source": "T22n1428_046:0905b24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我某甲已行若干日，餘有若干日在。",
        "translation": "For a certain number of days, I've been doing it, and there are a certain number of days left.",
        "source": "T22n1428_046:0905b26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白大德令知我行覆藏。』",
        "translation": "I'll tell the great virtuous one that he'll let him know that I'm practicing covering the store.'",
        "source": "T22n1428_046:0905b27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若大眾難集、若不欲行、若彼人軟弱多有羞愧，應至清淨比丘所白言：『大德上座！",
        "translation": "If it's difficult for the crowd to assemble, if they don't want to do it, or if they're weak and much ashamed, they should go to a pure monk and say, 'Sir, Mañjuśrī!",
        "source": "T22n1428_046:0905b27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今日捨教勅不作。』",
        "translation": "'Today, I won't do it because I've been instructed not to.'",
        "source": "T22n1428_046:0905b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲作時，應至清淨比丘所白言：『我今日隨所教勅當作。』」",
        "translation": "If he wants to do it, he should go to a pure monk and confess, 'Today, I'll do it according to what I've been taught.'\"",
        "source": "T22n1428_046:0905c01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，至餘處見餘比丘不白，佛言：「應白。",
        "translation": "When he went to another place and saw that the other monks didn't confess, the Buddha said, \"You should confess.",
        "source": "T22n1428_046:0905c02_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不白失一夜，得突吉羅。」",
        "translation": "If you don't make a confession, you'll lose one night and get a surpassing death.\"",
        "source": "T22n1428_046:0905c03_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊既聽白，餘比丘便從此至餘處白，從此至餘處疲極。",
        "translation": "After the Bhagavān heard their confessions, the other monks then confessed from here to the other places and became very tired from here to the other places.",
        "source": "T22n1428_046:0905c04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應從此處至餘處白，聽若有因緣往應白，若復不白，失一夜，得突吉羅罪。」",
        "translation": "The Buddha said, \"You shouldn't go from this place to another place and make a confession. Listen, if you have a reason to go there, you should make a confession; if you don't make a confession again, you'll lose one night and incur the offense of being a turgid clapper.\"",
        "source": "T22n1428_046:0905c05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，有客比丘來不白，佛言：「應白，若不白失一夜，得突吉羅罪。」",
        "translation": "When a visiting monk came and didn't make a confession, the Buddha said, \"You should make a confession; if you don't make a confession and lose a night, you'll incur the offense of a grave offense.\"",
        "source": "T22n1428_046:0905c07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊既聽彼白客比丘，便至道路白諸疾行比丘遂疲極，佛言：「不應往道路白疾行比丘，應在僧伽藍內徐行者白。",
        "translation": "After the Bhagavān heard that guest monk confess, he went to the road to confess to the monks who were traveling quickly and became very tired. The Buddha said, \"You shouldn't go to the road to confess to the monks traveling quickly; you should confess to those who are traveling slowly within the Saṃghârāma.",
        "source": "T22n1428_046:0905c09_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不白，失一夜，得突吉羅罪。」",
        "translation": "If you don't do that, you'll lose a night and incur the sin of being a turgid monk.\"",
        "source": "T22n1428_046:0905c12_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，病不遣信白，佛言：「應白。",
        "translation": "When he was sick and didn't send a letter of confession, the Buddha said, \"You should confess.",
        "source": "T22n1428_046:0905c13_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不白，失一夜，得突吉羅罪。」",
        "translation": "If he doesn't confess, he'll lose one night and incur a grave offense.\"",
        "source": "T22n1428_046:0905c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，二、三人共一屋宿，佛言：「不應爾。",
        "translation": "He practices concealment, and when two or three people stay in the same house, the Buddha says, \"That shouldn't be the case.",
        "source": "T22n1428_046:0905c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若二、三人共一屋宿，失一夜，得突吉羅罪。」",
        "translation": "If two or three people stay in the same house and lose one night, it's a grave offense.\"",
        "source": "T22n1428_046:0905c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，在無比丘處住，佛言：「不應爾。",
        "translation": "He who practices concealment and stays at a place where there are no monks, the Buddha says, \"That shouldn't be the case.",
        "source": "T22n1428_046:0905c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若住，失一夜，得突吉羅罪。」",
        "translation": "If he stays there and misses a night, it's a grave offense.\"",
        "source": "T22n1428_046:0905c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者，不半月半月說戒時白，佛言：「聽白。",
        "translation": "That practitioner of concealment who doesn't confess his breach of the precepts for half a month or half a month says, \"Listen to the confession.",
        "source": "T22n1428_046:0905c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不白，失一夜，得突吉羅罪。",
        "translation": "If he doesn't confess, then he'll lose one night and incur a grave offense.",
        "source": "T22n1428_046:0905c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有八事失夜：往餘寺不白、有客比丘來不白、有緣事自出外不白、寺內徐行者不白、病不遣信白、二三人共一屋宿、在無比丘處住、不半月半月說戒時白，是為八事失夜。",
        "translation": "There are eight things that he misses during the night: not making a confession when he goes to another temple, not making a confession when a visiting monk comes, not making a confession when he goes out on business, not making a confession when he goes inside the temple, not making a confession when he's sick and doesn't send a letter, staying in a house with two or three people, staying in a place without a monk, and not making a confession when he teaches the precepts for half a month and a half.",
        "source": "T22n1428_046:0905c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛聽半月半月說戒時白，應如是白。",
        "translation": "When the Buddha hears the announcement of the precepts at the half-moon and half-moon, he should announce it like this.",
        "source": "T22n1428_046:0905c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼行覆藏者應至僧中，偏露右肩、脫革屣、右膝著地，合掌白言：『大德僧聽！",
        "translation": "That practitioner of concealment should go to the saṃgha, bare his right shoulder, remove his leather sandals, place his right knee on the ground, put his palms together, and say, 'Listen, Venerable Monks!'",
        "source": "T22n1428_046:0905c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我某甲比丘犯僧殘罪覆藏。",
        "translation": "\"A certain monk of mine committed the sin of the saṃgha's cruelty and was buried in the monastery.",
        "source": "T22n1428_046:0905c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我某甲比丘隨覆藏日，從僧乞覆藏日羯磨，僧已與我隨覆藏日羯磨。",
        "translation": "Following the day of the concealment, a certain monk asked the saṃgha to perform the karman on the day of the concealment, and the saṃgha gave me the karman on the day of the concealment.",
        "source": "T22n1428_046:0905c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我某甲比丘，已行若干日，未行若干日。",
        "translation": "For a certain number of days I, a certain monk, have practiced and for a certain number of days I haven't.",
        "source": "T22n1428_046:0905c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白大德令知我行覆藏。』」",
        "translation": "I'll ask the great virtuous one to let him know that I'm practicing covering the store.'\"",
        "source": "T22n1428_046:0906a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽行摩那埵比丘亦行如上諸事。",
        "translation": "The Buddha said, \"Listen, a monk who practices manattva also does the things mentioned above.",
        "source": "T22n1428_046:0906a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行摩那埵者，應常在僧中宿日日白。",
        "translation": "A practicing manattva should always stay in the saṃgha and make a daily announcement.",
        "source": "T22n1428_046:0906a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是白，偏露右肩、脫革屣、右膝著地，合掌白：『大德僧聽！",
        "translation": "He should thus make this announcement, bare his right shoulder, remove his leather sandals, put his right knee on the ground, and put his palms together and say, 'Listen, Mañjuśrī!",
        "source": "T22n1428_046:0906a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我某甲比丘犯僧殘罪不覆藏，從僧乞六夜摩那埵，僧已與我六夜摩那埵。",
        "translation": "A certain monk of mine committed the sin of saṃghâvaṇa without covering it up and begged the saṃgha for six nights of maṇḍala, and the saṃgha gave me six nights of maṇḍala afterward.",
        "source": "T22n1428_046:0906a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我某甲比丘，已行若干日，未行若干日。",
        "translation": "I, a certain monk, have practiced for a certain number of days and haven't practiced for a certain number of days.",
        "source": "T22n1428_046:0906a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白諸大德僧，令知我行摩那埵。』」",
        "translation": "He told the great saṃgha that he would let them know that I was practicing manattva.\"",
        "source": "T22n1428_046:0906a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(覆藏揵度具足竟)遮揵度第十四爾時世尊在舍衛國。",
        "translation": "(The completion of the Śākyamuni gandharva) Cakravartī 14. At the time, the Bhagavān was in Śrāvastī.",
        "source": "T22n1428_046:0906a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘作如是念：「世尊無數方便教諸比丘，展轉相教更相受語。」",
        "translation": "Six groups of monks then had this thought, \"The Bhagavān teaches monks in countless ways, repeats what he teaches, and then accepts what he says.\"",
        "source": "T22n1428_046:0906a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便舉清淨無罪比丘。",
        "translation": "They then cited pure and blameless monks.",
        "source": "T22n1428_046:0906a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應舉清淨無罪比丘。」",
        "translation": "The Buddha said, \"You shouldn't have raised that pure and blameless monk.\"",
        "source": "T22n1428_046:0906a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽先求聽。」",
        "translation": "The Buddha said, \"Listen and first seek to hear.\"",
        "source": "T22n1428_046:0906a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘聞佛教先求聽，彼即清淨比丘先從六群比丘求聽者求聽，佛言：「不應爾。",
        "translation": "When the six groups of monks heard that the Buddha first asked them to listen, that is, the pure monk first asked the six groups of monks to listen to him, and the Buddha said, \"That shouldn't be the case.",
        "source": "T22n1428_046:0906a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今已去聽內有五法應求聽：知時不以非時、真實不以不實、利益不以損減、柔軟不以麁獷、慈心不以瞋恚。」",
        "translation": "From now on, there are five things within listening that you should seek to hear: knowing the right time and not the wrong time, being true and not untrue, benefiting and not diminishing, being gentle and not harsh, and being compassionate and not angry.\"",
        "source": "T22n1428_046:0906a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘內無五法，餘比丘內有五法，從六群比丘求聽而不與聽。",
        "translation": "At the time, there were five things that the monks in the six groups of monks didn't have inside, and five things that the other monks had inside, which they sought to hear from the monks in the six groups but didn't give them to them.",
        "source": "T22n1428_046:0906a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「若內有五法求聽者應與。」",
        "translation": "The monks said to the Buddha, \"The Buddha said, 'If there are five things inside you that you want to hear, you should give them to him.'\"",
        "source": "T22n1428_046:0906a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘，他求聽便去、許他聽已亦去，佛言：「不應爾，聽作自言。」",
        "translation": "When six groups of monks asked others to listen and then left, or allowed others to listen and then left, the Buddha said, \"That's not right; listen and tell them yourself.\"",
        "source": "T22n1428_046:0906a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘，許他求自言已便去、自作自言已復去，佛言：「不應爾。」",
        "translation": "When six groups of monks asked others to speak for themselves and then departed, and they also departed after speaking for themselves, the Buddha said, \"That shouldn't be the case.\"",
        "source": "T22n1428_046:0906a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽布薩說戒時應遮說戒。」",
        "translation": "The Buddha said, \"When you hear a poṣad preach the precepts, you should refrain from preaching them.\"",
        "source": "T22n1428_046:0906a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘，聞佛聽遮說戒，便遮清淨比丘說戒，佛言：「不應爾。」",
        "translation": "When six groups of monks heard that the Buddha had heard him preach the precepts, they preached the precepts to pure monks, and the Buddha said, \"You shouldn't.\"",
        "source": "T22n1428_046:0906a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「汝曹善聽！",
        "translation": "The Buddha said, \"Listen well, you lot!",
        "source": "T22n1428_046:0906a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如法遮說戒，有不如法遮說戒：一非法一如法、二非法二如法、三非法三如法、四非法四如法、五非法五如法、六非法六如法、七非法七如法、八非法八如法、九非法九如法、十非法十如法。",
        "translation": "There are precepts that preach according to the teaching and precepts that don't preach according to the teaching: precepts that are unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, unlawful as the teaching, and unlawful as the teaching.",
        "source": "T22n1428_046:0906a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等一非法？",
        "translation": "What's one unlawful thing?",
        "source": "T22n1428_046:0906b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若遮無根作，是為一非法。",
        "translation": "If someone refuses to do something without faculties, this is considered the same non-dharma.",
        "source": "T22n1428_046:0906b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等一如法？",
        "translation": "What is this same dharma?",
        "source": "T22n1428_046:0906b03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根作，是為一如法。",
        "translation": "This is the same dharma that obscures the activity of the sense faculties.",
        "source": "T22n1428_046:0906b03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等二非法？",
        "translation": "What are the two non-dharmas?",
        "source": "T22n1428_046:0906b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根作、不作，是為二非法。",
        "translation": "To refrain from doing or not doing something without faculties is two non-dharmas.",
        "source": "T22n1428_046:0906b04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等二如法？",
        "translation": "What are the two as-it-is dharmas?",
        "source": "T22n1428_046:0906b05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根作、不作，是為二如法。",
        "translation": "Blocking the sense faculties that do and don't do something is two ways of being like the Dharma.",
        "source": "T22n1428_046:0906b05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三非法？",
        "translation": "What are the three that are not according to the Dharma?",
        "source": "T22n1428_046:0906b06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根破戒、破見、破威儀，是為三非法。",
        "translation": "Refuting the lack of faculties and violating precepts, views, and manner are the three unlawful things.",
        "source": "T22n1428_046:0906b06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三如法？",
        "translation": "What are the three as-it-is dharmas?",
        "source": "T22n1428_046:0906b07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根破戒、破見、破威儀，是為三如法。",
        "translation": "Refraining from having faculties that violate the precepts, violate views, and violate decorum are the three as-it-is dharmas.",
        "source": "T22n1428_046:0906b07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等四非法？",
        "translation": "What are the four that are not according to the Dharma?",
        "source": "T22n1428_046:0906b08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根破戒、破見、破威儀、無根邪命，是為四非法。",
        "translation": "Blocking rootless violations of precepts, views, mannerisms, and rootless wrong livelihood are the four non-dharmas.",
        "source": "T22n1428_046:0906b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等四如法？",
        "translation": "What are the four as-it-is dharmas?",
        "source": "T22n1428_046:0906b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根破戒、破見、破威儀、有根邪命，是為四如法。",
        "translation": "Blocking the violation of precepts by those with senses, the violation of views, the violation of propriety, and the wrong livelihood by those with senses are the four as-it-is dharmas.",
        "source": "T22n1428_046:0906b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五非法？",
        "translation": "What are the five unlawful ones?",
        "source": "T22n1428_046:0906b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根波羅夷、僧殘、波逸提、波羅提提舍尼、遮無根突吉羅，是為五非法。",
        "translation": "These are the five non-dharmas that obstruct the rootless pārājika, the saṃghâvaṇa, the prāyattika, the prātideśanika, and the rootless duṣkṛta.",
        "source": "T22n1428_046:0906b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五如法？",
        "translation": "What are the five as-it-is dharmas?",
        "source": "T22n1428_046:0906b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根波羅夷、僧殘、波逸提、波羅提提舍尼、遮有根突吉羅，是為五如法。",
        "translation": "Blocking the existence of faculties like pārājika, saṃghâvaṇa, prāyattika, pratideśanika, and duṣkṛta with faculties is called the five as-it-is dharmas.",
        "source": "T22n1428_046:0906b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等六非法？",
        "translation": "What are the six non-dharmas?",
        "source": "T22n1428_046:0906b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根破戒作、不作，破見作、不作，破威儀作、不作，是為六非法。",
        "translation": "To refrain from doing or not doing anything that violates the precepts without faculties, from doing or not doing anything that violates views, and from doing or not doing anything that violates regulations are the six unlawful things.",
        "source": "T22n1428_046:0906b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等六如法？",
        "translation": "What are the six as-it-is dharmas?",
        "source": "T22n1428_046:0906b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根破戒作、不作，破見作、不作，破威儀作、不作，是為六如法。",
        "translation": "Blocking the sense faculties that violate the precepts by doing or not doing something, violate the views by doing or not doing something, and violate the manner by doing or not doing something are the six as-it-is dharmas.",
        "source": "T22n1428_046:0906b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等七非法？",
        "translation": "What are the seven unlawful ones?",
        "source": "T22n1428_046:0906b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根波羅夷、僧殘、波逸提、波羅提提舍尼、偷蘭遮、突吉羅、惡說，是為七非法。",
        "translation": "Blocking the rootless pārājika, saṃghâvaṇa, prāyattika, pratideśanika, purāṇa, duṣkṛta, and harsh speech are seven things that are not true.",
        "source": "T22n1428_046:0906b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等七如法？",
        "translation": "What are the seven true dharmas?",
        "source": "T22n1428_046:0906b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根波羅夷、僧殘、波逸提、波羅提提舍尼、偷蘭遮、突吉羅、惡說，是為七如法。",
        "translation": "Blocking the faculties of pārājika, saṃghâvaṇa, prāyattika, pratideśanika, purāṇa, duṣkṛta, and mischievous talk are seven such things.",
        "source": "T22n1428_046:0906b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等八非法？",
        "translation": "What are the eight that are not according to the Dharma?",
        "source": "T22n1428_046:0906b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根破戒作、不作，破見、破威儀，無根邪命作、不作，是為八非法。",
        "translation": "Blocking the lack of faculties to act or refrain from acting contrary to the precepts, to act contrary to views, to act contrary to manner, and to act or refrain from acting in a wrong life without faculties are the eight unlawful things.",
        "source": "T22n1428_046:0906b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等八如法？",
        "translation": "What are the eight as-it-is dharmas?",
        "source": "T22n1428_046:0906b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根破戒作、不作，破見、破威儀，有根邪命，是為八如法。",
        "translation": "Blocking actions and omissions by those with senses that violate the precepts, views, and decorum, and those with senses that lead to wrong livelihood are the eight as-it-is dharmas.",
        "source": "T22n1428_046:0906b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等九非法？",
        "translation": "What are the nine unlawful ones?",
        "source": "T22n1428_046:0906b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮無根破戒若作、若不作、若作不作；破見若作、若不作、若作不作；破威儀若作、若不作、若作不作，是為九非法。",
        "translation": "To refrain from violating the precepts without faculties if you do, don't do, or do not do them, to violate views if you do, don't do, or do not do them, and to violate the rules of conduct if you do, don't do, or do not do them are the nine unlawful things.",
        "source": "T22n1428_046:0906b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等九如法？",
        "translation": "What are the nine as-it-is dharmas?",
        "source": "T22n1428_046:0906b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮有根破戒若作、若不作、若作不作；破見、破威儀若作、若不作、若作不作，是為九如法。",
        "translation": "If someone refuses to observe the precepts, does not observe them, or does not observe them, and if they violate views and mannerisms, they do, don't do, or do not observe them, these are the nine ways of doing things.",
        "source": "T22n1428_046:0906b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十非法？",
        "translation": "What are the ten unlawful ones?",
        "source": "T22n1428_046:0906c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非波羅夷不入波羅夷說中，非捨戒不入捨戒說中，隨如法僧要，隨如法僧要不違逆，如法僧要不入違逆說中。",
        "translation": "He doesn't enter into the explanation of pārājika unless it's pārājika, doesn't enter into the explanation of renouncing the precepts unless it's renouncing the precepts, follows the teaching of the principles of the saṃgha according to the teaching, doesn't violate the principles of the saṃgha according to the teaching, and doesn't enter into the teaching of the principles of the saṃgha according to the teaching of the teaching of the principles of the saṃgha according to the teaching of the teaching of the teaching of the principles of the saṃgha.",
        "source": "T22n1428_046:0906c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破戒不見、不聞、不疑，破見、破威儀不見、不聞、不疑，是為十非法。",
        "translation": "To violate the precepts by not seeing, not hearing, and not doubting, and to violate views and manner by not seeing, not hearing, and not doubting are the ten unlawful things.",
        "source": "T22n1428_046:0906c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十如法？",
        "translation": "What are the ten rules of according with the Dharma?",
        "source": "T22n1428_046:0906c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波羅夷入波羅夷說中，捨戒入捨戒說中，如法僧要、如法僧要違犯、如法僧要呵說，入如法僧要呵說中，破戒見聞疑，破見破威儀見聞疑，是為十如法。",
        "translation": "Entering into the explanation of the paranirmita-vaśavartin, renouncing the precepts and entering into the explanation of renouncing the precepts, violating the saṃgha rules according to the teaching, violating the saṃgha rules according to the teaching, reprimanding the saṃgha rules according to the teaching, entering into the reprimanding of the saṃgha rules according to the teaching, violating the precepts and seeing and hearing doubts, and violating the views and regulations and seeing and hearing doubts are the ten paranirmita-vocations.",
        "source": "T22n1428_046:0906c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何犯波羅夷如因緣相貌犯波羅夷？",
        "translation": "How does violating a precept like the appearance of a cause and condition violate a precept?",
        "source": "T22n1428_046:0906c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘見此相貌知犯波羅夷，若不見此比丘犯波羅夷，聞彼比丘犯波羅夷。",
        "translation": "\"A monk who sees this appearance knows that he's violating the precepts, but if he doesn't see that monk violating the precepts, he hears that monk violating the precepts.",
        "source": "T22n1428_046:0906c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘若欲以此見聞疑，於彼比丘前，布薩時從坐起，偏露右肩、右膝著地，合掌作如是言：『此某甲比丘犯波羅夷，眾僧不應在此比丘前說戒。",
        "translation": "If a monk wants to doubt this view and hear it, he gets up from his seat in front of that monk when he's preaching, partially exposes his right shoulder and puts his right knee on the ground, joins his palms together, and says, 'This certain monk has violated the paranirmita-vaśavartin, and the saṃgha shouldn't preach the precepts in front of this monk.",
        "source": "T22n1428_046:0906c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今遮此比丘說戒。』",
        "translation": "Now, I'm going to preclude this monk from teaching the precepts.'",
        "source": "T22n1428_046:0906c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮說戒。",
        "translation": "This accomplishes the task of refraining from expounding the precepts.",
        "source": "T22n1428_046:0906c17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮說戒時，眾僧八難事，一一難事起：王難、賊難、火難、水難、病難、人難、非人難、惡蟲難。",
        "translation": "When the precept was precluded, eight difficult situations arose for the saṃgha, one of which was a difficult situation: a difficult situation for the king, a difficult situation for thieves, a difficult situation for fire, a difficult situation for water, a difficult situation for illness, a difficult situation for humans, a difficult situation for non-humans, and a difficult situation for harsh insects.",
        "source": "T22n1428_046:0906c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此比丘若欲以此見聞疑此住處、彼住處說戒時，於彼比丘前，從坐起，偏露右肩、右膝著地，合掌作如是言：『某甲比丘入波羅夷說中，此事未決定，今應決定，不應在此比丘前說戒。",
        "translation": "If that monk wants to discuss the precepts in this or that dwelling place because of what he's seen and heard and doubts, he rises from his seat in front of that monk, bares his right shoulder and puts his right knee on the ground, joins his palms together, and says, 'A certain monk has entered into the Bālāṣa teachings, and this matter has yet to be decided; now, it should be decided that he shouldn't discuss the precepts in front of this monk.",
        "source": "T22n1428_046:0906c19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今遮此比丘說戒。』",
        "translation": "Now, I'm going to stop this monk from teaching the precepts.'",
        "source": "T22n1428_046:0906c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮說戒。",
        "translation": "He accomplished the overruling of the exposition of the precepts.",
        "source": "T22n1428_046:0906c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何捨戒如因緣相貌？",
        "translation": "\"What is the appearance of the renunciation of the precepts as a condition?",
        "source": "T22n1428_046:0906c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知是捨戒比丘，見是相貌知此比丘捨戒。",
        "translation": "\"He knows that this is a monk who renounces the precepts, and he sees this appearance and knows that this monk renounces the precepts.",
        "source": "T22n1428_046:0906c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不見此比丘捨戒，聞彼某甲比丘捨戒。",
        "translation": "If he doesn't see this monk renouncing the precepts, he'll hear that some monk renounced the precepts.",
        "source": "T22n1428_046:0906c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘若欲以此見聞疑於布薩時，在比丘前偏露右肩、右膝著地，合掌作如是言：『某甲比丘捨戒，不應在此比丘前說戒。",
        "translation": "If a monk who wants to doubt a priest because of what he's seen and heard, he should bare his right shoulder and touch his right knee to the ground in front of the monk, put his palms together, and say, 'That certain monk renounced the precepts, so he shouldn't have taught the precepts in front of that monk.",
        "source": "T22n1428_046:0906c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今遮此比丘說戒。』",
        "translation": "Now, I'll stop this monk from teaching the precepts.'",
        "source": "T22n1428_046:0906c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮。",
        "translation": "He accomplished the overruling.",
        "source": "T22n1428_046:0907a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮說戒時有八難事起：王難乃至惡蟲難。",
        "translation": "When he refuses to preach the precepts, eight difficult things arise: difficulties for the king and even difficulties for harsh insects.",
        "source": "T22n1428_046:0907a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘若欲以此見聞疑布薩時此住處、彼住處，在彼比丘前從坐起，偏露右肩、右膝著地，合掌作如是言：『某甲比丘入捨戒說中，此事未決定，今應決定此事，不應在此比丘前說戒。",
        "translation": "If that monk wants to see and hear this doubtful poṣad, he gets up from his seat in front of that monk, bares his right shoulder and puts his right knee on the ground, joins his palms together, and says, 'A certain monk has yet to decide this matter when he enters into the precepts discourse, so now he should decide this matter and not preach the precepts in front of this monk.",
        "source": "T22n1428_046:0907a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今遮此比丘說戒。』",
        "translation": "Now, I'm blocking this monk from teaching the precepts.'",
        "source": "T22n1428_046:0907a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮。",
        "translation": "He accomplished the overruling.",
        "source": "T22n1428_046:0907a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何如法僧要不隨如因緣相貌？",
        "translation": "\"How do the requirements of a Dharma-abiding monk not follow the appearance of causes and conditions?",
        "source": "T22n1428_046:0907a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如法僧要不隨比丘，見此相貌知此比丘如法僧要不隨。",
        "translation": "\"Suppose he sees this monk's features and knows that he thus conducts himself according to the teachings and doesn't follow the saṃgha's wants.",
        "source": "T22n1428_046:0907a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不見此比丘如法僧要不隨，聞彼某甲比丘如法僧要不隨。",
        "translation": "If he doesn't see this monk who according to the teaching is wanted by the saṃgha and doesn't follow it, then he hears that some monk according to the teaching is wanted by the saṃgha and doesn't follow it.",
        "source": "T22n1428_046:0907a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘若欲以此見聞疑布薩時，在此比丘前偏露右肩、右膝著地，合掌作如是言：『某甲比丘如法僧要不隨，不應在此比丘前說戒，我今遮此比丘說戒。』",
        "translation": "If a monk who wants to see and hear this doubts the poṣad, he should bare his right shoulder and touch his right knee to the ground in front of that monk, put his palms together, and say, 'That certain monk who according to the teaching does not follow the saṃgha's essentials shouldn't have taught the precepts in front of that monk, and now I'm going to block that monk from teaching the precepts.'",
        "source": "T22n1428_046:0907a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮。",
        "translation": "He accomplished the refutation.",
        "source": "T22n1428_046:0907a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何如法僧要違逆如因緣相貌？",
        "translation": "\"How does such a monk violate the requirements of the Dharma and violate the appearance of such a cause and condition?",
        "source": "T22n1428_046:0907a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如法僧要違逆比丘，見此相貌知此比丘如法僧要違逆。",
        "translation": "\"A monk who violates the tenets of the saṃgha according to the teaching knows that this monk violates the tenets of the saṃgha according to the teaching when he sees this appearance.",
        "source": "T22n1428_046:0907a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不見此比丘如法僧要違逆，聞彼某甲比丘如法僧要違逆。",
        "translation": "If he doesn't see this monk as a violation of the tenets of the saṃgha, then he hears that some monk is a violation of the tenets of the saṃgha as a matter of law.",
        "source": "T22n1428_046:0907a17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘若欲以此見聞疑布薩時，在彼比丘前從坐起，偏露右肩、右膝著地，合掌作如是言：『某甲比丘如法僧要違逆，不應在此比丘前說戒。",
        "translation": "When a monk wants to see and hear this doubtful poṣad, he rises from his seat in front of that monk, bares his right shoulder and puts his right knee on the ground, joins his palms together, and says, 'That certain monk's norms are contrary to the saṃgha's wishes, so he shouldn't preach the precepts in front of that monk.",
        "source": "T22n1428_046:0907a18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今遮此比丘說戒。』",
        "translation": "Now, I'll stop this monk from teaching the precepts.'",
        "source": "T22n1428_046:0907a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮。",
        "translation": "He became a preceptor.",
        "source": "T22n1428_046:0907a22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮說戒時，八難事中有一一事起，從王難乃至惡蟲難。",
        "translation": "When he preaches the precepts, one of the eight difficult things arises, from the king's difficulty to the misfortune of the worms.",
        "source": "T22n1428_046:0907a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘若欲以此見聞疑此住處、彼住處布薩時，在此比丘前從坐起，偏露右肩、右膝著地，合掌作如是言：『某甲比丘入如法僧要違逆說中，此事未決定，今應決定，不應在此比丘前說戒。",
        "translation": "If that monk wants to doubt this or that abode's precepts based on what he's seen and heard, he rises from his seat in front of that monk, bares his right shoulder and puts his right knee on the ground, joins his palms, and says, 'A certain monk entered the order of the true saṃgha and spoke contrary to it, but this matter has yet to be decided, and now it should be decided that he shouldn't preach the precepts in front of this monk.",
        "source": "T22n1428_046:0907a23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今遮此比丘說戒。』",
        "translation": "Now, I'll stop this monk from teaching the precepts.'",
        "source": "T22n1428_046:0907a28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮。",
        "translation": "He accomplished the overruling.",
        "source": "T22n1428_046:0907a28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何破戒如因緣相貌？",
        "translation": "\"What is the appearance of a breach of the precepts as a cause and condition?",
        "source": "T22n1428_046:0907a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是破戒比丘，見此相貌知彼比丘破戒。",
        "translation": "\"This is a monk who breaks the precepts and sees this appearance and knows that that monk has broken the precepts.",
        "source": "T22n1428_046:0907a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不見此比丘破戒，聞彼某甲比丘破戒。",
        "translation": "If he doesn't see that monk breaking the precepts, then he hears that some monk has broken the precepts.",
        "source": "T22n1428_046:0907b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此比丘若欲以此見聞疑布薩時，在此比丘前偏露右肩、右膝著地，合掌作如是言：『某甲比丘破戒，不應在此比丘前說戒。",
        "translation": "If that monk wants to see and hear this doubtful poṣad, he puts his right shoulder out in front of that monk, puts his right knee on the ground, puts his palms together, and says, 'That certain monk has broken the precepts, so he shouldn't preach the precepts in front of that monk.",
        "source": "T22n1428_046:0907b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今遮此比丘說戒。』",
        "translation": "Now, I'll stop this monk from teaching the precepts.'",
        "source": "T22n1428_046:0907b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成遮。",
        "translation": "He accomplished the overruling.",
        "source": "T22n1428_046:0907b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破見、破威儀亦如是，是為十如法。",
        "translation": "So too are the ten rituals of breaking views and disrespecting comportment.",
        "source": "T22n1428_046:0907b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若比丘欲舉他者，內有五法應舉他。",
        "translation": "\"If a monk wants to raise others, there are five things he should do internally to raise others.",
        "source": "T22n1428_046:0907b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T22n1428_046:0907b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以時不以非時、真實不以不實、有益不以損減、柔軟不以麁獷、慈心不以瞋恚。",
        "translation": "He takes what's timely and not timely, what's true and not untrue, what's helpful and not detrimental, what's gentle and not crude, and what's kind and not hateful.",
        "source": "T22n1428_046:0907b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘有此五法應得舉他。",
        "translation": "A monk who has these five qualities should be able to lift others up.",
        "source": "T22n1428_046:0907b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T22n1428_046:0907b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見比丘舉他，以非時不以時、不實不以實、或以損減不以利益、或以麁獷不以柔軟、或以瞋恚不以慈心，彼餘比丘應語此比丘言：『舉汝！",
        "translation": "When I see a monk lifting another monk up, whether at an inopportune time or not, insubstantially or not, with loss or gain, harshly instead of softly, or with anger instead of kindness, the other monks should say to that monk, 'Lift you up!",
        "source": "T22n1428_046:0907b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非時不以時，莫起瞋恨。",
        "translation": "'Don't become angry when it's not the right time and don't take it as the right time.",
        "source": "T22n1428_046:0907b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不真實不以實，以損減不以利益，以麁獷不以柔軟，以瞋恚不以慈心，莫以此語瞋恚。』",
        "translation": "Because it's untrue and not true, because it's loss and not benefit, because it's crude and not gentle, and because it's hateful and not compassionate, don't become hateful with these words.'",
        "source": "T22n1428_046:0907b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘被他不實舉者，應以此五事解喻：『舉汝！",
        "translation": "If a monk is untruthfully lifted up by another, he should interpret the parable in these five ways: 'Lift you up!'",
        "source": "T22n1428_046:0907b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非時、不真實、損減、麁獷、瞋恚，莫以是愁憂。』",
        "translation": "Being untimely, untrue, diminishing, crude, and angerful, don't let that cause you grief.'",
        "source": "T22n1428_046:0907b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "被不實舉者，應以此五事解喻。",
        "translation": "A person who's been untruthfully held up should interpret the parable in these five ways.",
        "source": "T22n1428_046:0907b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼不實舉他者，應與五事呵責：『汝舉他，非時不以時、以不實不以實、以損減不以利益、以麁獷不以柔軟、以瞋恚不以慈心，可慚愧！』",
        "translation": "He who untruthfully lifts up another should be rebuked for five things: 'Shame on you for lifting him up, not at the right time but not in time, untruthfully but not in truth, for decrease but not for benefit, for harshness but not for gentleness, and for anger but not for kindness!'",
        "source": "T22n1428_046:0907b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不實舉他者應以此五事呵責。",
        "translation": "Someone who untruthfully cites others should be rebuked for these five things.",
        "source": "T22n1428_046:0907b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T22n1428_046:0907b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令後不復以不實舉清淨比丘，呵責已應如法治。",
        "translation": "It's necessary to prevent a pure monk from being held up again in an untrue way, and after rebuking him, he should follow the rules.",
        "source": "T22n1428_046:0907b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「被真實舉比丘，應以五事呵責：『舉汝得時不以非時，莫生瞋恨，真實不以不實、利益不以損減、柔軟不以麁獷、慈心不以瞋恚，莫生瞋恨！』",
        "translation": "\"A monk who is truly and truly reprimanded should be rebuked for five things: 'Don't become angry when you're reprimanded for gaining a moment and not for failing to gain a moment; don't become angry when it's true and not for lacking a true moment; don't be benefited and not diminished; don't be gentle and not harsh; and don't become angry when you're compassionate and not angry!'",
        "source": "T22n1428_046:0907b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "被真實舉比丘，應以此五事呵責，呵責已如法治。",
        "translation": "A monk who is truly reprimanded should be rebuked for these five things, and after he's rebuked, he should follow the rules.",
        "source": "T22n1428_046:0907b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼真實舉他者，應以五事讚美：『舉他，得時不以非時，莫生悔恨！",
        "translation": "\"He who truly lifts others up should praise them for five things: 'Lift them up, don't criticize them when you get it, and don't become remorseful!'",
        "source": "T22n1428_046:0907c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真實不以不實、利益不以損減、柔軟不以麁獷、慈心不以瞋恚，莫生悔恨！』",
        "translation": "Do not become remorseful when it's true and not untrue, when it's beneficial and not detrimental, when it's gentle and not crude, and when it's compassionate and not angry!'",
        "source": "T22n1428_046:0907c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真實舉他者，應以此五事讚美。",
        "translation": "Those who truly lift up others should praise them for these five things.",
        "source": "T22n1428_046:0907c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T22n1428_046:0907c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後若復舉他者，當以真實舉。",
        "translation": "If he later again raises another, he must raise them in truth.",
        "source": "T22n1428_046:0907c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「遮說戒比丘，至上座前作如是語：『我欲遮某甲比丘說戒，願見聽。』",
        "translation": "\"Suppressing a monk who teaches the precepts, the monk goes up to the throne and says this, 'I want to suppress a certain monk from teaching the precepts, and I'd like to see and hear him.'",
        "source": "T22n1428_046:0907c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上座應問：『汝內有五法不？』",
        "translation": "The monk should ask, 'Do you have the five rules in you?'",
        "source": "T22n1428_046:0907c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『無。』",
        "translation": "If he says, 'None.'",
        "source": "T22n1428_046:0907c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教令莫遮。",
        "translation": "teach them not to refute it.'",
        "source": "T22n1428_046:0907c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『有。』",
        "translation": "If you say, 'Yes.'",
        "source": "T22n1428_046:0907c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當問何等五？",
        "translation": "what are the five questions you should ask?'",
        "source": "T22n1428_046:0907c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不能說，應語令莫遮。",
        "translation": "If you can't explain it, you should say something that makes it impossible to stop.",
        "source": "T22n1428_046:0907c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能說，應問言：『汝已問中座未？』",
        "translation": "If you can speak, you should ask, 'Have you asked about the middle seat yet?'",
        "source": "T22n1428_046:0907c10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『未問。』",
        "translation": "If he says, 'I haven't asked yet,'",
        "source": "T22n1428_046:0907c10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教令問。",
        "translation": "you should instruct him to ask.'",
        "source": "T22n1428_046:0907c11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼應至中座比丘前語言：『我欲遮某甲比丘說戒，願長老聽。』",
        "translation": "He should go to the middle monk and say, 'I want to stop a certain monk from teaching the precepts, so may the elder listen.'",
        "source": "T22n1428_046:0907c11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中座應問：『汝內有五法不？』",
        "translation": "The middle seat monk should ask, 'Do you have five things in you?'",
        "source": "T22n1428_046:0907c12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『無。』",
        "translation": "If he says, 'No.'",
        "source": "T22n1428_046:0907c13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應語令莫遮。",
        "translation": "you should say, 'Don't cover it up.'",
        "source": "T22n1428_046:0907c13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『有。』",
        "translation": "If you say, 'Yes.'",
        "source": "T22n1428_046:0907c13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『何等五？』",
        "translation": "you should ask, 'What are the five?'",
        "source": "T22n1428_046:0907c14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不能說，應語令莫遮。",
        "translation": "If you can't explain it, you should say something that makes it impossible to stop.",
        "source": "T22n1428_046:0907c14_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能說，應問言：『汝已問上座未？』",
        "translation": "If you can speak, you should ask, 'Have you asked the superior seat yet?'",
        "source": "T22n1428_046:0907c15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『未。』",
        "translation": "If he says, 'No.'",
        "source": "T22n1428_046:0907c15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應語令問。",
        "translation": "you should say, 'Yes,' and cause him to ask.",
        "source": "T22n1428_046:0907c16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『已問。』",
        "translation": "If you say, 'I've asked.'",
        "source": "T22n1428_046:0907c16_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『汝復問下座未？』",
        "translation": "you should ask, 'Have you asked the next seat yet?'",
        "source": "T22n1428_046:0907c16_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『未。』",
        "translation": "If he says, 'Not yet.'",
        "source": "T22n1428_046:0907c17_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教令問。",
        "translation": "you should instruct him to ask.'",
        "source": "T22n1428_046:0907c17_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼應至下座比丘前作如是言：『我遮某甲比丘說戒，願見聽。』",
        "translation": "He should go to the monk in the lower seat and say, 'I've asked a certain monk to preach the precepts, and I'd like to see and hear him.'",
        "source": "T22n1428_046:0907c17_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼應問：『汝內有五法不？』",
        "translation": "He should ask, 'Are there five things in you?'",
        "source": "T22n1428_046:0907c19_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『無。』",
        "translation": "If he says, 'No.'",
        "source": "T22n1428_046:0907c19_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應語令莫遮。",
        "translation": "you should say, 'Don't cover it up.'",
        "source": "T22n1428_046:0907c19_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『有。』",
        "translation": "If you say, 'Yes.'",
        "source": "T22n1428_046:0907c20_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『何等五？』",
        "translation": "you should ask, 'What are the five?'",
        "source": "T22n1428_046:0907c20_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不能說，應教令莫遮。",
        "translation": "If you can't explain it, you should teach him not to refute it.",
        "source": "T22n1428_046:0907c20_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能說，應問言：『汝問上座未？』",
        "translation": "If you can speak, you should ask, 'Have you asked the superior seat yet?'",
        "source": "T22n1428_046:0907c21_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『未。』",
        "translation": "If he says, 'Not yet.'",
        "source": "T22n1428_046:0907c22_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教令問。",
        "translation": "you should teach them to ask.'",
        "source": "T22n1428_046:0907c22_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『已問。』",
        "translation": "If you say, 'I've asked.'",
        "source": "T22n1428_046:0907c22_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『汝問中座未？』",
        "translation": "you should ask, 'Have you asked about the middle seat yet?'",
        "source": "T22n1428_046:0907c22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『未。』",
        "translation": "If he says, 'Not yet.'",
        "source": "T22n1428_046:0907c23_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教令問。",
        "translation": "you should teach them to ask.'",
        "source": "T22n1428_046:0907c23_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『已問。』",
        "translation": "If you say, 'I've asked.'",
        "source": "T22n1428_046:0907c23_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問：『汝已問彼比丘未？』",
        "translation": "you should ask, 'Have you asked that monk yet?'",
        "source": "T22n1428_046:0907c24_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『未問。』",
        "translation": "If he says, 'I haven't asked yet,'",
        "source": "T22n1428_046:0907c24_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教令問。",
        "translation": "you should teach him to ask.'",
        "source": "T22n1428_046:0907c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此比丘應往彼比丘所語言：『我欲遮長老說戒，願見聽。』",
        "translation": "That monk should go to that monk and say, 'I'd like to ask the elder to preach the precepts, and I'd like to see and hear him.'",
        "source": "T22n1428_046:0907c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼應問言：『汝內有五法不？』",
        "translation": "He should ask, 'Do you have five things in you?'",
        "source": "T22n1428_046:0907c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『無。』",
        "translation": "If he says, 'No.'",
        "source": "T22n1428_046:0907c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教令莫遮。",
        "translation": "you should teach him not to refute it.'",
        "source": "T22n1428_046:0907c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『有。』",
        "translation": "If you say, 'Yes.'",
        "source": "T22n1428_046:0907c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『何等五？』",
        "translation": "you should ask, 'What are the five?'",
        "source": "T22n1428_046:0907c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不能說，應教令莫遮。",
        "translation": "If you can't explain it, you should teach him not to refute it.",
        "source": "T22n1428_046:0907c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能說，應問言：『汝問上座未？』",
        "translation": "If you can speak, you should ask, 'Have you asked the superior seat yet?'",
        "source": "T22n1428_046:0907c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未問，應教令問；中下座亦如是。",
        "translation": "If he hasn't asked, he should teach him to ask; so it is with the middle and lower seats.",
        "source": "T22n1428_046:0907c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘應自觀察，我此事得比丘伴不？",
        "translation": "That monk should examine for himself, \"Do I have a monk's companion in this matter?",
        "source": "T22n1428_046:0908a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不得伴，應語彼比丘言：『莫遮。』",
        "translation": "If he doesn't have a companion, he should say to that monk, 'Don't obstruct him.'",
        "source": "T22n1428_046:0908a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得比丘伴，應語言：『便可隨時。』」",
        "translation": "If he obtains a monk's companionship, he should say, 'At any time.'\"",
        "source": "T22n1428_046:0908a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有異住處，布薩時有比丘犯僧殘，作如是念：「我當云何？」",
        "translation": "At the time, there was a monk in a different dwelling who violated the saṃgha's rules while he was preaching and thought, 'What will I do?'\"",
        "source": "T22n1428_046:0908a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即白諸比丘。",
        "translation": "He then said to the monks.",
        "source": "T22n1428_046:0908a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「若有異住處，有比丘犯僧殘罪，眾僧應與波利婆沙與波利婆沙，應與本日治便與，應與摩那埵便與，應與出罪便與出罪。」",
        "translation": "The monks said to the Buddha, \"The Buddha said, 'If there are monks in different dwelling places who commit crimes against the saṃgha, the saṃgha should give parivāsa and parivāsa, give this day's correction as it should be given, give manattva as it should be given, and give out the crime as it should be done.'",
        "source": "T22n1428_046:0908a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有異住處，有比丘犯波逸提。",
        "translation": "It was then that there was a monk in a different dwelling who committed a pāyatti.",
        "source": "T22n1428_046:0908a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘，或言犯波逸提，或言犯波羅提提舍尼。",
        "translation": "Some of those monks say they've violated prāyatti or say they've violated pratideśanīya.",
        "source": "T22n1428_046:0908a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘作是念：「我當云何？」",
        "translation": "That monk thinks, \"What shall I do?\"",
        "source": "T22n1428_046:0908a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白諸比丘。",
        "translation": "He told the monks.",
        "source": "T22n1428_046:0908a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「若有異住處比丘犯波逸提。",
        "translation": "The monks said to the Buddha, \"The Buddha said, 'Suppose a monk who lives in a different place commits a pāyattika.",
        "source": "T22n1428_046:0908a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或言犯波逸提，或言犯波羅提提舍尼。",
        "translation": "He might say that he's violating prāyatti or he might say that he's violating prātideśanika.",
        "source": "T22n1428_046:0908a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有見犯波逸提比丘者，將彼比丘至眼見不聞處，教如法懺悔。",
        "translation": "If one of those monks sees a monk who violates pratide, he takes that monk to a place where he sees and doesn't hear, and he teaches him to repent according to the teaching.",
        "source": "T22n1428_046:0908a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懺悔已，至彼比丘所語言：『此比丘已如法懺悔。』",
        "translation": "After confessing, he goes to that monk and says, 'This monk has confessed according to the teaching.'",
        "source": "T22n1428_046:0908a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是已說戒。」",
        "translation": "You should have said the precepts after doing so.\"",
        "source": "T22n1428_046:0908a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有異住處，有比丘犯偷蘭遮。",
        "translation": "There was then a monk in a different dwelling who violated the precepts for stealing lanzas.",
        "source": "T22n1428_046:0908a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中比丘，或言犯偷蘭遮，或言犯波羅夷。",
        "translation": "Some of these monks say they've violated the precepts by stealing lanterns, and some say they've violated the precepts by rajas.",
        "source": "T22n1428_046:0908a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中言犯偷蘭遮者，皆是多聞、學阿含、持法、持律、持摩夷，得伴黨比丘、比丘尼、優婆塞、優婆夷、國王、大臣、種種外道、沙門、婆羅門。",
        "translation": "Those who say they've violated purāṇa are well-versed, well-versed in the study of the āgamas, upholding the Dharma, observing the Vinaya, and upholding the precepts, and attaining the company of monks, nuns, laymen, laywomen, kings, ministers, various non-Buddhists, ascetics, and priests.",
        "source": "T22n1428_046:0908a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中言犯波羅夷者，皆多聞、學阿含、持法、持律、持摩夷，得伴黨比丘、比丘尼、優婆塞、優婆私、國王、大臣、種種外道、沙門、婆羅門。",
        "translation": "Those who say they've violated the rules of pārājika are well-versed, well-versed in the study of the āgamas, upholding the Dharma, upholding the Vinaya, and upholding the rules of morality, and attaining the company of monks, nuns, laymen, ministers, kings, non-Buddhists, ascetics, ascetics, and priests.",
        "source": "T22n1428_046:0908a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作如是念：「若今日說戒，令僧鬪諍共相誹謗、令僧破壞、令僧塵垢、令僧別異住，我當云何？」",
        "translation": "They think, \"If today's explanation of the precepts causes the saṃgha to fight and denigrate each other, causes the saṃgha to be disrupted, causes the saṃgha to become defiled, and causes the saṃgha to live differently, what will I do?\"",
        "source": "T22n1428_046:0908a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白諸比丘。",
        "translation": "He said to the monks.",
        "source": "T22n1428_046:0908a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「若有異住處比丘犯偷蘭遮，是中或言犯偷蘭遮、或言犯波羅夷。",
        "translation": "The monks said to the Buddha, \"The Buddha said, 'Suppose a monk from a different dwelling place violates the rules of purification, and some of them say they've violated purification or they say they've violated the rules of pārājika.",
        "source": "T22n1428_046:0908a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言犯偷蘭遮者，皆是多聞乃至持摩夷，得比丘比丘尼伴黨，乃至沙門外道婆羅門。",
        "translation": "Those who say they've violated purāṇḍa are well-versed up to the level of novice monks and nuns, companions of monks and nuns, and ascetics and non-Buddhists.",
        "source": "T22n1428_046:0908a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言犯波羅夷者，皆是多聞乃至持摩夷，得比丘比丘尼伴黨，乃至沙門外道婆羅門，彼作如是念：『若今日說戒，令僧鬪諍共相誹謗、令僧破壞、令僧塵垢、令僧別異住。』",
        "translation": "Those who say they've violated the pārājika are well-versed, even those who uphold the precepts, and they attain the companionship of monks, bhikṣus, nuns, and even ascetics and non-Buddhists, who think, 'If I say the precepts today, it will cause the saṃgha to fight and denigrate each other, cause the saṃgha to be destroyed, cause the saṃgha to become defiled, and cause the saṃgha to live differently.'",
        "source": "T22n1428_046:0908b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘重此破僧事者，不應此日說戒。」",
        "translation": "If a monk respects this violation of the saṃgha, he shouldn't preach the precepts on this day.\"",
        "source": "T22n1428_046:0908b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽遮說戒。」",
        "translation": "The Buddha said, \"Listen to Cāḷa as he teaches the precepts.\"",
        "source": "T22n1428_046:0908b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘聞佛聽遮說戒，便遮清淨比丘說戒。",
        "translation": "When the six groups of monks heard that the Buddha had heard that he was refuting the precepts, they refused to allow the pure monks to preach the precepts.",
        "source": "T22n1428_046:0908b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應遮清淨比丘說戒。",
        "translation": "The Buddha said, \"You shouldn't prevent a pure monk from preaching the precepts.",
        "source": "T22n1428_046:0908b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝曹善聽！",
        "translation": "Listen well, you people!",
        "source": "T22n1428_046:0908b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖遮說戒不成遮，遮無根作不成遮，遮有根作成遮；遮無根不作不成遮，遮有根不作成遮；遮無根作不作不成遮，遮有根作不作成遮；遮無根有餘作不作亦如是，遮無根無餘作不作亦如是。",
        "translation": "Although the precepts are precluded and explained as not precluded, preclusion without faculties is not precluded, and preclusion with faculties is accomplished; preclusion without faculties that aren't accomplished is not precluded, and preclusion with faculties that aren't accomplished is accomplished; preclusion without faculties that aren't accomplished is not precluded, and preclusion with faculties that aren't accomplished is accomplished; preclusion without faculties with residual accomplishment or non-acquisition is likewise, and preclusion without faculties without residual accomplishment or non-acquisition is likewise.",
        "source": "T22n1428_046:0908b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五種說戒，未說戒遮說戒不成遮，若說戒竟遮說戒不成遮，若說戒時遮說戒成遮。",
        "translation": "If five kinds of precepts are taught, precepts are precluded and not precluded before they're taught, precepts are precluded and not precluded after they're taught, and precepts are precluded and made precluded when they're taught.",
        "source": "T22n1428_046:0908b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若遮說戒比丘，身行不清淨、口行不清淨、邪命癡不能言、不知方便不解問答，餘比丘應語言：『長老止！",
        "translation": "If a monk who preaches the precepts and preaches them with an unclean physical action, an unclean verbal action, a mistaken life that's deluded, or a lack of understanding in how to answer questions, the other monks should say, 'Elder, stop!'",
        "source": "T22n1428_046:0908b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不須作此鬪諍。』",
        "translation": "Don't engage in this kind of fight.'",
        "source": "T22n1428_046:0908b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是已說戒。",
        "translation": "He should explain the precepts after doing so.",
        "source": "T22n1428_046:0908b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮說戒比丘，身行清淨，口行不清淨、邪命癡不能言、不知方便不解問答，餘比丘應語言：『長老止！",
        "translation": "When a monk who refuses to preach the precepts conducts himself in a pure manner and conducts himself orally in a manner that's unclean, has wrong livelihood, is deluded, and doesn't understand questions and answers, the other monks should say, 'Elder, stop!'",
        "source": "T22n1428_046:0908b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不須作此鬪諍。』",
        "translation": "Don't engage in this kind of fight.'",
        "source": "T22n1428_046:0908b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是已說戒。",
        "translation": "You should have explained the precepts in this way.",
        "source": "T22n1428_046:0908b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若遮說戒比丘，身行清淨、口行清淨、邪命癡不能言、不知方便不解問答，餘比丘應語言：『長老止！",
        "translation": "If a monk who refuses to preach the precepts conducts himself in a pure manner, speaks in a pure manner, is deluded about wrong livelihood, and doesn't understand questions and answers, the other monks should say, 'Elder, stop!'",
        "source": "T22n1428_046:0908b22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不須作此鬪諍。』",
        "translation": "Don't engage in this kind of fight.'",
        "source": "T22n1428_046:0908b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是已說戒。",
        "translation": "He should explain the precepts after doing so.",
        "source": "T22n1428_046:0908b25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮說戒比丘，身行清淨、口行清淨、不邪命，有智慧能言、知方便能問答，餘比丘應問言：『長老！",
        "translation": "When a monk who has explained the precepts conducts himself in a pure manner, speaks in a pure manner, doesn't commit wrong livelihood, and has the wisdom to speak and the knowledge to answer questions with skillful means, the other monks should ask, 'Elder!'",
        "source": "T22n1428_046:0908b26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮此比丘說戒，為以何事故？",
        "translation": "What is the reason for refusing to allow this monk to preach the precepts?",
        "source": "T22n1428_046:0908b28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為破戒耶？",
        "translation": "Is it for the sake of violating the precepts?",
        "source": "T22n1428_046:0908b29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為破見、破威儀耶？』",
        "translation": "Is it to refute views and refute propriety?'",
        "source": "T22n1428_046:0908b29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『破戒。』",
        "translation": "If you say, 'Break the precepts,'",
        "source": "T22n1428_046:0908b29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『破何等戒？』",
        "translation": "you should ask, 'What kind of precepts have been broken?'",
        "source": "T22n1428_046:0908c01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『波羅夷。』",
        "translation": "Suppose you say, 'Pārājika!'",
        "source": "T22n1428_046:0908c01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『僧殘、若偷蘭遮。』",
        "translation": "If someone says, 'Saṃghârāma, suppose he steals Rājagṛha.'",
        "source": "T22n1428_046:0908c01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為破戒。",
        "translation": "This is a violation of the precepts.'",
        "source": "T22n1428_046:0908c02_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『不破戒，破見故遮。』",
        "translation": "If you say, 'It's not a violation of the precepts, but it's a refusal because it breaks my views,' then you should ask, 'What views have been broken?'",
        "source": "T22n1428_046:0908c02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『破何等見？』",
        "translation": "you should ask, 'What view is it that's broken?'",
        "source": "T22n1428_046:0908c03_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『六十二見。』",
        "translation": "If someone says, 'Sixty-two views.'",
        "source": "T22n1428_046:0908c03_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是破見。",
        "translation": "This is a view that refutes.",
        "source": "T22n1428_046:0908c03_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『不破見，破威儀故遮。』",
        "translation": "If you say, 'It doesn't refute views, it refutes them because it refutes mannerisms.'",
        "source": "T22n1428_046:0908c04_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『破何等威儀？』",
        "translation": "you should ask, 'What manner of disrespect is being disrupted?'",
        "source": "T22n1428_046:0908c04_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『破波逸提、波羅提提舍尼、突吉羅、惡說。』",
        "translation": "If someone says, 'Disparage pāyattika, pratideśanī, duṣkṛta, and harsh speech.'",
        "source": "T22n1428_046:0908c05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為破威儀。",
        "translation": "This is a violation of the precepts.",
        "source": "T22n1428_046:0908c06_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『以何故遮此比丘說戒？",
        "translation": "You should ask, 'What is the reason you're refusing to allow this monk to preach the precepts?'",
        "source": "T22n1428_046:0908c06_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以見故耶？",
        "translation": "Is it because of views?",
        "source": "T22n1428_046:0908c07_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以聞疑故耶？』",
        "translation": "Is it because you've heard of doubt?'",
        "source": "T22n1428_046:0908c07_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『見。』",
        "translation": "If you say, 'I see...'",
        "source": "T22n1428_046:0908c07_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『見何事？",
        "translation": "you should ask, 'What do you see?'",
        "source": "T22n1428_046:0908c08_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見？",
        "translation": "How do we see?",
        "source": "T22n1428_046:0908c08_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝在何處？",
        "translation": "Where are you?",
        "source": "T22n1428_046:0908c08_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼在何處？",
        "translation": "Where is he?",
        "source": "T22n1428_046:0908c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見何等為是波羅夷？",
        "translation": "What do you see as a rainy day?",
        "source": "T22n1428_046:0908c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是僧殘？",
        "translation": "Why are these crimes punished by the saṃgha?",
        "source": "T22n1428_046:0908c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是波逸提？",
        "translation": "Why is it pratyekabuddha?",
        "source": "T22n1428_046:0908c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是波羅提提舍尼、偷蘭遮、突吉羅、惡說耶？』",
        "translation": "Is this the pratideśanīya, the purāṇa, the duṣkṛta, or the evil speech?'",
        "source": "T22n1428_046:0908c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『不見。』",
        "translation": "If you say, 'I don't see it.'",
        "source": "T22n1428_046:0908c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言：『聞。』",
        "translation": "and say, 'I've heard it.'",
        "source": "T22n1428_046:0908c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『聞何事？",
        "translation": "you should ask, 'What's the matter that you've heard?'",
        "source": "T22n1428_046:0908c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從誰聞？",
        "translation": "From whom was it heard?",
        "source": "T22n1428_046:0908c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是比丘？",
        "translation": "Why is it a monk?",
        "source": "T22n1428_046:0908c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是比丘尼耶？",
        "translation": "Why are these nuns bhikṣus?",
        "source": "T22n1428_046:0908c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是優婆塞優婆夷耶？",
        "translation": "Why is it Upāsaka Upāsikā?",
        "source": "T22n1428_046:0908c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何所聞此比丘為犯波羅夷？",
        "translation": "What has been heard about this monk's offense against the pārājika?",
        "source": "T22n1428_046:0908c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為僧殘？",
        "translation": "for the sake of the saṃgha?",
        "source": "T22n1428_046:0908c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為波逸提？",
        "translation": "For pratyekabuddha?",
        "source": "T22n1428_046:0908c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為波羅提提舍尼？",
        "translation": "(Skt. pratideśanīya)?",
        "source": "T22n1428_046:0908c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為偷蘭遮？",
        "translation": "To steal a lancha?",
        "source": "T22n1428_046:0908c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為突吉羅？",
        "translation": "What is the purpose of a tukhāra?",
        "source": "T22n1428_046:0908c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為惡說耶？』",
        "translation": "Is it evil speech?'",
        "source": "T22n1428_046:0908c15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『不聞。",
        "translation": "If someone says, 'I don't hear it.",
        "source": "T22n1428_046:0908c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為疑故遮。』",
        "translation": "It's because of doubt that it's obstructed.'",
        "source": "T22n1428_046:0908c16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問言：『疑何事？",
        "translation": "you should ask, 'What do you doubt?'",
        "source": "T22n1428_046:0908c16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何疑？",
        "translation": "What is doubt?",
        "source": "T22n1428_046:0908c16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從誰許聞疑耶？",
        "translation": "From whom is it permissible to hear doubt?",
        "source": "T22n1428_046:0908c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為比丘、比丘尼、優婆塞、優婆私？",
        "translation": "Are they monks, nuns, laymen, or laywomen?",
        "source": "T22n1428_046:0908c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為疑犯何事？",
        "translation": "What is the reason for the suspect's crime?",
        "source": "T22n1428_046:0908c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為波羅夷？",
        "translation": "Is it pārājika?",
        "source": "T22n1428_046:0908c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為僧殘、波逸提、波羅提提舍尼、偷蘭遮、突吉羅、惡說耶？』",
        "translation": "Is it for the saṃghârāma, the prāyattika, the pratideśanika, the pārājika, the duṣkṛta, or the evil speaking?'",
        "source": "T22n1428_046:0908c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮說戒比丘不能答智慧持戒比丘令歡喜者，若遮波羅夷，應與作僧殘已便說戒；若遮僧殘，應與波逸提已便說戒；若遮波逸提，應以餘罪懺悔已便說戒。",
        "translation": "If a monk who refuses to preach the precepts can't make a monk of wisdom who upholds the precepts rejoice, then he should preach the precepts after making a residue in the saṃgha, if he refuses to make a residue in the saṃgha, he should preach the precepts after making a pāyattika, and if he refuses to make a pāyattika, he should preach the precepts after repenting the remaining sins.",
        "source": "T22n1428_046:0908c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若遮說戒比丘能答智慧持戒比丘令歡喜者，若以波羅夷遮，應與滅擯已便說戒；若遮僧殘，應與覆藏已說戒；若應與本日治，與本日治已說戒；若應與摩那埵，與摩那埵已便說戒；應與出罪羯磨，與出罪已說戒；若以波逸提遮者，應如法懺悔已說戒；若以餘事遮，應如法懺悔已說戒。」",
        "translation": "If a monk who preaches the precepts can answer a monk of wisdom who upholds the precepts and make him happy, then he should preach the precepts after he has been refuted because of the bārājī precepts; if he precepts the saṃgha, he should preach the precepts after he has covered up the saṃgha; if he preaches the precepts after he has been given the present day's purification, he should preach the precepts after he has been given the present day's purification; if he preaches the precepts after he has been given the manattva, he should preach the precepts after he has been given the manattva; if he preaches the precepts after he has been given the karma for excommunication, he should preach the precepts after he has been excommunicated; if he preaches the precepts after he has repented according to the teaching, and if he preaches the precepts after he has repented according to the teaching if he has been precluded by other circumstances.\"",
        "source": "T22n1428_046:0908c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時異住處說戒，病比丘遮病比丘說戒，病比丘作如是念：「我當云何？」",
        "translation": "It was then that the monk in the different abode explained the precepts, and the sick monk obstructed the sick monk from explaining the precepts, and the sick monk had this thought, \"What shall I do?\"",
        "source": "T22n1428_046:0909a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白諸比丘。",
        "translation": "He said to the monks.",
        "source": "T22n1428_046:0909a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「若病比丘遮病比丘說戒，餘比丘應語言：『世尊有如是教，不應遮病比丘，須長老病差、彼比丘病亦差，長老如法說、彼比丘亦當如法說。』",
        "translation": "The monks said to the Buddha, \"If a sick monk refuses to allow a sick monk to preach the precepts, the other monks should say, 'Thus has the Bhagavān taught, 'We shouldn't refuse to allow a sick monk to preach the precepts when an elder is sick and another monk is sick, and when an elder thus speaks, that monk will also thus speak.'",
        "source": "T22n1428_046:0909a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是已說戒。」",
        "translation": "You should explain the precepts after doing so.\"",
        "source": "T22n1428_046:0909a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有異處說戒，時病比丘遮不病比丘說戒。",
        "translation": "When there's a different place where the precepts are taught, the sick monk refuses to allow the monk who isn't sick to teach the precepts.",
        "source": "T22n1428_046:0909a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「餘比丘應語言：『世尊有如是教，病人不應遮他說戒，須病差當如法說，彼亦當如法說。』",
        "translation": "\"The other monks should say, 'The Bhagavān has thus taught that a sick person shouldn't block others from teaching the precepts; the sick person should teach it according to the teaching, and he should teach it according to the teaching.'",
        "source": "T22n1428_046:0909a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是已說戒。」",
        "translation": "You should explain the precepts after doing so.\"",
        "source": "T22n1428_046:0909a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有異處說戒，時有無病比丘遮病比丘說戒。",
        "translation": "There was a different place where the precepts were taught, and there was a monk without a disease who preached the precepts to a monk who was ill.",
        "source": "T22n1428_046:0909a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「餘比丘應語言：『長老！",
        "translation": "\"The other monks responded by saying, 'Elder!",
        "source": "T22n1428_046:0909a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有如是教，不應遮病比丘，須病差如法問、彼比丘如法說。』",
        "translation": "The Bhagavān has thus taught, 'You shouldn't obstruct a sick monk; you should ask the sick monk according to the teaching and he should explain it according to the teaching.'",
        "source": "T22n1428_046:0909a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是已說戒。」",
        "translation": "You should explain the precepts after doing so.\"",
        "source": "T22n1428_046:0909a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有異處，眾多比丘說戒日，聞彼處有比丘喜鬪諍罵詈共相誹謗、口出刀劍，欲來此說戒。",
        "translation": "On the day when a large group of monks from another place was expounding the precepts, they heard that there were monks there who were fierce, abusive, slanderous, and had swords coming out of their mouths, and they wanted to come here to expound the precepts.",
        "source": "T22n1428_046:0909a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我曹當云何？」",
        "translation": "\"What will we do?\"",
        "source": "T22n1428_046:0909a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「若有如此事起，應作二三種布薩，若應十五日說十四日作，若應十四日說十三日作。",
        "translation": "The monks said to the Buddha, \"The Buddha said, 'If such a thing arises, there are two or three kinds of protuberances that should be made, and if it should be made on the fifteenth day, it's said to be made on the fourteenth day, and if it should be made on the fourteenth day, it's said to be made on the thirteenth day.",
        "source": "T22n1428_046:0909a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞今日來，即應疾疾集一處布薩。",
        "translation": "If you hear that it's today, you should quickly gather at one place to preach.",
        "source": "T22n1428_046:0909a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞已至界內，應出外布薩。",
        "translation": "If he hears that he's arrived within the boundary, he should go out and preach.",
        "source": "T22n1428_046:0909a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言已入僧伽藍，便應掃除浴室、具浴床、浴瓶、刮汗刀、水器、泥器、樹皮、細末藥、若泥，問上座已與然火。",
        "translation": "If he says he's entered the monastery, he should sweep out the bathhouse, equip it with a bathing bed, bathing vase, sweat scraper, water vessel, clay vessel, bark, fine powdered medicine, and mud, and give it to the patron after asking him about the fire.",
        "source": "T22n1428_046:0909a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼客比丘入浴室浴時，應一一從浴室中出界外說戒。",
        "translation": "When that guest monk enters the bathhouse to bathe, he should emerge from the bathhouse one by one and explain the precepts beyond the boundary.",
        "source": "T22n1428_046:0909a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若客比丘喚舊比丘共說戒，應答言：『我曹已說戒。』",
        "translation": "If a visiting monk calls an old monk to share the precepts, he should reply, 'I have explained the precepts.'",
        "source": "T22n1428_046:0909a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若舊比丘說戒已，客比丘遮說戒者不成遮。",
        "translation": "If a visiting monk refuses to explain the precepts after an old monk explains the precepts, he doesn't refute it.",
        "source": "T22n1428_046:0909a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若客比丘說戒時，舊比丘遮說戒成遮。",
        "translation": "If a visiting monk teaches the precepts, the old monk's refutation of the precepts becomes refutation.",
        "source": "T22n1428_046:0909a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是者善；若不能，應作白却說戒日。",
        "translation": "If he can do so, that's good; if not, he should make a confession and refrain from expounding the precepts on that day.",
        "source": "T22n1428_046:0909a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是白：『大德僧聽！",
        "translation": "You should make this confession, saying, 'Listen, Venerable monks!",
        "source": "T22n1428_046:0909a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧今不說戒，至黑月當說戒。",
        "translation": "'The saṃgha won't explain the precepts now; they'll explain them in the dark moon.",
        "source": "T22n1428_046:0909a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白如是。』",
        "translation": "I will explain the precepts in 'This is how I explain them.'",
        "source": "T22n1428_046:0909b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作如是白却說戒。",
        "translation": "You should make this proclamation and then explain the precepts.",
        "source": "T22n1428_046:0909b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若客比丘便待不去，彼比丘應作白第二却說戒，應作如是白：『大德僧聽！",
        "translation": "If a visiting monk then stays put and doesn't go, that monk should make a second statement about refraining from teaching the precepts, saying, 'Listen, Mañjuśrī!",
        "source": "T22n1428_046:0909b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧今不說戒，至白月當說戒。』",
        "translation": "'The saṃgha won't explain the precepts now; they'll explain them in the white moon.'",
        "source": "T22n1428_046:0909b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是白第二却說戒。",
        "translation": "You should thus explain the precepts to the second monk, but he'll explain them.",
        "source": "T22n1428_046:0909b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若客比丘不去，至白月，舊比丘應如法強與客比丘問答。」",
        "translation": "If a visiting monk doesn't go until the white moon, the old monk should emphasize the question and answer with the visiting monk according to the teaching.\"",
        "source": "T22n1428_046:0909b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(遮揵度具足竟)破僧揵度第十五爾時世尊在王舍城，有因緣眾僧集會。",
        "translation": "(After Completing the Cakravāḍa) Śākyamuni's Commentary No. 15 At the time, the Bhagavān was in the city of Rājagṛha and there were reasons for the gathering of monks.",
        "source": "T22n1428_046:0909b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多從坐起行舍羅：「誰諸長老忍此五事是法是毘尼是佛所教者便捉籌。」",
        "translation": "Devadatta then rose from his seat and took refuge in the monastery, \"Which elders tolerate these five things as teachings of the Buddha and then arrest them?\"",
        "source": "T22n1428_046:0909b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有五百新學無智比丘捉籌。",
        "translation": "There were then five hundred novice monks without wisdom who grabbed the chips.",
        "source": "T22n1428_046:0909b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難從坐起，以欝多羅僧著一面，作如是言：「誰諸長老忍此五事非法非毘尼非佛教者，以欝多羅僧著一面。」",
        "translation": "Ānanda then got up from his seat, put his uttarâsaṅga on one side, and said, \"Which elders tolerate these five things as unlawful, non-Buddhist, and non-Vinayan, and put their uttarâsaṅga on one side?\"",
        "source": "T22n1428_046:0909b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有六十長老比丘，以欝多羅僧著一面。",
        "translation": "There were 60 elder monks there, sitting on one side with their uttarâsaṅga.",
        "source": "T22n1428_046:0909b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多語諸比丘言：「長老！",
        "translation": "Devadatta then said to the monks, \"Elders!",
        "source": "T22n1428_046:0909b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我曹不須佛及眾僧，自共作羯磨說戒。」",
        "translation": "We don't need the Buddha and the saṃgha to jointly preach the precepts in a karma session.\"",
        "source": "T22n1428_046:0909b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往至伽耶山中。",
        "translation": "He then went to Mount Gayā.",
        "source": "T22n1428_046:0909b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時提婆達多至伽耶山中，離佛及僧自作羯磨說戒。",
        "translation": "It was then that Devadatta went to Mount Gayā and made a karmic precept apart from the Buddha and the saṃgha.",
        "source": "T22n1428_046:0909b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾多比丘往世尊所，禮足已却坐一面，白世尊言：「王舍城中有因緣事眾僧集會。",
        "translation": "At the time, a large group of monks went to the Bhagavān, paid homage to his feet, withdrew to sit at one side, and said to the Bhagavān, \"There's a gathering of monks in Rājagṛha for a reason.",
        "source": "T22n1428_046:0909b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多從坐起行籌言：『誰諸長老忍此五事是法是毘尼是佛所教者便捉籌。』",
        "translation": "Devadatta then got up from his seat and made preparations, saying, 'Which of the elders tolerates these five things as teachings of the Buddha and will then grab the preparations?'",
        "source": "T22n1428_046:0909b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中有五百新學無智比丘即捉籌。",
        "translation": "There were five hundred novice monks without wisdom who then grabbed the chips.",
        "source": "T22n1428_046:0909b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長老阿難即從坐起，以欝多羅僧著一面言：『誰諸長老忍此五法非法非毘尼非是佛教者，捨欝多羅僧著一面。』",
        "translation": "The elder Ānanda then got up from his seat and put his uttarâsaṅga to one side, saying, 'Which elders tolerate that these five things are not Dharma, not Vinaya, and not Buddhism?'",
        "source": "T22n1428_046:0909b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有六十長老比丘捨欝多羅僧著一面。",
        "translation": "There were then 60 elder monks who abandoned Uttarakuru and put themselves on one side of the monk's head.",
        "source": "T22n1428_046:0909b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多語諸比丘：『我等可捨佛及僧自作羯磨說戒。』",
        "translation": "Devadatta then said to the monks, 'We can abandon the Buddha and the saṃgha and make our own karma to preach the precepts.'",
        "source": "T22n1428_046:0909b27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往伽耶山中，捨佛及僧作羯磨說戒。」",
        "translation": "He then went to Mount Gayā and renounced the Buddha and the saṃgha to preach the precepts in karma.\"",
        "source": "T22n1428_046:0909b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此癡人破僧，有八非正法纏縛覆障消滅善心，提婆達多趣於非道，在泥犁中一劫不救。",
        "translation": "The Buddha said, \"This foolish man breaks the precepts of the saṃgha, and there are eight incorrect dharmas that bind, hinder, and destroy good intentions, which lead Devadatta to a wrong path and land him in the mire for an eon without rescue.",
        "source": "T22n1428_046:0909b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T22n1428_046:0909c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "利無利、譽不譽、恭敬不恭敬、惡知識、樂惡友。",
        "translation": "They lack profit, don't praise, don't revere, don't respect, have bad friends, and enjoy bad friends.",
        "source": "T22n1428_046:0909c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如是八非正法纏縛覆翳消滅善心，提婆達多趣於非道，在泥犁中一劫不救。",
        "translation": "With these eight incorrect qualities that bind, obscure, and stifle good thoughts, Devadatta is headed down a wrong path and remains in the mire for an eon without being saved.",
        "source": "T22n1428_046:0909c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若見提婆達多有如毛髮善法者，終不記言：『在泥犁中一劫不救。』",
        "translation": "If I see that Devadatta has good qualities like hairs, I'll never remember saying, 'I'll be in the mire for an eon and won't be saved.'",
        "source": "T22n1428_046:0909c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不見提婆達多有如毛髮善法故，記言：『在泥犁中一劫不救。』",
        "translation": "It's because I don't see that Devadatta has good qualities like hairs, that I remember saying, 'An eon in the mud and plow won't save him.'",
        "source": "T22n1428_046:0909c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人沒在屎中，有人欲出，都不見有如毛髮處淨可以手捉出之。",
        "translation": "It's like a person who's submerged in excrement and wants to get out, but they don't see a place as clean as a hair that they can grab and pull out with their hands.",
        "source": "T22n1428_046:0909c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今觀提婆達多亦復如是，不見有如毛髮許白法，是故我言：『提婆達多在泥犁中一劫不救。』」",
        "translation": "Now, observing Devadatta in the same way, I don't see anything as white as a hair, so I say, 'Devadatta's being stuck in a mud plow for an eon won't save him.'\"",
        "source": "T22n1428_046:0909c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗、目連往伽耶山中，有比丘見，涕泣流淚往世尊所，頭面禮足却坐一面，白世尊言：「世尊第一弟子亦往伽耶山中。」",
        "translation": "When Śāriputra and Maudgalyāyana went to Mount Gayā, a monk saw them, wept, and went to the Bhagavān, bowed his head at his feet, withdrew to sit at one side, and said to the Bhagavān, \"The Bhagavān's first disciple has also gone to Mount Gayā.\"",
        "source": "T22n1428_046:0909c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「汝莫恐怖！",
        "translation": "The Buddha told the monk, \"Don't be afraid!",
        "source": "T22n1428_046:0909c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連往伽耶山中求利益故。」",
        "translation": "Śāriputra and Maudgalyāyana have gone to Mount Gayā for their benefit.\"",
        "source": "T22n1428_046:0909c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時提婆達多在伽耶山中與無數眾圍遶說法，遙見舍利弗、目連來即言：「善來！",
        "translation": "It was then that Devadatta was in Mount Gayā surrounded by an incalculable crowd, expounding the Dharma, when he saw Śāriputra and Maudgalyāyana coming from a distance and said, \"Good boy!",
        "source": "T22n1428_046:0909c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝大弟子，雖先不忍而今忍者，雖後而善。」",
        "translation": "You great disciple, although you were intolerant in the beginning and are now a ninja, you were good in the end.\"",
        "source": "T22n1428_046:0909c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連到已敷座而坐。",
        "translation": "After they arrived, Śāriputra and Maudgalyāyana prepared their seats and sat down.",
        "source": "T22n1428_046:0909c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時提婆達多，於大眾前如佛常法，告舍利弗：「為眾僧說法，我今背痛小自停息。」",
        "translation": "Devadatta then addressed Śāriputra in front of the crowd as the Buddha always did, \"I'm teaching the sermon for the monks, but now I'm calming down from my back pain.\"",
        "source": "T22n1428_046:0909c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多法像世尊，自襞疊僧伽梨為四重，以右脇著地，猶如師子。",
        "translation": "At the time, Devadatta, like the Bhagavān, folded himself into a fourfold conch and placed his right hypochondrium on the ground like a lion.",
        "source": "T22n1428_046:0909c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不覺左脇著地，猶如野干偃臥鼾眠。",
        "translation": "He didn't perceive his left hypochondrium on the ground, but he was like a wild trunk lying down and snoring.",
        "source": "T22n1428_046:0909c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗語目連言：「今可為此大眾示生厭離心。」",
        "translation": "Śāriputra then said to Maudgalyāyana, \"Now, you can show this crowd that you're disillusioned with them.\"",
        "source": "T22n1428_046:0909c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連聞舍利弗語已，即以神通上昇虛空，或現形說法、或不現形而說法、或現半形而說法、或不現半形而說法、或時出烟、或時出火、或時身下出火身上出水流、或時身上出火身下水流、或時通身火然毛孔出水。",
        "translation": "After hearing what Śāriputra said, Maudgalyāyana then ascended into the sky with his supernormal powers and either taught in form, taught without form, taught in half form, taught without half form, or taught without half form, sometimes emitting smoke, sometimes emitting fire, sometimes emitting fire from beneath his body and water flowing from his body, sometimes emitting fire from his body and water flowing from beneath his body, or sometimes emitting fire throughout his body and water flowing from his pores.",
        "source": "T22n1428_046:0909c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗知大目連為此大眾示生厭離心已，即為說四諦法苦集盡道。",
        "translation": "Śāriputra then knew that Mahāmaudgalyāyana had shown this crowd that he was disillusioned with the idea of abandoning them, and he then taught them the four truths of suffering, accumulation, and the path to their end.",
        "source": "T22n1428_046:0910a02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，即於座上遠塵離垢得法眼淨。",
        "translation": "Those monks then rose from their seats, secluded themselves from the dust and defilement, and attained purification of the Dharma eye.",
        "source": "T22n1428_046:0910a04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗、目連告諸比丘：「其有是世尊弟子者便隨我來。」",
        "translation": "Śāriputra and Maudgalyāyana then addressed the monks, \"If anyone is a disciple of the Bhagavān, then follow me here.\"",
        "source": "T22n1428_046:0910a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗、目連，與五百比丘即從坐起而去。",
        "translation": "Śāriputra, Maudgalyāyana, and the five hundred monks then got up from their seats and departed.",
        "source": "T22n1428_046:0910a06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連出外未久，三聞達多觸提婆達多脚指言：「提婆達多可起，舍利弗、目連將五百比丘從坐而去。」",
        "translation": "Not long after Śāriputra and Maudgalyāyana left the room, the learned master touched Devadatta's ankles and said, \"Devadatta, get up! Śāriputra and Maudgalyāyana will remove the five hundred monks from their seats.\"",
        "source": "T22n1428_046:0910a07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即驚怖而起，熱血從面孔出。",
        "translation": "They then rose in terror, and hot blood came out of their faces.",
        "source": "T22n1428_046:0910a10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘見舍利弗、目連將五百比丘來，歡喜往詣佛所，頭面禮足却坐一面，白佛言：「舍利弗、目連將五百比丘來。」",
        "translation": "When the monks saw that Śāriputra and Maudgalyāyana had brought 500 monks, they rejoiced and went to the Buddha, bowed their heads and feet, withdrew to sit at one side, and said to the Buddha, \"Śāriputra and Maudgalyāyana have brought 500 monks here.\"",
        "source": "T22n1428_046:0910a11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「舍利弗非直今者破提婆達多，此是第二舍利弗破提婆達多。",
        "translation": "The Buddha told the monks, \"Śāriputra didn't just refute Devadatta now; this is the second time that Śāriputra refuted Devadatta.",
        "source": "T22n1428_046:0910a13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去世時，有年少婆羅門，字散若，往詣射師所白言：『師！",
        "translation": "Way back in the distant past, a young Brāhmaṇa named Sanskrit went to an archer and said, 'Master!",
        "source": "T22n1428_046:0910a15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲學射術。』",
        "translation": "I want to learn archery.'",
        "source": "T22n1428_046:0910a17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即答言：『可學。』",
        "translation": "He replied, 'It's possible to learn.'",
        "source": "T22n1428_046:0910a17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時散若於七年中學射，過七年已便作如是念：『我今學射何時可已？』",
        "translation": "If he had studied archery for seven years, then after seven years had passed, he would think, 'When will I be able to learn archery?'",
        "source": "T22n1428_046:0910a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往師所白言：『我今故可幾時學射？』",
        "translation": "He went to his teacher and said, 'Now, when can I learn to shoot?'",
        "source": "T22n1428_046:0910a19_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師即教令牽弓著箭語言：『我有因緣入村，須我還乃可放箭。』",
        "translation": "The teacher then instructed him to draw a bow and attach an arrow, saying, 'I have a reason to go into the village; I must return before I can release the arrow.'",
        "source": "T22n1428_046:0910a20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時師勅已便入村。",
        "translation": "After the master commanded him to do so, he then went into the village.",
        "source": "T22n1428_046:0910a21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時散若作是念：『師何故教我牽弓著箭待還而放耶？",
        "translation": "Scattera then thought, 'Why did the teacher teach me to hold the bow and arrow until I return?'",
        "source": "T22n1428_046:0910a22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今可放箭，知有何事？』",
        "translation": "I may now discharge my arrows, knowing what is the matter?'",
        "source": "T22n1428_046:0910a23_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "散若前有大娑羅樹，即放箭著樹，箭過入地不現。",
        "translation": "When there was a large śāla tree in front of the monastery, he put an arrow into it, but the arrow passed through and entered the ground without appearing.",
        "source": "T22n1428_046:0910a24_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時師入村事訖便還，至散若所問言：『汝未放箭耶？』",
        "translation": "After he finished his business in the village, the teacher returned and asked Sañjā, 'Have you not fired the arrow?'",
        "source": "T22n1428_046:0910a25_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『已放。』",
        "translation": "He replied, 'I've released it.'",
        "source": "T22n1428_046:0910a26_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師言：『汝作不善，若汝不放箭者，於閻浮提最為大師。",
        "translation": "The teacher said, 'You've done a bad thing; if you hadn't released the arrow, you'd be the greatest teacher in Jambudvīpa.",
        "source": "T22n1428_046:0910a26_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我為閻浮提第一大師，若我死者次當有汝。』",
        "translation": "Now, I'm the greatest teacher in Jambudvīpa, and if I die, you'll be next.'",
        "source": "T22n1428_046:0910a28_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時師即莊嚴其女，以五百枚箭并一馬車與之。",
        "translation": "The teacher then adorned his daughter and gave her five hundred arrows and a chariot.",
        "source": "T22n1428_046:0910a29_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時散若受已當度曠野，散若即安其婦著車上，持五百枚箭度曠野。",
        "translation": "After accepting it, she was about to cross the wilderness, so he put his wife on the cart and carried the five hundred arrows across the wilderness.",
        "source": "T22n1428_046:0910b01_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有五百群賊於曠野中食，時散若即語婦言：『汝往賊所乞食。』",
        "translation": "There were then five hundred bandits feeding in the wilderness, and Scattero then said to the woman, 'Go to the bandits and beg for food.'",
        "source": "T22n1428_046:0910b02_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婦即往語賊言：『散若從汝乞食。』",
        "translation": "The woman then went and said to the thieves, 'Scatterer will beg food from you.'",
        "source": "T22n1428_046:0910b04_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時賊帥言：『今觀其所使非是常人，宜可與食。』",
        "translation": "The commander of the thieves then said, 'Now, I see that his messenger isn't an ordinary person, so it's a good idea to give him food.'",
        "source": "T22n1428_046:0910b05_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一賊便起，作是言：『我曹猶活此人將婦乘車而去耶？』",
        "translation": "Then one of the thieves got up and said, 'Are we still alive when this man takes the woman away in his chariot?'",
        "source": "T22n1428_046:0910b06_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時散若即放箭，應箭而死。",
        "translation": "If they then scattered, they immediately released an arrow, and in response they died.",
        "source": "T22n1428_046:0910b07_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘者復起作如是言：『我曹猶活此人將婦乘車而去耶？』",
        "translation": "The others then got up again and said, 'Are we still alive when this man rides off with his wife in his chariot?'",
        "source": "T22n1428_046:0910b08_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "散若復放一箭，應箭而死。",
        "translation": "\"If he discharges another arrow, he'll die in response to the arrow.",
        "source": "T22n1428_046:0910b09_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是其有一一起者，應箭而死。",
        "translation": "Thus, if there's one together, he'll die as a result of the arrow.",
        "source": "T22n1428_046:0910b10_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時散若餘有一箭，唯有賊帥在，未得其便而不放箭，即語婦言：『汝脫衣置地。』",
        "translation": "When Scattered has another arrow, and there's only the commander of the thief present, he doesn't release the arrow before getting his way, so he says to the woman, 'Take off your clothes and put them on the ground.'",
        "source": "T22n1428_046:0910b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦即脫衣，即得賊便放箭，應箭而死。」",
        "translation": "The woman then takes off her clothes, and the thief then releases the arrow, and she dies in response to the arrow.\"",
        "source": "T22n1428_046:0910b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「汝欲知不？",
        "translation": "The Buddha addressed the monks, \"Do you want to know?",
        "source": "T22n1428_046:0910b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔五百賊者，即今五百比丘是。",
        "translation": "The five hundred thieves of yore were the five hundred monks of today.",
        "source": "T22n1428_046:0910b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊帥者，提婆達多是。",
        "translation": "The commander of the thieves was Devadatta.",
        "source": "T22n1428_046:0910b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "散若婆羅門者，豈異人乎！",
        "translation": "Wouldn't a scattered Brahmin be a different person?",
        "source": "T22n1428_046:0910b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即舍利弗是。",
        "translation": "That's what Śāriputra was.",
        "source": "T22n1428_046:0910b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為舍利弗昔日破，今第二破。」",
        "translation": "This is Śāriputra's second refutation of what was refuted in the past.\"",
        "source": "T22n1428_046:0910b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗、目連，將五百比丘往至佛所，頭面禮足却坐一面，白佛言：「此五百比丘，隨順提婆達多作別眾，今應更受大戒。」",
        "translation": "Śāriputra and Maudgalyāyana then brought 500 monks to the Buddha, bowed their heads at their feet, withdrew to sit at one side, and said to the Buddha, \"These 500 monks who followed Devadatta as a separate group should now receive the greater precepts.\"",
        "source": "T22n1428_046:0910b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗、目連：「隨順提婆達多比丘，先戒即是，但應教令作偷蘭遮懺悔。」",
        "translation": "The Buddha told Śāriputra and Maudgalyāyana, \"The monks who followed Devadatta's lead were previously disciplined, but they should be taught to repent by stealing lanzas.\"",
        "source": "T22n1428_046:0910b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連白佛言：「世尊在無數眾中告舍利弗：『汝可說法，我今背痛小自停息。』",
        "translation": "Maudgalyāyana said to the Buddha, \"The Bhagavān addressed Śāriputra in the midst of an incalculable multitude, 'You may preach, for now I've had a little back pain that's stopped by itself.'",
        "source": "T22n1428_046:0910b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多亦復如是，法像世尊，自疊僧伽梨為四重，以右脇著地，猶如師子。",
        "translation": "So did Devadatta, who was like the Bhagavān, fold his own image of the Saṃghârī into four layers and put his right hypochondrium on the ground like a lion.",
        "source": "T22n1428_046:0910b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不覺左脇著地，猶若野干，偃臥鼾眠。」",
        "translation": "He doesn't perceive that his left hypochondrium is on the ground, just like a wilderness dry land, lying down and snoring.'\"",
        "source": "T22n1428_046:0910b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「提婆達多非但今日法像我得此苦惱，此是第二苦惱。",
        "translation": "The Buddha told Maudgalyāyana, \"Devadatta didn't just experience this suffering and distress with the Dharma image of me today; this is the second suffering and distress.",
        "source": "T22n1428_046:0910b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連！",
        "translation": "Maudgalyāyana!",
        "source": "T22n1428_046:0910b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去世，雪山王右面有大池水，有一大象在邊止住。",
        "translation": "As he was going past, there was a large pond of water to the right of the king of the snowy mountains, and a large elephant was standing by it.",
        "source": "T22n1428_046:0910b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼大象入池水中洗浴飲水，以鼻拔取藕根，洗令淨而食之，氣力充足形體光澤。",
        "translation": "That large elephant then entered the pond, washed itself, drank from the water, plucked the roots of the lotus root with its trunk, washed it clean, and ate it, and its body was radiant with energy.",
        "source": "T22n1428_046:0910b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一小象，常相隨逐。",
        "translation": "Then there was another small elephant that was always following him.",
        "source": "T22n1428_046:0910c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼小象法學大象，入池水洗浴，拔取藕根不洗合泥而食。",
        "translation": "That little elephant follows the example of the larger elephant, goes into the pond, washes itself, plucks the root of the lotus root without washing it, and then combines it with the mud to eat.",
        "source": "T22n1428_046:0910c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼食藕根，氣力不足，形無光澤，遂便致病。」",
        "translation": "When he eats the root, his energy is lacking, and his body lacks radiance, which causes him to become ill.\"",
        "source": "T22n1428_046:0910c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「我曹大無欲，　　食藕甚清淨；　小象雜泥食，　　學我而致病。",
        "translation": "He then spoke a verse, saying, \"I, Cao, am a great lacker of desire, and I eat the roots very purely; a small elephant eats mud, and it becomes ill after following me.",
        "source": "T22n1428_046:0910c05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　死屍臭有息，　　食消噫自止；　人行非法者，　　長夜氣不滅。",
        "translation": "A dead corpse smells and has breath, and it stops yawning when its food goes away; a person who practices what's not the Dharma doesn't have long nights when their breath doesn't go away.",
        "source": "T22n1428_046:0910c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪欲瞋恚癡，　　丈夫有惡心；　癡人自毀傷，　　如果繁枝折。",
        "translation": "A man of desire, anger, anger, and delusion is a husband with evil intentions; a foolish man disparages to injure himself if his branches are cut off.",
        "source": "T22n1428_046:0910c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　芭蕉以實死，　　竹籚亦復然；　儜人傷利養，　　駏驉懷妊死。」",
        "translation": "A plantain dies from its substance, and so does a bamboo spear; a weak man hurts his nurturing, and a woman dies from pregnancy.\"",
        "source": "T22n1428_046:0910c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「時大象者即我身是，小象者提婆達多是。」",
        "translation": "The Buddha told Maudgalyāyana, \"The large elephant was me, and the small elephant was Devadatta.\"",
        "source": "T22n1428_046:0910c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「此是提婆達多第二學我致此苦惱。」",
        "translation": "The Buddha told Maudgalyāyana, \"This is the second one, Devadatta, who trains me and causes this suffering.\"",
        "source": "T22n1428_046:0910c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘作如是念：「未曾有，提婆達多是世尊弟子，乃作如是背恩作非法，以邪教破壞五百弟子。」",
        "translation": "The monks then had this thought, \"Never before has Devadatta, a disciple of the Bhagavān, done such a thing as to renege on a kindness and act unlawfully, destroying 500 disciples with a wrong teaching.\"",
        "source": "T22n1428_046:0910c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知諸比丘心之所念，即告諸比丘：「提婆達多非但今日破壞我弟子。",
        "translation": "Knowing what the monks were thinking, the Bhagavān addressed the monks, \"It's not just today that Devadatta is destroying my disciples.",
        "source": "T22n1428_046:0910c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去世，有二閻浮提王：一名月、二名月益，十四日生故名為月，十五日生故名為月益，彼此同意無有嫌隙。",
        "translation": "It's true that in a past life there were two kings of Jambudvīpa: one named Moon and the other named Yueyi, who were called Moon because they were born on the 14th day and Yueyi because they were born on the 15th day, and who agreed with each other without any animosity.",
        "source": "T22n1428_046:0910c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提中有一河水，名修羅吒，其水兩邊各有四萬二千城，國土平博嚴好，人民財富熾盛，飲食豐饒。",
        "translation": "In Jambudvīpa there was a river named Xurāṭa, and on each side of that river were 42,000 cities whose lands were vast and beautiful, and whose people were prosperous and had an abundance of food and drink.",
        "source": "T22n1428_046:0910c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時月益王，修羅吒河水邊有城，亦名修羅吒，東西十二由旬、南北七由旬。",
        "translation": "At the time, King Yueyi, there was a city, also named Shurāṭa, on the shores of the Shurāṭa River, 12 leagues east to west and 7 leagues north to south.",
        "source": "T22n1428_046:0910c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二王作要：『若我生男當取汝女，若汝生男當取我女。』",
        "translation": "The two kings made a promise: 'If I were to give birth to a man, I would take your daughter; if you were to give birth to a man, you would take my daughter.'",
        "source": "T22n1428_046:0910c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王月益不生男女，為求兒故，祠祀水神，禮事種種諸天：滿善天、寶善天、日月、釋梵、地火風神、摩醯首羅天、園神、林神、空野神、市神、鬼子母神、城郭神，為天作福希望有兒。",
        "translation": "When the king's moon benefited from the absence of sons and daughters, he worshipped the god of water and paid homage to various gods, including the Pūrṇaśaila god, the Baśailaśaila god, the sun and moon, Śākya Brahmā, the gods of earth and fire and wind, the Mahêśvara god, the god of gardens, the god of forests, the god of the open fields, the god of the city, the god of ghosts and children, and the god of the city, to create blessings for the gods in the hope of having sons.",
        "source": "T22n1428_046:0910c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時修羅吒河邊，有二五通仙人住，時河水神白王言：『修羅吒河邊有二五通仙人住，若彼求願生王家者，王當有兒。』",
        "translation": "When there were two sages with five powers living by the river Xurāṣa, the river god said to the king, 'There are two sages with five powers living by the river Xurāṣa; if they wish to be born in the king's household, the king will have sons.'",
        "source": "T22n1428_046:0911a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王月益即至河邊，漸行求覓至仙人所，語仙人言：『知不？",
        "translation": "Yueyi then, the king went to the river's edge, gradually searched for and found the immortal, and said to him, 'Do you know it?'",
        "source": "T22n1428_046:0911a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我家無兒，若汝等能求願生我家者命終便得生，若生我家者五欲自恣快樂無乏。』",
        "translation": "'My family has no children, but if you can vow to be born in my family, you'll be born at the end of your lives; if you're born in my family, you'll have the five desires, freedom, and happiness, and there'll be no lack of them.'",
        "source": "T22n1428_046:0911a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人答言：『可爾。』",
        "translation": "The sage replied, 'So it is.'",
        "source": "T22n1428_046:0911a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王月益歡喜還歸。",
        "translation": "The king then returned to his home rejoicing in the benefits of the moon.",
        "source": "T22n1428_046:0911a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時一仙人於後七日命終，即處彼第一夫人胎中。",
        "translation": "Seven days after his death, an immortal man was put into the first woman's womb.",
        "source": "T22n1428_046:0911a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人有三種智：知有娠時、知所從得、知男子有欲意看。",
        "translation": "A woman has three kinds of knowledge: knowing when she's pregnant, knowing what she's getting, and knowing when a man has desires and wants to look at her.",
        "source": "T22n1428_046:0911a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時夫人白王言：『王今知不？",
        "translation": "The lady then said to the king, 'Does the king know now?'",
        "source": "T22n1428_046:0911a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今有娠。』",
        "translation": "Now, I'm pregnant.'",
        "source": "T22n1428_046:0911a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『善快，當重供養。』",
        "translation": "The king said, 'Good and quick, you must make heavy offerings.'",
        "source": "T22n1428_046:0911a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即勅一切供具增益一倍。",
        "translation": "He then ordered all the offerings to be doubled.",
        "source": "T22n1428_046:0911a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時第二仙人七日復命終，即處第二夫人胎中。",
        "translation": "When the second sage's life ended seven days later, she was in the second wife's womb.",
        "source": "T22n1428_046:0911a15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人白王：『王今知不？",
        "translation": "The lady said to the king, 'Does the king know now?'",
        "source": "T22n1428_046:0911a16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今有娠。』",
        "translation": "'Now I'm pregnant.'",
        "source": "T22n1428_046:0911a17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即增供具如上。",
        "translation": "The king then made additional offerings as above.",
        "source": "T22n1428_046:0911a17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王即遣人往看修羅吒河邊有幾仙人？",
        "translation": "The king then sent someone to see how many sages were there at the river Xurāṣa?",
        "source": "T22n1428_046:0911a18_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使即往看，見二仙人已死，即還白王言：『仙人已死。』",
        "translation": "The ambassador went to see them, and when he saw that the two sages had died, he returned to the king and said, 'The sages have died.'",
        "source": "T22n1428_046:0911a19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自念言：『彼二仙人命終，生我二夫人胎中。』",
        "translation": "The king thought to himself, 'Those two sages were born in the womb of my two wives when their lives ended.'",
        "source": "T22n1428_046:0911a20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼九月滿，生一男兒顏貌端正。",
        "translation": "When the ninth month was complete, he gave birth to a boy with a handsome face.",
        "source": "T22n1428_046:0911a21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王第一夫人生男兒時，眾善自至，有五百賈客來至。",
        "translation": "When the king's first wife gave birth to the boy, a multitude of good people arrived, and five hundred merchants came.",
        "source": "T22n1428_046:0911a22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百賈客從海取寶而還，有五百伏藏悉自發出，有五百死囚從獄得出。",
        "translation": "Five hundred of those guests took treasure from the sea and returned, five hundred ambushes were released on their own, and five hundred prisoners from death row were released from prison.",
        "source": "T22n1428_046:0911a23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王月益自思惟言：『當為此兒作何等字？』",
        "translation": "The king then thought to himself, 'What kind of words will he make for this son?'",
        "source": "T22n1428_046:0911a25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國法，若初生男兒，或父母若沙門婆羅門作字。",
        "translation": "According to the rules of that country, if a boy is first born, his parents or an ascetic or a brāhmaṇa should write his name.",
        "source": "T22n1428_046:0911a26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王自念：『何須沙門婆羅門作字為？",
        "translation": "The king then thought to himself, 'Why do I need an ascetic or a brāhmaṇa to make a name?'",
        "source": "T22n1428_046:0911a27_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兒生日，多有善事現，即字為善行。』",
        "translation": "On this child's birthday, many good deeds will take place, which is called good conduct.'",
        "source": "T22n1428_046:0911a28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王即與四種母：一者治身，二者洗浴浣濯，三者與乳，四者當為娛樂。",
        "translation": "The king then gave four kinds of mothers: one to treat his body, two to wash and rinse him, three to give him milk, and four to entertain him.",
        "source": "T22n1428_046:0911a28_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象馬車乘作眾伎樂種種戲笑，又持孔雀尾在後，如是嚴飾娛樂。",
        "translation": "He was entertained by elephants, horses, chariots, vehicles, and music, and he carried the peacock's tail behind him, decorating it in this way.",
        "source": "T22n1428_046:0911b01_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善行王子年至八九，教種種技藝、書數、印畫、戲笑、歌舞、伎樂，又學騎象馬車乘、射御鬪戰之事，時彼王子一切皆學。",
        "translation": "When he reached the age of eight or nine, the Prince of Good Conduct taught various skills, writing, numbering, printing, laughing, singing, dancing, and music, as well as riding elephants, horses, chariots, and vehicles, and shooting and fighting, and that prince learned them all.",
        "source": "T22n1428_046:0911b03_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王第二夫人生子，時多有眾惡事起，野干鳴、阿修羅捉日、五百應死者來至。",
        "translation": "When the king's second wife gives birth to a son, many bad things arise, and a wild trunk cries out, an asura catches the sun, and 500 people who should die come.",
        "source": "T22n1428_046:0911b05_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國法，若初生兒，當令沙門婆羅門作字。",
        "translation": "According to the rules of that country, if a child is first born, an ascetic or brāhmaṇa should be made to write a name.",
        "source": "T22n1428_046:0911b07_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自念言：『何須沙門婆羅門作字為？",
        "translation": "The king thought to himself, 'Why do I need an ascetic or brāhmaṇa to write letters?'",
        "source": "T22n1428_046:0911b08_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兒生日，多眾惡事出，即字之為惡行。』",
        "translation": "When this child's birthday comes, many bad deeds will occur, which is called bad behavior.'",
        "source": "T22n1428_046:0911b09_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王亦復與四母：一者治身，二者洗浴浣濯，三者與乳，四者當為娛樂。",
        "translation": "The king also gives four mothers: one to treat his body, two to wash and rinse him, three to give him milk, and four to entertain him.",
        "source": "T22n1428_046:0911b10_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象馬車乘、作眾伎樂、種種戲笑，乃至教學鬪戰之事。",
        "translation": "He would ride in a carriage with elephants and horses, perform tricks and music, and engage in various kinds of laughter, and even teach them how to fight.",
        "source": "T22n1428_046:0911b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行王子，王甚愛念，及諸餘小國王子、夫人、大臣、侍從，一切人民亦無不愛念。",
        "translation": "The king then takes great delight in the good-acting prince, and there are princes, wives, ministers, attendants, and all the people of other small states who don't take delight in him.",
        "source": "T22n1428_046:0911b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而惡行王子，王不愛念，諸餘一切亦不愛念。",
        "translation": "The king didn't think fondly of the prince of bad behavior, nor did he think fondly of any of the others.",
        "source": "T22n1428_046:0911b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行王子，作如是念：『善行王子，王及一切人民甚愛念之；而我獨爾，王不愛念，及餘一切亦不愛念。",
        "translation": "The misbehaving prince then had this thought, 'The king and all his people greatly desire the good-behaving prince, but I alone am not loved by the king, nor by any of the others.",
        "source": "T22n1428_046:0911b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我伺求方便當斷其命。』",
        "translation": "I'll seek a way to cut off his life.'",
        "source": "T22n1428_046:0911b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時隣國王月第一夫人生女，即遣使來至月益王所語言：『我第一夫人生女，當與汝兒善行作婦。』",
        "translation": "\"It was then that the neighboring king, the first wife of Yue, gave birth to a daughter, and he sent a messenger to King Yueyi saying, 'My first wife has given birth to a daughter who will be a wife to your son Suna.'",
        "source": "T22n1428_046:0911b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於異時善行王子作如是念：『閻浮提眾生皆多貧苦，我當入海取如意珠，令閻浮提眾生無有貧者。』",
        "translation": "At the same time, Prince Shanxing had this thought, 'All the sentient beings in Jambudvīpa are poor and suffering, so I will go into the ocean and get the wish-granting pearl so that there won't be any poor sentient beings in Jambudvīpa.'",
        "source": "T22n1428_046:0911b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時即至王所白言：『閻浮提眾生皆多貧苦，我欲入海取如意珠，令閻浮提眾生無有貧者。』",
        "translation": "He then went to the king and said, 'The sentient beings of Jambudvīpa are all poor and suffering, so I want to go into the ocean and get the wish-granting pearl so that the sentient beings of Jambudvīpa won't have to be poor.'",
        "source": "T22n1428_046:0911b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即答言：『我大有金銀七寶無數，庫藏盈滿，可隨意所與。』",
        "translation": "The king then answered, 'I have a large treasury full of gold, silver, and seven treasures that can be given as I like.'",
        "source": "T22n1428_046:0911b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即答王言：『不能，必欲入大海取如意珠，令閻浮提眾生無有貧者。』",
        "translation": "He answered the king, 'No, I must go into the ocean and get the wish-granting pearl so that the sentient beings of Jambudvīpa won't have to be poor.'",
        "source": "T22n1428_046:0911b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『隨汝意。』",
        "translation": "The king said, 'As you wish.'",
        "source": "T22n1428_046:0911b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行王子即作是念：『今正是時，可得其便而斷其命。』",
        "translation": "The misbehaving prince then thought, 'Now is the right time to get an advantage and cut off their lives.'",
        "source": "T22n1428_046:0911b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即至王所白王言：『善行是我所敬重，今欲入海，若我不見將恐喪命，今欲與相隨入海。』",
        "translation": "He went to the king and said, 'I respect that good conduct, and now I want to go into the ocean; if I don't see it, I'm afraid I'll lose my life, so now I want to go into the ocean with him.'",
        "source": "T22n1428_046:0911c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『隨意。』",
        "translation": "The king said, 'As you wish.'",
        "source": "T22n1428_046:0911c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王子與王及夫人眷屬辭別已，往詣修婆羅城中，搖鈴唱言：『誰能捨離父母、妻子、兄弟、姊妹，及諸親屬，欲須金銀珍寶無價寶珠者，隨我入海，一切所須飲食莊嚴之具，我當供給。』",
        "translation": "After bidding farewell to the king and his wife's retinue, the prince went to the city of Śubhāra, rang a bell, and called out, 'Whoever wishes to part with their father, mother, wife, brother, sister, and other relatives and needs gold, silver, precious metals, and priceless jewels, follow me into the ocean, and I'll provide them with whatever food and drink they need to adorn themselves.'",
        "source": "T22n1428_046:0911c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時即有五百賈客來集其所。",
        "translation": "Thereupon, five hundred merchants came and gathered at his place.",
        "source": "T22n1428_046:0911c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行與五百賈客俱至須波羅城，於彼城中買船并求船師。",
        "translation": "Shanxing and the five hundred merchants then went to the city of Subaratna, where they bought a boat and asked for a boat master.",
        "source": "T22n1428_046:0911c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "船師知海中諸難：涌浪難、洄澓難、大魚難，莊嚴船已，復重唱令如上，即放船入海。",
        "translation": "Knowing the difficulties of the ocean: the difficulty of rough seas, the difficulty of migrating seas, and the difficulty of large fish, the boat master adorned the boat and repeatedly commanded it to enter the ocean as above.",
        "source": "T22n1428_046:0911c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以善行福德故，風吹其船詣七寶所，告諸賈人言：『今已至寶渚，好牢堅莊船，自恣取寶滿船勿令沈沒。』",
        "translation": "Because of the merit of good actions, the wind blew the boat to the place of the seven treasures, and he told the caravan masters, 'Now that you've reached the islet of treasures, adorn the boat well and firmly, and take care to fill it with treasures so that it doesn't sink.'",
        "source": "T22n1428_046:0911c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸賈人受教取寶。",
        "translation": "The noble men then were instructed to take the treasure.",
        "source": "T22n1428_046:0911c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善行教授眾賈人已，更詣餘處。",
        "translation": "After his good conduct taught the noblemen, he went to another place.",
        "source": "T22n1428_046:0911c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡行王子以惡言向眾賈人說之：『善行王子若安隱還至，當奪汝等寶。",
        "translation": "The misbehaving prince told the noble men with harsh words, 'If the well-behaving prince returns peacefully, he'll take your treasures.",
        "source": "T22n1428_046:0911c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼今未還，可推船置海而去。』",
        "translation": "Now, if he hasn't returned, he can push his boat out to sea and leave.'",
        "source": "T22n1428_046:0911c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行說五百賈人，賈人已受其說，推船入海而去。",
        "translation": "The evil action then spoke to 500 rich men, who accepted his words, pushed their boats into the sea, and departed.",
        "source": "T22n1428_046:0911c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼薄福果報，風破其船，五百賈人沒海而死，惡行王子得一船板，風吹展轉得還趣岸，彼於海邊在貧賤聚落，家家乞食自活。",
        "translation": "As the result of their poor fortune, the wind broke their boat, and the five hundred noble people sank into the sea and died. The evil-doing prince got a plank of the boat, which the wind blew around and allowed him to return to the shore of his destination.",
        "source": "T22n1428_046:0911c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行還至故處，不見眾賈人亦不見船，即便椎胸啼泣懊惱，恐諸賈人為惡鬼羅剎等所害。",
        "translation": "When Suna returned to his old place, he didn't see the noble people or the boat, so he beat his chest and lamented in anguish, fearing that the noble people might be harmed by bad spirits or rājas.",
        "source": "T22n1428_046:0911c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時寶渚神語善行言：『五百賈人非惡鬼羅剎等所害，是惡行王子惡言破壞五百賈人，使推船入海而去。",
        "translation": "The god Baoche said to Suna, 'The five hundred caravans aren't harmed by bad spirits or rājasas, but that's the way the evil prince destroyed the five hundred caravans with his bad words, pushing the boat into the ocean and sending it away.",
        "source": "T22n1428_046:0911c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薄福果報風破其船，五百賈人沒海而死。",
        "translation": "The wind broke their boat as the result of their weak fortune, and the five hundred noble people sank into the ocean and died.",
        "source": "T22n1428_046:0911c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡行王子得一船板，風吹至岸，彼於海邊乞食自活。』",
        "translation": "The misbehaving prince gets a plank of the boat, and the wind blows it to shore where it begs for food and lives on its own.'",
        "source": "T22n1428_046:0911c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善行自念：『我今寧可前至海龍王宮乞如意珠。』",
        "translation": "The good conductor thinks to himself, 'Now, I'd better go to the palace of the dragon king in the ocean and beg for a wish-granting pearl.'",
        "source": "T22n1428_046:0911c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便引道而去到羅剎渚。",
        "translation": "He then led the way and went to Rāṣṭrapāla.",
        "source": "T22n1428_046:0912a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時五百羅剎女出迎，遙見慰問：『善來童子！",
        "translation": "Five hundred Rāṣṭrapāla women then came out to meet them, looking over and greeting them, 'Well come, boy!",
        "source": "T22n1428_046:0912a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲至何所？』",
        "translation": "Where do you want to go?'",
        "source": "T22n1428_046:0912a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『閻浮提眾生皆多貧苦，欲往海龍王宮乞如意寶珠，令閻浮提眾生無貧苦者。』",
        "translation": "He answered, 'All the sentient beings in Jambudvīpa are poor and suffering, so I want to go to the palace of the dragon king of the ocean and ask for a wish-granting jewel so that the sentient beings in Jambudvīpa won't be poor and suffering.'",
        "source": "T22n1428_046:0912a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即復問言：『欲取何乘？』",
        "translation": "Again, he asked, 'What vehicle do you want to take?'",
        "source": "T22n1428_046:0912a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『欲取大乘。』",
        "translation": "She replied, 'I want to acquire the great vehicle.'",
        "source": "T22n1428_046:0912a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅剎女言：『善哉！",
        "translation": "The Rāṣṭrapāla woman said, 'Good!",
        "source": "T22n1428_046:0912a06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若汝成最正覺，我當出家作汝弟子。』",
        "translation": "If you become most truly enlightened, I will leave home and become your disciple.'",
        "source": "T22n1428_046:0912a06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：『可爾。』",
        "translation": "They replied, 'Yes, I will.'",
        "source": "T22n1428_046:0912a07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼遙見金城中有一金床，龍坐其上。",
        "translation": "He saw a golden bed in a distant golden city, and a dragon was sitting on it.",
        "source": "T22n1428_046:0912a08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行王子即往金城至彼龍所。",
        "translation": "The Prince of Good Conduct then went to the golden city and went to that dragon's place.",
        "source": "T22n1428_046:0912a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時龍王遙見慰問：『善來童子！",
        "translation": "The dragon king then looked into the distance and asked, 'Well come, boy!",
        "source": "T22n1428_046:0912a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？』",
        "translation": "Where do you want to go?'",
        "source": "T22n1428_046:0912a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『龍王知不？",
        "translation": "He replied, 'Does the dragon king know?'",
        "source": "T22n1428_046:0912a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提眾生皆多貧苦，我欲至海龍王宮取如意珠，令閻浮提人無有貧苦。』",
        "translation": "Since sentient beings in Jambudvīpa are often poor and suffering, I want to go to the palace of the dragon king of the ocean and obtain the wish-granting pearl so that the people of Jambudvīpa won't be poor and suffering.'",
        "source": "T22n1428_046:0912a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即答言：『海龍王宮難可得至，七日中行水常至膝，復七日中行水至臍，七日中行水至腋，七日中浮而過，七日中行蓮華上，七日中行毒蛇頭上，然後乃至海龍王宮。",
        "translation": "They then replied, 'It's difficult to reach the palace of the sea dragon king, but for seven days I'll walk on water that always reaches my knees, another seven days I'll walk on water that reaches my navel, seven days I'll walk on water that reaches my armpit, seven days I'll float by, seven days I'll walk on a lotus flower, seven days I'll walk on the head of a viper, and then I'll go to the palace of the sea dragon king.",
        "source": "T22n1428_046:0912a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今可止，我有寶珠，能雨東方二千由旬七寶，今當與汝。』",
        "translation": "Now, you can stop there; I have a precious pearl that can rain seven treasures 2,000 yojanas to the east, and I will give it to you now.'",
        "source": "T22n1428_046:0912a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『不取，要當至海龍王宮。』",
        "translation": "He replied, 'No, I won't take it; I'll go to the palace of the dragon king of the ocean.'",
        "source": "T22n1428_046:0912a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即復問言：『欲取何乘？』",
        "translation": "Then he asked, 'What vehicle do you want to take?'",
        "source": "T22n1428_046:0912a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『欲取大乘。』",
        "translation": "He replied, 'I want to acquire the great vehicle.'",
        "source": "T22n1428_046:0912a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復言：『若汝成最正覺者，我當出家為汝作第一智慧弟子。』",
        "translation": "Again, he said, 'If you become the most truly enlightened, I will leave home and become your first disciple of wisdom.'",
        "source": "T22n1428_046:0912a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即捨金城。",
        "translation": "He then dismounted from the city of gold.",
        "source": "T22n1428_046:0912a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙見銀城中有龍王在銀床上坐。",
        "translation": "From a distance, he saw a dragon king sitting on a bed of silver in the city of silver.",
        "source": "T22n1428_046:0912a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行王子往詣銀城至龍王所，龍王遙見慰問：『善來童子！",
        "translation": "The Prince of Good Conduct then went to the silver city and went to the dragon king, who looked at him from a distance and asked, 'Well come, boy!",
        "source": "T22n1428_046:0912a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？』",
        "translation": "Where do you want to go?'",
        "source": "T22n1428_046:0912a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『龍王知不？",
        "translation": "He replied, 'Does the dragon king know?'",
        "source": "T22n1428_046:0912a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提眾生皆多貧苦，我欲至海龍王宮取如意珠，令閻浮提人無有貧苦。』",
        "translation": "Since sentient beings in Jambudvīpa are often poor and suffering, I want to go to the palace of the dragon king of the ocean and get the wish-granting pearl so that the people of Jambudvīpa won't be poor and suffering.'",
        "source": "T22n1428_046:0912a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『海龍王宮難可得至，七日中行水常至膝，七日中至臍，七日中至腋，七日中浮過，七日中行蓮華上，七日中行毒蛇頭上，然後乃至海龍王宮。",
        "translation": "He replied, 'It's difficult to reach the palace of the sea dragon king, but for seven days I'll walk on water that always reaches my knees, seven days it reaches my navel, seven days it reaches my armpits, seven days it floats by, seven days it walks on a lotus flower, seven days it walks on the head of a viper, and then I'll reach the palace of the sea dragon king.",
        "source": "T22n1428_046:0912a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今可止，我有寶珠，能雨南方四千由旬七寶，今當與汝。』",
        "translation": "Now, you can stop there; I have a precious pearl that rains seven treasures for 4,000 yojanas to the south, and I will give it to you now.'",
        "source": "T22n1428_046:0912a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『不取，我要當至海龍王宮。』",
        "translation": "He replied, 'No, I won't take it; I'll go to the palace of the sea dragon king.'",
        "source": "T22n1428_046:0912b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即復問言：『欲取何乘？』",
        "translation": "Then he asked, 'What vehicle do you want to take?'",
        "source": "T22n1428_046:0912b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『欲取大乘。』",
        "translation": "He replied, 'I want to acquire the great vehicle.'",
        "source": "T22n1428_046:0912b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復言：『汝若成最正覺者，我當出家為汝作第一神足弟子。』",
        "translation": "Again, he said, 'If you become the most truly enlightened one, I will leave home and become your first disciple with miraculous abilities.'",
        "source": "T22n1428_046:0912b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即捨銀城去。",
        "translation": "He then left the silver city and went away.",
        "source": "T22n1428_046:0912b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復見有琉璃城，有龍王坐如上，即與如意珠能雨西方六千由旬寶。",
        "translation": "Again, he saw a beryl city with a dragon king sitting like that, and he gave it a wish-granting pearl that could rain 6,000 yojanas of treasure in the west.",
        "source": "T22n1428_046:0912b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『不取，我要當至海龍王宮。』",
        "translation": "He replied, 'No, I won't take it; I'll go to the palace of the dragon king of the ocean.'",
        "source": "T22n1428_046:0912b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問言：『欲取何乘？』",
        "translation": "Again, he asked, 'What vehicle do I want to take?'",
        "source": "T22n1428_046:0912b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『欲取大乘。』",
        "translation": "He replied, 'I want to acquire the great vehicle.'",
        "source": "T22n1428_046:0912b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『若汝成最正覺時，我當出家為汝作第一多聞弟子。』",
        "translation": "'When you become most truly enlightened, I will leave home and become the best well-versed disciple for you.'",
        "source": "T22n1428_046:0912b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行即復前行，七日中水至於膝，乃至行蓮花上，乃至毒蛇處，作如是念：『以何行報生毒蛇中，豈非前世瞋毒報耶？",
        "translation": "Sunetra then went on to walk seven days in water up to his knees, up to walking on a lotus flower, and up to a viper, thinking, 'What is the reward of my actions that I was born among vipers, and isn't it the poisonous reward of anger from a previous life?'",
        "source": "T22n1428_046:0912b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以何法而降伏之？",
        "translation": "What method will be used to subdue them?",
        "source": "T22n1428_046:0912b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有慈心。』",
        "translation": "'There's only a compassionate mind.'",
        "source": "T22n1428_046:0912b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即思惟慈心三昧。",
        "translation": "He then contemplated the samādhi of a compassionate mind.",
        "source": "T22n1428_046:0912b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸毒蛇皆悉垂頭，行上而過，至海龍王宮。",
        "translation": "The vipers then all hung their heads and marched up and over to the palace of the sea dragon king.",
        "source": "T22n1428_046:0912b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時海龍王遙見慰問言：『善來童子！",
        "translation": "The sea dragon king then looked at them from a distance and greeted them, saying, 'Good boy!",
        "source": "T22n1428_046:0912b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何所須欲？』",
        "translation": "What is there to desire?'",
        "source": "T22n1428_046:0912b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『我今欲得汝髻中如意寶珠。』",
        "translation": "He answered, 'Now, I want to obtain the wish-granting jewel in your topknot.'",
        "source": "T22n1428_046:0912b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『汝等短壽，此珠價大，非不相與。",
        "translation": "He replied, 'You're short-lived, and this pearl is too valuable not to share with you.",
        "source": "T22n1428_046:0912b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當與汝，但汝命欲終時，還送珠來。』",
        "translation": "I will give it to you now, but when your life is about to end, return the pearl.'",
        "source": "T22n1428_046:0912b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即解珠與之，并遣二龍，後持珠還。",
        "translation": "He then untied the pearl and gave it to him, sent two dragons, and returned with the pearl.",
        "source": "T22n1428_046:0912b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行捉珠求願言：『若是如意珠者，便當忽然還至修波羅城。』",
        "translation": "He then asked Shanxing for the pearl and vowed, 'If this is the wish-granting pearl, then I will suddenly return it to Cūḷaśubhara.'",
        "source": "T22n1428_046:0912b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如意念頃即還修波羅城。",
        "translation": "In an instant's thought, he returned to the city of Cūḷauparatha as he wished.",
        "source": "T22n1428_046:0912b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時惡行王子，聞善行從海安隱而還，即往善行所語言：『汝知不？",
        "translation": "\"When the prince of evil actions heard that Sunetra had returned from the sea in peace, he went to Sunetra and said, 'Do you know that?'",
        "source": "T22n1428_046:0912b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今在貧窮聚落，家家乞食以自生活。",
        "translation": "Now, I'm in a poor village, living from house to house on alms.",
        "source": "T22n1428_046:0912b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝從大海安隱而還，為何所得耶？』",
        "translation": "What did you get when you returned from the ocean in peace?'",
        "source": "T22n1428_046:0912b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即答言：『得此如意寶珠來。』",
        "translation": "He replied, 'Here's the wish-granting jewel.'",
        "source": "T22n1428_046:0912b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行語言：『我今疲極，欲小眠息。』",
        "translation": "Suna then said, 'I'm so tired now that I want to take a nap.'",
        "source": "T22n1428_046:0912b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即枕惡行膝上而眠。",
        "translation": "He then put his pillow on Rāṣṭrapāla's knee and slept.",
        "source": "T22n1428_046:0912b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行即以佉陀羅木刺刺其兩眼，持珠而去。",
        "translation": "The evil practitioner then pierced his eyes with a Khadira wood thorn, held the pearl, and departed.",
        "source": "T22n1428_046:0912b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼傷兩眼血流污身，東西慞惶行不見道，遂至月王園中。",
        "translation": "Bleeding from the wound in both eyes, he was perplexed and unable to see the road as he walked east and west, and then he went to the moon king's garden.",
        "source": "T22n1428_046:0912b28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守園老母有二小兒，遙見其來血流污身行不見道，即愍傷之，問言：『汝何故乃於月王園中行東西慞惶而不見道？』",
        "translation": "When the old mother guarding the garden had two small children, she saw them coming, bleeding and stained, and unable to see the road, so she took pity on them and asked, 'Why are you walking east and west in the moon king's garden, perplexed and unable to see the road?'",
        "source": "T22n1428_046:0912b29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即具為說因緣。",
        "translation": "She then explained the causes and conditions for them in full.",
        "source": "T22n1428_046:0912c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "老母語言：『我有二兒，可共汝戲。",
        "translation": "The old mother said, 'I have two sons who could play with you.",
        "source": "T22n1428_046:0912c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今可在此住，當相看視，猶如二兒。』",
        "translation": "Now, you may stay here and look at each other as if they were two sons.'",
        "source": "T22n1428_046:0912c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行即還修羅吒城，至王月益所，白王言：『王今知不？",
        "translation": "Śrāvastī then returned to the city of Śūra and went to King Yueyi and said to him, 'Does the king know now?'",
        "source": "T22n1428_046:0912c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我海中遇大風破船，五百賈人沒在海中，唯我安隱而還。』",
        "translation": "A great wind broke my ship in the middle of the ocean, and five hundred of my men were sunken into the sea, but I was the only one who returned unharmed.'",
        "source": "T22n1428_046:0912c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『汝從海安隱而還，為得何等？』",
        "translation": "The king said, 'What did you get when you returned from the sea unharmed?'",
        "source": "T22n1428_046:0912c07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『得此如意寶珠。』",
        "translation": "He replied, 'Obtain this wish-granting jewel.'",
        "source": "T22n1428_046:0912c08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即問言：『此珠何所能作耶？』",
        "translation": "The king then asked, 'What can be made with this pearl?'",
        "source": "T22n1428_046:0912c09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『不知。』",
        "translation": "He replied, 'I don't know.'",
        "source": "T22n1428_046:0912c09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王即取珠付藏，賞之。",
        "translation": "The king then took the pearl, gave it to the treasure house, and rewarded it.",
        "source": "T22n1428_046:0912c10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行即遣使語隣國王月：『善行與五百賈人入海取寶，水所漂沒，汝今可與我女。』",
        "translation": "Ngoc Hung then sent an envoy to the king of the neighboring kingdom, saying, 'Ngoc Hung and 500 of his men went into the ocean to retrieve the treasure, and it was lost in the water; now you can give it to my daughter.'",
        "source": "T22n1428_046:0912c10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即報言：『須我語女。』",
        "translation": "The king then replied, 'I need to speak to the woman.'",
        "source": "T22n1428_046:0912c12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即喚女告之：『善行與五百賈人入海取寶為水所漂，惡行安隱而還，今欲索汝為婦。』",
        "translation": "The king then summoned his daughter and told her, 'Good conduct and five hundred other men went into the sea to get treasure and were swept away by the water; my bad conduct returned in peace, and now I want to claim you as my wife.'",
        "source": "T22n1428_046:0912c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『不能，我欲自出求夫。』",
        "translation": "She replied, 'No, I want to go out on my own and ask for a husband.'",
        "source": "T22n1428_046:0912c15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王即令國中皆令聚集；莊嚴其女，出外東西求覓夫。",
        "translation": "The king then caused the whole country to assemble, adorn their women, and go out to seek a husband.",
        "source": "T22n1428_046:0912c16_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行即調其琴而彈之，出美音聲在園中住。",
        "translation": "She then tuned her lute, played it, and produced a beautiful sound while staying in the garden.",
        "source": "T22n1428_046:0912c17_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王女見之，即往白王言：『王今知不？",
        "translation": "When the king's daughter saw this, she went to the king and said, 'Does the king know now?'",
        "source": "T22n1428_046:0912c18_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲得此人為夫。』",
        "translation": "I want to have this person as my husband.'",
        "source": "T22n1428_046:0912c19_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『此是盲人。』",
        "translation": "The king said, 'This is a blind man.'",
        "source": "T22n1428_046:0912c19_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女答王言：『無苦。』",
        "translation": "The woman answered the king, 'There's no suffering.'",
        "source": "T22n1428_046:0912c20_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王月即喚善行，問言：『童子！",
        "translation": "The king then summoned Suna and asked, 'Boy!",
        "source": "T22n1428_046:0912c20_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝是何人？』",
        "translation": "Who are you?'",
        "source": "T22n1428_046:0912c21_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『王今知不？",
        "translation": "He replied, 'Does the king know now?'",
        "source": "T22n1428_046:0912c21_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是王月益第一太子善行。』",
        "translation": "I'm the king's moon-benefiting first prince of good conduct.'",
        "source": "T22n1428_046:0912c21_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『何故傷眼耶？』",
        "translation": "The king said, 'Why is your eye injured?'",
        "source": "T22n1428_046:0912c22_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以上因緣具白王。",
        "translation": "He then explained all of the above causes and conditions to the king.",
        "source": "T22n1428_046:0912c22_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『汝若是王月益子者，今當發願令眼平復。』",
        "translation": "The king said, 'If you are the king's moon-helping son, now you must give rise to the vow to make your eyes even.'",
        "source": "T22n1428_046:0912c23_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善行即發善願：『若我為閻浮提眾生貧苦苦厄故，入海求如意寶珠，欲令閻浮提眾生無有窮乏，并及惡行王子，以惡言破壞五百賈人，捨我而還。",
        "translation": "Suna then made a good vow, 'Suppose I went into the ocean to search for the wish-granting jewel for the sake of the sentient beings in Jambudvīpa who are suffering from poverty and distress, in order to make it so that there's no lack of sentient beings in Jambudvīpa and that misbehaving princes will abandon me and return after destroying 500 caravans with their harsh words.",
        "source": "T22n1428_046:0912c24_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以佉陀羅木刺破我兩眼，持我如意珠而還，我於彼人無有惡心。",
        "translation": "They also pierced my eyes with a khadira tree and returned with my wish-granting pearl.",
        "source": "T22n1428_046:0912c28_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我真誠無虛者，眼當平復如故。』",
        "translation": "If I'm sincere and not false, my eyes will be level as before.'",
        "source": "T22n1428_046:0912c29_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時發願亦竟眼尋平復。",
        "translation": "He then fulfilled his vow and had his eyes repaired.",
        "source": "T22n1428_046:0913a01_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王即極好莊嚴其女以適之。",
        "translation": "The king then bestowed his daughter's adornment to suit her.",
        "source": "T22n1428_046:0913a02_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即遣使，語王月益言：『汝今知不？",
        "translation": "The king then sent an envoy, which told King Yueyi, 'Do you know now?'",
        "source": "T22n1428_046:0913a02_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子善行，安隱從海而還，今極好莊嚴，我女以適之，今當往修羅吒城。』",
        "translation": "The prince is well-traveled, has returned from the sea in comfort, and is now very well-decorated; my daughter is suitable for him, and she will now go to the city of Shurāṭha.'",
        "source": "T22n1428_046:0913a03_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王月益即勅國內種種莊嚴。",
        "translation": "King Yueyi then commanded that she be adorned in various ways within the country.",
        "source": "T22n1428_046:0913a05_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是王子善行往修羅吒城，頭面禮王足已，具以因緣白王。",
        "translation": "The prince then went to the city of Siurāṭha, paid homage to the king's feet with his head and face, and presented the king with all the reasons for his visit.",
        "source": "T22n1428_046:0913a06_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即勅人殺惡行。",
        "translation": "The king then commanded the people to kill bad deeds.",
        "source": "T22n1428_046:0913a07_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善行白王言：『願不須殺。』",
        "translation": "Suna said to the king, 'I wish I didn't have to kill them.'",
        "source": "T22n1428_046:0913a08_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王月益遣惡行令出國，善行問王言：『惡行持珠來，今為所在？』",
        "translation": "When King Yueyi sent Aśvajit out of the country, Suna asked the king, 'Aśvajit came with the pearl, where is it now?'",
        "source": "T22n1428_046:0913a08_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『今在庫中。』",
        "translation": "The king said, 'Now it's in the treasury.'",
        "source": "T22n1428_046:0913a10_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白王言：『可出珠。』",
        "translation": "He said to the king, 'You may release the pearl.'",
        "source": "T22n1428_046:0913a10_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即出珠。",
        "translation": "The king then released the pearl.",
        "source": "T22n1428_046:0913a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善行即淨洗浴身著新白淨衣，取珠安置幢頭，著高好殿上，發願言：『若審是如意寶珠者，當雨滿閻浮提七寶，其有病者皆令除愈。』",
        "translation": "Well-conducted, he then purified himself, washed himself, put on his new white, pure clothes, took the pearl, placed it at the head of a banner, put it on a high, well-built hall, and vowed, 'If I were to examine this wish-granting pearl, it would rain down seven treasures all over Jambudvīpa, and all those who are sick would be healed.'",
        "source": "T22n1428_046:0913a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發願頃間即雨滿閻浮提七寶。",
        "translation": "Within moments of making the vow, it was raining down the seven treasures of Jambudvīpa.",
        "source": "T22n1428_046:0913a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「後於異時，王月益喪，即以善行為王。",
        "translation": "\"At some point later, the king's moon grew short, and he adopted good conduct as his king.",
        "source": "T22n1428_046:0913a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王子惡行，來至善行所白言：『我今在外，家家乞食以自存活。』",
        "translation": "The prince then, acting evilly, came to Suna and said, 'Now, I'm out here, begging for food from home to survive.'",
        "source": "T22n1428_046:0913a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王答言：『汝可守護我頭，當以我所食與汝。』",
        "translation": "The king answered, 'You can guard my head, and I'll give you what I eat.'",
        "source": "T22n1428_046:0913a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答王言：『爾。』",
        "translation": "He replied to the king, 'So it is.'",
        "source": "T22n1428_046:0913a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於異時，王小眠睡，惡行念言：『今可斷命。』",
        "translation": "At another time, the king was asleep when he had a bad action and said, 'Now I can cut off my life.'",
        "source": "T22n1428_046:0913a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即拔刀斫之。",
        "translation": "He then pulled out his sword and chopped it.",
        "source": "T22n1428_046:0913a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行臂尋自墮，即自稱禍。",
        "translation": "He then looked for his arm and fell on it, and he declared himself to be in trouble.",
        "source": "T22n1428_046:0913a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王便覺問言：『童子何故稱禍？』",
        "translation": "The king then realized it and asked, 'Why did the boy call it misfortune?'",
        "source": "T22n1428_046:0913a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答王言：『天自造其業。』",
        "translation": "He answered the king, 'The gods themselves create their own karma.'",
        "source": "T22n1428_046:0913a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『何故耶？』",
        "translation": "The king said, 'Why is that?'",
        "source": "T22n1428_046:0913a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此因緣白王。",
        "translation": "He told the king about this cause and condition.",
        "source": "T22n1428_046:0913a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『實是汝自造其業。』」",
        "translation": "The king said, 'It's really you who created your own karma.'\"",
        "source": "T22n1428_046:0913a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「王月益者豈異人乎！",
        "translation": "The Buddha addressed the monks, \"Wouldn't the king's monthly benefit be different from someone else's?",
        "source": "T22n1428_046:0913a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今白淨王是。",
        "translation": "\"The present-day King Baisin is this.",
        "source": "T22n1428_046:0913a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一夫人者，即今母摩耶是。",
        "translation": "The First Lady, this is the present Māya.",
        "source": "T22n1428_046:0913a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時月王者，今執仗釋種是。",
        "translation": "The then-Moon King, this is the present-day Śākyamuni.",
        "source": "T22n1428_046:0913a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時月王女者，今瞿夷是。",
        "translation": "The then-Moon King's daughter, the present-day Ghoṣa.",
        "source": "T22n1428_046:0913a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守園老母者，今摩訶波闍波提比丘尼是。",
        "translation": "The then old mother who guarded the garden was the present-day Mahāprajāpatī bhikṣuṇī.",
        "source": "T22n1428_046:0913a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二兒者，今難陀、阿難是。",
        "translation": "Those were the two sons, the present-day Nandha and Ānanda.",
        "source": "T22n1428_046:0913a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善行者，我身是。",
        "translation": "I myself was the one who did good actions at the time.",
        "source": "T22n1428_046:0913a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時惡行者，今提婆達多是。",
        "translation": "Someone who did bad actions at the time, this is now Devadatta.",
        "source": "T22n1428_046:0913a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百賈人者，今五百比丘是。",
        "translation": "The five hundred jahanis are the five hundred monks of today.",
        "source": "T22n1428_046:0913a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔以惡教破此諸人，今亦復以惡教破之。」",
        "translation": "I destroyed these people with bad teaching in the past, and I'll destroy them again with bad teaching now.\"",
        "source": "T22n1428_046:0913b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時優波離即從坐起，偏露右肩、右膝著地，合掌白佛言：「云何破僧？",
        "translation": "Upāli then rose from his seat, bared his right shoulder, knelt on his right knee, put his palms together, and said to the Buddha, \"How did you refute the saṃgha?",
        "source": "T22n1428_046:0913b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齊幾人名為破僧？",
        "translation": "How many of you are called ragtag monks?",
        "source": "T22n1428_046:0913b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰破和合僧？」",
        "translation": "Who refutes the harmony of the saṃgha?\"",
        "source": "T22n1428_046:0913b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「優波離！",
        "translation": "The Buddha said, \"Upāli!",
        "source": "T22n1428_046:0913b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二事破僧：妄語、相似語，以此二事故破僧。",
        "translation": "There are two things that undermine the saṃgha: false speech and similar speech, and these two things undermine the saṃgha.",
        "source": "T22n1428_046:0913b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二事破僧：作羯磨、取舍羅。",
        "translation": "\"There are two other things that undermine the saṃgha: performing karma and taking śāstra.",
        "source": "T22n1428_046:0913b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一比丘不能破僧，雖求方便亦不能破僧，亦非比丘尼，非式叉摩那、沙彌、沙彌尼破僧，雖求方便破僧亦不能破僧。",
        "translation": "A monk can't break the saṃgha, and even though he seeks skillful means, he can't break the saṃgha, nor can a bhikṣuṇī, nor a śrāmaṇer, nor a śrāmaṇī break the saṃgha, nor can he break the saṃgha even though he seeks skillful means to break the saṃgha.",
        "source": "T22n1428_046:0913b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913b10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此眾一比丘、彼眾一比丘，彼行破僧舍羅、作羯磨，如是不能破僧，但令僧塵垢，二人、三人亦如是。",
        "translation": "If one of these monks or one of those monks practices breaking the saṃsāra and performing karma, it won't break the saṃgha but will cause the saṃgha to become dusty, and so it will be with two or three people.",
        "source": "T22n1428_046:0913b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913b12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若此眾四人若過、彼眾四人若過，行破僧舍羅、作羯磨。",
        "translation": "If four of them go against this group and four of them go against that group, they'll perform a karman (karman) that breaks the saṃsāra.",
        "source": "T22n1428_046:0913b12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齊是名為破僧，是為破和合僧。」",
        "translation": "This is called a breach of the saṃgha, and it's a breach of the harmony of the saṃgha.\"",
        "source": "T22n1428_046:0913b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離復問：「破和合僧為得何等？」",
        "translation": "Upāli then asked, \"What is the goal of breaking up the harmony of the saṃgha?\"",
        "source": "T22n1428_046:0913b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「破和合僧者，泥犁中受罪一劫不療。」",
        "translation": "The Buddha said, \"A person who breaks the harmony of a saṃgha will be condemned in the niraya for an eon and won't be cured.\"",
        "source": "T22n1428_046:0913b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「僧破已能和合者得何等？」",
        "translation": "\"After refuting the saṃgha, what will it be like to be able to reconcile it?\"",
        "source": "T22n1428_046:0913b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「得梵天福一劫受樂。」",
        "translation": "The Buddha said, \"Attaining the merit of Brahmā, one eon will be blessed.\"",
        "source": "T22n1428_046:0913b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「眾僧和合樂，　　和合不諍競；　和合則有法，　　常得勤修道；　能和合眾僧，　　一劫受天樂。」",
        "translation": "He spoke a verse, saying, \"It's pleasant for monks to be united, so they don't fight; when they are united, there's the Dharma, and they can always pursue cultivation; those who are united with monks will experience heavenly bliss for one eon.\"",
        "source": "T22n1428_046:0913b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離復問：「一切破僧者皆墮地獄一劫受苦不？」",
        "translation": "Upāli then asked, \"Do all those who break the rules of the saṃgha fall into hell and suffer an eon?\"",
        "source": "T22n1428_046:0913b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語：「優波離！",
        "translation": "Buddha's words, \"Upāli!",
        "source": "T22n1428_046:0913b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切破僧人，不必盡墮地獄受苦一劫。",
        "translation": "All those disruptive monks don't have to end up in hell and suffer an eon of suffering.",
        "source": "T22n1428_046:0913b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘非法言法，堅持此法破和合僧，彼自知非法想破，便作非法想說如是言：『此是法、此是毘尼、是佛所教。』",
        "translation": "If a monk says the teaching without using the Dharma, and insists that this teaching refutes the harmony of the saṃgha, then he knows that his thoughts are refuted by the thinking that they're not the Dharma, and he makes them think and say this, 'This is the Dharma, this is the vinaya, and this is what the Buddha teaches.'",
        "source": "T22n1428_046:0913b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異見畏忍行破僧舍羅。",
        "translation": "Being intimidated by the practice of forbearance in regard to wrong views refutes the saṃgha.",
        "source": "T22n1428_046:0913b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此破僧者，一劫泥犁中受苦不療。",
        "translation": "Someone who thus breaks the saṃgha will go through an eon of suffering in the mire and won't be healed.",
        "source": "T22n1428_046:0913b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘，非法說法，堅持此事，方便破僧，非法想破法想說：『此是法、是毘尼、是佛所教。』",
        "translation": "If a monk unlawfully expounds the Dharma, insists on it, skillfully breaks the saṃgha, and unlawfully conceives of it in order to disparage the Dharma, he says, 'This is the Dharma, this is the vinaya, and this is what the Buddha teaches.'",
        "source": "T22n1428_046:0913b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行破僧舍羅、作羯磨。",
        "translation": "He practices breaking the saṃgha's rules and performing karmas.",
        "source": "T22n1428_046:0913c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是破僧人，一劫泥犁中受苦不療。",
        "translation": "Thus, a person who refutes the saṃgha's views will go through an eon of suffering in the mire and not be cured.",
        "source": "T22n1428_046:0913c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法想破非法想說亦如是。",
        "translation": "The same is true of teaching that conceptions of the Dharma refute conceptions of the non-Dharma.",
        "source": "T22n1428_046:0913c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T22n1428_046:0913c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘非法說法，堅持此事，破和合僧，彼法想破法想說：『此是法、是毘尼、是佛所教。』",
        "translation": "If a monk speaking unlawfully insists on it and breaks the harmony of the saṃgha, his conception of the Dharma breaks the conception of the Dharma, saying, 'This is the Dharma, this is the vinaya, and this is what the Buddha teaches.'",
        "source": "T22n1428_046:0913c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不異見、不異忍，行破僧舍羅、作羯磨。",
        "translation": "Without differing in view or tolerance, he practices breaking the saṃgha's rules and performing karmas.",
        "source": "T22n1428_046:0913c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是優波離！",
        "translation": "Thus, Upāli!",
        "source": "T22n1428_046:0913c07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人不墮地獄一劫受苦。",
        "translation": "This person won't fall into hell and suffer an eon's worth of pain.",
        "source": "T22n1428_046:0913c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疑不疑四句亦如是，非法想疑四句亦如是，如是乃至說不說亦如是。」",
        "translation": "So are the four phrases of doubt and non-doubt, and the four phrases of unlawful conceptualization and doubt, and so it is even if they are explained or not explained.\"",
        "source": "T22n1428_046:0913c08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(破僧揵度具足竟)四分律卷第四十六",
        "translation": "(After fully refuting the saṃgha's gandharva) Four Part Vinaya, Vol. 46",
        "source": "T22n1428_046:0913c10_19",
        "is_bad_quality": false
    }
]