[
    {
        "source_sentence": "十誦律卷第三十四(第五誦之六)",
        "translation": "Ten Recitations, Vol. 34 (Recitation No. 5-6)",
        "source": "T23n1435_034:0242a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦北印度三藏弗若多羅譯",
        "translation": "A Translation of the Latter Qin Northern India Tripiṭaka by Pūrṇa",
        "source": "T23n1435_034:0242a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八法中臥具法第七",
        "translation": "seventh of the eight dharmas of the laying-in of the bosom",
        "source": "T23n1435_034:0242a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城。",
        "translation": "The Buddha was in the city of Rājagṛha.",
        "source": "T23n1435_034:0242a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，互相輕慢無恭敬行。",
        "translation": "At the time, the monks despised each other and didn't conduct themselves respectfully.",
        "source": "T23n1435_034:0242a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見諸比丘互相輕慢無恭敬行，以是因緣故，集比丘僧，問諸比丘：「於汝等意云何？",
        "translation": "When the Buddha saw that the monks despised each other and behaved disrespectfully, he gathered the monks together for this reason and asked them, \"What do you think?",
        "source": "T23n1435_034:0242a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰比丘應作上座，先受水、先受飲食？」",
        "translation": "Who monk should be the elder monk who receives the water and food first?\"",
        "source": "T23n1435_034:0242a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘答言：「世尊！",
        "translation": "A monk replied, \"Bhagavān!",
        "source": "T23n1435_034:0242a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘剎利種，以信出家剃除鬚髮服法衣，是人應先坐、先受水、先受飲食。」",
        "translation": "If a monk of the Śāriputra lineage leaves home with faith and shaves off his hair and puts on the Dharma robe, this person should sit first, receive water first, and eat first.\"",
        "source": "T23n1435_034:0242a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有比丘言：「世尊！",
        "translation": "Another monk said, \"Bhagavān!",
        "source": "T23n1435_034:0242a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘是婆羅門種，以信出家剃除鬚髮服法衣，是人應先坐、先受水、先受飲食。」",
        "translation": "If a monk of the Brāhmaṇa race leaves home with faith and shaves off his hair and puts on the Dharma robe, this person should sit first, receive water first, and eat first.\"",
        "source": "T23n1435_034:0242a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有比丘言：「世尊！",
        "translation": "Another monk said, \"Bhagavān!",
        "source": "T23n1435_034:0242a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘毘舍種，以信出家剃除鬚髮服法衣，是人應先坐、先受水、先受飲食。」",
        "translation": "If a monk of the Vaiśravaṇa school leaves home with faith and shaves off his hair and puts on the Dharma robe, this person should sit first, receive water first, and eat first.\"",
        "source": "T23n1435_034:0242a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有比丘言：「世尊！",
        "translation": "Another monk said, \"Bhagavān!",
        "source": "T23n1435_034:0242b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘得阿羅漢漏盡，所作已辦捨離重擔，盡諸有結能具正智心得解脫，如是比丘應先坐、先受水、先受飲食。」",
        "translation": "If a monk has ended the arhat contaminants, has accomplished what he did, has freed himself from a heavy burden, has ended the bonds of existence, and is able to possess right knowledge and attain liberation, such a monk should be the first to sit, the first to receive water, and the first to receive food and drink.\"",
        "source": "T23n1435_034:0242b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有比丘言：「世尊！",
        "translation": "Another monk said, \"Bhagavān!",
        "source": "T23n1435_034:0242b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘得阿那含，斷五下分結不還生此世界，如是比丘應先坐、先受水先、受飲食。」",
        "translation": "If a monk attains non-returner status and stops the five lower bonds and isn't reborn in this world, such a monk should sit first, receive water first, and eat and drink first.\"",
        "source": "T23n1435_034:0242b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有比丘言：「世尊！",
        "translation": "Another monk said, \"Bhagavān!",
        "source": "T23n1435_034:0242b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘得斯陀含，斷三結三毒薄，一來生此世間得盡苦際，如是比丘應先坐、先受水、先受飲食。」",
        "translation": "If a monk attains once-returner, cuts the three bonds and the three poisons, and attains the end of suffering in this world in his next lifetime, such a monk should sit first, receive water first, and eat first.\"",
        "source": "T23n1435_034:0242b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有比丘言：「世尊！",
        "translation": "Another monk said, \"Bhagavān!",
        "source": "T23n1435_034:0242b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘得須陀洹，斷三結不墮三惡道必至淨智，往來人天七死七生得盡苦際，如是比丘應先坐、先受水、先受飲食。」",
        "translation": "If a monk attains stream entry, cuts the three bonds, doesn't fall into the three evil destinies, and attains purified wisdom, and goes on to seven deaths and seven births in humans and gods to reach the end of suffering, such a monk should sit first, receive water first, and eat first.\"",
        "source": "T23n1435_034:0242b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘雖種種說，不合佛意。",
        "translation": "Although the monks said various things, they didn't agree with the Buddha's intention.",
        "source": "T23n1435_034:0242b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘：「汝等當一心聽，誰比丘應先坐、先受水、先受飲食？」",
        "translation": "The Buddha said to the monks, \"All of you should listen with one mind, 'Which monk should sit first, receive water first, and eat and drink first?'\"",
        "source": "T23n1435_034:0242b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說本生因緣，語諸比丘：「過去世時，近雪山下，有三禽獸共住：一、鵽，二、獼猴，三、象。",
        "translation": "It was then that the Bhagavān explained the causes and conditions of this life and spoke to the monks, \"In a past life, there were three animals living together near the base of a snowy mountain: 1. a jackal, 2. a monkey, and 3. an elephant.",
        "source": "T23n1435_034:0242b15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是三禽獸互相輕慢無恭敬行，是三禽獸同作是念：『我等何不共相恭敬？",
        "translation": "These three animals despised each other and didn't behave respectfully, and these three animals all thought, 'Why don't we all respect each other?'",
        "source": "T23n1435_034:0242b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若前生者，應供養尊重教化我等。』",
        "translation": "If someone was born here in the past, they should make offerings to us and honor and teach us.'",
        "source": "T23n1435_034:0242b18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時鵽與獼猴問象言：『汝憶念過去何事？』",
        "translation": "It was then that the gods and monkeys asked the elephant, 'What do you remember from the past?'",
        "source": "T23n1435_034:0242b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時是處有大蓽茇樹，象言：『我小時行此，此樹在我腹下過。』",
        "translation": "At the time, there was a large social tree there, and the elephant said, 'When I was a child, I walked here and this tree passed beneath my belly.'",
        "source": "T23n1435_034:0242b20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象鵽問獼猴言：『汝憶念過去何事？』",
        "translation": "The elephant then asked the monkey about it, 'What do you remember from the past?'",
        "source": "T23n1435_034:0242b21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『我憶小時，坐地捉此樹，頭按令到地。』",
        "translation": "He replied, 'I remember when I was a child and sat on the ground and grabbed this tree, pushing my head down so it would reach the ground.'",
        "source": "T23n1435_034:0242b22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象語獼猴：『汝年大我，我當恭敬尊重汝，汝當為我說法。』",
        "translation": "The elephant told the monkey, 'You're older than me, so I will respect and venerate you, and you will explain the teaching to me.'",
        "source": "T23n1435_034:0242b23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴問鵽言：『汝憶念過去何事？』",
        "translation": "The monkey asked the secluded man, 'What do you remember from the past?'",
        "source": "T23n1435_034:0242b24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『彼處有大蓽茇樹，我時噉其子於此大便，乃生斯樹長大如是，是我所憶。』",
        "translation": "He replied, 'There's a large thimble tree there. I was eating my son's stool here, and I was born on that tree, which grew large like this, as I recall.'",
        "source": "T23n1435_034:0242b25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴語鵽：『汝年大我，我當供養尊重汝，汝當為我說法。』",
        "translation": "The monkey then said to him, 'You're older than me, so I will support and honor you, and you will teach me the Dharma.'",
        "source": "T23n1435_034:0242b27_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時象恭敬獼猴，從聽受法為餘象說。",
        "translation": "The elephant then respected the monkey and listened, accepting the teaching for the other elephants.",
        "source": "T23n1435_034:0242b28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴恭敬鵽，從聽受法為餘獼猴說，鵽為餘鵽說法。",
        "translation": "The monkeys respected the monkeys, and from listening and accepting the teaching, they spoke it for the other monkeys, and the monkeys spoke it for the other monkeys.",
        "source": "T23n1435_034:0242b29_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三禽獸，先喜殺生、偷奪他物、邪婬、妄語。",
        "translation": "These three animals were first interested in killing beings, stealing other's property, committing sexual misconduct, and speaking falsehoods.",
        "source": "T23n1435_034:0242c01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯諸禽獸咸作是念：『我等何不捨殺生、偷奪、邪婬、妄語惡業。』",
        "translation": "These animals all thought, 'Why don't we abandon the bad karma of killing, stealing, committing sexual misconduct, and speaking falsehoods?'",
        "source": "T23n1435_034:0242c02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即捨殺、盜、邪婬、妄語。",
        "translation": "After thinking this thought, they then abandon killing, stealing, wrong sexual behavior, and false speech.",
        "source": "T23n1435_034:0242c03_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畜生中無猶具足行是四法，命終皆生天上。」",
        "translation": "There are no animals among them who fully practice these four things, and they're all born up in heaven when their lives end.\"",
        "source": "T23n1435_034:0242c04_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「爾時鵽法廣行流布，顯現諸天世人。",
        "translation": "The Buddha said, \"At the time, the method of dealing with the secular world was widely disseminated, and it was revealed to gods and humans.",
        "source": "T23n1435_034:0242c05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『畜生等何故行善？",
        "translation": "\"Why do animals and others do good deeds?'",
        "source": "T23n1435_034:0242c06_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不復侵食人穀。』",
        "translation": "They won't eat human grain again.'",
        "source": "T23n1435_034:0242c07_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又作是念：『畜生尚能相敬，何況我等？』",
        "translation": "Again, he thinks, 'How can animals honor each other, so why wouldn't we?'",
        "source": "T23n1435_034:0242c07_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世人皆相敬重，廣修鵽法奉行五戒，命終生天。」",
        "translation": "At the time, people all respected each other, cultivated the treacherous methods, and observed the five precepts; at the end of their lives, they were born in heaven.\"",
        "source": "T23n1435_034:0242c08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘：「爾時鵽者，豈異人乎！",
        "translation": "The Buddha said to the monks, \"At the time, was that man different from the others?",
        "source": "T23n1435_034:0242c09_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則我身是。",
        "translation": "Then I myself am.",
        "source": "T23n1435_034:0242c10_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴者舍利弗是，象者目連是。」",
        "translation": "The monkey is Śāriputra, and the elephant is Maudgalyāyana.\"",
        "source": "T23n1435_034:0242c10_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「畜生無知，尚相恭敬行尊重法，自得大利亦利益他。",
        "translation": "The Buddha said, \"Even though animals are ignorant, they respectfully conduct themselves in a way that honors the Dharma and obtains great benefits for themselves and benefits others.",
        "source": "T23n1435_034:0242c11_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況汝等以信出家，剃除鬚髮服法衣，應相尊敬。",
        "translation": "How could it be that you renounce the world in faith, shave off your hair and put on the Dharma robe, and venerate each other?",
        "source": "T23n1435_034:0242c12_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三人不如。",
        "translation": "There are three people who aren't like that.",
        "source": "T23n1435_034:0242c13_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are the three?",
        "source": "T23n1435_034:0242c13_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切未受大戒人，不如受大戒人；一切下座不如上座；一切受事說非法人雖作上座，不如下座不受事人說如法者；一切受大戒人勝不受戒人，一切上座勝下座，佛勝眾聖。」",
        "translation": "All those who have yet to receive the great precepts are not as good as those who have received the great precepts; all inferior seats are not as good as superior seats; all those who are instructed in matters and speak unlawfully though they are superior seats are not inferior to those who are not instructed in matters and speak according to the Dharma; all those who have received the great precepts are superior to those who haven't received them, all superior seats are superior to inferior seats, and the Buddha is superior to all sages.\"",
        "source": "T23n1435_034:0242c14_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊！",
        "translation": "At that point, Bhagavān!",
        "source": "T23n1435_034:0242c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「若人不敬佛，　　及佛弟子眾；　現世人訶罵，　　後世墮惡道。",
        "translation": "He then spoke the verse, \"Suppose someone doesn't revere the Buddha and the multitude of his disciples, and the world in the present ridicules them, and they fall into a bad destiny in the afterlife.",
        "source": "T23n1435_034:0242c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人知敬佛，　　及佛弟子眾；　現世人讚歎，　　後世生天上。」",
        "translation": "If someone knows how to revere the Buddha and the multitude of his disciples, and people in the present praise them, they'll be born in the heavens in the afterlife.\"",
        "source": "T23n1435_034:0242c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種因緣讚歎恭敬法已，語諸比丘：「從今先受大戒乃至大須臾時，是人應先坐、先受水、先受飲食。」",
        "translation": "After the Buddha praised the teaching of veneration for various reasons, he said to the monks, \"From now on, when you first receive the great precepts and then the great instant, this person should first sit down, first receive water, and first receive food and drink.\"",
        "source": "T23n1435_034:0242c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國。",
        "translation": "The Buddha was in the country of Śrāvastī.",
        "source": "T23n1435_034:0242c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有一居士，請佛及僧明日食，佛默然許。",
        "translation": "At the time, a householder invited the Buddha and the saṃgha to eat tomorrow, and the Buddha acquiesced.",
        "source": "T23n1435_034:0242c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士知佛受請，還家通夜辦種種多美飲食，早起敷坐處，遣使白佛：「時到，唯聖知時。」",
        "translation": "Knowing that the Buddha had accepted his invitation, the householder returned home, spent the night preparing a variety of delicious foods, got up early to prepare his sitting place, and sent a messenger to tell the Buddha, \"The time has come; only the sages know the time.\"",
        "source": "T23n1435_034:0242c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛及僧往居士舍，跋難陀釋子常出入他家。",
        "translation": "The Buddha and the saṃgha then went to the house of the householder, and the Śākyamuni of Vārāṇasī used to go in and out of other houses.",
        "source": "T23n1435_034:0242c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時跋難陀釋子，早起著衣持鉢入出他家。",
        "translation": "The Śākyamuni then got up early and took his robe and bowl into and out of the others' homes.",
        "source": "T23n1435_034:0243a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時次跋難陀釋子下座比丘，問跋難陀弟子達磨言：「汝師來不？」",
        "translation": "Then, the next monk off the monk's seat, the disciple of Vārṇasī Dharma, asked him, \"Is your teacher here?\"",
        "source": "T23n1435_034:0243a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我和上多事多緣，喜入出他家，今旦早起入出他家，或來、或不來。」",
        "translation": "He replied, \"I'm a man of many affairs and conditions who likes to go to and leave other people's homes, so I got up early this morning and went to and left other people's homes, either to come or not to come.\"",
        "source": "T23n1435_034:0243a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘不留跋難陀坐處便坐。",
        "translation": "That monk didn't leave a place where Vārāṇasī was sitting and then proceeded to sit down.",
        "source": "T23n1435_034:0243a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時居士見佛及僧坐竟，自手行水下食未遍，跋難陀釋子來就次第坐，令下座比丘起。",
        "translation": "When the monk saw that the Buddha and the saṃgha had finished sitting and had finished washing their hands and drinking water, that monk, the son of Vārāṇasī, came and sat down in order, causing the next monk to get up.",
        "source": "T23n1435_034:0243a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是比丘又令次下比丘起，如是三、四諸下座皆起，以是因緣僧坐散亂。",
        "translation": "That monk also caused the next monk to rise, and so did three or four of the lower seats, and for that reason the saṃgha's sitting was scattered.",
        "source": "T23n1435_034:0243a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士呵責跋難陀言：「飲食甚多一切等施，何須次坐？",
        "translation": "The monks rebuked Varanta, saying, \"Why should we sit in order when there's so much food and drink and everything is equally given?",
        "source": "T23n1435_034:0243a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若汝急欲次坐者，何不早來？",
        "translation": "If you were eager to take a second seat, why didn't you come earlier?",
        "source": "T23n1435_034:0243a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今不知誰得不得？",
        "translation": "Now, I don't know who won't get it?",
        "source": "T23n1435_034:0243a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰重得不重得？」",
        "translation": "Who is endowed or not with respect to respect?\"",
        "source": "T23n1435_034:0243a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛聞居士呵責，見諸比丘散亂已默然。",
        "translation": "After hearing the householder's rebuke, the Buddha saw that the monks were scattered and remained silent.",
        "source": "T23n1435_034:0243a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食後以是因緣集比丘僧，種種因緣訶責跋難陀釋子：「云何名比丘，下飲食時以上座故令下坐起？」",
        "translation": "After the meal, he gathered the monks for these reasons, and for various reasons he rebuked Śāriputra Bhadanta, \"What do you call a monk who makes you get up from your seat when you go down to eat?\"",
        "source": "T23n1435_034:0243a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是呵已語諸比丘：「從今下飲食時若下已訖，不應令下座起。",
        "translation": "After he thus rebuked them, he told the monks, \"From now on, when you finish eating, you shouldn't make them get up from their seats after getting down.",
        "source": "T23n1435_034:0243a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若令起者，得突吉羅。",
        "translation": "If you do, you'll attain the stage of surpassing the others.",
        "source": "T23n1435_034:0243a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘有和上阿闍梨因緣，以恭敬心故起，不應令第二下座起，若令起，得突吉羅。」",
        "translation": "If a monk with the cause of being a superior preceptor rises out of respect, he shouldn't cause the second person to get up from his seat; if he does, he'll be reborn as a prodigal monk.\"",
        "source": "T23n1435_034:0243a17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今聽比丘三歲中間得共一床坐，聽三比丘共一麁梐床上坐，聽細梐床二人共坐，獨坐床上一人坐。」",
        "translation": "The Buddha said, \"From now on, you'll hear a monk sit on the same bed between three years of age, three monks sit on the same stockade bed, two people sit on the fine stockade bed, and one person sits on the bed alone.\"",
        "source": "T23n1435_034:0243a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在波羅[木*奈]國。",
        "translation": "The Buddha was in the country of Pola [munai].",
        "source": "T23n1435_034:0243a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時五比丘白言：「世尊！",
        "translation": "It was then that five monks said, \"Bhagavān!",
        "source": "T23n1435_034:0243a21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等當何處住？」",
        "translation": "Where will we live?\"",
        "source": "T23n1435_034:0243a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「汝等應山巖竹林樹下住。」",
        "translation": "The Buddha said, \"You should stay under a tree in a bamboo grove on a mountain cliff.\"",
        "source": "T23n1435_034:0243a22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘於山巖竹林樹下宿，早起到和上阿闍梨所，受讀經誦經問疑受法故。",
        "translation": "The monks stayed under a tree in the mountain valley's bamboo grove and got up early and went to the Vātsīputrīya Ajari to accept the teaching by reading and reciting the sūtras and asking questions.",
        "source": "T23n1435_034:0243a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時跋提居士，早起出王舍城，欲詣竹園禮覲世尊。",
        "translation": "Bhadrika then got up early and left Rājagṛha with the intention of going to the Bamboo Grove to pay homage to the Bhagavān.",
        "source": "T23n1435_034:0243a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時居士見諸比丘從山巖竹林樹下來，問言：「大德！",
        "translation": "When the monk saw the monks coming from beneath the bamboo grove of the mountain cliffs, he asked, \"Mañjuśrī!",
        "source": "T23n1435_034:0243a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從何處來？」",
        "translation": "Where did it come from?\"",
        "source": "T23n1435_034:0243a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「從山巖竹林樹下來。」",
        "translation": "He replied, \"I came from under a tree in the bamboo grove on a mountain cliff.\"",
        "source": "T23n1435_034:0243a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士言：「何故在此山巖竹林樹下耶？」",
        "translation": "The monk said, \"Why is it here under this mountain cliff and bamboo grove?\"",
        "source": "T23n1435_034:0243a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「更無住處。」",
        "translation": "The monks said, \"There's no more place to live.\"",
        "source": "T23n1435_034:0243a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士言：「我當為汝等起諸房舍。」",
        "translation": "The monks said, \"I will build you living quarters.\"",
        "source": "T23n1435_034:0243b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「佛未聽我等房舍中住。」",
        "translation": "He replied, \"The Buddha hasn't heard of our living in dwellings.\"",
        "source": "T23n1435_034:0243b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是事白佛，佛言：「從今聽諸比丘房舍中住。」",
        "translation": "The monks told the Buddha about this, and the Buddha said, \"From now on, I'll listen to the monks living in the monks' dwellings.\"",
        "source": "T23n1435_034:0243b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時居士即為諸比丘作諸房舍，高廣嚴好雜色彩畫，無臥覆處物，諸比丘不得臥，是事白佛，佛言：「聽敷草樹葉臥，別作覆身衣，別作覆處物。」",
        "translation": "The monks then built these dwellings for the monks, which were painted with a high, wide, ornate color scheme and had no covering cloth for sleeping, so the monks couldn't sleep in them.",
        "source": "T23n1435_034:0243b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是國土多熱草葉生虫，佛言：「聽作薦蓆[竺-二+處]篨。」",
        "translation": "In that land, hot grass and leaves often give rise to insects, and the Buddha said, \"Listen, make a mat [Zhu-ji+district] mat.\"",
        "source": "T23n1435_034:0243b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖受教猶故生虫，佛言：「聽作床榻。」",
        "translation": "Even though they've been taught, insects still grow, so the Buddha says, \"Hear about making a bed or sofa.\"",
        "source": "T23n1435_034:0243b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘取軟木作床桄床簀，故隱身苦惱，是事白佛，佛言：「聽作褥。」",
        "translation": "Those monks who had made soft wood beds and bear arms, and were thus made to hide themselves in misery, said to the Buddha, \"Heard about making a couch.\"",
        "source": "T23n1435_034:0243b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離問佛：「以何物作褥？」",
        "translation": "The elder Upāli asked the Buddha, \"What will you make into a mattress?\"",
        "source": "T23n1435_034:0243b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽用甘蔗滓、瓠蔓、瓜蔓、毳芻摩、劫貝、文闍草、婆婆闍草、麻乃至水衣貯褥。」",
        "translation": "The Buddha said, \"You may use sugarcane residue, gourd vines, melon vines, cuckoo, kapok, munja grass, pārvajā grass, hemp, or even a watercloth to store a mattress.\"",
        "source": "T23n1435_034:0243b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘臥無枕頭垂，是事白佛，佛言：「聽作草枕。」",
        "translation": "The monks then lay down without pillows to drape their heads, and they told the Buddha about it, \"Listen, make straw pillows.\"",
        "source": "T23n1435_034:0243b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘頭軟草枕刺頭，佛言：「聽用納若毳」。",
        "translation": "The monks' heads were pricked by soft straw pillows, and the Buddha said, \"Heard of using naja wool.\"",
        "source": "T23n1435_034:0243b14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸房舍無戶，有狗、牛馬、麞鹿、獼猴來入，是事白佛，佛言：「聽作戶扇。」",
        "translation": "When dogs, cattle, horses, animals, deer, and monkeys enter a dwelling without a door, they tell the Buddha about it and he says, 'Heard you make a door.'",
        "source": "T23n1435_034:0243b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戶扇不作關鑰故，賊入偷衣鉢，是事白佛，佛言：「聽繩繫。」",
        "translation": "When a thief enters and steals a robe or bowl because the door is not shut, he tells the Buddha about it and he says, \"Listen to the rope tying it up.\"",
        "source": "T23n1435_034:0243b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何繫？",
        "translation": "The monks didn't know how to fasten it.",
        "source": "T23n1435_034:0243b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「聽下扂。」",
        "translation": "The Buddha said, \"Listen to me.\"",
        "source": "T23n1435_034:0243b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何作？",
        "translation": "The monks didn't know what to do.",
        "source": "T23n1435_034:0243b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應作孔用繩穿牽閉。」",
        "translation": "The Buddha said, \"You should make a hole and pull a cord through it to close it.\"",
        "source": "T23n1435_034:0243b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閉已不能開，佛言：「應作開戶鉤。」",
        "translation": "After it's closed and can't be opened, the Buddha says, \"You should make a hook to open the door.\"",
        "source": "T23n1435_034:0243b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離問佛：「用何等作？」",
        "translation": "The elder Upāli asked the Buddha, \"How should I make it?\"",
        "source": "T23n1435_034:0243b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應用鐵、若銅、若木作。」",
        "translation": "The Buddha said, \"It should be made of iron, copper, or wood.\"",
        "source": "T23n1435_034:0243b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已不知云何開？",
        "translation": "After it's made, don't you know how to open it?",
        "source": "T23n1435_034:0243b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「戶扇中作孔內鉤却橝。」",
        "translation": "The Buddha said, \"Make a hole in the door and fan for an inner hook to remove the metal.\"",
        "source": "T23n1435_034:0243b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘閉戶時無所捉，佛言：「戶扇上應作孔施紐。」",
        "translation": "When the monks had nothing to grasp when they closed their doors, the Buddha said, \"You should make a hole in the door and give it a button.\"",
        "source": "T23n1435_034:0243b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離問佛：「以何物作紐？」",
        "translation": "The elder Upāli asked the Buddha, \"What will be used to make a nipple?\"",
        "source": "T23n1435_034:0243b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應用鐵、若銅、若木、毛芻摩、劫貝、文闍草、麻皮。」",
        "translation": "The Buddha said, \"Apply iron, copper, wood, hair, kaṭhumā, karpāsa, bungee, and hemp bark.\"",
        "source": "T23n1435_034:0243b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸房舍無向故闇，佛言：「聽作向。」",
        "translation": "When the dwellings were dark because they lacked orientation, the Buddha said, \"Listen to the orientation that's being created.\"",
        "source": "T23n1435_034:0243b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作向已有鵝鴈、孔雀、鸚鵡、舍利鳥、鳩耆羅鳥、命命鳥、鷰雀從向中入，作聲故，妨諸比丘坐禪讀經。",
        "translation": "Once the direction is created, there are geese, peacocks, parrots, Śāriputra, kokila, life-sustaining birds, and grebes entering through the direction and making noise, which prevents the monks from sitting in meditation and reading the sūtras.",
        "source": "T23n1435_034:0243b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應施欞子。」",
        "translation": "They told the Buddha about this, and he said, \"You should give lattes.\"",
        "source": "T23n1435_034:0243b28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施欞子已鳥故得入，佛言：「應施網。」",
        "translation": "After giving the lattes, the birds were able to enter because of them, and the Buddha said, \"You should give them nets.\"",
        "source": "T23n1435_034:0243b29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離問佛：「何等物作網？」",
        "translation": "The elder Upāli asked the Buddha, \"What kind of thing is a net?\"",
        "source": "T23n1435_034:0243c01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應用毛芻摩、劫貝、文闍、婆婆闍、麻皮作。」",
        "translation": "The Buddha said, \"You should make a hairy curd, a kapi, a munja, a bhavaja, or a hemp skin.\"",
        "source": "T23n1435_034:0243c01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已朽壞，佛言：「應遮。」",
        "translation": "After it's been made and rotted, the Buddha says, \"It should be covered up.\"",
        "source": "T23n1435_034:0243c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離問佛：「以何物遮？」",
        "translation": "The elder Upāli asked the Buddha, \"What should I use to cover it up?\"",
        "source": "T23n1435_034:0243c03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應用木作施轆轤。」",
        "translation": "The Buddha said, \"You should make a wooden donor's roll.\"",
        "source": "T23n1435_034:0243c04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已室中闍，佛言：「應作雀目。」",
        "translation": "After making them, he said, \"You should make a bird's eye in his room.\"",
        "source": "T23n1435_034:0243c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已亦闇，佛言：「應作向闒。」",
        "translation": "After it was made, it was also dark, and the Buddha said, \"You should make a fan to reach it.\"",
        "source": "T23n1435_034:0243c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時熱過寒到，向中無扇寒入，佛言：「應作扇。」",
        "translation": "When the heat passed and the cold arrived, there was no fan in the room to which the cold would enter, and the Buddha said, \"You should make a fan.\"",
        "source": "T23n1435_034:0243c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作扇已小動便脫，佛言：「應上下作掩。」",
        "translation": "After making the fan, it would fall off after making a small movement, and the Buddha said, \"You should put it up and down to cover it.\"",
        "source": "T23n1435_034:0243c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已兩扇間不合，佛言：「應廣作令掩。」",
        "translation": "After making it, the two fans didn't fit together, and the Buddha said, \"You should make it wide enough to cover them.\"",
        "source": "T23n1435_034:0243c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已動搖，佛言：「施關向高。」",
        "translation": "After it's made, it shakes, and the Buddha says, 'Close it and make it high.'\"",
        "source": "T23n1435_034:0243c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知云何閉？",
        "translation": "I wonder how it's closed?",
        "source": "T23n1435_034:0243c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應以繩牽閉。」",
        "translation": "The Buddha said, \"You should use a cord to pull it shut.\"",
        "source": "T23n1435_034:0243c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閉已不能開，佛言：「應作孔施兩繩，一繩牽閉、一繩挽開。」",
        "translation": "After closing it and being unable to open it, the Buddha said, \"You should make a hole and apply two cords, one to pull it shut and one to pull it open.\"",
        "source": "T23n1435_034:0243c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸房舍不泥故，墼間有蛇蜈蚣毒虫生，齧諸比丘，佛言：「應泥。」",
        "translation": "It was then that, because the halls weren't muddied, snakes and centipedes, poisonous insects, and worms that bite the monks or not, arose, and the Buddha said, \"You should mud them.\"",
        "source": "T23n1435_034:0243c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥已壁麁澁破衣，佛言：「應細泥塗。」",
        "translation": "After mud is applied to the walls, the rough and torn clothing, the Buddha said, 'Should you coat it with fine mud?'\"",
        "source": "T23n1435_034:0243c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸房舍用泥覆故，久雨便漏，佛言：「應用草覆。」",
        "translation": "At the time, the huts were covered with mud, but they leaked when it rained for a long time, so the Buddha said, \"Cover them with grass.\"",
        "source": "T23n1435_034:0243c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覆已當脊上漏，佛言：「脊上厚覆。」",
        "translation": "After covering them, the ridges will leak, and the Buddha said, 'Cover the ridges with a thick covering.'",
        "source": "T23n1435_034:0243c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覆已為風所發，佛言：「應繫兩邊。」",
        "translation": "After covering it, the wind will catch it, and the Buddha says, \"It should be tied up at both sides.\"",
        "source": "T23n1435_034:0243c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫已兩頭故漏，佛言：「應多著草泥以橛釘上。」",
        "translation": "When it leaks because it's tied at both ends, the Buddha says, \"You should put more straw and mud on it and pin it to the nail.\"",
        "source": "T23n1435_034:0243c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雨時泥爛墮落，佛言：「應用瓫覆。」",
        "translation": "When it rains, the mud rots and falls, and the Buddha says, \"You should cover it with a jar.\"",
        "source": "T23n1435_034:0243c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瓫又墮地破壞，佛言：「應穿瓫以橛釘之。」",
        "translation": "When the jar falls to the ground again and breaks down, the Buddha says, \"You should pierce the jar and nail it with a stake.\"",
        "source": "T23n1435_034:0243c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雨從孔入，佛言：「應作覆盆蓋蓋孔上。」",
        "translation": "When rain enters through a hole, the Buddha says, \"You should make a covered pot to cover the hole.\"",
        "source": "T23n1435_034:0243c18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城。",
        "translation": "The Buddha was in the city of Śrāvastī.",
        "source": "T23n1435_034:0243c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍衛國給孤獨氏，有少因緣至王舍城，宿一居士舍。",
        "translation": "At the time, a lonely man from Śrāvastī had a few reasons to go to Rājagṛha and stay at a house for a householder.",
        "source": "T23n1435_034:0243c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是居士請佛及僧明日食，故後夜起，喚兒息、奴婢、內外作人：「汝等速起，破薪、取水、安施釜鑊、煮飯作羹。」",
        "translation": "That householder invited the Buddha and the saṃgha to eat tomorrow, so he got up late at night and summoned his children, servants, and workers inside and out, \"Get up quickly, break firewood, fetch water, put out a cauldron, and cook rice and make soup.\"",
        "source": "T23n1435_034:0243c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是居士自莊嚴堂舍敷眾坐處。",
        "translation": "That monk then decorated his hall and prepared a place for the people to sit.",
        "source": "T23n1435_034:0243c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時給孤獨作是念：「是居士為欲嫁娶？",
        "translation": "Then he gave him this thought alone, \"Does this householder want to get married?",
        "source": "T23n1435_034:0243c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為請國王及大臣耶？",
        "translation": "Is it to invite the king and his ministers?",
        "source": "T23n1435_034:0243c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為作大施會耶？」",
        "translation": "What is the purpose of making a great almsgiving?\"",
        "source": "T23n1435_034:0243c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，問居士言：「汝欲嫁娶、為欲請國王大臣、為作大施會耶？」",
        "translation": "After this thought, he asked the householder, \"Do you want to get married, invite the king's ministers, or make a great almsgiving?\"",
        "source": "T23n1435_034:0243c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士答言：「我不嫁娶亦不請王及大臣也。",
        "translation": "The monk replied, \"I don't get married and don't invite kings and ministers.",
        "source": "T23n1435_034:0243c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請佛及僧明日食，故作大施會。」",
        "translation": "I'm inviting the Buddha and the saṃgha to eat tomorrow, so I'll make a big almsgiving.\"",
        "source": "T23n1435_034:0243c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤獨氏初聞佛名，心喜毛竪，問言：「何人是佛？」",
        "translation": "When the Gupta family first heard the Buddha's name, their hair stood on end in delight, and they asked, \"Who's the Buddha?\"",
        "source": "T23n1435_034:0243c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士答言：「有釋王太子，以信出家得無上道，故號為佛。」",
        "translation": "The monk replied, \"There was the prince of the Śākyas who renounced the world in faith and attained the unsurpassed path, so he was called a Buddha.\"",
        "source": "T23n1435_034:0244a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何名為僧？」",
        "translation": "He also asked, \"What's the name of a monk?\"",
        "source": "T23n1435_034:0244a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「有種種人、種種雜姓、種種異人出家，剃除鬚髮服法衣隨佛出家，是名為僧。」",
        "translation": "He answered, \"Suppose there are various people of various castes and different kinds of people who leave home, shave off their hair, put on the Dharma robe, and leave home with the Buddha; this is called a monk.\"",
        "source": "T23n1435_034:0244a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「佛今所在？」",
        "translation": "Again, he asked, \"Where is the Buddha now?\"",
        "source": "T23n1435_034:0244a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「近在寒林，欲見隨意。」",
        "translation": "He replied, \"I'm near here in the cold forest, so I want to see as I wish.\"",
        "source": "T23n1435_034:0244a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤獨氏至心欲見，夜現明相，即從舍出至大勢神門，門自然開。",
        "translation": "When the Solitary Monk's mind really wants to see him, he shows his bright face at night and goes out of his house to the gate of Mahāsthāmaprāpta, which naturally opens.",
        "source": "T23n1435_034:0244a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此門常法，初夜吹唄，為客入故。",
        "translation": "The constant rule at this gate is to blow out a chant the first night for a guest to enter.",
        "source": "T23n1435_034:0244a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後夜吹唄，為人出故。",
        "translation": "On the latter night, it's blown for people to leave.",
        "source": "T23n1435_034:0244a08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時給孤獨氏見此門開，念必夜了，出門不遠明相不現，闇無所覩。",
        "translation": "At the time, when the Solitary Monk saw this door open, he remembered that it must have been opened by night, and he went out the door not far from the sign of insight that wasn't visible, and he couldn't see anything in the dark.",
        "source": "T23n1435_034:0244a08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時驚怖毛竪：「將無非人嬈固我耶？」",
        "translation": "He was immediately terrified, and his hair stood on end, \"Wouldn't there be someone who wouldn't try to seduce me?\"",
        "source": "T23n1435_034:0244a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋欲退還。",
        "translation": "He looked for a way to retreat.",
        "source": "T23n1435_034:0244a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大勢門神，為現光明徹照寒林，語言：「汝去！",
        "translation": "The god Mahāsthāmaprāpta then showed a bright light that shone through the cold forest and said, \"Go!",
        "source": "T23n1435_034:0244a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿復恐懼，我前世時是汝善知識密肩婆羅門，同心相敬居士。",
        "translation": "\"Don't be afraid, for in a previous life I was your good friend, a close-shouldered Brāhmaṇa, a man of one mind and respect.",
        "source": "T23n1435_034:0244a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔因到王舍城見舍利弗、目連，我頭面作禮現前坐，即為我說法示教利喜。",
        "translation": "In the past, when I went to the city of Rājagṛha and met Śāriputra and Maudgalyāyana, I bowed my head and face and sat down in front of them, and they taught me the Dharma and showed me how to benefit and rejoice.",
        "source": "T23n1435_034:0244a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示教利喜已，我受三歸五戒，以是因緣故，生四王天上，頓止斯門，是故語汝，去得大利，直進勿疑。」",
        "translation": "After showing them the benefits and rejoicing, I received the three refuges and five precepts, and because of these causes and conditions, I was born in the heaven of the four kings and immediately stopped at this gate.",
        "source": "T23n1435_034:0244a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時天神即說偈言：「若人得百馬，　　百瓔珞嚴具；　草馬車一百，　　不如前一步。",
        "translation": "The gods then spoke a verse, saying, \"Suppose a person attains a hundred horses and a hundred adorned with jewelry, or a hundred straw horse chariots, but they're not as powerful as the previous step.",
        "source": "T23n1435_034:0244a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若百雪山象，　　修廣大身牙；　又以純金飾，　　嚴身最殊異；　不如前一步，　　十六分之一。",
        "translation": "Suppose a hundred elephants of the snowy mountains cultivate a body with broad tusks and are adorned with pure gold, and their adorned body is most extraordinary; it's not as impressive as the first step, which is one of sixteen.",
        "source": "T23n1435_034:0244a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　北方百美女，　　瓔珞環金印；　以是莊嚴具，　　年少端正妙；　比汝前一步，　　十六不及一。",
        "translation": "In the north, there are a hundred beautiful women with diamante rings and gold seals, which are adorned with the subtlety and beauty of youth; they're one step ahead of you, but sixteen are not as great as one.",
        "source": "T23n1435_034:0244a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至轉輪王，　　第一玉女寶；　比汝前一步，　　十六不及一。",
        "translation": "Even the wheel-turning king, the most jeweled female jewel, is one step ahead of you, sixteen times less than one.",
        "source": "T23n1435_034:0244a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故汝直前，　　勿復疑悔還。」",
        "translation": "Therefore, go straight ahead, and don't doubt or repent again.\"",
        "source": "T23n1435_034:0244a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時給孤獨氏，念佛法僧必大不小，乃令天神慇懃致教。",
        "translation": "Then, Gṛdhrakūṭa remembered that the Buddha, Dharma, and Saṃgha must be great and not insignificant, so he had the celestial spirits give attentive instructions.",
        "source": "T23n1435_034:0244b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從光中進到寒林，于時地了，佛在露地經行，住待居士。",
        "translation": "He then went from the light into the cold forest, where the Buddha was practicing in the open ground and staying there waiting for the monk.",
        "source": "T23n1435_034:0244b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時居士，以白衣法問訊佛：「世尊！",
        "translation": "The householder then asked the Buddha by way of a white robe, \"Bhagavān!",
        "source": "T23n1435_034:0244b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臥安隱不？」",
        "translation": "Is it safe to lie down?\"",
        "source": "T23n1435_034:0244b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說偈言：「我除諸欲漏，　　解脫離世間，　已斷一切漏，　　心滅諸熱惱，　得寂滅處故，　　我臥常安隱。」",
        "translation": "The Buddha spoke a verse, saying, \"I've removed the contaminants of desire, I'm liberated from the world, I've stopped all contaminants, I've ceased mental anguish, and I've attained the abode of cessation so that I can always lay down in comfort.\"",
        "source": "T23n1435_034:0244b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即於經行處坐，是居士頭面禮佛足却坐一面，佛為說法示教利喜，為說初法布施持戒生天果報，說五欲過世間苦惱，出家安樂分別垢淨。",
        "translation": "The Bhagavān then sat down at the place where the sūtra was being practiced, and this householder bowed his head to the Buddha's feet and withdrew to sit to one side as he taught the Dharma, showed him the benefits and rewards of teaching, explained the first principles of generosity and morality, the rewards of birth in heaven, explained that the five desires transcend worldly suffering and distress, and that the transient's well-being is distinguished from purity.",
        "source": "T23n1435_034:0244b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知是人心調柔軟堪受上法，為說四諦苦習盡道，如白淨衣易受染色，是人亦爾，聞法開悟，即於座上見法得法，知法通達法，斷疑不隨他，於佛法中得無所畏。",
        "translation": "Knowing that this person's mind was tempered and pliable enough to accept the higher teaching, the Buddha taught the path to the end of suffering and accumulation in the four truths, which is like a pure white robe that's easily dyed.",
        "source": "T23n1435_034:0244b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從坐起頭面禮佛足作是言：「世尊！",
        "translation": "Rising from his seat, he bows his head and face to the Buddha's feet and says, \"Bhagavān!",
        "source": "T23n1435_034:0244b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我心樂佛法，知我盡壽作優婆塞，願世尊及僧，受我夏請住舍衛國。」",
        "translation": "My mind is delighted with the Buddha's teaching, and I know that I'll spend my whole life as an upāsaka. May the Bhagavān and the saṃgha accept my summer invitation to stay in Śrāvastī.\"",
        "source": "T23n1435_034:0244b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知故問居士：「汝字何等？」",
        "translation": "Knowing this, the Buddha therefore asked the householder, \"What's your name?\"",
        "source": "T23n1435_034:0244b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我字須達，供給孤獨故，國人稱我為給孤獨氏。」",
        "translation": "He replied, \"My name is Sudatta, and because I offer myself to the orphans, the people of that country call me 'Gṛdhrakūṭa.'\"",
        "source": "T23n1435_034:0244b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問須達：「舍衛國有僧坊不？」",
        "translation": "The Buddha asked Sudatta, \"Does the country of Śrāvastī have a monastery?\"",
        "source": "T23n1435_034:0244b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「未有。",
        "translation": "They replied, \"No.",
        "source": "T23n1435_034:0244b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_034:0244b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若有僧坊住處，諸比丘可得來往。",
        "translation": "The Buddha said, \"If there's a residence in the monastery, monks may come and go.",
        "source": "T23n1435_034:0244b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無有者，諸比丘不得往來止頓。」",
        "translation": "If there isn't one, the monks won't be able to come and stay there.\"",
        "source": "T23n1435_034:0244b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言：「願世尊但受我請，我能為辦僧坊，令諸比丘得來往止頓。",
        "translation": "He also said, \"May the Bhagavān simply accept my invitation, for I can build a monastery so that the monks can come and go and stop.",
        "source": "T23n1435_034:0244b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願世尊遣舍利弗，為我作僧坊師。」",
        "translation": "May the Bhagavān send Śāriputra to be my monastery director.\"",
        "source": "T23n1435_034:0244b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛勅舍利弗：「汝與居士作僧坊師。」",
        "translation": "The Buddha commanded Śāriputra, \"You and the householder can be the monastery's masters.\"",
        "source": "T23n1435_034:0244b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是居士即往詣竹園，看講堂、溫室、食堂、作食處、洗浴處、門屋、坐禪處、廁處，取相貌已，是居士於王舍城因緣事訖，還向舍衛國。",
        "translation": "That monk then went to the Bamboo Park, looked at the lecture hall, the greenhouse, the dining hall, the food preparation place, the bathing place, the entrance hall, the sitting meditation place, and the toilet place, and took their appearance.",
        "source": "T23n1435_034:0244b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行路知佛所當宿處，語諸知親相識諸負債人言：「汝等知不？",
        "translation": "He traveled on the road and knew where the Buddha was going to stay, and he told the debtors who knew him well and knew him personally, \"Do you know that?",
        "source": "T23n1435_034:0244b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今佛出世，我當為佛於此作如是講堂、溫室、食堂、食厨、洗浴處、門屋、禪坊、大小便處。」",
        "translation": "Now that the Buddha has appeared in the world, I will make this lecture hall, bathhouse, dining hall, kitchen, bathing place, gatehouse, meditation hall, and toilet and bowel area for him.\"",
        "source": "T23n1435_034:0244b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時給孤獨氏，限半由旬起僧坊，約勅左右供給所須，如是次第約勅至舍衛國。",
        "translation": "Gṛdhrakūṭa then built a monastery for half a decade, asked me to give him what he needed, and sent him to Śrāvastī in this order.",
        "source": "T23n1435_034:0244c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已不入城內、不還自舍，遶城推求立僧坊處，路行思惟：「誰有好園來往穩便，樹林豐茂流水清潔，無諸毒螫蚊虻之類，無大風熱晝夜少聲，我於斯處當起僧坊施佛及僧。」",
        "translation": "When he arrived, he didn't enter the city or return to his own home, but he circled the city and looked for a place to build a residence for the saṃgha. He walked along the road and thought, \"Where is there a nice park where people can come and go smoothly, where the trees are abundant and the water is clean, where there are no venomous stings or mosquitoes or horseflies, and where there's no great wind or heat and few sounds during the day and night, I will build a residence for the saṃgha and give alms to the Buddha and Saṃgha.\"",
        "source": "T23n1435_034:0244c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是行時，見祇陀王子有園來往穩便，樹林豐茂有好流水，無諸毒虫蚊虻之類，無大風大熱，晝夜閑靜少諸音聲。",
        "translation": "As he did so, he saw Prince Jeta's manor come and go smoothly, his grove was plentiful and well-fed, there were no venomous insects or stinging mosquitoes or horseflies, there was no great wind or heat, and there was quietness during the day and night with few sounds.",
        "source": "T23n1435_034:0244c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便生念：「我於斯處當起僧坊奉佛及僧。」",
        "translation": "He then had the thought, \"Here, I will build a monastery to serve the Buddha and the saṃgha.\"",
        "source": "T23n1435_034:0244c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時給孤獨氏，還舍衛城不自入舍，即詣祇陀王子所白言：「買君園，願以與我。」",
        "translation": "Upon returning to Śrāvastī, the Vikramāditya family didn't go into their own residence and went to Prince Gṛdhrakūṭa and said, \"Buy me the monk's mansion.\"",
        "source": "T23n1435_034:0244c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子答言：「我此園非可買者，乃至側布金錢滿中，亦不賣也。」",
        "translation": "The prince answered, \"I can't buy this park, and I wouldn't sell it even if I filled it with gold or gold coins.\"",
        "source": "T23n1435_034:0244c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士言：「園價已斷。」",
        "translation": "The monk said, \"The price of the garden has been cut off.\"",
        "source": "T23n1435_034:0244c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子答言：「我不斷價。」",
        "translation": "The prince replied, \"I won't ask for more.\"",
        "source": "T23n1435_034:0244c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣遂相共諍，即詣斷事大臣富貴人所具說是事。",
        "translation": "As a result of this, they had a dispute, and they went to the minister who could cut off the matter, a wealthy man, and explained the matter in detail.",
        "source": "T23n1435_034:0244c15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大臣能斷事者語王子言：「汝園已賣，宜時納價。",
        "translation": "The minister who could cut off affairs then said to the prince, \"Your garden has been sold, so it's time to pay the price.",
        "source": "T23n1435_034:0244c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝何故言：『側布金錢。』」",
        "translation": "Why did you say, 'Give me the gold money for it?'\"",
        "source": "T23n1435_034:0244c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤獨氏尋便還歸，遣象馬車乘，負載金錢到祇陀園，側布其地，餘少未足。",
        "translation": "The Gupta family then returned, sent a caravan of elephants and horses, loaded it with money, and went to the Jetavana park to distribute it sideways, leaving a little more than enough.",
        "source": "T23n1435_034:0244c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士思惟：「出何藏金令滿此地，而不多不少？」",
        "translation": "The monk thought, \"How could you fill the place with gold that's not more or less than enough?\"",
        "source": "T23n1435_034:0244c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子祇陀見其靜默，語居士言：「欲悔隨意，以金相付園地還我。」",
        "translation": "Seeing his silence, Prince Gṛdhrakūṭa said to the householder, \"If you wish to repent, return the garden to me with a gift of gold.\"",
        "source": "T23n1435_034:0244c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：「王子！",
        "translation": "He replied, \"Prince!",
        "source": "T23n1435_034:0244c22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾心不悔，但自思惟：『開何藏金不多不少，而得滿足。』」",
        "translation": "I don't regret it, but I just think to myself, 'What would be the reason for opening a gold store that's not too large or too small to be fulfilled?'\"",
        "source": "T23n1435_034:0244c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子聞已便作是念：「佛法僧眾必大不小，能令居士捨爾所寶物。」",
        "translation": "After hearing this, the prince then had this thought, \"The Buddhist teaching and the saṃgha must be large and not insignificant to cause the householder to part with such precious things.\"",
        "source": "T23n1435_034:0244c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已語居士言：「莫復布錢，吾於此中當起門屋施佛及僧。」",
        "translation": "After he had this thought, he said to the householder, \"Don't give away any more money; I will build a house here to give to the Buddha and the saṃgha.\"",
        "source": "T23n1435_034:0244c25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時居士便聽，以憐愍故，王子於中起立門屋施佛眾僧。",
        "translation": "The householder then listened, and out of pity, the prince erected a gatehouse in the middle of the monastery to give alms to the Buddha and the saṃgha.",
        "source": "T23n1435_034:0244c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時居士以舍利弗為師，於此園中起十六大重閣作六十窟屋。",
        "translation": "The householder then took Śāriputra as his teacher and built 60 cave houses out of 16 large, heavy shrines in this park.",
        "source": "T23n1435_034:0244c27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知舍衛國僧坊已辦，集比丘僧而告之言：「吾將遊行至舍衛國，汝等俱去。」",
        "translation": "Knowing that the monastery in Śrāvastī had been completed, the Buddha gathered the monks and told them, \"I'm going to travel to Śrāvastī, so all of you must go with me.\"",
        "source": "T23n1435_034:0244c29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘受教，願皆隨從。",
        "translation": "The monks accepted his teaching and vowed to follow it.",
        "source": "T23n1435_034:0245a02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊與大比丘眾五百人俱，向舍衛國。",
        "translation": "It was then that the Bhagavān went to Śrāvastī with a large assembly of five hundred monks.",
        "source": "T23n1435_034:0245a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘，知佛及僧暮所宿處，告其弟子：「汝等往宿處好房留佛，餘有好者為我占取。」",
        "translation": "Knowing where the Buddha and the saṃgha were staying at sunset, the six groups of monks then told their disciples, \"Go to the good room where you're staying and leave the Buddha there, and take the rest of the good ones for me.\"",
        "source": "T23n1435_034:0245a03_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子受教先往宿處，好房留佛，次有好者為師占取。",
        "translation": "The disciples were instructed to first go to their lodging and leave the Buddha in a nice room, and then someone nice would take it for the teacher.",
        "source": "T23n1435_034:0245a05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗、目連從佛後至，除佛房舍次欲取房，有比丘言：「他已先取。」",
        "translation": "It was then that Śāriputra and Maudgalyāyana arrived from behind the Buddha and wanted to take the room next to the Buddha's dwelling, but a monk said, \"That other person has taken it first.\"",
        "source": "T23n1435_034:0245a06_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第二、第三、第四皆言先取。",
        "translation": "Thus, the second, third, and fourth were all said to have taken it first.",
        "source": "T23n1435_034:0245a08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連取邊房住。",
        "translation": "Śāriputra and Maudgalyāyana then took the side room and stayed there.",
        "source": "T23n1435_034:0245a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知故問阿難：「舍利弗、目連今何處住？」",
        "translation": "Knowing this, the Buddha therefore asked Ānanda, \"Where are Śāriputra and Maudgalyāyana staying now?\"",
        "source": "T23n1435_034:0245a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0245a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邊房中住。」",
        "translation": "He's staying in the side room.\"",
        "source": "T23n1435_034:0245a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「喚來！」",
        "translation": "The Buddha said, \"Call me!\"",
        "source": "T23n1435_034:0245a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時來至，問舍利弗：「汝等何故邊房中住？」",
        "translation": "Immediately, he came and asked Śāriputra, \"Why are you staying in that side room?\"",
        "source": "T23n1435_034:0245a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0245a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘知佛暮所宿處，先遣弟子：『汝往宿處，好房留佛，餘有好者為我占取。』",
        "translation": "Knowing where the Buddha was staying at sunset, the six groups of monks first sent their disciples, 'Go to your lodging and leave a nice room with the Buddha while the rest of you take a nice one for me.'",
        "source": "T23n1435_034:0245a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子受教先來到此，好房留佛，次占好者，我等從佛後至，除佛房舍次欲取房。",
        "translation": "The disciples were instructed to come here first, leave the good room with the Buddha, and then take possession of the good one; we arrived after the Buddha and wanted to take the room next, except for the Buddha's quarters.",
        "source": "T23n1435_034:0245a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘言：『他已先取。』",
        "translation": "Some monks said, 'They've already taken it first.'",
        "source": "T23n1435_034:0245a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第二、第三、第四，皆言先取，是故我等邊房中住。」",
        "translation": "Thus, the second, third, and fourth ones all said they had taken it first; therefore, we stayed in the other room.\"",
        "source": "T23n1435_034:0245a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今聽隨上座次第取房舍住。」",
        "translation": "The Buddha said, \"From now on, listen to the superior monk as he sequentially takes the dwelling and stays there.\"",
        "source": "T23n1435_034:0245a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時六群比丘遣病比丘出房，時看病比丘持病比丘大小便器、涕唾器、草蓆從一房至一房，受諸疲苦病者增劇。",
        "translation": "When the six groups of monks sent the sick monk out of his room, the monks who were watching him carried the sick monk's toilet, urinal, and straw mat from room to room, and the person suffering from fatigue and illness increased.",
        "source": "T23n1435_034:0245a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今不應隨上座驅病比丘出房，驅出者，突吉羅。」",
        "translation": "He told the Buddha about this, and he said, \"From now on, you shouldn't follow the superior monk out of the sick monk's room; if you do, it's a grave offense.\"",
        "source": "T23n1435_034:0245a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘聞佛不聽隨上座驅病比丘出房，即時託病。",
        "translation": "When the six groups of monks heard that the Buddha wouldn't allow the superior monk to leave his room after he expelled the sick monk, they immediately asked to be taken ill.",
        "source": "T23n1435_034:0245a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有時客比丘，日沒來打戶索住，六群比丘在內應聲，客比丘問：「汝幾歲？」",
        "translation": "There was a time when a visiting monk came to the door to stay after the sun had gone down, and when the six groups of monks answered the monk's voice inside, the visiting monk asked, \"How old are you?\"",
        "source": "T23n1435_034:0245a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘言：「我是病人，何須問歲？」",
        "translation": "Six groups of monks said, \"I'm sick, so why do I need to ask about my age?\"",
        "source": "T23n1435_034:0245a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「汝何病？」",
        "translation": "The question was, \"What's wrong with you?\"",
        "source": "T23n1435_034:0245a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我患口懸癰痛，兼患脚指間劈。」",
        "translation": "He replied, \"I have abscesses hanging from my mouth and splintering between my toes.\"",
        "source": "T23n1435_034:0245a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是事白佛，佛言：「是人若託病，應次第驅出，僧中作使一切應作。」",
        "translation": "The monks told the Buddha about this, and he said, \"If this person is entrusted with a sickness, he should be expelled in order, and all the messengers in the saṃgha should be made.\"",
        "source": "T23n1435_034:0245a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸病比丘聞佛語已皆住好房，是事白佛，佛言：「雖實病人，不應好上房舍中住。",
        "translation": "After hearing what the Buddha said, the sick monks all stayed in nice quarters and told the Buddha about it, and he said, \"Even though you're really sick, you shouldn't stay in nice quarters.",
        "source": "T23n1435_034:0245a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知臥具人，應籌量房舍及諸病人與中房舍。",
        "translation": "Those who know how to lay down should measure the dwelling and the middle dwelling for the sick.",
        "source": "T23n1435_034:0245b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中房舍者，容受病人看病人及臥具，令得坐臥。」",
        "translation": "The middle room is for accepting patients, looking after them and laying down their bedclothes so that they can sit and lay down.\"",
        "source": "T23n1435_034:0245b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛次第到舍衛國，諸比丘欲安居，先作本事，泥塗壁孔及土埵，急床榻繩抖擻被褥枕。",
        "translation": "When the Buddha arrived in Śrāvastī in order, the monks who wanted to settle down first did so by coating the walls and holes with mud, making a hasty bed and sofa, shaking out the bedding, mattresses, and pillows.",
        "source": "T23n1435_034:0245b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘性懶，立住遙看作是念：「待彼作竟受床榻已，我等當往隨上座次第驅出。」",
        "translation": "Six groups of monks, lazy by nature, stood and looked away, thinking, \"After they finish making and accepting the beds and sofas, we'll go follow the superior throne and drive them out in order.\"",
        "source": "T23n1435_034:0245b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘作本事竟，敷床榻臥具坐已，六群比丘打戶，房內比丘應聲。",
        "translation": "After the monks had finished working on it and had spread out their beds and sofas and sat down, the six groups of monks opened their doors, and the monks in the room answered their voices.",
        "source": "T23n1435_034:0245b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘言：「汝等幾歲？」",
        "translation": "The six groups of monks said, \"How old are you?\"",
        "source": "T23n1435_034:0245b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「若干歲。」",
        "translation": "He replied, \"How many years?\"",
        "source": "T23n1435_034:0245b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘言：「汝起出去，我是上座。」",
        "translation": "The six groups of monks said, \"Get up and go out, for I'm the elder monk.\"",
        "source": "T23n1435_034:0245b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「汝等共我來不？」",
        "translation": "The monks said, \"Are you coming with me?\"",
        "source": "T23n1435_034:0245b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「共來。」",
        "translation": "They replied, \"We'll come together.\"",
        "source": "T23n1435_034:0245b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「作本事不？」",
        "translation": "\"Are you capable of doing it?\"",
        "source": "T23n1435_034:0245b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不作。」",
        "translation": "They replied, \"I won't do it.\"",
        "source": "T23n1435_034:0245b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「汝等與我俱來，不作本事，我不能去。」",
        "translation": "The monks said, \"You've come with me, and unless you do something, I can't go.\"",
        "source": "T23n1435_034:0245b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘言：「佛不說：『不作本事，不與次第住。』",
        "translation": "The six groups of monks said, \"The Buddha didn't say, 'Don't do it, and don't stay in order.'",
        "source": "T23n1435_034:0245b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但說：『隨上座次第受房舍臥具。』",
        "translation": "Instead, he said, 'Follow the superior seat and accept the bedding in order.'",
        "source": "T23n1435_034:0245b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等是上座，汝云何不去？」",
        "translation": "We're the superior seats, so why don't you go?\"",
        "source": "T23n1435_034:0245b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘勦健多力，不念護戒即便入舍強捉曳出。",
        "translation": "The six groups of monks were so bold and powerful that they entered the monastery without remembering to protect the precepts and forcibly grabbed and pulled them out.",
        "source": "T23n1435_034:0245b15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘身軟，頭首傷壞、衣鉢破裂。",
        "translation": "The monks' bodies were so weak that their heads were injured and their robes and bowls were broken.",
        "source": "T23n1435_034:0245b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今應立知分臥具人。",
        "translation": "They told the Buddha about this, and he said, \"From now on, you should establish a person who knows the proper parts of a bed.",
        "source": "T23n1435_034:0245b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立知分臥具人法者，一心和合僧應作是言：『誰能為僧作分臥具人？』",
        "translation": "Those who establish the rule of knowing the person who shares the bedding should unite the saṃgha with one mind and say, 'Who can be the person who shares the bedding for the saṃgha?'",
        "source": "T23n1435_034:0245b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中若有比丘言：『我能。』」",
        "translation": "Suppose there's a monk here who says, 'I can.'\"",
        "source": "T23n1435_034:0245b19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若有五法，不應立作知分臥具人。",
        "translation": "The Buddha said, \"If there are five things, you shouldn't be established as a person who knows the proper parts of lying down.",
        "source": "T23n1435_034:0245b20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0245b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨愛、隨瞋、隨怖、隨癡、不知得不得。",
        "translation": "Following craving, following anger, following fear, following delusion, and not knowing what's obtainable or not obtainable.",
        "source": "T23n1435_034:0245b21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就五法，應立作分臥具人。",
        "translation": "If he accomplishes five things, he should be established as a person who is fully ordained for lying down.",
        "source": "T23n1435_034:0245b22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0245b22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不隨愛、不隨瞋、不隨怖、不隨癡、知得不得。",
        "translation": "Not following craving, not following anger, not following fear, and not following delusion, he knows that he can't get it.",
        "source": "T23n1435_034:0245b23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時一比丘應僧中唱言：『大德僧聽！",
        "translation": "Right then, a monk responded to a call from within the saṃgha, saying, 'Listen, great sir!",
        "source": "T23n1435_034:0245b24_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘某甲，能為眾僧作知分臥具人。",
        "translation": "\"Suppose a certain monk can make a person who knows the parts of a layman for the saṃgha.",
        "source": "T23n1435_034:0245b24_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧立比丘某甲作知分臥具人。",
        "translation": "If the saṃgha tolerates listening when the saṃgha arrives, the saṃgha will establish that certain monk as a person who knows his proper share of bedding.",
        "source": "T23n1435_034:0245b25_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白。』",
        "translation": "He said, 'So it is.'",
        "source": "T23n1435_034:0245b26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白二羯磨。",
        "translation": "Thus did he explain the two karmas.",
        "source": "T23n1435_034:0245b27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『僧立某甲比丘作知分臥具人竟，僧忍，默然故，是事如是持！』",
        "translation": "\"After the saṃgha had made that certain monk a knowledgeable bedding person, the saṃgha tolerated it and remained silent, thus maintaining this thing!'",
        "source": "T23n1435_034:0245b27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作知分臥具人，應問舊比丘中善好不妄語能分別臥具者，問此別房中有何等供養？",
        "translation": "\"Suppose someone who knows how to share bedding should ask an old monk who is a good and well-balanced monk and doesn't speak falsely about being able to discern bedding, and ask what offerings are made in this particular room.",
        "source": "T23n1435_034:0245b28_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼別房中、此重閣上悉有何等供養？",
        "translation": "What kind of offerings are made in that particular room or on this heavy shelf?",
        "source": "T23n1435_034:0245c01_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼重閣上悉有何等供養？",
        "translation": "What kind of offerings do they all make at their retired cabinets?",
        "source": "T23n1435_034:0245c02_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊比丘應以實答。",
        "translation": "\"Older monks should answer with the truth.",
        "source": "T23n1435_034:0245c03_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知分臥具人應籌量臥具多少及諸比丘多少，如是籌量臥具諸比丘多少，若一比丘應得一房，便與別房。",
        "translation": "Those who know how to share bedding should assess how much bedding there is and how many monks there are, and thus assess how many monks are bedding, and if a monk deserves a room, then he'll give it to another monk.",
        "source": "T23n1435_034:0245c03_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應先隨上座自恣取，作是言：『大德上座！",
        "translation": "He should first follow the superior monk's instructions and take it from him, saying, 'Great, superior!'",
        "source": "T23n1435_034:0245c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某別房中有如是供養，某甲別房復有如是供養。",
        "translation": "There's an offering like this in a certain special room, and there's another offering like this in a certain apartment.",
        "source": "T23n1435_034:0245c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上座欲取何者，隨所欲取。』",
        "translation": "Whatever you wish to take, you may take it as you like.'",
        "source": "T23n1435_034:0245c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取已次應語第二上座。",
        "translation": "After taking it, you should then say to the second superior seat.",
        "source": "T23n1435_034:0245c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨意取已，又語第三上座。",
        "translation": "After taking it as you like, you should also say to the third seat.",
        "source": "T23n1435_034:0245c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若初上座言：『我欲取第三上座房。』」",
        "translation": "Suppose the first throne says, 'I want to take the third throne's room.'\"",
        "source": "T23n1435_034:0245c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應與，應教作突吉羅悔過。",
        "translation": "The Buddha said, \"You shouldn't give it to him; you should teach him to repent by doing a surpassing act.",
        "source": "T23n1435_034:0245c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是次第一切應與。",
        "translation": "In this order, you should give them all.",
        "source": "T23n1435_034:0245c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘房舍足者與房舍，如是次第若重足者重與。",
        "translation": "If a monk's dwelling is sufficient, he gives it to the monk's dwelling, and in this order, if he has heavy legs, he gives them again.",
        "source": "T23n1435_034:0245c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是次第若床臥具足者，與床臥具。",
        "translation": "In this order, if he has enough bed and bedding, he'll give it to him as a bed and bedding.",
        "source": "T23n1435_034:0245c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與法者，知臥具人，應先語上座自恣隨意取，應言：『某床上有如是供養，某床上有如是供養，上座欲取何者？』",
        "translation": "Those who know the teaching, knowing that the bedding should be taken at the seat's own discretion, should say, 'Such are the offerings on a certain bed, and such are the offerings on a certain bed, what would the seat like to take?'",
        "source": "T23n1435_034:0245c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初上座隨意取已，次語第二上座。",
        "translation": "After the first superior seat takes it as he wishes, he then speaks to the second superior seat.",
        "source": "T23n1435_034:0245c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二上座取已，次語第三上座。",
        "translation": "After the second seat takes it, he then says to the third seat.",
        "source": "T23n1435_034:0245c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三上座取已，若初上座言：『我欲取第三上座床臥具。』」",
        "translation": "After the third seat takes it, if the first seat says, 'I want to take the third seat's bed and bedding,'\" the Buddha said.",
        "source": "T23n1435_034:0245c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應與，應教作突吉羅悔過。」",
        "translation": "The Buddha said, 'You shouldn't give it to him; you should teach him to repent by making a mistake.'\"",
        "source": "T23n1435_034:0245c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一時，跋難陀釋子於祇洹中取臥具分餘處，復取諸比丘言：「汝於此處取分，何故復餘處取？」",
        "translation": "There was a time when the disciple Vānanda took the rest of the bedding in Jīvain and again asked the monks, \"Why did you take the rest of it here?\"",
        "source": "T23n1435_034:0245c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我不復取。」",
        "translation": "They replied, \"I won't take it again.\"",
        "source": "T23n1435_034:0245c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何？",
        "translation": "The monks didn't know what to make of that.",
        "source": "T23n1435_034:0245c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「若比丘更於彼取臥具者，此處已名為捨。",
        "translation": "He told the Buddha about this, and he said, \"If a monk takes his bedding there again, this place is called giving it up.",
        "source": "T23n1435_034:0245c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『我不復取。』",
        "translation": "If he says, 'I won't take it again,' it's also called laying aside the bedding.",
        "source": "T23n1435_034:0245c23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦名捨彼臥具，如《守牧婆羅門婦本生經》廣說。」",
        "translation": "It's also called giving up one's bedding, as explained in detail in the Sutra on the Pastoral Care of Brāhmaṇas.\"",
        "source": "T23n1435_034:0245c24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「昔者有守牧婆羅門婦，教賊殺夫持財物去，中道值水。",
        "translation": "The Buddha said, \"Once, there was a herd-keeper Brāhmaṇa who taught a thief to kill her husband and take his belongings away, and then she ran into water in the middle of the road.",
        "source": "T23n1435_034:0245c25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊語婦言：『汝住此岸，我先渡物還當渡汝。』",
        "translation": "The thief said to the woman, 'You're staying here on this shore, so I'll cross back over to you with my belongings.'",
        "source": "T23n1435_034:0245c26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊尋持衣物渡彼岸，婦便喚言：『汝渡我來。』",
        "translation": "The thief looked for the clothes he was carrying to cross to the other side, and the woman called out to him, saying, 'Cross me over.'",
        "source": "T23n1435_034:0245c27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊言：『弊婢！",
        "translation": "The thief said, 'You bad girl!'",
        "source": "T23n1435_034:0245c28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝自夫不愛，何能愛我？』",
        "translation": "If you don't love your husband, how can you love me?'",
        "source": "T23n1435_034:0245c28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便捨去，婦裸形住。",
        "translation": "Even after putting it away, the woman lived in naked form.",
        "source": "T23n1435_034:0245c29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "跋難陀亦如是，捨此臥具更彼處取，此處已失，復言：『我不復取。』",
        "translation": "So did Vārāṇasī, who left this bedclothes and took it from another place. After losing this place, he again said, 'I won't take it again.'",
        "source": "T23n1435_034:0245c29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處復失。",
        "translation": "That place is again lost.",
        "source": "T23n1435_034:0246a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有往昔，野干銜肉到水岸上，見魚水中反腹，即便捨肉欲往取魚。",
        "translation": "There was another time when a wild trunk carrying meat went to the shore of the water and saw a fish with its belly turned up in the water, so he abandoned the meat and wanted to go get the fish.",
        "source": "T23n1435_034:0246a02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有飛鳥持此肉去。",
        "translation": "A flying bird then carried the flesh away.",
        "source": "T23n1435_034:0246a03_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "跋難陀釋子亦如是。」",
        "translation": "So did the Śākyamuni of Vārāṇasī.\"",
        "source": "T23n1435_034:0246a04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛如是呵已語諸比丘：「從今若比丘取一分臥具已，不應復取。",
        "translation": "After the Buddha thus rebuked him, he told the monks, \"From now on, if a monk takes a piece of the bedding, he shouldn't take it again.",
        "source": "T23n1435_034:0246a04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若更取者，突吉羅。」",
        "translation": "If he takes it again, it's duṣkṛta.\"",
        "source": "T23n1435_034:0246a06_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在憍薩羅國，與大比丘眾俱一處安居。",
        "translation": "The Buddha was staying in Kośala with a large group of monks in one place.",
        "source": "T23n1435_034:0246a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時祇洹中安居比丘少，而臥具多。",
        "translation": "At the time, there were few monks living in Jīvaka and many laying implements.",
        "source": "T23n1435_034:0246a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘各各分已，有餘不盡，隨居士所造房者來問言：「我所作臥具，有比丘住不？」",
        "translation": "After each of the monks had divided it up, and there was more than enough, the monk who followed the house builder came and asked, \"Is there a monk living in the bedding I made?\"",
        "source": "T23n1435_034:0246a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「無人住。",
        "translation": "They replied, \"No one lives here.",
        "source": "T23n1435_034:0246a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T23n1435_034:0246a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今祇洹比丘少臥具多，佛聽受一臥具，不聽受多臥具，故無有人住。」",
        "translation": "Now, since the monk Jīvaka has few things to lay on and many things to lay on, the Buddha listens to accept one thing to lay on and doesn't listen to many things to lay on, so there are no people living here.\"",
        "source": "T23n1435_034:0246a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士言：「我房中先有敷具被枕、前食時食，我當與房舍衣住中食用者善。」",
        "translation": "The monks said, \"If I had spread out a bed and pillow in my room and ate when I was eating, I would give it to someone who eats while living in the monk's robe.\"",
        "source": "T23n1435_034:0246a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何？",
        "translation": "The monks didn't know what to do.",
        "source": "T23n1435_034:0246a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應先人與一，若有長者又應更與，為盡藏物故。",
        "translation": "He told the Buddha about this, and he said, \"The first person should give one, and if there's an elder, he should give more for the sake of exhausting the store of things.",
        "source": "T23n1435_034:0246a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不盡，應第三更與，為經行故。",
        "translation": "If it's not exhausted, you should give it to a third person for the sake of the sūtras' practice.",
        "source": "T23n1435_034:0246a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復不盡，次與令盡，為護治故。」",
        "translation": "If it's not exhausted, give it to the next person to make it exhausted for the sake of protecting and purifying it.\"",
        "source": "T23n1435_034:0246a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時憍薩羅國荒亂，以怖畏故，諸比丘多集一處安居結夏。",
        "translation": "At the time, the country of Kośala was in desolation, and out of fear, the monks gathered in one place to spend the summer retreat.",
        "source": "T23n1435_034:0246a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "坐已有客比丘來，在洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，住待臥具。",
        "translation": "There were guest monks who had arrived while sitting in the footwashing area, lecture hall, gatehouse, sūtra practice area, and sūtra practice head, carrying robes and bowls and standing in those places while waiting for bedding.",
        "source": "T23n1435_034:0246a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見諸比丘在洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，住待臥具。",
        "translation": "The Buddha saw the monks in the footwashing area, lecture hall, gatehouse, sūtra practice area, and sūtra practice head, wearing their robes and bowls in those places, and standing waiting for their bedclothes.",
        "source": "T23n1435_034:0246a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知故問阿難：「諸比丘何以故持衣鉢著講堂、門屋、經行處、經行頭，住何所待？」",
        "translation": "Knowing this, the Buddha therefore asked Ānanda, \"Why are those monks wearing robes and bowls in the discussion hall, entrance hall, sūtra practice area, and sūtra practice head, and where are they staying?\"",
        "source": "T23n1435_034:0246a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「是憍薩羅國荒亂，諸比丘怖畏故，多集一處安居。",
        "translation": "He replied, \"The country of Kośala is in desolation, and the monks are afraid to gather in one place to stay.",
        "source": "T23n1435_034:0246a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是客比丘來，在洗脚處、講堂、門屋、經行處，經行頭，持衣鉢著是諸處，待臥具分。」",
        "translation": "Those visiting monks came and stayed at the footwashing place, lecture hall, gatehouse, sūtra practice area, and sūtra practice head, carrying their robes and bowls and putting them in those places while waiting for their portions to be laid out.\"",
        "source": "T23n1435_034:0246a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今聽二種安居：一、先安居，二、後安居。",
        "translation": "The Buddha said, \"From now on, listen to the two kinds of retreat: first, the first retreat, and second, the latter retreat.",
        "source": "T23n1435_034:0246a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當與後安居比丘房舍臥具。」",
        "translation": "You will give the monk staying afterward a dwelling and bedding.\"",
        "source": "T23n1435_034:0246a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼聞佛聽與後安居比丘房舍臥具，即欲從前安居上座比丘取房舍臥具，以是因緣故，鬪諍事起。",
        "translation": "When he heard that the Buddha had heard that he would give the monk who had settled down the monk's dwelling and bedding, he wanted to take the dwelling and bedding from the monk who had previously settled down the monk, and because of that cause, a dispute arose.",
        "source": "T23n1435_034:0246a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「後安居上座比丘，不應從前安居上座比丘取房舍臥具。",
        "translation": "The Buddha said, \"A monk who's settled on the throne should not take the bedding and bedclothes from a monk who's settled on the throne before him.",
        "source": "T23n1435_034:0246b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若前安居上座有二分臥具者，應與後一分。」",
        "translation": "If the monk who's previously installed as the elder monk has two parts of the bedding, he should give the latter part to him.\"",
        "source": "T23n1435_034:0246b03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍薩羅國又復荒亂，有諸比丘多集一處安居，分房舍臥具竟。",
        "translation": "Again, in the desolation of Kośala, there were monks who had gathered in one place to live, and they shared their living quarters and bedding.",
        "source": "T23n1435_034:0246b04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有餘處諸比丘來，在洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，待臥具分。",
        "translation": "There were monks from other places who came and put their robes and bowls in the footwashing place, lecture hall, gatehouse, sūtra practice area, and sūtra practice head, waiting for their share of the bedding.",
        "source": "T23n1435_034:0246b06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見諸比丘持衣鉢著是諸處待臥具分，佛知而故問阿難：「諸比丘何故在洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，住何所待？」",
        "translation": "When the Buddha saw the monks holding their robes and bowls in these places while waiting for their portions of bedding, he knew and therefore asked Ānanda, \"Why are the monks holding their robes and bowls in these places, such as the footwashing place, lecture hall, gatehouse, sūtra practice place, and sūtra practice head, and where are they staying?\"",
        "source": "T23n1435_034:0246b08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0246b11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍薩羅國荒亂怖畏。",
        "translation": "The country of Kośala was desolate and frightening.",
        "source": "T23n1435_034:0246b11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘安居分臥具竟，是諸比丘從餘處來，在洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，待臥具分。」",
        "translation": "After the monks had finished dividing the bedding for their retreat, those monks came from elsewhere and put their robes and bowls in the footwashing place, lecture hall, gatehouse, sūtra practice area, and sūtra practice head, waiting for the bedding to be divided.\"",
        "source": "T23n1435_034:0246b11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若有未分臥具者應與分，已分者應共住。」",
        "translation": "The Buddha said, \"If someone has not shared the bedding, they should share it with him, and if they have shared it, they should live together.\"",
        "source": "T23n1435_034:0246b14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又時憍薩羅國荒亂，有臣處處鬪戰。",
        "translation": "It was also a time when the country of Kośala was in a state of desolation, and there were ministers fighting all over the place.",
        "source": "T23n1435_034:0246b15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘已結後安居，多有客比丘來，在洗脚處講堂、門屋、經行處、經行頭，持衣鉢著是諸處，待臥具分。",
        "translation": "After the monks had finished tying up their affairs and settled down, many guest monks came and put their robes and bowls in the discussion hall, entrance hall, sūtra practice area, and sūtra practice head, waiting for their share of the bedding.",
        "source": "T23n1435_034:0246b16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見客比丘持衣鉢著是諸處待臥具分，佛知故問阿難：「諸客比丘何故在洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，住何所待？」",
        "translation": "Seeing the guest monks holding their robes and bowls in those places while waiting for their portions of the bed, the Buddha knew and therefore asked Ānanda, \"Why are the guest monks staying in the footwashing place, lecture hall, gatehouse, sūtra practice place, and sūtra practice head with their robes and bowls in those places?\"",
        "source": "T23n1435_034:0246b18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0246b21_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍薩羅國荒亂，有臣處處鬪戰。",
        "translation": "The country of Kośala is in a state of wilderness, and there are ministers who fight on every side.",
        "source": "T23n1435_034:0246b21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘後結坐竟，是客比丘來，至洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，待臥具分。」",
        "translation": "After the monks finished their final sittings, this visiting monk came and went to the footwashing area, lecture hall, gatehouse, sūtra practice area, and sūtra practice head, and put his robe and bowl in those places while waiting for his bed to be finished.\"",
        "source": "T23n1435_034:0246b22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若有空房者應與，若無者應共住，與溫室令安衣鉢，應當隨僧乞食。",
        "translation": "The Buddha said, \"If there's a vacant house, you should give it to him; if there isn't one, you should share it with him; give him a warm room to put his robe and bowl in; and you should follow the saṃgha to solicit alms.",
        "source": "T23n1435_034:0246b24_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是中有舊比丘善好樂福德者，應為客比丘求索衣物，莫令是比丘無所得去。」",
        "translation": "If there's an old monk there who's good, happy, and virtuous, you should ask for clothing for the visiting monk, so that he doesn't go away without getting it.\"",
        "source": "T23n1435_034:0246b26_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有阿練兒比丘，從舊比丘求索舉衣鉢屋，諸比丘言：「佛未聽我等與阿練兒舉衣鉢屋。」",
        "translation": "When an Altair monk asked for a robe and bowl house from an old monk, the monks said, \"The Buddha hasn't heard of our raising a robe and bowl house with Altair.\"",
        "source": "T23n1435_034:0246b28_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今聽與阿練兒比丘舉衣鉢屋。」",
        "translation": "They told the Buddha about this, and he said, \"From now on, we'll listen to the monk Altair as he raises his robe and bowl house.\"",
        "source": "T23n1435_034:0246c01_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有諸客比丘，暫來無住處疲極苦惱，是事白佛，佛言：「應暫與房舍臥具。」",
        "translation": "It was then that some visiting monks who had come for a short time and had no place to stay became extremely weary and distressed, and they said to the Buddha, \"You should temporarily give them a dwelling and bedding.\"",
        "source": "T23n1435_034:0246c02_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有時一比丘來宿已，早起便去。",
        "translation": "One time, a monk who had come to stay overnight got up early and left.",
        "source": "T23n1435_034:0246c04_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是房中所有供養，前食時食乃至房舍衣，舊比丘生疑：「客比丘來是房中宿，早起便去，有是供養分，不知云何？」",
        "translation": "Regarding the offerings he made in that dwelling, the food he ate at mealtime and the clothing he wore in the dwelling, the old monk had this doubt, \"What is the portion of offerings for a visiting monk who comes to stay overnight in that dwelling and gets up early and leaves?\"",
        "source": "T23n1435_034:0246c04_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「客比丘雖在中宿，住者房舍應受。」",
        "translation": "This was brought to the Buddha's attention, and he said, \"Although the guest monk is staying overnight in the midst of the night, the lodging should be accepted.\"",
        "source": "T23n1435_034:0246c07_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎佛在舍衛國。",
        "translation": "â€œThe Buddha was in Śrāvastī.",
        "source": "T23n1435_034:0246c08_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘廢學比尼，誦讀修多羅、阿毘曇，遠離比尼。",
        "translation": "At the time, the monks abandoned their training as nuns, recited sūtra and abhidharma, and stayed away from the nuns.",
        "source": "T23n1435_034:0246c09_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見諸比丘不學比尼，誦讀修多羅、阿毘曇，遠離比尼故。",
        "translation": "The Buddha saw that the monks didn't train as nuns, chanted sūtra and abhidharma, and stayed away from the nuns.",
        "source": "T23n1435_034:0246c10_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已讚歎比丘通利比尼者，面前讚歎：「長老優波離！",
        "translation": "Those who praised the monks' access to the vinaya after seeing that praised them before him, \"Elder Upāli!",
        "source": "T23n1435_034:0246c11_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸持比尼中最勝第一。」",
        "translation": "He's the most excellent among the nuns who uphold him.\"",
        "source": "T23n1435_034:0246c13_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘作是念：「佛讚歎比丘通利比尼者，面前讚歎：『長老優波離！",
        "translation": "The monks had this thought, \"The Buddha praised the monks and nuns for their supernormal abilities and praised them before him, 'Elder Upāli!'",
        "source": "T23n1435_034:0246c13_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸持比尼中最為第一。』",
        "translation": "He's the best among those who recite the Vinaya.'",
        "source": "T23n1435_034:0246c15_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等何不讀誦比尼？」",
        "translation": "Why don't we recite the Vinaya?\"",
        "source": "T23n1435_034:0246c15_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸上座長老比丘，從長老優波離受誦比尼。",
        "translation": "\"The elder monks who sit on the throne accept the recitation of the precepts from Elder Upāli.",
        "source": "T23n1435_034:0246c16_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離，不為高處坐教，恭敬上座故，亦不下處坐教，為尊法故。",
        "translation": "The elder Upāli doesn't teach from a high seat in deference to the superior seat, nor does he teach from a low seat in deference to the teaching.",
        "source": "T23n1435_034:0246c17_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若經行時、若立時教。",
        "translation": "He teaches it when he's walking through the sutra or when he's standing up.",
        "source": "T23n1435_034:0246c18_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長老優波離，行立久故，患脚痛、[蹲-酋+(十/田/ㄙ)]膝髀腰脇脊痛，是事白佛。",
        "translation": "It was then that Upāli the Elder, who had been walking and standing for a long time, suffered from pain in his feet and [squatting - sheik + (ten/field/pan)] knees, thighs, back, and thighs, and pain in his back, and he told the Buddha about it.",
        "source": "T23n1435_034:0246c19_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，知而故問長老優波離：「優波離！",
        "translation": "The Buddha gathered the monks because of this, and knowing this, he asked the elder Upāli, \"Upāli!",
        "source": "T23n1435_034:0246c20_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實有上座比丘，從汝受比尼，汝不高處坐教，恭敬上座故，又不下處坐教，為尊法故。",
        "translation": "\"There really is a superior monk who accepts the vinaya from you and teaches that you don't sit up high in deference to the superior seat and don't sit down low in deference to the teaching.",
        "source": "T23n1435_034:0246c21_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝經行時、若立時教，行立久故，患脚痛、[蹲-酋+(十/田/ㄙ)]膝髀腰脇脊痛。",
        "translation": "When you walk through the scriptures, if you teach while standing, you'll suffer from pain in your feet and [squatting - sheikh + (ten/field/tongyan)] knees, thighs, lumbar and hypochondriacal spinal pains as a result of walking and standing for a long time.",
        "source": "T23n1435_034:0246c23_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝實爾不？」",
        "translation": "Is that true for you?\"",
        "source": "T23n1435_034:0246c25_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "They replied, \"That's true.",
        "source": "T23n1435_034:0246c25_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_034:0246c25_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種因緣讚戒、讚持戒，讚戒、讚持戒已，語諸比丘：「從今聽下座比丘欲教上座法者，應在高處坐教，為尊法故。",
        "translation": "After praising the precepts and upholding them for various reasons, the Buddha praised them and said to the monks, \"From now on, anyone who listens to a monk from a lower seat who wants to teach the Dharma to a higher seat should sit up high and teach it for the sake of honoring the Dharma.",
        "source": "T23n1435_034:0246c25_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若上座欲從下座受法者，應在下處坐受法，為尊法故。",
        "translation": "If a superior monk wants to receive the teaching from a junior monk, he should sit down and receive the teaching in a lower place, for the sake of honoring the Dharma.",
        "source": "T23n1435_034:0246c28_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今聽下座比丘教上座法者，得共等床坐，為上座故。」",
        "translation": "From now on, someone who listens to a lower-seated monk teach the higher seat the Dharma will be able to sit on the same level bed as the higher seat.\"",
        "source": "T23n1435_034:0246c29_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與大比丘眾俱，遊行憍薩羅國。",
        "translation": "The Buddha traveled to the country of Kośala with a great assembly of monks.",
        "source": "T23n1435_034:0247a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸長老舍利弗、目連、阿那律、難提、金毘羅皆隨從佛。",
        "translation": "The elders Śāriputra, Maudgalyāyana, Aniruddha, Nandika, and Kimbila all followed the Buddha.",
        "source": "T23n1435_034:0247a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸長老所言真實，能苦切語折伏眾人，為諸比丘作種種羯磨：苦切羯磨、依止羯磨、下意羯磨、驅出羯磨。",
        "translation": "Those elders spoke the truth, spoke bitterly to convince the people, and performed various kinds of retribution for the monks: retribution for bitterness, retribution for reliance, retribution for submission, and retribution for expulsion.",
        "source": "T23n1435_034:0247a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時憍薩羅國有一住處，多諸比丘住，是諸比丘聞佛與大比丘僧舍利弗、目連、阿那律、難提、金毘羅等俱來遊行憍薩羅國，是諸長老所言真實，能苦切語折伏眾人，為諸比丘作諸羯磨：苦切羯磨、依止羯磨、下意羯磨、驅出羯磨。",
        "translation": "At the time, there was a dwelling place in Kośala where many monks were staying, and those monks heard that the Buddha and the great monks Śāriputra, Maudgalyāyana, Aniruddha, Nandika, and Kimbila had come to parade through Kośala, and that what the elders said was true; they were able to speak bitterly and subdue the people and perform various punishments for the monks: punishments of painful cutting, punishments of depending, punishments of lowering the mind, and punishments of expelling.",
        "source": "T23n1435_034:0247a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「今當至此必為我等作諸羯磨，我等何不以此住處羯磨付一比丘？」",
        "translation": "\"Now, when we arrive here, why don't we give this monk a monk to perform the karman of our dwelling place?\"",
        "source": "T23n1435_034:0247a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即用羯磨付一比丘。",
        "translation": "After he had this thought, he instructed a monk in karma.",
        "source": "T23n1435_034:0247a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛來到是處，是比丘為佛敷好坐具置好房中，然後小遠避藏作是念：「若我住者，佛必令我為諸客比丘敷坐臥具。」",
        "translation": "When the Buddha arrived, that monk prepared a sitting cloth for the Buddha and put it in a nice room. Then he took refuge in a small place and thought, \"If I were staying here, the Buddha would make me prepare sitting and sleeping cloths for the guest monks.\"",
        "source": "T23n1435_034:0247a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛受是房已，餘客比丘，在洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處，待臥具分。",
        "translation": "After the Buddha accepted this room, the other guest monks put their robes and bowls in the footwashing area, lecture hall, gatehouse, sūtra practice area, and sūtra practice head, where they were waiting for their portions of the bedding.",
        "source": "T23n1435_034:0247a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見諸比丘持衣鉢著是諸處待臥具分，佛知故問阿難：「諸比丘何以故洗脚處、講堂、門屋、經行處、經行頭，以衣鉢著是諸處住，何所待？」",
        "translation": "Seeing the monks holding their robes and bowls in those places while waiting for their portions of bedding, the Buddha knew and therefore asked Ānanda, \"Why do the monks wash their feet in those places, wash the lecture hall, enter the room, walk through the door, walk through the sutra, and walk through the head of the sutra, and what do they do while holding their robes and bowls in those places?\"",
        "source": "T23n1435_034:0247a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0247a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "待舊比丘與臥具分。」",
        "translation": "Wait for the old monk to share his bedclothes with you.\"",
        "source": "T23n1435_034:0247a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「汝往語舊比丘：『開房與客比丘臥具。』」",
        "translation": "The Buddha told Ānanda, \"Go ahead and tell the old monk, 'Open your room and give the guest monk his bedclothes.'\"",
        "source": "T23n1435_034:0247a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難受教，語舊比丘：「開房與客比丘臥具。」",
        "translation": "Ānanda accepted the teaching and said to the old monk, \"Open your room and give the guest monk a bedclothes.\"",
        "source": "T23n1435_034:0247a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊比丘言：「汝知不？",
        "translation": "The old monk said, \"Do you know that?",
        "source": "T23n1435_034:0247a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此非僧房，我等以羯磨付一比丘。」",
        "translation": "This is not the monk's quarters; we gave the monk a karmic mandate.\"",
        "source": "T23n1435_034:0247a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，呵責言：「云何名比丘，以僧房羯磨與一比丘？」",
        "translation": "A monk who was practicing the ascetic practice of having few desires and being satisfied was displeased when he heard this, and he rebuked him, saying, \"What do you call a monk who gives a monk the karma of the saṃgha hall?\"",
        "source": "T23n1435_034:0247a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "呵已向佛廣說。",
        "translation": "After he rebuked him, he explained it in detail to the Buddha.",
        "source": "T23n1435_034:0247a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，種種因緣呵責舊比丘：「云何名比丘，以僧房羯磨與一比丘？」",
        "translation": "It was for this reason that the Buddha gathered the monks together and rebuked the old monks for various reasons, \"What do you call a monk who gives a monk a monk's room for karma?\"",
        "source": "T23n1435_034:0247a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "呵已語諸比丘：「從今不聽以僧房羯磨與一比丘。",
        "translation": "After he rebuked them, he told the monks, \"From now on, I won't listen to a monk who gives me the monk's room karma.",
        "source": "T23n1435_034:0247a29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若與者，得突吉羅。",
        "translation": "If you do, you'll attain the status of duṣkṛta.",
        "source": "T23n1435_034:0247b01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是僧房雖與不成與。」",
        "translation": "Even though this is the monk's quarters, it won't be given.\"",
        "source": "T23n1435_034:0247b01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復與大比丘僧遊行諸國土，或無僧房處，投林中宿。",
        "translation": "The Buddha then traveled with a large assembly of monks to various lands or places where there was no monk's quarters and stayed overnight in a forest.",
        "source": "T23n1435_034:0247b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時六群比丘告其弟子：「汝先往宿處，好樹留佛，次有好者與我占取。」",
        "translation": "It was then that the six groups of monks told their disciple, \"Go ahead and stay overnight, leaving a good tree with the Buddha, and then take the next one that's good with me.\"",
        "source": "T23n1435_034:0247b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子先去，好樹留佛，占次好者。",
        "translation": "The disciples went first, leaving the Buddha in a nice tree and taking possession of the next best thing.",
        "source": "T23n1435_034:0247b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連隨佛後至，次欲取樹。",
        "translation": "Śāriputra and Maudgalyāyana followed the Buddha's lead and wanted to take the next best tree.",
        "source": "T23n1435_034:0247b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘言：「他已先取。」",
        "translation": "One of the monks said, \"He has already taken it first.\"",
        "source": "T23n1435_034:0247b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第二、第三、第四，皆言已取。",
        "translation": "Thus, the second, third, and fourth [monks] all said they had taken it.",
        "source": "T23n1435_034:0247b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至外行樹下宿。",
        "translation": "They even went out and stayed under the tree.",
        "source": "T23n1435_034:0247b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知故問阿難：「舍利弗、目連今在何處？」",
        "translation": "Knowing this, the Buddha therefore asked Ānanda, \"Where are Śāriputra and Maudgalyāyana now?\"",
        "source": "T23n1435_034:0247b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「在外行樹下。」",
        "translation": "He replied, \"It's under a tree that grows outside.\"",
        "source": "T23n1435_034:0247b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「喚來！」",
        "translation": "The Buddha said, \"Call me!\"",
        "source": "T23n1435_034:0247b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難受教即往喚來。",
        "translation": "Ānanda was instructed to go and call them back.",
        "source": "T23n1435_034:0247b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知故問舍利弗、目連：「汝等何故外行樹下？」",
        "translation": "Knowing this, the Buddha asked Śāriputra and Maudgalyāyana, \"Why are you walking outside under the tree?\"",
        "source": "T23n1435_034:0247b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0247b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘知佛宿處，告其弟子：『汝先往宿處，好樹留佛，次有好者為我占取。』",
        "translation": "Knowing where the Buddha had stayed overnight, the six groups of monks told their disciples, 'Go ahead and leave a good tree with the Buddha where you stayed overnight, and then someone good will take it for me.'",
        "source": "T23n1435_034:0247b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等隨佛後到，次欲取樹。",
        "translation": "We followed the Buddha's lead, and then we wanted to take the tree.",
        "source": "T23n1435_034:0247b13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘言：『他已占取。』",
        "translation": "One of the monks said, 'He's already taken it.'",
        "source": "T23n1435_034:0247b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第二、第三、第四，皆言已取，是故我等外行樹下。」",
        "translation": "Thus, the second, third, and fourth [monks] all said they had taken it, and we therefore went out to the tree.\"",
        "source": "T23n1435_034:0247b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今聽諸比丘隨上座次住樹下。」",
        "translation": "The Buddha said, \"From now on, listen to the monks who follow the elder monk's lead and stay under the tree.\"",
        "source": "T23n1435_034:0247b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸下座比丘聞已，好樹下所有草敷葉敷盡取持去，下座比丘從索不與。",
        "translation": "After the lower-seated monks heard this, they gathered all the grass and leaves under the good tree and took them away, but the lower-seated monks didn't take them from him.",
        "source": "T23n1435_034:0247b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，鬪諍事起，佛言：「不應持去。」",
        "translation": "As a result, a dispute arose, and the Buddha said, \"You shouldn't take them away.\"",
        "source": "T23n1435_034:0247b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸上座比丘聞不聽持去，樹下先有草敷葉敷及下座比丘自所敷者，皆不與去，佛言：「先者應留，餘者聽持去。」",
        "translation": "When the higher-seated monks heard that they wouldn't hear of it, they didn't take the previous patch of grass and leaves under the tree or the patch that the lower-seated monks had laid themselves, and the Buddha said, \"The first one should stay, and the rest should be taken away.\"",
        "source": "T23n1435_034:0247b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與大比丘眾迦尸國中遊行，諸大弟子：舍利弗、目連、阿那律、難提、金毘羅等，皆悉隨從。",
        "translation": "The Buddha and a large assembly of monks marched through the country of Kāśī, and the great disciples, namely, Śāriputra, Maudgalyāyana, Aniruddha, Nandika, and Kimbila, all followed suit.",
        "source": "T23n1435_034:0247b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸長老所言真實，能苦切語折伏眾人，與諸比丘作諸羯磨：苦切羯磨、依止羯磨、下意羯磨、驅出羯磨。",
        "translation": "These elders spoke the truth, spoke with bitterness, subdued the people, and performed various rituals with the monks, including the ritual of bitterness, the ritual of reliance, the ritual of submission, and the ritual of expulsion.",
        "source": "T23n1435_034:0247b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦羅山上有諸比丘，不念護戒，聞佛與大比丘眾舍利弗、目連、阿那律、難提、金毘羅等迦尸國遊行，是諸長老所言真實，能苦切語折伏眾人，與諸比丘作苦切羯磨、依止羯磨、下意羯磨、驅出羯磨。",
        "translation": "It was then that some monks on Mount Kālā who were not mindful of the precepts and had heard that the Buddha and the great assembly of monks Śāriputra, Maudgalyāyana, Aniruddha, Nandika, and Kimbila had marched through the country of Kāśyapa, and that what the elders had said was true, that they could speak bitterly and persuasively to subdue the crowd, and that they had conducted a painful karman, a supportive karman, a subdued karman, and a karman of expulsion with the monks.",
        "source": "T23n1435_034:0247b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是等今來將無為我等作諸羯磨？",
        "translation": "\"Are these the kinds of karmas that will be performed for us now?",
        "source": "T23n1435_034:0247c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛比尼中說不得以僧房羯磨與一比丘，我等今以此僧房作四分，隨僧地、房舍、園林、根莖、枝葉、花果，皆作四分。」",
        "translation": "It's said among the Buddhas and nuns that you can't give a monk the karma of a monk's room, so now we'll make four parts of this monk's room, following the monk's lot, the monk's dwelling, the grove, the roots, the leaves, the flowers, and the fruit, all of which are made into four parts.\"",
        "source": "T23n1435_034:0247c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即分僧房、僧地、房舍、園林、根莖、枝葉、花果，皆分作四分羯磨與四比丘。",
        "translation": "After this thought, he divided the saṃgha hall, the grounds, the buildings, the groves, the roots, the leaves, and the flowers and fruits into four parts, which were all divided into four parts for the monks and karmas.",
        "source": "T23n1435_034:0247c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與諸比丘遊行次到是處，是中舊比丘敷一好房與佛，小遠避藏作是念：「恐佛約勅，為諸比丘開房與臥具分。」",
        "translation": "When the Buddha and the monks paraded up to that place, the older monks prepared a nice room for the Buddha, and Sayuan avoided the monk's retreat, thinking, \"I'm afraid the Buddha has promised to open a room and share the bedding with the other monks.\"",
        "source": "T23n1435_034:0247c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸客比丘來，洗脚處、講堂、門屋、經行處、經行頭，持衣鉢著是諸處立，待臥具分。",
        "translation": "The guest monks came and stood at the footwashing place, the discussion hall, the entrance hall, the sūtra practice area, and the sūtra practice head with their robes and bowls while waiting for their share of the bedding.",
        "source": "T23n1435_034:0247c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見諸比丘以衣鉢著是處待臥具分，知而故問阿難：「諸比丘何故以衣鉢著洗脚處、講堂、門屋、經行處、經行頭，住何所待？」",
        "translation": "Seeing the monks holding their robes and bowls in these places while waiting for the bedding part, the Buddha knew and therefore asked Ānanda, \"Why are the monks holding their robes and bowls in the footwashing place, lecture hall, gatehouse, sūtra practice place, and sūtra practice head, and where are they staying?\"",
        "source": "T23n1435_034:0247c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0247c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸比丘待舊比丘與臥具分。」",
        "translation": "These monks are expecting the old monks to share their bedclothes with them.\"",
        "source": "T23n1435_034:0247c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「汝往約勅舊比丘，開房與客比丘臥具。」",
        "translation": "The Buddha told Ānanda, \"Go and agree with me to tell the old monks to open their rooms and give the guest monks their bedclothes.\"",
        "source": "T23n1435_034:0247c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難受教，即往語舊比丘：「開房與客比丘房舍臥具。」",
        "translation": "Ananda was instructed, and he went and said to the old monk, \"Open the monk's dwelling and give the guest monk a share of the bedding.\"",
        "source": "T23n1435_034:0247c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊比丘言：「此處僧坊、房舍、園林、根莖、枝葉、花果皆作四分，羯磨與四比丘，非是僧物。」",
        "translation": "The old monk said, \"This is a monk's residence, a dwelling, a grove, roots, leaves, flowers, and fruits that have been made into four parts, and the karma has been given to four monks; they aren't the property of the saṃgha.\"",
        "source": "T23n1435_034:0247c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，呵責言：「云何名比丘，以僧坊分作四分，羯磨與四比丘？」",
        "translation": "A monk who was practicing the ascetic practice of having few desires and being satisfied was displeased when he heard this, and he rebuked him, saying, \"What's the name of a monk who makes four parts of the monk's quarters and distributes them to the four monks?\"",
        "source": "T23n1435_034:0247c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "呵已向佛廣說，佛言：「從今不聽以僧房舍分作四分。",
        "translation": "After he had spoken to the Buddha, he explained it in detail, and he said, \"From now on, you won't hear the saṃgha's quarters being divided into four parts.",
        "source": "T23n1435_034:0247c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若分者，突吉羅，此不成為分。」",
        "translation": "If it were divided, then, duṣkṛta, this wouldn't be a division.\"",
        "source": "T23n1435_034:0247c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在阿羅毘國。",
        "translation": "The Buddha was in the country of Arabya.",
        "source": "T23n1435_034:0247c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿羅毘國僧坊崩壞，佛知故問阿難：「是僧房重閣何故崩壞？」",
        "translation": "At the time, the monk's residence in Aravaipa collapsed, and the Buddha knew so he asked Ānanda, \"Why has this heavy monk's residence collapsed?\"",
        "source": "T23n1435_034:0247c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T23n1435_034:0247c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修治是僧坊人，有死者、病者、反戒者、餘國去者。」",
        "translation": "He purifies those in the saṃgha's quarters who are dead, sick, against the precepts, or who have left from another country.\"",
        "source": "T23n1435_034:0247c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「死者、反戒者所應作事，僧更應羯磨立知是事人，若有病者應問：『汝故能治是壞房舍不？』",
        "translation": "The Buddha said, \"The deceased and those who have violated the precepts should be made to work, and the saṃgha should furthermore karmically establish the knowledge that these are the people who work, and if they're sick, they should ask, 'Are you therefore able to heal this damaged dwelling?'",
        "source": "T23n1435_034:0247c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『我能。』",
        "translation": "If he says, 'I can.'",
        "source": "T23n1435_034:0247c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應待。",
        "translation": "you should wait.'",
        "source": "T23n1435_034:0247c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『不能。』",
        "translation": "If you say, 'I can't,'",
        "source": "T23n1435_034:0247c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應更立餘人。",
        "translation": "you should create another person.'",
        "source": "T23n1435_034:0247c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他國去者，若疑當還，應待。",
        "translation": "If someone from another country goes away and doubts that they will return, they should wait.",
        "source": "T23n1435_034:0248a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知不還者，應更立餘人，令知是人所作事。」",
        "translation": "If you know you won't return, you should appoint another person to know what that person is doing.\"",
        "source": "T23n1435_034:0248a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛作是語已，諸比丘便立知事人。",
        "translation": "After the Buddha said this, the monks then created a person who knows the task.",
        "source": "T23n1435_034:0248a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是知事人，有掃少地者、有塞小孔者、或以少草覆舍者，佛言：「如是作小小事者，不應立作知事人。",
        "translation": "If that person knows the duties of someone who sweeps a small area, plugs a small hole, or covers a hut with a little grass, the Buddha said, \"Such a person who does small or trivial tasks shouldn't be made a person who knows the duties of others.",
        "source": "T23n1435_034:0248a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能辦大事，應羯磨立作知事人。」",
        "translation": "If they can do great things, they should be ordained as a person in charge of them.\"",
        "source": "T23n1435_034:0248a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘有能多致財物、能成辦事者，諸比丘便盡形立作知事人，佛言：「不應爾。",
        "translation": "If monks who are capable of generating much wealth and accomplishing tasks then exhaust their physical appearance and establish themselves as knowledgeable servants, the Buddha said, \"That shouldn't be the case.",
        "source": "T23n1435_034:0248a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若房舍故壞，應六年立作。",
        "translation": "If your house has been decayed, you should build it in six years.",
        "source": "T23n1435_034:0248a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若新房舍，應十二年立作。」",
        "translation": "If it's a new dwelling, it should be erected in 12 years.\"",
        "source": "T23n1435_034:0248a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「從今知房舍人，應三事自恣：冬房、春房、夏房。",
        "translation": "The Buddha said, \"From now on, a person who knows the monk's quarters should perform three duties on his own: a winter quarters, a spring quarters, and a summer quarters.",
        "source": "T23n1435_034:0248a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧問言：『汝須何房？",
        "translation": "The monks asked, 'Which room do you need?'",
        "source": "T23n1435_034:0248a10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "冬房、春房、夏房耶？』",
        "translation": "What about the winter retreat, the spring retreat, and the summer retreat?'",
        "source": "T23n1435_034:0248a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『我須冬房。』",
        "translation": "If he says, 'I need a winter retreat,'",
        "source": "T23n1435_034:0248a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以春房、夏房隨上座次與。",
        "translation": "take the spring and summer quarters and give them to the person seated above in order.",
        "source": "T23n1435_034:0248a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：『我須夏房。』",
        "translation": "If you say, 'I need a summer retreat,'",
        "source": "T23n1435_034:0248a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以冬房、春房隨上座次與。」",
        "translation": "Take the winter and spring quarters and give them to him in the order of your seat.'\"",
        "source": "T23n1435_034:0248a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城。",
        "translation": "The Buddha was in the city of Rājagṛha.",
        "source": "T23n1435_034:0248a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時跋提居士，起僧房重閣高大莊嚴，多諸男女觀看。",
        "translation": "At the time, Bhadrika built a large and ornate saṃgha hall, which was crowded with men and women watching.",
        "source": "T23n1435_034:0248a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人生念：「此必佛塔、若阿羅漢塔。」",
        "translation": "The people thought, \"This must be a stūpa of the Buddha or an arhat stūpa.\"",
        "source": "T23n1435_034:0248a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是僧坊中多人禮拜圍繞，多象聲、馬聲、男女聲，妨坐禪讀經。",
        "translation": "In that monastery, many people worshiped and surrounded by the sounds of elephants, horses, and men and women, which prevented them from sitting in meditation and reading the sūtras.",
        "source": "T23n1435_034:0248a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長老上座，捨是重閣住小房中。",
        "translation": "The elder monk, the senior monk, then left this heavy pavilion and stayed in a small room.",
        "source": "T23n1435_034:0248a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有客比丘來者，皆作是念：「重閣中必有上座，我等何不至邊小房住。」",
        "translation": "When some visiting monks arrived, they all thought, \"There must be a superior seat in that heavy cabinet, so why don't we go live in the small room nearby?\"",
        "source": "T23n1435_034:0248a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往打戶，房內應聲，客比丘問：「汝幾歲？」",
        "translation": "They went to the door, and when there was a response from inside the room, the visiting monks asked, \"How old are you?\"",
        "source": "T23n1435_034:0248a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我爾所歲。」",
        "translation": "He replied, \"So long have I been here.\"",
        "source": "T23n1435_034:0248a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客比丘念：「若小房中比丘爾所歲者，何況大房。」",
        "translation": "The visiting monk thought, \"If a monk in a small room would have longed for this, how much more so in a large room?\"",
        "source": "T23n1435_034:0248a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有詣洗脚處、講堂、中門、屋下宿，晨起至重閣前，立欲禮敬上座。",
        "translation": "Some monks who had stayed at the footwashing area, the discussion hall, the central entrance, or under the roof got up in the morning and went to the central pavilion, where they wanted to pay homage to the elder monk.",
        "source": "T23n1435_034:0248a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有年少比丘及沙彌，從重閣上來下，問客比丘：「汝作何等？」",
        "translation": "A young monk or novice monk came down from the upper hall and asked the visiting monk, \"What did you do?\"",
        "source": "T23n1435_034:0248a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「欲禮敬上座。」",
        "translation": "He replied, \"I want to pay homage to the throne.\"",
        "source": "T23n1435_034:0248a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語言：「此無上座。」",
        "translation": "He said, \"There's no ascended master here.\"",
        "source": "T23n1435_034:0248a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：「誰是中宿？」",
        "translation": "He asked, \"Who's the middle seat?\"",
        "source": "T23n1435_034:0248a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「我等。」",
        "translation": "He replied, \"We are.\"",
        "source": "T23n1435_034:0248a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客比丘言：「我等知者，應是中宿。」",
        "translation": "The visiting monk said, \"We know that this should be our lodging in the middle.\"",
        "source": "T23n1435_034:0248a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問客比丘：「汝何處宿？」",
        "translation": "The guest monk was asked, \"Where did you stay overnight?\"",
        "source": "T23n1435_034:0248a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有洗脚處宿者答言：「洗脚處宿。」",
        "translation": "The one who stayed at the place where he washed his feet answered, \"Stay at the place where he washed his feet.\"",
        "source": "T23n1435_034:0248a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "講堂中者答言：「講堂中宿。」",
        "translation": "Those in the lecture hall replied, \"Staying overnight in the lecture hall.\"",
        "source": "T23n1435_034:0248a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至門屋下者答言：「門屋中宿。」",
        "translation": "Someone staying under the doorway replied, \"Staying overnight in the doorway.\"",
        "source": "T23n1435_034:0248b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是事白佛，佛言：「應立知敷臥具人。",
        "translation": "The monks told the Buddha about this, and he said, \"You should appoint someone who knows how to lay out a bed.",
        "source": "T23n1435_034:0248b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知敷臥具人，應隨上座次第與，應作是言：『此是上座房舍臥具，次第住。』」",
        "translation": "Someone who knows how to lay out bedding should follow the ascendants in order and should say, 'This is the ascendants' bedding, which is put up in order.'\"",
        "source": "T23n1435_034:0248b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在迦尸國，與大比丘眾一處安居。",
        "translation": "The Buddha was staying in Kāsi country with a large assembly of monks in one place.",
        "source": "T23n1435_034:0248b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士見佛及僧眾，故共相約令：「今日汝辦種種飲食，明日次某。",
        "translation": "When the monks saw the Buddha and the community of monks, they all agreed, \"Today, you'll prepare various meals, and tomorrow you'll eat in turn.",
        "source": "T23n1435_034:0248b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是展轉種種飲食：相食、故作食、十五日食、三十日食。」",
        "translation": "Thus, you will continue to eat various foods: food for signs, food for deeds, food for fifteen days, and food for thirty days.\"",
        "source": "T23n1435_034:0248b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立如是制已，有早辦者、有晚辦者、有近者、有遠者、有美者、有不美者，是中無知食比丘約勅令至某家，有早辦者、有晚辦者、有近者，是食美好。",
        "translation": "After establishing this rule, there were those who prepared food early, those who prepared food late, those who were near, those who were far away, and those who were beautiful and those who were not beautiful, and among them, the monks who had no knowledge of food were ordered to come to a certain house, prepare food early, prepare food late, and prepare food near, which was beautiful.",
        "source": "T23n1435_034:0248b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時六群比丘數數從是處取，居士問言：「汝等何以數來？",
        "translation": "Six groups of monks then repeatedly took food from this place, and the monks asked, \"Why do you count them?",
        "source": "T23n1435_034:0248b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大長老何故不來？」",
        "translation": "Why haven't the elders come?\"",
        "source": "T23n1435_034:0248b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「無知食人約勅我等，汝舍近、早辦、飲食美好，是故我等數來。」",
        "translation": "They replied, \"The ignorant eater promised us that your house would be close by, that it would be prepared early, and that the food would be good; therefore, we've come often.\"",
        "source": "T23n1435_034:0248b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士言：「我等施食為諸長老！",
        "translation": "The monks said, \"We're giving food to the elders!",
        "source": "T23n1435_034:0248b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不但為汝等，何故數來？」",
        "translation": "Not only for you, but why have you come so often?\"",
        "source": "T23n1435_034:0248b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何？",
        "translation": "Monks, do you not know what's going on?",
        "source": "T23n1435_034:0248b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應立知食人。",
        "translation": "He told the Buddha about this, and he said, \"You should establish a person who knows how to serve food.",
        "source": "T23n1435_034:0248b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立知食人法者，一心和合僧應問言：『誰能為僧作知食人？』",
        "translation": "Whoever establishes the rule of knowing who's eating, the unified saṃgha should ask, 'Who can be a knower of food for the saṃgha?'",
        "source": "T23n1435_034:0248b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中若有一比丘言：『我能。』",
        "translation": "\"Suppose there's a monk here who says, 'I can.'",
        "source": "T23n1435_034:0248b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有五法，不應立作知食人。",
        "translation": "If there are five things, he shouldn't be considered a person who knows how to eat.",
        "source": "T23n1435_034:0248b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0248b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨愛、隨瞋、隨怖、隨癡、不知得不得。",
        "translation": "Following craving, following anger, following fear, following delusion, and not knowing what's obtainable or not obtainable.",
        "source": "T23n1435_034:0248b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就五法，應立作知食人。",
        "translation": "If he accomplishes five things, he should be established as a person who knows how to eat.",
        "source": "T23n1435_034:0248b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0248b21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不隨愛、不隨瞋、不隨怖、不隨癡、知得不得。",
        "translation": "Not following craving, not following anger, not following fear, and not following delusion, he knows that he can't get it.",
        "source": "T23n1435_034:0248b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時一比丘應僧中唱言：『大德僧聽！",
        "translation": "Right then, a monk responded to a call from within the saṃgha, saying, 'Listen, great sir!",
        "source": "T23n1435_034:0248b22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘某甲，能為眾僧作差食人。",
        "translation": "\"A certain monk can serve as a messenger of food to the saṃgha.",
        "source": "T23n1435_034:0248b23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽，某甲比丘作差食人。",
        "translation": "If the saṃgha tolerates listening when the saṃgha arrives, that certain monk will serve as a messenger of food.",
        "source": "T23n1435_034:0248b24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名白。』",
        "translation": "This is called a 'declaration.'",
        "source": "T23n1435_034:0248b25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白二羯磨。",
        "translation": "Thus, he explained the two karmas.",
        "source": "T23n1435_034:0248b25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『僧立某甲比丘作差食人竟，僧忍，默然故，是事如是持！』",
        "translation": "'After the saṃgha approves of a certain monk as a messenger of food, the saṃgha tolerates it and remains silent, so it's thus maintained!'",
        "source": "T23n1435_034:0248b25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "差食人法者，應次第差：『若汝某甲至某家。』」",
        "translation": "A monk who sends out the rules for feeding people should send them in order: 'Suppose you go to a certain house with a certain person.'",
        "source": "T23n1435_034:0248b26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所差比丘，有早得者、有晚得者、近得者、遠得者、有得美者、得不美者。",
        "translation": "The monks sent are those who got it early, those who got it late, those who got it near, those who got it far, and those who got it well and those who got it not well.",
        "source": "T23n1435_034:0248b27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有晚得者作是言：「故與我是處。」",
        "translation": "One who has attained it late says, 'So this is the place for me.'",
        "source": "T23n1435_034:0248c01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得遠處者亦言：「故與我遠處。」",
        "translation": "Those who have attained a distant place also say, \"So they're with me in a distant place.\"",
        "source": "T23n1435_034:0248c02_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得不美者言：「故與我如是。」",
        "translation": "Those who attain unsightliness say, \"So it's like this with me.\"",
        "source": "T23n1435_034:0248c02_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中間更作餘語。",
        "translation": "In the interim, he says something else.",
        "source": "T23n1435_034:0248c03_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應條名。",
        "translation": "The Buddha said, \"You should name it.",
        "source": "T23n1435_034:0248c03_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有比丘得惡處者，便拭名改易好處。」",
        "translation": "A monk who has gained a bad place will then wipe his name and change it into a good place.\"",
        "source": "T23n1435_034:0248c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應書板作字集置一處，和合從上座隨次第取。」",
        "translation": "The Buddha said, \"You should write a list of words on a board, gather them in one place, and combine them in order to take them from the superior seat.\"",
        "source": "T23n1435_034:0248c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有晚得者、有得遠處者，早至主人門外，在巷頭立待食久住，心悶吐逆不樂。",
        "translation": "Some monks who had gotten there late or had gotten to a distant place arrived outside their master's door early in the morning and stood at the end of the alley waiting for food for a long time, feeling sad and rebellious and unhappy.",
        "source": "T23n1435_034:0248c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士出見語言：「我等門內自恣聽汝入坐。」",
        "translation": "The householders who came out to see them said, \"We'll take our own meal inside the door and listen to you as you enter and sit down.\"",
        "source": "T23n1435_034:0248c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘言：「佛未聽我等入白衣門內坐待食。」",
        "translation": "The monks said, \"The Buddha hasn't heard us enter the white-robed gate and sit down to wait for food.\"",
        "source": "T23n1435_034:0248c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「聽是比丘入白衣門內坐待食。」",
        "translation": "He told the Buddha about this, and he said, \"I've heard this monk enter the white-robed gate and sit down to eat.\"",
        "source": "T23n1435_034:0248c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有象聲、馬聲、男女聲，妨讀經坐禪，佛言：「若妨者出門外。」",
        "translation": "When the sounds of elephants, horses, or men and women interfered with reading the sūtras and sitting in meditation, the Buddha said, \"If that's an obstruction, go outside the gate.\"",
        "source": "T23n1435_034:0248c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門外待時，諸人來遶四邊看，見已皆笑。",
        "translation": "While they were waiting outside the door, people came around to look at them and laughed when they saw them.",
        "source": "T23n1435_034:0248c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應作土基。」",
        "translation": "They told the Buddha about it, and he said, \"You should build a dirt foundation.\"",
        "source": "T23n1435_034:0248c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為風雨所惱，佛言：「聽作屠蘇覆。」",
        "translation": "Troubled by the wind and rain, the Buddha said, \"Listen, make a butcher's blanket.\"",
        "source": "T23n1435_034:0248c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薄故雨漏，佛言：「應厚覆。」",
        "translation": "When the rain leaks because it's weak, the Buddha said, \"It should be covered thickly.\"",
        "source": "T23n1435_034:0248c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "厚覆已脊上漏，佛言：「更覆。」",
        "translation": "When the ridges on top of the roof leak after being thickly covered, the Buddha said, 'Cover it again.'",
        "source": "T23n1435_034:0248c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無坐處，佛言：「應覓板木坐上。」",
        "translation": "Again, there's no place to sit, and the Buddha says, \"You should find a plank to sit on.\"",
        "source": "T23n1435_034:0248c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人偷板去，佛言：「應陷著地中。」",
        "translation": "When someone stole the plank and left, the Buddha said, \"They should sink into the ground.\"",
        "source": "T23n1435_034:0248c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復失去，佛言：「應作土埵。」",
        "translation": "Again, he loses it, and the Buddha says, \"Make it an earthen vessel.\"",
        "source": "T23n1435_034:0248c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不泥故，中有毒蛇蜈蚣，囓諸比丘，佛言：「應泥。」",
        "translation": "When there are venomous snakes and centipedes that bite monks because they aren't muddied, the Buddha says, \"They should be muddied.\"",
        "source": "T23n1435_034:0248c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥已麁澁破衣，佛言：「應以細埿。」",
        "translation": "After mud has been applied, the coarse material tears his robes, and the Buddha says, \"You should use a fine substance.\"",
        "source": "T23n1435_034:0248c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘須水，佛言：「應作井。」",
        "translation": "When the monks needed water, the Buddha said, \"Make a well.\"",
        "source": "T23n1435_034:0248c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作井已，即以鉢鍵鎡取水甚難，佛言：「應作瓶取水。」",
        "translation": "After making a well, they then used a bowl and put husbandry to obtain water, which was very difficult, and the Buddha said, \"You should make a flask to obtain water.\"",
        "source": "T23n1435_034:0248c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取水時不及，佛言：「應以繩繫。」",
        "translation": "When it's too late to get water, the Buddha says, \"You should tie it with a rope.\"",
        "source": "T23n1435_034:0248c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘手軟牽繩手痛，佛言：「應作轆轤。」",
        "translation": "When the monks' hands were weak and their hands hurt from holding the rope, the Buddha said, \"You should make a cord.\"",
        "source": "T23n1435_034:0248c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人墮井，佛言：「應作欄。」",
        "translation": "A man falls into a well, and the Buddha says, 'Make a railing.'\"",
        "source": "T23n1435_034:0248c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老優波離問佛：「以何物作井欄？」",
        "translation": "The elder Upāli asked the Buddha, \"What will be used to make a railing for the well?\"",
        "source": "T23n1435_034:0248c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應以木石塼作。」",
        "translation": "The Buddha said, \"It should be made of wood or stone or stoneware.\"",
        "source": "T23n1435_034:0248c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已有婦女大小詣井取水，時兩手相觸，佛言：「井上作隔障，應各在一邊汲水。」",
        "translation": "When a woman of that size who's already made a well goes to get water and touches her hands, the Buddha says, \"A barrier has been placed over the well, so you should each draw water from one side.\"",
        "source": "T23n1435_034:0248c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有居士從舍內出，語比丘言：「我某僧坊作食，汝爾所人往彼僧坊中食。」",
        "translation": "A householder emerged from his abode and said to the monk, \"I'm preparing food for a certain monastery, so why don't you people go to that monastery and eat there?\"",
        "source": "T23n1435_034:0248c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去時道中師子虎狼熊羆諸難，是事白佛，佛言：「應語檀越：『是中有如是怖畏，此間與我食。』」",
        "translation": "The tigers, wolves, bears, and other difficulties in the path then came to the Buddha about this, and he said, \"You should tell the monk, 'Such fears exist in this place; let's eat here.'\"",
        "source": "T23n1435_034:0248c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城。",
        "translation": "The Buddha was in the city of Rājagṛha.",
        "source": "T23n1435_034:0249a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸居士作種種粥：酥粥、胡麻粥、油粥、乳粥、小豆粥、磨沙豆粥、麻子粥、薄粥。",
        "translation": "At the time, the householders were making various kinds of gruel: gruel made of butter, gruel made of sesame, gruel made of oil, gruel made of milk, gruel made of lentils, gruel made of mushy peas, gruel made of sesame seeds, and gruel made of flakes.",
        "source": "T23n1435_034:0249a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辦是粥已，持詣竹園。",
        "translation": "After preparing this gruel, they carried it to the Bamboo Park.",
        "source": "T23n1435_034:0249a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六群比丘在僧坊門邊立，遙見已問言：「持何等物？」",
        "translation": "Six groups of monks were standing near the entrance to the monastery, and when they saw them from a distance, they asked, \"What's in that?\"",
        "source": "T23n1435_034:0249a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「是粥。」",
        "translation": "He replied, \"This is gruel.\"",
        "source": "T23n1435_034:0249a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何等粥？」",
        "translation": "And he asked, \"What kind of gruel is it?\"",
        "source": "T23n1435_034:0249a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「酥粥、胡麻粥、油粥、乳粥、小豆粥、磨沙豆粥、麻子粥、薄粥。」",
        "translation": "They replied, \"It's gruel made of butter, sesame, oil, milk, lentils, mace, hemp seeds, and mush.\"",
        "source": "T23n1435_034:0249a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時六群比丘言：「我等行去，先與我等酥粥、胡麻粥、油粥、乳粥、小豆粥、磨沙豆粥、麻子粥。",
        "translation": "It was then that the six groups of monks said, \"As we go, first give us gruel made of butter, flax, oil, milk, lentils, sand beans, and sesame seeds.",
        "source": "T23n1435_034:0249a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝持薄粥入僧坊與上座。」",
        "translation": "Take this thin gruel into the monastery and give it to the elder monk.\"",
        "source": "T23n1435_034:0249a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘聞不知云何？",
        "translation": "The monks who heard that didn't know what to make of it.",
        "source": "T23n1435_034:0249a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今應羯磨立分粥人。",
        "translation": "He told the Buddha about this, and he said, \"From now on, you should karmically establish a person who distributes gruel.",
        "source": "T23n1435_034:0249a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所持盛粥器，即用是器分粥。」",
        "translation": "Use the container that you carry to distribute the gruel.\"",
        "source": "T23n1435_034:0249a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中酥粥、胡麻粥、油粥、乳粥、小豆粥、磨沙豆粥、麻子粥，上座得上肥膩者，下座得底滓。",
        "translation": "For this gruel of butter, gruel of flax, gruel of oil, gruel of milk, gruel of lentils, gruel of ground beans, and gruel of sesame seeds, the top seat gets the fat and greasy bits, and the bottom seat gets the dregs.",
        "source": "T23n1435_034:0249a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若分薄粥時，上座得汁，下座得滓。",
        "translation": "If they share a thin gruel, the top seat gets the juice, and the bottom seat gets the dregs.",
        "source": "T23n1435_034:0249a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今聽畜大盔大瓮，以粥集著是器中和合，以大鉢大鍵鎡分與。」",
        "translation": "He told the Buddha about this, and he said, \"From now on, listen, store a large helmet and a large pot, put the gruel in that container, combine it, and hand it out in a large bowl and a large gourd.\"",
        "source": "T23n1435_034:0249a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分與時不便，佛言：「應作杓用分。」",
        "translation": "When it was too difficult to share it, the Buddha said, \"You should make a ladle and use it to share it.\"",
        "source": "T23n1435_034:0249a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用分已有殘者、有不足者，佛言：「應更作小杓用分。」",
        "translation": "When there's already a ladle left over or a ladle that's not enough, the Buddha says, \"You should make a smaller ladle for use as a serving bowl.\"",
        "source": "T23n1435_034:0249a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城竹園中。",
        "translation": "The Buddha was in the Bamboo Park of Rājagṛha.",
        "source": "T23n1435_034:0249a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士辦種種帶鉢那，胡麻歡喜丸、石蜜歡喜丸、蜜歡喜丸、舍俱梨餅、波波羅餅、曼提羅餅、象耳餅、餛飩餅、閻浮梨餅，持是餅向僧坊。",
        "translation": "The monks prepared various kinds of take-home food, including flax joy balls, rock honey joy balls, honey joy balls, śāculi cakes, pāpāla cakes, maṇḍala cakes, elephant ear cakes, wonton cakes, and jambūla cakes, and brought them to the monastery.",
        "source": "T23n1435_034:0249a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘早起在門邊立，見已問言：「持何等物？」",
        "translation": "Six groups of monks got up early and stood by the door, and when they saw them, they asked, \"What are these things?\"",
        "source": "T23n1435_034:0249a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「種種帶鉢那餅，所謂胡麻歡喜丸、石蜜歡喜丸、蜜歡喜丸、舍俱利餅、波波羅餅、曼提羅餅、象耳餅、餛飩餅、閻浮梨餅。」",
        "translation": "He answered, \"There are various kinds of bread with pāna, called jute joy balls, rock honey joy balls, honey joy balls, Śākuli cakes, pāpāla cakes, maṇḍala cakes, elephant ear cakes, wonton cakes, and jambūla cakes.\"",
        "source": "T23n1435_034:0249a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘言：「我欲行去，先與我等胡麻歡喜丸、石蜜歡喜丸、舍俱梨餅、波波羅餅、曼提羅餅。",
        "translation": "The six groups of monks said, \"I want to go, so first give us the dumpling cake, the rock-honey joy-ball, the Śākulī cake, the pāpāla cake, and the maṇḍala cake.",
        "source": "T23n1435_034:0249a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝持象耳、餛飩、持閻浮梨餅入與上座。」",
        "translation": "Take the elephant's ear, the dumpling, and the jambūla cake, and bring them to the elder monk.\"",
        "source": "T23n1435_034:0249a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何？",
        "translation": "The monks didn't know what to do.",
        "source": "T23n1435_034:0249a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應羯磨立分帶鉢那人。",
        "translation": "He told the Buddha about this, and he said, \"Karma should establish a part-perfectioner who carries a bowl.",
        "source": "T23n1435_034:0249a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分帶鉢那人，應和合等分。",
        "translation": "The person who distributes the take-home portions should be combined and equally distributed.",
        "source": "T23n1435_034:0249b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若更有美者來，亦應次第與。",
        "translation": "If there are more beautiful people who come, you should also give them in order.",
        "source": "T23n1435_034:0249b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若今日不遍者，明日更有，應續次與。」",
        "translation": "If there's another one tomorrow that isn't completely present today, you should give them in order.\"",
        "source": "T23n1435_034:0249b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城。",
        "translation": "The Buddha was in the city of Rājagṛha.",
        "source": "T23n1435_034:0249b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸居士辦種種藥，所謂酥、油、蜜、石蜜、薑、胡椒、蓽茇、黑鹽、訶梨勒、鞞醯勒、阿摩勒、波櫨路、毘呪曼陀多耶、摩那伽頭櫨醯，持詣竹園。",
        "translation": "It was then that the householders prepared a variety of medicines, called ghee, oil, honey, rock honey, ginger, pepper, thistle, black salt, haricot, vaihle, amalā, pauchu, vaiśravaṇa, maṇḍala, and sumac, and brought them to the Bamboo Park.",
        "source": "T23n1435_034:0249b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時六群比丘早起門邊立，見已問言：「持何等物。」",
        "translation": "Six groups of monks then rose early and stood by the gate, and when they saw them, they asked, \"What are these things?\"",
        "source": "T23n1435_034:0249b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「種種藥：所謂酥、油、蜜、石蜜、薑椒、蓽茇、黑鹽、訶梨勒、鞞醯勒、阿摩勒、波櫨路、毘呪曼陀多耶、摩那伽頭櫨醯。」",
        "translation": "They replied, \"Various medicines, such as ghee, oil, honey, rock honey, ginger and pepper, thimble, black salt, harissa, vaihle, amalā, pauṣṭhila, vairocana, mandāṇḍaya, and manāga-tea sumac.\"",
        "source": "T23n1435_034:0249b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六群比丘言：「我欲行去，與我酥、油、蜜、石蜜、薑椒、蓽茇、黑鹽。",
        "translation": "Six groups of monks said, \"I want to leave, so give me butter, oil, honey, rosemary, ginger, pepper, mildew, and black salt.",
        "source": "T23n1435_034:0249b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝持訶梨勒、鞞醯勒、呵摩勒、波櫨路、毘呪曼陀多耶、摩那伽頭櫨醯，入僧坊與上座。」",
        "translation": "Take Hālīlī, Vaihīlī, Homālī, Pārśalu, Vaiśomantā, and Manāgata Sumac, and go into the monastery and present them to the elder monk.\"",
        "source": "T23n1435_034:0249b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何？",
        "translation": "The monks didn't know what to do.",
        "source": "T23n1435_034:0249b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今應立分藥人，分藥人和合平等分與。",
        "translation": "He told the Buddha about this, and he said, \"From now on, there should be a distributor of medicine who combines and distributes it equally.",
        "source": "T23n1435_034:0249b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有貴價藥來者，應別舉置。",
        "translation": "If there's valuable medicine coming, it should be picked up separately.",
        "source": "T23n1435_034:0249b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若病比丘索者，應與兩錢半價藥。",
        "translation": "If a sick monk asks for it, he should give him medicine worth two coins and a half.",
        "source": "T23n1435_034:0249b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若索多者，應從索直。」",
        "translation": "If he asks for more, he should follow the request directly.\"",
        "source": "T23n1435_034:0249b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在阿羅毘國。",
        "translation": "The Buddha was in the country of Arabya.",
        "source": "T23n1435_034:0249b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿羅毘國諸比丘，常從居士索作器。",
        "translation": "At the time, the monks of Aravaipa always asked the householders to build a container.",
        "source": "T23n1435_034:0249b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士言：「我等云何能常供給汝？",
        "translation": "The householders said, \"How can we always make offerings to you?",
        "source": "T23n1435_034:0249b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等何不自畜作器？」",
        "translation": "Why don't you all make your own vessels?\"",
        "source": "T23n1435_034:0249b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「佛未聽我等畜作器。」",
        "translation": "He replied, \"The Buddha hasn't heard of us making utensils for animals.\"",
        "source": "T23n1435_034:0249b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今聽畜作器。」",
        "translation": "He told the Buddha about this, and he said, \"From now on, we'll listen to you as you work with firewood.\"",
        "source": "T23n1435_034:0249b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅毘國僧坊中，有客作木師，有半月客作者、有一月一歲客作者，是木師晝日作，暮去留作器便失，佛言：「應立知作器比丘。」",
        "translation": "When there was a guest woodworker in the monastery in Arapī who worked half a month or a month and a year, and that woodworker worked by day but left at sunset and lost the utensils, the Buddha said, \"You should establish a monk who knows how to work the utensils.\"",
        "source": "T23n1435_034:0249b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立知作器比丘，作竟持作器聚在一處，又復失盡。",
        "translation": "The monk who had established the knowledge of making vessels gathered the vessels in one place after making them and then lost them all again.",
        "source": "T23n1435_034:0249b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應羯磨一房舍舉作器。",
        "translation": "He told the Buddha about this, and he said, \"You should karmically assemble a monk's living quarters to carry the utensils.",
        "source": "T23n1435_034:0249b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立作器房法者，一心和合僧，一比丘僧中唱言：『大德僧聽！",
        "translation": "When he established the method of making a monk's dwelling, he united the saṃgha with one mind and one monk in the saṃgha called out, 'Listen, great sir!",
        "source": "T23n1435_034:0249b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某房舍僧立作舉作器房。",
        "translation": "\"In a certain house, the saṃgha establishes a place where they make utensils.",
        "source": "T23n1435_034:0249b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽，某房作舉作器處。",
        "translation": "If the saṃgha arrives at the time, the saṃgha tolerates hearing that a certain house is a place where utensils are made.",
        "source": "T23n1435_034:0249b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名白。』",
        "translation": "This is called a 'rebuke.'",
        "source": "T23n1435_034:0249b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白二羯磨。",
        "translation": "Thus, he explains the two karmas.",
        "source": "T23n1435_034:0249b29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『僧立某房作舉作器房竟，僧忍，默然故，是事如是持！』」",
        "translation": "'After the saṃgha establishes a certain room for making utensils, the saṃgha tolerates it and remains silent, thus maintaining this thing!'",
        "source": "T23n1435_034:0249c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立是房已，知作器比丘便持作器著上下二房中，佛言：「不應置兩處。",
        "translation": "After establishing this room, the monk who knew he was making a container then put it in the upper and lower rooms, and the Buddha said, \"You shouldn't put it in two places.",
        "source": "T23n1435_034:0249c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若著上房者，下房應與僧。",
        "translation": "If he puts it in the upper room, the monks should take it from the lower room.",
        "source": "T23n1435_034:0249c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若著下房，應與僧上房。」",
        "translation": "If he put it in the lower room, he should give it to the saṃgha in the upper room.\"",
        "source": "T23n1435_034:0249c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又一時諸比丘從憍薩羅國向舍衛國，道中過一空僧坊中宿。",
        "translation": "Another time, some monks were traveling from Kośala to Śrāvastī and passed an empty monk's residence on the road to stay there.",
        "source": "T23n1435_034:0249c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘明日入村乞食，諸居士問：「汝何處宿？」",
        "translation": "When the monks went into the village tomorrow to solicit alms, the householders asked, \"Where will you stay?\"",
        "source": "T23n1435_034:0249c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「僧坊中宿。」",
        "translation": "He replied, \"I'll stay overnight in the monastery.\"",
        "source": "T23n1435_034:0249c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是何房舍中宿？」",
        "translation": "\"What kind of dwelling is it?\"",
        "source": "T23n1435_034:0249c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「某房中。」",
        "translation": "He replied, \"It's in a certain room.\"",
        "source": "T23n1435_034:0249c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士言：「此是我房，何不遣使語我等？",
        "translation": "The monk said, \"This is my room, why don't you send a messenger to tell us about it?",
        "source": "T23n1435_034:0249c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當供養湯藥、油、燈燭、臥具種種所須。」",
        "translation": "You must make offerings of hot water, medicine, oil, lamps, and bedding that are needed.\"",
        "source": "T23n1435_034:0249c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士隨所房中宿者，各自將歸，與敷坐處坐，自手行水，自與多美飲食，自恣飽滿。",
        "translation": "Those householders who have stayed overnight in their respective quarters return home, sit down with their maidens in their sitting places, carry water in their own hands, and provide themselves with plenty of delicious food and drink to fill their stomachs.",
        "source": "T23n1435_034:0249c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以水澡漱，取小床坐聽說法，語諸比丘：「我僧房中有臥具前食後食，何不住此？",
        "translation": "They wash themselves with water, take a cot, sit, and listen to the teaching, and say to the monks, \"Why don't we stay here in our monk's quarters, where we have bedding for eating before and after?",
        "source": "T23n1435_034:0249c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復當供養衣被，願令是僧坊有用。」",
        "translation": "Again, you must make offerings of clothing, hoping to make this monk's residence useful.\"",
        "source": "T23n1435_034:0249c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不知云何？",
        "translation": "The monks didn't know what to do.",
        "source": "T23n1435_034:0249c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今聽若先空僧坊中諸比丘欲去，應羯磨立一比丘令常住。",
        "translation": "This was brought to the Buddha's attention, and he said, \"From now on, if you hear that some monks in the previously empty monastery want to leave, you should karmically establish a monk who will be a permanent fixture.",
        "source": "T23n1435_034:0249c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知僧坊立法者，一心和合僧問言：『誰能作常住比丘？",
        "translation": "The monks who knew the monastery's laws and were unified with the monks of one mind asked, 'Who can be a monk of permanent abiding?'",
        "source": "T23n1435_034:0249c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知某甲空增坊。』",
        "translation": "You know that someone is an empty, growing monk.'",
        "source": "T23n1435_034:0249c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘言：『我能。』",
        "translation": "Suppose there's a monk who says, 'I can.'",
        "source": "T23n1435_034:0249c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五法不應立作常住比丘。",
        "translation": "There are five things you shouldn't do to become an eternally abiding monk.",
        "source": "T23n1435_034:0249c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0249c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨愛、隨瞋、隨怖、隨癡、不知分別應作不應作。",
        "translation": "Following craving, following anger, following fear, following delusion, and not knowing the difference between what should be done and what shouldn't be done, he'll be established as a monk of constant abiding if he accomplishes five things: not following craving, not following anger, not following fear, not following delusion, and knowing the difference between what should be done and what shouldn't be done.",
        "source": "T23n1435_034:0249c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就五法，應立作常住比丘：不隨愛、不隨瞋、不隨怖、不隨癡、知分別應作不應作。",
        "translation": "If he accomplishes these five things, he will be established as an eternally abiding monk who doesn't follow craving, doesn't follow anger, doesn't follow fear, doesn't follow delusion, and knows the difference between what should be done and what shouldn't be done.",
        "source": "T23n1435_034:0249c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時一比丘僧中唱言：『大德僧聽！",
        "translation": "Immediately, a monk called out from within the saṃgha, 'Listen, great monks!",
        "source": "T23n1435_034:0249c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某甲比丘，能作常住知某甲空僧坊人。",
        "translation": "\"Suppose a certain monk can be an abiding monk who knows the emptiness of a certain monk's living quarters.",
        "source": "T23n1435_034:0249c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽，立某甲比丘常住知某甲空僧坊人。",
        "translation": "If the saṃgha then arrives and listens patiently, he establishes that a certain monk is an abiding monk who knows the emptiness of a certain monk's living quarters.",
        "source": "T23n1435_034:0249c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名白。』",
        "translation": "This is called a 'proclamation.'",
        "source": "T23n1435_034:0249c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白二羯磨。",
        "translation": "Thus, he explains the two karmas.",
        "source": "T23n1435_034:0249c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『僧立某甲比丘常住知某甲空僧坊竟，僧忍，默然故，是事如是持！』",
        "translation": "'After the saṃgha establishes that a certain monk always knows that the monk's quarters are empty, the saṃgha tolerates it and remains silent, thus maintaining this thing!'",
        "source": "T23n1435_034:0249c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知空僧坊常住比丘，應巡行僧坊，先修治塔，次作四方僧事，次知僧料理飲食事，次知應可分物，次知上座中座下座比丘事。",
        "translation": "A monk who knows the monk's quarters is empty and always abiding should tour the monk's quarters, first repairing the stūpa, next doing the work of the monks in the quadrangle, next knowing the monks' food and drink, next knowing what should be distributed, and next knowing the work of the monks on the upper seat, middle seat, and lower seat.",
        "source": "T23n1435_034:0249c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨有大德高明比丘，不應作使。",
        "translation": "Suppose there's a monk of great virtue and high intelligence who shouldn't be an envoy.",
        "source": "T23n1435_034:0250a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知僧坊比丘，應作是願：『諸比丘未來者當來，已來者供給衣食臥具湯藥，不令有乏。』",
        "translation": "A monk who knows the saṃgha's quarters should make this vow: 'Those monks who will come in the future and those who have come will provide clothing, food, bedding, and medicine, so that there's no lack.'",
        "source": "T23n1435_034:0250a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能作是願行者，僧隨彼意與。",
        "translation": "Those who make this vow will be given by the saṃgha according to their wishes.",
        "source": "T23n1435_034:0250a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若須食，應自恣與好食。",
        "translation": "If you need food, you'll provide it yourself as good food.",
        "source": "T23n1435_034:0250a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若須房舍臥具，皆應自恣與。」",
        "translation": "If you need a dwelling or bedclothes, you should freely give them to him.\"",
        "source": "T23n1435_034:0250a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有眾多王臣，數數詣竹園房舍觀看，若來時索食薪火燈燭，若與畏犯、不與懼作患，不知云何？",
        "translation": "I wonder what would happen if a lot of the king's ministers came to the Bamboo Park house several times to look at it and asked for food, firewood, lamps, and candles, or if they were afraid to offend or not afraid to cause trouble.",
        "source": "T23n1435_034:0250a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是事白佛，佛言：「應立分處人。",
        "translation": "He told the Buddha about this, and he said, \"You should establish a placeholder.",
        "source": "T23n1435_034:0250a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立分處人已，不白眾僧，得用十九錢供給客。",
        "translation": "After you establish a placeholder, you won't have to tell the saṃgha that you're allowed to use nineteen coins to give to a guest.",
        "source": "T23n1435_034:0250a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若更須，應白僧竟與。」",
        "translation": "If you need more, you should tell the saṃgha to finish giving it to him.\"",
        "source": "T23n1435_034:0250a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍薩羅國有阿練兒住處，爾時有賊到阿練兒處乞食，作食人言：「食不由我，不得與汝，汝自從沙彌索。」",
        "translation": "At the time, there was a thief who went to Al-Anir's place to solicit food and acted like a foodie, saying, \"I won't give you food that isn't mine to eat; ask for it from the monks themselves.\"",
        "source": "T23n1435_034:0250a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸賊即從沙彌索，沙彌言：「我不得與汝，汝自從知食比丘索。」",
        "translation": "The thieves then asked for food from the śrāmaṇer, who said, \"I can't give it to you; ask for it from the monk who knows how to feed you.\"",
        "source": "T23n1435_034:0250a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從知食比丘索，知食比丘言：「為僧故辦是食，不為汝等。」",
        "translation": "They then asked for it from the monk who knew how to feed, and the monk who knew how to feed said, \"This is food for the sake of the saṃgha, not for you.\"",
        "source": "T23n1435_034:0250a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊相謂言：「是比丘何肯正爾與我食。」",
        "translation": "The thief said, \"How could this monk be willing to give me food like this?\"",
        "source": "T23n1435_034:0250a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便捉一比丘手脚截腰斷，諸比丘不知云何？",
        "translation": "He then grabbed a monk by the hands and feet, cut him off at the waist, and the monks didn't know what to do.",
        "source": "T23n1435_034:0250a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「若有如是怖畏處，若少乞與少，若乞半與半，若都索都與，莫以是因緣故得大衰惱。」",
        "translation": "This was brought to the Buddha's attention, and he said, \"If there's such a fearful place, if you ask for a little and give a little, ask for half and give half, or ask for both and give both, don't let that cause you to be greatly troubled.\"",
        "source": "T23n1435_034:0250a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城，爾時眾僧得衣，無人守護，佛言：「應立守護衣人。",
        "translation": "When the Buddha was in the city of Rājagṛha and the monks had obtained robes and had no one to guard them, the Buddha said, \"You should appoint someone to guard the robes.",
        "source": "T23n1435_034:0250a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立守護衣人法者，一心和合僧應問言：『誰能為僧守護諸衣？』",
        "translation": "Whoever establishes a person to guard the robes, the monks who are united in one mind should ask, 'Who can guard the monks' robes?'",
        "source": "T23n1435_034:0250a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘言：『我能。』",
        "translation": "\"Suppose a monk says, 'I can.'",
        "source": "T23n1435_034:0250a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有五法不應立。",
        "translation": "If there are five things, they shouldn't be established.",
        "source": "T23n1435_034:0250a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0250a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知是衣所從得、不知衣價、若得衣不知云何受、不知頭數、忘著衣處。",
        "translation": "They don't know where they got the robe, don't know the price of the robe, don't know how to accept the robe if they get it, don't know the number of heads, and forget where they're wearing the robe.",
        "source": "T23n1435_034:0250a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就五法應立。",
        "translation": "If these five things are accomplished, they should be established.",
        "source": "T23n1435_034:0250a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0250a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知衣所從得、知是衣價、知應受、知頭數、不忘著衣處。",
        "translation": "He knows where he's gotten his robe, knows its price, knows what he should accept, knows the number of heads, and doesn't forget where he's wearing it.",
        "source": "T23n1435_034:0250a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時一比丘僧中唱言：『大德僧聽！",
        "translation": "Immediately, a monk called out from within the saṃgha, 'Listen, great sir!",
        "source": "T23n1435_034:0250a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是某甲，能為僧作守護衣人。",
        "translation": "\"This is a certain monk who can serve as a robe protector for the saṃgha.",
        "source": "T23n1435_034:0250a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧立某甲比丘作守衣人。",
        "translation": "If the saṃgha tolerates listening when the saṃgha arrives, the saṃgha will appoint a certain monk to be the robe protector.",
        "source": "T23n1435_034:0250a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名白。』",
        "translation": "This is called a 'declaration.'",
        "source": "T23n1435_034:0250b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白二羯磨。",
        "translation": "Thus, he explains the two karmas.",
        "source": "T23n1435_034:0250b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『僧立某甲比丘作守護衣人竟，僧忍，默然故，是事如是持！』」",
        "translation": "'After the saṃgha has made a certain monk a robe protector, the saṃgha tolerates it and is silent, so it's thus maintained!'\"",
        "source": "T23n1435_034:0250b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立守衣人已，未有分衣人，佛言：「應立分衣人。",
        "translation": "After establishing a robe protector but not a robe separator, the Buddha said, 'A robe separator should be established.'",
        "source": "T23n1435_034:0250b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立法者，一心和合僧應問言：『誰能為僧作分衣人？』",
        "translation": "Those who follow the Dharma should ask the monks who are united in one mind, 'Who can be the robe keeper for the saṃgha?'",
        "source": "T23n1435_034:0250b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有比丘言：『我能。』",
        "translation": "\"Suppose a monk says, 'I can.'",
        "source": "T23n1435_034:0250b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有五法不應立。",
        "translation": "If there are five things, they shouldn't be established.",
        "source": "T23n1435_034:0250b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0250b06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知衣財、不知衣色、不知衣價、不知衣頭數、不知與未與。",
        "translation": "They don't know the wealth of their clothing, the color of their clothing, the price of their clothing, the number of heads of clothing, or whether they've been given or not.",
        "source": "T23n1435_034:0250b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五法不應立作分衣人。",
        "translation": "There are another five things that shouldn't establish someone as a partaker of clothing.",
        "source": "T23n1435_034:0250b07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0250b08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨愛、隨瞋、隨怖、隨癡、不知與未與。",
        "translation": "Following craving, following anger, following fear, following delusion, and not knowing whether it's given or not given.",
        "source": "T23n1435_034:0250b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘成就五法，應立作分衣人：知衣財、知衣色、知衣價、知衣頭數、知與未與。",
        "translation": "If a monk accomplishes five things, he should be established as a garment separator: he knows the wealth of his garments, the color of his garments, the price of his garments, the number of heads of his garments, and whether they are given or not given.",
        "source": "T23n1435_034:0250b09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有五法：不隨愛、不隨瞋、不隨怖、不隨癡、知與未與。",
        "translation": "There are also five things: not following craving, not following anger, not following fear, not following delusion, and knowing what's given and what's not given.",
        "source": "T23n1435_034:0250b11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時一比丘僧中唱言：『大德僧聽！",
        "translation": "Immediately, a monk called out from within the saṃgha, 'Listen, great monks!",
        "source": "T23n1435_034:0250b12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "某甲比丘，能為僧作分衣人。",
        "translation": "\"Suppose a certain monk can be a partaker of the saṃgha's robes.",
        "source": "T23n1435_034:0250b13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧立某甲比丘作分衣人。",
        "translation": "If the saṃgha tolerates listening when the saṃgha arrives, the saṃgha will accept that certain monk as a partaker of his robes.",
        "source": "T23n1435_034:0250b13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名白。』",
        "translation": "This is called a 'declaration.'",
        "source": "T23n1435_034:0250b14_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白二羯磨。",
        "translation": "It's thus a statement of two karmas.",
        "source": "T23n1435_034:0250b15_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『僧立某甲比丘作分衣人竟，僧忍，默然故，是事如是持。』」",
        "translation": "\"After the saṃgha has made a certain monk a partaker of robes, the saṃgha tolerates it and remains silent, thus maintaining this thing.'\"",
        "source": "T23n1435_034:0250b15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國，無分浴衣人，是事白佛，佛言：「應立分浴衣人。",
        "translation": "When the Buddha was in Śrāvastī, there were no bathing-robe handlers, so he said to the Buddha, \"A bathing-robe handler should be appointed.",
        "source": "T23n1435_034:0250b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是知分浴衣人，應隨上座次與。」",
        "translation": "This is how you should know that the person in partial bath robes should be given to the superior seat in order.'\"",
        "source": "T23n1435_034:0250b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T23n1435_034:0250b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時祇陀林中僧坊中，無比丘知時限唱時，無人打揵稚，無人掃灑塗治講堂食處，無人次第相續敷床榻，無人教淨果菜，無人看苦酒中虫，飲食時無人行水，眾散亂語時無人彈指。",
        "translation": "At the time, in the monastery in Jeta's Grove, there were no monks who knew the time limit and sang the time, no one to beat the gandharvas, no one to cleanse and smear the dining hall, no one to make beds and sofas in succession, no one to teach pure fruits and vegetables, no one to watch for worms in bitter wine, no one to carry water when eating, and no one to snap their fingers when people spoke in disorder.",
        "source": "T23n1435_034:0250b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應立維那。",
        "translation": "He told the Buddha about this, and he said, \"Vairocana should be established.",
        "source": "T23n1435_034:0250b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立法者，一心和合僧應問：『誰能為僧作維那？』",
        "translation": "Those who enact the Dharma should ask, 'Who can be a vaiḍūrya for the saṃgha?'",
        "source": "T23n1435_034:0250b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中若比丘言：『我能。』",
        "translation": "Here, if a monk says, 'I can,'",
        "source": "T23n1435_034:0250b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五法不應立作維那。",
        "translation": "There are five things that shouldn't be posited as vinaya.",
        "source": "T23n1435_034:0250b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_034:0250b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨愛、隨瞋、隨怖、隨癡、不知淨不淨。",
        "translation": "Following craving, following anger, following fear, following delusion, and not knowing whether something is pure or impure.",
        "source": "T23n1435_034:0250b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就五法應立作維那。",
        "translation": "If he accomplishes these five things, he should establish himself as a vaiḍūrya.",
        "source": "T23n1435_034:0250b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五法者，不隨愛、不隨瞋、不隨怖、不隨癡、知淨不淨。",
        "translation": "Those five qualities are not following craving, not following anger, not following fear, not following delusion, and knowing what's pure and impure.",
        "source": "T23n1435_034:0250b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時一比丘僧中唱言：『大德僧聽！",
        "translation": "Immediately, a monk called out from within the saṃgha, 'Listen, great monks!",
        "source": "T23n1435_034:0250b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是某甲比丘，能為僧作維那。",
        "translation": "\"Is this a certain monk who can venerate the saṃgha?",
        "source": "T23n1435_034:0250b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧立某甲比丘作維那。",
        "translation": "If the saṃgha tolerates listening when the saṃgha arrives, the saṃgha will establish that certain monk as the vaiḍūrya.",
        "source": "T23n1435_034:0250c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名白。』",
        "translation": "This is called a 'proffer.'",
        "source": "T23n1435_034:0250c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白二羯磨。",
        "translation": "It's thus a statement of two karmas.",
        "source": "T23n1435_034:0250c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『僧立某甲比丘作維那竟，僧忍，默然故，是事如是持！』",
        "translation": "'After the saṃgha has made a certain monk vina, the saṃgha tolerates it and remains silent, thus maintaining this thing!'",
        "source": "T23n1435_034:0250c02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作維那比丘，應知時限知唱時、知打揵稚、知掃灑塗治講堂食處、知次第相續敷床榻、知教淨果菜、知看苦酒中虫、知飲食時行水、眾散亂語時彈指。」",
        "translation": "Suppose you become a Vairocana monk who knows the time limit and knows when to sing, when to strike the gandharva, when to cleanse and smear the dining hall, when to make beds and sofas in succession, when to teach pure fruits and vegetables, when to look for worms in bitter wine, when to drink water, and when to snap your fingers when people speak in disorder.\"",
        "source": "T23n1435_034:0250c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸沙彌，隨與和上阿闍梨作、隨同和上阿闍梨、隨相識共語共事、隨同國土同城邑同聚落。",
        "translation": "It was then that the novices accompanied the superior preceptor in his work, accompanied the superior preceptor in his conversation, accompanied each other in their work, and accompanied him to the same town and village in his land.",
        "source": "T23n1435_034:0250c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘無沙彌者，有諸惱亂。",
        "translation": "Those monks who didn't have ascetics were troubled.",
        "source": "T23n1435_034:0250c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應立一人為主使沙彌作。",
        "translation": "They told the Buddha about this, and he said, \"Perhaps one person should be appointed head monk to make the monks do it.",
        "source": "T23n1435_034:0250c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先修治塔事、次作四方僧事、次作飲食事、次作可分物、次教與上座中座下座。",
        "translation": "First, he should undertake the task of decorating the stūpa, then he should undertake the task of the saṃgha in the four directions, then he should undertake the task of providing food, then he should undertake the task of distributing goods, and then he should teach the superior, middle, and lower seats.",
        "source": "T23n1435_034:0250c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是周遍一切僧作。",
        "translation": "He thus goes around to all the saṃgha's works.",
        "source": "T23n1435_034:0250c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應立分處沙彌人，立分處沙彌人竟，應教先修治塔事，四方僧事作飲食事，次作可分物，次第與上座中座下座，如是周遍一切僧作。」",
        "translation": "You should establish a sectional monk, and when you've established a sectional monk, you should teach him to first purify the stūpa, then to perform the duties of the four monks, then to perform the duties of food and drink, then to perform the duties of distributable goods, then to sequentially assign the superior seat, the middle seat, and the lower seat, and thus circumambulate all the saṃgha's works.\"",
        "source": "T23n1435_034:0250c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城。",
        "translation": "The Buddha was in the city of Rājagṛha.",
        "source": "T23n1435_034:0250c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時瓶沙王往詣竹園觀看。",
        "translation": "It was then that the king of Vibhāṣā went to the Bamboo Park to look at it.",
        "source": "T23n1435_034:0250c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問：「長老摩訶迦葉今何所在？」",
        "translation": "The king asked, \"Where is the elder Mahākāśyapa now?\"",
        "source": "T23n1435_034:0250c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘答言：「大王！",
        "translation": "The monks replied, \"Great king!",
        "source": "T23n1435_034:0250c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老大迦葉今於耆闍崛山上蹋泥。」",
        "translation": "The eldest Kāśyapa is now mired in mud on Mount Gṛdhrakūṭa.\"",
        "source": "T23n1435_034:0250c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即往見問言：「大德！",
        "translation": "The king then went to see him and asked, \"Mañjuśrī!",
        "source": "T23n1435_034:0250c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故自作？」",
        "translation": "Why did you do it yourself?\"",
        "source": "T23n1435_034:0250c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大王！",
        "translation": "He replied, \"Great king!",
        "source": "T23n1435_034:0250c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當為我作？」",
        "translation": "Who will do it for me?\"",
        "source": "T23n1435_034:0250c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我當與作人。」",
        "translation": "The king said, \"I will make you a human being.\"",
        "source": "T23n1435_034:0250c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語已便還。",
        "translation": "After he spoke, he returned.",
        "source": "T23n1435_034:0250c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二瓶沙王又時往到竹園觀看，王問：「長老大迦葉今何所在？」",
        "translation": "The second king, Vaiśravaṇa, then went to the Bamboo Park to look at it, and the king asked, \"Where is the elder Kāśyapa now?\"",
        "source": "T23n1435_034:0250c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘答言：「於耆闍崛山上蹋泥。」",
        "translation": "The monk replied, \"He stepped into the mud on Mount Gṛdhrakūṭa.\"",
        "source": "T23n1435_034:0250c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即往見問言：「大德！",
        "translation": "The king then went to see him and asked, \"Mañjuśrī!",
        "source": "T23n1435_034:0250c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故自作？」",
        "translation": "Why did you do it yourself?\"",
        "source": "T23n1435_034:0250c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大王！",
        "translation": "He replied, \"Great king!",
        "source": "T23n1435_034:0250c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰當為我作？」",
        "translation": "Who will do it for me?\"",
        "source": "T23n1435_034:0250c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我當與作人。」",
        "translation": "The king said, \"I will give it to you as a human being.\"",
        "source": "T23n1435_034:0250c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大迦葉答言：「大王！",
        "translation": "Mahākāśyapa replied, \"Great king!",
        "source": "T23n1435_034:0250c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數數語而不與。」",
        "translation": "He spoke repeatedly but didn't give it.\"",
        "source": "T23n1435_034:0250c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王慚愧小却一面，問諸大臣：「我先有是言不？」",
        "translation": "The king then withdrew to one side in shame and asked the ministers, \"Did I say this before?\"",
        "source": "T23n1435_034:0250c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣答言：「王先有是言。」",
        "translation": "The minister answered, \"The king said so.\"",
        "source": "T23n1435_034:0250c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「何時？」",
        "translation": "The king said, \"When?\"",
        "source": "T23n1435_034:0250c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「某時日月，即計先語已來經五百日。」",
        "translation": "He replied, \"At a certain time, the sun and moon counted as five hundred days since we first spoke.\"",
        "source": "T23n1435_034:0250c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即下山，時人捕得五百群賊與王。",
        "translation": "The king then went down the mountain, and the men caught a group of 500 thieves and gave them to the king.",
        "source": "T23n1435_034:0250c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問：「此是何人？」",
        "translation": "The king asked, \"Who are these people?\"",
        "source": "T23n1435_034:0251a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「是賊。」",
        "translation": "He replied, \"It's the thief.\"",
        "source": "T23n1435_034:0251a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問：「應與何罪？」",
        "translation": "The king asked, \"What crime should he be held responsible for?\"",
        "source": "T23n1435_034:0251a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣答言：「罪應至死。」",
        "translation": "The minister replied, \"The crime should be punished by death.\"",
        "source": "T23n1435_034:0251a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問賊言：「汝能隨我意行不？」",
        "translation": "The king asked the thief, \"Can you do as I wish?\"",
        "source": "T23n1435_034:0251a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊言：「大王！",
        "translation": "The thief said, \"Great king!",
        "source": "T23n1435_034:0251a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所作？」",
        "translation": "What do you want to do?\"",
        "source": "T23n1435_034:0251a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「汝等能供給善人以不？」",
        "translation": "The king said, \"Are you able to make offerings to good people?\"",
        "source": "T23n1435_034:0251a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊言：「若我等受王大恩，不隨行者當隨阿誰？」",
        "translation": "The thief said, \"If we accept the king's great kindness, who will we follow if we don't follow the practice?\"",
        "source": "T23n1435_034:0251a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣言：「此賊必當偷奪諸比丘物。」",
        "translation": "The minister said, \"This thief will surely steal the monks' belongings.\"",
        "source": "T23n1435_034:0251a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我能作方便令不偷奪。」",
        "translation": "The king said, \"I can make it easier for him not to steal them.\"",
        "source": "T23n1435_034:0251a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王多給田宅人民倍與粟食，去竹園不遠，立作淨人聚落。",
        "translation": "The king then gave the people in his mansion twice as much food as he had in his fields and established a village of pure people not far from the Bamboo Park.",
        "source": "T23n1435_034:0251a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸淨人隨相識共語共事、隨同國城邑、隨怖畏、隨有因緣者供給，餘者不供給。",
        "translation": "The pure people then made offerings according to their mutual consciousness, according to what they said to each other, according to what cities in the same country, according to fears, and according to the causes and conditions that existed, but not according to the others.",
        "source": "T23n1435_034:0251a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「應立使淨人率，應教先作塔事、次作四方僧事、次作飲食事、次作可分物事、次教與上座中座下座作，如是周遍一切僧作。",
        "translation": "They told the Buddha about this, and he said, \"Should you establish a head of purified people, you should teach them to first work on the stūpa, then work on the saṃgha in the four directions, then work on the food, then work on the things that can be shared, then teach them to work on the upper seat, middle seat, and lower seat, and so on throughout the saṃgha.",
        "source": "T23n1435_034:0251a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽立使淨人主者，還立白衣中勤修能處分者。」",
        "translation": "They will hear the establishment of someone who purifies the person and also establishes someone among the white robed who diligently cultivates the ability to handle responsibilities.\"",
        "source": "T23n1435_034:0251a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八法中臥具法第十竟)十誦律卷第三十四",
        "translation": "(End of the Tenth Chapter of the Eight Dharmas on Bedclothes) Ten Recitations, Vol. 34",
        "source": "T23n1435_034:0251a14_18",
        "is_bad_quality": false
    }
]