[
    {
        "source_sentence": "根本說一切有部毘奈耶卷第四",
        "translation": "Mūlasarvâstivāda-vinaya, Vol. 4",
        "source": "T23n1442_042:0856b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二",
        "translation": "twelve",
        "source": "T23n1442_042:0856b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "Translation by the Tripiṭaka Master Yijing Feng",
        "source": "T23n1442_042:0856b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不與欲默然起去學處第七十七",
        "translation": "the seventy-seventh position of not rising silently with the desire to go to school",
        "source": "T23n1442_042:0856b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時薄伽梵在室羅伐城逝多林給孤獨園。",
        "translation": "It was then that the Bhagavān was staying at Anāthapiṇḍada's Park in Jeta's Grove of Śrāvastī.",
        "source": "T23n1442_042:0856b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時鄔陀夷斷諸結惑，廣說如上，乃至十七眾共為籌議，集苾芻眾已，詣上座前作如是白：「我今有所詰問，乃至欲與鄔波難陀作捨置羯磨。」",
        "translation": "Udayinī cut off the bonds and confusions, explained the above in detail, and had 17 people discuss it together. After gathering the congregation of monks, he went to the superior throne and said, \"Now, I have some questions, and I'd like to perform a karman of laying aside with Upananda.\"",
        "source": "T23n1442_042:0856b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時上座難陀作如是語：「鄔波難陀是老上座，寧容輒與作捨置事？」",
        "translation": "Nanda, the throne's senior monk, then said, \"Upananda is an elderly monk. How could he easily perform a duty of laying aside?\"",
        "source": "T23n1442_042:0856b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七眾白大眾曰：「若與惡人為朋扇者，眾亦與作捨置羯磨。」",
        "translation": "Seventeen people said to the crowd, \"If you were to make a fan of a bad person, the crowd would also undertake a karman of relinquishment.\"",
        "source": "T23n1442_042:0856b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀聞已遂生怖懼，以己毛緂聚在座上，狀似人形默而起去。",
        "translation": "After hearing this, Nanda became frightened and gathered a bundle of his own woolen material on his seat, resembling a human form, and got up in silence.",
        "source": "T23n1442_042:0856b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時眾不知，遂與鄔波難陀作捨置羯磨已，便詣難陀泣而告曰：「何期黑鉢忽然與我作捨置事？」",
        "translation": "Not knowing this, the crowd then performed a karman of relinquishment with Upananda and approached him, weeping, and said, \"Why did Kapphiṇa suddenly relinquish this duty to me?\"",
        "source": "T23n1442_042:0856b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀報曰：「汝不須憂，彼眾不集，作法不成。」",
        "translation": "Nandana replied, \"You needn't worry; if they don't assemble, the task won't be accomplished.\"",
        "source": "T23n1442_042:0856b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄔波難陀曰：「誰不集耶？」",
        "translation": "Upananda said, \"Who doesn't assemble?\"",
        "source": "T23n1442_042:0856b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「我不在眾。」",
        "translation": "He replied, \"I'm not in the congregation.\"",
        "source": "T23n1442_042:0856b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少欲苾芻聞是語已共生嫌恥：「云何苾芻知眾集已作如法事，默然起去？」",
        "translation": "After hearing this, the monks with few desires shared this dislike, \"How did the monks know that the congregation had gathered and performed the Dharma deeds, but they silently got up and left?\"",
        "source": "T23n1442_042:0856c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻以緣白佛，佛言乃至「我觀十利，為諸苾芻制其學處，應如是說：「若復苾芻知眾如法評論事時，默然從座起去者，波逸底迦。」",
        "translation": "The monks cited these conditions in their statements to the Buddha, who said, \"I observe the ten benefits and define the training grounds for the monks, and I should thus explain, 'Suppose a monk knows that when the multitude correctly comments on the matter, he silently gets up from his seat and leaves, pratyekabuddha.'\"",
        "source": "T23n1442_042:0856c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是世尊為諸苾芻制學處已。",
        "translation": "After the Bhagavān thus made a place of training for the monks, the monks began to study.",
        "source": "T23n1442_042:0856c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻久在眾中，其看病人及授事人事有廢闕。",
        "translation": "Those monks who had been among the multitude for a long time had neglected to nurse their patients and give them instructions.",
        "source": "T23n1442_042:0856c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此為緣佛更聽許，若有緣者應囑授去。",
        "translation": "For this reason, the Buddha further permitted them, saying that if they had any conditions, he would instruct them to leave.",
        "source": "T23n1442_042:0856c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊讚歎持戒，乃至廣說：「前是創制，此是隨開，應如是說：「若復苾芻知眾如法評論事時，默然從座起去，有苾芻不囑授者除餘緣故，波逸底迦。」",
        "translation": "The Bhagavān praised the observance of the precepts and went on to explain in detail, \"The preceding was an initiative, and this is a derivation, which should be explained like this, 'Suppose another monk knows that the multitude is instructed in the ways of things, so he silently gets up from his seat and leaves, and there's a monk who doesn't instruct him to remove the other conditions, pratyekabuddha.'\"",
        "source": "T23n1442_042:0856c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復苾芻者，謂是難陀，餘義如上。",
        "translation": "\"Suppose another monk is a nun, with the rest of the meaning as above.",
        "source": "T23n1442_042:0856c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾謂佛弟子。",
        "translation": "The term for all is a disciple of the Buddha.",
        "source": "T23n1442_042:0856c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如法評論者，謂是如法單白、白二、白四羯磨。",
        "translation": "Those who comment according to the teaching are those who simply announce, announce two, and announce four kalpas according to the teaching.",
        "source": "T23n1442_042:0856c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "默然從座起去者，謂出勢分外。",
        "translation": "Someone who quietly rises from his seat and departs is said to be outside of the group's zone of influence.",
        "source": "T23n1442_042:0856c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不囑授者，有苾芻不語知而去。",
        "translation": "Someone who doesn't instruct a monk to leave without saying anything is said to have left.",
        "source": "T23n1442_042:0856c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋罪同前。",
        "translation": "The explanation of the offense is the same as the previous one.",
        "source": "T23n1442_042:0856c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What are the circumstances of this offense?",
        "source": "T23n1442_042:0856c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻知眾有如法事言論決擇，有苾芻不囑授默然從座而起去者，乃至言聲所及處來，得惡作罪；捨此處時得根本罪。",
        "translation": "If a monk knows that the audience has made a judgment based on the discourse on such matters, and if a monk silently gets up from his seat without being instructed, even if he comes from a place where words are spoken, he commits a misdeed; when he leaves this place, he commits a fundamental offense.",
        "source": "T23n1442_042:0856c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無犯者，謂初犯人，廣說如上。",
        "translation": "Also, there's no offense that refers to the first offense, as explained in detail above.",
        "source": "T23n1442_042:0856c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不恭敬學處第七十八",
        "translation": "Disrespectful Training Place #78",
        "source": "T23n1442_042:0856c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城羯蘭鐸迦池竹林園中。",
        "translation": "The Buddha was in the bamboo grove of Kalandaka Pond in Rājagṛha.",
        "source": "T23n1442_042:0856c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有二苾芻：一名雜色、二名象師子，知諸苾芻集食堂中，依世尊教欲殄諍事。",
        "translation": "At the time, there were two monks, one of whom was a promiscuous color and the other was an elephant lion, who knew that the monks had gathered in the food hall and wanted to avoid disputes based on the Bhagavān's teaching.",
        "source": "T23n1442_042:0856c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯之二人，一順眾命；一便違教不赴眾所，眾評論已不生恭敬，令事紛擾。",
        "translation": "One of these two men complied with the order of the multitude; the other disobeyed the teaching and didn't go to the multitude of places, and after they spoke, they didn't become respectful and caused things to be disruptive.",
        "source": "T23n1442_042:0856c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少欲苾芻共生嫌賤：「云何苾芻眾殄諍時自不赴集，見評論已不存恭敬？」",
        "translation": "The monks with few desires shared their dislike, \"Why don't the monks themselves go to the assembly when they want to end a dispute, and why don't they show respect after they've heard the comments?\"",
        "source": "T23n1442_042:0856c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻以緣白佛。",
        "translation": "The monks told the Buddha about this as a condition.",
        "source": "T23n1442_042:0856c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言，廣說乃至「我觀十利，為諸苾芻制其學處，應如是說：「若復苾芻不恭敬者，波逸底迦。」",
        "translation": "The Buddha said and explained in detail, \"I observe the ten benefits and define the training places for the monks, and I should thus explain, 'Suppose another monk doesn't show respect, pratyekabuddha.'",
        "source": "T23n1442_042:0856c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復苾芻者，謂雜色，餘義如上。",
        "translation": "Whatever bhikṣu is, it's a mixed color, and the rest is as above.",
        "source": "T23n1442_042:0857a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不恭敬者，有其二種：一謂大眾、二是別人。",
        "translation": "There are two kinds of people who are disrespectful: those who are public and those who are not.",
        "source": "T23n1442_042:0857a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二處不恭敬時，皆得墮罪。",
        "translation": "When they don't revere these two places, they'll both fall into sin.",
        "source": "T23n1442_042:0857a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What are the circumstances of this offense?",
        "source": "T23n1442_042:0857a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻知大眾集評論事時，喚令赴集而不來者，便得墮罪。",
        "translation": "If a monk knows that when the assembly gathers to discuss an issue, he summons people to come to the assembly but doesn't come, he'll be guilty of a sin.",
        "source": "T23n1442_042:0857a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喚住不住、遣去不去，遣取臥具而不肯取、不遣取時即便強取，遣請房等事皆同此，違眾教時皆得墮罪。",
        "translation": "Such things as staying when called, not staying when sent, not going when sent, refusing to take the bedding when sent, forcibly taking it when it's not sent, and inviting someone to the monastery are likewise a violation of the teachings.",
        "source": "T23n1442_042:0857a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻見鄔波馱耶、阿遮利耶作如是語，喚來不來乃至房等事，違別人教時皆得惡作。",
        "translation": "If a monk sees that Upādhyāya or ācārya says such a thing, summons him to come or not come, or even to a room, it's a misdeed when it's contrary to someone else's teaching.",
        "source": "T23n1442_042:0857a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依道理而白知者，非不恭敬，此皆無犯。",
        "translation": "If someone understands this according to reason, they aren't being disrespectful; they aren't transgressing it.",
        "source": "T23n1442_042:0857a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無犯者，謂初犯人，廣說如上。",
        "translation": "Also, those who are not in violation are first-time offenders, as explained in detail above.",
        "source": "T23n1442_042:0857a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飲酒學處第七十九",
        "translation": "The seventy-ninth place of training in drinking alcohol",
        "source": "T23n1442_042:0857a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在室羅伐城逝多林給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove of Śrāvastī.",
        "source": "T23n1442_042:0857a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時憍閃毘失收摩羅山，於此山下多諸聚落。",
        "translation": "At the time, Kauśāmbī lost Mount Sumeru, and there were many villages below this mountain.",
        "source": "T23n1442_042:0857a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一長者，名曰浮圖，大富多財衣食豐足，娶妻未久誕生一女，顏貌端正人所樂觀。",
        "translation": "An elder named Potala, who was wealthy and well clothed, married a woman who hadn't been long in giving birth to a daughter whose appearance was well-liked by people.",
        "source": "T23n1442_042:0857a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至年長大，娉與給孤獨長者男為妻。",
        "translation": "When she grew up, she gave her hand in marriage to an orphaned old man.",
        "source": "T23n1442_042:0857a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "浮圖長者未久之間，復誕一息，容儀可愛，初生之日父見歡喜，唱言：「善來！",
        "translation": "Not long after that, another breath was born to that elder Pontoon, with lovely features, and on the day she was first born her father rejoiced and said, \"Good boy!",
        "source": "T23n1442_042:0857a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來！」",
        "translation": "well-come!\"",
        "source": "T23n1442_042:0857a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸親族因與立名，號曰善來。",
        "translation": "Those relatives then gave him a name, which they called Sunrai.",
        "source": "T23n1442_042:0857a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此孩兒薄福力故，所有家產日就銷亡，父母俱喪投竄無所。",
        "translation": "As a result of this child's weak fortune, his family's property soon disappeared, and his parents were both killed and left without a place to go.",
        "source": "T23n1442_042:0857a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人眾見其如此，遂號惡來。",
        "translation": "When the people saw him like that, they called him \"ill-returner.",
        "source": "T23n1442_042:0857a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與乞匃人共為伴侶，以乞活命。",
        "translation": "He was accompanied by a beggar seeking to save his life.",
        "source": "T23n1442_042:0857a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一人是惡來父故舊知識，見其貧苦遂與金錢一文令充衣食。",
        "translation": "Then, there was a man who was an old friend of Airālai's father's and saw how poor he was, so he gave him a penny to cover his clothing and food.",
        "source": "T23n1442_042:0857a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從此離別漸至室羅伐城。",
        "translation": "They parted ways with him and gradually went to the city of Silla Vista.",
        "source": "T23n1442_042:0857a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其姊從婢見而記識，歸報大家曰：「我適出外逢見惡來，非常貧窶。」",
        "translation": "Her sister, who had seen and recognized her from the handmaid, reported to him, \"I've been away and met an evil comer who's very poor.\"",
        "source": "T23n1442_042:0857a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其姊聞已深生惻隱，便令使者送白疊金錢權充虛乏。",
        "translation": "After hearing this, her sister became deeply compassionate and had a messenger send her a pile of money to help her make ends meet.",
        "source": "T23n1442_042:0857a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼薄福故便被賊偷，姊聞此事而嗟歎曰：「我今何用如此惡業薄福人耶？」",
        "translation": "When she heard this, she sighed in admiration and said, \"Why would I use such a person of weak fortune and bad karma now?\"",
        "source": "T23n1442_042:0857a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即棄而不問。",
        "translation": "He then abandoned them without questioning them.",
        "source": "T23n1442_042:0857b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時給孤獨長者請佛及僧就舍而食，備辦種種上妙香饌，瞻望佛僧渴仰而住。",
        "translation": "The orphaned elder then invited the Buddha and the saṃgha to sit in his dwelling and ate, preparing a variety of wonderful fragrant foods as he gazed at the Buddha and saṃgha and longed to stay there.",
        "source": "T23n1442_042:0857b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時惡來并諸乞侶，聞長者設供冀拾遺喰，遂共相携詣設食處。",
        "translation": "When the misfortune arises, the beggar and his companions hear that the elder has made offerings in hopes of picking up the leftovers, so they take them with them and go to the place where the food is offered.",
        "source": "T23n1442_042:0857b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者遙見貧人，命使者曰：「佛僧將至，驅出貧人。」",
        "translation": "When the elder saw the poor man from a distance, he ordered his messengers, \"The Buddha and saṃgha are coming; drive out the poor man!\"",
        "source": "T23n1442_042:0857b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸乞伴各生此念：「斯大長者先有悲心，我等孤獨常為依怙，何故今時苦見驅逐？",
        "translation": "Each of the begging companions then had this thought, \"That great man had a compassionate heart, and we've always been alone and relied on him; why are we now suffering and seeing him driven out?",
        "source": "T23n1442_042:0857b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈非惡來惡業之力殃及我等？」",
        "translation": "Is it not the power of evil karma from evil people that affects us?\"",
        "source": "T23n1442_042:0857b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便共舉擲之糞聚。",
        "translation": "They even tossed it into a pile of dung together.",
        "source": "T23n1442_042:0857b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡來既被同伴所輕，遂於糞聚啼泣而臥。",
        "translation": "Having been despised by his companions, the bad boy lamented and lay down in the dung heaped together.",
        "source": "T23n1442_042:0857b08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者令使往白時至，爾時世尊於日初分執持衣鉢，大眾圍繞往長者家欲詣食所。",
        "translation": "When the elder ordered his messengers to go and tell them when they arrived, the Bhagavān took his robe and bowl at the beginning of the day and surrounded them as they went to the elder's house to go to the feeding place.",
        "source": "T23n1442_042:0857b09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊由大悲力引向惡來處立，告諸苾芻曰：「汝等當厭流轉諸有無邊苦海，復厭生死資生之具。",
        "translation": "At the time, the Bhagavān was led by the power of great compassion to stand in the place of the evil one and addressed the monks, \"You must be weary of wandering through the limitless ocean of suffering in existence and weary of the necessities of birth-and-death.",
        "source": "T23n1442_042:0857b11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等觀此最後生人，更不流轉受斯苦惱，不自支濟。」",
        "translation": "You must observe that this is the last person to be born, so you won't be reborn into this kind of suffering and discomfort and won't support yourselves.\"",
        "source": "T23n1442_042:0857b13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即告阿難陀曰：「汝於今日為善來故應留半食。」",
        "translation": "He then addressed Ānanda, \"Today, you should reserve half a meal for the sake of the good comer.\"",
        "source": "T23n1442_042:0857b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊入長者家就座而坐。",
        "translation": "The Bhagavān then entered the elder's home and took his seat.",
        "source": "T23n1442_042:0857b16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者既見大眾坐定，即以種種淨妙飲食，供佛及僧皆令飽足。",
        "translation": "After he saw the large crowd sitting there, the elder offered the Buddha and the saṃgha a variety of pure and delicious foods, making sure they were all satisfied.",
        "source": "T23n1442_042:0857b16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀由彼善來惡業力故，所許半食忘不為留。",
        "translation": "Then, because of the bad karmic forces of that good man, Ānanda forgot about half of the food he'd been given and didn't keep it.",
        "source": "T23n1442_042:0857b18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊大師得無忘念，知阿難陀忘不留食，即於己鉢留其半分。",
        "translation": "The Bhagavān, the great teacher, attained mindfulness without forgetting and knew that Ānanda had forgotten not to keep the food, so he left half of it in his own bowl.",
        "source": "T23n1442_042:0857b19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀食已生念：「我於今日情有擾亂，違世尊教。」",
        "translation": "After he ate, Ānanda had this thought, \"Today, my feelings are disturbed, and I've disobeyed the Bhagavān's teaching.\"",
        "source": "T23n1442_042:0857b20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難陀：「假使贍部洲四至大海滿中諸佛，然此諸佛各說深法，汝悉受持無有遺忘。",
        "translation": "The Buddha told Ānanda, \"Suppose there were buddhas in the four seas of Jambudvīpa that taught profound lessons, and you were to accept them all without forgetting them.",
        "source": "T23n1442_042:0857b22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今由善來薄福力故，令汝不憶。",
        "translation": "Now, because of the weak merit of the well-come ones, you won't remember them.",
        "source": "T23n1442_042:0857b24_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今可去喚彼善來。」",
        "translation": "Now, you may go and summon that good arrival.\"",
        "source": "T23n1442_042:0857b24_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀奉教而去，至彼告曰：「善來！",
        "translation": "Ananta then departed as instructed and went there and told him, \"Sunna!",
        "source": "T23n1442_042:0857b25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來！」",
        "translation": "well-come!\"",
        "source": "T23n1442_042:0857b26_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼不自憶善來之名，默爾無對。",
        "translation": "They didn't remember Sunrai's name for themselves, and they remained silent without responding.",
        "source": "T23n1442_042:0857b26_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀復更唱言：「是浮圖之子先號善來，非餘人也。」",
        "translation": "Again, Ānanda called out, \"That was the son of Potala who was first called Sunnah and not someone else.\"",
        "source": "T23n1442_042:0857b26_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來聞已作如是念，說伽他曰：「我失善來名，　　今從何所至？",
        "translation": "After the good lad heard this, he had this thought and said to the gṛdhrakūṭa, \"I've lost the name of the good lad, so where did I come from now?",
        "source": "T23n1442_042:0857b28_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　豈非惡報盡，　　善業此時生！",
        "translation": "Is it not that evil retribution is ended, and good karma is produced at this time!",
        "source": "T23n1442_042:0857c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛具一切智，　　一切眾所歸；　由彼愛善言，　　名善來應理。",
        "translation": "The Buddha has omniscience, to which all people belong; because he loves good words, he's called a good comer according to reason.",
        "source": "T23n1442_042:0857c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我是無福人，　　諸親皆棄捨；　禍哉眾苦逼，　　豈名為善來。」",
        "translation": "I'm an unmerited person whom all my relatives have rejected; woe betide me when I'm stifled by suffering, how could I be called a good comer?\"",
        "source": "T23n1442_042:0857c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀即引善來往詣佛所，禮佛足已在一面坐，佛告阿難陀：「與其半食。」",
        "translation": "Ānanda then led Shānāman to the Buddha, bowed his feet, and sat down at one side.",
        "source": "T23n1442_042:0857c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀取鉢授與。",
        "translation": "Ānanda took the bowl and gave it to him.",
        "source": "T23n1442_042:0857c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來見半食已遂便流淚，作如是語：「雖佛世尊為我留分，但唯片許寧足我飢？」",
        "translation": "Seeing the half-meal, Shanlai then burst into tears and said, \"Even though the Bhagavān has reserved a portion for me, how could just a little bit be enough to satisfy my hunger?\"",
        "source": "T23n1442_042:0857c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊了知善來所念，以慰喻言告善來曰：「假令汝腹寬如大海，噉一一口摶若妙高，隨汝幾時食終不盡。",
        "translation": "Knowing what Shanlai was thinking, the Bhagavān addressed Shanlai with a comforting metaphor, saying, \"Suppose your belly is as wide as the ocean and you devour a mouthful of it like a marvelous heights, and you never run out of food after eating it for as long as you like.",
        "source": "T23n1442_042:0857c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應食，勿起憂懷。」",
        "translation": "Now, you should eat, and don't become sad.\"",
        "source": "T23n1442_042:0857c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來便食，食已歡喜。",
        "translation": "The well-come one then ate, and rejoiced when he finished eating.",
        "source": "T23n1442_042:0857c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝之衣角是何物耶？」",
        "translation": "The Bhagavān told him, \"What's this horn of your robe?\"",
        "source": "T23n1442_042:0857c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便開解見一金錢，白佛言：「此一金錢是父知識見我貧苦持以相贈，由薄福故忘而不憶。」",
        "translation": "Even though he was enlightened, he saw a coin and said to the Buddha, \"This is a gold coin that my father's friend saw me in poverty and gave to me, but he forgot about it because of my weak fortune.\"",
        "source": "T23n1442_042:0857c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝可持此金錢買青蓮花來。」",
        "translation": "The Bhagavān told him, \"You can take this money and buy blue lotus flowers.\"",
        "source": "T23n1442_042:0857c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來去後，佛及僧眾俱還本處。",
        "translation": "After Shanlai left, the Buddha and the saṃgha returned to their original location.",
        "source": "T23n1442_042:0857c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來奉佛教已，遂詣賣花人藍婆住處入彼園中。",
        "translation": "After he had received the Buddha's teaching, Shanlai then went to the flower seller Rāmaputta's residence and entered his garden.",
        "source": "T23n1442_042:0857c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "園主見已報曰：「惡來可去，莫入我園，勿由汝故樹池枯燥。」",
        "translation": "When the owner of the garden saw this, he replied, \"You may leave, but don't enter my garden; don't let the trees and pond dry up because of you.\"",
        "source": "T23n1442_042:0857c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來報白：「世尊使我買青蓮花。」",
        "translation": "The well-come man reported, \"The Bhagavān told me to buy blue lotus flowers.\"",
        "source": "T23n1442_042:0857c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽他曰：「我於青蓮花，　　其實無所用；　大師一切智，　　遣我買將來。」",
        "translation": "Sugata said, \"I really have no use for the blue lotus flower; the Bhagavān, with his omniscience, sent me to buy it for the future.\"",
        "source": "T23n1442_042:0857c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時藍婆聞是佛使，心生敬仰即說伽他曰：「牟尼大寂靜，　　天人咸供養；　汝為佛使者，　　須花任意將。」",
        "translation": "Hearing that he was the Buddha's messenger, Rāmaputta felt respect for him and said to Gṛdhrakūṭa, \"The Muni is so quiescent that gods and humans make offerings to him; you're the Buddha's messenger, so you need flowers at will.\"",
        "source": "T23n1442_042:0857c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來與金錢已，多取青蓮花還詣佛所。",
        "translation": "After giving them the money, the good lad took many of the blue lotus flowers and returned to the Buddha.",
        "source": "T23n1442_042:0857c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊見已告言：「善來！",
        "translation": "After he saw them, the Bhagavān told them, \"Well done, Sunetra!",
        "source": "T23n1442_042:0857c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可持此蓮花行與僧眾。」",
        "translation": "You may carry this lotus flower and distribute it to the saṃgha.\"",
        "source": "T23n1442_042:0857c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來持花從佛及僧次第行與。",
        "translation": "The good lord took the flowers and handed them out in order from the Buddha and the saṃgha.",
        "source": "T23n1442_042:0857c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻皆不敢受，佛言：「於此施主生憐愍心當為受用，然諸香物皆益眼根，嗅之無過。」",
        "translation": "The monks didn't dare to accept it, but the Buddha said, \"This is a gift that you should accept with kindness and consideration for the donor, for the fragrant things will benefit your eye faculty, and there's nothing wrong with smelling them.\"",
        "source": "T23n1442_042:0857c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻悉皆為受，花乃開敷。",
        "translation": "The beggars then all accepted it, and the flowers blossomed.",
        "source": "T23n1442_042:0858a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來既見青蓮花已，憶昔前身曾諸佛所修青處觀影像現前，世尊復為演說法要，示教利喜便證見諦。",
        "translation": "After he saw the blue lotus flowers, the well-come one recalled that in the past he had seen images of the blue-field contemplation cultivated by various buddhas, and the Bhagavān then explained the essentials of the Dharma for him, showing him the benefits of the teaching and then realizing the truth.",
        "source": "T23n1442_042:0858a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來獲初果已，即說伽他自申慶讚：「佛以方便勝羂索，　　牽我令住於見諦；　於惡趣中興愍念，　　如拔老象出深泥。",
        "translation": "After he had attained the first realization, the good lai then said, \"The Buddha led me by the rope of skillful means to abide in the truth of seeing; he aroused compassion in a bad destiny like pulling an old elephant out of deep mud.",
        "source": "T23n1442_042:0858a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於昔時名善來，　　後時人號惡來者；　今是善來名不謬，　　由住牟尼聖教中。」",
        "translation": "In the past, I was called a good comer; later, people called me a bad comer; now, this is a good comer whose name is not mistaken because he abides in the noble teaching of Muni.\"",
        "source": "T23n1442_042:0858a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是頌已即從座起，禮佛雙足白言：「世尊！",
        "translation": "After speaking this verse, he rose from his seat, bowed his feet to the Buddha, and said, \"Bhagavān!",
        "source": "T23n1442_042:0858a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲於如來善說法律之中出家離俗修持梵行。」",
        "translation": "Now, I want to leave home and cultivate the religious practice amidst the Tathāgata's well-explained teachings.\"",
        "source": "T23n1442_042:0858a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊以梵音聲告言：「善來苾芻！",
        "translation": "The Bhagavān addressed them in a Sanskrit voice, \"Well come, monks!",
        "source": "T23n1442_042:0858a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝修梵行。」",
        "translation": "You'll cultivate the religious practice.\"",
        "source": "T23n1442_042:0858a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語已即便出家，鬚髮自落法服著身，具足近圓成苾芻性。",
        "translation": "After saying these words, he left home, pulled down his hair and hair on his back, put on his Dharma robes, and fully attained the nature of a pratyekabuddha.",
        "source": "T23n1442_042:0858a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來從此已後，發大勇猛守堅固心，於初後夜思惟忘倦，斷除結惑證阿羅漢果，說伽他曰：「昔於諸佛所，　　但持瓦鐵身；　今聞世尊教，　　轉作真金體。",
        "translation": "From then on, the good lama aroused great courage, maintained a resolute mind, contemplated and forgot about it during the first and last nights, cut off the bonds and confusions, and realized the fruit of the arhat, saying, \"In the past, the buddhas used to maintain a body of masonry; now, after hearing the Bhagavān's teaching, I've been transformed into a body of genuine gold.",
        "source": "T23n1442_042:0858a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於生死中，　　更不受後有；　奉持無漏法，　　安趣涅槃城。",
        "translation": "During birth and death, I won't be subject to a later existence; I'll uphold the uncontaminated Dharma and safely enter the city of nirvāṇa.",
        "source": "T23n1442_042:0858a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人樂珍寶，　　及生天解脫；　當近善知識，　　所願皆隨意。」",
        "translation": "If people delight in treasures and are liberated by birth in heaven, they'll approach a good teacher and have whatever they desire.\"",
        "source": "T23n1442_042:0858a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從佛世尊度舍利子、大目乾連、大迦攝波、畢隣陀伐蹉等已，諸世間人不信敬者，便生嫌議作如是語：「沙門喬答摩是盜世間珍寶之賊，於大地內時有如斯人中龍象間出於世，悉皆竊誘令其出家以充給侍。」",
        "translation": "After the Bhagavān had delivered Śāriputra, Mahāmaudgalyāyana, Mahākāśyapa, and Pilinda-vatsa, people in the world who didn't believe and respect them became suspicious and said, \"That ascetic Gautama is a thief who steals the treasures of the world, and there are dragons and elephants among such people who appear in the world at times within the great land, and they all steal and entice them to leave home to serve them.\"",
        "source": "T23n1442_042:0858a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦曾度尼他賤人、小路、牛主、勝惠、河側五百漁人及善來等，不信敬人復生譏謗：「沙門喬答摩貪覓弟子無有休息，世有貧賤愚癡之人，亦度出家以為走使。」",
        "translation": "The Buddha also once saved a lowly man named Nidā, a young road, a cowherd, Pratibhāna, five hundred fishermen on the river, and a good comer, but disbelievers again criticized him, saying, \"That ascetic Gautama covets disciples without rest, and there are poor, lowly, and foolish people in the world who are made to leave home and serve as messengers.\"",
        "source": "T23n1442_042:0858a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊聞已作如是念：「我大弟子德若妙高，時眾無知輒為輕忽，無故招罪自害其軀。",
        "translation": "After hearing this, the Bhagavān had this thought, \"My great disciple has marvelous virtue, but at the time, many people were ignorant and easily disregarded, which unjustifiably brought harm to their own bodies.",
        "source": "T23n1442_042:0858b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我宜應發起善來殊勝之德。」",
        "translation": "Now, it's appropriate for me to give rise to the excellent virtue of the well-come ones.\"",
        "source": "T23n1442_042:0858b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊法爾，諸弟子中實有勝德人不知者，佛即方便彰顯其德。",
        "translation": "If that's the case with the Bhagavān, then the Buddha will skillfully reveal the superior virtues of those disciples who really don't know about them.",
        "source": "T23n1442_042:0858b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為欲發起善來德故，命阿難陀曰：「我今欲往失收摩羅山，若諸苾芻樂隨逐者可持衣鉢。」",
        "translation": "It was then that the Bhagavān instructed Ānanda to tell him, \"Now, I want to go to Mount Mākamālā, and if any monk is willing to follow, he can carry his robe and bowl.\"",
        "source": "T23n1442_042:0858b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說乃至到失收摩羅山。",
        "translation": "It was explained in detail up to Mount Absalomarra.",
        "source": "T23n1442_042:0858b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼住處有一毒龍，於菴婆林依止而住，近此山邊所有穀稼常被傷損。",
        "translation": "At the time, there was a poisonous dragon living there, resting in the forest of Ambapālī, which often damaged the crops near the mountain.",
        "source": "T23n1442_042:0858b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此山諸人聞佛來至，悉皆雲集行詣佛所，頂禮佛足在一面坐。",
        "translation": "When the people on that mountain heard that the Buddha had arrived, they all gathered in clouds and marched over to him, bowed their heads at his feet, and sat down at one side.",
        "source": "T23n1442_042:0858b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為諸人眾演說妙法，示教利喜默然而住。",
        "translation": "The Bhagavān then explained the wonderful Dharma for the people, showed them the benefits of his teaching, and waited silently.",
        "source": "T23n1442_042:0858b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人眾即從座起，禮佛足已白言：「世尊！",
        "translation": "The people then rose from their seats, bowed their heads at the Buddha's feet, and said, \"Bhagavān!",
        "source": "T23n1442_042:0858b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願哀愍，明當就舍受我微供。」",
        "translation": "Please have mercy on him, for he will accept my humble offerings at his abode tomorrow.\"",
        "source": "T23n1442_042:0858b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊知已默然而受。",
        "translation": "The Bhagavān knew this and quietly accepted it.",
        "source": "T23n1442_042:0858b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人等知佛受已從座而去，即於其夜備辦種種上妙供養，并貯水器敷設既訖，旦令使者往白時至。",
        "translation": "Knowing that the Buddha had accepted it, the people departed from their seats and prepared various wonderful offerings that night, stocked water containers, and prepared the offerings, and then sent messengers to the house at sunrise to announce their arrival.",
        "source": "T23n1442_042:0858b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊於日初分執持衣鉢，大眾圍繞往設供處，便於眾首就座而坐，山下諸人婆羅門等具設供養。",
        "translation": "At the beginning of the day, the Bhagavān took his robe and bowl, surrounded by the crowd, and went to the place where the offerings were made, then sat down at the head of the crowd and made offerings to the priests and others down the hill.",
        "source": "T23n1442_042:0858b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛及眾僧各飽足已，乃至俱詣佛所隨處而坐，佛為說法深心歡喜，白佛言：「世尊！",
        "translation": "After the Buddha and the saṃgha had each had enough, they all went to the Buddha and sat down at their own places.",
        "source": "T23n1442_042:0858b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等常聞世尊善能調伏極惡藥叉，謂曠野藥叉、箭毛藥叉、驢像藥叉等；又女藥叉亦皆調伏，謂阿力迦、訶利底等；又諸毒龍亦皆降伏，謂難陀、鄔波難陀、阿鉢羅龍王等。",
        "translation": "We've often heard that the Bhagavān is skilled at controlling the most dangerous yakṣas, such as the wild yakṣa, arrow-haired yakṣa, and donkey-image yakṣa; that female yakṣas are also controlled, such as Āryaka and Hāritī; and that poisonous dragons are also controlled, such as Nandāna, Upananda, and Apalāga-rāja.",
        "source": "T23n1442_042:0858b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T23n1442_042:0858b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此山下菴婆毒龍，常於我等枉作怨讎橫為損害，每日三時恒吐惡氣，齊至百里所有禽獸，聞其毒氣皆悉命終，諸男女等形色黧變盡無光彩。",
        "translation": "Still, this poisonous dragon of Umbar at the bottom of the mountain always makes a false enemy of us and does harm to us, exhaling bad breath three times a day, and all the animals that reach for a hundred miles hear its poisonous breath and die, and the physical appearance of men and women is completely dull and lusterless.",
        "source": "T23n1442_042:0858b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊哀愍我等降此毒龍。」",
        "translation": "Please have mercy on us, Bhagavān, and subdue this poisonous dragon.\"",
        "source": "T23n1442_042:0858c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊聞是語已，告阿難陀曰：「汝可將籌行與大眾，能伏龍者當可取之。」",
        "translation": "After hearing these words, the Bhagavān addressed Ānanda, \"You may share your preparations with the crowd; those who can subdue the dragon will be able to take them.\"",
        "source": "T23n1442_042:0858c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時大眾竟無取者，世尊即命善來曰：「汝可取籌為眾伏彼菴婆毒龍。」",
        "translation": "When there was no one to take them, the Bhagavān instructed Śaṇḍavyūha, \"Take the chips and subdue that poisonous dragon of Āmradārika for the crowd.\"",
        "source": "T23n1442_042:0858c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來聞佛命已，即便取籌於日初分執持衣鉢，入聚落中巡行乞食，飯食訖往菴婆龍所住之處。",
        "translation": "After hearing the Buddha's order, Shanlai then took the chips, gathered his robe and bowl at the beginning of the day, went into the village to solicit alms, and when he finished eating, he went to where the Amba dragon was staying.",
        "source": "T23n1442_042:0858c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼龍王遙見善來入其住處，發大瞋恚騰雲晝昏，雷霆震地便下雨雹欲害善來。",
        "translation": "When that dragon king saw Sunetra enter his dwelling place from a distance, he became furious and sent clouds rising by daybreak, and thunder shook the ground as rain and hail fell, intending to harm Sunetra.",
        "source": "T23n1442_042:0858c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來便入慈定，所有風雨降注之物，悉皆變成沈水香粖、栴檀香粖、耽摩羅香粖，從空而下。",
        "translation": "When Shanlai then fell into a merciful concentration, all the things that the wind and rain rained down turned into the fragrance of sinking water, the fragrance of sandalwood, and the fragrance of tamālap, which rained down from the sky.",
        "source": "T23n1442_042:0858c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時菴婆龍轉更瞋發，復下劍輪矛槊等物，至善來上無不皆成天妙蓮花，從空而下。",
        "translation": "The Ambarāja dragon then turned angry and sent down another sword, a spear, a lance, and other things that reached Shanlai, and they all turned into the heavenly marvelous lotus flowers that rained down from the sky.",
        "source": "T23n1442_042:0858c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍復放烟、善來亦放煙，龍復放火、善來即便入火光定，以神通力身如火聚，周遍龍宮及餘住處火焰充塞。",
        "translation": "When the dragon again emits smoke, Sunetra also emits smoke, and when the dragon again emits fire, Sunetra even enters a fiery concentration in which his body is like a mass of fire with his supernormal powers, and he spreads flames all around the dragon's palace and the rest of his abode.",
        "source": "T23n1442_042:0858c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼毒龍見大焰火心極驚怖，身毛遍竪便欲逃竄，遂見餘方猛焰俱遍，唯善來處寂靜清涼。",
        "translation": "That poisonous dragon was terrified at the sight of that great blazing fire, and his hair stood on end as he tried to flee.",
        "source": "T23n1442_042:0858c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毒龍遂往禮善來足作如是語：「願為救護！",
        "translation": "The poisonous dragon then saluted Sunetra's feet and said, \"May I be of assistance!",
        "source": "T23n1442_042:0858c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為救護！」",
        "translation": "May it be for your protection!\"",
        "source": "T23n1442_042:0858c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來告曰：「汝於前身作垢穢業墮傍生中，復於今時更為惱害作眾不善，從此命終當墮何處？",
        "translation": "The Śaṇḍavyūha told him, \"You created defiled karma in the past and fell into the category of unenlightened beings, and now you're doing even more harm and creating numerous unwholesome acts, so where will you fall at the end of your life?",
        "source": "T23n1442_042:0858c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所依？",
        "translation": "What is the basis of desire?",
        "source": "T23n1442_042:0858c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必墮地獄，此不須疑。」",
        "translation": "He'll surely fall into hell; there's no need to doubt that.\"",
        "source": "T23n1442_042:0858c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時毒龍白善來曰：「大德！",
        "translation": "The poisonous dragon then said to the good lord, \"Mañjuśrī!",
        "source": "T23n1442_042:0858c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸賜言教，我於今時欲何所作？」",
        "translation": "What do I want to do now, if you would be so kind as to explain it to me?\"",
        "source": "T23n1442_042:0858c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來答曰：「當受三歸并五學處，至盡形壽要心莫犯。」",
        "translation": "The good lord answered, \"You must accept the three refuges and five training places, and until the end of your life, you must not transgress them.\"",
        "source": "T23n1442_042:0858c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時毒龍即受三歸并五學處，至盡形壽不殺生、不偷盜、不欲邪行、不飲酒、不妄語。",
        "translation": "The poisonous dragon then took refuge in the three refuges and five training places, and for the rest of his life, he wouldn't kill, steal, engage in wrong sexual behavior, drink alcohol, or speak falsehoods.",
        "source": "T23n1442_042:0858c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為要契已頂禮善來忽然不現。",
        "translation": "After he had given his prostration to the good lord for this promise, he suddenly didn't appear.",
        "source": "T23n1442_042:0858c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善來既伏毒龍，往詣佛所禮佛足已白言：「世尊！",
        "translation": "Having subdued the poisonous dragon, Shanlai then went to the Buddha, bowed his feet, and said, \"Bhagavān!",
        "source": "T23n1442_042:0858c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼之毒龍我已伏訖，為受三歸并五學處。」",
        "translation": "I've subdued that poisonous dragon and accepted the three refuges and five training places for it.\"",
        "source": "T23n1442_042:0858c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「我諸弟子聲聞之中，降伏毒龍善來第一。」",
        "translation": "The Buddha told the monks, \"Among my disciples and śrāvakas, I'm the best at subduing poisonous dragons.\"",
        "source": "T23n1442_042:0858c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時失收摩羅山遠近諸人婆羅門等，見伏毒龍眾無惱害，皆大歡悅得未曾有。",
        "translation": "It was then that the priests and others on Mount Siṃhomola from near and far rejoiced when they saw that the poisonous dragon had been subdued and that the multitude was not harmed.",
        "source": "T23n1442_042:0859a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各持香花供養之具，往詣佛所以申慶悅，禮佛足已各住一面，白言：「世尊！",
        "translation": "Each of them brought along an offering of flowers and incense, went to the Buddha to express their happiness, saluted his feet, and withdrew to one side, saying, \"Bhagavān!",
        "source": "T23n1442_042:0859a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸蒙聖力除彼毒龍，欲申供養願垂納受。」",
        "translation": "Fortunately, I was able to remove that poisonous dragon through the power of a sage, and I'd like to make an offering to him and ask him to accept it.\"",
        "source": "T23n1442_042:0859a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸婆羅門居士男女：「汝等當知，彼之毒龍乃是浮圖之子善來苾芻令其改惡為受歸戒，非是我力。",
        "translation": "The Buddha addressed the Brāhmaṇas and laymen, \"You should know that that poisonous dragon is the son of Fotucheng, a well-coming monk who caused him to change his ways and accept the precepts, not by my power.",
        "source": "T23n1442_042:0859a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等宜應持此諸物供養善來以申報德。」",
        "translation": "You should take these things and make offerings to Shanlai to repay his merits.\"",
        "source": "T23n1442_042:0859a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸人奉佛教已，便持供養詣善來所，頂禮其足白言：「聖者！",
        "translation": "After they had received the Buddha's teaching, the people then took the offerings and went to Sunrai, bowed their heads at his feet, and said, \"Sage!",
        "source": "T23n1442_042:0859a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁於我等降大慈悲施以無畏，能令品彙并皆穌息，願垂教命欲何所為？」",
        "translation": "Sir, you have shown us great compassion and bestowed fearlessness, which has helped to bring all sorts of scriptures to rest.",
        "source": "T23n1442_042:0859a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來告曰：「各隨所依供養三寶。」",
        "translation": "The well-come one told them, \"Each one makes offerings to the Three Treasures according to his or her support.\"",
        "source": "T23n1442_042:0859a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門等由善來故，請佛及僧七日設食，佛默然受。",
        "translation": "The brāhmaṇas and others then invited the Buddha and the saṃgha to offer food for seven days because of the good coming, and the Buddha accepted it in silence.",
        "source": "T23n1442_042:0859a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人等知佛受已禮足而去，即於其夜具辦種種上妙飲食，敷設座褥，旦令使者往白時至：「供養備辦願佛知時。」",
        "translation": "Knowing that the Buddha had accepted it, they bowed their feet and departed. On that night, they prepared a variety of excellent foods and dinners, spread out seats and mats, and sent messengers to the monks at sunrise to tell them, \"May the Buddha know when the offerings are ready.\"",
        "source": "T23n1442_042:0859a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊於日初分將諸大眾，往施主家設食之處。",
        "translation": "At the beginning of the day, the Bhagavān sent the crowd to the donor's house to prepare food.",
        "source": "T23n1442_042:0859a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婆羅門居士等見坐定已，即以種種上妙飲食供佛及僧，皆飽足已，便於佛前聽說法要。",
        "translation": "After they had sat down, the Brāhmaṇas and other laypeople offered the Buddha and the saṃgha a variety of excellent foods and drinks, and once they had had enough, they went before the Buddha to listen to his teaching of the essentials of the Dharma.",
        "source": "T23n1442_042:0859a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初日既然，乃至七日悉皆如是。",
        "translation": "That was the case for the first day and for seven days.",
        "source": "T23n1442_042:0859a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有婆羅門，是善來父先舊知識，能呪毒龍，為怖龍故遂往室羅伐城，改名而住。",
        "translation": "There was a Brāhmaṇa, an old friend of Śālai's father who could spell poisonous dragons, who went to Śrāvastī to fear them and changed his name.",
        "source": "T23n1442_042:0859a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勝光王立為主象大臣，此人因事來至山下，既聞善來降毒龍已生大歡喜。",
        "translation": "At the time, King Jōkō had made him the head elephant minister, and this man had come down to the mountain on business.",
        "source": "T23n1442_042:0859a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往善來處禮雙足已白言：「聖者！",
        "translation": "He went to Sunrai, saluted him with his feet, and said, \"Sage!",
        "source": "T23n1442_042:0859a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我輩有怖多並逃避，今聞大德興悲愍心為除怨害，不任欣喜，欲申供養，願降哀憐明當就食。」",
        "translation": "Since we have fears and often run away, we're delighted to hear that the great virtuous one has a compassionate heart and wants to remove enemies, so we want to make offerings.",
        "source": "T23n1442_042:0859a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來不受。",
        "translation": "The good man then refused.",
        "source": "T23n1442_042:0859a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門重更請曰：「若不肯者，唯願大德還城之日先受我供。」",
        "translation": "The brāhmaṇa then repeated his invitation, \"If you won't accept it, I hope you'll accept my offerings on the day you return to the city.\"",
        "source": "T23n1442_042:0859a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善來哀愍為受。",
        "translation": "The good lord then kindly accepted it.",
        "source": "T23n1442_042:0859b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時山下諸施主等，供佛僧眾滿七日已，俱禮佛足聽說妙法。",
        "translation": "After seven full days of making offerings to the Buddha and his saṃgha, the almsgivers down the mountain all bowed their heads at the Buddha's feet and listened to his explanation of the wonderful Dharma.",
        "source": "T23n1442_042:0859b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為說法要示教利喜，即於座上無量有情除疑獲果。",
        "translation": "The Bhagavān then taught the essentials of the Dharma for the benefit and joy of measureless sentient beings on the throne who had no doubts and had attained the fruit of the teaching.",
        "source": "T23n1442_042:0859b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與僧眾漸至室羅伐城，時給孤獨長者便往佛所，禮佛雙足在一面坐。",
        "translation": "As the Buddha and the saṃgha gradually reached the city of Śrāvastī, an orphaned elder went to the Buddha, bowed his feet, and sat to one side.",
        "source": "T23n1442_042:0859b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為說法已默然而住，時彼長者即從坐起白言：「世尊願佛及僧明就我家為受微供。」",
        "translation": "After the Bhagavān explained the teaching to him, he waited silently. That elder then got up from his seat and said, \"Bhagavān, may the Buddha and the saṃgha come to my house tomorrow to accept a small offering.\"",
        "source": "T23n1442_042:0859b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊默然為受。",
        "translation": "The Bhagavān quietly accepted it.",
        "source": "T23n1442_042:0859b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者知已作禮而去。",
        "translation": "After he knew this, the elder paid homage and departed.",
        "source": "T23n1442_042:0859b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門詣善來處白言：「聖者！",
        "translation": "The Brāhmaṇa then went to the Śārava and said, \"Bhagavān!",
        "source": "T23n1442_042:0859b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先已請，若至本城先受我食。」",
        "translation": "I've already invited you, so if you come to this town, you must first accept my food.\"",
        "source": "T23n1442_042:0859b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來白佛，佛言：「汝已先受，今宜赴請。」",
        "translation": "Wellcome then said to the Buddha, and he said, \"You've accepted it first, so now you should go and ask for it.\"",
        "source": "T23n1442_042:0859b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善來詣彼婆羅門舍，時婆羅門以上妙飲食至誠供養，令飽食已，欲使善來食速消化，便以少許飲象之酒置飲漿中，善來不知飲此漿已，尋嚼齒木澡漱而去。",
        "translation": "Wellcome went to that Brāhmaṇa's abode, where the Brāhmaṇa offered his sincere support with a wonderful meal and satisfied him with it.",
        "source": "T23n1442_042:0859b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至中路被日光所炙醉臥于地。",
        "translation": "When he arrived in the middle of the road, he was scorched by the sun and fell to the ground drunk.",
        "source": "T23n1442_042:0859b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊於一切時得不忘念，便於善來臥處化為草庵，蓋覆其身不令人見。",
        "translation": "Attaining unforgetfulness at all times, the Bhagavān transformed Sunetra's lying place into a straw hermitage, covering it with a cover so that no one could see it.",
        "source": "T23n1442_042:0859b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊於長者舍。",
        "translation": "The Bhagavān was then staying at the house of the elders.",
        "source": "T23n1442_042:0859b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飯食訖，為說法已還至善來處。",
        "translation": "After he finished his meal, he returned to the Shanlai's quarters after teaching the Dharma.",
        "source": "T23n1442_042:0859b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告諸苾芻曰：「汝等當觀善來所作，昔於江猪山處降伏菴婆毒龍。",
        "translation": "He told the monks, \"You should observe what the good lai did when he subdued the poisonous dragon Amba at the Ganges River Pig Mountain in the past.",
        "source": "T23n1442_042:0859b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈復今時能調小鱓。",
        "translation": "Could it be that he's now able to tame a lesser one?",
        "source": "T23n1442_042:0859b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻若飲酒者，有斯大失。」",
        "translation": "If you monks drink alcohol, this will be a great mistake.\"",
        "source": "T23n1442_042:0859b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即以無量百千網鞔輪相福德殊勝莊嚴王手，摩善來頂告言：「善來！",
        "translation": "It was then that the Bhagavān put his hand on Shanlai's head and told him, \"Shanlai!",
        "source": "T23n1442_042:0859b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何不觀察受斯困頓？」",
        "translation": "Why don't you examine this kind of hardship?\"",
        "source": "T23n1442_042:0859b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善來得少醒悟，隨從佛後至逝多林。",
        "translation": "At that point, the well-come one attained a modicum of sobriety and followed the Buddha to Jeta's Grove.",
        "source": "T23n1442_042:0859b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛洗足已於如常座就之而坐，告諸苾芻曰：「汝等當觀，諸飲酒者有斯過失。」",
        "translation": "After washing his feet, the Buddha sat down at his usual seat and addressed the monks, \"You should examine these faults of those who drink alcohol.\"",
        "source": "T23n1442_042:0859b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讚歎持戒，廣說乃至「我觀十利，為諸弟子制其學處應如是說：「若復苾芻飲諸酒者，波逸底迦。」",
        "translation": "He praised the observance of precepts and explained it in detail, saying, \"I observe the ten benefits and define the disciples' training for them in this way: 'Suppose another monk drinks alcohol, pratyekabuddha.'",
        "source": "T23n1442_042:0859b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復苾芻者，謂是善來，餘義如上。",
        "translation": "Suppose another monk is a well-come one, with the other meanings as above.",
        "source": "T23n1442_042:0859b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言諸酒者，謂米麴酒，或以根莖皮葉花果相和成酒，此等諸酒飲時令人惛醉。",
        "translation": "By \"wines,\" I mean rice malt liquor or liquor made from combining roots, stems, bark, leaves, flowers, and fruits, which when drunk causes drunkenness.",
        "source": "T23n1442_042:0859b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飲者，謂吞咽也。",
        "translation": "To drink it is to swallow it.",
        "source": "T23n1442_042:0859c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋罪如前。",
        "translation": "The explanation of the offense is as before.",
        "source": "T23n1442_042:0859c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What are the circumstances of this offense?",
        "source": "T23n1442_042:0859c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻飲諸酒時，能令人醉波逸底迦；若不醉人，飲得惡作罪。",
        "translation": "When a monk drinks alcohol, it makes him drunk, and if he's not drunk, drinking it commits a misdeed.",
        "source": "T23n1442_042:0859c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻見彼諸酒有酒色、酒氣、酒味，若能醉者波逸底迦；若不醉者，得三惡作。",
        "translation": "If a monk sees that wine has the color, smell, and taste of alcohol, he becomes partially intoxicated if he can become intoxicated; if he isn't intoxicated, he commits the three misdeeds.",
        "source": "T23n1442_042:0859c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻飲諸酒時有酒色、酒氣，若能醉者波逸底迦；若不醉者，得二惡作罪。",
        "translation": "If a monk drinks wine that has the color and smell of alcohol, he's pratyekabuddha if he can become intoxicated; if he isn't intoxicated, he commits two misdeeds.",
        "source": "T23n1442_042:0859c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻飲諸酒時但有酒色，若能醉者波逸底迦；若不醉者，得一惡作罪。",
        "translation": "If a monk drinks alcohol with only the color of alcohol, he'll be pratyekabuddha if he can get drunk; if he's not drunk, he'll be guilty of one misdeed.",
        "source": "T23n1442_042:0859c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若食酒糟，醉者波逸底迦；若不醉者，得惡作罪。",
        "translation": "If he eats lees of wine, he becomes intoxicated, and if he's not intoxicated, he commits a heinous act.",
        "source": "T23n1442_042:0859c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若食麴塊者，得惡作罪。",
        "translation": "If someone eats lumps of koṭī, they commit a misdeed.",
        "source": "T23n1442_042:0859c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻食諸根莖葉花果，能醉人者皆得惡作罪。",
        "translation": "If a monk eats roots, stems, leaves, flowers, and fruits that make people drunk, he commits a bad action.",
        "source": "T23n1442_042:0859c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等若以我為師者，凡是諸酒不應自飲，亦不與人，乃至不以茅端渧酒而著口中。",
        "translation": "The Buddha told the monks, \"If you take me as your teacher, you mustn't drink any of this wine yourselves or give it to others, even if you put a drop of it in your mouth.",
        "source": "T23n1442_042:0859c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若故違者得越法罪。」",
        "translation": "If you thus disobey, you'll be guilty of transgressing the Dharma.\"",
        "source": "T23n1442_042:0859c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻飲醋之時有酒色者，飲之無犯。",
        "translation": "If a monk drinks vinegar when it has the color of alcohol, it's not a violation to drink it.",
        "source": "T23n1442_042:0859c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若飲熟煮酒者，此亦無犯。",
        "translation": "It's also not a violation if someone drinks cooked wine.",
        "source": "T23n1442_042:0859c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是醫人令含酒或塗身者無犯。",
        "translation": "It's no offense for a doctor to cause someone to contain wine or to rub it on their body.",
        "source": "T23n1442_042:0859c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無犯謂初犯人，廣說如上。",
        "translation": "Also, it's no offense to refer to the first offender, as explained in detail above.",
        "source": "T23n1442_042:0859c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻見是事已咸皆有疑，請問世尊：「善來苾芻先作何業生富樂家，後遭貧苦常為乞匃號曰惡來，被諸同伴棄之糞聚？",
        "translation": "After seeing this, the monks all had doubts and asked the Bhagavān, \"What was the good monk's previous act that gave rise to a wealthy and happy family, and then he was destitute, always begging for alms, and was called a bad monk and was discarded by his fellow monks as a mass of dung?",
        "source": "T23n1442_042:0859c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復由何業逢值世尊，斷諸煩惱得阿羅漢？」",
        "translation": "By what further action did he meet the Bhagavān and end the afflictions and attain arhatship?\"",
        "source": "T23n1442_042:0859c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等善聽！",
        "translation": "The Buddha addressed the monks, \"All of you, listen well!",
        "source": "T23n1442_042:0859c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古昔無佛出世，有獨覺者出現世間，心懷哀愍口不說法。",
        "translation": "It was long ago when no Buddha appeared in the world and an enlightened one appeared in the world with a compassionate heart and didn't preach at the mouth.",
        "source": "T23n1442_042:0859c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有長者，詣芳園中欲為歡戲。",
        "translation": "An elderly man then went into the fragrant garden with the intention of playing.",
        "source": "T23n1442_042:0859c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有獨覺尊身嬰疾病，為乞食故，著麁弊服來入園中。",
        "translation": "The uniquely enlightened one, who was sick, came into the garden dressed in shabby clothes to solicit alms.",
        "source": "T23n1442_042:0859c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者見已便起瞋恚，生不忍心告使者曰：『此之惡來勿令進入。』",
        "translation": "When the elder saw this, he became angry and became intolerant, telling the messenger, 'Don't let this bad man enter.'",
        "source": "T23n1442_042:0859c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者愍念未即前驅，長者自起扼尊者頸推之糞聚，告言：『汝何不往乞匃人中以為朋類？』",
        "translation": "Before the messenger could pity him and drive him away, the elder himself grabbed the venerable by the neck and pushed him into a pile of dung, telling him, 'Why don't you go among the beggars and become their friend?'",
        "source": "T23n1442_042:0859c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者為愍彼故，猶若鵝王騰身空界作十八變。",
        "translation": "At the time, the Bhagavān took pity on them like a king goose that rises up into the realm of space and creates 18 transformations.",
        "source": "T23n1442_042:0859c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫之類見神通者，疾起悔心如大樹崩，遙禮尊足唱言：『善來聖者，真實福田，願縱身下哀愍於我無識之人為受懺謝，勿令永劫受苦沈淪。』",
        "translation": "Ordinary people who see that superknowledge quickly become remorseful like a great tree crumbling, bowing their heads to the Venerable's feet and singing, 'Well come, noble one, true field of merit, may I accept a debt of gratitude for those without consciousness who pity me even though I'm bent over, so that I won't be submerged in suffering for an eternity.'",
        "source": "T23n1442_042:0860a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼尊者見其至心，即放身下。",
        "translation": "Seeing his genuine intention, the venerable then released his body and lowered it.",
        "source": "T23n1442_042:0860a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者禮已為辦種種上妙飲食花香供養，悔除惡業發弘誓願：『今我所作供養善根，於未來世生大富家，得勝上導師承事無倦，開悟於我趣解脫門。』",
        "translation": "After he paid homage, the elder prepared various offerings of fine foods and flowers, repented of his bad deeds, and made a great vow, 'Now, from the good roots of the offerings I've made, I'll be born in a future life in a wealthy family, attain a superior mentor, serve him without tire, and awaken him to the gate of my liberation.'",
        "source": "T23n1442_042:0860a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T23n1442_042:0860a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔時長者即善來是，曾於獨覺尊所為惱害事，喚作惡來推之糞聚。",
        "translation": "In the past, that elder, the well-come one, once did something harmful to the Bhagavān, calling on him to be a bad comer and pushing him into a garbage pile.",
        "source": "T23n1442_042:0860a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由斯業故於五百生中常為乞匃，人名作惡來，被諸同伴棄於糞聚。",
        "translation": "As a result of that action, he was always a beggar for 500 lifetimes, and people called him a bad comer who was discarded by his fellow travelers in a garbage heap.",
        "source": "T23n1442_042:0860a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由昔供養發願力故，生大富家，於我法中出家斷惑成阿羅漢。",
        "translation": "Because of the power of their vow to make offerings in the past, they were born into a wealthy family, and in my teaching they left home, ended their mental disturbances, and became an arhat.",
        "source": "T23n1442_042:0860a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻自所作業，還須自受果報不亡。",
        "translation": "You monks must still receive the results of your own actions without losing them.",
        "source": "T23n1442_042:0860a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等當修善行勿為惡業，如是應學。」",
        "translation": "Therefore, you must cultivate good conduct and refrain from doing bad actions; you should train yourselves in this way.\"",
        "source": "T23n1442_042:0860a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非時入聚落不囑授苾芻學處第八十",
        "translation": "Entering a village at an inappropriate time and not instructing a monk to train in a certain place is the eightieth.",
        "source": "T23n1442_042:0860a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛在室羅伐城逝多林給孤獨園。",
        "translation": "It was then that the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T23n1442_042:0860a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有餘處婆羅門，來此城中娶婦共歸故宅。",
        "translation": "At the time, there were Brāhmaṇas from other places who had come to the city to marry a woman and return to their former home.",
        "source": "T23n1442_042:0860a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未經多時誕生一女，年漸長大，其父將至舅家。",
        "translation": "A little while later, a daughter was born to him, and as she grew older, her father was about to leave for her uncle's house.",
        "source": "T23n1442_042:0860a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此女情願欲禮逝多林，纔出門時，見諸婆羅門居士婦女欲往禮敬，入報其父。",
        "translation": "When she first left the gate, she saw some women from a Brāhmaṇa community who wanted to go to pay their respects, and they went in to report to her father.",
        "source": "T23n1442_042:0860a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父見伴去，即令童女隨逐而行至寺門前。",
        "translation": "When her father saw her companions leaving, he had the girl follow them to the entrance of the temple.",
        "source": "T23n1442_042:0860a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時鄔陀夷見諸女人引入寺中，次第禮拜至己房中，我說妙法廣說如上。",
        "translation": "Udayin calabash then saw the women enter the temple, venerate them one by one, and go to his room, where I explained the wonderful Dharma as explained above.",
        "source": "T23n1442_042:0860a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時鄔陀夷覩彼童女顏容姿媚，遂起染心即摩觸彼身嗚唼其口。",
        "translation": "When Udayin looked at that young woman's beautiful face, he became defiled and touched her body and gobbled at her mouth.",
        "source": "T23n1442_042:0860a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時童女欲行非法，鄔陀夷不然其事。",
        "translation": "The girl then wanted to do something illegal, but Udayin didn't allow her to do it.",
        "source": "T23n1442_042:0860a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女懷瞋忿遂以指甲自爴身形，既還家已，告其父曰：「鄔陀夷苾芻損我童女。」",
        "translation": "Being angry, she cut her own body with her fingernails. After returning home, she told her father, \"That Udāyin criticized our young girl.\"",
        "source": "T23n1442_042:0860a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其父即告五百婆羅門知。",
        "translation": "Her father then told five hundred brāhmaṇas that he knew about it.",
        "source": "T23n1442_042:0860a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸人聞斯事已各懷瞋忿，共集一處欲打鄔陀夷。",
        "translation": "When those people heard about this, they each became angry and gathered in one place to beat Udayin.",
        "source": "T23n1442_042:0860a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時五百人既至其所，俱共牽曳，乃至移足亦不能令動。",
        "translation": "When the five hundred men reached him, they all pulled him along, and even when they moved their feet, they couldn't make him move.",
        "source": "T23n1442_042:0860b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊知已作如是念：「此是最後教誡鄔陀夷事。」",
        "translation": "After the Bhagavān knew this, he had this thought, \"This is the last thing Udayin calmed.\"",
        "source": "T23n1442_042:0860b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛衰其力令無所堪，諸婆羅門見其力弱即共熟打，幾將至死，曳至王門。",
        "translation": "When the Buddha weakened his strength and made it impossible for him to stand, the brāhmaṇas, seeing that his strength was weak, collectively ripened their strength and beat him, almost to the point of death, and dragged him to the king's gate.",
        "source": "T23n1442_042:0860b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王於高樓上晝日而睡。",
        "translation": "The king then spent the day sleeping on a high building.",
        "source": "T23n1442_042:0860b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊以神通力舒百福莊嚴手，至王寢處彈指作聲，令王警覺告言：「大王！",
        "translation": "At the time, the Bhagavān used his supernormal powers to extend his hundred hands of merit to the king's sleeping quarters, snapping his fingers and making noises to alert the king, saying, \"Great king!",
        "source": "T23n1442_042:0860b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於斷事處善為觀察、善為觀察，不應造次。」",
        "translation": "In the place where you eliminate things, you should observe them well and observe them well, and you shouldn't take any action.\"",
        "source": "T23n1442_042:0860b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞驚覺知是佛聲。",
        "translation": "The king was startled to hear it and knew it was the Buddha's voice.",
        "source": "T23n1442_042:0860b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門於王門下作大叫聲：「有非理事！",
        "translation": "The brāhmaṇa then cried out from beneath the king's gate, \"There's no principle!",
        "source": "T23n1442_042:0860b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有非理事！」",
        "translation": "there are non-regents!\"",
        "source": "T23n1442_042:0860b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王令使問曰：「有何非理？」",
        "translation": "The king ordered his envoy to ask, \"What's wrong with that?\"",
        "source": "T23n1442_042:0860b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者詣門審問其事，具以白王。",
        "translation": "The messenger went to the gate, questioned him about the matter, and gave a full explanation to the king.",
        "source": "T23n1442_042:0860b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞語已便作是念：「世尊令我善為觀察，不應造次者，意為斯事。」",
        "translation": "After hearing what he said, the king then thought, \"The Bhagavān told me to skillfully examine this, and I shouldn't make any distinctions; this is what I think.\"",
        "source": "T23n1442_042:0860b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王喚童女問其虛實，答言：「是實。」",
        "translation": "The king summoned the young woman and asked her about the truth, and she replied, \"It's true.\"",
        "source": "T23n1442_042:0860b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王遣入宮，令勝鬘夫人親自觀察身有損不？",
        "translation": "The king then sent her into the palace and asked Lady Śrīmālā to personally examine whether there was any damage to her body.",
        "source": "T23n1442_042:0860b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勝鬘夫人即喚童女，臥在懷中以實而問，女復言實。",
        "translation": "Then, Lady Śrīmālā summoned the young girl, put her in her arms, and asked her about the truth.",
        "source": "T23n1442_042:0860b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人乃命年老宮人解試驗者目撿虛實，宮人觀已告夫人曰：「此女元無損處。」",
        "translation": "She then ordered an elderly palace attendant to examine her and examine her for the truth. After examining her, the attendant told the madam, \"This girl is perfectly fine.\"",
        "source": "T23n1442_042:0860b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以事白王。",
        "translation": "She then told the king about it.",
        "source": "T23n1442_042:0860b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王大瞋怒，令婆羅門及此女子總付法官極苦治罰。",
        "translation": "The king became furious and ordered the brāhmaṇa and the woman to be summarily sentenced by the judge to extremely severe punishment.",
        "source": "T23n1442_042:0860b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勝光王即三反呵責鄔陀夷已，欲顯如來聖教尊重故，遂便釋放。",
        "translation": "King Vairocana then rebuked Udayin three times and released her because he wanted to show respect for the Tathāgata's noble teaching.",
        "source": "T23n1442_042:0860b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝鬘夫人覆令使者命鄔陀夷至，告言：「大德！",
        "translation": "Lady Śrīmālā then repeatedly ordered her messengers to send Udāyī to him and told him, \"Mañjuśrī!",
        "source": "T23n1442_042:0860b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無上世尊大慈悲父，於無數劫誓願要期，發勤苦心堅修梵行，捨輪王位國城妻子，志存離欲拔濟三界愚癡有情。",
        "translation": "\"The unsurpassed Bhagavān, the father of great compassion, vowed for countless eons to make it a point to diligently and painstakingly cultivate the religious practice, abandon his position as a wheel-turning king, his kingdom, and his wife, and set his heart on secluding himself from desire and rescuing foolish sentient beings in the three realms.",
        "source": "T23n1442_042:0860b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我輩俗流尚希出離，況復仁等善說法律而為出家，剃髮染衣年衰朽邁，於罪累法不能棄捨，以染愛心躬行惡事，令諸俗旅息信敬心。",
        "translation": "We worldlings still hope to leave, so why wouldn't you renounce the world because you well explain the Dharma, shave your hair and dye your clothes, become elderly and decrepit, fail to abandon the burdensome Dharma, and perform bad deeds with a defiled and attached mind, causing worldly travelers to stop believing and respecting them?",
        "source": "T23n1442_042:0860b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T23n1442_042:0860b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛哉！",
        "translation": "What a pain!",
        "source": "T23n1442_042:0860b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄙惡之極。",
        "translation": "That's extremely despicable.",
        "source": "T23n1442_042:0860b28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今已往可宜改悔。」",
        "translation": "From now on, it's appropriate to repent.\"",
        "source": "T23n1442_042:0860b28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時鄔陀夷聞斯責已，極生慚恥，措身無地，遂往具壽舍利子所，頂禮雙足即以上事具悉白知。",
        "translation": "After hearing this rebuke, Udayin was so ashamed that he was unable to stand on his own feet, so he went to Kauśāriputra, bowed his head at his feet, and explained everything that had happened.",
        "source": "T23n1442_042:0860b29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利子觀彼根性隨機說法，并與教授。",
        "translation": "Śāriputra then observed his faculties, explained the teaching as he saw fit, and gave it to him.",
        "source": "T23n1442_042:0860c02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼既聞已深心剋責發勇猛心，未久之間眾惑皆斷證阿羅漢果。",
        "translation": "After hearing this, he was deeply reprimanded and aroused to courage, and in a short time his many mental disturbances were all ended and he realized the fruit of the arhat.",
        "source": "T23n1442_042:0860c03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶卷第四十二",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 42",
        "source": "T23n1442_042:0860c05_0",
        "is_bad_quality": false
    }
]