[
    {
        "source_sentence": "根本說一切有部毘奈耶卷",
        "translation": "Mūlasarvâstivāda-vinaya",
        "source": "T23n1442_013:0691b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第十三",
        "translation": "thirteenth",
        "source": "T23n1442_013:0691b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "Translation by the Tripiṭaka Master Yijing Feng",
        "source": "T23n1442_013:0691b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無根謗學處第八",
        "translation": "Eighth Place of Rootless Denunciation of Learning",
        "source": "T23n1442_013:0691b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時薄伽梵在王舍城羯蘭鐸迦池竹林園中。",
        "translation": "It was then that the Bhagavān was in the bamboo grove at Kalandaka Pond in Rājagṛha.",
        "source": "T23n1442_013:0691b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波波國中有一壯士大臣名曰勝軍，大富多財受用豐足，所有資產如毘沙門王，雖非王族時諸壯士作灌頂法扶以為王，於勝族女納以為妃歡眾而住。",
        "translation": "At the time, there was a stalwart minister named Jōjun in the land of Bāpa, who was wealthy and abundant in possessions and had assets like King Vaiśravaṇa. Although he wasn't a member of the king's family, the stalwart minister performed consecration ceremonies to help him become king, and he took a woman from Jōjun's family as his consort and lived among them in joy.",
        "source": "T23n1442_013:0691b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖淹歲月竟無男女，為求子故祈禱神祇，遍諸天廟及同生天，希望後嗣不遂所願。",
        "translation": "Even though it had been a long time, he had no sons or daughters, so he prayed to gods and goddesses and visited temples and gods of the same lineage to find a son, hoping that his heir wouldn't be what he had hoped for.",
        "source": "T23n1442_013:0691b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然世有云：「由乞求故便獲子者此誠虛妄，斯若是實，人皆千子如轉輪王。」",
        "translation": "Still, there's a worldly saying, \"It's a lie to ask for a son, but if this were true, everyone would have a thousand sons like the wheel-turning king.\"",
        "source": "T23n1442_013:0691b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然由三事方有子息。",
        "translation": "Still, there are three things that make a child productive.",
        "source": "T23n1442_013:0691b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為三？",
        "translation": "What are the three?",
        "source": "T23n1442_013:0691b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者父母交會事；二者其母身淨應合有娠；三者食香現前。",
        "translation": "First, there's the coming together of father and mother; second, his mother's body is purified, and she's expected to become pregnant; and third, the fragrance of food is present.",
        "source": "T23n1442_013:0691b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王業緣合會，時有一天從勝妙天下託蘊王妃，是最後生樂修勝行，有解脫性趣向涅槃，厭背生死於諸有中皆不欣樂。",
        "translation": "When the king's karma coincides, there's a day when he entrusts the king's consort from the most marvelous world, and this is the last birth that's pleasant, cultivates superior practices, has the nature of liberation, and leads to nirvāṇa, and is disillusioned with birth and death; none of them are happy among existences.",
        "source": "T23n1442_013:0691b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聰慧女人有五別智，廣說如上，乃至娠在右脇，喜白王曰：「大王當知！",
        "translation": "If a clever woman with the five kinds of distinctive knowledge explains it in detail as above, or if she's pregnant on her right side, she joyfully says to the king, \"Great king, you should know!",
        "source": "T23n1442_013:0691b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我所懷孕必是光顯宗族，現居右脇是男不疑。」",
        "translation": "My child will surely be a glorious clan, and there's no doubt that he's a male who now resides on the right side.\"",
        "source": "T23n1442_013:0691b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王聞已即大歡慶作如是語：「我從久來常思繼嗣紹我洪業，我既長養終懷反報，廣為惠施福利宗親，我歿世後稱揚我名而為呪願：『願我父母所生之處以福莊嚴。』」",
        "translation": "When the king heard this, he rejoiced greatly and said, \"Since long ago, I've always thought about heirs to my great work, and now that I've nurtured them long enough to eventually conceive a counter-reward, I've given generosity to the welfare of my clan.",
        "source": "T23n1442_013:0691b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時彼王置妃高樓隨意而住，適其時節供給所須，常令女醫為調飲食，冷熱合度諸味具足，奇妙珠瓔以為嚴飾，如天婇女遊歡喜園，常處床座足不履地，目不觀惡色，耳不聽惡聲。",
        "translation": "The king then placed his wife in a high building and lived there as he pleased, provided for her needs in due season, always had her doctor prepare meals, matched hot and cold with flavors, and adorned her with marvelous jewelry, like a goddess visiting a joyful garden, always on a seat with her feet not touching the ground, observing no bad form with her eyes, and not listening to bad sounds with her ears.",
        "source": "T23n1442_013:0691c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經九月已便誕一息，顏貌奇特人所愛樂，額廣眉長、鼻高修直、頂圓若蓋、色美如金、垂手過膝，眾所稱歎。",
        "translation": "After nine months, she'll have a new birth, and her features will be marvelous. She'll have a broad forehead and long eyebrows, a high, straight nose, a rounded peak like a lid, beautiful color like gold, and her hands hanging down past her knees, and she'll be praised by everyone.",
        "source": "T23n1442_013:0691c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過三七日聚會宗親，其父以兒示諸親曰：「此兒今者當立何字？」",
        "translation": "After three or seven days, he gathered with his clan and his father showed his relatives, \"What name will this child have now?\"",
        "source": "T23n1442_013:0691c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其兒生已自然淨潔，未離床褥不為便利，諸人議曰：「中國之法若天然淨潔者名之為實，然此童兒稟識清淨，未離床褥便利不為，淨潔過人便成實物，復是壯力大王之子，應與立字名實力子。」",
        "translation": "After he was born, his son was naturally pure and clean, and he didn't make himself useful before leaving his bed or seat. The people commented, \"If the Chinese teaching says that natural purity is real, then this boy has a pure consciousness, doesn't make himself useful before leaving his bed or seat, and becomes a real thing when he's more pure than human beings.",
        "source": "T23n1442_013:0691c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其實力子誕生之日，五百壯士各並生男，隨其家族而立名字。",
        "translation": "On the day that Pūrṇa was born, each of the five hundred strong men who had been born a son was given a name according to his family.",
        "source": "T23n1442_013:0691c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勝軍王即以太子授八養母：二供乳哺、二作褓持、二為澡浴、二共歡戲，給以乳酪醍醐石蜜，速使長大如蓮出池。",
        "translation": "King Victorious then gave the prince to eight nurturing mothers: two to nurse, two to lay hold of, two to bathe, and two to play together, and he gave them milk and cheese, ghee, and rock honey, so that they would quickly grow up like lotuses emerging from a pond.",
        "source": "T23n1442_013:0691c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有相師於母懷中覩見孩子，即便生念：「此孩子者是二足福田，若人於此少興供養，彼人當獲勝功德利。」",
        "translation": "When a master of signs saw the child in the mother's arms, he thought, \"That child is a two-foot field of merit; if someone makes a small offering to it, that person will reap the benefits of excellent qualities.\"",
        "source": "T23n1442_013:0691c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已告乳母曰：「幸見慈悲授我孩子，我欲隨情少時供養。」",
        "translation": "After that thought, he told the nursemaid, \"It's good to see that you've had the compassion to give me a child, and I want to follow my heart and make offerings to him from time to time.\"",
        "source": "T23n1442_013:0691c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乳母報曰：「我於孩子實無自在，汝欲得者可白王知。」",
        "translation": "The wet nurse replied, \"I really have no control over my child, so if you want to have one, you can tell the king.\"",
        "source": "T23n1442_013:0691c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時相師詣大王所，而白王言：「王之聖子是勝福田，若人於此少興供養，彼人當獲勝功德利。",
        "translation": "The master of signs then went to the king and told him, \"The king's noble son is a field of excellent merit, and if someone makes modest offerings to him, he'll reap the benefits of excellent virtue.",
        "source": "T23n1442_013:0691c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸見授我微伸供養。」",
        "translation": "Please see fit to make a modest offering to me.\"",
        "source": "T23n1442_013:0691c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王報曰：「可隨汝意。」",
        "translation": "The king then replied, \"You may do as you like.\"",
        "source": "T23n1442_013:0691c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼相師便抱歸舍，先沐浴已次塗妙香，以上價衣而覆身上，以酥蜜乳粥盛寶器中持以奉上，既供養已送歸王所。",
        "translation": "The master then took him back to his abode, first bathed him, then smeared him with a wonderful incense, covered him with his valuable robes, put ghee and milk gruel in a precious container, presented it to him, and returned him to the king after making his offerings.",
        "source": "T23n1442_013:0691c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時童子年漸長大，備教書算手印技術悉皆明了。",
        "translation": "The boy then grew older and was well versed in the techniques of writing, counting, and hand-sealing.",
        "source": "T23n1442_013:0691c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又剎帝利王種族之法，所有業藝咸令習學，所謂乘騎象馬控御兵車，刀器干戈鉤索之類，手足奇巧斫射之儀，無不通解。",
        "translation": "Also, the king of the Kārttiyas had taught all the arts of his people, such as riding elephants and horses, controlling chariots, using swords and implements, hooks and ropes, and using hands and feet to chop and shoot with skillful maneuvers, and there was nothing they didn't understand.",
        "source": "T23n1442_013:0692a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時同日生五百童子，如前技藝亦皆明達，其父爾時於春夏冬為造三殿并三苑園，三種婇女謂上中下。",
        "translation": "When 500 sons were born on the same day, they all had the same technical proficiency, and their father then built three halls and three parks in the spring, summer, and winter, and three kinds of uba women, which are described as superior, middling, and inferior.",
        "source": "T23n1442_013:0692a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於一時其實力子昇處高樓，將諸伎女共為娛樂。",
        "translation": "At some point later, his sons ascended to a high building and entertained the girls with their talents.",
        "source": "T23n1442_013:0692a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每日三時五百童子常來集見，曾於他日其五百人出外畋獵，竟日馳騁一無所獲。",
        "translation": "Every day at three o'clock, 500 boys would come to meet them, and on another day, 500 of them would go out hunting and spend the whole day chasing after nothing.",
        "source": "T23n1442_013:0692a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂住林野明日出遊，多有所得至暮方還，便相議曰：「日既將暮無緣赴集，待至明朝方見太子。」",
        "translation": "They then stayed in the forest and went out tomorrow, but they had much to gain and returned late at night. They then agreed, \"Since it's almost sunset, there's no reason to go to the rally; we'll see the prince tomorrow morning.\"",
        "source": "T23n1442_013:0692a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至第三日眾人方見，于時太子告眾人曰：「仁等與我同生常共遊戲，何意三日方來？」",
        "translation": "It was only on the third day that the crowd saw him, and the prince then told the crowd, \"You and I were born together and always play together, so why did it take you three days to get here?\"",
        "source": "T23n1442_013:0692a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「我等出畋。」",
        "translation": "He said, \"We'll go out hunting.\"",
        "source": "T23n1442_013:0692a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「何謂為畋？」",
        "translation": "He said, \"What's meant by hunting?\"",
        "source": "T23n1442_013:0692a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「廣殺諸鹿。」",
        "translation": "He answered, \"They kill a lot of deer.\"",
        "source": "T23n1442_013:0692a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子曰：「彼何飲食？」",
        "translation": "The prince said, \"What will they eat and drink?\"",
        "source": "T23n1442_013:0692a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「飲水食草。」",
        "translation": "He answered, \"Drinking water and eating grass.\"",
        "source": "T23n1442_013:0692a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若如是者無損於人，何緣傷殺？」",
        "translation": "\"If this is so, it doesn't harm people, so why would it harm or kill them?\"",
        "source": "T23n1442_013:0692a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「若見殺時，心生喜悅。」",
        "translation": "He answered, \"If you see killing, your heart becomes joyous.\"",
        "source": "T23n1442_013:0692a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子曰：「仁等不應見他受苦心生歡樂。」",
        "translation": "The prince said, \"You people shouldn't rejoice when you see others suffering.\"",
        "source": "T23n1442_013:0692a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人議曰：「由此太子不自出畋，於我諸人便生譏賤，我當令彼亦共畋遊。」",
        "translation": "The people said, \"Because the prince doesn't go out to hunt himself, we people will be ridiculed, and I will make them go hunting with him.\"",
        "source": "T23n1442_013:0692a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸人至大王所，白言：「大王！",
        "translation": "Those people then went to the king and said, \"Great king!",
        "source": "T23n1442_013:0692a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王之太子生處深宮，若敵國來必生怖懼，何意不令太子遊獵？",
        "translation": "The king's crown prince was born in a deep palace, and he would be afraid if an enemy country came, so why didn't he allow the crown prince to go hunting?",
        "source": "T23n1442_013:0692a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若數出畋心便勇健，與敵國戰情無退怯。」",
        "translation": "If you go out often enough to hunt, your mind will be strong, and you won't be deterred from fighting an enemy country.\"",
        "source": "T23n1442_013:0692a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勝軍王聞此議已，告實力子曰：「汝今可出試學畋遊。」",
        "translation": "After hearing this advice, King Victorious addressed the truly powerful son, \"Now, you can go out and try to learn how to hunt.\"",
        "source": "T23n1442_013:0692a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不願。」",
        "translation": "He replied, \"No, I don't want to.\"",
        "source": "T23n1442_013:0692a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「汝是剎帝利種應習兵戈。」",
        "translation": "The king replied, \"No.\" He said, \"You're a warrior, you should train in armaments.\"",
        "source": "T23n1442_013:0692a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時太子不敢違命隨眾而出，諸人議曰：「今此太子父若歿後當必為王，我等今時盡心承事，能令於後祿位增長。」",
        "translation": "The prince then didn't dare disobey the order and went out with the crowd. The people said, \"Now, if this prince's father dies, he will surely become king, and we will serve him with all our hearts now so that our rank and rank will increase later.\"",
        "source": "T23n1442_013:0692a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白太子曰：「可於斯住，我擁群鹿令至於此，即便安在合圍之處。」",
        "translation": "They said to the prince, \"Stand here, and I'll bring a herd of deer up to here, even if we're placed in a place that's surrounded by them.\"",
        "source": "T23n1442_013:0692a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸人多擁群鹿，太子遙見群鹿驚走，身被箭中張口而至，便作是念：「假使有人心無慈愍不懼後世，尚不於此起毒惡心，況加殺戮。」",
        "translation": "When those people crowded the herd of deer, the prince saw them running away in fear, their bodies hit by arrows, and their mouths open, and then he thought, \"Suppose there's someone without kindness in their heart who doesn't fear the afterlife and doesn't yet become malevolent, so why would they want to kill them?\"",
        "source": "T23n1442_013:0692a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去此不遠有守圍人，太子為護彼情，便放三箭遙射群鹿，或入髀間或穿角際，箭便墮地曾無傷損。",
        "translation": "Not far from here, there's a guard at the fence. To protect his sentient beings, the prince shoots three arrows at the herd of deer, either between the thighs or through the horns, and the arrows fall to the ground without harming them.",
        "source": "T23n1442_013:0692b02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有麋鹿至圍合所，悉皆放出隨意逃竄。",
        "translation": "When the deer arrived at the roundup, they all released their arrows and ran away at will.",
        "source": "T23n1442_013:0692b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸群從皆作是念：「太子久來善習弓矢，今日定應多殺麋鹿。」",
        "translation": "The herd then all thought, \"The prince has long been well-versed in the use of the bow and arrow; today, he surely should have killed more moose.\"",
        "source": "T23n1442_013:0692b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及至詳觀曾不獲一，皆作是念：「或容太子已令車乘先載歸還。」",
        "translation": "When they looked carefully and saw that they hadn't gotten a single one, they all thought, 'Perhaps the prince has allowed his chariot to carry them back first.'",
        "source": "T23n1442_013:0692b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸人問太子曰：「所獲麋鹿今在何處？」",
        "translation": "Those people then asked the prince, \"Where's the moose he got now?\"",
        "source": "T23n1442_013:0692b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子報曰：「猛獸驚奔，幾將殺我！」",
        "translation": "The prince reported, \"A fierce animal is running scared and will almost kill me!\"",
        "source": "T23n1442_013:0692b09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼守圍人報諸人曰：「君等何因遣不害人令其守當，若此欲殺一不得遺，直爾逕看任其走出。」",
        "translation": "The guard reported to them, \"Why did you send someone harmless to guard it? If you wanted to kill one of them, you couldn't have left it behind, so you just looked at it and let it go.\"",
        "source": "T23n1442_013:0692b10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人聞已皆共瞋嫌：「我極艱辛身體傷損擁聚群鹿，斯皆放散，我宜共害。」",
        "translation": "After they heard that, they all shared an angry dislike, \"I've been through a lot of trouble and physical injury, and I've gathered a herd of deer, but they've all been scattered, so I should harm them together.\"",
        "source": "T23n1442_013:0692b12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又更議曰：「若害此者，波波國主定當殺我，宜棄而歸。」",
        "translation": "They also discussed it further, saying, \"If we harm them, the lord of Bopā will surely kill me, so we should abandon them and return.\"",
        "source": "T23n1442_013:0692b14_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子便生是念：「此等與我撫塵共戲，為不獲鹿棄我荒林，我若為王於此諸人為不饒益。」",
        "translation": "The prince then had this thought, \"These people are playing with me and the dust in my hands, and they abandoned my deserted forest so that they wouldn't get a deer, so it wouldn't be beneficial to them if I were king.\"",
        "source": "T23n1442_013:0692b15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已徐歸本城，既至宮中以手支頰愁思而住。",
        "translation": "After thinking this, he returned to his native city and went to the palace, put his hands on his cheeks, and stayed there in thought.",
        "source": "T23n1442_013:0692b17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼內人來至其所，于時太子不以目觀，內人見已入白王曰：「大王當知！",
        "translation": "When one of the inner circle came to him, the prince didn't look at him with his eyes, but when he saw them, he went in and said to the king, \"You must know, Your Majesty!",
        "source": "T23n1442_013:0692b18_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子見我目不正視，以手支頰愁悴而住。」",
        "translation": "The prince saw that my eyes were not correctly trained, and he put his hand to his cheek and stayed there sad and downcast.\"",
        "source": "T23n1442_013:0692b20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王親顧問：「汝今何意，懷憂不樂？」",
        "translation": "The king asked him personally, \"What do you think now, being sad and unhappy?\"",
        "source": "T23n1442_013:0692b21_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「父王令我作屠獵事，豈得不憂。」",
        "translation": "He said, \"Father, I was told to do hunting. How could I not be concerned?\"",
        "source": "T23n1442_013:0692b21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「畋獵之事爾不愛耶？」",
        "translation": "The king said, \"Don't you love hunting?\"",
        "source": "T23n1442_013:0692b22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「實非所愛。」",
        "translation": "He said, \"I really don't like it.\"",
        "source": "T23n1442_013:0692b23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「從今已去更勿出畋。」",
        "translation": "The king said, \"From now on, don't leave the land again.\"",
        "source": "T23n1442_013:0692b23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子便生是念：「俗徒多難眾苦逼迫，常被煩惱之所羈絆，出家閑寂乃至盡形純一無雜圓滿梵行，我今宜應以正信心，從家趣非家而離塵俗。」",
        "translation": "The strength of that thought then occurred to the son, \"Ordinary people are beset by many difficulties and sufferings, and they're constantly tied up by afflictions.",
        "source": "T23n1442_013:0692b24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波波國有外道六師不遠而住，所謂晡刺拏迦攝波子、末塞羯利瞿舍梨子、珊逝移毘刺知子、阿市多雞舍甘跋羅子、脚俱陀迦多演那子、尼健陀慎若低子等，非一切智懷一切智慢，令諸人眾渴仰歸誠。",
        "translation": "It was then that there were six masters from outside the land of Bāpa who lived not far away, known as Asaṅgaśepāja, Mañjuśrī Ghoṣālīja, Sañjayī Vairocana, Aṣṭakauśalya Gambhāraja, Kakuda Kātyāyanāja, and Nirgrantha Senjorāja, who were not omniscient and harbored pride in omniscience, causing crowds of people to long for them and turn to them with sincerity.",
        "source": "T23n1442_013:0692b27_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時實力子，便往詣彼六師之所，白晡刺拏迦攝波曰：「何者是仁所宗法理？",
        "translation": "It was then that Pūrṇa went to those six teachers and said to Asaṅgaśepa, \"Which is the principle of the teaching that's held by you, sir?",
        "source": "T23n1442_013:0692c03_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸弟子以何教授？",
        "translation": "What do you teach your disciples?",
        "source": "T23n1442_013:0692c04_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤修梵行當獲何果？」",
        "translation": "What will be the result of diligently cultivating the religious practice?\"",
        "source": "T23n1442_013:0692c05_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼師告曰：「太子！",
        "translation": "The master told him, \"Crown prince!",
        "source": "T23n1442_013:0692c05_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之所宗，作如是見、作如是說，無施無受亦無祠祀，無善惡行無業因緣無異熟果，無今世無後世，無父無母，亦無化生有情。",
        "translation": "\"My school makes such views and such statements, saying that there's no generosity, no acceptance, no sacrifice, no good or bad actions, no causes and conditions of actions, no results of retribution, no present world or afterlife, no father or mother, and no sentient beings born by transformation.",
        "source": "T23n1442_013:0692c06_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此世間，無阿羅漢正趣正行，此世他世於現法中得自覺悟，正證圓滿皆悉了知，我生已盡，梵行已立，所作已辦，不受後有，此事皆無。",
        "translation": "In this world, there are no arhats who are correctly headed for correct practices, who have attained self-realization in the present life in this or any other life, who have fully realized the full accomplishment, whose self-births have been ended, whose religious practice has been established, whose tasks have been accomplished, and who aren't subject to a later existence, and none of this.",
        "source": "T23n1442_013:0692c09_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此有命，名之為生。",
        "translation": "Here there's life, which is called birth.",
        "source": "T23n1442_013:0692c12_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此身謝已五大分離更無生理，名之為死。",
        "translation": "After this body has been aged, the five elements part and there's no more physical body, which is called death.",
        "source": "T23n1442_013:0692c12_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地歸於地、水歸於水、火歸於火、風歸於風，諸根歸空，四人輿至焚燒之處，以火燒訖，但有殘骨更無所知，愚智同此。",
        "translation": "As earth returns to earth, water returns to water, fire returns to fire, wind returns to wind, and the faculties return to emptiness, these four people are borne to a place of burning and burned up with fire, and there are only remains of bones and nothing more to know, which is the same for fools and the wise.",
        "source": "T23n1442_013:0692c13_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與者名施，取者名受，諸說有者皆是虛妄。」",
        "translation": "Those who give are called giving, those who take are called receiving, and those who say there is something are false.\"",
        "source": "T23n1442_013:0692c16_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子聞是語已便作此念：「此之大師背正路行邪道，猶如險途是可怖畏，智者所棄不應修習。」",
        "translation": "After hearing these words, the truly powerful son then had this thought, \"This great teacher is following a wrong path in disagreement with the right path, which is like a dangerous path that's frightening and should not be cultivated because it's rejected by wise people.\"",
        "source": "T23n1442_013:0692c17_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽他曰：「惡慧說惡法，　　實愚稱大師；　此法將為是，　　何者名非法？」",
        "translation": "He said to the true disciple, \"Bad wisdom teaches a bad dharma, and a true fool calls himself a great teacher; what would this dharma be, and what would it be called if it weren't?\"",
        "source": "T23n1442_013:0692c19_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，如擊空器但有虛聲，棄之而去。",
        "translation": "After thus knowing this, he struck the empty vessel like it was nothing but a hollow sound, discarded it, and departed.",
        "source": "T23n1442_013:0692c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子復更往詣末塞羯利瞿舍利子所，而白之曰：「何者是仁所宗法理？",
        "translation": "The senior monk then went back to Mañjuśrī Kāḷikāśyapa and asked him, \"Which is the principle of the teaching that Ren has adopted?",
        "source": "T23n1442_013:0692c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸弟子以何教授？",
        "translation": "What do you teach your disciples?",
        "source": "T23n1442_013:0692c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤修梵行當獲何果？」",
        "translation": "What will be the result of diligently cultivating the religious practice?\"",
        "source": "T23n1442_013:0692c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼師告曰：「太子！",
        "translation": "The master told him, \"Crown prince!",
        "source": "T23n1442_013:0692c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之所宗，作如是見、作如是說，一切有情無因無緣而有煩惱，一切有情無因無緣為煩惱所逼，一切有情無因無緣而有清淨，一切有情無因無緣而得清淨，一切有情無因無緣而有無知，一切有情無因無緣了無知事，一切有情無力無勤無勇無進無自無他，一切有情諸有命者無有威勢，於六生中常受苦樂，過此便無。」",
        "translation": "My school makes such views and such statements, saying that all sentient beings have afflictions without cause or condition, all sentient beings are oppressed by afflictions without cause or condition, all sentient beings are purified without cause or condition, all sentient beings attain purity without cause or condition, all sentient beings are ignorant without cause or condition, all sentient beings understand things without cause or condition, all sentient beings lack power, lack effort, lack courage, lack effort, lack self, and lack others, and all sentient beings who have life lack authority and are subject to constant suffering and pleasure in the six kinds of birth, beyond which there's nothing.\"",
        "source": "T23n1442_013:0692c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子聞是語已便作是念：「此之大師背正路行邪道，猶如險途是可怖畏，智者所棄不應修習。」",
        "translation": "After hearing these words, the truly powerful son then thought, \"This great teacher deviates from the right path and follows a wrong path, which is like a dangerous path that's frightening and should not be cultivated because it's discarded by wise men.\"",
        "source": "T23n1442_013:0693a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽他曰：「惡慧說惡法，　　實愚稱大師；　此法將為是，　　何者名非法？」",
        "translation": "He said to the true disciple, \"Bad wisdom teaches a bad dharma, and a true fool calls himself a great teacher; what would this dharma be, and what would it be called if it weren't?\"",
        "source": "T23n1442_013:0693a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，如擊空器但有虛聲，棄之而去。",
        "translation": "After thus knowing this, he struck the empty vessel like it was nothing but a hollow sound, discarded it, and departed.",
        "source": "T23n1442_013:0693a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子復更往詣珊逝移毘刺知子所，而白之曰：「何者是仁所宗法理？",
        "translation": "Śāriputra then went back to Śāntarīpa and told him, \"Which is the principle of the teaching that Ren has adopted?",
        "source": "T23n1442_013:0693a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸弟子以何教授？",
        "translation": "What do you teach your disciples?",
        "source": "T23n1442_013:0693a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤修梵行當獲何果？」",
        "translation": "What will be the result of diligently cultivating the religious practice?\"",
        "source": "T23n1442_013:0693a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼師告曰：「太子！",
        "translation": "The master told him, \"Crown prince!",
        "source": "T23n1442_013:0693a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之所宗，作如是見、作如是說，若自殺教他殺，自斫教他斫，自煮教他煮，自盜邪行妄語飲酒，及以教人為殺等故，穿牆開鎖守捉險途，持諸劍輪殺害群品，於大地上所有有情悉皆斬斫，令其命斷為大肉聚，弶伽河已南作斯惡業，弶伽河已北設大福會，不由此故有罪福因招罪福報。",
        "translation": "My school makes such views and such statements, whether it's killing oneself and teaching others to kill, chopping oneself and teaching others to chop, boiling oneself and teaching others to boil, stealing wrong actions, speaking false words and drinking alcohol, teaching others to kill, or teaching them to guard dangerous paths by penetrating walls and opening chains, holding wheels of swords, and killing various people, chopping down all sentient beings on the earth so that their lives are cut off and turned into a great pile of flesh, creating this bad action south of the Snapping River and setting up a great meritorious assembly north of the Snapping River, which doesn't bring the results of bad fortune as a result of bad fortune.",
        "source": "T23n1442_013:0693a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復不由布施持戒少欲知足而獲當果。」",
        "translation": "It's also not by bestowing generosity, observing precepts, and having few desires and satisfactions that he'll attain their proper results.\"",
        "source": "T23n1442_013:0693a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子聞是語已便作是念：「此之大師背正路行邪道，猶如險途多有怖畏，智者所棄不應修習。」",
        "translation": "After hearing these words, the truly powerful son then thought, \"This great teacher is following a wrong path in disagreement with the right path, which is like a dangerous path with many fears that a wise man would abandon and shouldn't cultivate.\"",
        "source": "T23n1442_013:0693a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽他曰：「惡慧說惡法，　　實愚稱大師；　此法將為是，　　何者名非法？」",
        "translation": "He said to the true disciple, \"Bad wisdom teaches a bad dharma, and a true fool calls himself a great teacher; what would this dharma be, and what would it be called if it were not?\"",
        "source": "T23n1442_013:0693a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，如擊空器但有虛聲，棄之而去。",
        "translation": "After knowing this, he struck the empty vessel like it was nothing but a hollow sound, discarded it, and departed.",
        "source": "T23n1442_013:0693a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子復更往詣阿市多雞舍甘跋羅所，而白之曰：「大師！",
        "translation": "The senior monk then went back to Aṣṭakauṣṭhila Gambhala and said, \"Great teacher!",
        "source": "T23n1442_013:0693a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是仁所宗法理？",
        "translation": "What is the principle of the doctrine of the Dharma taught by benevolence?",
        "source": "T23n1442_013:0693a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸弟子以何教誨？",
        "translation": "What teaching do you give to your disciples?",
        "source": "T23n1442_013:0693a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤修梵行當獲何果？」",
        "translation": "What will be the result of diligently cultivating the religious practice?\"",
        "source": "T23n1442_013:0693a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼師答曰：「太子！",
        "translation": "The master replied, \"Crown prince!",
        "source": "T23n1442_013:0693a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之所宗，作如是見、作如是說，此七事身無能作無所作，無能變化無所變化，不可損害其體恒存。",
        "translation": "This is my teaching, which sees and speaks thus, that these seven things in the body can't be done, aren't made, can't change, don't change, and can't be harmed, and their bodies remain permanent.",
        "source": "T23n1442_013:0693a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為七？",
        "translation": "What are the seven?",
        "source": "T23n1442_013:0693b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂地身、水身、火身、風身、苦身、樂身、命身，聚在一處猶如蘆束，運動轉變互不相惱，罪福苦樂亦不相忓，假使有人斬截他首彼無苦痛，於其身中孔隙之內刀劍隨過不損其命，於此實無能殺所殺、能問所問、能憶所憶。",
        "translation": "\"The body of earth, body of water, body of fire, body of wind, body of suffering, body of pleasure, and body of life are all grouped together in one place like a bundle of reeds, and their movements and changes don't bother each other, and their sins, fortune, pain, and pleasure don't play into each other's hands.",
        "source": "T23n1442_013:0693b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其四方有一萬四千緣生產門，復有六萬六千乃至五三二一半業差別，又有六十二行、六十二中劫、二千地獄、三千諸根、三十六精氣，四萬九千龍族，四萬九千妙翅鳥族，四萬九千以人頂骨食外道種族，四萬九千露形外道種族，四萬九千邪命外道種族，有七種想、七種阿蘇羅、七種畢舍遮、七種天、七種人，有七百七池，有七百七夢，有七百七岸，有七百七峯七種勝生，十種增長八大人地。",
        "translation": "In the four directions there are 14,000 perceptual sources of birth, another 66,000 up to 5,322 half-karmic distinctions, 62 practices, 62 medium-length eons, 2,000 hells, 3,000 faculties, 36 vital forces, 49,000 dragons, 49,000 birds with marvelous wings, 49,000 heretics who feed on human bones, 49,000 heretics with bare bodies, 49,000 heretics with wrong livelihood, seven kinds of perceptions, seven kinds of asuras, seven kinds of piśācīs, seven kinds of gods, seven kinds of humans, 7,700 ponds, 7,700 dreams, 7,700 shores, 7,700 peaks, 7 kinds of superior birth, and 10 kinds of growth in the 8 great human stages.",
        "source": "T23n1442_013:0693b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是經於八萬四千大劫，所有愚智皆盡苦邊。",
        "translation": "Thus, after 84,000 great eons, all foolish wisdom ends up at the limit of suffering.",
        "source": "T23n1442_013:0693b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人以細絲縈擲虛空中還墮于地，如是愚智經八萬四千大劫輪迴往復盡苦邊際，於此世間實無沙門婆羅門能作是說：『我制戒禁令諸弟子常勤苦節堅修梵行，未熟之業能令成熟。",
        "translation": "Like a person who tosses a fine thread into the sky and falls back to the ground, such foolish wisdom goes through 84,000 great eons of cyclic existence and returns to the limit of suffering, but there really aren't any ascetics or priests in this world who can say, 'I establish precepts and prohibit my disciples from always diligently and painstakingly cultivating the religious practice, so that unripe actions can be ripened.",
        "source": "T23n1442_013:0693b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "業既熟已能捨眾惡至苦邊際，必定能斷諸有苦樂。』",
        "translation": "Once the karma is ripened, they can abandon the many evils to the limit of suffering, and they'll surely be able to end the suffering and happiness of all sentient beings.'",
        "source": "T23n1442_013:0693b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說劫增減此事皆無，然而必須流轉生死。」",
        "translation": "This matter of saying that eons increase and decrease are nonexistent, yet it's necessary to go through birth-and-death transmigration.\"",
        "source": "T23n1442_013:0693b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時實力子聞是語已，便作是念：「此之大師便背正路行於邪道，猶如險途多有怖畏，智者所棄不應修習。」",
        "translation": "After hearing those words, that man then thought, \"This great teacher is departing from the right path and following a wrong path, which is like a dangerous path with many fears that a wise man would abandon and shouldn't cultivate.\"",
        "source": "T23n1442_013:0693b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽他曰：「惡慧說惡法，　　實愚稱大師；　此法將為是，　　何者名非法？」",
        "translation": "He said, \"Bad wisdom teaches a bad dharma, and a real fool calls himself a great teacher; what would this dharma be, and what would it be called if it were not?\"",
        "source": "T23n1442_013:0693b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，如擊空器但有虛聲，棄之而去。",
        "translation": "Knowing this, he struck it like an empty vessel that makes only a hollow sound, discarded it, and departed.",
        "source": "T23n1442_013:0693c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子復更往詣脚俱陀迦多衍那子所，而白之曰：「大師！",
        "translation": "The senior monk then went back to Kakuda-Katyāyanaputra and said, \"Great teacher!",
        "source": "T23n1442_013:0693c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是仁所宗法理？",
        "translation": "What is the principle of the doctrine of the Dharma taught by benevolence?",
        "source": "T23n1442_013:0693c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸弟子以何教誨？",
        "translation": "What teaching do you give to your disciples?",
        "source": "T23n1442_013:0693c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤修梵行獲得何果？」",
        "translation": "What is the result of diligently cultivating the religious practice?\"",
        "source": "T23n1442_013:0693c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼師答曰：「太子！",
        "translation": "The master replied, \"Crown prince!",
        "source": "T23n1442_013:0693c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之所宗，作如是見、作如是說，若有人來至於我所，作如是問：『有後世耶？』",
        "translation": "My teaching is to see and speak thus, and if someone comes to me and asks, 'Is there an afterlife?'",
        "source": "T23n1442_013:0693c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我報言：『有。』",
        "translation": "I replied, 'Yes.'",
        "source": "T23n1442_013:0693c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『無耶？』",
        "translation": "'No?'",
        "source": "T23n1442_013:0693c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我報言：『無。』",
        "translation": "I replied, 'No.'",
        "source": "T23n1442_013:0693c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『亦有亦無耶？』",
        "translation": "'Is it both existent and nonexistent?'",
        "source": "T23n1442_013:0693c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我報言：『亦有亦無。』",
        "translation": "I replied, 'It's both existent and nonexistent.'",
        "source": "T23n1442_013:0693c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『非有非無耶？』",
        "translation": "'Is it neither existent nor nonexistent?'",
        "source": "T23n1442_013:0693c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦報言：『非有非無。』",
        "translation": "I also replied, 'Neither existent nor nonexistent.'",
        "source": "T23n1442_013:0693c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有問我：『為是耶？』",
        "translation": "If someone asks me, 'Is it so?'",
        "source": "T23n1442_013:0693c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我報言：『是。』",
        "translation": "I replied, 'Yes.'",
        "source": "T23n1442_013:0693c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『為非耶？』",
        "translation": "'Is it no?'",
        "source": "T23n1442_013:0693c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我報言：『非。』",
        "translation": "I replied, 'No.'",
        "source": "T23n1442_013:0693c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『為是非耶？』",
        "translation": "'Is it right or wrong?'",
        "source": "T23n1442_013:0693c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我報言：『是非。』",
        "translation": "I said, 'Right and wrong.'",
        "source": "T23n1442_013:0693c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『非是非耶？』",
        "translation": "'Is it not right or wrong?'",
        "source": "T23n1442_013:0693c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我報言：『非是非。』",
        "translation": "I replied, 'No, it's not right and wrong.'",
        "source": "T23n1442_013:0693c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若問後世一異，亦如是答。」",
        "translation": "If I were to ask about sameness or difference in later lifetimes, I'd answer in the same way.\"",
        "source": "T23n1442_013:0693c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子聞是語已便作是念：「此之大師背正路行邪道，猶如險途多有怖畏，智者所棄不應修習。」",
        "translation": "After hearing these words, the truly powerful son then thought, \"This great teacher is following an evil path that's contrary to the right path, like a dangerous path that's frightening and should not be cultivated because it's rejected by wise people.\"",
        "source": "T23n1442_013:0693c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽他曰：「惡慧說惡法，　　實愚稱大師；　此法將為是，　　何者名非法？」",
        "translation": "He said to the Bhagavān, \"Bad wisdom teaches a bad dharma, and a real fool calls himself a great teacher; what would this dharma be, and what would it be called if it weren't?\"",
        "source": "T23n1442_013:0693c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，如擊空器但有虛聲，棄之而去。",
        "translation": "Knowing this, he struck it like an empty vessel that makes only a hollow sound, discarded it, and departed.",
        "source": "T23n1442_013:0693c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子復更往詣尼揵陀慎若低子所，而白之曰：「大師！",
        "translation": "The senior monk then went back to Nirgrantha Shenron and told him, \"Great teacher!",
        "source": "T23n1442_013:0693c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是仁所宗法理？",
        "translation": "What is the principle of the doctrine of the Dharma taught by benevolence?",
        "source": "T23n1442_013:0693c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸弟子以何教誨？",
        "translation": "What teaching do you give to your disciples?",
        "source": "T23n1442_013:0693c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勤修梵行獲得何果？」",
        "translation": "What is the result of diligently cultivating the religious practice?\"",
        "source": "T23n1442_013:0693c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼師答曰：「太子！",
        "translation": "The master replied, \"Crown prince!",
        "source": "T23n1442_013:0693c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之所宗，作如是見、作如是說，若諸人等見有所受苦樂之事，皆由先世所造業因，以苦行力能除宿業不造新業，決生死堤證無漏法諸業便盡，諸業盡故諸苦亦盡。」",
        "translation": "My school makes such views and such statements, and if people see that the things that are painful and pleasant are the result of actions created in prior lives, then by the power of ascetic practices they can remove past actions and not create new ones, and when they realize the uncontaminated dharma that determines birth-and-death, those actions will end, and because those actions have ended, so will the suffering.\"",
        "source": "T23n1442_013:0693c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子聞是語已便作是念：「此之大師背正路行邪道，猶如險途多有怖畏智者，所棄不應修習。」",
        "translation": "After hearing these words, the truly powerful son then thought, \"This great teacher is following a wrong path in disagreement with the right path, like a dangerous path with many fearful wise ones that should not be cultivated.\"",
        "source": "T23n1442_013:0693c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說伽他曰：「惡慧說惡法，　　實愚稱大師；　此法將為是，　　何者名非法？」",
        "translation": "He said to the true disciple, \"Bad wisdom teaches a bad dharma, and a true fool calls himself a great teacher; what would this dharma be, and what would it be called if it were not?\"",
        "source": "T23n1442_013:0693c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，如擊空器但有虛聲，棄之而去。",
        "translation": "After knowing this, he struck it like an empty vessel with only a hollow sound and discarded it.",
        "source": "T23n1442_013:0694a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還歸本宅昇高樓上，以手支頰作如是念：「於此世間人天魔梵沙門婆羅門，頗有一人能持一、二、三四句神驗呪術明藥方法，於生死中無明牢獄不用多功令我出離？」",
        "translation": "Returning to his home, he rose high on a tower, put his hand to his cheek, and thought, \"Is there someone in this world among humans, gods, Māra, Brahmā, ascetics, and priests who can uphold one, two, three, or four phrases of a miraculous spell, an incantation, or a cure, and cause me to escape without much effort from the prison of ignorance in birth-and-death?\"",
        "source": "T23n1442_013:0694a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛常法觀察世間，無不見聞無不知者，恒起大悲饒益一切為大護者，雄猛第一無有二言，依定慧住，顯發三明，善修三學，善調三業，渡四瀑流，安四神足，於長夜中修四攝行捨除五蓋，遠離五支超越五道，六根具足六度圓滿，七財普施開七覺花，離世八法示八正路，永斷九結明閑九定，充滿十力名聞十方，千自在中最為殊勝，得四無畏震大音聲作師子吼，晝夜六時常以佛眼觀諸世界，誰增、誰損？",
        "translation": "諸佛常法觀察世間，無不見聞無不知者，恒起大悲饒益一切為大護者，雄猛第一無有二言，依定慧住，顯發三明，善修三學，善調三業，渡四瀑流，安四神足，於長夜中修四攝行捨除五蓋，遠離五支超越五道，六根具足六度圓滿，七財普施開七覺花，離世八法示八正路，永斷九結明閑九定，充滿十力名聞十方，千自在中最為殊勝，得四無畏震大音聲作師子吼，晝夜六時常以佛眼觀諸世界，誰增、誰損？",
        "source": "T23n1442_013:0694a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰遭重苦厄難之事？",
        "translation": "Who has suffered great hardship and misfortune?",
        "source": "T23n1442_013:0694a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰趣惡道？",
        "translation": "Who goes to a bad path?",
        "source": "T23n1442_013:0694a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今以勝方便於三惡道拔濟令出，安人天趣使住涅槃，陷欲泥者常思拯救，無聖財者令得聖財。",
        "translation": "Now, with excellent skillful means, I'll rescue those in the three bad destinies and cause them to escape, stabilize those in the destinies of humans and gods and make them abide in nirvāṇa, always consider saving those caught in the mire of desire, and make those without noble possessions attain noble possessions.",
        "source": "T23n1442_013:0694a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛出世間誰當獲益？",
        "translation": "Who will benefit from the Buddha's appearance in the world?",
        "source": "T23n1442_013:0694a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰有無明瞖覆其眼？",
        "translation": "Who has the cataract of ignorance covering their eyes?",
        "source": "T23n1442_013:0694a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以大智藥令目開明，無善根者令種善根，種善根者令其成熟，其成熟者令得解脫。",
        "translation": "He uses the medicine of great wisdom to make his eyes enlightened, makes those without good roots plant good roots, makes them ripen, and makes them ripen so that they're liberated.",
        "source": "T23n1442_013:0694a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有說言：「假使大海潮，　　或失於期限；　佛於所化者，　　濟度不過時。",
        "translation": "As someone once said, \"Even if a great ocean tide were to fail to reach its expiration date, the Buddha's deliverance of those he transforms won't last long.",
        "source": "T23n1442_013:0694a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如母有一兒，　　常護其身命；　佛於所化者，　　愍念過於彼。",
        "translation": "Like a mother with a child who always protects his body and life, the Buddha's sympathy for those he transforms exceeds theirs.",
        "source": "T23n1442_013:0694a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛於諸有情，　　慈念不捨離；　思濟其苦難，　　如母牛隨犢。」",
        "translation": "The Buddha's compassionate mindfulness of sentient beings doesn't abandon them; he considers their suffering and distress to be like a mother cow following a calf.\"",
        "source": "T23n1442_013:0694a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊便作是念：「此實力子，曾於佛所種諸善根，猶如熟癰唯待鈹決，今正是時堪任教化。」",
        "translation": "The Bhagavān then had this thought, \"This worthy son, who once planted good roots in the Buddha's presence, is like a sap ripening just waiting for a beryllium to be decided, and now is the right time to teach and transform him.\"",
        "source": "T23n1442_013:0694a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復觀此人為受佛化、為弟子化、為神力化、為威儀化？",
        "translation": "Again, suppose he observes this person as being transformed by the Buddha, transformed by a disciple, transformed by spiritual power, or transformed by deportment?",
        "source": "T23n1442_013:0694a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀知乃由弟子威儀方能濟度。",
        "translation": "He observes that it's only through the disciple's deportment that he'll be able to save them.",
        "source": "T23n1442_013:0694b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時馬勝苾芻於人天中威儀最勝，世尊即告馬勝苾芻曰：「汝可知時，當觀波波國中實力太子。」",
        "translation": "The Bhagavān then addressed the Bhagavān, telling him, \"You may know when you're observing the strength of the prince in the land of Bopā.\"",
        "source": "T23n1442_013:0694b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時馬勝苾芻默然受教，既至明日日初分時執持衣鉢，入王舍城次第乞食，食事既訖於食後時舉床席已，執持衣鉢漸次遊行，至波波國於水蛭林住。",
        "translation": "The monk then quietly accepted the teaching, took his robe and bowl at the beginning of the day, entered Rājagṛha, and begged for food in order. After finishing his meal, he raised his mat after the meal, took his robe and bowl and gradually marched over to Poipa and stayed in the leech grove.",
        "source": "T23n1442_013:0694b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還以日初分時執持衣鉢，入波波城次第乞食，舉足下足觀視屈伸，擎持衣鉢威儀進趣悉皆詳審。",
        "translation": "At the first part of the day, he takes his robe and bowl and enters the city of Bāpa in order to solicit alms, raising and lowering his feet to scrutinize their flexion and extension, and carrying his robe and bowl with his manner and approach thoroughly examined.",
        "source": "T23n1442_013:0694b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子於高樓上而遙見之，行步安詳曾所未有，威儀進止無有虧失，既遙見已作如是念：「於此國內諸出家人，此之威儀實所不見。",
        "translation": "Seeing him from a high building, the strengths of the disciples saw him walking calmly like never before, and his deportment was unimpeded.",
        "source": "T23n1442_013:0694b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然出家者於聚落內整肅威容，在蘭若中則不如是。",
        "translation": "Still, a renunciant who's solemn and dignified in a village wouldn't behave like that in a forest.",
        "source": "T23n1442_013:0694b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我宜應令人伺察居林野處能如是不？」",
        "translation": "Perhaps I should ask someone to examine whether they can live like this in a forest or in a wilderness.\"",
        "source": "T23n1442_013:0694b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即令使者：「隨此苾芻所至之處，若居蘭若簡絕人徒，彼此容儀有別異不？」",
        "translation": "After this thought, he ordered his messengers, \"Where this monk goes, if he lives in a forest or among isolated people, is there any difference in their appearance?\"",
        "source": "T23n1442_013:0694b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者奉教隨馬勝後私觀察之。",
        "translation": "The messenger was instructed to follow behind Mañjuśrī and privately observe him.",
        "source": "T23n1442_013:0694b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時馬勝苾芻城中得食，詣水蛭林衣鉢水羅置一面已，振去衣塵以羅濾水澡手濯足，取黃落葉布之於地却坐而食。",
        "translation": "When he had obtained his meal in the city, Vātsīputra went to the leech grove, placed his robe, bowl, and water bowl to one side, removed the dust from his robe, washed his hands and feet with filtered water, took yellow leaves, spread them on the ground, and withdrew to sit down to eat.",
        "source": "T23n1442_013:0694b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飯食已收棄殘葉舉置衣鉢，更洗手足結跏而坐，譬如盤龍威儀寂靜正身而住。",
        "translation": "After he's finished eating, he puts away the remaining leaves, puts away his robe and bowl, washes his hands and feet, and sits cross-legged like a pan-dragon with his body calm and correctly positioned.",
        "source": "T23n1442_013:0694b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼使人既觀察已，還白太子曰：「城內見彼苾芻威儀庠序，既至林野百倍勝前。」",
        "translation": "After observing this, the messenger returned to the prince and said, \"I saw that monk in the city in peaceful and dignified form, and he was a hundred times better than before when he arrived in the forest and fields.\"",
        "source": "T23n1442_013:0694b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子告御者曰：「汝今宜應速可嚴駕，欲詣林所觀彼苾芻。」",
        "translation": "The son of Truly Power then addressed the royal servant, \"Now, you should quickly and rigorously drive him to the forest to observe that monk.\"",
        "source": "T23n1442_013:0694b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "御者銜命嚴整駕駟，太子乘車導從而往，既至林所徒步而行，便詣馬勝住處，遙觀尊者馬勝跏趺入定，作如是念：「我今不應令彼苾芻亂殊勝定，待彼出定我當就禮。」",
        "translation": "The royal order was given to him to drive the alleyway in full order, and the prince rode in the chariot and guided him there. When he reached the forest on foot, he went to where Venerable Mañjuśrī was staying and observed Venerable Mañjuśrī cross-legged and enter into meditative concentration from a distance. He thought, \"Now, I shouldn't let that monk disturb his excellent concentration; I'll pay my respects when he emerges from it.\"",
        "source": "T23n1442_013:0694b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已隨處而住，時尊者馬勝至晡後時方始出定，時實力子即漸前行，頂禮雙足在一面住，白言：「大德！",
        "translation": "After he had formed this thought, he stayed there accordingly. Venerable Mañjuśrī didn't emerge from his concentration until late afternoon, when the senior monk gradually moved forward, bowed his head with his feet at one side, and said, \"Mañjuśrī!",
        "source": "T23n1442_013:0694b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是大師？",
        "translation": "Why is it a great teacher?",
        "source": "T23n1442_013:0694c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是弟子？」",
        "translation": "Why is this a disciple?\"",
        "source": "T23n1442_013:0694c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬勝報言：「我是弟子，非大師也。」",
        "translation": "Victor Ma replied, \"I'm a disciple, not a great teacher.\"",
        "source": "T23n1442_013:0694c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問之曰：「師與弟子優劣如何？」",
        "translation": "Again, he asked, \"What's the superiority or inferiority of a teacher and a disciple?\"",
        "source": "T23n1442_013:0694c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬勝報曰：「極有優劣。",
        "translation": "Ma Sheng replied, \"There's a great deal of superiority and inferiority.",
        "source": "T23n1442_013:0694c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子當知，妙高山王比乎芥子，以大海水同於牛跡，亦猶白日等彼螢光。」",
        "translation": "You should know, Prince, that the king of Marvelous Heights is like a mustard seed, and because the ocean is the same as a cow's tracks, it's like a sun that's like a fluorescent light.\"",
        "source": "T23n1442_013:0694c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時具壽馬勝說伽他曰：「妙高比芥子，　　大海同牛跡：　空方藕絲穴，　　白日擬螢光。",
        "translation": "Kauśāmbī then spoke to Gṛdhrakūṭa, saying, \"The marvelously high mountain is compared to a mustard seed, the ocean is the same as the cow's tracks, the sky is a hole made of coupling threads, and the sun is like a fluorescent light.",
        "source": "T23n1442_013:0694c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間所有物，　　不可為譬喻；　弟子望於師，　　其事亦如是。」",
        "translation": "Nothing in this world can be likened to that; when a disciple looks up to his teacher, this is likewise.\"",
        "source": "T23n1442_013:0694c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子聞是說已便作是念：「如苾芻說功德差別，豈非更有妙覺世尊及殊勝法。」",
        "translation": "After hearing this, the truly powerful son then thought, \"If a monk teaches about the distinction in merit, couldn't there be another wonderfully enlightened Bhagavān and an exceptional teaching?\"",
        "source": "T23n1442_013:0694c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已問馬勝曰：「大德！",
        "translation": "Knowing this, he asked Mañjuśrī, \"Mañjuśrī!",
        "source": "T23n1442_013:0694c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今頗得於此善說法律出家圓具成苾芻性，於大德所修梵行不？」",
        "translation": "Now, will I be able to leave home and fully attain the nature of a bhikṣu by skillfully explaining the teaching of the Dharma, and will I cultivate the religious practice of a great teacher?\"",
        "source": "T23n1442_013:0694c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬勝報曰：「太子！",
        "translation": "Ma Sheng reported, \"Crown prince!",
        "source": "T23n1442_013:0694c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之父母見聽許不？」",
        "translation": "Do your parents see and hear you?\"",
        "source": "T23n1442_013:0694c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實力子曰：「大德！",
        "translation": "Śāriputra said, \"Great virtue!",
        "source": "T23n1442_013:0694c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未曾聽許。」",
        "translation": "I've never heard of their approval.\"",
        "source": "T23n1442_013:0694c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬勝報曰：「若如來及如來弟子與他出家，父母不聽無宜輒度。」",
        "translation": "Ma Sheng reported, \"If the Tathāgata or one of his disciples were to leave home with another person, it wouldn't be appropriate for their parents to refuse to allow them to leave.\"",
        "source": "T23n1442_013:0694c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實力子曰：「大德！",
        "translation": "Jñāniputra said, \"Mañjuśrī!",
        "source": "T23n1442_013:0694c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以方便必令見許。」",
        "translation": "With skillful means, I will surely make you see and approve.\"",
        "source": "T23n1442_013:0694c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬勝報曰：「斯極善哉！」",
        "translation": "Ma Sheng replied, \"That's excellent!\"",
        "source": "T23n1442_013:0694c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子聞是語已，恭敬歡喜奉辭而去，便歸本宮白父母曰：「二親當知我已正信今願出家。」",
        "translation": "After hearing these words, the truly powerful son respectfully and joyfully excused himself, and returned to his home palace to tell his parents, \"Both of you should know that I've become a true believer and now want to leave home.\"",
        "source": "T23n1442_013:0694c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母報曰：「汝今知不？",
        "translation": "His parents replied, \"Do you know now?",
        "source": "T23n1442_013:0694c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我唯一子，常所愛念觀視無厭，假令命盡尚不欲離，況復形存而當見別！」",
        "translation": "My only son, whom I always love and look at without tire, would not want to part with him even if his life were to end, so how could he survive in form and then see the other way?\"",
        "source": "T23n1442_013:0694c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子白曰：「見聽者善，若不許者我從今日更不飲食。」",
        "translation": "The prince said, \"Good for those who see and hear it; if they don't approve, I won't eat or drink again from today.\"",
        "source": "T23n1442_013:0694c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖聞此語亦未見聽。",
        "translation": "Even though he heard this, he didn't see and hear it.",
        "source": "T23n1442_013:0694c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子一日斷食，如是二三乃至六日不飲不食。",
        "translation": "That man then cut off his food for one day, and so on for two, three, or even six days, he didn't drink or eat.",
        "source": "T23n1442_013:0694c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼父母詣其子所，而告之曰：「汝自幼童常受安樂，於諸苦事曾所未經，梵行難修獨身難住，隨宜臥具蘭若難居，至盡形壽猛獸同處，至盡形壽從他乞食，至盡形壽斷諸欲樂，至盡形壽永絕嬉戲。",
        "translation": "His parents then went to their son and told him, \"Since you were a child, you've always enjoyed comfort, never experienced anything painful, had difficulty cultivating the religious practice and living alone, had difficulty living in a suitable bed or in a forest, had difficulty living with fierce animals for your whole life, begged food from others for your whole life, stopped desires and pleasures for your whole life, and stopped playing for your whole life.",
        "source": "T23n1442_013:0694c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子！",
        "translation": "Taizi!",
        "source": "T23n1442_013:0695a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應住此受諸欲樂，隨情布施修諸福業。」",
        "translation": "You should abide here and enjoy your desires and cultivate good deeds according to your feelings.\"",
        "source": "T23n1442_013:0695a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子雖聞是語默無所對。",
        "translation": "Although the prince heard these words, he remained silent and didn't respond.",
        "source": "T23n1442_013:0695a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼父母令諸親屬勸實力子，時諸親屬同來勸喻，如父母所言悉皆向說，然實力子默然無答。",
        "translation": "His parents then caused their relatives to encourage the son, and they all came together to encourage him, telling him everything his parents had said, but the real son remained silent and didn't answer.",
        "source": "T23n1442_013:0695a03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼父母令實力子親友知識亦同勸喻，如前父母所告之言悉皆向說，然實力子同前默然，第二、第三亦無言答。",
        "translation": "Those parents then caused the son of Truly Empowered to be advised by his relatives and friends, and they all spoke to him according to what the parents had told him, but the son of Truly Empowered remained silent as before, and he didn't reply to the second and third.",
        "source": "T23n1442_013:0695a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼知識見其堅固，第二、第三一無言答，時諸親友知實力子志意堅固，詣王及妃具陳情理：「某等慇懃誘喻執志不移，觀此容色必無退轉。",
        "translation": "When those friends and relatives saw how resolute he was, they didn't reply to either the second or third. Knowing that the son's resolve was resolute, they went to the king and his wife and explained their reasoning, \"These people have been kind enough to entice him to persevere in his resolve, and when they look at his features, they certainly won't budge.",
        "source": "T23n1442_013:0695a08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐損太子，願垂聽許出家離俗明智共稱。",
        "translation": "They were afraid of damaging the prince, so they asked that he be allowed to leave home and be renounced by wise people.",
        "source": "T23n1442_013:0695a11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若許捨家全其壽命，後不欣樂還歸本宮；若離生緣更何所趣？」",
        "translation": "If we allow him to abandon his family and save his life, won't we be happy to return to our palace afterward; if we part with the causes of birth, where else would we go?\"",
        "source": "T23n1442_013:0695a12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母報曰：「必如是者，宜聽出家，滿其志願。」",
        "translation": "His parents reported, \"It would be better for him to leave home and fulfill his vow.\"",
        "source": "T23n1442_013:0695a13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親友承旨報太子曰：「父母垂慈許令入道。」",
        "translation": "In response to their order, their friends and relatives told the prince, \"In their father's and mother's kindness, they'll allow him to enter the path.\"",
        "source": "T23n1442_013:0695a14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實力聞已慶喜彌增，稍加飲食漸益康健，辭違父母詣彼林中，禮謁馬勝苾芻在一面坐，白言：「大德！",
        "translation": "After hearing this, Shili was overjoyed, took a short meal, and gradually grew healthier. He left his parents and went into the forest, paid homage to the horse's superior monk while sitting at one side, and said, \"Mañjuśrī!",
        "source": "T23n1442_013:0695a15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之尊親已見聽許，幸願慈悲與出家法，進受圓具教以威儀，於大德所善修梵行。」",
        "translation": "My venerable relative has seen and heard and approved of it, so please have mercy on him and give him the renunciant Dharma, accept the full complement of teachings and manner, and skillfully cultivate the religious practice at the place of great virtue.\"",
        "source": "T23n1442_013:0695a17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時具壽馬勝報言：「如是即與出家并受圓具。」",
        "translation": "Kauṣṭhila Masaru then replied, \"Thus will he leave home and receive the complete equipoise.\"",
        "source": "T23n1442_013:0695a19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋告之曰：「汝今知不？",
        "translation": "The investigator told him, \"Do you know now?",
        "source": "T23n1442_013:0695a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻作業有其二種：謂讀誦、修定。",
        "translation": "There are two kinds of activities that monks engage in: recitation and meditation.",
        "source": "T23n1442_013:0695a21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝為讀誦？",
        "translation": "Why do you recite?",
        "source": "T23n1442_013:0695a21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為修定耶？」",
        "translation": "Is it for cultivating concentration?\"",
        "source": "T23n1442_013:0695a22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便報師曰：「鄔波馱耶！",
        "translation": "He then reported to the master, \"Upāya!",
        "source": "T23n1442_013:0695a22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二種俱作。」",
        "translation": "Both kinds are created together.\"",
        "source": "T23n1442_013:0695a22_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便於晝日專心讀誦，若在靜夜繫念禪思，如是不久善閑三藏，精勤策勵無捨須臾，煩惱斷除證阿羅漢果。",
        "translation": "He devotes his mind to recitation during the day and to meditation during the quiet hours of the night, and soon after this, he well acquires the Tripiṭaka, exerts himself without abandoning a moment, and removes his afflictions and realizes the fruit of the arhat.",
        "source": "T23n1442_013:0695a23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時馬勝苾芻所有弟子門人，隨其意樂所學差別悉令受已，詣餘村坊城邑聚落而作安居。",
        "translation": "After accepting all of the disciples and followers of the Bhagavān, according to their wishes and training, they went to some other village, town, or town and made their retreat.",
        "source": "T23n1442_013:0695a25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至八月十五日前安居滿，作衣已竟執持衣鉢，往波波城水蛭林所，安置衣鉢濯足澡手，詣其師處禮雙足已在一面坐。",
        "translation": "When their retreat was complete by the fifteenth day of the eighth month, they finished making robes and took their robes and bowls and went to the leech grove in Poipa, placed their robes and bowls, washed their feet and hands, went to their master, saluted his feet, and sat down to one side.",
        "source": "T23n1442_013:0695a27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸人各隨所證具白其師，復更問餘三藏要義，而白師曰：「我等既見鄔波馱耶親承諮決，我等欲往奉見世尊。」",
        "translation": "Each of those people then explained everything to their teacher according to what they had realized, and they also asked about the essentials of the other three collections and said to their teacher, \"Now that we've seen Upādhyāya and received his personal counsel, we'd like to go and present ourselves to the Bhagavān.\"",
        "source": "T23n1442_013:0695b01_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：「具壽！",
        "translation": "They replied, \"Gosu!",
        "source": "T23n1442_013:0695b03_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨汝意去。」",
        "translation": "Go as you wish.\"",
        "source": "T23n1442_013:0695b04_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子白馬勝苾芻曰：「鄔波馱耶！",
        "translation": "Śāriputra then said to the princely monk, \"Upādhyāya!",
        "source": "T23n1442_013:0695b04_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已得見如來法身，未覩色身。",
        "translation": "I've seen the Tathāgata's Dharma body but haven't yet seen his form body.",
        "source": "T23n1442_013:0695b05_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲往觀佛色身。」",
        "translation": "Now, I want to go see the Buddha's form body.\"",
        "source": "T23n1442_013:0695b05_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「隨意。",
        "translation": "He replied, \"As you wish.",
        "source": "T23n1442_013:0695b06_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當知如來、應、正等覺，是大珍寶出現世間，實難逢遇，如烏曇跋羅花時乃一現。」",
        "translation": "Now, you should know that the Tathāgata, Arhat, and Completely Awakened One are great treasures that appear in the world and are really hard to come across, like the udumbara flower that appears only once in a while.\"",
        "source": "T23n1442_013:0695b06_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子既蒙許去，至明日已於日初分執持衣鉢，入波波城次行乞食。",
        "translation": "Having been permitted to leave, the strength of the disciple then gathered his robe and bowl at the beginning of the day and went into the city of Bāpa to solicit alms.",
        "source": "T23n1442_013:0695b08_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還至本處飯食訖，執持衣鉢詣王舍城，如前威儀洗手足已往詣佛所。",
        "translation": "Returning to his native place after he had eaten, he took his robe and bowl and went to Rājagṛha, washed his hands with the same ceremony as before, and went to the Buddha.",
        "source": "T23n1442_013:0695b10_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊於無量百千苾芻眾中而為說法，世尊遙見實力子來，告言：「善來！",
        "translation": "At the time, the Bhagavān was preaching to a multitude of hundreds of thousands of monks, and when he saw Pūrṇa come from a distance, he told him, \"Good boy!",
        "source": "T23n1442_013:0695b11_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今正是時，隨汝意坐。」",
        "translation": "Now is the right time to sit as you wish.\"",
        "source": "T23n1442_013:0695b13_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子禮佛足已於一面坐，時王舍城中諸苾芻眾，不依同類分僧臥具，所謂經師與律師、經師與論師、經師與法師、經師與禪師、律師與論師、律師與法師、律師與禪師、律師與經師、論師與法師、論師與禪師、論師與經師、論師與律師、法師與禪師、法師與經師、法師與律師、法師與論師、禪師與經師、禪師與律師、禪師與論師、禪師與法師，於經師、律師、論師、法師、禪師，不以同類令聚一處，如是不依同類分與房舍臥具之時。",
        "translation": "After he bowed his head to the Buddha's feet and sat to one side, the multitude of monks in Rājagṛha did not rely on the same kind of division of saṃgha bedding as sūtras and lawyers, sūtras and advocates, sūtras and teachers, sūtras and teachers of the Dharma, sūtras and meditation teachers, lawyers and advocates, lawyers and sūtras, advocates and teachers of the Dharma, advocates and meditation teachers, advocates and teachers, teachers of the Dharma and teachers of the Dharma, teachers of the Dharma and teachers of the Dharma, teachers of the Dharma and teachers of the Dharma, teachers of the meditation and sūtras, teachers of the Dharma and teachers of the Dharma, teachers of the meditation and teachers of the Dharma, teachers of the Dharma and teachers of the Dharma, and teachers of the Dharma and teachers of the Dharma.",
        "source": "T23n1442_013:0695b13_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻共相將護失所受業，各令善品不得增長，如蓮花無水日見衰損。",
        "translation": "The monks then collectively guarded the displaced karma, each preventing the growth of good qualities, like a lotus flower that declines day by day without water.",
        "source": "T23n1442_013:0695b23_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊便作是念：「此實力子於先佛所宿有正願。」",
        "translation": "It was then that the Bhagavān had this thought, \"This worthy son had a prior right vow from a previous Buddha.\"",
        "source": "T23n1442_013:0695b25_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是念：「我當云何得為僧伽作分臥具者？」",
        "translation": "He had this thought, \"How will I be able to make a bed for the saṃgha?\"",
        "source": "T23n1442_013:0695b26_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告諸苾芻曰：「汝諸苾芻！",
        "translation": "It was then that the Bhagavān addressed the monks, \"You monks!",
        "source": "T23n1442_013:0695b27_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應差實力子與僧伽作分僧臥具人。",
        "translation": "\"Suppose he sends a strong son and a monk to be a part-time lay person.",
        "source": "T23n1442_013:0695b28_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若更有餘如是流類具五法者，應差作分臥具人；若無五法即不應差，設差應捨。",
        "translation": "If there are other such streams that are equipped with the five qualities, they should be sent as part of the bedding; if there aren't five qualities, they shouldn't be sent, and if they are sent, they should be discarded.",
        "source": "T23n1442_013:0695b29_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T23n1442_013:0695c01_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有愛、有瞋、有癡、有怖、不知分與不分。",
        "translation": "There's craving, anger, delusion, fear, and not knowing whether to discriminate or not discriminate.",
        "source": "T23n1442_013:0695c02_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若具五法應差，已差不應捨。",
        "translation": "If they have these five things, they should be discriminated, and having been discriminated, they shouldn't be discarded.",
        "source": "T23n1442_013:0695c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T23n1442_013:0695c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無愛、無瞋、無癡、無怖、知分不分，如是應差。",
        "translation": "They are those who have no craving, no anger, no delusion, and no fear, and who know the difference between part and none, and thus should be treated differently.",
        "source": "T23n1442_013:0695c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如常鳴揵稚敷座具，先言白已、次總集僧，對眾應問，當勸喻云：『汝某甲能與僧伽作分臥具人不？』",
        "translation": "As he always sounds the gandharva to prepare his seat, he first explains that he's done so, then he gathers the saṃgha together and asks a question of the crowd, he should exhort them, saying, 'Could you someone make a bed partner with the saṃgha?'",
        "source": "T23n1442_013:0695c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼答言：『能。』",
        "translation": "He replied, 'Yes.'",
        "source": "T23n1442_013:0695c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此苾芻作白羯磨(廣如百一羯磨中)。」",
        "translation": "This monk then made a white karma (as detailed in the hundred and one karmas).\"",
        "source": "T23n1442_013:0695c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子被眾差為分臥具人已，所有眾僧房舍臥具，皆依同類而處置之。",
        "translation": "After he was assigned by the crowd to be the person who distributed the bedding, the senior monk disposed of the bedding in each of the saṃgha's quarters according to its type.",
        "source": "T23n1442_013:0695c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經師經師共同、律師律師共同、論師論師共同、法師法師共同、禪師禪師共同。",
        "translation": "Sūtras and sūtra masters shared the same bedding, lawyers and lawyers shared the same bedding, treatise masters and treatise masters shared the same bedding, Dharma masters and Dharma teachers shared the same bedding, and Zen masters and Zen masters shared the same bedding.",
        "source": "T23n1442_013:0695c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼得隨意同住言議無違，所修善品日夜增長，如蓮處池其水充盈見日開發。",
        "translation": "As they will, Peter lives together without disagreement, and the good qualities he cultivates increase day and night, like a lotus in a pond whose water fills up and is seen to develop by the sun.",
        "source": "T23n1442_013:0695c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有諸苾芻半更方至，時實力子以神通力，於一指放光而分臥具。",
        "translation": "When some monks arrived after midnight, the strong man used his supernormal powers to emit a light from one finger and distribute the bedding.",
        "source": "T23n1442_013:0695c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有餘諸苾芻眾，情欲樂見實力子勝上人法神通希有者，故至一更而來投宿，時實力子二指放光為分臥具；有一更半至，三指放光；二更至者，四指放光；半夜至者五指放光與分臥具。",
        "translation": "Still other monks, desiring to see the Pūrṇa's rare ability to overcome the teachings of great men, came to sleep at the first watch of the night, and the Pūrṇa's two fingers radiated light as he distributed the bedding; when he arrived at the half-past the first watch, his three fingers radiated light; when he arrived at the second watch, his four fingers radiated light; and when he arrived at midnight, his five fingers radiated light as he distributed the bedding.",
        "source": "T23n1442_013:0695c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻既見殊勝神通事已，各作是念：「我等不應令大聲聞具威德者為分臥具，而更以脇著床縱意睡眠，是不應作。」",
        "translation": "After they saw the extraordinary miraculous abilities, the monks each thought, \"We shouldn't allow a śrāvaka with authority to share our bedding and then put our arms around the bed and sleep with our minds, for this is something we shouldn't do.\"",
        "source": "T23n1442_013:0695c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼各初夜後夜減省睡眠端思而住，由勤策故未證者皆證，已證者不退。",
        "translation": "Each of them abides calmly and thoughtfully with less sleep during the first and second nights, and because of diligent effort, those who have yet to realize it will realize it, and those who have realized it won't retrogress.",
        "source": "T23n1442_013:0695c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告諸苾芻曰：「諸苾芻！",
        "translation": "It was then that the Bhagavān addressed the monks, \"Monks!",
        "source": "T23n1442_013:0695c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我弟子中分僧臥具，此實力子最為第一。」",
        "translation": "Among my disciples, this one is the best in terms of dividing up the saṃgha's bedding.\"",
        "source": "T23n1442_013:0695c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊聖教既弘廣已，時婆羅門居士為苾芻眾設諸飲食，時六眾苾芻知有美好上妙飲食，即便往彼而噉食之。",
        "translation": "After the Bhagavān's noble teaching had been disseminated, the brāhmaṇa monk prepared some food for the monks, and six of the monks knew there was something beautiful and wonderful to eat, so they went there and devoured it.",
        "source": "T23n1442_013:0695c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸信心婆羅門等作如是語：「聖者！",
        "translation": "The faithful brāhmaṇas and others then said, \"Bhagavān!",
        "source": "T23n1442_013:0695c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德耆宿何意不來？」",
        "translation": "Why didn't the great virtuous elder come?\"",
        "source": "T23n1442_013:0695c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六眾報曰：「如此麁飡彼豈來食。」",
        "translation": "The six groups of people replied, \"How could they eat such a meal?\"",
        "source": "T23n1442_013:0695c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施主報曰：「世尊記我於供養中最為第一，彼諸耆舊寧容不食？",
        "translation": "The donor replied, \"The Bhagavān remembers that I'm the best among offerings, so how could those old people not eat?",
        "source": "T23n1442_013:0696a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖者仁於善說法律之中捨俗出家，不慎口言出無慚語，宜當速去更勿復來。」",
        "translation": "Noble ones who renounce the secular world and leave home amidst well-expounded laws and are careless about what they say and utter without conscience should leave quickly and not come back.\"",
        "source": "T23n1442_013:0696a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻聞是事已便往白佛，佛言：「應差實力子為分食人，若更有如是流類，亦應差遣作分食人。",
        "translation": "After the monks heard this, they went to the Buddha and told him, \"You should send your sons to be meal distributors, and if there are other such people, you should also send them to be meal distributors.",
        "source": "T23n1442_013:0696a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不具五法者即不應差，若差應捨。",
        "translation": "Those who don't have the five qualities shouldn't be sent, and if they are sent, they should be discarded.",
        "source": "T23n1442_013:0696a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T23n1442_013:0696a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有愛、瞋、癡、怖、不知分與不分；翻此應差。",
        "translation": "It means there's craving, anger, delusion, fear, not knowing right from wrong; this is the translation that should be done.",
        "source": "T23n1442_013:0696a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "准前作法如是應差，令一苾芻作白羯磨(廣如百一羯磨中)。」",
        "translation": "According to the preceding teaching, such a distinction should be made, so that one monk makes a white karma (as detailed in the hundred and one karmas).\"",
        "source": "T23n1442_013:0696a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子被眾差為分食人已，彼為僧伽分三種食：謂上、中、下。",
        "translation": "After he was assigned by the crowd to be the distributor of the food, the senior monk distributed three kinds of food for the saṃgha, which were upper, middle, and lower.",
        "source": "T23n1442_013:0696a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有客苾芻初日與上食，第二日與中食，第三日與下食，至第四日令行乞食。",
        "translation": "A guest monk then gave the first day an upper meal, the second day a middle meal, the third day a lower meal, and on the fourth day he was told to beg for food.",
        "source": "T23n1442_013:0696a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子為諸苾芻，若客若主分授房舍及以臥具飲食所須，隨現住者從老至少次第而與曾無虧失。",
        "translation": "The son of Strength then gives the monks, whether guest or host, a room and the necessities of food and drink for their bed and board, according to the order of those who are currently living there, from old age up through young age, without fail.",
        "source": "T23n1442_013:0696a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子與二苾芻：一名善友、二名大地，於生生中常為怨惡，從南國來至王舍城。",
        "translation": "Then, Pūrṇa and two monks, one a good friend and the other a great one, who had been enemies throughout their lives, came from the south to Rājagṛha.",
        "source": "T23n1442_013:0696a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二苾芻問餘苾芻曰：「誰是僧伽知食？」",
        "translation": "The two monks then asked the other monks, \"Who is the food that the saṃgha knows?\"",
        "source": "T23n1442_013:0696a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次者報言：「是具壽實力子。」",
        "translation": "The next one reported, \"This is Pūrṇa Maitrāyaniputra.\"",
        "source": "T23n1442_013:0696a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人詣實力子處，而報之曰：「我等二人隨次與食。」",
        "translation": "Those two then went to Pūrṇa and reported, \"We two will eat according to their order.\"",
        "source": "T23n1442_013:0696a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子於初來日，便與二人上妙食次。",
        "translation": "On the first day he arrived, Pūrṇa responded by giving them two excellent meals.",
        "source": "T23n1442_013:0696a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼施主問曰：「明日誰當至我家食？」",
        "translation": "The donor then asked, \"Who will come to my house tomorrow to eat?\"",
        "source": "T23n1442_013:0696a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「是友、是地。」",
        "translation": "He replied, \"Yes, friend, yes, ground.\"",
        "source": "T23n1442_013:0696a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施主聞已作如是念：「彼二苾芻聞是惡行，若來就食當設隨宜。」",
        "translation": "After hearing this, the donor had this thought, \"Those two monks heard about this bad practice, so if they come for food, they'll make it suitable.\"",
        "source": "T23n1442_013:0696a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至第二日與中食次，施主有事復無好食，至第三日與麁食次。",
        "translation": "On the second day, he gave them a medium meal, but the donor had nothing good to eat again, and on the third day, he gave them a light meal.",
        "source": "T23n1442_013:0696a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人作如是語：「我今極苦。",
        "translation": "Those two then said, \"Now, I'm in extreme pain.",
        "source": "T23n1442_013:0696a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何實力子三日之中故心與我麁惡飲食，共相惱亂令受大苦？",
        "translation": "How could a strong man have given me crude food for three days and therefore disturbed us together, causing us to experience great suffering?",
        "source": "T23n1442_013:0696a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當與彼作無益事。」",
        "translation": "I will do useless deeds with them.\"",
        "source": "T23n1442_013:0696a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼二有妹苾芻尼名曰友女，住王園寺。",
        "translation": "Those two nuns named Younui, who had younger sisters, were staying at the Rājagṛha temple.",
        "source": "T23n1442_013:0696a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時友女往二兄處，至已各禮其足在一面坐。",
        "translation": "Younui then went to her two brothers and when she arrived, she each paid homage to their feet and sat to one side.",
        "source": "T23n1442_013:0696a28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人雖見妹來，不相瞻視亦不共語。",
        "translation": "When they saw their sister coming, they didn't look at each other or talk to each other.",
        "source": "T23n1442_013:0696a29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時友女問二兄曰：「何意二聖見我來至，不相瞻視不共言語？」",
        "translation": "Younui then asked the two brothers, \"Why didn't the two sages look at each other and talk to each other when they saw me coming?\"",
        "source": "T23n1442_013:0696b01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼二答曰：「妹！",
        "translation": "They both replied, \"Sister!",
        "source": "T23n1442_013:0696b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我被實力子乃至三朝與我食次，極是麁惡令我食噉。",
        "translation": "I've been given food by a strong son up to the third morning, and I've been made to eat and gnaw on an extremely harsh basis.",
        "source": "T23n1442_013:0696b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今云何不助於我自安而住？」",
        "translation": "Why don't you help me to stay in peace now?\"",
        "source": "T23n1442_013:0696b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "友女報曰：「聖者！",
        "translation": "A friend's daughter answered, \"Sage!",
        "source": "T23n1442_013:0696b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲何所作？」",
        "translation": "What do I want to do now?\"",
        "source": "T23n1442_013:0696b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：「妹！",
        "translation": "He said, \"Sister!",
        "source": "T23n1442_013:0696b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今宜往詣世尊所作如是白：『大德！",
        "translation": "Now, you should go to the Bhagavān and make this statement, 'Mañjuśrī!",
        "source": "T23n1442_013:0696b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼聖者實力子，作不軌事共我行不淨行，犯波羅市迦。』",
        "translation": "That noble person's strong son did something unbecoming and committed an impure act with me, which was a violation of the prātimokṣa.'",
        "source": "T23n1442_013:0696b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦當往作如是語：『如妹所言其事實爾，我等先知。』」",
        "translation": "I will also go and say something like this, 'As my sister says, this is true, and we've foreseen it.'\"",
        "source": "T23n1442_013:0696b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "友女報曰：「我今云何知彼實是清淨苾芻曾無愆犯，云何輒以無根他勝之法而毀謗之？」",
        "translation": "The friend and daughter replied, \"Now, how do I know that this is really a pure monk who has never transgressed, and how can I so easily denigrate him on the basis of the superiority of others without religious faculties?\"",
        "source": "T23n1442_013:0696b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼二報曰：「乃至汝若不為我等作如是語，我等終不瞻視於汝共為言說。」",
        "translation": "They both replied, \"Even if you don't say this for us, we will never look at you and say it together.\"",
        "source": "T23n1442_013:0696b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時友女聞是語已，俛仰須臾告二兄曰：「我當為作。」",
        "translation": "When she heard these words, she looked up for a moment and said to her brothers, \"I will do it for you.\"",
        "source": "T23n1442_013:0696b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兄言：「妹！",
        "translation": "The brothers said, \"Sister!",
        "source": "T23n1442_013:0696b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝且住此，我等先可至世尊所，汝隨後來。」",
        "translation": "You may stay here while we first go to the Bhagavān's place, and then you may come later.\"",
        "source": "T23n1442_013:0696b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二苾芻往世尊所，禮佛足已在一面坐。",
        "translation": "The two monks then went to the Bhagavān, bowed their heads at the Buddha's feet, and sat down at one side.",
        "source": "T23n1442_013:0696b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼友女斟酌兄至，便詣佛所禮已而立，白世尊曰：「大德！",
        "translation": "When their elder brother arrived, she went to the Buddha, paid homage to him, stood up, and said to the Bhagavān, \"Mañjuśrī!",
        "source": "T23n1442_013:0696b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼聖者實力子，作不軌事共我行不淨行，犯波羅市迦。」",
        "translation": "That disciple of the noble one's family did something unruly and performed an impure act with me, which was a violation of the precepts at Bārājika.\"",
        "source": "T23n1442_013:0696b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時友地苾芻即便白佛：「實爾。",
        "translation": "The Youti monk then said to the Buddha, \"That's true.",
        "source": "T23n1442_013:0696b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薄伽梵！",
        "translation": "Bhagavān!",
        "source": "T23n1442_013:0696b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實爾。",
        "translation": "(Skt. svastika)",
        "source": "T23n1442_013:0696b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蘇揭多！",
        "translation": "(Skt. sugata)!",
        "source": "T23n1442_013:0696b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如妹所說我等先知。」",
        "translation": "As my sister said, we were seers.\"",
        "source": "T23n1442_013:0696b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時實力子亦復在此大眾中住。",
        "translation": "The son of Strength then also stayed here in the large crowd.",
        "source": "T23n1442_013:0696b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶卷第十三",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 13",
        "source": "T23n1442_013:0696b22_0",
        "is_bad_quality": false
    }
]